; ModuleID = 'fnpovfpu.cpp'
source_filename = "fnpovfpu.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"struct.pov::Opcode" = type { i8*, i32, i32 }
%"struct.pov::FunctionEntry_Struct" = type { %"struct.pov::FunctionCode", i32 }
%"struct.pov::FunctionCode" = type { i32*, i32, i8, i8, i8, [56 x i32], [56 x i8*], [56 x i8*], i8*, i8*, %"struct.pov_base::ITextStream::FilePos", i32, i8* (i8*)*, void (i8*)*, i8* }
%"struct.pov_base::ITextStream::FilePos" = type { i64, i32 }
%"struct.pov::FPUContext_Struct" = type { %"struct.pov::FPUContext_Struct"*, %"struct.pov::StackFrame_Struct"*, double*, i32 }
%"struct.pov::StackFrame_Struct" = type { i32, i32 }
%"struct.pov::Trap" = type { double (double*, i32)*, i32 }
%"struct.pov::TrapS" = type { void (double*, i32, i32)*, i32 }

$_ZSt3maxIjERKT_S2_S2_ = comdat any

$_ZN3pov16Increase_CounterERx = comdat any

@.str = private unnamed_addr constant [4 x i8] c"add\00", align 1
@.str.1 = private unnamed_addr constant [4 x i8] c"sub\00", align 1
@.str.2 = private unnamed_addr constant [4 x i8] c"mul\00", align 1
@.str.3 = private unnamed_addr constant [4 x i8] c"div\00", align 1
@.str.4 = private unnamed_addr constant [4 x i8] c"mod\00", align 1
@.str.5 = private unnamed_addr constant [5 x i8] c"move\00", align 1
@.str.6 = private unnamed_addr constant [4 x i8] c"cmp\00", align 1
@.str.7 = private unnamed_addr constant [4 x i8] c"neg\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "POVFPU_Opcodes", linkageName: "_ZN3pov14POVFPU_OpcodesE", scope: !2, file: !3, line: 402, type: !4, isLocal: false, isDefinition: true)
!2 = !DINamespace(name: "pov", scope: null)
!3 = !DIFile(filename: "fnpovfpu.cpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 6656, elements: !18)
!5 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "Opcode", scope: !2, file: !7, line: 62, baseType: !8)
!7 = !DIFile(filename: "./fnpovfpu.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!8 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !2, file: !7, line: 53, size: 128, flags: DIFlagTypePassByValue, elements: !9, identifier: "_ZTSN3pov6OpcodeE")
!9 = !{!10, !14, !16}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !8, file: !7, line: 58, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!13 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !8, file: !7, line: 60, baseType: !15, size: 32, offset: 64)
!15 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !8, file: !7, line: 61, baseType: !17, size: 32, offset: 96)
!17 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!18 = !{!19}
!19 = !DISubrange(count: 52)
!20 = !DIGlobalVariableExpression(var: !21, expr: !DIExpression())
!21 = distinct !DIGlobalVariable(name: "POVFPU_Sys1Table", linkageName: "_ZN3pov16POVFPU_Sys1TableE", scope: !2, file: !3, line: 458, type: !22, isLocal: false, isDefinition: true)
!22 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 1280, elements: !29)
!23 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sys1", scope: !2, file: !7, line: 95, baseType: !25)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DISubroutineType(types: !27)
!27 = !{!28, !28}
!28 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!29 = !{!30}
!30 = !DISubrange(count: 20)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "POVFPU_Sys2Table", linkageName: "_ZN3pov16POVFPU_Sys2TableE", scope: !2, file: !3, line: 482, type: !33, isLocal: false, isDefinition: true)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 320, elements: !39)
!34 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sys2", scope: !2, file: !7, line: 96, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{!28, !28, !28}
!39 = !{!40}
!40 = !DISubrange(count: 5)
!41 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression())
!42 = distinct !DIGlobalVariable(name: "POVFPU_Sys1TableSize", linkageName: "_ZN3pov20POVFPU_Sys1TableSizeE", scope: !2, file: !3, line: 492, type: !43, isLocal: false, isDefinition: true)
!43 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "POVFPU_Sys2TableSize", linkageName: "_ZN3pov20POVFPU_Sys2TableSizeE", scope: !2, file: !3, line: 493, type: !43, isLocal: false, isDefinition: true)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "POVFPU_Globals", linkageName: "_ZN3pov14POVFPU_GlobalsE", scope: !2, file: !3, line: 495, type: !48, isLocal: false, isDefinition: true)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(name: "POVFPU_Consts", linkageName: "_ZN3pov13POVFPU_ConstsE", scope: !2, file: !3, line: 496, type: !48, isLocal: false, isDefinition: true)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "POVFPU_GlobalCnt", linkageName: "_ZN3pov16POVFPU_GlobalCntE", scope: !2, file: !3, line: 497, type: !15, isLocal: false, isDefinition: true)
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression())
!54 = distinct !DIGlobalVariable(name: "POVFPU_ConstCnt", linkageName: "_ZN3pov15POVFPU_ConstCntE", scope: !2, file: !3, line: 498, type: !15, isLocal: false, isDefinition: true)
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(name: "POVFPU_Functions", linkageName: "_ZN3pov16POVFPU_FunctionsE", scope: !2, file: !3, line: 500, type: !57, isLocal: false, isDefinition: true)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "FunctionEntry", scope: !2, file: !7, line: 105, baseType: !59)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionEntry_Struct", scope: !2, file: !7, line: 100, size: 9664, flags: DIFlagTypePassByValue, elements: !60, identifier: "_ZTSN3pov20FunctionEntry_StructE")
!60 = !{!61, !106}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !59, file: !7, line: 102, baseType: !62, size: 9600)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "FunctionCode", scope: !2, file: !63, line: 86, baseType: !64)
!63 = !DIFile(filename: "./fncode.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !2, file: !63, line: 69, size: 9600, flags: DIFlagTypePassByValue, elements: !65, identifier: "_ZTSN3pov12FunctionCodeE")
!65 = !{!66, !69, !70, !72, !73, !74, !78, !81, !82, !83, !84, !93, !94, !100, !105}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !64, file: !63, line: 71, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "Instruction", scope: !2, file: !63, line: 67, baseType: !15)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "program_size", scope: !64, file: !63, line: 72, baseType: !15, size: 32, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "return_size", scope: !64, file: !63, line: 73, baseType: !71, size: 8, offset: 96)
!71 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "parameter_cnt", scope: !64, file: !63, line: 74, baseType: !71, size: 8, offset: 104)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "localvar_cnt", scope: !64, file: !63, line: 75, baseType: !71, size: 8, offset: 112)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "localvar_pos", scope: !64, file: !63, line: 76, baseType: !75, size: 1792, offset: 128)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 1792, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 56)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "localvar", scope: !64, file: !63, line: 77, baseType: !79, size: 3584, offset: 1920)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 3584, elements: !76)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "parameter", scope: !64, file: !63, line: 78, baseType: !79, size: 3584, offset: 5504)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !64, file: !63, line: 79, baseType: !80, size: 64, offset: 9088)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !64, file: !63, line: 80, baseType: !80, size: 64, offset: 9152)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "filepos", scope: !64, file: !63, line: 81, baseType: !85, size: 128, offset: 9216)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FilePos", scope: !87, file: !86, line: 57, size: 128, flags: DIFlagTypePassByValue, elements: !89, identifier: "_ZTSN8pov_base11ITextStream7FilePosE")
!86 = !DIFile(filename: "base/textstream.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!87 = !DICompositeType(tag: DW_TAG_class_type, name: "ITextStream", scope: !88, file: !86, line: 54, flags: DIFlagFwdDecl)
!88 = !DINamespace(name: "pov_base", scope: null)
!89 = !{!90, !92}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !85, file: !86, line: 59, baseType: !91, size: 64)
!91 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", scope: !85, file: !86, line: 60, baseType: !17, size: 32, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !64, file: !63, line: 82, baseType: !15, size: 32, offset: 9344)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "private_copy_method", scope: !64, file: !63, line: 83, baseType: !95, size: 64, offset: 9408)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "FNCODE_PRIVATE_COPY_METHOD", scope: !2, file: !63, line: 64, baseType: !96)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{!99, !99}
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "private_destroy_method", scope: !64, file: !63, line: 84, baseType: !101, size: 64, offset: 9472)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "FNCODE_PRIVATE_DESTROY_METHOD", scope: !2, file: !63, line: 65, baseType: !102)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{null, !99}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "private_data", scope: !64, file: !63, line: 85, baseType: !99, size: 64, offset: 9536)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !59, file: !7, line: 103, baseType: !15, size: 32, offset: 9600)
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(name: "POVFPU_FunctionCnt", linkageName: "_ZN3pov18POVFPU_FunctionCntE", scope: !2, file: !3, line: 501, type: !15, isLocal: false, isDefinition: true)
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "POVFPU_Context_Root", linkageName: "_ZN3pov19POVFPU_Context_RootE", scope: !2, file: !3, line: 503, type: !111, isLocal: false, isDefinition: true)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "FPUContext", scope: !2, file: !7, line: 126, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FPUContext_Struct", scope: !2, file: !7, line: 117, size: 256, flags: DIFlagTypePassByValue, elements: !114, identifier: "_ZTSN3pov17FPUContext_StructE")
!114 = !{!115, !117, !126, !127}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !113, file: !7, line: 119, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "pstackbase", scope: !113, file: !7, line: 120, baseType: !118, size: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "StackFrame", scope: !2, file: !7, line: 113, baseType: !120)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StackFrame_Struct", scope: !2, file: !7, line: 109, size: 64, flags: DIFlagTypePassByValue, elements: !121, identifier: "_ZTSN3pov17StackFrame_StructE")
!121 = !{!122, !123}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !120, file: !7, line: 111, baseType: !15, size: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !120, file: !7, line: 112, baseType: !124, size: 32, offset: 32)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNCTION", scope: !2, file: !125, line: 40, baseType: !15)
!125 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!126 = !DIDerivedType(tag: DW_TAG_member, name: "dblstackbase", scope: !113, file: !7, line: 121, baseType: !48, size: 64, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "maxdblstacksize", scope: !113, file: !7, line: 122, baseType: !15, size: 32, offset: 192)
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(name: "POVFPU_Current_Context", linkageName: "_ZN3pov22POVFPU_Current_ContextE", scope: !2, file: !3, line: 504, type: !111, isLocal: false, isDefinition: true)
!130 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !131, retainedTypes: !259, globals: !260, imports: !261, splitDebugInlining: false, nameTableKind: None)
!131 = !{!132}
!132 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "STATS", scope: !2, file: !133, line: 149, baseType: !15, size: 32, elements: !134, identifier: "_ZTSN3pov5STATSE")
!133 = !DIFile(filename: "./povray.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!134 = !{!135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258}
!135 = !DIEnumerator(name: "Number_Of_Pixels", value: 0, isUnsigned: true)
!136 = !DIEnumerator(name: "Number_Of_Pixels_Supersampled", value: 1, isUnsigned: true)
!137 = !DIEnumerator(name: "Number_Of_Samples", value: 2, isUnsigned: true)
!138 = !DIEnumerator(name: "Number_Of_Rays", value: 3, isUnsigned: true)
!139 = !DIEnumerator(name: "Calls_To_DNoise", value: 4, isUnsigned: true)
!140 = !DIEnumerator(name: "Calls_To_Noise", value: 5, isUnsigned: true)
!141 = !DIEnumerator(name: "ADC_Saves", value: 6, isUnsigned: true)
!142 = !DIEnumerator(name: "Istack_overflows", value: 7, isUnsigned: true)
!143 = !DIEnumerator(name: "Ray_RBezier_Tests", value: 8, isUnsigned: true)
!144 = !DIEnumerator(name: "Ray_RBezier_Tests_Succeeded", value: 9, isUnsigned: true)
!145 = !DIEnumerator(name: "Ray_Bicubic_Tests", value: 10, isUnsigned: true)
!146 = !DIEnumerator(name: "Ray_Bicubic_Tests_Succeeded", value: 11, isUnsigned: true)
!147 = !DIEnumerator(name: "Ray_Blob_Tests", value: 12, isUnsigned: true)
!148 = !DIEnumerator(name: "Ray_Blob_Tests_Succeeded", value: 13, isUnsigned: true)
!149 = !DIEnumerator(name: "Blob_Element_Tests", value: 14, isUnsigned: true)
!150 = !DIEnumerator(name: "Blob_Element_Tests_Succeeded", value: 15, isUnsigned: true)
!151 = !DIEnumerator(name: "Blob_Bound_Tests", value: 16, isUnsigned: true)
!152 = !DIEnumerator(name: "Blob_Bound_Tests_Succeeded", value: 17, isUnsigned: true)
!153 = !DIEnumerator(name: "Ray_Box_Tests", value: 18, isUnsigned: true)
!154 = !DIEnumerator(name: "Ray_Box_Tests_Succeeded", value: 19, isUnsigned: true)
!155 = !DIEnumerator(name: "Ray_Cone_Tests", value: 20, isUnsigned: true)
!156 = !DIEnumerator(name: "Ray_Cone_Tests_Succeeded", value: 21, isUnsigned: true)
!157 = !DIEnumerator(name: "Ray_CSG_Intersection_Tests", value: 22, isUnsigned: true)
!158 = !DIEnumerator(name: "Ray_CSG_Intersection_Tests_Succeeded", value: 23, isUnsigned: true)
!159 = !DIEnumerator(name: "Ray_CSG_Merge_Tests", value: 24, isUnsigned: true)
!160 = !DIEnumerator(name: "Ray_CSG_Merge_Tests_Succeeded", value: 25, isUnsigned: true)
!161 = !DIEnumerator(name: "Ray_CSG_Union_Tests", value: 26, isUnsigned: true)
!162 = !DIEnumerator(name: "Ray_CSG_Union_Tests_Succeeded", value: 27, isUnsigned: true)
!163 = !DIEnumerator(name: "Ray_Disc_Tests", value: 28, isUnsigned: true)
!164 = !DIEnumerator(name: "Ray_Disc_Tests_Succeeded", value: 29, isUnsigned: true)
!165 = !DIEnumerator(name: "Ray_Fractal_Tests", value: 30, isUnsigned: true)
!166 = !DIEnumerator(name: "Ray_Fractal_Tests_Succeeded", value: 31, isUnsigned: true)
!167 = !DIEnumerator(name: "Ray_HField_Tests", value: 32, isUnsigned: true)
!168 = !DIEnumerator(name: "Ray_HField_Tests_Succeeded", value: 33, isUnsigned: true)
!169 = !DIEnumerator(name: "Ray_HField_Box_Tests", value: 34, isUnsigned: true)
!170 = !DIEnumerator(name: "Ray_HField_Box_Tests_Succeeded", value: 35, isUnsigned: true)
!171 = !DIEnumerator(name: "Ray_HField_Triangle_Tests", value: 36, isUnsigned: true)
!172 = !DIEnumerator(name: "Ray_HField_Triangle_Tests_Succeeded", value: 37, isUnsigned: true)
!173 = !DIEnumerator(name: "Ray_HField_Block_Tests", value: 38, isUnsigned: true)
!174 = !DIEnumerator(name: "Ray_HField_Block_Tests_Succeeded", value: 39, isUnsigned: true)
!175 = !DIEnumerator(name: "Ray_HField_Cell_Tests", value: 40, isUnsigned: true)
!176 = !DIEnumerator(name: "Ray_HField_Cell_Tests_Succeeded", value: 41, isUnsigned: true)
!177 = !DIEnumerator(name: "Ray_IsoSurface_Tests", value: 42, isUnsigned: true)
!178 = !DIEnumerator(name: "Ray_IsoSurface_Tests_Succeeded", value: 43, isUnsigned: true)
!179 = !DIEnumerator(name: "Ray_IsoSurface_Bound_Tests", value: 44, isUnsigned: true)
!180 = !DIEnumerator(name: "Ray_IsoSurface_Bound_Tests_Succeeded", value: 45, isUnsigned: true)
!181 = !DIEnumerator(name: "Ray_IsoSurface_Cache", value: 46, isUnsigned: true)
!182 = !DIEnumerator(name: "Ray_IsoSurface_Cache_Succeeded", value: 47, isUnsigned: true)
!183 = !DIEnumerator(name: "Ray_Lathe_Tests", value: 48, isUnsigned: true)
!184 = !DIEnumerator(name: "Ray_Lathe_Tests_Succeeded", value: 49, isUnsigned: true)
!185 = !DIEnumerator(name: "Lathe_Bound_Tests", value: 50, isUnsigned: true)
!186 = !DIEnumerator(name: "Lathe_Bound_Tests_Succeeded", value: 51, isUnsigned: true)
!187 = !DIEnumerator(name: "Ray_Mesh_Tests", value: 52, isUnsigned: true)
!188 = !DIEnumerator(name: "Ray_Mesh_Tests_Succeeded", value: 53, isUnsigned: true)
!189 = !DIEnumerator(name: "Ray_Plane_Tests", value: 54, isUnsigned: true)
!190 = !DIEnumerator(name: "Ray_Plane_Tests_Succeeded", value: 55, isUnsigned: true)
!191 = !DIEnumerator(name: "Ray_Polygon_Tests", value: 56, isUnsigned: true)
!192 = !DIEnumerator(name: "Ray_Polygon_Tests_Succeeded", value: 57, isUnsigned: true)
!193 = !DIEnumerator(name: "Ray_Prism_Tests", value: 58, isUnsigned: true)
!194 = !DIEnumerator(name: "Ray_Prism_Tests_Succeeded", value: 59, isUnsigned: true)
!195 = !DIEnumerator(name: "Prism_Bound_Tests", value: 60, isUnsigned: true)
!196 = !DIEnumerator(name: "Prism_Bound_Tests_Succeeded", value: 61, isUnsigned: true)
!197 = !DIEnumerator(name: "Ray_Parametric_Tests", value: 62, isUnsigned: true)
!198 = !DIEnumerator(name: "Ray_Parametric_Tests_Succeeded", value: 63, isUnsigned: true)
!199 = !DIEnumerator(name: "Ray_Par_Bound_Tests", value: 64, isUnsigned: true)
!200 = !DIEnumerator(name: "Ray_Par_Bound_Tests_Succeeded", value: 65, isUnsigned: true)
!201 = !DIEnumerator(name: "Ray_Quadric_Tests", value: 66, isUnsigned: true)
!202 = !DIEnumerator(name: "Ray_Quadric_Tests_Succeeded", value: 67, isUnsigned: true)
!203 = !DIEnumerator(name: "Ray_Poly_Tests", value: 68, isUnsigned: true)
!204 = !DIEnumerator(name: "Ray_Poly_Tests_Succeeded", value: 69, isUnsigned: true)
!205 = !DIEnumerator(name: "Ray_Sphere_Tests", value: 70, isUnsigned: true)
!206 = !DIEnumerator(name: "Ray_Sphere_Tests_Succeeded", value: 71, isUnsigned: true)
!207 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests", value: 72, isUnsigned: true)
!208 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests_Succeeded", value: 73, isUnsigned: true)
!209 = !DIEnumerator(name: "Ray_Superellipsoid_Tests", value: 74, isUnsigned: true)
!210 = !DIEnumerator(name: "Ray_Superellipsoid_Tests_Succeeded", value: 75, isUnsigned: true)
!211 = !DIEnumerator(name: "Ray_Sor_Tests", value: 76, isUnsigned: true)
!212 = !DIEnumerator(name: "Ray_Sor_Tests_Succeeded", value: 77, isUnsigned: true)
!213 = !DIEnumerator(name: "Sor_Bound_Tests", value: 78, isUnsigned: true)
!214 = !DIEnumerator(name: "Sor_Bound_Tests_Succeeded", value: 79, isUnsigned: true)
!215 = !DIEnumerator(name: "Ray_Torus_Tests", value: 80, isUnsigned: true)
!216 = !DIEnumerator(name: "Ray_Torus_Tests_Succeeded", value: 81, isUnsigned: true)
!217 = !DIEnumerator(name: "Torus_Bound_Tests", value: 82, isUnsigned: true)
!218 = !DIEnumerator(name: "Torus_Bound_Tests_Succeeded", value: 83, isUnsigned: true)
!219 = !DIEnumerator(name: "Ray_Triangle_Tests", value: 84, isUnsigned: true)
!220 = !DIEnumerator(name: "Ray_Triangle_Tests_Succeeded", value: 85, isUnsigned: true)
!221 = !DIEnumerator(name: "Ray_TTF_Tests", value: 86, isUnsigned: true)
!222 = !DIEnumerator(name: "Ray_TTF_Tests_Succeeded", value: 87, isUnsigned: true)
!223 = !DIEnumerator(name: "Bounding_Region_Tests", value: 88, isUnsigned: true)
!224 = !DIEnumerator(name: "Bounding_Region_Tests_Succeeded", value: 89, isUnsigned: true)
!225 = !DIEnumerator(name: "Clipping_Region_Tests", value: 90, isUnsigned: true)
!226 = !DIEnumerator(name: "Clipping_Region_Tests_Succeeded", value: 91, isUnsigned: true)
!227 = !DIEnumerator(name: "Ray_IsoSurface_Find_Root", value: 92, isUnsigned: true)
!228 = !DIEnumerator(name: "Ray_Function_VM_Calls", value: 93, isUnsigned: true)
!229 = !DIEnumerator(name: "Ray_Function_VM_Instruction_Est", value: 94, isUnsigned: true)
!230 = !DIEnumerator(name: "VBuffer_Tests", value: 95, isUnsigned: true)
!231 = !DIEnumerator(name: "VBuffer_Tests_Succeeded", value: 96, isUnsigned: true)
!232 = !DIEnumerator(name: "LBuffer_Tests", value: 97, isUnsigned: true)
!233 = !DIEnumerator(name: "LBuffer_Tests_Succeeded", value: 98, isUnsigned: true)
!234 = !DIEnumerator(name: "Media_Samples", value: 99, isUnsigned: true)
!235 = !DIEnumerator(name: "Media_Intervals", value: 100, isUnsigned: true)
!236 = !DIEnumerator(name: "Reflected_Rays_Traced", value: 101, isUnsigned: true)
!237 = !DIEnumerator(name: "Refracted_Rays_Traced", value: 102, isUnsigned: true)
!238 = !DIEnumerator(name: "Transmitted_Rays_Traced", value: 103, isUnsigned: true)
!239 = !DIEnumerator(name: "Internal_Reflected_Rays_Traced", value: 104, isUnsigned: true)
!240 = !DIEnumerator(name: "Shadow_Cache_Hits", value: 105, isUnsigned: true)
!241 = !DIEnumerator(name: "Shadow_Rays_Succeeded", value: 106, isUnsigned: true)
!242 = !DIEnumerator(name: "Shadow_Ray_Tests", value: 107, isUnsigned: true)
!243 = !DIEnumerator(name: "nChecked", value: 108, isUnsigned: true)
!244 = !DIEnumerator(name: "nEnqueued", value: 109, isUnsigned: true)
!245 = !DIEnumerator(name: "totalQueues", value: 110, isUnsigned: true)
!246 = !DIEnumerator(name: "totalQueueResets", value: 111, isUnsigned: true)
!247 = !DIEnumerator(name: "totalQueueResizes", value: 112, isUnsigned: true)
!248 = !DIEnumerator(name: "Polynomials_Tested", value: 113, isUnsigned: true)
!249 = !DIEnumerator(name: "Roots_Eliminated", value: 114, isUnsigned: true)
!250 = !DIEnumerator(name: "Number_Of_Photons_Shot", value: 115, isUnsigned: true)
!251 = !DIEnumerator(name: "Number_Of_Photons_Stored", value: 116, isUnsigned: true)
!252 = !DIEnumerator(name: "Number_Of_Global_Photons_Stored", value: 117, isUnsigned: true)
!253 = !DIEnumerator(name: "Number_Of_Media_Photons_Stored", value: 118, isUnsigned: true)
!254 = !DIEnumerator(name: "Priority_Queue_Add", value: 119, isUnsigned: true)
!255 = !DIEnumerator(name: "Priority_Queue_Remove", value: 120, isUnsigned: true)
!256 = !DIEnumerator(name: "Gather_Performed_Count", value: 121, isUnsigned: true)
!257 = !DIEnumerator(name: "Gather_Expanded_Count", value: 122, isUnsigned: true)
!258 = !DIEnumerator(name: "MaxStat", value: 123, isUnsigned: true)
!259 = !{!28, !17, !99, !48, !15, !57, !111, !118}
!260 = !{!0, !20, !31, !41, !44, !46, !49, !51, !53, !55, !107, !109, !128}
!261 = !{!262, !269, !273, !280, !284, !289, !291, !295, !299, !303, !315, !319, !323, !327, !329, !333, !337, !341, !345, !349, !357, !361, !365, !367, !371, !375, !379, !385, !389, !393, !395, !403, !407, !415, !417, !421, !425, !429, !433, !438, !443, !448, !449, !450, !451, !453, !454, !455, !456, !457, !458, !459, !461, !462, !463, !464, !465, !466, !467, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !500, !502, !504, !506, !508, !510, !512, !514, !516, !518, !520, !525, !529, !531, !533, !537, !539, !541, !543, !545, !547, !549, !552, !554, !556, !560, !564, !566, !568, !570, !572, !574, !576, !578, !580, !582, !584, !588, !592, !594, !596, !598, !600, !602, !604, !606, !608, !610, !612, !614, !616, !618, !620, !622, !626, !630, !634, !636, !638, !640, !642, !644, !646, !648, !650, !652, !656, !660, !664, !666, !668, !670, !674, !678, !682, !684, !686, !688, !690, !692, !694, !696, !698, !700, !702, !704, !706, !710, !714, !718, !720, !722, !724, !726, !730, !734, !736, !738, !740, !742, !744, !746, !750, !754, !756, !758, !760, !762, !766, !770, !774, !776, !778, !780, !782, !784, !786, !790, !794, !798, !800, !804, !808, !810, !812, !814, !816, !818, !820, !822, !827, !831, !887, !891, !895, !897, !899, !901, !903, !905, !907, !909, !911, !913, !915, !917, !919, !921, !927, !931, !937, !941, !945, !949, !953, !955, !957, !961, !965, !969, !973, !977, !979, !981, !983, !987, !991, !995, !997, !999, !1001, !1003, !1005, !1007, !1009, !1011, !1013, !1015, !1017, !1019, !1021, !1023, !1025, !1026, !1027, !1028, !1029, !1031, !1033, !1039, !1045, !1050, !1054, !1056, !1058, !1060, !1062, !1069, !1073, !1077, !1081, !1085, !1089, !1093, !1097, !1099, !1103, !1109, !1113, !1117, !1119, !1121, !1125, !1129, !1131, !1133, !1135, !1137, !1139, !1141, !1143, !1147, !1151, !1155, !1159, !1163, !1167, !1169, !1175, !1179, !1183, !1187, !1189, !1191, !1195, !1199, !1200, !1201, !1202, !1203, !1204, !1206, !1207, !1209, !1211, !1212, !1213, !1214, !1216, !1218}
!262 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !263, entity: !264, file: !268, line: 52)
!263 = !DINamespace(name: "std", scope: null)
!264 = !DISubprogram(name: "abs", scope: !265, file: !265, line: 840, type: !266, flags: DIFlagPrototyped, spFlags: 0)
!265 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!266 = !DISubroutineType(types: !267)
!267 = !{!17, !17}
!268 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/std_abs.h", directory: "")
!269 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !263, entity: !270, file: !272, line: 127)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !265, line: 62, baseType: !271)
!271 = !DICompositeType(tag: DW_TAG_structure_type, file: !265, line: 58, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!272 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cstdlib", directory: "")
!273 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !263, entity: !274, file: !272, line: 128)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !265, line: 70, baseType: !275)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !265, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !276, identifier: "_ZTS6ldiv_t")
!276 = !{!277, !279}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !275, file: !265, line: 68, baseType: !278, size: 64)
!278 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !275, file: !265, line: 69, baseType: !278, size: 64, offset: 64)
!280 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !263, entity: !281, file: !272, line: 130)
!281 = !DISubprogram(name: "abort", scope: !265, file: !265, line: 591, type: !282, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!282 = !DISubroutineType(types: !283)
!283 = !{null}
!284 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !263, entity: !285, file: !272, line: 134)
!285 = !DISubprogram(name: "atexit", scope: !265, file: !265, line: 595, type: !286, flags: DIFlagPrototyped, spFlags: 0)
!286 = !DISubroutineType(types: !287)
!287 = !{!17, !288}
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!289 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !263, entity: !290, file: !272, line: 137)
!290 = !DISubprogram(name: "at_quick_exit", scope: !265, file: !265, line: 600, type: !286, flags: DIFlagPrototyped, spFlags: 0)
!291 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !263, entity: !292, file: !272, line: 140)
!292 = !DISubprogram(name: "atof", scope: !265, file: !265, line: 101, type: !293, flags: DIFlagPrototyped, spFlags: 0)
!293 = !DISubroutineType(types: !294)
!294 = !{!28, !11}
!295 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !263, entity: !296, file: !272, line: 141)
!296 = !DISubprogram(name: "atoi", scope: !265, file: !265, line: 104, type: !297, flags: DIFlagPrototyped, spFlags: 0)
!297 = !DISubroutineType(types: !298)
!298 = !{!17, !11}
!299 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !263, entity: !300, file: !272, line: 142)
!300 = !DISubprogram(name: "atol", scope: !265, file: !265, line: 107, type: !301, flags: DIFlagPrototyped, spFlags: 0)
!301 = !DISubroutineType(types: !302)
!302 = !{!278, !11}
!303 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !263, entity: !304, file: !272, line: 143)
!304 = !DISubprogram(name: "bsearch", scope: !265, file: !265, line: 820, type: !305, flags: DIFlagPrototyped, spFlags: 0)
!305 = !DISubroutineType(types: !306)
!306 = !{!99, !307, !307, !309, !309, !311}
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !310, line: 46, baseType: !91)
!310 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !265, line: 808, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{!17, !307, !307}
!315 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !263, entity: !316, file: !272, line: 144)
!316 = !DISubprogram(name: "calloc", scope: !265, file: !265, line: 542, type: !317, flags: DIFlagPrototyped, spFlags: 0)
!317 = !DISubroutineType(types: !318)
!318 = !{!99, !309, !309}
!319 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !263, entity: !320, file: !272, line: 145)
!320 = !DISubprogram(name: "div", scope: !265, file: !265, line: 852, type: !321, flags: DIFlagPrototyped, spFlags: 0)
!321 = !DISubroutineType(types: !322)
!322 = !{!270, !17, !17}
!323 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !263, entity: !324, file: !272, line: 146)
!324 = !DISubprogram(name: "exit", scope: !265, file: !265, line: 617, type: !325, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!325 = !DISubroutineType(types: !326)
!326 = !{null, !17}
!327 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !263, entity: !328, file: !272, line: 147)
!328 = !DISubprogram(name: "free", scope: !265, file: !265, line: 565, type: !103, flags: DIFlagPrototyped, spFlags: 0)
!329 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !263, entity: !330, file: !272, line: 148)
!330 = !DISubprogram(name: "getenv", scope: !265, file: !265, line: 634, type: !331, flags: DIFlagPrototyped, spFlags: 0)
!331 = !DISubroutineType(types: !332)
!332 = !{!80, !11}
!333 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !263, entity: !334, file: !272, line: 149)
!334 = !DISubprogram(name: "labs", scope: !265, file: !265, line: 841, type: !335, flags: DIFlagPrototyped, spFlags: 0)
!335 = !DISubroutineType(types: !336)
!336 = !{!278, !278}
!337 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !263, entity: !338, file: !272, line: 150)
!338 = !DISubprogram(name: "ldiv", scope: !265, file: !265, line: 854, type: !339, flags: DIFlagPrototyped, spFlags: 0)
!339 = !DISubroutineType(types: !340)
!340 = !{!274, !278, !278}
!341 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !263, entity: !342, file: !272, line: 151)
!342 = !DISubprogram(name: "malloc", scope: !265, file: !265, line: 539, type: !343, flags: DIFlagPrototyped, spFlags: 0)
!343 = !DISubroutineType(types: !344)
!344 = !{!99, !309}
!345 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !263, entity: !346, file: !272, line: 153)
!346 = !DISubprogram(name: "mblen", scope: !265, file: !265, line: 922, type: !347, flags: DIFlagPrototyped, spFlags: 0)
!347 = !DISubroutineType(types: !348)
!348 = !{!17, !11, !309}
!349 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !263, entity: !350, file: !272, line: 154)
!350 = !DISubprogram(name: "mbstowcs", scope: !265, file: !265, line: 933, type: !351, flags: DIFlagPrototyped, spFlags: 0)
!351 = !DISubroutineType(types: !352)
!352 = !{!309, !353, !356, !309}
!353 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !354)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!356 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !11)
!357 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !263, entity: !358, file: !272, line: 155)
!358 = !DISubprogram(name: "mbtowc", scope: !265, file: !265, line: 925, type: !359, flags: DIFlagPrototyped, spFlags: 0)
!359 = !DISubroutineType(types: !360)
!360 = !{!17, !353, !356, !309}
!361 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !263, entity: !362, file: !272, line: 157)
!362 = !DISubprogram(name: "qsort", scope: !265, file: !265, line: 830, type: !363, flags: DIFlagPrototyped, spFlags: 0)
!363 = !DISubroutineType(types: !364)
!364 = !{null, !99, !309, !309, !311}
!365 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !263, entity: !366, file: !272, line: 160)
!366 = !DISubprogram(name: "quick_exit", scope: !265, file: !265, line: 623, type: !325, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!367 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !263, entity: !368, file: !272, line: 163)
!368 = !DISubprogram(name: "rand", scope: !265, file: !265, line: 453, type: !369, flags: DIFlagPrototyped, spFlags: 0)
!369 = !DISubroutineType(types: !370)
!370 = !{!17}
!371 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !263, entity: !372, file: !272, line: 164)
!372 = !DISubprogram(name: "realloc", scope: !265, file: !265, line: 550, type: !373, flags: DIFlagPrototyped, spFlags: 0)
!373 = !DISubroutineType(types: !374)
!374 = !{!99, !99, !309}
!375 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !263, entity: !376, file: !272, line: 165)
!376 = !DISubprogram(name: "srand", scope: !265, file: !265, line: 455, type: !377, flags: DIFlagPrototyped, spFlags: 0)
!377 = !DISubroutineType(types: !378)
!378 = !{null, !15}
!379 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !263, entity: !380, file: !272, line: 166)
!380 = !DISubprogram(name: "strtod", scope: !265, file: !265, line: 117, type: !381, flags: DIFlagPrototyped, spFlags: 0)
!381 = !DISubroutineType(types: !382)
!382 = !{!28, !356, !383}
!383 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !384)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!385 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !263, entity: !386, file: !272, line: 167)
!386 = !DISubprogram(name: "strtol", scope: !265, file: !265, line: 176, type: !387, flags: DIFlagPrototyped, spFlags: 0)
!387 = !DISubroutineType(types: !388)
!388 = !{!278, !356, !383, !17}
!389 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !263, entity: !390, file: !272, line: 168)
!390 = !DISubprogram(name: "strtoul", scope: !265, file: !265, line: 180, type: !391, flags: DIFlagPrototyped, spFlags: 0)
!391 = !DISubroutineType(types: !392)
!392 = !{!91, !356, !383, !17}
!393 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !263, entity: !394, file: !272, line: 169)
!394 = !DISubprogram(name: "system", scope: !265, file: !265, line: 784, type: !297, flags: DIFlagPrototyped, spFlags: 0)
!395 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !263, entity: !396, file: !272, line: 171)
!396 = !DISubprogram(name: "wcstombs", scope: !265, file: !265, line: 936, type: !397, flags: DIFlagPrototyped, spFlags: 0)
!397 = !DISubroutineType(types: !398)
!398 = !{!309, !399, !400, !309}
!399 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !80)
!400 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !401)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !355)
!403 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !263, entity: !404, file: !272, line: 172)
!404 = !DISubprogram(name: "wctomb", scope: !265, file: !265, line: 929, type: !405, flags: DIFlagPrototyped, spFlags: 0)
!405 = !DISubroutineType(types: !406)
!406 = !{!17, !80, !355}
!407 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !408, entity: !409, file: !272, line: 200)
!408 = !DINamespace(name: "__gnu_cxx", scope: null)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !265, line: 80, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !265, line: 76, size: 128, flags: DIFlagTypePassByValue, elements: !411, identifier: "_ZTS7lldiv_t")
!411 = !{!412, !414}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !410, file: !265, line: 78, baseType: !413, size: 64)
!413 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !410, file: !265, line: 79, baseType: !413, size: 64, offset: 64)
!415 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !408, entity: !416, file: !272, line: 206)
!416 = !DISubprogram(name: "_Exit", scope: !265, file: !265, line: 629, type: !325, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!417 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !408, entity: !418, file: !272, line: 210)
!418 = !DISubprogram(name: "llabs", scope: !265, file: !265, line: 844, type: !419, flags: DIFlagPrototyped, spFlags: 0)
!419 = !DISubroutineType(types: !420)
!420 = !{!413, !413}
!421 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !408, entity: !422, file: !272, line: 216)
!422 = !DISubprogram(name: "lldiv", scope: !265, file: !265, line: 858, type: !423, flags: DIFlagPrototyped, spFlags: 0)
!423 = !DISubroutineType(types: !424)
!424 = !{!409, !413, !413}
!425 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !408, entity: !426, file: !272, line: 227)
!426 = !DISubprogram(name: "atoll", scope: !265, file: !265, line: 112, type: !427, flags: DIFlagPrototyped, spFlags: 0)
!427 = !DISubroutineType(types: !428)
!428 = !{!413, !11}
!429 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !408, entity: !430, file: !272, line: 228)
!430 = !DISubprogram(name: "strtoll", scope: !265, file: !265, line: 200, type: !431, flags: DIFlagPrototyped, spFlags: 0)
!431 = !DISubroutineType(types: !432)
!432 = !{!413, !356, !383, !17}
!433 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !408, entity: !434, file: !272, line: 229)
!434 = !DISubprogram(name: "strtoull", scope: !265, file: !265, line: 205, type: !435, flags: DIFlagPrototyped, spFlags: 0)
!435 = !DISubroutineType(types: !436)
!436 = !{!437, !356, !383, !17}
!437 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!438 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !408, entity: !439, file: !272, line: 231)
!439 = !DISubprogram(name: "strtof", scope: !265, file: !265, line: 123, type: !440, flags: DIFlagPrototyped, spFlags: 0)
!440 = !DISubroutineType(types: !441)
!441 = !{!442, !356, !383}
!442 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!443 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !408, entity: !444, file: !272, line: 232)
!444 = !DISubprogram(name: "strtold", scope: !265, file: !265, line: 126, type: !445, flags: DIFlagPrototyped, spFlags: 0)
!445 = !DISubroutineType(types: !446)
!446 = !{!447, !356, !383}
!447 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!448 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !263, entity: !409, file: !272, line: 240)
!449 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !263, entity: !416, file: !272, line: 242)
!450 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !263, entity: !418, file: !272, line: 244)
!451 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !263, entity: !452, file: !272, line: 245)
!452 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !408, file: !272, line: 213, type: !423, flags: DIFlagPrototyped, spFlags: 0)
!453 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !263, entity: !422, file: !272, line: 246)
!454 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !263, entity: !426, file: !272, line: 248)
!455 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !263, entity: !439, file: !272, line: 249)
!456 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !263, entity: !430, file: !272, line: 250)
!457 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !263, entity: !434, file: !272, line: 251)
!458 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !263, entity: !444, file: !272, line: 252)
