; ModuleID = 'express.cpp'
source_filename = "express.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"struct.pov::Token_Struct" = type { i32, i32, %"struct.pov_base::ITextStream::FilePos", i32, i32, i8*, double, i32, i32, %"class.pov_base::ITextStream"*, i8*, i32*, i8**, i8 }
%"struct.pov_base::ITextStream::FilePos" = type { i64, i32 }
%"class.pov_base::ITextStream" = type { i32 (...)**, %"class.pov_base::IStream"*, [512 x i8], i64, i64, i64, i64, i8*, i32, i32 }
%"class.pov_base::IStream" = type { %"class.pov_base::IOBase" }
%"class.pov_base::IOBase" = type { i32 (...)**, i8, %struct._IO_FILE*, i32, i32, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

!539 = !DIEnumerator(name: "AA_LEVEL_TOKEN", value: 519, isUnsigned: true)
!540 = !DIEnumerator(name: "LOAD_FILE_TOKEN", value: 520, isUnsigned: true)
!541 = !DIEnumerator(name: "SAVE_FILE_TOKEN", value: 521, isUnsigned: true)
!542 = !DIEnumerator(name: "ALWAYS_SAMPLE_TOKEN", value: 522, isUnsigned: true)
!543 = !DIEnumerator(name: "PRETRACE_START_TOKEN", value: 523, isUnsigned: true)
!544 = !DIEnumerator(name: "PRETRACE_END_TOKEN", value: 524, isUnsigned: true)
!545 = !DIEnumerator(name: "MAX_SAMPLE_TOKEN", value: 525, isUnsigned: true)
!546 = !DIEnumerator(name: "GLOBAL_LIGHTS_TOKEN", value: 526, isUnsigned: true)
!547 = !DIEnumerator(name: "CUTAWAY_TEXTURES_TOKEN", value: 527, isUnsigned: true)
!548 = !DIEnumerator(name: "NO_BUMP_SCALE_TOKEN", value: 528, isUnsigned: true)
!549 = !DIEnumerator(name: "CONSERVE_ENERGY_TOKEN", value: 529, isUnsigned: true)
!550 = !DIEnumerator(name: "PIGMENT_PATTERN_TOKEN", value: 530, isUnsigned: true)
!551 = !DIEnumerator(name: "INTERNAL_TOKEN", value: 531, isUnsigned: true)
!552 = !DIEnumerator(name: "NOISE_GENERATOR_TOKEN", value: 532, isUnsigned: true)
!553 = !DIEnumerator(name: "JULIA_TOKEN", value: 533, isUnsigned: true)
!554 = !DIEnumerator(name: "MAGNET_TOKEN", value: 534, isUnsigned: true)
!555 = !DIEnumerator(name: "LAST_TOKEN", value: 535, isUnsigned: true)
!556 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !2, file: !557, line: 706, baseType: !7, size: 32, elements: !558)
!557 = !DIFile(filename: "./frame.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!558 = !{!559, !560, !561, !562}
!559 = !DIEnumerator(name: "X", value: 0, isUnsigned: true)
!560 = !DIEnumerator(name: "Y", value: 1, isUnsigned: true)
!561 = !DIEnumerator(name: "Z", value: 2, isUnsigned: true)
!562 = !DIEnumerator(name: "T", value: 3, isUnsigned: true)
!563 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !2, file: !557, line: 715, baseType: !7, size: 32, elements: !564)
!564 = !{!565, !566, !567, !568, !569}
!565 = !DIEnumerator(name: "pRED", value: 0, isUnsigned: true)
!566 = !DIEnumerator(name: "pGREEN", value: 1, isUnsigned: true)
!567 = !DIEnumerator(name: "pBLUE", value: 2, isUnsigned: true)
!568 = !DIEnumerator(name: "pFILTER", value: 3, isUnsigned: true)
!569 = !DIEnumerator(name: "pTRANSM", value: 4, isUnsigned: true)
!570 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !2, file: !557, line: 1813, baseType: !7, size: 32, elements: !571, identifier: "_ZTSN3pov9FRAMETYPEE")
!571 = !{!572, !573}
!572 = !DIEnumerator(name: "FT_SINGLE_FRAME", value: 0, isUnsigned: true)
!573 = !DIEnumerator(name: "FT_MULTIPLE_FRAME", value: 1, isUnsigned: true)
!574 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !576, file: !575, line: 51, baseType: !7, size: 32, elements: !577)
!575 = !DIFile(filename: "base/fileinputoutput.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!576 = !DINamespace(name: "pov_base", scope: null)
!577 = !{!578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599}
!578 = !DIEnumerator(name: "POV_File_Unknown", value: 0, isUnsigned: true)
!579 = !DIEnumerator(name: "POV_File_Image_Targa", value: 1, isUnsigned: true)
!580 = !DIEnumerator(name: "POV_File_Image_PNG", value: 2, isUnsigned: true)
!581 = !DIEnumerator(name: "POV_File_Image_PPM", value: 3, isUnsigned: true)
!582 = !DIEnumerator(name: "POV_File_Image_PGM", value: 4, isUnsigned: true)
!583 = !DIEnumerator(name: "POV_File_Image_GIF", value: 5, isUnsigned: true)
!584 = !DIEnumerator(name: "POV_File_Image_IFF", value: 6, isUnsigned: true)
!585 = !DIEnumerator(name: "POV_File_Image_JPEG", value: 7, isUnsigned: true)
!586 = !DIEnumerator(name: "POV_File_Image_TIFF", value: 8, isUnsigned: true)
!587 = !DIEnumerator(name: "POV_File_Image_System", value: 9, isUnsigned: true)
!588 = !DIEnumerator(name: "POV_File_Text_POV", value: 10, isUnsigned: true)
!589 = !DIEnumerator(name: "POV_File_Text_INC", value: 11, isUnsigned: true)
!590 = !DIEnumerator(name: "POV_File_Text_Macro", value: 11, isUnsigned: true)
!591 = !DIEnumerator(name: "POV_File_Text_INI", value: 12, isUnsigned: true)
!592 = !DIEnumerator(name: "POV_File_Text_CSV", value: 13, isUnsigned: true)
!593 = !DIEnumerator(name: "POV_File_Text_Stream", value: 14, isUnsigned: true)
!594 = !DIEnumerator(name: "POV_File_Text_User", value: 15, isUnsigned: true)
!595 = !DIEnumerator(name: "POV_File_Data_DF3", value: 16, isUnsigned: true)
!596 = !DIEnumerator(name: "POV_File_Data_RCA", value: 17, isUnsigned: true)
!597 = !DIEnumerator(name: "POV_File_Data_LOG", value: 18, isUnsigned: true)
!598 = !DIEnumerator(name: "POV_File_Font_TTF", value: 19, isUnsigned: true)
!599 = !DIEnumerator(name: "POV_File_Unknown_Count", value: 20, isUnsigned: true)
!600 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !2, file: !557, line: 700, baseType: !7, size: 32, elements: !601)
!601 = !{!602, !603}
!602 = !DIEnumerator(name: "U", value: 0, isUnsigned: true)
!603 = !DIEnumerator(name: "V", value: 1, isUnsigned: true)
!604 = !{!605, !606, !618, !741, !890, !611, !909, !677, !810, !7, !910, !745, !923, !10, !924}
!605 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP", scope: !2, file: !557, line: 1033, baseType: !608)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Struct", scope: !2, file: !557, line: 1059, size: 128, flags: DIFlagTypePassByValue, elements: !609, identifier: "_ZTSN3pov16Blend_Map_StructE")
!609 = !{!610, !612, !614, !616, !617}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "Users", scope: !608, file: !557, line: 1061, baseType: !611, size: 32)
!611 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "Number_Of_Entries", scope: !608, file: !557, line: 1062, baseType: !613, size: 16, offset: 32)
!613 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "Transparency_Flag", scope: !608, file: !557, line: 1063, baseType: !615, size: 8, offset: 48)
!615 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !608, file: !557, line: 1063, baseType: !615, size: 8, offset: 56)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map_Entries", scope: !608, file: !557, line: 1064, baseType: !618, size: 64, offset: 64)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP_ENTRY", scope: !2, file: !557, line: 1032, baseType: !620)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Entry", scope: !2, file: !557, line: 1045, size: 256, flags: DIFlagTypePassByValue, elements: !621, identifier: "_ZTSN3pov15Blend_Map_EntryE")
!621 = !{!622, !623, !625}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !620, file: !557, line: 1047, baseType: !605, size: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "Same", scope: !620, file: !557, line: 1048, baseType: !624, size: 8, offset: 32)
!624 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !620, file: !557, line: 1056, baseType: !626, size: 192, offset: 64)
!626 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !620, file: !557, line: 1049, size: 192, flags: DIFlagTypePassByValue, elements: !627, identifier: "_ZTSN3pov15Blend_Map_EntryUt_E")
!627 = !{!628, !633, !637, !641, !889}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !626, file: !557, line: 1051, baseType: !629, size: 160)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLOUR", scope: !2, file: !557, line: 695, baseType: !630)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !605, size: 160, elements: !631)
!631 = !{!632}
!632 = !DISubrange(count: 5)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !626, file: !557, line: 1052, baseType: !634, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "PIGMENT", scope: !2, file: !557, line: 1036, baseType: !636)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pigment_Struct", scope: !2, file: !557, line: 1342, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov14Pigment_StructE")
!637 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !626, file: !557, line: 1053, baseType: !638, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "TNORMAL", scope: !2, file: !557, line: 1037, baseType: !640)
!640 = !DICompositeType(tag: DW_TAG_structure_type, name: "Tnormal_Struct", scope: !2, file: !557, line: 1348, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov14Tnormal_StructE")
!641 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !626, file: !557, line: 1054, baseType: !642, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXTURE", scope: !2, file: !557, line: 1035, baseType: !644)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Texture_Struct", scope: !2, file: !557, line: 1359, size: 1664, flags: DIFlagTypePassByValue, elements: !645, identifier: "_ZTSN3pov14Texture_StructE")
!645 = !{!646, !648, !649, !650, !651, !652, !653, !654, !658, !662, !663, !880, !881, !882, !883, !887, !888}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !644, file: !557, line: 1361, baseType: !647, size: 16)
!647 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "Wave_Type", scope: !644, file: !557, line: 1361, baseType: !647, size: 16, offset: 16)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !644, file: !557, line: 1361, baseType: !647, size: 16, offset: 32)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !644, file: !557, line: 1361, baseType: !611, size: 32, offset: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "Frequency", scope: !644, file: !557, line: 1361, baseType: !605, size: 32, offset: 96)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !644, file: !557, line: 1361, baseType: !605, size: 32, offset: 128)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !644, file: !557, line: 1361, baseType: !605, size: 32, offset: 160)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "Warps", scope: !644, file: !557, line: 1361, baseType: !655, size: 64, offset: 192)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "WARP", scope: !2, file: !557, line: 1040, baseType: !657)
!657 = !DICompositeType(tag: DW_TAG_structure_type, name: "Warps_Struct", scope: !2, file: !557, line: 1387, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov12Warps_StructE")
!658 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !644, file: !557, line: 1361, baseType: !659, size: 64, offset: 256)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "TPATTERN", scope: !2, file: !557, line: 1034, baseType: !661)
!661 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pattern_Struct", scope: !2, file: !557, line: 1337, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov14Pattern_StructE")
!662 = !DIDerivedType(tag: DW_TAG_member, name: "Blend_Map", scope: !644, file: !557, line: 1361, baseType: !606, size: 64, offset: 320)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "Vals", scope: !644, file: !557, line: 1361, baseType: !664, size: 896, offset: 384)
!664 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !644, file: !557, line: 1361, size: 896, flags: DIFlagTypePassByValue, elements: !665, identifier: "_ZTSN3pov14Texture_StructUt_E")
!665 = !{!666, !670, !674, !680, !681, !682, !683, !684, !689, !694, !700, !712, !727, !737, !743, !744}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "Density_File", scope: !664, file: !557, line: 1361, baseType: !667, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "DENSITY_FILE", scope: !2, file: !557, line: 1280, baseType: !669)
!669 = !DICompositeType(tag: DW_TAG_structure_type, name: "Density_file_Struct", scope: !2, file: !557, line: 1283, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov19Density_file_StructE")
!670 = !DIDerivedType(tag: DW_TAG_member, name: "Image", scope: !664, file: !557, line: 1361, baseType: !671, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE", scope: !2, file: !557, line: 1232, baseType: !673)
!673 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image_Struct", scope: !2, file: !557, line: 1234, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov12Image_StructE")
!674 = !DIDerivedType(tag: DW_TAG_member, name: "Gradient", scope: !664, file: !557, line: 1361, baseType: !675, size: 192)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !2, file: !557, line: 691, baseType: !676)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !677, size: 192, elements: !678)
!677 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!678 = !{!679}
!679 = !DISubrange(count: 3)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "Agate_Turb_Scale", scope: !664, file: !557, line: 1361, baseType: !605, size: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "Num_of_Waves", scope: !664, file: !557, line: 1361, baseType: !613, size: 16)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !664, file: !557, line: 1361, baseType: !613, size: 16)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "Arms", scope: !664, file: !557, line: 1361, baseType: !613, size: 16)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "Brick", scope: !664, file: !557, line: 1361, baseType: !685, size: 256)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !664, file: !557, line: 1361, size: 256, flags: DIFlagTypePassByValue, elements: !686, identifier: "_ZTSN3pov14Texture_StructUt_Ut_E")
!686 = !{!687, !688}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "Mortar", scope: !685, file: !557, line: 1361, baseType: !605, size: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !685, file: !557, line: 1361, baseType: !675, size: 192, offset: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "Quilted", scope: !664, file: !557, line: 1361, baseType: !690, size: 64)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !664, file: !557, line: 1361, size: 64, flags: DIFlagTypePassByValue, elements: !691, identifier: "_ZTSN3pov14Texture_StructUt_Ut0_E")
!691 = !{!692, !693}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "Control0", scope: !690, file: !557, line: 1361, baseType: !605, size: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "Control1", scope: !690, file: !557, line: 1361, baseType: !605, size: 32, offset: 32)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "Facets", scope: !664, file: !557, line: 1361, baseType: !695, size: 320)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !664, file: !557, line: 1361, size: 320, flags: DIFlagTypePassByValue, elements: !696, identifier: "_ZTSN3pov14Texture_StructUt_Ut1_E")
!696 = !{!697, !698, !699}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !695, file: !557, line: 1361, baseType: !677, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "UseCoords", scope: !695, file: !557, line: 1361, baseType: !677, size: 64, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !695, file: !557, line: 1361, baseType: !675, size: 192, offset: 128)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "Crackle", scope: !664, file: !557, line: 1361, baseType: !701, size: 896)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !664, file: !557, line: 1361, size: 896, flags: DIFlagTypePassByValue, elements: !702, identifier: "_ZTSN3pov14Texture_StructUt_Ut2_E")
!702 = !{!703, !704, !705, !706, !707, !708, !710, !711}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "Form", scope: !701, file: !557, line: 1361, baseType: !675, size: 192)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "Metric", scope: !701, file: !557, line: 1361, baseType: !675, size: 192, offset: 192)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !701, file: !557, line: 1361, baseType: !677, size: 64, offset: 384)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "Dim", scope: !701, file: !557, line: 1361, baseType: !677, size: 64, offset: 448)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "IsSolid", scope: !701, file: !557, line: 1361, baseType: !613, size: 16, offset: 512)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !701, file: !557, line: 1361, baseType: !709, size: 64, offset: 576)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "lastseed", scope: !701, file: !557, line: 1361, baseType: !611, size: 32, offset: 640)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "lastcenter", scope: !701, file: !557, line: 1361, baseType: !675, size: 192, offset: 704)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "Slope", scope: !664, file: !557, line: 1361, baseType: !713, size: 832)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !664, file: !557, line: 1361, size: 832, flags: DIFlagTypePassByValue, elements: !714, identifier: "_ZTSN3pov14Texture_StructUt_Ut3_E")
!714 = !{!715, !716, !717, !718, !719, !720, !721, !726}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Vector", scope: !713, file: !557, line: 1361, baseType: !675, size: 192)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Vector", scope: !713, file: !557, line: 1361, baseType: !675, size: 192, offset: 192)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Base", scope: !713, file: !557, line: 1361, baseType: !613, size: 16, offset: 384)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Base", scope: !713, file: !557, line: 1361, baseType: !613, size: 16, offset: 400)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Len", scope: !713, file: !557, line: 1361, baseType: !677, size: 64, offset: 448)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Len", scope: !713, file: !557, line: 1361, baseType: !677, size: 64, offset: 512)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "Slope_Mod", scope: !713, file: !557, line: 1361, baseType: !722, size: 128, offset: 576)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !2, file: !557, line: 690, baseType: !723)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !677, size: 128, elements: !724)
!724 = !{!725}
!725 = !DISubrange(count: 2)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "Altit_Mod", scope: !713, file: !557, line: 1361, baseType: !722, size: 128, offset: 704)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "Fractal", scope: !664, file: !557, line: 1361, baseType: !728, size: 384)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !664, file: !557, line: 1361, size: 384, flags: DIFlagTypePassByValue, elements: !729, identifier: "_ZTSN3pov14Texture_StructUt_Ut4_E")
!729 = !{!730, !731, !732, !733, !734, !735, !736}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "Coord", scope: !728, file: !557, line: 1361, baseType: !722, size: 128)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "Iterations", scope: !728, file: !557, line: 1361, baseType: !613, size: 16, offset: 128)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "interior_type", scope: !728, file: !557, line: 1361, baseType: !613, size: 16, offset: 144)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "exterior_type", scope: !728, file: !557, line: 1361, baseType: !613, size: 16, offset: 160)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "efactor", scope: !728, file: !557, line: 1361, baseType: !677, size: 64, offset: 192)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "ifactor", scope: !728, file: !557, line: 1361, baseType: !677, size: 64, offset: 256)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "Exponent", scope: !728, file: !557, line: 1361, baseType: !611, size: 32, offset: 320)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !664, file: !557, line: 1361, baseType: !738, size: 128)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !664, file: !557, line: 1361, size: 128, flags: DIFlagTypePassByValue, elements: !739, identifier: "_ZTSN3pov14Texture_StructUt_Ut5_E")
!739 = !{!740, !742}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "Fn", scope: !738, file: !557, line: 1361, baseType: !741, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !738, file: !557, line: 1361, baseType: !741, size: 64, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !664, file: !557, line: 1361, baseType: !634, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !664, file: !557, line: 1361, baseType: !745, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !2, file: !557, line: 678, baseType: !747)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !2, file: !557, line: 1535, size: 960, flags: DIFlagTypePassByValue, elements: !748, identifier: "_ZTSN3pov13Object_StructE")
!748 = !{!749, !856, !857, !858, !859, !860, !861, !862, !863, !867, !876, !877, !878, !879}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !747, file: !557, line: 1537, baseType: !750, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "METHODS", scope: !2, file: !557, line: 1432, baseType: !752)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Method_Struct", scope: !2, file: !557, line: 1517, size: 704, flags: DIFlagTypePassByValue, elements: !753, identifier: "_ZTSN3pov13Method_StructE")
!753 = !{!754, !805, !811, !818, !820, !825, !840, !842, !844, !849, !854}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "All_Intersections_Method", scope: !752, file: !557, line: 1519, baseType: !755, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALL_INTERSECTIONS_METHOD", scope: !2, file: !557, line: 1434, baseType: !756)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{!611, !745, !759, !774}
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", scope: !2, file: !557, line: 680, baseType: !761)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Ray_Struct", scope: !2, file: !557, line: 1797, size: 6848, flags: DIFlagTypePassByValue, elements: !762, identifier: "_ZTSN3pov10Ray_StructE")
!762 = !{!763, !764, !765, !766, !767}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "Initial", scope: !761, file: !557, line: 1799, baseType: !675, size: 192)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !761, file: !557, line: 1800, baseType: !675, size: 192, offset: 192)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "Index", scope: !761, file: !557, line: 1801, baseType: !611, size: 32, offset: 384)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "Optimisiation_Flags", scope: !761, file: !557, line: 1802, baseType: !7, size: 32, offset: 416)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "Interiors", scope: !761, file: !557, line: 1803, baseType: !768, size: 6400, offset: 448)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !769, size: 6400, elements: !772)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERIOR", scope: !2, file: !557, line: 1124, baseType: !771)
!771 = !DICompositeType(tag: DW_TAG_structure_type, name: "Interior_Struct", scope: !2, file: !557, line: 1126, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov15Interior_StructE")
!772 = !{!773}
!773 = !DISubrange(count: 100)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISTACK", scope: !2, file: !557, line: 681, baseType: !776)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "istack_struct", scope: !2, file: !557, line: 1635, size: 192, flags: DIFlagTypePassByValue, elements: !777, identifier: "_ZTSN3pov13istack_structE")
!777 = !{!778, !780, !803, !804}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !776, file: !557, line: 1637, baseType: !779, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "istack", scope: !776, file: !557, line: 1638, baseType: !781, size: 64, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "istk_entry", scope: !2, file: !557, line: 1610, size: 1600, flags: DIFlagTypePassByValue, elements: !783, identifier: "_ZTSN3pov10istk_entryE")
!783 = !{!784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "Depth", scope: !782, file: !557, line: 1612, baseType: !677, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "IPoint", scope: !782, file: !557, line: 1613, baseType: !675, size: 192, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "INormal", scope: !782, file: !557, line: 1614, baseType: !675, size: 192, offset: 256)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "PNormal", scope: !782, file: !557, line: 1615, baseType: !675, size: 192, offset: 448)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "Iuv", scope: !782, file: !557, line: 1616, baseType: !722, size: 128, offset: 640)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !782, file: !557, line: 1617, baseType: !745, size: 64, offset: 768)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "i1", scope: !782, file: !557, line: 1624, baseType: !611, size: 32, offset: 832)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "i2", scope: !782, file: !557, line: 1624, baseType: !611, size: 32, offset: 864)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !782, file: !557, line: 1625, baseType: !677, size: 64, offset: 896)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !782, file: !557, line: 1625, baseType: !677, size: 64, offset: 960)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !782, file: !557, line: 1626, baseType: !677, size: 64, offset: 1024)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !782, file: !557, line: 1626, baseType: !677, size: 64, offset: 1088)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !782, file: !557, line: 1627, baseType: !677, size: 64, offset: 1152)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "d4", scope: !782, file: !557, line: 1627, baseType: !677, size: 64, offset: 1216)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !782, file: !557, line: 1628, baseType: !677, size: 64, offset: 1280)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !782, file: !557, line: 1628, baseType: !677, size: 64, offset: 1344)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !782, file: !557, line: 1628, baseType: !677, size: 64, offset: 1408)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "Pointer", scope: !782, file: !557, line: 1630, baseType: !741, size: 64, offset: 1472)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "Csg", scope: !782, file: !557, line: 1632, baseType: !741, size: 64, offset: 1536)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !776, file: !557, line: 1639, baseType: !7, size: 32, offset: 128)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "top_entry", scope: !776, file: !557, line: 1640, baseType: !7, size: 32, offset: 160)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "Inside_Method", scope: !752, file: !557, line: 1520, baseType: !806, size: 64, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "INSIDE_METHOD", scope: !2, file: !557, line: 1435, baseType: !807)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DISubroutineType(types: !809)
!809 = !{!611, !810, !745}
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Method", scope: !752, file: !557, line: 1521, baseType: !812, size: 64, offset: 128)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "NORMAL_METHOD", scope: !2, file: !557, line: 1436, baseType: !813)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DISubroutineType(types: !815)
!815 = !{null, !810, !745, !816}
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERSECTION", scope: !2, file: !557, line: 682, baseType: !782)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "UVCoord_Method", scope: !752, file: !557, line: 1522, baseType: !819, size: 64, offset: 192)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "UVCOORD_METHOD", scope: !2, file: !557, line: 1437, baseType: !813)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "Copy_Method", scope: !752, file: !557, line: 1523, baseType: !821, size: 64, offset: 256)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "COPY_METHOD", scope: !2, file: !557, line: 1438, baseType: !822)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DISubroutineType(types: !824)
!824 = !{!741, !745}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "Translate_Method", scope: !752, file: !557, line: 1524, baseType: !826, size: 64, offset: 320)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSLATE_METHOD", scope: !2, file: !557, line: 1439, baseType: !827)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DISubroutineType(types: !829)
!829 = !{null, !745, !810, !830}
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM", scope: !2, file: !557, line: 1014, baseType: !832)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Transform_Struct", scope: !2, file: !557, line: 1016, size: 2048, flags: DIFlagTypePassByValue, elements: !833, identifier: "_ZTSN3pov16Transform_StructE")
!833 = !{!834, !839}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "matrix", scope: !832, file: !557, line: 1018, baseType: !835, size: 1024)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "MATRIX", scope: !2, file: !557, line: 693, baseType: !836)
!836 = !DICompositeType(tag: DW_TAG_array_type, baseType: !677, size: 1024, elements: !837)
!837 = !{!838, !838}
!838 = !DISubrange(count: 4)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !832, file: !557, line: 1019, baseType: !835, size: 1024, offset: 1024)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "Rotate_Method", scope: !752, file: !557, line: 1525, baseType: !841, size: 64, offset: 384)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "ROTATE_METHOD", scope: !2, file: !557, line: 1440, baseType: !827)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "Scale_Method", scope: !752, file: !557, line: 1526, baseType: !843, size: 64, offset: 448)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCALE_METHOD", scope: !2, file: !557, line: 1441, baseType: !827)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "Transform_Method", scope: !752, file: !557, line: 1527, baseType: !845, size: 64, offset: 512)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM_METHOD", scope: !2, file: !557, line: 1442, baseType: !846)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{null, !745, !830}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "Invert_Method", scope: !752, file: !557, line: 1528, baseType: !850, size: 64, offset: 576)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "INVERT_METHOD", scope: !2, file: !557, line: 1443, baseType: !851)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DISubroutineType(types: !853)
!853 = !{null, !745}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy_Method", scope: !752, file: !557, line: 1529, baseType: !855, size: 64, offset: 640)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "DESTROY_METHOD", scope: !2, file: !557, line: 1444, baseType: !851)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !747, file: !557, line: 1537, baseType: !611, size: 32, offset: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !747, file: !557, line: 1537, baseType: !745, size: 64, offset: 128)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !747, file: !557, line: 1537, baseType: !642, size: 64, offset: 192)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !747, file: !557, line: 1537, baseType: !642, size: 64, offset: 256)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !747, file: !557, line: 1537, baseType: !769, size: 64, offset: 320)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !747, file: !557, line: 1537, baseType: !745, size: 64, offset: 384)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !747, file: !557, line: 1537, baseType: !745, size: 64, offset: 448)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !747, file: !557, line: 1537, baseType: !864, size: 64, offset: 512)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIGHT_SOURCE", scope: !2, file: !557, line: 1041, baseType: !866)
!866 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Source_Struct", scope: !2, file: !557, line: 1580, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov19Light_Source_StructE")
!867 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !747, file: !557, line: 1537, baseType: !868, size: 192, offset: 576)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", scope: !2, file: !557, line: 888, baseType: !869)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Bounding_Box_Struct", scope: !2, file: !557, line: 890, size: 192, flags: DIFlagTypePassByValue, elements: !870, identifier: "_ZTSN3pov19Bounding_Box_StructE")
!870 = !{!871, !875}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "Lower_Left", scope: !869, file: !557, line: 892, baseType: !872, size: 96)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VECT", scope: !2, file: !557, line: 886, baseType: !873)
!873 = !DICompositeType(tag: DW_TAG_array_type, baseType: !874, size: 96, elements: !678)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VAL", scope: !2, file: !557, line: 884, baseType: !605)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "Lengths", scope: !869, file: !557, line: 892, baseType: !872, size: 96, offset: 96)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !747, file: !557, line: 1537, baseType: !830, size: 64, offset: 768)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !747, file: !557, line: 1537, baseType: !830, size: 64, offset: 832)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !747, file: !557, line: 1537, baseType: !605, size: 32, offset: 896)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !747, file: !557, line: 1537, baseType: !7, size: 32, offset: 928)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Material", scope: !644, file: !557, line: 1361, baseType: !642, size: 64, offset: 1280)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "Pigment", scope: !644, file: !557, line: 1362, baseType: !634, size: 64, offset: 1344)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "Tnormal", scope: !644, file: !557, line: 1363, baseType: !638, size: 64, offset: 1408)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "Finish", scope: !644, file: !557, line: 1364, baseType: !884, size: 64, offset: 1472)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "FINISH", scope: !2, file: !557, line: 1038, baseType: !886)
!886 = !DICompositeType(tag: DW_TAG_structure_type, name: "Finish_Struct", scope: !2, file: !557, line: 1370, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov13Finish_StructE")
!887 = !DIDerivedType(tag: DW_TAG_member, name: "Materials", scope: !644, file: !557, line: 1365, baseType: !642, size: 64, offset: 1536)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "Num_Of_Mats", scope: !644, file: !557, line: 1366, baseType: !611, size: 32, offset: 1600)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "Point_Slope", scope: !626, file: !557, line: 1055, baseType: !722, size: 128)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "SPLINE", scope: !2, file: !557, line: 1043, baseType: !892)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Spline_Struct", scope: !2, file: !557, line: 1144, size: 704, flags: DIFlagTypePassByValue, elements: !893, identifier: "_ZTSN3pov13Spline_StructE")
!893 = !{!894, !895, !896, !897, !901, !902, !903, !904, !905, !906}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "Number_Of_Entries", scope: !892, file: !557, line: 1146, baseType: !611, size: 32)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !892, file: !557, line: 1146, baseType: !611, size: 32, offset: 32)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "Max_Entries", scope: !892, file: !557, line: 1147, baseType: !611, size: 32, offset: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "SplineEntries", scope: !892, file: !557, line: 1148, baseType: !898, size: 64, offset: 128)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "SPLINE_ENTRY", scope: !2, file: !557, line: 1042, baseType: !900)
!900 = !DICompositeType(tag: DW_TAG_structure_type, name: "Spline_Entry", scope: !2, file: !557, line: 1137, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov12Spline_EntryE")
!901 = !DIDerivedType(tag: DW_TAG_member, name: "Coeffs_Computed", scope: !892, file: !557, line: 1149, baseType: !611, size: 32, offset: 192)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "Terms", scope: !892, file: !557, line: 1150, baseType: !611, size: 32, offset: 224)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "Cache_Valid", scope: !892, file: !557, line: 1151, baseType: !4, size: 8, offset: 256)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "Cache_Type", scope: !892, file: !557, line: 1152, baseType: !611, size: 32, offset: 288)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "Cache_Point", scope: !892, file: !557, line: 1153, baseType: !677, size: 64, offset: 320)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "Cache_Data", scope: !892, file: !557, line: 1154, baseType: !907, size: 320, offset: 384)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXPRESS", scope: !2, file: !557, line: 694, baseType: !908)
!908 = !DICompositeType(tag: DW_TAG_array_type, baseType: !677, size: 320, elements: !631)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "POV_ARRAY", scope: !2, file: !912, line: 88, baseType: !913)
!912 = !DIFile(filename: "./tokenize.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Pov_Array_Struct", scope: !2, file: !912, line: 90, size: 512, flags: DIFlagTypePassByValue, elements: !914, identifier: "_ZTSN3pov16Pov_Array_StructE")
!914 = !{!915, !916, !917, !918, !920, !921}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "Dims", scope: !913, file: !912, line: 92, baseType: !611, size: 32)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !913, file: !912, line: 92, baseType: !611, size: 32, offset: 32)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "Total", scope: !913, file: !912, line: 92, baseType: !611, size: 32, offset: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "Sizes", scope: !913, file: !912, line: 93, baseType: !919, size: 160, offset: 96)
!919 = !DICompositeType(tag: DW_TAG_array_type, baseType: !611, size: 160, elements: !631)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "Mags", scope: !913, file: !912, line: 94, baseType: !919, size: 160, offset: 256)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "DataPtrs", scope: !913, file: !912, line: 95, baseType: !922, size: 64, offset: 448)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNCTION_PTR", scope: !2, file: !925, line: 41, baseType: !926)
!925 = !DIFile(filename: "./function.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNCTION", scope: !2, file: !925, line: 40, baseType: !7)
!928 = !{!0, !5, !8, !11, !13, !929}
!929 = !DIGlobalVariableExpression(var: !930, expr: !DIExpression(DW_OP_constu, 256, DW_OP_stack_value))
!930 = distinct !DIGlobalVariable(name: "MAX_BLEND_MAP_ENTRIES", scope: !2, file: !557, line: 1030, type: !931, isLocal: true, isDefinition: true)
!931 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !611)
!932 = !{!933, !940, !946, !948, !950, !954, !956, !958, !960, !962, !964, !966, !968, !973, !977, !979, !981, !985, !987, !989, !991, !993, !995, !997, !1000, !1002, !1004, !1008, !1013, !1015, !1017, !1019, !1021, !1023, !1025, !1027, !1029, !1031, !1033, !1037, !1041, !1043, !1045, !1047, !1049, !1051, !1053, !1055, !1057, !1059, !1061, !1063, !1065, !1067, !1069, !1071, !1075, !1079, !1083, !1085, !1087, !1089, !1091, !1093, !1095, !1097, !1099, !1101, !1105, !1109, !1113, !1115, !1117, !1119, !1124, !1128, !1132, !1134, !1136, !1138, !1140, !1142, !1144, !1146, !1148, !1150, !1152, !1154, !1156, !1161, !1165, !1169, !1171, !1173, !1175, !1181, !1185, !1189, !1191, !1193, !1195, !1197, !1199, !1201, !1205, !1209, !1211, !1213, !1215, !1217, !1221, !1225, !1229, !1231, !1233, !1235, !1237, !1239, !1241, !1245, !1249, !1253, !1255, !1259, !1263, !1265, !1267, !1269, !1271, !1273, !1275, !1281, !1286, !1290, !1296, !1300, !1305, !1307, !1309, !1313, !1317, !1330, !1334, !1338, !1342, !1346, !1351, !1355, !1359, !1363, !1367, !1375, !1379, !1383, !1385, !1389, !1393, !1397, !1403, !1407, !1411, !1413, !1421, !1425, !1432, !1434, !1438, !1442, !1446, !1450, !1455, !1459, !1463, !1464, !1465, !1466, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1511, !1513, !1515, !1517, !1519, !1521, !1523, !1525, !1527, !1529, !1531, !1533, !1535, !1537, !1543, !1547, !1553, !1557, !1561, !1565, !1569, !1571, !1573, !1577, !1581, !1585, !1589, !1593, !1595, !1597, !1599, !1603, !1607, !1611, !1613, !1615, !1616, !1618, !1619, !1621, !1623, !1625, !1627, !1629, !1631, !1633, !1635, !1637, !1639, !1641, !1643, !1645, !1647, !1649, !1651, !1653, !1655, !1657, !1659, !1660, !1661, !1667, !1673, !1678, !1682, !1684, !1686, !1688, !1690, !1697, !1701, !1705, !1709, !1713, !1717, !1721, !1725, !1727, !1731, !1737, !1741, !1745, !1747, !1749, !1753, !1757, !1759, !1761, !1763, !1765, !1767, !1769, !1771, !1775, !1779, !1783, !1787, !1791, !1795, !1797, !1803, !1807, !1811, !1815, !1817, !1819, !1823, !1827, !1828, !1829, !1830, !1831, !1832, !1834, !1836, !1837, !1838, !1839, !1841, !1843, !1845, !1847, !1849, !1851, !1853, !1855, !1857, !1859, !1861, !1862, !1863, !1865, !1867, !1869, !1871, !1875, !1930, !1934, !1935}
!933 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !935, file: !939, line: 52)
!934 = !DINamespace(name: "std", scope: null)
!935 = !DISubprogram(name: "abs", scope: !936, file: !936, line: 840, type: !937, flags: DIFlagPrototyped, spFlags: 0)
!936 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!937 = !DISubroutineType(types: !938)
!938 = !{!611, !611}
!939 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/std_abs.h", directory: "")
!940 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !941, file: !945, line: 83)
!941 = !DISubprogram(name: "acos", scope: !942, file: !942, line: 53, type: !943, flags: DIFlagPrototyped, spFlags: 0)
!942 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/mathcalls.h", directory: "")
!943 = !DISubroutineType(types: !944)
!944 = !{!677, !677}
!945 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cmath", directory: "")
!946 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !947, file: !945, line: 102)
!947 = !DISubprogram(name: "asin", scope: !942, file: !942, line: 55, type: !943, flags: DIFlagPrototyped, spFlags: 0)
!948 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !949, file: !945, line: 121)
!949 = !DISubprogram(name: "atan", scope: !942, file: !942, line: 57, type: !943, flags: DIFlagPrototyped, spFlags: 0)
!950 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !951, file: !945, line: 140)
!951 = !DISubprogram(name: "atan2", scope: !942, file: !942, line: 59, type: !952, flags: DIFlagPrototyped, spFlags: 0)
!952 = !DISubroutineType(types: !953)
!953 = !{!677, !677, !677}
!954 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !955, file: !945, line: 161)
!955 = !DISubprogram(name: "ceil", scope: !942, file: !942, line: 159, type: !943, flags: DIFlagPrototyped, spFlags: 0)
!956 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !957, file: !945, line: 180)
!957 = !DISubprogram(name: "cos", scope: !942, file: !942, line: 62, type: !943, flags: DIFlagPrototyped, spFlags: 0)
!958 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !959, file: !945, line: 199)
!959 = !DISubprogram(name: "cosh", scope: !942, file: !942, line: 71, type: !943, flags: DIFlagPrototyped, spFlags: 0)
!960 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !961, file: !945, line: 218)
!961 = !DISubprogram(name: "exp", scope: !942, file: !942, line: 95, type: !943, flags: DIFlagPrototyped, spFlags: 0)
!962 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !963, file: !945, line: 237)
!963 = !DISubprogram(name: "fabs", scope: !942, file: !942, line: 162, type: !943, flags: DIFlagPrototyped, spFlags: 0)
!964 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !965, file: !945, line: 256)
!965 = !DISubprogram(name: "floor", scope: !942, file: !942, line: 165, type: !943, flags: DIFlagPrototyped, spFlags: 0)
!966 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !967, file: !945, line: 275)
!967 = !DISubprogram(name: "fmod", scope: !942, file: !942, line: 168, type: !952, flags: DIFlagPrototyped, spFlags: 0)
!968 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !969, file: !945, line: 296)
!969 = !DISubprogram(name: "frexp", scope: !942, file: !942, line: 98, type: !970, flags: DIFlagPrototyped, spFlags: 0)
!970 = !DISubroutineType(types: !971)
!971 = !{!677, !677, !972}
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!973 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !974, file: !945, line: 315)
!974 = !DISubprogram(name: "ldexp", scope: !942, file: !942, line: 101, type: !975, flags: DIFlagPrototyped, spFlags: 0)
!975 = !DISubroutineType(types: !976)
!976 = !{!677, !677, !611}
!977 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !978, file: !945, line: 334)
!978 = !DISubprogram(name: "log", scope: !942, file: !942, line: 104, type: !943, flags: DIFlagPrototyped, spFlags: 0)
!979 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !980, file: !945, line: 353)
!980 = !DISubprogram(name: "log10", scope: !942, file: !942, line: 107, type: !943, flags: DIFlagPrototyped, spFlags: 0)
!981 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !982, file: !945, line: 372)
!982 = !DISubprogram(name: "modf", scope: !942, file: !942, line: 110, type: !983, flags: DIFlagPrototyped, spFlags: 0)
!983 = !DISubroutineType(types: !984)
!984 = !{!677, !677, !810}
!985 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !986, file: !945, line: 384)
!986 = !DISubprogram(name: "pow", scope: !942, file: !942, line: 140, type: !952, flags: DIFlagPrototyped, spFlags: 0)
!987 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !988, file: !945, line: 421)
!988 = !DISubprogram(name: "sin", scope: !942, file: !942, line: 64, type: !943, flags: DIFlagPrototyped, spFlags: 0)
!989 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !990, file: !945, line: 440)
!990 = !DISubprogram(name: "sinh", scope: !942, file: !942, line: 73, type: !943, flags: DIFlagPrototyped, spFlags: 0)
!991 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !992, file: !945, line: 459)
!992 = !DISubprogram(name: "sqrt", scope: !942, file: !942, line: 143, type: !943, flags: DIFlagPrototyped, spFlags: 0)
!993 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !994, file: !945, line: 478)
!994 = !DISubprogram(name: "tan", scope: !942, file: !942, line: 66, type: !943, flags: DIFlagPrototyped, spFlags: 0)
!995 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !996, file: !945, line: 497)
!996 = !DISubprogram(name: "tanh", scope: !942, file: !942, line: 75, type: !943, flags: DIFlagPrototyped, spFlags: 0)
!997 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !998, file: !945, line: 1065)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_t", file: !999, line: 150, baseType: !677)
!999 = !DIFile(filename: "/usr/include/math.h", directory: "")
!1000 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1001, file: !945, line: 1066)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "float_t", file: !999, line: 149, baseType: !605)
!1002 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1003, file: !945, line: 1069)
!1003 = !DISubprogram(name: "acosh", scope: !942, file: !942, line: 85, type: !943, flags: DIFlagPrototyped, spFlags: 0)
!1004 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1005, file: !945, line: 1070)
!1005 = !DISubprogram(name: "acoshf", scope: !942, file: !942, line: 85, type: !1006, flags: DIFlagPrototyped, spFlags: 0)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!605, !605}
!1008 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1009, file: !945, line: 1071)
!1009 = !DISubprogram(name: "acoshl", scope: !942, file: !942, line: 85, type: !1010, flags: DIFlagPrototyped, spFlags: 0)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!1012, !1012}
!1012 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!1013 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1014, file: !945, line: 1073)
!1014 = !DISubprogram(name: "asinh", scope: !942, file: !942, line: 87, type: !943, flags: DIFlagPrototyped, spFlags: 0)
!1015 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1016, file: !945, line: 1074)
!1016 = !DISubprogram(name: "asinhf", scope: !942, file: !942, line: 87, type: !1006, flags: DIFlagPrototyped, spFlags: 0)
!1017 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1018, file: !945, line: 1075)
!1018 = !DISubprogram(name: "asinhl", scope: !942, file: !942, line: 87, type: !1010, flags: DIFlagPrototyped, spFlags: 0)
!1019 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1020, file: !945, line: 1077)
!1020 = !DISubprogram(name: "atanh", scope: !942, file: !942, line: 89, type: !943, flags: DIFlagPrototyped, spFlags: 0)
!1021 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1022, file: !945, line: 1078)
!1022 = !DISubprogram(name: "atanhf", scope: !942, file: !942, line: 89, type: !1006, flags: DIFlagPrototyped, spFlags: 0)
!1023 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1024, file: !945, line: 1079)
!1024 = !DISubprogram(name: "atanhl", scope: !942, file: !942, line: 89, type: !1010, flags: DIFlagPrototyped, spFlags: 0)
!1025 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1026, file: !945, line: 1081)
!1026 = !DISubprogram(name: "cbrt", scope: !942, file: !942, line: 152, type: !943, flags: DIFlagPrototyped, spFlags: 0)
!1027 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1028, file: !945, line: 1082)
!1028 = !DISubprogram(name: "cbrtf", scope: !942, file: !942, line: 152, type: !1006, flags: DIFlagPrototyped, spFlags: 0)
!1029 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1030, file: !945, line: 1083)
!1030 = !DISubprogram(name: "cbrtl", scope: !942, file: !942, line: 152, type: !1010, flags: DIFlagPrototyped, spFlags: 0)
!1031 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1032, file: !945, line: 1085)
!1032 = !DISubprogram(name: "copysign", scope: !942, file: !942, line: 196, type: !952, flags: DIFlagPrototyped, spFlags: 0)
!1033 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1034, file: !945, line: 1086)
!1034 = !DISubprogram(name: "copysignf", scope: !942, file: !942, line: 196, type: !1035, flags: DIFlagPrototyped, spFlags: 0)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!605, !605, !605}
!1037 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1038, file: !945, line: 1087)
!1038 = !DISubprogram(name: "copysignl", scope: !942, file: !942, line: 196, type: !1039, flags: DIFlagPrototyped, spFlags: 0)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!1012, !1012, !1012}
!1041 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1042, file: !945, line: 1089)
!1042 = !DISubprogram(name: "erf", scope: !942, file: !942, line: 228, type: !943, flags: DIFlagPrototyped, spFlags: 0)
!1043 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1044, file: !945, line: 1090)
!1044 = !DISubprogram(name: "erff", scope: !942, file: !942, line: 228, type: !1006, flags: DIFlagPrototyped, spFlags: 0)
!1045 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1046, file: !945, line: 1091)
!1046 = !DISubprogram(name: "erfl", scope: !942, file: !942, line: 228, type: !1010, flags: DIFlagPrototyped, spFlags: 0)
!1047 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1048, file: !945, line: 1093)
!1048 = !DISubprogram(name: "erfc", scope: !942, file: !942, line: 229, type: !943, flags: DIFlagPrototyped, spFlags: 0)
!1049 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1050, file: !945, line: 1094)
!1050 = !DISubprogram(name: "erfcf", scope: !942, file: !942, line: 229, type: !1006, flags: DIFlagPrototyped, spFlags: 0)
!1051 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1052, file: !945, line: 1095)
!1052 = !DISubprogram(name: "erfcl", scope: !942, file: !942, line: 229, type: !1010, flags: DIFlagPrototyped, spFlags: 0)
!1053 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1054, file: !945, line: 1097)
!1054 = !DISubprogram(name: "exp2", scope: !942, file: !942, line: 130, type: !943, flags: DIFlagPrototyped, spFlags: 0)
!1055 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1056, file: !945, line: 1098)
!1056 = !DISubprogram(name: "exp2f", scope: !942, file: !942, line: 130, type: !1006, flags: DIFlagPrototyped, spFlags: 0)
!1057 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1058, file: !945, line: 1099)
!1058 = !DISubprogram(name: "exp2l", scope: !942, file: !942, line: 130, type: !1010, flags: DIFlagPrototyped, spFlags: 0)
!1059 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1060, file: !945, line: 1101)
!1060 = !DISubprogram(name: "expm1", scope: !942, file: !942, line: 119, type: !943, flags: DIFlagPrototyped, spFlags: 0)
!1061 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1062, file: !945, line: 1102)
!1062 = !DISubprogram(name: "expm1f", scope: !942, file: !942, line: 119, type: !1006, flags: DIFlagPrototyped, spFlags: 0)
!1063 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1064, file: !945, line: 1103)
!1064 = !DISubprogram(name: "expm1l", scope: !942, file: !942, line: 119, type: !1010, flags: DIFlagPrototyped, spFlags: 0)
!1065 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1066, file: !945, line: 1105)
!1066 = !DISubprogram(name: "fdim", scope: !942, file: !942, line: 326, type: !952, flags: DIFlagPrototyped, spFlags: 0)
!1067 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1068, file: !945, line: 1106)
!1068 = !DISubprogram(name: "fdimf", scope: !942, file: !942, line: 326, type: !1035, flags: DIFlagPrototyped, spFlags: 0)
!1069 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1070, file: !945, line: 1107)
!1070 = !DISubprogram(name: "fdiml", scope: !942, file: !942, line: 326, type: !1039, flags: DIFlagPrototyped, spFlags: 0)
!1071 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1072, file: !945, line: 1109)
!1072 = !DISubprogram(name: "fma", scope: !942, file: !942, line: 335, type: !1073, flags: DIFlagPrototyped, spFlags: 0)
!1073 = !DISubroutineType(types: !1074)
!1074 = !{!677, !677, !677, !677}
!1075 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1076, file: !945, line: 1110)
!1076 = !DISubprogram(name: "fmaf", scope: !942, file: !942, line: 335, type: !1077, flags: DIFlagPrototyped, spFlags: 0)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{!605, !605, !605, !605}
!1079 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1080, file: !945, line: 1111)
!1080 = !DISubprogram(name: "fmal", scope: !942, file: !942, line: 335, type: !1081, flags: DIFlagPrototyped, spFlags: 0)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{!1012, !1012, !1012, !1012}
!1083 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1084, file: !945, line: 1113)
!1084 = !DISubprogram(name: "fmax", scope: !942, file: !942, line: 329, type: !952, flags: DIFlagPrototyped, spFlags: 0)
!1085 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1086, file: !945, line: 1114)
!1086 = !DISubprogram(name: "fmaxf", scope: !942, file: !942, line: 329, type: !1035, flags: DIFlagPrototyped, spFlags: 0)
!1087 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1088, file: !945, line: 1115)
!1088 = !DISubprogram(name: "fmaxl", scope: !942, file: !942, line: 329, type: !1039, flags: DIFlagPrototyped, spFlags: 0)
!1089 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1090, file: !945, line: 1117)
!1090 = !DISubprogram(name: "fmin", scope: !942, file: !942, line: 332, type: !952, flags: DIFlagPrototyped, spFlags: 0)
!1091 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1092, file: !945, line: 1118)
!1092 = !DISubprogram(name: "fminf", scope: !942, file: !942, line: 332, type: !1035, flags: DIFlagPrototyped, spFlags: 0)
!1093 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1094, file: !945, line: 1119)
!1094 = !DISubprogram(name: "fminl", scope: !942, file: !942, line: 332, type: !1039, flags: DIFlagPrototyped, spFlags: 0)
!1095 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1096, file: !945, line: 1121)
!1096 = !DISubprogram(name: "hypot", scope: !942, file: !942, line: 147, type: !952, flags: DIFlagPrototyped, spFlags: 0)
!1097 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1098, file: !945, line: 1122)
!1098 = !DISubprogram(name: "hypotf", scope: !942, file: !942, line: 147, type: !1035, flags: DIFlagPrototyped, spFlags: 0)
!1099 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1100, file: !945, line: 1123)
!1100 = !DISubprogram(name: "hypotl", scope: !942, file: !942, line: 147, type: !1039, flags: DIFlagPrototyped, spFlags: 0)
!1101 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1102, file: !945, line: 1125)
!1102 = !DISubprogram(name: "ilogb", scope: !942, file: !942, line: 280, type: !1103, flags: DIFlagPrototyped, spFlags: 0)
!1103 = !DISubroutineType(types: !1104)
!1104 = !{!611, !677}
!1105 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1106, file: !945, line: 1126)
!1106 = !DISubprogram(name: "ilogbf", scope: !942, file: !942, line: 280, type: !1107, flags: DIFlagPrototyped, spFlags: 0)
!1107 = !DISubroutineType(types: !1108)
!1108 = !{!611, !605}
!1109 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1110, file: !945, line: 1127)
!1110 = !DISubprogram(name: "ilogbl", scope: !942, file: !942, line: 280, type: !1111, flags: DIFlagPrototyped, spFlags: 0)
!1111 = !DISubroutineType(types: !1112)
!1112 = !{!611, !1012}
!1113 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1114, file: !945, line: 1129)
!1114 = !DISubprogram(name: "lgamma", scope: !942, file: !942, line: 230, type: !943, flags: DIFlagPrototyped, spFlags: 0)
!1115 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1116, file: !945, line: 1130)
!1116 = !DISubprogram(name: "lgammaf", scope: !942, file: !942, line: 230, type: !1006, flags: DIFlagPrototyped, spFlags: 0)
!1117 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1118, file: !945, line: 1131)
!1118 = !DISubprogram(name: "lgammal", scope: !942, file: !942, line: 230, type: !1010, flags: DIFlagPrototyped, spFlags: 0)
!1119 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1120, file: !945, line: 1134)
!1120 = !DISubprogram(name: "llrint", scope: !942, file: !942, line: 316, type: !1121, flags: DIFlagPrototyped, spFlags: 0)
!1121 = !DISubroutineType(types: !1122)
!1122 = !{!1123, !677}
!1123 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!1124 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1125, file: !945, line: 1135)
!1125 = !DISubprogram(name: "llrintf", scope: !942, file: !942, line: 316, type: !1126, flags: DIFlagPrototyped, spFlags: 0)
!1126 = !DISubroutineType(types: !1127)
!1127 = !{!1123, !605}
!1128 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1129, file: !945, line: 1136)
!1129 = !DISubprogram(name: "llrintl", scope: !942, file: !942, line: 316, type: !1130, flags: DIFlagPrototyped, spFlags: 0)
!1130 = !DISubroutineType(types: !1131)
!1131 = !{!1123, !1012}
!1132 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1133, file: !945, line: 1138)
!1133 = !DISubprogram(name: "llround", scope: !942, file: !942, line: 322, type: !1121, flags: DIFlagPrototyped, spFlags: 0)
!1134 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1135, file: !945, line: 1139)
!1135 = !DISubprogram(name: "llroundf", scope: !942, file: !942, line: 322, type: !1126, flags: DIFlagPrototyped, spFlags: 0)
!1136 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1137, file: !945, line: 1140)
!1137 = !DISubprogram(name: "llroundl", scope: !942, file: !942, line: 322, type: !1130, flags: DIFlagPrototyped, spFlags: 0)
!1138 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1139, file: !945, line: 1143)
!1139 = !DISubprogram(name: "log1p", scope: !942, file: !942, line: 122, type: !943, flags: DIFlagPrototyped, spFlags: 0)
!1140 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1141, file: !945, line: 1144)
!1141 = !DISubprogram(name: "log1pf", scope: !942, file: !942, line: 122, type: !1006, flags: DIFlagPrototyped, spFlags: 0)
!1142 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1143, file: !945, line: 1145)
!1143 = !DISubprogram(name: "log1pl", scope: !942, file: !942, line: 122, type: !1010, flags: DIFlagPrototyped, spFlags: 0)
!1144 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1145, file: !945, line: 1147)
!1145 = !DISubprogram(name: "log2", scope: !942, file: !942, line: 133, type: !943, flags: DIFlagPrototyped, spFlags: 0)
!1146 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1147, file: !945, line: 1148)
!1147 = !DISubprogram(name: "log2f", scope: !942, file: !942, line: 133, type: !1006, flags: DIFlagPrototyped, spFlags: 0)
!1148 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1149, file: !945, line: 1149)
!1149 = !DISubprogram(name: "log2l", scope: !942, file: !942, line: 133, type: !1010, flags: DIFlagPrototyped, spFlags: 0)
!1150 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1151, file: !945, line: 1151)
!1151 = !DISubprogram(name: "logb", scope: !942, file: !942, line: 125, type: !943, flags: DIFlagPrototyped, spFlags: 0)
!1152 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1153, file: !945, line: 1152)
!1153 = !DISubprogram(name: "logbf", scope: !942, file: !942, line: 125, type: !1006, flags: DIFlagPrototyped, spFlags: 0)
!1154 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1155, file: !945, line: 1153)
!1155 = !DISubprogram(name: "logbl", scope: !942, file: !942, line: 125, type: !1010, flags: DIFlagPrototyped, spFlags: 0)
!1156 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1157, file: !945, line: 1155)
!1157 = !DISubprogram(name: "lrint", scope: !942, file: !942, line: 314, type: !1158, flags: DIFlagPrototyped, spFlags: 0)
!1158 = !DISubroutineType(types: !1159)
!1159 = !{!1160, !677}
!1160 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1161 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1162, file: !945, line: 1156)
!1162 = !DISubprogram(name: "lrintf", scope: !942, file: !942, line: 314, type: !1163, flags: DIFlagPrototyped, spFlags: 0)
!1163 = !DISubroutineType(types: !1164)
!1164 = !{!1160, !605}
!1165 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1166, file: !945, line: 1157)
!1166 = !DISubprogram(name: "lrintl", scope: !942, file: !942, line: 314, type: !1167, flags: DIFlagPrototyped, spFlags: 0)
!1167 = !DISubroutineType(types: !1168)
!1168 = !{!1160, !1012}
!1169 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1170, file: !945, line: 1159)
!1170 = !DISubprogram(name: "lround", scope: !942, file: !942, line: 320, type: !1158, flags: DIFlagPrototyped, spFlags: 0)
!1171 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1172, file: !945, line: 1160)
!1172 = !DISubprogram(name: "lroundf", scope: !942, file: !942, line: 320, type: !1163, flags: DIFlagPrototyped, spFlags: 0)
!1173 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1174, file: !945, line: 1161)
!1174 = !DISubprogram(name: "lroundl", scope: !942, file: !942, line: 320, type: !1167, flags: DIFlagPrototyped, spFlags: 0)
!1175 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1176, file: !945, line: 1163)
!1176 = !DISubprogram(name: "nan", scope: !942, file: !942, line: 201, type: !1177, flags: DIFlagPrototyped, spFlags: 0)
!1177 = !DISubroutineType(types: !1178)
!1178 = !{!677, !1179}
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64)
!1180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !615)
!1181 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1182, file: !945, line: 1164)
!1182 = !DISubprogram(name: "nanf", scope: !942, file: !942, line: 201, type: !1183, flags: DIFlagPrototyped, spFlags: 0)
!1183 = !DISubroutineType(types: !1184)
!1184 = !{!605, !1179}
!1185 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1186, file: !945, line: 1165)
!1186 = !DISubprogram(name: "nanl", scope: !942, file: !942, line: 201, type: !1187, flags: DIFlagPrototyped, spFlags: 0)
!1187 = !DISubroutineType(types: !1188)
!1188 = !{!1012, !1179}
!1189 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1190, file: !945, line: 1167)
!1190 = !DISubprogram(name: "nearbyint", scope: !942, file: !942, line: 294, type: !943, flags: DIFlagPrototyped, spFlags: 0)
!1191 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1192, file: !945, line: 1168)
!1192 = !DISubprogram(name: "nearbyintf", scope: !942, file: !942, line: 294, type: !1006, flags: DIFlagPrototyped, spFlags: 0)
!1193 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1194, file: !945, line: 1169)
!1194 = !DISubprogram(name: "nearbyintl", scope: !942, file: !942, line: 294, type: !1010, flags: DIFlagPrototyped, spFlags: 0)
!1195 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1196, file: !945, line: 1171)
!1196 = !DISubprogram(name: "nextafter", scope: !942, file: !942, line: 259, type: !952, flags: DIFlagPrototyped, spFlags: 0)
!1197 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1198, file: !945, line: 1172)
!1198 = !DISubprogram(name: "nextafterf", scope: !942, file: !942, line: 259, type: !1035, flags: DIFlagPrototyped, spFlags: 0)
!1199 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1200, file: !945, line: 1173)
!1200 = !DISubprogram(name: "nextafterl", scope: !942, file: !942, line: 259, type: !1039, flags: DIFlagPrototyped, spFlags: 0)
!1201 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1202, file: !945, line: 1175)
!1202 = !DISubprogram(name: "nexttoward", scope: !942, file: !942, line: 261, type: !1203, flags: DIFlagPrototyped, spFlags: 0)
!1203 = !DISubroutineType(types: !1204)
!1204 = !{!677, !677, !1012}
!1205 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1206, file: !945, line: 1176)
!1206 = !DISubprogram(name: "nexttowardf", scope: !942, file: !942, line: 261, type: !1207, flags: DIFlagPrototyped, spFlags: 0)
!1207 = !DISubroutineType(types: !1208)
!1208 = !{!605, !605, !1012}
!1209 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1210, file: !945, line: 1177)
!1210 = !DISubprogram(name: "nexttowardl", scope: !942, file: !942, line: 261, type: !1039, flags: DIFlagPrototyped, spFlags: 0)
!1211 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1212, file: !945, line: 1179)
!1212 = !DISubprogram(name: "remainder", scope: !942, file: !942, line: 272, type: !952, flags: DIFlagPrototyped, spFlags: 0)
!1213 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1214, file: !945, line: 1180)
!1214 = !DISubprogram(name: "remainderf", scope: !942, file: !942, line: 272, type: !1035, flags: DIFlagPrototyped, spFlags: 0)
!1215 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1216, file: !945, line: 1181)
!1216 = !DISubprogram(name: "remainderl", scope: !942, file: !942, line: 272, type: !1039, flags: DIFlagPrototyped, spFlags: 0)
!1217 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1218, file: !945, line: 1183)
!1218 = !DISubprogram(name: "remquo", scope: !942, file: !942, line: 307, type: !1219, flags: DIFlagPrototyped, spFlags: 0)
!1219 = !DISubroutineType(types: !1220)
!1220 = !{!677, !677, !677, !972}
!1221 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1222, file: !945, line: 1184)
!1222 = !DISubprogram(name: "remquof", scope: !942, file: !942, line: 307, type: !1223, flags: DIFlagPrototyped, spFlags: 0)
!1223 = !DISubroutineType(types: !1224)
!1224 = !{!605, !605, !605, !972}
!1225 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1226, file: !945, line: 1185)
!1226 = !DISubprogram(name: "remquol", scope: !942, file: !942, line: 307, type: !1227, flags: DIFlagPrototyped, spFlags: 0)
!1227 = !DISubroutineType(types: !1228)
!1228 = !{!1012, !1012, !1012, !972}
!1229 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1230, file: !945, line: 1187)
!1230 = !DISubprogram(name: "rint", scope: !942, file: !942, line: 256, type: !943, flags: DIFlagPrototyped, spFlags: 0)
!1231 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1232, file: !945, line: 1188)
!1232 = !DISubprogram(name: "rintf", scope: !942, file: !942, line: 256, type: !1006, flags: DIFlagPrototyped, spFlags: 0)
!1233 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1234, file: !945, line: 1189)
!1234 = !DISubprogram(name: "rintl", scope: !942, file: !942, line: 256, type: !1010, flags: DIFlagPrototyped, spFlags: 0)
!1235 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1236, file: !945, line: 1191)
!1236 = !DISubprogram(name: "round", scope: !942, file: !942, line: 298, type: !943, flags: DIFlagPrototyped, spFlags: 0)
!1237 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1238, file: !945, line: 1192)
!1238 = !DISubprogram(name: "roundf", scope: !942, file: !942, line: 298, type: !1006, flags: DIFlagPrototyped, spFlags: 0)
!1239 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1240, file: !945, line: 1193)
!1240 = !DISubprogram(name: "roundl", scope: !942, file: !942, line: 298, type: !1010, flags: DIFlagPrototyped, spFlags: 0)
!1241 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1242, file: !945, line: 1195)
!1242 = !DISubprogram(name: "scalbln", scope: !942, file: !942, line: 290, type: !1243, flags: DIFlagPrototyped, spFlags: 0)
!1243 = !DISubroutineType(types: !1244)
!1244 = !{!677, !677, !1160}
!1245 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1246, file: !945, line: 1196)
!1246 = !DISubprogram(name: "scalblnf", scope: !942, file: !942, line: 290, type: !1247, flags: DIFlagPrototyped, spFlags: 0)
!1247 = !DISubroutineType(types: !1248)
!1248 = !{!605, !605, !1160}
!1249 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1250, file: !945, line: 1197)
!1250 = !DISubprogram(name: "scalblnl", scope: !942, file: !942, line: 290, type: !1251, flags: DIFlagPrototyped, spFlags: 0)
!1251 = !DISubroutineType(types: !1252)
!1252 = !{!1012, !1012, !1160}
!1253 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1254, file: !945, line: 1199)
!1254 = !DISubprogram(name: "scalbn", scope: !942, file: !942, line: 276, type: !975, flags: DIFlagPrototyped, spFlags: 0)
!1255 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1256, file: !945, line: 1200)
!1256 = !DISubprogram(name: "scalbnf", scope: !942, file: !942, line: 276, type: !1257, flags: DIFlagPrototyped, spFlags: 0)
!1257 = !DISubroutineType(types: !1258)
!1258 = !{!605, !605, !611}
!1259 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1260, file: !945, line: 1201)
!1260 = !DISubprogram(name: "scalbnl", scope: !942, file: !942, line: 276, type: !1261, flags: DIFlagPrototyped, spFlags: 0)
!1261 = !DISubroutineType(types: !1262)
!1262 = !{!1012, !1012, !611}
!1263 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1264, file: !945, line: 1203)
!1264 = !DISubprogram(name: "tgamma", scope: !942, file: !942, line: 235, type: !943, flags: DIFlagPrototyped, spFlags: 0)
!1265 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1266, file: !945, line: 1204)
!1266 = !DISubprogram(name: "tgammaf", scope: !942, file: !942, line: 235, type: !1006, flags: DIFlagPrototyped, spFlags: 0)
!1267 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1268, file: !945, line: 1205)
!1268 = !DISubprogram(name: "tgammal", scope: !942, file: !942, line: 235, type: !1010, flags: DIFlagPrototyped, spFlags: 0)
!1269 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1270, file: !945, line: 1207)
!1270 = !DISubprogram(name: "trunc", scope: !942, file: !942, line: 302, type: !943, flags: DIFlagPrototyped, spFlags: 0)
!1271 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1272, file: !945, line: 1208)
!1272 = !DISubprogram(name: "truncf", scope: !942, file: !942, line: 302, type: !1006, flags: DIFlagPrototyped, spFlags: 0)
!1273 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1274, file: !945, line: 1209)
!1274 = !DISubprogram(name: "truncl", scope: !942, file: !942, line: 302, type: !1010, flags: DIFlagPrototyped, spFlags: 0)
!1275 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !15, entity: !1276, file: !1280, line: 38)
!1276 = !DISubprogram(name: "abs", linkageName: "_ZSt3absg", scope: !934, file: !939, line: 103, type: !1277, flags: DIFlagPrototyped, spFlags: 0)
!1277 = !DISubroutineType(types: !1278)
!1278 = !{!1279, !1279}
!1279 = !DIBasicType(name: "__float128", size: 128, encoding: DW_ATE_float)
!1280 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/math.h", directory: "")
!1281 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !15, entity: !1282, file: !1280, line: 54)
!1282 = !DISubprogram(name: "modf", linkageName: "_ZSt4modfePe", scope: !934, file: !945, line: 380, type: !1283, flags: DIFlagPrototyped, spFlags: 0)
!1283 = !DISubroutineType(types: !1284)
!1284 = !{!1012, !1012, !1285}
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1286 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1287, file: !1289, line: 127)
!1287 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !936, line: 62, baseType: !1288)
!1288 = !DICompositeType(tag: DW_TAG_structure_type, file: !936, line: 58, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!1289 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cstdlib", directory: "")
!1290 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1291, file: !1289, line: 128)
!1291 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !936, line: 70, baseType: !1292)
!1292 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !936, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !1293, identifier: "_ZTS6ldiv_t")
!1293 = !{!1294, !1295}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !1292, file: !936, line: 68, baseType: !1160, size: 64)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !1292, file: !936, line: 69, baseType: !1160, size: 64, offset: 64)
!1296 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1297, file: !1289, line: 130)
!1297 = !DISubprogram(name: "abort", scope: !936, file: !936, line: 591, type: !1298, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!1298 = !DISubroutineType(types: !1299)
!1299 = !{null}
!1300 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1301, file: !1289, line: 134)
!1301 = !DISubprogram(name: "atexit", scope: !936, file: !936, line: 595, type: !1302, flags: DIFlagPrototyped, spFlags: 0)
!1302 = !DISubroutineType(types: !1303)
!1303 = !{!611, !1304}
!1304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64)
!1305 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1306, file: !1289, line: 137)
!1306 = !DISubprogram(name: "at_quick_exit", scope: !936, file: !936, line: 600, type: !1302, flags: DIFlagPrototyped, spFlags: 0)
!1307 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1308, file: !1289, line: 140)
!1308 = !DISubprogram(name: "atof", scope: !936, file: !936, line: 101, type: !1177, flags: DIFlagPrototyped, spFlags: 0)
!1309 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1310, file: !1289, line: 141)
!1310 = !DISubprogram(name: "atoi", scope: !936, file: !936, line: 104, type: !1311, flags: DIFlagPrototyped, spFlags: 0)
!1311 = !DISubroutineType(types: !1312)
!1312 = !{!611, !1179}
!1313 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1314, file: !1289, line: 142)
!1314 = !DISubprogram(name: "atol", scope: !936, file: !936, line: 107, type: !1315, flags: DIFlagPrototyped, spFlags: 0)
!1315 = !DISubroutineType(types: !1316)
!1316 = !{!1160, !1179}
!1317 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1318, file: !1289, line: 143)
!1318 = !DISubprogram(name: "bsearch", scope: !936, file: !936, line: 820, type: !1319, flags: DIFlagPrototyped, spFlags: 0)
!1319 = !DISubroutineType(types: !1320)
!1320 = !{!741, !1321, !1321, !1323, !1323, !1326}
!1321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1322, size: 64)
!1322 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1323 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1324, line: 46, baseType: !1325)
!1324 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!1325 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1326 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !936, line: 808, baseType: !1327)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64)
!1328 = !DISubroutineType(types: !1329)
!1329 = !{!611, !1321, !1321}
!1330 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1331, file: !1289, line: 144)
!1331 = !DISubprogram(name: "calloc", scope: !936, file: !936, line: 542, type: !1332, flags: DIFlagPrototyped, spFlags: 0)
!1332 = !DISubroutineType(types: !1333)
!1333 = !{!741, !1323, !1323}
!1334 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1335, file: !1289, line: 145)
!1335 = !DISubprogram(name: "div", scope: !936, file: !936, line: 852, type: !1336, flags: DIFlagPrototyped, spFlags: 0)
!1336 = !DISubroutineType(types: !1337)
!1337 = !{!1287, !611, !611}
!1338 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1339, file: !1289, line: 146)
!1339 = !DISubprogram(name: "exit", scope: !936, file: !936, line: 617, type: !1340, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!1340 = !DISubroutineType(types: !1341)
!1341 = !{null, !611}
!1342 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1343, file: !1289, line: 147)
!1343 = !DISubprogram(name: "free", scope: !936, file: !936, line: 565, type: !1344, flags: DIFlagPrototyped, spFlags: 0)
!1344 = !DISubroutineType(types: !1345)
!1345 = !{null, !741}
!1346 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1347, file: !1289, line: 148)
!1347 = !DISubprogram(name: "getenv", scope: !936, file: !936, line: 634, type: !1348, flags: DIFlagPrototyped, spFlags: 0)
!1348 = !DISubroutineType(types: !1349)
!1349 = !{!1350, !1179}
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!1351 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1352, file: !1289, line: 149)
!1352 = !DISubprogram(name: "labs", scope: !936, file: !936, line: 841, type: !1353, flags: DIFlagPrototyped, spFlags: 0)
!1353 = !DISubroutineType(types: !1354)
!1354 = !{!1160, !1160}
!1355 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1356, file: !1289, line: 150)
!1356 = !DISubprogram(name: "ldiv", scope: !936, file: !936, line: 854, type: !1357, flags: DIFlagPrototyped, spFlags: 0)
!1357 = !DISubroutineType(types: !1358)
!1358 = !{!1291, !1160, !1160}
!1359 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1360, file: !1289, line: 151)
!1360 = !DISubprogram(name: "malloc", scope: !936, file: !936, line: 539, type: !1361, flags: DIFlagPrototyped, spFlags: 0)
!1361 = !DISubroutineType(types: !1362)
!1362 = !{!741, !1323}
!1363 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1364, file: !1289, line: 153)
!1364 = !DISubprogram(name: "mblen", scope: !936, file: !936, line: 922, type: !1365, flags: DIFlagPrototyped, spFlags: 0)
!1365 = !DISubroutineType(types: !1366)
!1366 = !{!611, !1179, !1323}
!1367 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1368, file: !1289, line: 154)
!1368 = !DISubprogram(name: "mbstowcs", scope: !936, file: !936, line: 933, type: !1369, flags: DIFlagPrototyped, spFlags: 0)
!1369 = !DISubroutineType(types: !1370)
!1370 = !{!1323, !1371, !1374, !1323}
!1371 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1372)
!1372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1373, size: 64)
!1373 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!1374 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1179)
!1375 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1376, file: !1289, line: 155)
!1376 = !DISubprogram(name: "mbtowc", scope: !936, file: !936, line: 925, type: !1377, flags: DIFlagPrototyped, spFlags: 0)
!1377 = !DISubroutineType(types: !1378)
!1378 = !{!611, !1371, !1374, !1323}
!1379 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1380, file: !1289, line: 157)
!1380 = !DISubprogram(name: "qsort", scope: !936, file: !936, line: 830, type: !1381, flags: DIFlagPrototyped, spFlags: 0)
!1381 = !DISubroutineType(types: !1382)
!1382 = !{null, !741, !1323, !1323, !1326}
!1383 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1384, file: !1289, line: 160)
!1384 = !DISubprogram(name: "quick_exit", scope: !936, file: !936, line: 623, type: !1340, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!1385 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1386, file: !1289, line: 163)
!1386 = !DISubprogram(name: "rand", scope: !936, file: !936, line: 453, type: !1387, flags: DIFlagPrototyped, spFlags: 0)
!1387 = !DISubroutineType(types: !1388)
!1388 = !{!611}
!1389 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1390, file: !1289, line: 164)
!1390 = !DISubprogram(name: "realloc", scope: !936, file: !936, line: 550, type: !1391, flags: DIFlagPrototyped, spFlags: 0)
!1391 = !DISubroutineType(types: !1392)
!1392 = !{!741, !741, !1323}
!1393 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1394, file: !1289, line: 165)
!1394 = !DISubprogram(name: "srand", scope: !936, file: !936, line: 455, type: !1395, flags: DIFlagPrototyped, spFlags: 0)
!1395 = !DISubroutineType(types: !1396)
!1396 = !{null, !7}
!1397 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1398, file: !1289, line: 166)
!1398 = !DISubprogram(name: "strtod", scope: !936, file: !936, line: 117, type: !1399, flags: DIFlagPrototyped, spFlags: 0)
!1399 = !DISubroutineType(types: !1400)
!1400 = !{!677, !1374, !1401}
!1401 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1402)
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64)
!1403 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1404, file: !1289, line: 167)
!1404 = !DISubprogram(name: "strtol", scope: !936, file: !936, line: 176, type: !1405, flags: DIFlagPrototyped, spFlags: 0)
!1405 = !DISubroutineType(types: !1406)
!1406 = !{!1160, !1374, !1401, !611}
!1407 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1408, file: !1289, line: 168)
!1408 = !DISubprogram(name: "strtoul", scope: !936, file: !936, line: 180, type: !1409, flags: DIFlagPrototyped, spFlags: 0)
!1409 = !DISubroutineType(types: !1410)
!1410 = !{!1325, !1374, !1401, !611}
!1411 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1412, file: !1289, line: 169)
!1412 = !DISubprogram(name: "system", scope: !936, file: !936, line: 784, type: !1311, flags: DIFlagPrototyped, spFlags: 0)
!1413 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1414, file: !1289, line: 171)
!1414 = !DISubprogram(name: "wcstombs", scope: !936, file: !936, line: 936, type: !1415, flags: DIFlagPrototyped, spFlags: 0)
!1415 = !DISubroutineType(types: !1416)
!1416 = !{!1323, !1417, !1418, !1323}
!1417 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1350)
!1418 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1419)
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1420, size: 64)
!1420 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1373)
!1421 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1422, file: !1289, line: 172)
!1422 = !DISubprogram(name: "wctomb", scope: !936, file: !936, line: 929, type: !1423, flags: DIFlagPrototyped, spFlags: 0)
!1423 = !DISubroutineType(types: !1424)
!1424 = !{!611, !1350, !1373}
!1425 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1426, entity: !1427, file: !1289, line: 200)
!1426 = !DINamespace(name: "__gnu_cxx", scope: null)
!1427 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !936, line: 80, baseType: !1428)
!1428 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !936, line: 76, size: 128, flags: DIFlagTypePassByValue, elements: !1429, identifier: "_ZTS7lldiv_t")
!1429 = !{!1430, !1431}
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !1428, file: !936, line: 78, baseType: !1123, size: 64)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !1428, file: !936, line: 79, baseType: !1123, size: 64, offset: 64)
!1432 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1426, entity: !1433, file: !1289, line: 206)
!1433 = !DISubprogram(name: "_Exit", scope: !936, file: !936, line: 629, type: !1340, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!1434 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1426, entity: !1435, file: !1289, line: 210)
!1435 = !DISubprogram(name: "llabs", scope: !936, file: !936, line: 844, type: !1436, flags: DIFlagPrototyped, spFlags: 0)
!1436 = !DISubroutineType(types: !1437)
!1437 = !{!1123, !1123}
!1438 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1426, entity: !1439, file: !1289, line: 216)
!1439 = !DISubprogram(name: "lldiv", scope: !936, file: !936, line: 858, type: !1440, flags: DIFlagPrototyped, spFlags: 0)
!1440 = !DISubroutineType(types: !1441)
!1441 = !{!1427, !1123, !1123}
!1442 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1426, entity: !1443, file: !1289, line: 227)
!1443 = !DISubprogram(name: "atoll", scope: !936, file: !936, line: 112, type: !1444, flags: DIFlagPrototyped, spFlags: 0)
!1444 = !DISubroutineType(types: !1445)
!1445 = !{!1123, !1179}
!1446 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1426, entity: !1447, file: !1289, line: 228)
!1447 = !DISubprogram(name: "strtoll", scope: !936, file: !936, line: 200, type: !1448, flags: DIFlagPrototyped, spFlags: 0)
!1448 = !DISubroutineType(types: !1449)
!1449 = !{!1123, !1374, !1401, !611}
!1450 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1426, entity: !1451, file: !1289, line: 229)
!1451 = !DISubprogram(name: "strtoull", scope: !936, file: !936, line: 205, type: !1452, flags: DIFlagPrototyped, spFlags: 0)
!1452 = !DISubroutineType(types: !1453)
!1453 = !{!1454, !1374, !1401, !611}
!1454 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1455 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1426, entity: !1456, file: !1289, line: 231)
!1456 = !DISubprogram(name: "strtof", scope: !936, file: !936, line: 123, type: !1457, flags: DIFlagPrototyped, spFlags: 0)
!1457 = !DISubroutineType(types: !1458)
!1458 = !{!605, !1374, !1401}
!1459 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1426, entity: !1460, file: !1289, line: 232)
!1460 = !DISubprogram(name: "strtold", scope: !936, file: !936, line: 126, type: !1461, flags: DIFlagPrototyped, spFlags: 0)
!1461 = !DISubroutineType(types: !1462)
!1462 = !{!1012, !1374, !1401}
!1463 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1427, file: !1289, line: 240)
!1464 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1433, file: !1289, line: 242)
!1465 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1435, file: !1289, line: 244)
!1466 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1467, file: !1289, line: 245)
!1467 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !1426, file: !1289, line: 213, type: !1440, flags: DIFlagPrototyped, spFlags: 0)
!1468 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1439, file: !1289, line: 246)
!1469 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1443, file: !1289, line: 248)
!1470 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1456, file: !1289, line: 249)
!1471 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1447, file: !1289, line: 250)
!1472 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1451, file: !1289, line: 251)
!1473 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !934, entity: !1460, file: !1289, line: 252)
!1474 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !15, entity: !1297, file: !1475, line: 38)
!1475 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/stdlib.h", directory: "")
!1476 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !15, entity: !1301, file: !1475, line: 39)
!1477 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !15, entity: !1339, file: !1475, line: 40)
!1478 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !15, entity: !1306, file: !1475, line: 43)
!1479 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !15, entity: !1384, file: !1475, line: 46)
!1480 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !15, entity: !1287, file: !1475, line: 51)
!1481 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !15, entity: !1291, file: !1475, line: 52)
!1482 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !15, entity: !1276, file: !1475, line: 54)
!1483 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !15, entity: !1308, file: !1475, line: 55)
!1484 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !15, entity: !1310, file: !1475, line: 56)
!1485 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !15, entity: !1314, file: !1475, line: 57)
!1486 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !15, entity: !1318, file: !1475, line: 58)
!1487 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !15, entity: !1331, file: !1475, line: 59)
!1488 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !15, entity: !1467, file: !1475, line: 60)
!1489 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !15, entity: !1343, file: !1475, line: 61)
!1490 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !15, entity: !1347, file: !1475, line: 62)
!1491 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !15, entity: !1352, file: !1475, line: 63)
!1492 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !15, entity: !1356, file: !1475, line: 64)
!1493 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !15, entity: !1360, file: !1475, line: 65)
!1494 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !15, entity: !1364, file: !1475, line: 67)
!1495 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !15, entity: !1368, file: !1475, line: 68)
!1496 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !15, entity: !1376, file: !1475, line: 69)
!1497 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !15, entity: !1380, file: !1475, line: 71)
!1498 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !15, entity: !1386, file: !1475, line: 72)
!1499 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !15, entity: !1390, file: !1475, line: 73)
!1500 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !15, entity: !1394, file: !1475, line: 74)
!1501 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !15, entity: !1398, file: !1475, line: 75)
!1502 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !15, entity: !1404, file: !1475, line: 76)
!1503 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !15, entity: !1408, file: !1475, line: 77)
