; ModuleID = 'bbox.cpp'
source_filename = "bbox.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"struct.pov::BBox_Tree_Struct" = type { i16, i16, %"struct.pov::Bounding_Box_Struct", %"struct.pov::BBox_Tree_Struct"** }
%"struct.pov::Bounding_Box_Struct" = type { [3 x float], [3 x float] }
%"struct.pov::Priority_Queue_Struct" = type { i32, i32, %"struct.pov::Qelem_Struct"* }
%"struct.pov::Qelem_Struct" = type { double, %"struct.pov::BBox_Tree_Struct"* }
%"struct.pov::Frame_Struct" = type { %"struct.pov::Camera_Struct"*, i32, i32, i32, %"struct.pov::Light_Source_Struct"*, %"struct.pov::Object_Struct"*, double, double, double, [5 x float], [5 x float], [5 x float], %"struct.pov::Media_Struct"*, %"struct.pov::Fog_Struct"*, %"struct.pov::Rainbow_Struct"*, %"struct.pov::Skysphere_Struct"*, %"struct.pov::light_group_light_struct"* }
%"struct.pov::Camera_Struct" = type { [3 x double], [3 x double], [3 x double], [3 x double], [3 x double], [3 x double], [3 x double], double, double, i32, double, double, i32, double, double, double, %"struct.pov::Tnormal_Struct"*, %"struct.pov::Transform_Struct"* }
%"struct.pov::Tnormal_Struct" = type { i16, i16, i16, i32, float, float, float, %"struct.pov::Warps_Struct"*, %"struct.pov::Pattern_Struct"*, %"struct.pov::Blend_Map_Struct"*, %union.anon.0, float, float }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "numberOfFiniteObjects", linkageName: "_ZN3pov21numberOfFiniteObjectsE", scope: !2, file: !3, line: 92, type: !4, isLocal: false, isDefinition: true)
!2 = !DINamespace(name: "pov", scope: null)
!3 = !DIFile(filename: "bbox.cpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "numberOfInfiniteObjects", linkageName: "_ZN3pov23numberOfInfiniteObjectsE", scope: !2, file: !3, line: 92, type: !4, isLocal: false, isDefinition: true)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(name: "numberOfLightSources", linkageName: "_ZN3pov20numberOfLightSourcesE", scope: !2, file: !3, line: 92, type: !4, isLocal: false, isDefinition: true)
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "Root_Object", linkageName: "_ZN3pov11Root_ObjectE", scope: !2, file: !3, line: 113, type: !11, isLocal: false, isDefinition: true)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_TREE", scope: !2, file: !13, line: 1546, baseType: !14)
!13 = !DIFile(filename: "./frame.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BBox_Tree_Struct", scope: !2, file: !13, line: 1548, size: 320, flags: DIFlagTypePassByValue, elements: !15, identifier: "_ZTSN3pov16BBox_Tree_StructE")
!15 = !{!16, !18, !19, !31}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "Infinite", scope: !14, file: !13, line: 1550, baseType: !17, size: 16)
!17 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "Entries", scope: !14, file: !13, line: 1551, baseType: !17, size: 16, offset: 16)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !14, file: !13, line: 1552, baseType: !20, size: 192, offset: 32)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", scope: !2, file: !13, line: 888, baseType: !21)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Bounding_Box_Struct", scope: !2, file: !13, line: 890, size: 192, flags: DIFlagTypePassByValue, elements: !22, identifier: "_ZTSN3pov19Bounding_Box_StructE")
!22 = !{!23, !30}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "Lower_Left", scope: !21, file: !13, line: 892, baseType: !24, size: 96)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VECT", scope: !2, file: !13, line: 886, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 96, elements: !28)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VAL", scope: !2, file: !13, line: 884, baseType: !27)
!27 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!28 = !{!29}
!29 = !DISubrange(count: 3)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "Lengths", scope: !21, file: !13, line: 892, baseType: !24, size: 96, offset: 96)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "Node", scope: !14, file: !13, line: 1553, baseType: !32, size: 64, offset: 256)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "Frame_Queue", linkageName: "_ZN3povL11Frame_QueueE", scope: !2, file: !3, line: 109, type: !35, isLocal: true, isDefinition: true)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "PRIORITY_QUEUE", scope: !2, file: !37, line: 55, baseType: !38)
!37 = !DIFile(filename: "./bbox.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Priority_Queue_Struct", scope: !2, file: !37, line: 71, size: 128, flags: DIFlagTypePassByValue, elements: !39, identifier: "_ZTSN3pov21Priority_Queue_StructE")
!39 = !{!40, !42, !43}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "QSize", scope: !38, file: !37, line: 73, baseType: !41, size: 32)
!41 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "Max_QSize", scope: !38, file: !37, line: 74, baseType: !41, size: 32, offset: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "Queue", scope: !38, file: !37, line: 75, baseType: !44, size: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "QELEM", scope: !2, file: !37, line: 54, baseType: !46)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Qelem_Struct", scope: !2, file: !37, line: 65, size: 128, flags: DIFlagTypePassByValue, elements: !47, identifier: "_ZTSN3pov12Qelem_StructE")
!47 = !{!48, !50}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "Depth", scope: !46, file: !37, line: 67, baseType: !49, size: 64)
!49 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "Node", scope: !46, file: !37, line: 68, baseType: !11, size: 64, offset: 64)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "maxfinitecount", linkageName: "_ZN3povL14maxfinitecountE", scope: !2, file: !3, line: 105, type: !4, isLocal: true, isDefinition: true)
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression())
!54 = distinct !DIGlobalVariable(name: "Axis", linkageName: "_ZN3povL4AxisE", scope: !2, file: !3, line: 101, type: !55, isLocal: true, isDefinition: true)
!55 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!56 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !57, retainedTypes: !191, globals: !293, imports: !299, splitDebugInlining: false, nameTableKind: None)
!57 = !{!58, !64}
!58 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !2, file: !13, line: 706, baseType: !41, size: 32, elements: !59)
!59 = !{!60, !61, !62, !63}
!60 = !DIEnumerator(name: "X", value: 0, isUnsigned: true)
!61 = !DIEnumerator(name: "Y", value: 1, isUnsigned: true)
!62 = !DIEnumerator(name: "Z", value: 2, isUnsigned: true)
!63 = !DIEnumerator(name: "T", value: 3, isUnsigned: true)
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "STATS", scope: !2, file: !65, line: 149, baseType: !41, size: 32, elements: !66, identifier: "_ZTSN3pov5STATSE")
!65 = !DIFile(filename: "./povray.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!66 = !{!67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190}
!67 = !DIEnumerator(name: "Number_Of_Pixels", value: 0, isUnsigned: true)
!68 = !DIEnumerator(name: "Number_Of_Pixels_Supersampled", value: 1, isUnsigned: true)
!69 = !DIEnumerator(name: "Number_Of_Samples", value: 2, isUnsigned: true)
!70 = !DIEnumerator(name: "Number_Of_Rays", value: 3, isUnsigned: true)
!71 = !DIEnumerator(name: "Calls_To_DNoise", value: 4, isUnsigned: true)
!72 = !DIEnumerator(name: "Calls_To_Noise", value: 5, isUnsigned: true)
!73 = !DIEnumerator(name: "ADC_Saves", value: 6, isUnsigned: true)
!74 = !DIEnumerator(name: "Istack_overflows", value: 7, isUnsigned: true)
!75 = !DIEnumerator(name: "Ray_RBezier_Tests", value: 8, isUnsigned: true)
!76 = !DIEnumerator(name: "Ray_RBezier_Tests_Succeeded", value: 9, isUnsigned: true)
!77 = !DIEnumerator(name: "Ray_Bicubic_Tests", value: 10, isUnsigned: true)
!78 = !DIEnumerator(name: "Ray_Bicubic_Tests_Succeeded", value: 11, isUnsigned: true)
!79 = !DIEnumerator(name: "Ray_Blob_Tests", value: 12, isUnsigned: true)
!80 = !DIEnumerator(name: "Ray_Blob_Tests_Succeeded", value: 13, isUnsigned: true)
!81 = !DIEnumerator(name: "Blob_Element_Tests", value: 14, isUnsigned: true)
!82 = !DIEnumerator(name: "Blob_Element_Tests_Succeeded", value: 15, isUnsigned: true)
!83 = !DIEnumerator(name: "Blob_Bound_Tests", value: 16, isUnsigned: true)
!84 = !DIEnumerator(name: "Blob_Bound_Tests_Succeeded", value: 17, isUnsigned: true)
!85 = !DIEnumerator(name: "Ray_Box_Tests", value: 18, isUnsigned: true)
!86 = !DIEnumerator(name: "Ray_Box_Tests_Succeeded", value: 19, isUnsigned: true)
!87 = !DIEnumerator(name: "Ray_Cone_Tests", value: 20, isUnsigned: true)
!88 = !DIEnumerator(name: "Ray_Cone_Tests_Succeeded", value: 21, isUnsigned: true)
!89 = !DIEnumerator(name: "Ray_CSG_Intersection_Tests", value: 22, isUnsigned: true)
!90 = !DIEnumerator(name: "Ray_CSG_Intersection_Tests_Succeeded", value: 23, isUnsigned: true)
!91 = !DIEnumerator(name: "Ray_CSG_Merge_Tests", value: 24, isUnsigned: true)
!92 = !DIEnumerator(name: "Ray_CSG_Merge_Tests_Succeeded", value: 25, isUnsigned: true)
!93 = !DIEnumerator(name: "Ray_CSG_Union_Tests", value: 26, isUnsigned: true)
!94 = !DIEnumerator(name: "Ray_CSG_Union_Tests_Succeeded", value: 27, isUnsigned: true)
!95 = !DIEnumerator(name: "Ray_Disc_Tests", value: 28, isUnsigned: true)
!96 = !DIEnumerator(name: "Ray_Disc_Tests_Succeeded", value: 29, isUnsigned: true)
!97 = !DIEnumerator(name: "Ray_Fractal_Tests", value: 30, isUnsigned: true)
!98 = !DIEnumerator(name: "Ray_Fractal_Tests_Succeeded", value: 31, isUnsigned: true)
!99 = !DIEnumerator(name: "Ray_HField_Tests", value: 32, isUnsigned: true)
!100 = !DIEnumerator(name: "Ray_HField_Tests_Succeeded", value: 33, isUnsigned: true)
!101 = !DIEnumerator(name: "Ray_HField_Box_Tests", value: 34, isUnsigned: true)
!102 = !DIEnumerator(name: "Ray_HField_Box_Tests_Succeeded", value: 35, isUnsigned: true)
!103 = !DIEnumerator(name: "Ray_HField_Triangle_Tests", value: 36, isUnsigned: true)
!104 = !DIEnumerator(name: "Ray_HField_Triangle_Tests_Succeeded", value: 37, isUnsigned: true)
!105 = !DIEnumerator(name: "Ray_HField_Block_Tests", value: 38, isUnsigned: true)
!106 = !DIEnumerator(name: "Ray_HField_Block_Tests_Succeeded", value: 39, isUnsigned: true)
!107 = !DIEnumerator(name: "Ray_HField_Cell_Tests", value: 40, isUnsigned: true)
!108 = !DIEnumerator(name: "Ray_HField_Cell_Tests_Succeeded", value: 41, isUnsigned: true)
!109 = !DIEnumerator(name: "Ray_IsoSurface_Tests", value: 42, isUnsigned: true)
!110 = !DIEnumerator(name: "Ray_IsoSurface_Tests_Succeeded", value: 43, isUnsigned: true)
!111 = !DIEnumerator(name: "Ray_IsoSurface_Bound_Tests", value: 44, isUnsigned: true)
!112 = !DIEnumerator(name: "Ray_IsoSurface_Bound_Tests_Succeeded", value: 45, isUnsigned: true)
!113 = !DIEnumerator(name: "Ray_IsoSurface_Cache", value: 46, isUnsigned: true)
!114 = !DIEnumerator(name: "Ray_IsoSurface_Cache_Succeeded", value: 47, isUnsigned: true)
!115 = !DIEnumerator(name: "Ray_Lathe_Tests", value: 48, isUnsigned: true)
!116 = !DIEnumerator(name: "Ray_Lathe_Tests_Succeeded", value: 49, isUnsigned: true)
!117 = !DIEnumerator(name: "Lathe_Bound_Tests", value: 50, isUnsigned: true)
!118 = !DIEnumerator(name: "Lathe_Bound_Tests_Succeeded", value: 51, isUnsigned: true)
!119 = !DIEnumerator(name: "Ray_Mesh_Tests", value: 52, isUnsigned: true)
!120 = !DIEnumerator(name: "Ray_Mesh_Tests_Succeeded", value: 53, isUnsigned: true)
!121 = !DIEnumerator(name: "Ray_Plane_Tests", value: 54, isUnsigned: true)
!122 = !DIEnumerator(name: "Ray_Plane_Tests_Succeeded", value: 55, isUnsigned: true)
!123 = !DIEnumerator(name: "Ray_Polygon_Tests", value: 56, isUnsigned: true)
!124 = !DIEnumerator(name: "Ray_Polygon_Tests_Succeeded", value: 57, isUnsigned: true)
!125 = !DIEnumerator(name: "Ray_Prism_Tests", value: 58, isUnsigned: true)
!126 = !DIEnumerator(name: "Ray_Prism_Tests_Succeeded", value: 59, isUnsigned: true)
!127 = !DIEnumerator(name: "Prism_Bound_Tests", value: 60, isUnsigned: true)
!128 = !DIEnumerator(name: "Prism_Bound_Tests_Succeeded", value: 61, isUnsigned: true)
!129 = !DIEnumerator(name: "Ray_Parametric_Tests", value: 62, isUnsigned: true)
!130 = !DIEnumerator(name: "Ray_Parametric_Tests_Succeeded", value: 63, isUnsigned: true)
!131 = !DIEnumerator(name: "Ray_Par_Bound_Tests", value: 64, isUnsigned: true)
!132 = !DIEnumerator(name: "Ray_Par_Bound_Tests_Succeeded", value: 65, isUnsigned: true)
!133 = !DIEnumerator(name: "Ray_Quadric_Tests", value: 66, isUnsigned: true)
!134 = !DIEnumerator(name: "Ray_Quadric_Tests_Succeeded", value: 67, isUnsigned: true)
!135 = !DIEnumerator(name: "Ray_Poly_Tests", value: 68, isUnsigned: true)
!136 = !DIEnumerator(name: "Ray_Poly_Tests_Succeeded", value: 69, isUnsigned: true)
!137 = !DIEnumerator(name: "Ray_Sphere_Tests", value: 70, isUnsigned: true)
!138 = !DIEnumerator(name: "Ray_Sphere_Tests_Succeeded", value: 71, isUnsigned: true)
!139 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests", value: 72, isUnsigned: true)
!140 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests_Succeeded", value: 73, isUnsigned: true)
!141 = !DIEnumerator(name: "Ray_Superellipsoid_Tests", value: 74, isUnsigned: true)
!142 = !DIEnumerator(name: "Ray_Superellipsoid_Tests_Succeeded", value: 75, isUnsigned: true)
!143 = !DIEnumerator(name: "Ray_Sor_Tests", value: 76, isUnsigned: true)
!144 = !DIEnumerator(name: "Ray_Sor_Tests_Succeeded", value: 77, isUnsigned: true)
!145 = !DIEnumerator(name: "Sor_Bound_Tests", value: 78, isUnsigned: true)
!146 = !DIEnumerator(name: "Sor_Bound_Tests_Succeeded", value: 79, isUnsigned: true)
!147 = !DIEnumerator(name: "Ray_Torus_Tests", value: 80, isUnsigned: true)
!148 = !DIEnumerator(name: "Ray_Torus_Tests_Succeeded", value: 81, isUnsigned: true)
!149 = !DIEnumerator(name: "Torus_Bound_Tests", value: 82, isUnsigned: true)
!150 = !DIEnumerator(name: "Torus_Bound_Tests_Succeeded", value: 83, isUnsigned: true)
!151 = !DIEnumerator(name: "Ray_Triangle_Tests", value: 84, isUnsigned: true)
!152 = !DIEnumerator(name: "Ray_Triangle_Tests_Succeeded", value: 85, isUnsigned: true)
!153 = !DIEnumerator(name: "Ray_TTF_Tests", value: 86, isUnsigned: true)
!154 = !DIEnumerator(name: "Ray_TTF_Tests_Succeeded", value: 87, isUnsigned: true)
!155 = !DIEnumerator(name: "Bounding_Region_Tests", value: 88, isUnsigned: true)
!156 = !DIEnumerator(name: "Bounding_Region_Tests_Succeeded", value: 89, isUnsigned: true)
!157 = !DIEnumerator(name: "Clipping_Region_Tests", value: 90, isUnsigned: true)
!158 = !DIEnumerator(name: "Clipping_Region_Tests_Succeeded", value: 91, isUnsigned: true)
!159 = !DIEnumerator(name: "Ray_IsoSurface_Find_Root", value: 92, isUnsigned: true)
!160 = !DIEnumerator(name: "Ray_Function_VM_Calls", value: 93, isUnsigned: true)
!161 = !DIEnumerator(name: "Ray_Function_VM_Instruction_Est", value: 94, isUnsigned: true)
!162 = !DIEnumerator(name: "VBuffer_Tests", value: 95, isUnsigned: true)
!163 = !DIEnumerator(name: "VBuffer_Tests_Succeeded", value: 96, isUnsigned: true)
!164 = !DIEnumerator(name: "LBuffer_Tests", value: 97, isUnsigned: true)
!165 = !DIEnumerator(name: "LBuffer_Tests_Succeeded", value: 98, isUnsigned: true)
!166 = !DIEnumerator(name: "Media_Samples", value: 99, isUnsigned: true)
!167 = !DIEnumerator(name: "Media_Intervals", value: 100, isUnsigned: true)
!168 = !DIEnumerator(name: "Reflected_Rays_Traced", value: 101, isUnsigned: true)
!169 = !DIEnumerator(name: "Refracted_Rays_Traced", value: 102, isUnsigned: true)
!170 = !DIEnumerator(name: "Transmitted_Rays_Traced", value: 103, isUnsigned: true)
!171 = !DIEnumerator(name: "Internal_Reflected_Rays_Traced", value: 104, isUnsigned: true)
!172 = !DIEnumerator(name: "Shadow_Cache_Hits", value: 105, isUnsigned: true)
!173 = !DIEnumerator(name: "Shadow_Rays_Succeeded", value: 106, isUnsigned: true)
!174 = !DIEnumerator(name: "Shadow_Ray_Tests", value: 107, isUnsigned: true)
!175 = !DIEnumerator(name: "nChecked", value: 108, isUnsigned: true)
!176 = !DIEnumerator(name: "nEnqueued", value: 109, isUnsigned: true)
!177 = !DIEnumerator(name: "totalQueues", value: 110, isUnsigned: true)
!178 = !DIEnumerator(name: "totalQueueResets", value: 111, isUnsigned: true)
!179 = !DIEnumerator(name: "totalQueueResizes", value: 112, isUnsigned: true)
!180 = !DIEnumerator(name: "Polynomials_Tested", value: 113, isUnsigned: true)
!181 = !DIEnumerator(name: "Roots_Eliminated", value: 114, isUnsigned: true)
!182 = !DIEnumerator(name: "Number_Of_Photons_Shot", value: 115, isUnsigned: true)
!183 = !DIEnumerator(name: "Number_Of_Photons_Stored", value: 116, isUnsigned: true)
!184 = !DIEnumerator(name: "Number_Of_Global_Photons_Stored", value: 117, isUnsigned: true)
!185 = !DIEnumerator(name: "Number_Of_Media_Photons_Stored", value: 118, isUnsigned: true)
!186 = !DIEnumerator(name: "Priority_Queue_Add", value: 119, isUnsigned: true)
!187 = !DIEnumerator(name: "Priority_Queue_Remove", value: 120, isUnsigned: true)
!188 = !DIEnumerator(name: "Gather_Performed_Count", value: 121, isUnsigned: true)
!189 = !DIEnumerator(name: "Gather_Expanded_Count", value: 122, isUnsigned: true)
!190 = !DIEnumerator(name: "MaxStat", value: 123, isUnsigned: true)
!191 = !{!35, !44, !192, !11, !32, !193, !203, !55, !26, !291, !292}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIGHT_SOURCE", scope: !2, file: !13, line: 1041, baseType: !195)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Source_Struct", scope: !2, file: !13, line: 1580, size: 3456, flags: DIFlagTypePassByValue, elements: !196, identifier: "_ZTSN3pov19Light_Source_StructE")
!196 = !{!197, !201, !202, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !247, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !262, !263, !264, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !278, !279, !280, !284}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !195, file: !13, line: 1582, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "METHODS", scope: !2, file: !13, line: 1432, baseType: !200)
!200 = !DICompositeType(tag: DW_TAG_structure_type, name: "Method_Struct", scope: !2, file: !13, line: 1517, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov13Method_StructE")
!201 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !195, file: !13, line: 1582, baseType: !55, size: 32, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !195, file: !13, line: 1582, baseType: !203, size: 64, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !2, file: !13, line: 678, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !2, file: !13, line: 1535, size: 960, flags: DIFlagTypePassByValue, elements: !206, identifier: "_ZTSN3pov13Object_StructE")
!206 = !{!207, !208, !209, !210, !214, !215, !219, !220, !221, !222, !223, !227, !228, !229}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !205, file: !13, line: 1537, baseType: !198, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !205, file: !13, line: 1537, baseType: !55, size: 32, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !205, file: !13, line: 1537, baseType: !203, size: 64, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !205, file: !13, line: 1537, baseType: !211, size: 64, offset: 192)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXTURE", scope: !2, file: !13, line: 1035, baseType: !213)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "Texture_Struct", scope: !2, file: !13, line: 1359, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov14Texture_StructE")
!214 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !205, file: !13, line: 1537, baseType: !211, size: 64, offset: 256)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !205, file: !13, line: 1537, baseType: !216, size: 64, offset: 320)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERIOR", scope: !2, file: !13, line: 1124, baseType: !218)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "Interior_Struct", scope: !2, file: !13, line: 1126, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov15Interior_StructE")
!219 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !205, file: !13, line: 1537, baseType: !203, size: 64, offset: 384)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !205, file: !13, line: 1537, baseType: !203, size: 64, offset: 448)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !205, file: !13, line: 1537, baseType: !193, size: 64, offset: 512)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !205, file: !13, line: 1537, baseType: !20, size: 192, offset: 576)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !205, file: !13, line: 1537, baseType: !224, size: 64, offset: 768)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM", scope: !2, file: !13, line: 1014, baseType: !226)
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "Transform_Struct", scope: !2, file: !13, line: 1016, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov16Transform_StructE")
!227 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !205, file: !13, line: 1537, baseType: !224, size: 64, offset: 832)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !205, file: !13, line: 1537, baseType: !27, size: 32, offset: 896)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !205, file: !13, line: 1537, baseType: !41, size: 32, offset: 928)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !195, file: !13, line: 1582, baseType: !211, size: 64, offset: 192)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !195, file: !13, line: 1582, baseType: !211, size: 64, offset: 256)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !195, file: !13, line: 1582, baseType: !216, size: 64, offset: 320)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !195, file: !13, line: 1582, baseType: !203, size: 64, offset: 384)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !195, file: !13, line: 1582, baseType: !203, size: 64, offset: 448)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !195, file: !13, line: 1582, baseType: !193, size: 64, offset: 512)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !195, file: !13, line: 1582, baseType: !20, size: 192, offset: 576)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !195, file: !13, line: 1582, baseType: !224, size: 64, offset: 768)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !195, file: !13, line: 1582, baseType: !224, size: 64, offset: 832)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !195, file: !13, line: 1582, baseType: !27, size: 32, offset: 896)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !195, file: !13, line: 1582, baseType: !41, size: 32, offset: 928)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "Children", scope: !195, file: !13, line: 1582, baseType: !203, size: 64, offset: 960)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "Colour", scope: !195, file: !13, line: 1583, baseType: !243, size: 160, offset: 1024)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLOUR", scope: !2, file: !13, line: 695, baseType: !244)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 160, elements: !245)
!245 = !{!246}
!246 = !DISubrange(count: 5)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !195, file: !13, line: 1584, baseType: !248, size: 192, offset: 1216)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !2, file: !13, line: 691, baseType: !249)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 192, elements: !28)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "Center", scope: !195, file: !13, line: 1584, baseType: !248, size: 192, offset: 1408)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "Points_At", scope: !195, file: !13, line: 1584, baseType: !248, size: 192, offset: 1600)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "Axis1", scope: !195, file: !13, line: 1584, baseType: !248, size: 192, offset: 1792)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "Axis2", scope: !195, file: !13, line: 1584, baseType: !248, size: 192, offset: 1984)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "Coeff", scope: !195, file: !13, line: 1585, baseType: !49, size: 64, offset: 2176)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "Radius", scope: !195, file: !13, line: 1585, baseType: !49, size: 64, offset: 2240)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "Falloff", scope: !195, file: !13, line: 1585, baseType: !49, size: 64, offset: 2304)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Distance", scope: !195, file: !13, line: 1586, baseType: !49, size: 64, offset: 2368)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "Fade_Power", scope: !195, file: !13, line: 1586, baseType: !49, size: 64, offset: 2432)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "Next_Light_Source", scope: !195, file: !13, line: 1587, baseType: !193, size: 64, offset: 2496)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "Light_Type", scope: !195, file: !13, line: 1588, baseType: !261, size: 8, offset: 2560)
!261 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "Area_Light", scope: !195, file: !13, line: 1588, baseType: !261, size: 8, offset: 2568)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "Jitter", scope: !195, file: !13, line: 1588, baseType: !261, size: 8, offset: 2576)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "Orient", scope: !195, file: !13, line: 1589, baseType: !265, size: 8, offset: 2584)
!265 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "Circular", scope: !195, file: !13, line: 1590, baseType: !265, size: 8, offset: 2592)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "Track", scope: !195, file: !13, line: 1591, baseType: !261, size: 8, offset: 2600)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "Parallel", scope: !195, file: !13, line: 1591, baseType: !261, size: 8, offset: 2608)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "Photon_Area_Light", scope: !195, file: !13, line: 1592, baseType: !261, size: 8, offset: 2616)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "Area_Size1", scope: !195, file: !13, line: 1593, baseType: !55, size: 32, offset: 2624)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "Area_Size2", scope: !195, file: !13, line: 1593, baseType: !55, size: 32, offset: 2656)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "Adaptive_Level", scope: !195, file: !13, line: 1594, baseType: !55, size: 32, offset: 2688)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "Media_Attenuation", scope: !195, file: !13, line: 1595, baseType: !55, size: 32, offset: 2720)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "Media_Interaction", scope: !195, file: !13, line: 1596, baseType: !55, size: 32, offset: 2752)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "Light_Grid", scope: !195, file: !13, line: 1597, baseType: !276, size: 64, offset: 2816)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "Shadow_Cached_Object", scope: !195, file: !13, line: 1598, baseType: !203, size: 64, offset: 2880)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "Projected_Through_Object", scope: !195, file: !13, line: 1598, baseType: !203, size: 64, offset: 2944)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "blend_map", scope: !195, file: !13, line: 1599, baseType: !281, size: 64, offset: 3008)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLEND_MAP", scope: !2, file: !13, line: 1033, baseType: !283)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "Blend_Map_Struct", scope: !2, file: !13, line: 1059, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov16Blend_Map_StructE")
!284 = !DIDerivedType(tag: DW_TAG_member, name: "Light_Buffer", scope: !195, file: !13, line: 1600, baseType: !285, size: 384, offset: 3072)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !286, size: 384, elements: !289)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "PROJECT_TREE_NODE", scope: !2, file: !13, line: 1557, baseType: !288)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "Project_Tree_Node_Struct", scope: !2, file: !13, line: 1571, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov24Project_Tree_Node_StructE")
!289 = !{!290}
!290 = !DISubrange(count: 6)
!291 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!293 = !{!0, !5, !7, !9, !294, !33, !51, !297, !53}
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression(DW_OP_constu, 256, DW_OP_stack_value))
!295 = distinct !DIGlobalVariable(name: "INITIAL_PRIORITY_QUEUE_SIZE", scope: !2, file: !3, line: 62, type: !296, isLocal: true, isDefinition: true)
!296 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression(DW_OP_constu, 4, DW_OP_stack_value))
!298 = distinct !DIGlobalVariable(name: "BUNCHING_FACTOR", scope: !2, file: !3, line: 58, type: !296, isLocal: true, isDefinition: true)
!299 = !{!300, !307, !313, !315, !317, !321, !323, !325, !327, !329, !331, !333, !335, !340, !344, !346, !348, !352, !354, !356, !358, !360, !362, !364, !367, !369, !371, !375, !380, !382, !384, !386, !388, !390, !392, !394, !396, !398, !400, !404, !408, !410, !412, !414, !416, !418, !420, !422, !424, !426, !428, !430, !432, !434, !436, !438, !442, !446, !450, !452, !454, !456, !458, !460, !462, !464, !466, !468, !472, !476, !480, !482, !484, !486, !491, !495, !499, !501, !503, !505, !507, !509, !511, !513, !515, !517, !519, !521, !523, !527, !531, !535, !537, !539, !541, !548, !552, !556, !558, !560, !562, !564, !566, !568, !572, !576, !578, !580, !582, !584, !588, !592, !596, !598, !600, !602, !604, !606, !608, !612, !616, !620, !622, !626, !630, !632, !634, !636, !638, !640, !642, !648, !653, !657, !663, !667, !672, !674, !676, !680, !684, !696, !700, !704, !708, !712, !717, !721, !725, !729, !733, !741, !745, !749, !751, !755, !759, !763, !769, !773, !777, !779, !787, !791, !798, !800, !804, !808, !812, !816, !821, !825, !829, !830, !831, !832, !834, !835, !836, !837, !838, !839, !840, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !877, !879, !881, !883, !885, !887, !889, !891, !893, !895, !897, !899, !901, !903, !909, !913, !919, !923, !927, !931, !935, !937, !939, !943, !947, !951, !955, !959, !961, !963, !965, !969, !973, !977, !979, !981, !984, !986, !987, !989, !990, !992, !994, !996, !998, !1000, !1002, !1004, !1006, !1008, !1010, !1012, !1013, !1014, !1015, !1017, !1019, !1021, !1023}
!300 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !302, file: !306, line: 52)
!301 = !DINamespace(name: "std", scope: null)
!302 = !DISubprogram(name: "abs", scope: !303, file: !303, line: 840, type: !304, flags: DIFlagPrototyped, spFlags: 0)
!303 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!304 = !DISubroutineType(types: !305)
!305 = !{!55, !55}
!306 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/std_abs.h", directory: "")
!307 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !308, file: !312, line: 83)
!308 = !DISubprogram(name: "acos", scope: !309, file: !309, line: 53, type: !310, flags: DIFlagPrototyped, spFlags: 0)
!309 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/mathcalls.h", directory: "")
!310 = !DISubroutineType(types: !311)
!311 = !{!49, !49}
!312 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cmath", directory: "")
!313 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !314, file: !312, line: 102)
!314 = !DISubprogram(name: "asin", scope: !309, file: !309, line: 55, type: !310, flags: DIFlagPrototyped, spFlags: 0)
!315 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !316, file: !312, line: 121)
!316 = !DISubprogram(name: "atan", scope: !309, file: !309, line: 57, type: !310, flags: DIFlagPrototyped, spFlags: 0)
!317 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !318, file: !312, line: 140)
!318 = !DISubprogram(name: "atan2", scope: !309, file: !309, line: 59, type: !319, flags: DIFlagPrototyped, spFlags: 0)
!319 = !DISubroutineType(types: !320)
!320 = !{!49, !49, !49}
!321 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !322, file: !312, line: 161)
!322 = !DISubprogram(name: "ceil", scope: !309, file: !309, line: 159, type: !310, flags: DIFlagPrototyped, spFlags: 0)
!323 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !324, file: !312, line: 180)
!324 = !DISubprogram(name: "cos", scope: !309, file: !309, line: 62, type: !310, flags: DIFlagPrototyped, spFlags: 0)
!325 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !326, file: !312, line: 199)
!326 = !DISubprogram(name: "cosh", scope: !309, file: !309, line: 71, type: !310, flags: DIFlagPrototyped, spFlags: 0)
!327 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !328, file: !312, line: 218)
!328 = !DISubprogram(name: "exp", scope: !309, file: !309, line: 95, type: !310, flags: DIFlagPrototyped, spFlags: 0)
!329 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !330, file: !312, line: 237)
!330 = !DISubprogram(name: "fabs", scope: !309, file: !309, line: 162, type: !310, flags: DIFlagPrototyped, spFlags: 0)
!331 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !332, file: !312, line: 256)
!332 = !DISubprogram(name: "floor", scope: !309, file: !309, line: 165, type: !310, flags: DIFlagPrototyped, spFlags: 0)
!333 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !334, file: !312, line: 275)
!334 = !DISubprogram(name: "fmod", scope: !309, file: !309, line: 168, type: !319, flags: DIFlagPrototyped, spFlags: 0)
!335 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !336, file: !312, line: 296)
!336 = !DISubprogram(name: "frexp", scope: !309, file: !309, line: 98, type: !337, flags: DIFlagPrototyped, spFlags: 0)
!337 = !DISubroutineType(types: !338)
!338 = !{!49, !49, !339}
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!340 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !341, file: !312, line: 315)
!341 = !DISubprogram(name: "ldexp", scope: !309, file: !309, line: 101, type: !342, flags: DIFlagPrototyped, spFlags: 0)
!342 = !DISubroutineType(types: !343)
!343 = !{!49, !49, !55}
!344 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !345, file: !312, line: 334)
!345 = !DISubprogram(name: "log", scope: !309, file: !309, line: 104, type: !310, flags: DIFlagPrototyped, spFlags: 0)
!346 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !347, file: !312, line: 353)
!347 = !DISubprogram(name: "log10", scope: !309, file: !309, line: 107, type: !310, flags: DIFlagPrototyped, spFlags: 0)
!348 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !349, file: !312, line: 372)
!349 = !DISubprogram(name: "modf", scope: !309, file: !309, line: 110, type: !350, flags: DIFlagPrototyped, spFlags: 0)
!350 = !DISubroutineType(types: !351)
!351 = !{!49, !49, !292}
!352 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !353, file: !312, line: 384)
!353 = !DISubprogram(name: "pow", scope: !309, file: !309, line: 140, type: !319, flags: DIFlagPrototyped, spFlags: 0)
!354 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !355, file: !312, line: 421)
!355 = !DISubprogram(name: "sin", scope: !309, file: !309, line: 64, type: !310, flags: DIFlagPrototyped, spFlags: 0)
!356 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !357, file: !312, line: 440)
!357 = !DISubprogram(name: "sinh", scope: !309, file: !309, line: 73, type: !310, flags: DIFlagPrototyped, spFlags: 0)
!358 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !359, file: !312, line: 459)
!359 = !DISubprogram(name: "sqrt", scope: !309, file: !309, line: 143, type: !310, flags: DIFlagPrototyped, spFlags: 0)
!360 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !361, file: !312, line: 478)
!361 = !DISubprogram(name: "tan", scope: !309, file: !309, line: 66, type: !310, flags: DIFlagPrototyped, spFlags: 0)
!362 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !363, file: !312, line: 497)
!363 = !DISubprogram(name: "tanh", scope: !309, file: !309, line: 75, type: !310, flags: DIFlagPrototyped, spFlags: 0)
!364 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !365, file: !312, line: 1065)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_t", file: !366, line: 150, baseType: !49)
!366 = !DIFile(filename: "/usr/include/math.h", directory: "")
!367 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !368, file: !312, line: 1066)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "float_t", file: !366, line: 149, baseType: !27)
!369 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !370, file: !312, line: 1069)
!370 = !DISubprogram(name: "acosh", scope: !309, file: !309, line: 85, type: !310, flags: DIFlagPrototyped, spFlags: 0)
!371 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !372, file: !312, line: 1070)
!372 = !DISubprogram(name: "acoshf", scope: !309, file: !309, line: 85, type: !373, flags: DIFlagPrototyped, spFlags: 0)
!373 = !DISubroutineType(types: !374)
!374 = !{!27, !27}
!375 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !376, file: !312, line: 1071)
!376 = !DISubprogram(name: "acoshl", scope: !309, file: !309, line: 85, type: !377, flags: DIFlagPrototyped, spFlags: 0)
!377 = !DISubroutineType(types: !378)
!378 = !{!379, !379}
!379 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!380 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !381, file: !312, line: 1073)
!381 = !DISubprogram(name: "asinh", scope: !309, file: !309, line: 87, type: !310, flags: DIFlagPrototyped, spFlags: 0)
!382 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !383, file: !312, line: 1074)
!383 = !DISubprogram(name: "asinhf", scope: !309, file: !309, line: 87, type: !373, flags: DIFlagPrototyped, spFlags: 0)
!384 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !385, file: !312, line: 1075)
!385 = !DISubprogram(name: "asinhl", scope: !309, file: !309, line: 87, type: !377, flags: DIFlagPrototyped, spFlags: 0)
!386 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !387, file: !312, line: 1077)
!387 = !DISubprogram(name: "atanh", scope: !309, file: !309, line: 89, type: !310, flags: DIFlagPrototyped, spFlags: 0)
!388 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !389, file: !312, line: 1078)
!389 = !DISubprogram(name: "atanhf", scope: !309, file: !309, line: 89, type: !373, flags: DIFlagPrototyped, spFlags: 0)
!390 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !391, file: !312, line: 1079)
!391 = !DISubprogram(name: "atanhl", scope: !309, file: !309, line: 89, type: !377, flags: DIFlagPrototyped, spFlags: 0)
!392 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !393, file: !312, line: 1081)
!393 = !DISubprogram(name: "cbrt", scope: !309, file: !309, line: 152, type: !310, flags: DIFlagPrototyped, spFlags: 0)
!394 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !395, file: !312, line: 1082)
!395 = !DISubprogram(name: "cbrtf", scope: !309, file: !309, line: 152, type: !373, flags: DIFlagPrototyped, spFlags: 0)
!396 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !397, file: !312, line: 1083)
!397 = !DISubprogram(name: "cbrtl", scope: !309, file: !309, line: 152, type: !377, flags: DIFlagPrototyped, spFlags: 0)
!398 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !399, file: !312, line: 1085)
!399 = !DISubprogram(name: "copysign", scope: !309, file: !309, line: 196, type: !319, flags: DIFlagPrototyped, spFlags: 0)
!400 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !401, file: !312, line: 1086)
!401 = !DISubprogram(name: "copysignf", scope: !309, file: !309, line: 196, type: !402, flags: DIFlagPrototyped, spFlags: 0)
!402 = !DISubroutineType(types: !403)
!403 = !{!27, !27, !27}
!404 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !405, file: !312, line: 1087)
!405 = !DISubprogram(name: "copysignl", scope: !309, file: !309, line: 196, type: !406, flags: DIFlagPrototyped, spFlags: 0)
!406 = !DISubroutineType(types: !407)
!407 = !{!379, !379, !379}
!408 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !409, file: !312, line: 1089)
!409 = !DISubprogram(name: "erf", scope: !309, file: !309, line: 228, type: !310, flags: DIFlagPrototyped, spFlags: 0)
!410 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !411, file: !312, line: 1090)
!411 = !DISubprogram(name: "erff", scope: !309, file: !309, line: 228, type: !373, flags: DIFlagPrototyped, spFlags: 0)
!412 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !413, file: !312, line: 1091)
!413 = !DISubprogram(name: "erfl", scope: !309, file: !309, line: 228, type: !377, flags: DIFlagPrototyped, spFlags: 0)
!414 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !415, file: !312, line: 1093)
!415 = !DISubprogram(name: "erfc", scope: !309, file: !309, line: 229, type: !310, flags: DIFlagPrototyped, spFlags: 0)
!416 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !417, file: !312, line: 1094)
!417 = !DISubprogram(name: "erfcf", scope: !309, file: !309, line: 229, type: !373, flags: DIFlagPrototyped, spFlags: 0)
!418 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !419, file: !312, line: 1095)
!419 = !DISubprogram(name: "erfcl", scope: !309, file: !309, line: 229, type: !377, flags: DIFlagPrototyped, spFlags: 0)
!420 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !421, file: !312, line: 1097)
!421 = !DISubprogram(name: "exp2", scope: !309, file: !309, line: 130, type: !310, flags: DIFlagPrototyped, spFlags: 0)
!422 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !423, file: !312, line: 1098)
!423 = !DISubprogram(name: "exp2f", scope: !309, file: !309, line: 130, type: !373, flags: DIFlagPrototyped, spFlags: 0)
!424 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !425, file: !312, line: 1099)
!425 = !DISubprogram(name: "exp2l", scope: !309, file: !309, line: 130, type: !377, flags: DIFlagPrototyped, spFlags: 0)
!426 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !427, file: !312, line: 1101)
!427 = !DISubprogram(name: "expm1", scope: !309, file: !309, line: 119, type: !310, flags: DIFlagPrototyped, spFlags: 0)
!428 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !429, file: !312, line: 1102)
!429 = !DISubprogram(name: "expm1f", scope: !309, file: !309, line: 119, type: !373, flags: DIFlagPrototyped, spFlags: 0)
!430 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !431, file: !312, line: 1103)
!431 = !DISubprogram(name: "expm1l", scope: !309, file: !309, line: 119, type: !377, flags: DIFlagPrototyped, spFlags: 0)
!432 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !433, file: !312, line: 1105)
!433 = !DISubprogram(name: "fdim", scope: !309, file: !309, line: 326, type: !319, flags: DIFlagPrototyped, spFlags: 0)
!434 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !435, file: !312, line: 1106)
!435 = !DISubprogram(name: "fdimf", scope: !309, file: !309, line: 326, type: !402, flags: DIFlagPrototyped, spFlags: 0)
!436 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !437, file: !312, line: 1107)
!437 = !DISubprogram(name: "fdiml", scope: !309, file: !309, line: 326, type: !406, flags: DIFlagPrototyped, spFlags: 0)
!438 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !439, file: !312, line: 1109)
!439 = !DISubprogram(name: "fma", scope: !309, file: !309, line: 335, type: !440, flags: DIFlagPrototyped, spFlags: 0)
!440 = !DISubroutineType(types: !441)
!441 = !{!49, !49, !49, !49}
!442 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !443, file: !312, line: 1110)
!443 = !DISubprogram(name: "fmaf", scope: !309, file: !309, line: 335, type: !444, flags: DIFlagPrototyped, spFlags: 0)
!444 = !DISubroutineType(types: !445)
!445 = !{!27, !27, !27, !27}
!446 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !447, file: !312, line: 1111)
!447 = !DISubprogram(name: "fmal", scope: !309, file: !309, line: 335, type: !448, flags: DIFlagPrototyped, spFlags: 0)
!448 = !DISubroutineType(types: !449)
!449 = !{!379, !379, !379, !379}
!450 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !451, file: !312, line: 1113)
!451 = !DISubprogram(name: "fmax", scope: !309, file: !309, line: 329, type: !319, flags: DIFlagPrototyped, spFlags: 0)
!452 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !453, file: !312, line: 1114)
!453 = !DISubprogram(name: "fmaxf", scope: !309, file: !309, line: 329, type: !402, flags: DIFlagPrototyped, spFlags: 0)
!454 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !455, file: !312, line: 1115)
!455 = !DISubprogram(name: "fmaxl", scope: !309, file: !309, line: 329, type: !406, flags: DIFlagPrototyped, spFlags: 0)
!456 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !457, file: !312, line: 1117)
!457 = !DISubprogram(name: "fmin", scope: !309, file: !309, line: 332, type: !319, flags: DIFlagPrototyped, spFlags: 0)
!458 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !459, file: !312, line: 1118)
!459 = !DISubprogram(name: "fminf", scope: !309, file: !309, line: 332, type: !402, flags: DIFlagPrototyped, spFlags: 0)
!460 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !461, file: !312, line: 1119)
!461 = !DISubprogram(name: "fminl", scope: !309, file: !309, line: 332, type: !406, flags: DIFlagPrototyped, spFlags: 0)
!462 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !463, file: !312, line: 1121)
!463 = !DISubprogram(name: "hypot", scope: !309, file: !309, line: 147, type: !319, flags: DIFlagPrototyped, spFlags: 0)
!464 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !465, file: !312, line: 1122)
!465 = !DISubprogram(name: "hypotf", scope: !309, file: !309, line: 147, type: !402, flags: DIFlagPrototyped, spFlags: 0)
!466 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !467, file: !312, line: 1123)
!467 = !DISubprogram(name: "hypotl", scope: !309, file: !309, line: 147, type: !406, flags: DIFlagPrototyped, spFlags: 0)
!468 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !469, file: !312, line: 1125)
!469 = !DISubprogram(name: "ilogb", scope: !309, file: !309, line: 280, type: !470, flags: DIFlagPrototyped, spFlags: 0)
!470 = !DISubroutineType(types: !471)
!471 = !{!55, !49}
!472 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !473, file: !312, line: 1126)
!473 = !DISubprogram(name: "ilogbf", scope: !309, file: !309, line: 280, type: !474, flags: DIFlagPrototyped, spFlags: 0)
!474 = !DISubroutineType(types: !475)
!475 = !{!55, !27}
!476 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !477, file: !312, line: 1127)
!477 = !DISubprogram(name: "ilogbl", scope: !309, file: !309, line: 280, type: !478, flags: DIFlagPrototyped, spFlags: 0)
!478 = !DISubroutineType(types: !479)
!479 = !{!55, !379}
!480 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !481, file: !312, line: 1129)
!481 = !DISubprogram(name: "lgamma", scope: !309, file: !309, line: 230, type: !310, flags: DIFlagPrototyped, spFlags: 0)
!482 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !483, file: !312, line: 1130)
!483 = !DISubprogram(name: "lgammaf", scope: !309, file: !309, line: 230, type: !373, flags: DIFlagPrototyped, spFlags: 0)
!484 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !485, file: !312, line: 1131)
!485 = !DISubprogram(name: "lgammal", scope: !309, file: !309, line: 230, type: !377, flags: DIFlagPrototyped, spFlags: 0)
!486 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !487, file: !312, line: 1134)
!487 = !DISubprogram(name: "llrint", scope: !309, file: !309, line: 316, type: !488, flags: DIFlagPrototyped, spFlags: 0)
!488 = !DISubroutineType(types: !489)
!489 = !{!490, !49}
!490 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!491 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !492, file: !312, line: 1135)
!492 = !DISubprogram(name: "llrintf", scope: !309, file: !309, line: 316, type: !493, flags: DIFlagPrototyped, spFlags: 0)
!493 = !DISubroutineType(types: !494)
!494 = !{!490, !27}
!495 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !496, file: !312, line: 1136)
!496 = !DISubprogram(name: "llrintl", scope: !309, file: !309, line: 316, type: !497, flags: DIFlagPrototyped, spFlags: 0)
!497 = !DISubroutineType(types: !498)
!498 = !{!490, !379}
!499 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !500, file: !312, line: 1138)
!500 = !DISubprogram(name: "llround", scope: !309, file: !309, line: 322, type: !488, flags: DIFlagPrototyped, spFlags: 0)
!501 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !502, file: !312, line: 1139)
!502 = !DISubprogram(name: "llroundf", scope: !309, file: !309, line: 322, type: !493, flags: DIFlagPrototyped, spFlags: 0)
!503 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !504, file: !312, line: 1140)
!504 = !DISubprogram(name: "llroundl", scope: !309, file: !309, line: 322, type: !497, flags: DIFlagPrototyped, spFlags: 0)
!505 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !506, file: !312, line: 1143)
!506 = !DISubprogram(name: "log1p", scope: !309, file: !309, line: 122, type: !310, flags: DIFlagPrototyped, spFlags: 0)
!507 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !508, file: !312, line: 1144)
!508 = !DISubprogram(name: "log1pf", scope: !309, file: !309, line: 122, type: !373, flags: DIFlagPrototyped, spFlags: 0)
!509 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !510, file: !312, line: 1145)
!510 = !DISubprogram(name: "log1pl", scope: !309, file: !309, line: 122, type: !377, flags: DIFlagPrototyped, spFlags: 0)
!511 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !512, file: !312, line: 1147)
!512 = !DISubprogram(name: "log2", scope: !309, file: !309, line: 133, type: !310, flags: DIFlagPrototyped, spFlags: 0)
!513 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !514, file: !312, line: 1148)
!514 = !DISubprogram(name: "log2f", scope: !309, file: !309, line: 133, type: !373, flags: DIFlagPrototyped, spFlags: 0)
!515 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !516, file: !312, line: 1149)
!516 = !DISubprogram(name: "log2l", scope: !309, file: !309, line: 133, type: !377, flags: DIFlagPrototyped, spFlags: 0)
!517 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !518, file: !312, line: 1151)
!518 = !DISubprogram(name: "logb", scope: !309, file: !309, line: 125, type: !310, flags: DIFlagPrototyped, spFlags: 0)
!519 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !520, file: !312, line: 1152)
!520 = !DISubprogram(name: "logbf", scope: !309, file: !309, line: 125, type: !373, flags: DIFlagPrototyped, spFlags: 0)
!521 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !522, file: !312, line: 1153)
!522 = !DISubprogram(name: "logbl", scope: !309, file: !309, line: 125, type: !377, flags: DIFlagPrototyped, spFlags: 0)
!523 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !524, file: !312, line: 1155)
!524 = !DISubprogram(name: "lrint", scope: !309, file: !309, line: 314, type: !525, flags: DIFlagPrototyped, spFlags: 0)
!525 = !DISubroutineType(types: !526)
!526 = !{!4, !49}
!527 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !528, file: !312, line: 1156)
!528 = !DISubprogram(name: "lrintf", scope: !309, file: !309, line: 314, type: !529, flags: DIFlagPrototyped, spFlags: 0)
!529 = !DISubroutineType(types: !530)
!530 = !{!4, !27}
!531 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !532, file: !312, line: 1157)
!532 = !DISubprogram(name: "lrintl", scope: !309, file: !309, line: 314, type: !533, flags: DIFlagPrototyped, spFlags: 0)
!533 = !DISubroutineType(types: !534)
!534 = !{!4, !379}
!535 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !536, file: !312, line: 1159)
!536 = !DISubprogram(name: "lround", scope: !309, file: !309, line: 320, type: !525, flags: DIFlagPrototyped, spFlags: 0)
!537 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !538, file: !312, line: 1160)
!538 = !DISubprogram(name: "lroundf", scope: !309, file: !309, line: 320, type: !529, flags: DIFlagPrototyped, spFlags: 0)
!539 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !540, file: !312, line: 1161)
!540 = !DISubprogram(name: "lroundl", scope: !309, file: !309, line: 320, type: !533, flags: DIFlagPrototyped, spFlags: 0)
!541 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !542, file: !312, line: 1163)
!542 = !DISubprogram(name: "nan", scope: !309, file: !309, line: 201, type: !543, flags: DIFlagPrototyped, spFlags: 0)
!543 = !DISubroutineType(types: !544)
!544 = !{!49, !545}
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !547)
!547 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!548 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !549, file: !312, line: 1164)
!549 = !DISubprogram(name: "nanf", scope: !309, file: !309, line: 201, type: !550, flags: DIFlagPrototyped, spFlags: 0)
!550 = !DISubroutineType(types: !551)
!551 = !{!27, !545}
!552 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !553, file: !312, line: 1165)
!553 = !DISubprogram(name: "nanl", scope: !309, file: !309, line: 201, type: !554, flags: DIFlagPrototyped, spFlags: 0)
!554 = !DISubroutineType(types: !555)
!555 = !{!379, !545}
!556 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !557, file: !312, line: 1167)
!557 = !DISubprogram(name: "nearbyint", scope: !309, file: !309, line: 294, type: !310, flags: DIFlagPrototyped, spFlags: 0)
!558 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !559, file: !312, line: 1168)
!559 = !DISubprogram(name: "nearbyintf", scope: !309, file: !309, line: 294, type: !373, flags: DIFlagPrototyped, spFlags: 0)
!560 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !561, file: !312, line: 1169)
!561 = !DISubprogram(name: "nearbyintl", scope: !309, file: !309, line: 294, type: !377, flags: DIFlagPrototyped, spFlags: 0)
!562 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !563, file: !312, line: 1171)
!563 = !DISubprogram(name: "nextafter", scope: !309, file: !309, line: 259, type: !319, flags: DIFlagPrototyped, spFlags: 0)
!564 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !565, file: !312, line: 1172)
!565 = !DISubprogram(name: "nextafterf", scope: !309, file: !309, line: 259, type: !402, flags: DIFlagPrototyped, spFlags: 0)
!566 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !567, file: !312, line: 1173)
!567 = !DISubprogram(name: "nextafterl", scope: !309, file: !309, line: 259, type: !406, flags: DIFlagPrototyped, spFlags: 0)
!568 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !569, file: !312, line: 1175)
!569 = !DISubprogram(name: "nexttoward", scope: !309, file: !309, line: 261, type: !570, flags: DIFlagPrototyped, spFlags: 0)
!570 = !DISubroutineType(types: !571)
!571 = !{!49, !49, !379}
!572 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !573, file: !312, line: 1176)
!573 = !DISubprogram(name: "nexttowardf", scope: !309, file: !309, line: 261, type: !574, flags: DIFlagPrototyped, spFlags: 0)
!574 = !DISubroutineType(types: !575)
!575 = !{!27, !27, !379}
!576 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !577, file: !312, line: 1177)
!577 = !DISubprogram(name: "nexttowardl", scope: !309, file: !309, line: 261, type: !406, flags: DIFlagPrototyped, spFlags: 0)
!578 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !579, file: !312, line: 1179)
!579 = !DISubprogram(name: "remainder", scope: !309, file: !309, line: 272, type: !319, flags: DIFlagPrototyped, spFlags: 0)
!580 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !581, file: !312, line: 1180)
!581 = !DISubprogram(name: "remainderf", scope: !309, file: !309, line: 272, type: !402, flags: DIFlagPrototyped, spFlags: 0)
!582 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !583, file: !312, line: 1181)
!583 = !DISubprogram(name: "remainderl", scope: !309, file: !309, line: 272, type: !406, flags: DIFlagPrototyped, spFlags: 0)
!584 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !585, file: !312, line: 1183)
!585 = !DISubprogram(name: "remquo", scope: !309, file: !309, line: 307, type: !586, flags: DIFlagPrototyped, spFlags: 0)
!586 = !DISubroutineType(types: !587)
!587 = !{!49, !49, !49, !339}
!588 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !589, file: !312, line: 1184)
!589 = !DISubprogram(name: "remquof", scope: !309, file: !309, line: 307, type: !590, flags: DIFlagPrototyped, spFlags: 0)
!590 = !DISubroutineType(types: !591)
!591 = !{!27, !27, !27, !339}
!592 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !593, file: !312, line: 1185)
!593 = !DISubprogram(name: "remquol", scope: !309, file: !309, line: 307, type: !594, flags: DIFlagPrototyped, spFlags: 0)
!594 = !DISubroutineType(types: !595)
!595 = !{!379, !379, !379, !339}
!596 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !597, file: !312, line: 1187)
!597 = !DISubprogram(name: "rint", scope: !309, file: !309, line: 256, type: !310, flags: DIFlagPrototyped, spFlags: 0)
!598 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !599, file: !312, line: 1188)
!599 = !DISubprogram(name: "rintf", scope: !309, file: !309, line: 256, type: !373, flags: DIFlagPrototyped, spFlags: 0)
!600 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !601, file: !312, line: 1189)
!601 = !DISubprogram(name: "rintl", scope: !309, file: !309, line: 256, type: !377, flags: DIFlagPrototyped, spFlags: 0)
!602 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !603, file: !312, line: 1191)
!603 = !DISubprogram(name: "round", scope: !309, file: !309, line: 298, type: !310, flags: DIFlagPrototyped, spFlags: 0)
!604 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !605, file: !312, line: 1192)
!605 = !DISubprogram(name: "roundf", scope: !309, file: !309, line: 298, type: !373, flags: DIFlagPrototyped, spFlags: 0)
!606 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !607, file: !312, line: 1193)
!607 = !DISubprogram(name: "roundl", scope: !309, file: !309, line: 298, type: !377, flags: DIFlagPrototyped, spFlags: 0)
!608 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !609, file: !312, line: 1195)
!609 = !DISubprogram(name: "scalbln", scope: !309, file: !309, line: 290, type: !610, flags: DIFlagPrototyped, spFlags: 0)
!610 = !DISubroutineType(types: !611)
!611 = !{!49, !49, !4}
!612 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !613, file: !312, line: 1196)
!613 = !DISubprogram(name: "scalblnf", scope: !309, file: !309, line: 290, type: !614, flags: DIFlagPrototyped, spFlags: 0)
!614 = !DISubroutineType(types: !615)
!615 = !{!27, !27, !4}
!616 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !617, file: !312, line: 1197)
!617 = !DISubprogram(name: "scalblnl", scope: !309, file: !309, line: 290, type: !618, flags: DIFlagPrototyped, spFlags: 0)
!618 = !DISubroutineType(types: !619)
!619 = !{!379, !379, !4}
!620 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !621, file: !312, line: 1199)
!621 = !DISubprogram(name: "scalbn", scope: !309, file: !309, line: 276, type: !342, flags: DIFlagPrototyped, spFlags: 0)
!622 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !623, file: !312, line: 1200)
!623 = !DISubprogram(name: "scalbnf", scope: !309, file: !309, line: 276, type: !624, flags: DIFlagPrototyped, spFlags: 0)
!624 = !DISubroutineType(types: !625)
!625 = !{!27, !27, !55}
!626 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !627, file: !312, line: 1201)
!627 = !DISubprogram(name: "scalbnl", scope: !309, file: !309, line: 276, type: !628, flags: DIFlagPrototyped, spFlags: 0)
!628 = !DISubroutineType(types: !629)
!629 = !{!379, !379, !55}
!630 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !631, file: !312, line: 1203)
!631 = !DISubprogram(name: "tgamma", scope: !309, file: !309, line: 235, type: !310, flags: DIFlagPrototyped, spFlags: 0)
!632 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !633, file: !312, line: 1204)
!633 = !DISubprogram(name: "tgammaf", scope: !309, file: !309, line: 235, type: !373, flags: DIFlagPrototyped, spFlags: 0)
!634 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !635, file: !312, line: 1205)
!635 = !DISubprogram(name: "tgammal", scope: !309, file: !309, line: 235, type: !377, flags: DIFlagPrototyped, spFlags: 0)
!636 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !637, file: !312, line: 1207)
!637 = !DISubprogram(name: "trunc", scope: !309, file: !309, line: 302, type: !310, flags: DIFlagPrototyped, spFlags: 0)
!638 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !639, file: !312, line: 1208)
!639 = !DISubprogram(name: "truncf", scope: !309, file: !309, line: 302, type: !373, flags: DIFlagPrototyped, spFlags: 0)
!640 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !641, file: !312, line: 1209)
!641 = !DISubprogram(name: "truncl", scope: !309, file: !309, line: 302, type: !377, flags: DIFlagPrototyped, spFlags: 0)
!642 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !56, entity: !643, file: !647, line: 38)
!643 = !DISubprogram(name: "abs", linkageName: "_ZSt3absg", scope: !301, file: !306, line: 103, type: !644, flags: DIFlagPrototyped, spFlags: 0)
!644 = !DISubroutineType(types: !645)
!645 = !{!646, !646}
!646 = !DIBasicType(name: "__float128", size: 128, encoding: DW_ATE_float)
!647 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/math.h", directory: "")
!648 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !56, entity: !649, file: !647, line: 54)
!649 = !DISubprogram(name: "modf", linkageName: "_ZSt4modfePe", scope: !301, file: !312, line: 380, type: !650, flags: DIFlagPrototyped, spFlags: 0)
!650 = !DISubroutineType(types: !651)
!651 = !{!379, !379, !652}
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!653 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !654, file: !656, line: 127)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !303, line: 62, baseType: !655)
!655 = !DICompositeType(tag: DW_TAG_structure_type, file: !303, line: 58, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!656 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cstdlib", directory: "")
!657 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !658, file: !656, line: 128)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !303, line: 70, baseType: !659)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !303, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !660, identifier: "_ZTS6ldiv_t")
!660 = !{!661, !662}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !659, file: !303, line: 68, baseType: !4, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !659, file: !303, line: 69, baseType: !4, size: 64, offset: 64)
!663 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !664, file: !656, line: 130)
!664 = !DISubprogram(name: "abort", scope: !303, file: !303, line: 591, type: !665, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!665 = !DISubroutineType(types: !666)
!666 = !{null}
!667 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !668, file: !656, line: 134)
!668 = !DISubprogram(name: "atexit", scope: !303, file: !303, line: 595, type: !669, flags: DIFlagPrototyped, spFlags: 0)
!669 = !DISubroutineType(types: !670)
!670 = !{!55, !671}
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!672 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !673, file: !656, line: 137)
!673 = !DISubprogram(name: "at_quick_exit", scope: !303, file: !303, line: 600, type: !669, flags: DIFlagPrototyped, spFlags: 0)
!674 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !675, file: !656, line: 140)
!675 = !DISubprogram(name: "atof", scope: !303, file: !303, line: 101, type: !543, flags: DIFlagPrototyped, spFlags: 0)
!676 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !677, file: !656, line: 141)
!677 = !DISubprogram(name: "atoi", scope: !303, file: !303, line: 104, type: !678, flags: DIFlagPrototyped, spFlags: 0)
!678 = !DISubroutineType(types: !679)
!679 = !{!55, !545}
!680 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !681, file: !656, line: 142)
!681 = !DISubprogram(name: "atol", scope: !303, file: !303, line: 107, type: !682, flags: DIFlagPrototyped, spFlags: 0)
!682 = !DISubroutineType(types: !683)
!683 = !{!4, !545}
!684 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !685, file: !656, line: 143)
!685 = !DISubprogram(name: "bsearch", scope: !303, file: !303, line: 820, type: !686, flags: DIFlagPrototyped, spFlags: 0)
!686 = !DISubroutineType(types: !687)
!687 = !{!192, !688, !688, !690, !690, !692}
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !691, line: 46, baseType: !291)
!691 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !303, line: 808, baseType: !693)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DISubroutineType(types: !695)
!695 = !{!55, !688, !688}
!696 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !697, file: !656, line: 144)
!697 = !DISubprogram(name: "calloc", scope: !303, file: !303, line: 542, type: !698, flags: DIFlagPrototyped, spFlags: 0)
!698 = !DISubroutineType(types: !699)
!699 = !{!192, !690, !690}
!700 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !701, file: !656, line: 145)
!701 = !DISubprogram(name: "div", scope: !303, file: !303, line: 852, type: !702, flags: DIFlagPrototyped, spFlags: 0)
!702 = !DISubroutineType(types: !703)
!703 = !{!654, !55, !55}
!704 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !705, file: !656, line: 146)
!705 = !DISubprogram(name: "exit", scope: !303, file: !303, line: 617, type: !706, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!706 = !DISubroutineType(types: !707)
!707 = !{null, !55}
!708 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !709, file: !656, line: 147)
!709 = !DISubprogram(name: "free", scope: !303, file: !303, line: 565, type: !710, flags: DIFlagPrototyped, spFlags: 0)
!710 = !DISubroutineType(types: !711)
!711 = !{null, !192}
!712 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !713, file: !656, line: 148)
!713 = !DISubprogram(name: "getenv", scope: !303, file: !303, line: 634, type: !714, flags: DIFlagPrototyped, spFlags: 0)
!714 = !DISubroutineType(types: !715)
!715 = !{!716, !545}
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!717 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !718, file: !656, line: 149)
!718 = !DISubprogram(name: "labs", scope: !303, file: !303, line: 841, type: !719, flags: DIFlagPrototyped, spFlags: 0)
!719 = !DISubroutineType(types: !720)
!720 = !{!4, !4}
!721 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !722, file: !656, line: 150)
!722 = !DISubprogram(name: "ldiv", scope: !303, file: !303, line: 854, type: !723, flags: DIFlagPrototyped, spFlags: 0)
!723 = !DISubroutineType(types: !724)
!724 = !{!658, !4, !4}
!725 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !726, file: !656, line: 151)
!726 = !DISubprogram(name: "malloc", scope: !303, file: !303, line: 539, type: !727, flags: DIFlagPrototyped, spFlags: 0)
!727 = !DISubroutineType(types: !728)
!728 = !{!192, !690}
!729 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !730, file: !656, line: 153)
!730 = !DISubprogram(name: "mblen", scope: !303, file: !303, line: 922, type: !731, flags: DIFlagPrototyped, spFlags: 0)
!731 = !DISubroutineType(types: !732)
!732 = !{!55, !545, !690}
!733 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !734, file: !656, line: 154)
!734 = !DISubprogram(name: "mbstowcs", scope: !303, file: !303, line: 933, type: !735, flags: DIFlagPrototyped, spFlags: 0)
!735 = !DISubroutineType(types: !736)
!736 = !{!690, !737, !740, !690}
!737 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !738)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!740 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !545)
!741 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !742, file: !656, line: 155)
!742 = !DISubprogram(name: "mbtowc", scope: !303, file: !303, line: 925, type: !743, flags: DIFlagPrototyped, spFlags: 0)
!743 = !DISubroutineType(types: !744)
!744 = !{!55, !737, !740, !690}
!745 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !746, file: !656, line: 157)
!746 = !DISubprogram(name: "qsort", scope: !303, file: !303, line: 830, type: !747, flags: DIFlagPrototyped, spFlags: 0)
!747 = !DISubroutineType(types: !748)
!748 = !{null, !192, !690, !690, !692}
!749 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !750, file: !656, line: 160)
!750 = !DISubprogram(name: "quick_exit", scope: !303, file: !303, line: 623, type: !706, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!751 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !752, file: !656, line: 163)
!752 = !DISubprogram(name: "rand", scope: !303, file: !303, line: 453, type: !753, flags: DIFlagPrototyped, spFlags: 0)
!753 = !DISubroutineType(types: !754)
!754 = !{!55}
!755 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !756, file: !656, line: 164)
!756 = !DISubprogram(name: "realloc", scope: !303, file: !303, line: 550, type: !757, flags: DIFlagPrototyped, spFlags: 0)
!757 = !DISubroutineType(types: !758)
!758 = !{!192, !192, !690}
!759 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !760, file: !656, line: 165)
!760 = !DISubprogram(name: "srand", scope: !303, file: !303, line: 455, type: !761, flags: DIFlagPrototyped, spFlags: 0)
!761 = !DISubroutineType(types: !762)
!762 = !{null, !41}
!763 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !764, file: !656, line: 166)
!764 = !DISubprogram(name: "strtod", scope: !303, file: !303, line: 117, type: !765, flags: DIFlagPrototyped, spFlags: 0)
!765 = !DISubroutineType(types: !766)
!766 = !{!49, !740, !767}
!767 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !768)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!769 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !770, file: !656, line: 167)
!770 = !DISubprogram(name: "strtol", scope: !303, file: !303, line: 176, type: !771, flags: DIFlagPrototyped, spFlags: 0)
!771 = !DISubroutineType(types: !772)
!772 = !{!4, !740, !767, !55}
!773 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !774, file: !656, line: 168)
!774 = !DISubprogram(name: "strtoul", scope: !303, file: !303, line: 180, type: !775, flags: DIFlagPrototyped, spFlags: 0)
!775 = !DISubroutineType(types: !776)
!776 = !{!291, !740, !767, !55}
!777 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !778, file: !656, line: 169)
!778 = !DISubprogram(name: "system", scope: !303, file: !303, line: 784, type: !678, flags: DIFlagPrototyped, spFlags: 0)
!779 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !780, file: !656, line: 171)
!780 = !DISubprogram(name: "wcstombs", scope: !303, file: !303, line: 936, type: !781, flags: DIFlagPrototyped, spFlags: 0)
!781 = !DISubroutineType(types: !782)
!782 = !{!690, !783, !784, !690}
!783 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !716)
!784 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !785)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !739)
!787 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !788, file: !656, line: 172)
!788 = !DISubprogram(name: "wctomb", scope: !303, file: !303, line: 929, type: !789, flags: DIFlagPrototyped, spFlags: 0)
!789 = !DISubroutineType(types: !790)
!790 = !{!55, !716, !739}
!791 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !792, entity: !793, file: !656, line: 200)
!792 = !DINamespace(name: "__gnu_cxx", scope: null)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !303, line: 80, baseType: !794)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !303, line: 76, size: 128, flags: DIFlagTypePassByValue, elements: !795, identifier: "_ZTS7lldiv_t")
!795 = !{!796, !797}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !794, file: !303, line: 78, baseType: !490, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !794, file: !303, line: 79, baseType: !490, size: 64, offset: 64)
!798 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !792, entity: !799, file: !656, line: 206)
!799 = !DISubprogram(name: "_Exit", scope: !303, file: !303, line: 629, type: !706, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!800 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !792, entity: !801, file: !656, line: 210)
!801 = !DISubprogram(name: "llabs", scope: !303, file: !303, line: 844, type: !802, flags: DIFlagPrototyped, spFlags: 0)
!802 = !DISubroutineType(types: !803)
!803 = !{!490, !490}
!804 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !792, entity: !805, file: !656, line: 216)
!805 = !DISubprogram(name: "lldiv", scope: !303, file: !303, line: 858, type: !806, flags: DIFlagPrototyped, spFlags: 0)
!806 = !DISubroutineType(types: !807)
!807 = !{!793, !490, !490}
!808 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !792, entity: !809, file: !656, line: 227)
!809 = !DISubprogram(name: "atoll", scope: !303, file: !303, line: 112, type: !810, flags: DIFlagPrototyped, spFlags: 0)
!810 = !DISubroutineType(types: !811)
!811 = !{!490, !545}
!812 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !792, entity: !813, file: !656, line: 228)
!813 = !DISubprogram(name: "strtoll", scope: !303, file: !303, line: 200, type: !814, flags: DIFlagPrototyped, spFlags: 0)
!814 = !DISubroutineType(types: !815)
!815 = !{!490, !740, !767, !55}
!816 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !792, entity: !817, file: !656, line: 229)
!817 = !DISubprogram(name: "strtoull", scope: !303, file: !303, line: 205, type: !818, flags: DIFlagPrototyped, spFlags: 0)
!818 = !DISubroutineType(types: !819)
!819 = !{!820, !740, !767, !55}
!820 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!821 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !792, entity: !822, file: !656, line: 231)
!822 = !DISubprogram(name: "strtof", scope: !303, file: !303, line: 123, type: !823, flags: DIFlagPrototyped, spFlags: 0)
!823 = !DISubroutineType(types: !824)
!824 = !{!27, !740, !767}
!825 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !792, entity: !826, file: !656, line: 232)
!826 = !DISubprogram(name: "strtold", scope: !303, file: !303, line: 126, type: !827, flags: DIFlagPrototyped, spFlags: 0)
!827 = !DISubroutineType(types: !828)
!828 = !{!379, !740, !767}
!829 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !793, file: !656, line: 240)
!830 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !799, file: !656, line: 242)
!831 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !801, file: !656, line: 244)
!832 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !833, file: !656, line: 245)
!833 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !792, file: !656, line: 213, type: !806, flags: DIFlagPrototyped, spFlags: 0)
!834 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !805, file: !656, line: 246)
!835 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !809, file: !656, line: 248)
!836 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !822, file: !656, line: 249)
!837 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !813, file: !656, line: 250)
!838 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !817, file: !656, line: 251)
!839 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !826, file: !656, line: 252)
!840 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !56, entity: !664, file: !841, line: 38)
!841 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/stdlib.h", directory: "")
!842 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !56, entity: !668, file: !841, line: 39)
!843 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !56, entity: !705, file: !841, line: 40)
!844 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !56, entity: !673, file: !841, line: 43)
!845 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !56, entity: !750, file: !841, line: 46)
!846 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !56, entity: !654, file: !841, line: 51)
!847 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !56, entity: !658, file: !841, line: 52)
!848 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !56, entity: !643, file: !841, line: 54)
!849 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !56, entity: !675, file: !841, line: 55)
!850 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !56, entity: !677, file: !841, line: 56)
!851 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !56, entity: !681, file: !841, line: 57)
!852 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !56, entity: !685, file: !841, line: 58)
!853 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !56, entity: !697, file: !841, line: 59)
!854 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !56, entity: !833, file: !841, line: 60)
!855 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !56, entity: !709, file: !841, line: 61)
!856 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !56, entity: !713, file: !841, line: 62)
!857 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !56, entity: !718, file: !841, line: 63)
!858 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !56, entity: !722, file: !841, line: 64)
!859 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !56, entity: !726, file: !841, line: 65)
!860 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !56, entity: !730, file: !841, line: 67)
!861 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !56, entity: !734, file: !841, line: 68)
!862 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !56, entity: !742, file: !841, line: 69)
!863 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !56, entity: !746, file: !841, line: 71)
!864 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !56, entity: !752, file: !841, line: 72)
!865 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !56, entity: !756, file: !841, line: 73)
!866 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !56, entity: !760, file: !841, line: 74)
!867 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !56, entity: !764, file: !841, line: 75)
!868 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !56, entity: !770, file: !841, line: 76)
!869 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !56, entity: !774, file: !841, line: 77)
!870 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !56, entity: !778, file: !841, line: 78)
!871 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !56, entity: !780, file: !841, line: 80)
!872 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !56, entity: !788, file: !841, line: 81)
!873 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !874, file: !876, line: 64)
!874 = !DISubprogram(name: "isalnum", scope: !875, file: !875, line: 108, type: !304, flags: DIFlagPrototyped, spFlags: 0)
!875 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!876 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cctype", directory: "")
!877 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !878, file: !876, line: 65)
!878 = !DISubprogram(name: "isalpha", scope: !875, file: !875, line: 109, type: !304, flags: DIFlagPrototyped, spFlags: 0)
!879 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !880, file: !876, line: 66)
!880 = !DISubprogram(name: "iscntrl", scope: !875, file: !875, line: 110, type: !304, flags: DIFlagPrototyped, spFlags: 0)
!881 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !882, file: !876, line: 67)
!882 = !DISubprogram(name: "isdigit", scope: !875, file: !875, line: 111, type: !304, flags: DIFlagPrototyped, spFlags: 0)
!883 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !884, file: !876, line: 68)
!884 = !DISubprogram(name: "isgraph", scope: !875, file: !875, line: 113, type: !304, flags: DIFlagPrototyped, spFlags: 0)
!885 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !886, file: !876, line: 69)
!886 = !DISubprogram(name: "islower", scope: !875, file: !875, line: 112, type: !304, flags: DIFlagPrototyped, spFlags: 0)
!887 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !888, file: !876, line: 70)
!888 = !DISubprogram(name: "isprint", scope: !875, file: !875, line: 114, type: !304, flags: DIFlagPrototyped, spFlags: 0)
!889 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !890, file: !876, line: 71)
!890 = !DISubprogram(name: "ispunct", scope: !875, file: !875, line: 115, type: !304, flags: DIFlagPrototyped, spFlags: 0)
!891 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !892, file: !876, line: 72)
!892 = !DISubprogram(name: "isspace", scope: !875, file: !875, line: 116, type: !304, flags: DIFlagPrototyped, spFlags: 0)
!893 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !894, file: !876, line: 73)
!894 = !DISubprogram(name: "isupper", scope: !875, file: !875, line: 117, type: !304, flags: DIFlagPrototyped, spFlags: 0)
!895 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !896, file: !876, line: 74)
!896 = !DISubprogram(name: "isxdigit", scope: !875, file: !875, line: 118, type: !304, flags: DIFlagPrototyped, spFlags: 0)
!897 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !898, file: !876, line: 75)
!898 = !DISubprogram(name: "tolower", scope: !875, file: !875, line: 122, type: !304, flags: DIFlagPrototyped, spFlags: 0)
!899 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !900, file: !876, line: 76)
!900 = !DISubprogram(name: "toupper", scope: !875, file: !875, line: 125, type: !304, flags: DIFlagPrototyped, spFlags: 0)
!901 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !902, file: !876, line: 87)
!902 = !DISubprogram(name: "isblank", scope: !875, file: !875, line: 130, type: !304, flags: DIFlagPrototyped, spFlags: 0)
!903 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !904, file: !908, line: 77)
!904 = !DISubprogram(name: "memchr", scope: !905, file: !905, line: 73, type: !906, flags: DIFlagPrototyped, spFlags: 0)
!905 = !DIFile(filename: "/usr/include/string.h", directory: "")
!906 = !DISubroutineType(types: !907)
!907 = !{!688, !688, !55, !690}
!908 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cstring", directory: "")
!909 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !910, file: !908, line: 78)
!910 = !DISubprogram(name: "memcmp", scope: !905, file: !905, line: 64, type: !911, flags: DIFlagPrototyped, spFlags: 0)
!911 = !DISubroutineType(types: !912)
!912 = !{!55, !688, !688, !690}
!913 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !914, file: !908, line: 79)
!914 = !DISubprogram(name: "memcpy", scope: !905, file: !905, line: 43, type: !915, flags: DIFlagPrototyped, spFlags: 0)
!915 = !DISubroutineType(types: !916)
!916 = !{!192, !917, !918, !690}
!917 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !192)
!918 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !688)
!919 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !920, file: !908, line: 80)
!920 = !DISubprogram(name: "memmove", scope: !905, file: !905, line: 47, type: !921, flags: DIFlagPrototyped, spFlags: 0)
!921 = !DISubroutineType(types: !922)
!922 = !{!192, !192, !688, !690}
!923 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !924, file: !908, line: 81)
!924 = !DISubprogram(name: "memset", scope: !905, file: !905, line: 61, type: !925, flags: DIFlagPrototyped, spFlags: 0)
!925 = !DISubroutineType(types: !926)
!926 = !{!192, !192, !55, !690}
!927 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !928, file: !908, line: 82)
!928 = !DISubprogram(name: "strcat", scope: !905, file: !905, line: 130, type: !929, flags: DIFlagPrototyped, spFlags: 0)
!929 = !DISubroutineType(types: !930)
!930 = !{!716, !783, !740}
!931 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !932, file: !908, line: 83)
!932 = !DISubprogram(name: "strcmp", scope: !905, file: !905, line: 137, type: !933, flags: DIFlagPrototyped, spFlags: 0)
!933 = !DISubroutineType(types: !934)
!934 = !{!55, !545, !545}
!935 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !936, file: !908, line: 84)
!936 = !DISubprogram(name: "strcoll", scope: !905, file: !905, line: 144, type: !933, flags: DIFlagPrototyped, spFlags: 0)
!937 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !938, file: !908, line: 85)
!938 = !DISubprogram(name: "strcpy", scope: !905, file: !905, line: 122, type: !929, flags: DIFlagPrototyped, spFlags: 0)
!939 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !940, file: !908, line: 86)
!940 = !DISubprogram(name: "strcspn", scope: !905, file: !905, line: 273, type: !941, flags: DIFlagPrototyped, spFlags: 0)
!941 = !DISubroutineType(types: !942)
!942 = !{!690, !545, !545}
!943 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !944, file: !908, line: 87)
!944 = !DISubprogram(name: "strerror", scope: !905, file: !905, line: 397, type: !945, flags: DIFlagPrototyped, spFlags: 0)
!945 = !DISubroutineType(types: !946)
!946 = !{!716, !55}
!947 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !948, file: !908, line: 88)
!948 = !DISubprogram(name: "strlen", scope: !905, file: !905, line: 385, type: !949, flags: DIFlagPrototyped, spFlags: 0)
!949 = !DISubroutineType(types: !950)
!950 = !{!690, !545}
!951 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !952, file: !908, line: 89)
!952 = !DISubprogram(name: "strncat", scope: !905, file: !905, line: 133, type: !953, flags: DIFlagPrototyped, spFlags: 0)
!953 = !DISubroutineType(types: !954)
!954 = !{!716, !783, !740, !690}
!955 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !956, file: !908, line: 90)
!956 = !DISubprogram(name: "strncmp", scope: !905, file: !905, line: 140, type: !957, flags: DIFlagPrototyped, spFlags: 0)
!957 = !DISubroutineType(types: !958)
!958 = !{!55, !545, !545, !690}
!959 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !960, file: !908, line: 91)
!960 = !DISubprogram(name: "strncpy", scope: !905, file: !905, line: 125, type: !953, flags: DIFlagPrototyped, spFlags: 0)
!961 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !962, file: !908, line: 92)
!962 = !DISubprogram(name: "strspn", scope: !905, file: !905, line: 277, type: !941, flags: DIFlagPrototyped, spFlags: 0)
!963 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !964, file: !908, line: 93)
!964 = !DISubprogram(name: "strtok", scope: !905, file: !905, line: 336, type: !929, flags: DIFlagPrototyped, spFlags: 0)
!965 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !966, file: !908, line: 94)
!966 = !DISubprogram(name: "strxfrm", scope: !905, file: !905, line: 147, type: !967, flags: DIFlagPrototyped, spFlags: 0)
!967 = !DISubroutineType(types: !968)
!968 = !{!690, !783, !740, !690}
!969 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !970, file: !908, line: 95)
!970 = !DISubprogram(name: "strchr", scope: !905, file: !905, line: 208, type: !971, flags: DIFlagPrototyped, spFlags: 0)
!971 = !DISubroutineType(types: !972)
!972 = !{!545, !545, !55}
!973 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !974, file: !908, line: 96)
!974 = !DISubprogram(name: "strpbrk", scope: !905, file: !905, line: 285, type: !975, flags: DIFlagPrototyped, spFlags: 0)
!975 = !DISubroutineType(types: !976)
!976 = !{!545, !545, !545}
!977 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !978, file: !908, line: 97)
!978 = !DISubprogram(name: "strrchr", scope: !905, file: !905, line: 235, type: !971, flags: DIFlagPrototyped, spFlags: 0)
!979 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !301, entity: !980, file: !908, line: 98)
!980 = !DISubprogram(name: "strstr", scope: !905, file: !905, line: 312, type: !975, flags: DIFlagPrototyped, spFlags: 0)
!981 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !982, entity: !301, file: !983, line: 37)
!982 = !DINamespace(name: "pov_base", scope: null)
!983 = !DIFile(filename: "base/fileinputoutput.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!984 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !2, entity: !301, file: !985, line: 36)
!985 = !DIFile(filename: "./pov_mem.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!986 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !2, entity: !301, file: !13, line: 78)
!987 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !2, entity: !301, file: !988, line: 37)
!988 = !DIFile(filename: "./vector.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!989 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !2, entity: !301, file: !37, line: 37)
!990 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !2, entity: !301, file: !991, line: 36)
!991 = !DIFile(filename: "./matrices.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!992 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !2, entity: !301, file: !993, line: 37)
!993 = !DIFile(filename: "./objects.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!994 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !2, entity: !301, file: !995, line: 36)
!995 = !DIFile(filename: "./atmosph.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!996 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !2, entity: !301, file: !997, line: 36)
!997 = !DIFile(filename: "./camera.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!998 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !2, entity: !301, file: !999, line: 39)
!999 = !DIFile(filename: "./vlbuffer.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!1000 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !2, entity: !301, file: !1001, line: 38)
!1001 = !DIFile(filename: "./point.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!1002 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !2, entity: !301, file: !1003, line: 38)
!1003 = !DIFile(filename: "./media.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!1004 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !2, entity: !301, file: !1005, line: 36)
!1005 = !DIFile(filename: "./render.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
