; ModuleID = 'poly.cpp'
source_filename = "poly.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"struct.pov::Object_Struct" = type { %"struct.pov::Method_Struct"*, i32, %"struct.pov::Object_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Interior_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Light_Source_Struct"*, %"struct.pov::Bounding_Box_Struct", %"struct.pov::Transform_Struct"*, %"struct.pov::Transform_Struct"*, float, i32 }
%"struct.pov::Method_Struct" = type { {}*, i32 (double*, %"struct.pov::Object_Struct"*)*, void (double*, %"struct.pov::Object_Struct"*, %"struct.pov::istk_entry"*)*, void (double*, %"struct.pov::Object_Struct"*, %"struct.pov::istk_entry"*)*, i8* (%"struct.pov::Object_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*)*, void (%"struct.pov::Object_Struct"*)* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "Poly_Methods", linkageName: "_ZN3pov12Poly_MethodsE", scope: !2, file: !3, line: 110, type: !4, isLocal: false, isDefinition: true)
!2 = !DINamespace(name: "pov", scope: null)
!3 = !DIFile(filename: "poly.cpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "METHODS", scope: !2, file: !5, line: 1432, baseType: !6)
!5 = !DIFile(filename: "./frame.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!6 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Method_Struct", scope: !2, file: !5, line: 1517, size: 704, flags: DIFlagTypePassByValue, elements: !7, identifier: "_ZTSN3pov13Method_StructE")
!7 = !{!8, !108, !114, !121, !123, !128, !133, !135, !137, !142, !147}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "All_Intersections_Method", scope: !6, file: !5, line: 1519, baseType: !9, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALL_INTERSECTIONS_METHOD", scope: !2, file: !5, line: 1434, baseType: !10)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !14, !57, !72}
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !2, file: !5, line: 678, baseType: !16)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !2, file: !5, line: 1535, size: 960, flags: DIFlagTypePassByValue, elements: !17, identifier: "_ZTSN3pov13Object_StructE")
!17 = !{!18, !20, !21, !22, !26, !27, !31, !32, !33, !37, !49, !53, !54, !55}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !16, file: !5, line: 1537, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !16, file: !5, line: 1537, baseType: !13, size: 32, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !16, file: !5, line: 1537, baseType: !14, size: 64, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !16, file: !5, line: 1537, baseType: !23, size: 64, offset: 192)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXTURE", scope: !2, file: !5, line: 1035, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "Texture_Struct", scope: !2, file: !5, line: 1359, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov14Texture_StructE")
!26 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !16, file: !5, line: 1537, baseType: !23, size: 64, offset: 256)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !16, file: !5, line: 1537, baseType: !28, size: 64, offset: 320)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERIOR", scope: !2, file: !5, line: 1124, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "Interior_Struct", scope: !2, file: !5, line: 1126, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov15Interior_StructE")
!31 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !16, file: !5, line: 1537, baseType: !14, size: 64, offset: 384)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !16, file: !5, line: 1537, baseType: !14, size: 64, offset: 448)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !16, file: !5, line: 1537, baseType: !34, size: 64, offset: 512)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIGHT_SOURCE", scope: !2, file: !5, line: 1041, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Source_Struct", scope: !2, file: !5, line: 1580, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov19Light_Source_StructE")
!37 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !16, file: !5, line: 1537, baseType: !38, size: 192, offset: 576)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", scope: !2, file: !5, line: 888, baseType: !39)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Bounding_Box_Struct", scope: !2, file: !5, line: 890, size: 192, flags: DIFlagTypePassByValue, elements: !40, identifier: "_ZTSN3pov19Bounding_Box_StructE")
!40 = !{!41, !48}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "Lower_Left", scope: !39, file: !5, line: 892, baseType: !42, size: 96)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VECT", scope: !2, file: !5, line: 886, baseType: !43)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 96, elements: !46)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VAL", scope: !2, file: !5, line: 884, baseType: !45)
!45 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!46 = !{!47}
!47 = !DISubrange(count: 3)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "Lengths", scope: !39, file: !5, line: 892, baseType: !42, size: 96, offset: 96)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !16, file: !5, line: 1537, baseType: !50, size: 64, offset: 768)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM", scope: !2, file: !5, line: 1014, baseType: !52)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "Transform_Struct", scope: !2, file: !5, line: 1016, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov16Transform_StructE")
!53 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !16, file: !5, line: 1537, baseType: !50, size: 64, offset: 832)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !16, file: !5, line: 1537, baseType: !45, size: 32, offset: 896)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !16, file: !5, line: 1537, baseType: !56, size: 32, offset: 928)
!56 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", scope: !2, file: !5, line: 680, baseType: !59)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Ray_Struct", scope: !2, file: !5, line: 1797, size: 6848, flags: DIFlagTypePassByValue, elements: !60, identifier: "_ZTSN3pov10Ray_StructE")
!60 = !{!61, !65, !66, !67, !68}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "Initial", scope: !59, file: !5, line: 1799, baseType: !62, size: 192)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !2, file: !5, line: 691, baseType: !63)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 192, elements: !46)
!64 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !59, file: !5, line: 1800, baseType: !62, size: 192, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "Index", scope: !59, file: !5, line: 1801, baseType: !13, size: 32, offset: 384)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "Optimisiation_Flags", scope: !59, file: !5, line: 1802, baseType: !56, size: 32, offset: 416)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "Interiors", scope: !59, file: !5, line: 1803, baseType: !69, size: 6400, offset: 448)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 6400, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 100)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISTACK", scope: !2, file: !5, line: 681, baseType: !74)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "istack_struct", scope: !2, file: !5, line: 1635, size: 192, flags: DIFlagTypePassByValue, elements: !75, identifier: "_ZTSN3pov13istack_structE")
!75 = !{!76, !78, !106, !107}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !74, file: !5, line: 1637, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "istack", scope: !74, file: !5, line: 1638, baseType: !79, size: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "istk_entry", scope: !2, file: !5, line: 1610, size: 1600, flags: DIFlagTypePassByValue, elements: !81, identifier: "_ZTSN3pov10istk_entryE")
!81 = !{!82, !83, !84, !85, !86, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !105}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "Depth", scope: !80, file: !5, line: 1612, baseType: !64, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "IPoint", scope: !80, file: !5, line: 1613, baseType: !62, size: 192, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "INormal", scope: !80, file: !5, line: 1614, baseType: !62, size: 192, offset: 256)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "PNormal", scope: !80, file: !5, line: 1615, baseType: !62, size: 192, offset: 448)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "Iuv", scope: !80, file: !5, line: 1616, baseType: !87, size: 128, offset: 640)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !2, file: !5, line: 690, baseType: !88)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 128, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 2)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !80, file: !5, line: 1617, baseType: !14, size: 64, offset: 768)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "i1", scope: !80, file: !5, line: 1624, baseType: !13, size: 32, offset: 832)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "i2", scope: !80, file: !5, line: 1624, baseType: !13, size: 32, offset: 864)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !80, file: !5, line: 1625, baseType: !64, size: 64, offset: 896)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !80, file: !5, line: 1625, baseType: !64, size: 64, offset: 960)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !80, file: !5, line: 1626, baseType: !64, size: 64, offset: 1024)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !80, file: !5, line: 1626, baseType: !64, size: 64, offset: 1088)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !80, file: !5, line: 1627, baseType: !64, size: 64, offset: 1152)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "d4", scope: !80, file: !5, line: 1627, baseType: !64, size: 64, offset: 1216)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !80, file: !5, line: 1628, baseType: !64, size: 64, offset: 1280)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !80, file: !5, line: 1628, baseType: !64, size: 64, offset: 1344)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !80, file: !5, line: 1628, baseType: !64, size: 64, offset: 1408)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "Pointer", scope: !80, file: !5, line: 1630, baseType: !104, size: 64, offset: 1472)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "Csg", scope: !80, file: !5, line: 1632, baseType: !104, size: 64, offset: 1536)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !74, file: !5, line: 1639, baseType: !56, size: 32, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "top_entry", scope: !74, file: !5, line: 1640, baseType: !56, size: 32, offset: 160)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "Inside_Method", scope: !6, file: !5, line: 1520, baseType: !109, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "INSIDE_METHOD", scope: !2, file: !5, line: 1435, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!13, !113, !14}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Method", scope: !6, file: !5, line: 1521, baseType: !115, size: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "NORMAL_METHOD", scope: !2, file: !5, line: 1436, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{null, !113, !14, !119}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERSECTION", scope: !2, file: !5, line: 682, baseType: !80)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "UVCoord_Method", scope: !6, file: !5, line: 1522, baseType: !122, size: 64, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "UVCOORD_METHOD", scope: !2, file: !5, line: 1437, baseType: !116)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "Copy_Method", scope: !6, file: !5, line: 1523, baseType: !124, size: 64, offset: 256)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "COPY_METHOD", scope: !2, file: !5, line: 1438, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!104, !14}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "Translate_Method", scope: !6, file: !5, line: 1524, baseType: !129, size: 64, offset: 320)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSLATE_METHOD", scope: !2, file: !5, line: 1439, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !14, !113, !50}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "Rotate_Method", scope: !6, file: !5, line: 1525, baseType: !134, size: 64, offset: 384)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "ROTATE_METHOD", scope: !2, file: !5, line: 1440, baseType: !130)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "Scale_Method", scope: !6, file: !5, line: 1526, baseType: !136, size: 64, offset: 448)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCALE_METHOD", scope: !2, file: !5, line: 1441, baseType: !130)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "Transform_Method", scope: !6, file: !5, line: 1527, baseType: !138, size: 64, offset: 512)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM_METHOD", scope: !2, file: !5, line: 1442, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{null, !14, !50}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "Invert_Method", scope: !6, file: !5, line: 1528, baseType: !143, size: 64, offset: 576)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "INVERT_METHOD", scope: !2, file: !5, line: 1443, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{null, !14}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy_Method", scope: !6, file: !5, line: 1529, baseType: !148, size: 64, offset: 640)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "DESTROY_METHOD", scope: !2, file: !5, line: 1444, baseType: !144)
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(name: "stack1", scope: !151, file: !3, line: 459, type: !321, isLocal: true, isDefinition: true)
!151 = distinct !DISubprogram(name: "binomial", linkageName: "_ZN3povL8binomialEii", scope: !2, file: !3, line: 455, type: !152, scopeLine: 456, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !154, retainedNodes: !1055)
!152 = !DISubroutineType(types: !153)
!153 = !{!13, !13, !13}
!154 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !155, retainedTypes: !289, globals: !311, imports: !332, splitDebugInlining: false, nameTableKind: None)
!155 = !{!156, !283}
!156 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "STATS", scope: !2, file: !157, line: 149, baseType: !56, size: 32, elements: !158, identifier: "_ZTSN3pov5STATSE")
!157 = !DIFile(filename: "./povray.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!158 = !{!159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282}
!159 = !DIEnumerator(name: "Number_Of_Pixels", value: 0, isUnsigned: true)
!160 = !DIEnumerator(name: "Number_Of_Pixels_Supersampled", value: 1, isUnsigned: true)
!161 = !DIEnumerator(name: "Number_Of_Samples", value: 2, isUnsigned: true)
!162 = !DIEnumerator(name: "Number_Of_Rays", value: 3, isUnsigned: true)
!163 = !DIEnumerator(name: "Calls_To_DNoise", value: 4, isUnsigned: true)
!164 = !DIEnumerator(name: "Calls_To_Noise", value: 5, isUnsigned: true)
!165 = !DIEnumerator(name: "ADC_Saves", value: 6, isUnsigned: true)
!166 = !DIEnumerator(name: "Istack_overflows", value: 7, isUnsigned: true)
!167 = !DIEnumerator(name: "Ray_RBezier_Tests", value: 8, isUnsigned: true)
!168 = !DIEnumerator(name: "Ray_RBezier_Tests_Succeeded", value: 9, isUnsigned: true)
!169 = !DIEnumerator(name: "Ray_Bicubic_Tests", value: 10, isUnsigned: true)
!170 = !DIEnumerator(name: "Ray_Bicubic_Tests_Succeeded", value: 11, isUnsigned: true)
!171 = !DIEnumerator(name: "Ray_Blob_Tests", value: 12, isUnsigned: true)
!172 = !DIEnumerator(name: "Ray_Blob_Tests_Succeeded", value: 13, isUnsigned: true)
!173 = !DIEnumerator(name: "Blob_Element_Tests", value: 14, isUnsigned: true)
!174 = !DIEnumerator(name: "Blob_Element_Tests_Succeeded", value: 15, isUnsigned: true)
!175 = !DIEnumerator(name: "Blob_Bound_Tests", value: 16, isUnsigned: true)
!176 = !DIEnumerator(name: "Blob_Bound_Tests_Succeeded", value: 17, isUnsigned: true)
!177 = !DIEnumerator(name: "Ray_Box_Tests", value: 18, isUnsigned: true)
!178 = !DIEnumerator(name: "Ray_Box_Tests_Succeeded", value: 19, isUnsigned: true)
!179 = !DIEnumerator(name: "Ray_Cone_Tests", value: 20, isUnsigned: true)
!180 = !DIEnumerator(name: "Ray_Cone_Tests_Succeeded", value: 21, isUnsigned: true)
!181 = !DIEnumerator(name: "Ray_CSG_Intersection_Tests", value: 22, isUnsigned: true)
!182 = !DIEnumerator(name: "Ray_CSG_Intersection_Tests_Succeeded", value: 23, isUnsigned: true)
!183 = !DIEnumerator(name: "Ray_CSG_Merge_Tests", value: 24, isUnsigned: true)
!184 = !DIEnumerator(name: "Ray_CSG_Merge_Tests_Succeeded", value: 25, isUnsigned: true)
!185 = !DIEnumerator(name: "Ray_CSG_Union_Tests", value: 26, isUnsigned: true)
!186 = !DIEnumerator(name: "Ray_CSG_Union_Tests_Succeeded", value: 27, isUnsigned: true)
!187 = !DIEnumerator(name: "Ray_Disc_Tests", value: 28, isUnsigned: true)
!188 = !DIEnumerator(name: "Ray_Disc_Tests_Succeeded", value: 29, isUnsigned: true)
!189 = !DIEnumerator(name: "Ray_Fractal_Tests", value: 30, isUnsigned: true)
!190 = !DIEnumerator(name: "Ray_Fractal_Tests_Succeeded", value: 31, isUnsigned: true)
!191 = !DIEnumerator(name: "Ray_HField_Tests", value: 32, isUnsigned: true)
!192 = !DIEnumerator(name: "Ray_HField_Tests_Succeeded", value: 33, isUnsigned: true)
!193 = !DIEnumerator(name: "Ray_HField_Box_Tests", value: 34, isUnsigned: true)
!194 = !DIEnumerator(name: "Ray_HField_Box_Tests_Succeeded", value: 35, isUnsigned: true)
!195 = !DIEnumerator(name: "Ray_HField_Triangle_Tests", value: 36, isUnsigned: true)
!196 = !DIEnumerator(name: "Ray_HField_Triangle_Tests_Succeeded", value: 37, isUnsigned: true)
!197 = !DIEnumerator(name: "Ray_HField_Block_Tests", value: 38, isUnsigned: true)
!198 = !DIEnumerator(name: "Ray_HField_Block_Tests_Succeeded", value: 39, isUnsigned: true)
!199 = !DIEnumerator(name: "Ray_HField_Cell_Tests", value: 40, isUnsigned: true)
!200 = !DIEnumerator(name: "Ray_HField_Cell_Tests_Succeeded", value: 41, isUnsigned: true)
!201 = !DIEnumerator(name: "Ray_IsoSurface_Tests", value: 42, isUnsigned: true)
!202 = !DIEnumerator(name: "Ray_IsoSurface_Tests_Succeeded", value: 43, isUnsigned: true)
!203 = !DIEnumerator(name: "Ray_IsoSurface_Bound_Tests", value: 44, isUnsigned: true)
!204 = !DIEnumerator(name: "Ray_IsoSurface_Bound_Tests_Succeeded", value: 45, isUnsigned: true)
!205 = !DIEnumerator(name: "Ray_IsoSurface_Cache", value: 46, isUnsigned: true)
!206 = !DIEnumerator(name: "Ray_IsoSurface_Cache_Succeeded", value: 47, isUnsigned: true)
!207 = !DIEnumerator(name: "Ray_Lathe_Tests", value: 48, isUnsigned: true)
!208 = !DIEnumerator(name: "Ray_Lathe_Tests_Succeeded", value: 49, isUnsigned: true)
!209 = !DIEnumerator(name: "Lathe_Bound_Tests", value: 50, isUnsigned: true)
!210 = !DIEnumerator(name: "Lathe_Bound_Tests_Succeeded", value: 51, isUnsigned: true)
!211 = !DIEnumerator(name: "Ray_Mesh_Tests", value: 52, isUnsigned: true)
!212 = !DIEnumerator(name: "Ray_Mesh_Tests_Succeeded", value: 53, isUnsigned: true)
!213 = !DIEnumerator(name: "Ray_Plane_Tests", value: 54, isUnsigned: true)
!214 = !DIEnumerator(name: "Ray_Plane_Tests_Succeeded", value: 55, isUnsigned: true)
!215 = !DIEnumerator(name: "Ray_Polygon_Tests", value: 56, isUnsigned: true)
!216 = !DIEnumerator(name: "Ray_Polygon_Tests_Succeeded", value: 57, isUnsigned: true)
!217 = !DIEnumerator(name: "Ray_Prism_Tests", value: 58, isUnsigned: true)
!218 = !DIEnumerator(name: "Ray_Prism_Tests_Succeeded", value: 59, isUnsigned: true)
!219 = !DIEnumerator(name: "Prism_Bound_Tests", value: 60, isUnsigned: true)
!220 = !DIEnumerator(name: "Prism_Bound_Tests_Succeeded", value: 61, isUnsigned: true)
!221 = !DIEnumerator(name: "Ray_Parametric_Tests", value: 62, isUnsigned: true)
!222 = !DIEnumerator(name: "Ray_Parametric_Tests_Succeeded", value: 63, isUnsigned: true)
!223 = !DIEnumerator(name: "Ray_Par_Bound_Tests", value: 64, isUnsigned: true)
!224 = !DIEnumerator(name: "Ray_Par_Bound_Tests_Succeeded", value: 65, isUnsigned: true)
!225 = !DIEnumerator(name: "Ray_Quadric_Tests", value: 66, isUnsigned: true)
!226 = !DIEnumerator(name: "Ray_Quadric_Tests_Succeeded", value: 67, isUnsigned: true)
!227 = !DIEnumerator(name: "Ray_Poly_Tests", value: 68, isUnsigned: true)
!228 = !DIEnumerator(name: "Ray_Poly_Tests_Succeeded", value: 69, isUnsigned: true)
!229 = !DIEnumerator(name: "Ray_Sphere_Tests", value: 70, isUnsigned: true)
!230 = !DIEnumerator(name: "Ray_Sphere_Tests_Succeeded", value: 71, isUnsigned: true)
!231 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests", value: 72, isUnsigned: true)
!232 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests_Succeeded", value: 73, isUnsigned: true)
!233 = !DIEnumerator(name: "Ray_Superellipsoid_Tests", value: 74, isUnsigned: true)
!234 = !DIEnumerator(name: "Ray_Superellipsoid_Tests_Succeeded", value: 75, isUnsigned: true)
!235 = !DIEnumerator(name: "Ray_Sor_Tests", value: 76, isUnsigned: true)
!236 = !DIEnumerator(name: "Ray_Sor_Tests_Succeeded", value: 77, isUnsigned: true)
!237 = !DIEnumerator(name: "Sor_Bound_Tests", value: 78, isUnsigned: true)
!238 = !DIEnumerator(name: "Sor_Bound_Tests_Succeeded", value: 79, isUnsigned: true)
!239 = !DIEnumerator(name: "Ray_Torus_Tests", value: 80, isUnsigned: true)
!240 = !DIEnumerator(name: "Ray_Torus_Tests_Succeeded", value: 81, isUnsigned: true)
!241 = !DIEnumerator(name: "Torus_Bound_Tests", value: 82, isUnsigned: true)
!242 = !DIEnumerator(name: "Torus_Bound_Tests_Succeeded", value: 83, isUnsigned: true)
!243 = !DIEnumerator(name: "Ray_Triangle_Tests", value: 84, isUnsigned: true)
!244 = !DIEnumerator(name: "Ray_Triangle_Tests_Succeeded", value: 85, isUnsigned: true)
!245 = !DIEnumerator(name: "Ray_TTF_Tests", value: 86, isUnsigned: true)
!246 = !DIEnumerator(name: "Ray_TTF_Tests_Succeeded", value: 87, isUnsigned: true)
!247 = !DIEnumerator(name: "Bounding_Region_Tests", value: 88, isUnsigned: true)
!248 = !DIEnumerator(name: "Bounding_Region_Tests_Succeeded", value: 89, isUnsigned: true)
!249 = !DIEnumerator(name: "Clipping_Region_Tests", value: 90, isUnsigned: true)
!250 = !DIEnumerator(name: "Clipping_Region_Tests_Succeeded", value: 91, isUnsigned: true)
!251 = !DIEnumerator(name: "Ray_IsoSurface_Find_Root", value: 92, isUnsigned: true)
!252 = !DIEnumerator(name: "Ray_Function_VM_Calls", value: 93, isUnsigned: true)
!253 = !DIEnumerator(name: "Ray_Function_VM_Instruction_Est", value: 94, isUnsigned: true)
!254 = !DIEnumerator(name: "VBuffer_Tests", value: 95, isUnsigned: true)
!255 = !DIEnumerator(name: "VBuffer_Tests_Succeeded", value: 96, isUnsigned: true)
!256 = !DIEnumerator(name: "LBuffer_Tests", value: 97, isUnsigned: true)
!257 = !DIEnumerator(name: "LBuffer_Tests_Succeeded", value: 98, isUnsigned: true)
!258 = !DIEnumerator(name: "Media_Samples", value: 99, isUnsigned: true)
!259 = !DIEnumerator(name: "Media_Intervals", value: 100, isUnsigned: true)
!260 = !DIEnumerator(name: "Reflected_Rays_Traced", value: 101, isUnsigned: true)
!261 = !DIEnumerator(name: "Refracted_Rays_Traced", value: 102, isUnsigned: true)
!262 = !DIEnumerator(name: "Transmitted_Rays_Traced", value: 103, isUnsigned: true)
!263 = !DIEnumerator(name: "Internal_Reflected_Rays_Traced", value: 104, isUnsigned: true)
!264 = !DIEnumerator(name: "Shadow_Cache_Hits", value: 105, isUnsigned: true)
!265 = !DIEnumerator(name: "Shadow_Rays_Succeeded", value: 106, isUnsigned: true)
!266 = !DIEnumerator(name: "Shadow_Ray_Tests", value: 107, isUnsigned: true)
!267 = !DIEnumerator(name: "nChecked", value: 108, isUnsigned: true)
!268 = !DIEnumerator(name: "nEnqueued", value: 109, isUnsigned: true)
!269 = !DIEnumerator(name: "totalQueues", value: 110, isUnsigned: true)
!270 = !DIEnumerator(name: "totalQueueResets", value: 111, isUnsigned: true)
!271 = !DIEnumerator(name: "totalQueueResizes", value: 112, isUnsigned: true)
!272 = !DIEnumerator(name: "Polynomials_Tested", value: 113, isUnsigned: true)
!273 = !DIEnumerator(name: "Roots_Eliminated", value: 114, isUnsigned: true)
!274 = !DIEnumerator(name: "Number_Of_Photons_Shot", value: 115, isUnsigned: true)
!275 = !DIEnumerator(name: "Number_Of_Photons_Stored", value: 116, isUnsigned: true)
!276 = !DIEnumerator(name: "Number_Of_Global_Photons_Stored", value: 117, isUnsigned: true)
!277 = !DIEnumerator(name: "Number_Of_Media_Photons_Stored", value: 118, isUnsigned: true)
!278 = !DIEnumerator(name: "Priority_Queue_Add", value: 119, isUnsigned: true)
!279 = !DIEnumerator(name: "Priority_Queue_Remove", value: 120, isUnsigned: true)
!280 = !DIEnumerator(name: "Gather_Performed_Count", value: 121, isUnsigned: true)
!281 = !DIEnumerator(name: "Gather_Expanded_Count", value: 122, isUnsigned: true)
!282 = !DIEnumerator(name: "MaxStat", value: 123, isUnsigned: true)
!283 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !2, file: !5, line: 706, baseType: !56, size: 32, elements: !284)
!284 = !{!285, !286, !287, !288}
!285 = !DIEnumerator(name: "X", value: 0, isUnsigned: true)
!286 = !DIEnumerator(name: "Y", value: 1, isUnsigned: true)
!287 = !DIEnumerator(name: "Z", value: 2, isUnsigned: true)
!288 = !DIEnumerator(name: "T", value: 3, isUnsigned: true)
!289 = !{!290, !113, !13, !64, !44, !104}
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "POLY", scope: !2, file: !292, line: 56, baseType: !293)
!292 = !DIFile(filename: "./poly.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Poly_Struct", scope: !2, file: !292, line: 58, size: 1088, flags: DIFlagTypePassByValue, elements: !294, identifier: "_ZTSN3pov11Poly_StructE")
!294 = !{!295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !293, file: !292, line: 60, baseType: !19, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !293, file: !292, line: 60, baseType: !13, size: 32, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !293, file: !292, line: 60, baseType: !14, size: 64, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !293, file: !292, line: 60, baseType: !23, size: 64, offset: 192)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !293, file: !292, line: 60, baseType: !23, size: 64, offset: 256)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !293, file: !292, line: 60, baseType: !28, size: 64, offset: 320)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !293, file: !292, line: 60, baseType: !14, size: 64, offset: 384)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !293, file: !292, line: 60, baseType: !14, size: 64, offset: 448)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !293, file: !292, line: 60, baseType: !34, size: 64, offset: 512)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !293, file: !292, line: 60, baseType: !38, size: 192, offset: 576)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !293, file: !292, line: 60, baseType: !50, size: 64, offset: 768)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !293, file: !292, line: 60, baseType: !50, size: 64, offset: 832)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !293, file: !292, line: 60, baseType: !45, size: 32, offset: 896)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !293, file: !292, line: 60, baseType: !56, size: 32, offset: 928)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "Order", scope: !293, file: !292, line: 61, baseType: !13, size: 32, offset: 960)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "Coeffs", scope: !293, file: !292, line: 62, baseType: !113, size: 64, offset: 1024)
!311 = !{!0, !312, !315, !317, !149, !319, !324, !330}
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression(DW_OP_constu, 4547007122018943789, DW_OP_stack_value))
!313 = distinct !DIGlobalVariable(name: "DEPTH_TOLERANCE", scope: !2, file: !3, line: 62, type: !314, isLocal: true, isDefinition: true)
!314 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression(DW_OP_constu, 4307583784117748259, DW_OP_stack_value))
!316 = distinct !DIGlobalVariable(name: "COEFF_LIMIT", scope: !2, file: !3, line: 65, type: !314, isLocal: true, isDefinition: true)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression(DW_OP_constu, 4547007122018943789, DW_OP_stack_value))
!318 = distinct !DIGlobalVariable(name: "ROOT_TOLERANCE", scope: !2, file: !3, line: 64, type: !314, isLocal: true, isDefinition: true)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "stack2", scope: !151, file: !3, line: 459, type: !321, isLocal: true, isDefinition: true)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 1280, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: 40)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "binomials", linkageName: "_ZN3povL9binomialsE", scope: !2, file: !3, line: 122, type: !326, isLocal: true, isDefinition: true)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 7200, elements: !328)
!327 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!328 = !{!329, !329}
!329 = !DISubrange(count: 15)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression(DW_OP_constu, 4547007122018943789, DW_OP_stack_value))
!331 = distinct !DIGlobalVariable(name: "INSIDE_TOLERANCE", scope: !2, file: !3, line: 63, type: !314, isLocal: true, isDefinition: true)
!332 = !{!333, !340, !346, !348, !350, !354, !356, !358, !360, !362, !364, !366, !368, !373, !377, !379, !381, !385, !387, !389, !391, !393, !395, !397, !400, !402, !404, !408, !413, !415, !417, !419, !421, !423, !425, !427, !429, !431, !433, !437, !441, !443, !445, !447, !449, !451, !453, !455, !457, !459, !461, !463, !465, !467, !469, !471, !475, !479, !483, !485, !487, !489, !491, !493, !495, !497, !499, !501, !505, !509, !513, !515, !517, !519, !524, !528, !532, !534, !536, !538, !540, !542, !544, !546, !548, !550, !552, !554, !556, !561, !565, !569, !571, !573, !575, !582, !586, !590, !592, !594, !596, !598, !600, !602, !606, !610, !612, !614, !616, !618, !622, !626, !630, !632, !634, !636, !638, !640, !642, !646, !650, !654, !656, !660, !664, !666, !668, !670, !672, !674, !676, !682, !687, !691, !697, !701, !706, !708, !710, !714, !718, !731, !735, !739, !743, !747, !752, !756, !760, !764, !768, !776, !780, !784, !786, !790, !794, !798, !804, !808, !812, !814, !822, !826, !833, !835, !839, !843, !847, !851, !856, !860, !864, !865, !866, !867, !869, !870, !871, !872, !873, !874, !875, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !912, !914, !916, !918, !920, !922, !924, !926, !928, !930, !932, !934, !936, !938, !944, !948, !954, !958, !962, !966, !970, !972, !974, !978, !982, !986, !990, !994, !996, !998, !1000, !1004, !1008, !1012, !1014, !1016, !1019, !1021, !1022, !1024, !1026, !1028, !1030, !1032, !1033, !1035, !1037, !1039, !1041, !1043, !1045, !1047, !1049, !1051, !1052, !1053, !1054}
!333 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !335, file: !339, line: 52)
!334 = !DINamespace(name: "std", scope: null)
!335 = !DISubprogram(name: "abs", scope: !336, file: !336, line: 840, type: !337, flags: DIFlagPrototyped, spFlags: 0)
!336 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!337 = !DISubroutineType(types: !338)
!338 = !{!13, !13}
!339 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/std_abs.h", directory: "")
!340 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !341, file: !345, line: 83)
!341 = !DISubprogram(name: "acos", scope: !342, file: !342, line: 53, type: !343, flags: DIFlagPrototyped, spFlags: 0)
!342 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/mathcalls.h", directory: "")
!343 = !DISubroutineType(types: !344)
!344 = !{!64, !64}
!345 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cmath", directory: "")
!346 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !347, file: !345, line: 102)
!347 = !DISubprogram(name: "asin", scope: !342, file: !342, line: 55, type: !343, flags: DIFlagPrototyped, spFlags: 0)
!348 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !349, file: !345, line: 121)
!349 = !DISubprogram(name: "atan", scope: !342, file: !342, line: 57, type: !343, flags: DIFlagPrototyped, spFlags: 0)
!350 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !351, file: !345, line: 140)
!351 = !DISubprogram(name: "atan2", scope: !342, file: !342, line: 59, type: !352, flags: DIFlagPrototyped, spFlags: 0)
!352 = !DISubroutineType(types: !353)
!353 = !{!64, !64, !64}
!354 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !355, file: !345, line: 161)
!355 = !DISubprogram(name: "ceil", scope: !342, file: !342, line: 159, type: !343, flags: DIFlagPrototyped, spFlags: 0)
!356 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !357, file: !345, line: 180)
!357 = !DISubprogram(name: "cos", scope: !342, file: !342, line: 62, type: !343, flags: DIFlagPrototyped, spFlags: 0)
!358 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !359, file: !345, line: 199)
!359 = !DISubprogram(name: "cosh", scope: !342, file: !342, line: 71, type: !343, flags: DIFlagPrototyped, spFlags: 0)
!360 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !361, file: !345, line: 218)
!361 = !DISubprogram(name: "exp", scope: !342, file: !342, line: 95, type: !343, flags: DIFlagPrototyped, spFlags: 0)
!362 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !363, file: !345, line: 237)
!363 = !DISubprogram(name: "fabs", scope: !342, file: !342, line: 162, type: !343, flags: DIFlagPrototyped, spFlags: 0)
!364 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !365, file: !345, line: 256)
!365 = !DISubprogram(name: "floor", scope: !342, file: !342, line: 165, type: !343, flags: DIFlagPrototyped, spFlags: 0)
!366 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !367, file: !345, line: 275)
!367 = !DISubprogram(name: "fmod", scope: !342, file: !342, line: 168, type: !352, flags: DIFlagPrototyped, spFlags: 0)
!368 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !369, file: !345, line: 296)
!369 = !DISubprogram(name: "frexp", scope: !342, file: !342, line: 98, type: !370, flags: DIFlagPrototyped, spFlags: 0)
!370 = !DISubroutineType(types: !371)
!371 = !{!64, !64, !372}
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!373 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !374, file: !345, line: 315)
!374 = !DISubprogram(name: "ldexp", scope: !342, file: !342, line: 101, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!375 = !DISubroutineType(types: !376)
!376 = !{!64, !64, !13}
!377 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !378, file: !345, line: 334)
!378 = !DISubprogram(name: "log", scope: !342, file: !342, line: 104, type: !343, flags: DIFlagPrototyped, spFlags: 0)
!379 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !380, file: !345, line: 353)
!380 = !DISubprogram(name: "log10", scope: !342, file: !342, line: 107, type: !343, flags: DIFlagPrototyped, spFlags: 0)
!381 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !382, file: !345, line: 372)
!382 = !DISubprogram(name: "modf", scope: !342, file: !342, line: 110, type: !383, flags: DIFlagPrototyped, spFlags: 0)
!383 = !DISubroutineType(types: !384)
!384 = !{!64, !64, !113}
!385 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !386, file: !345, line: 384)
!386 = !DISubprogram(name: "pow", scope: !342, file: !342, line: 140, type: !352, flags: DIFlagPrototyped, spFlags: 0)
!387 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !388, file: !345, line: 421)
!388 = !DISubprogram(name: "sin", scope: !342, file: !342, line: 64, type: !343, flags: DIFlagPrototyped, spFlags: 0)
!389 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !390, file: !345, line: 440)
!390 = !DISubprogram(name: "sinh", scope: !342, file: !342, line: 73, type: !343, flags: DIFlagPrototyped, spFlags: 0)
!391 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !392, file: !345, line: 459)
!392 = !DISubprogram(name: "sqrt", scope: !342, file: !342, line: 143, type: !343, flags: DIFlagPrototyped, spFlags: 0)
!393 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !394, file: !345, line: 478)
!394 = !DISubprogram(name: "tan", scope: !342, file: !342, line: 66, type: !343, flags: DIFlagPrototyped, spFlags: 0)
!395 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !396, file: !345, line: 497)
!396 = !DISubprogram(name: "tanh", scope: !342, file: !342, line: 75, type: !343, flags: DIFlagPrototyped, spFlags: 0)
!397 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !398, file: !345, line: 1065)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_t", file: !399, line: 150, baseType: !64)
!399 = !DIFile(filename: "/usr/include/math.h", directory: "")
!400 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !401, file: !345, line: 1066)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "float_t", file: !399, line: 149, baseType: !45)
!402 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !403, file: !345, line: 1069)
!403 = !DISubprogram(name: "acosh", scope: !342, file: !342, line: 85, type: !343, flags: DIFlagPrototyped, spFlags: 0)
!404 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !405, file: !345, line: 1070)
!405 = !DISubprogram(name: "acoshf", scope: !342, file: !342, line: 85, type: !406, flags: DIFlagPrototyped, spFlags: 0)
!406 = !DISubroutineType(types: !407)
!407 = !{!45, !45}
!408 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !409, file: !345, line: 1071)
!409 = !DISubprogram(name: "acoshl", scope: !342, file: !342, line: 85, type: !410, flags: DIFlagPrototyped, spFlags: 0)
!410 = !DISubroutineType(types: !411)
!411 = !{!412, !412}
!412 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!413 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !414, file: !345, line: 1073)
!414 = !DISubprogram(name: "asinh", scope: !342, file: !342, line: 87, type: !343, flags: DIFlagPrototyped, spFlags: 0)
!415 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !416, file: !345, line: 1074)
!416 = !DISubprogram(name: "asinhf", scope: !342, file: !342, line: 87, type: !406, flags: DIFlagPrototyped, spFlags: 0)
!417 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !418, file: !345, line: 1075)
!418 = !DISubprogram(name: "asinhl", scope: !342, file: !342, line: 87, type: !410, flags: DIFlagPrototyped, spFlags: 0)
!419 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !420, file: !345, line: 1077)
!420 = !DISubprogram(name: "atanh", scope: !342, file: !342, line: 89, type: !343, flags: DIFlagPrototyped, spFlags: 0)
!421 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !422, file: !345, line: 1078)
!422 = !DISubprogram(name: "atanhf", scope: !342, file: !342, line: 89, type: !406, flags: DIFlagPrototyped, spFlags: 0)
!423 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !424, file: !345, line: 1079)
!424 = !DISubprogram(name: "atanhl", scope: !342, file: !342, line: 89, type: !410, flags: DIFlagPrototyped, spFlags: 0)
!425 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !426, file: !345, line: 1081)
!426 = !DISubprogram(name: "cbrt", scope: !342, file: !342, line: 152, type: !343, flags: DIFlagPrototyped, spFlags: 0)
!427 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !428, file: !345, line: 1082)
!428 = !DISubprogram(name: "cbrtf", scope: !342, file: !342, line: 152, type: !406, flags: DIFlagPrototyped, spFlags: 0)
!429 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !430, file: !345, line: 1083)
!430 = !DISubprogram(name: "cbrtl", scope: !342, file: !342, line: 152, type: !410, flags: DIFlagPrototyped, spFlags: 0)
!431 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !432, file: !345, line: 1085)
!432 = !DISubprogram(name: "copysign", scope: !342, file: !342, line: 196, type: !352, flags: DIFlagPrototyped, spFlags: 0)
!433 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !434, file: !345, line: 1086)
!434 = !DISubprogram(name: "copysignf", scope: !342, file: !342, line: 196, type: !435, flags: DIFlagPrototyped, spFlags: 0)
!435 = !DISubroutineType(types: !436)
!436 = !{!45, !45, !45}
!437 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !438, file: !345, line: 1087)
!438 = !DISubprogram(name: "copysignl", scope: !342, file: !342, line: 196, type: !439, flags: DIFlagPrototyped, spFlags: 0)
!439 = !DISubroutineType(types: !440)
!440 = !{!412, !412, !412}
!441 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !442, file: !345, line: 1089)
!442 = !DISubprogram(name: "erf", scope: !342, file: !342, line: 228, type: !343, flags: DIFlagPrototyped, spFlags: 0)
!443 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !444, file: !345, line: 1090)
!444 = !DISubprogram(name: "erff", scope: !342, file: !342, line: 228, type: !406, flags: DIFlagPrototyped, spFlags: 0)
!445 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !446, file: !345, line: 1091)
!446 = !DISubprogram(name: "erfl", scope: !342, file: !342, line: 228, type: !410, flags: DIFlagPrototyped, spFlags: 0)
!447 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !448, file: !345, line: 1093)
!448 = !DISubprogram(name: "erfc", scope: !342, file: !342, line: 229, type: !343, flags: DIFlagPrototyped, spFlags: 0)
!449 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !450, file: !345, line: 1094)
!450 = !DISubprogram(name: "erfcf", scope: !342, file: !342, line: 229, type: !406, flags: DIFlagPrototyped, spFlags: 0)
!451 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !452, file: !345, line: 1095)
!452 = !DISubprogram(name: "erfcl", scope: !342, file: !342, line: 229, type: !410, flags: DIFlagPrototyped, spFlags: 0)
!453 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !454, file: !345, line: 1097)
!454 = !DISubprogram(name: "exp2", scope: !342, file: !342, line: 130, type: !343, flags: DIFlagPrototyped, spFlags: 0)
!455 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !456, file: !345, line: 1098)
!456 = !DISubprogram(name: "exp2f", scope: !342, file: !342, line: 130, type: !406, flags: DIFlagPrototyped, spFlags: 0)
!457 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !458, file: !345, line: 1099)
!458 = !DISubprogram(name: "exp2l", scope: !342, file: !342, line: 130, type: !410, flags: DIFlagPrototyped, spFlags: 0)
!459 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !460, file: !345, line: 1101)
!460 = !DISubprogram(name: "expm1", scope: !342, file: !342, line: 119, type: !343, flags: DIFlagPrototyped, spFlags: 0)
!461 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !462, file: !345, line: 1102)
!462 = !DISubprogram(name: "expm1f", scope: !342, file: !342, line: 119, type: !406, flags: DIFlagPrototyped, spFlags: 0)
!463 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !464, file: !345, line: 1103)
!464 = !DISubprogram(name: "expm1l", scope: !342, file: !342, line: 119, type: !410, flags: DIFlagPrototyped, spFlags: 0)
!465 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !466, file: !345, line: 1105)
!466 = !DISubprogram(name: "fdim", scope: !342, file: !342, line: 326, type: !352, flags: DIFlagPrototyped, spFlags: 0)
!467 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !468, file: !345, line: 1106)
!468 = !DISubprogram(name: "fdimf", scope: !342, file: !342, line: 326, type: !435, flags: DIFlagPrototyped, spFlags: 0)
!469 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !470, file: !345, line: 1107)
!470 = !DISubprogram(name: "fdiml", scope: !342, file: !342, line: 326, type: !439, flags: DIFlagPrototyped, spFlags: 0)
!471 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !472, file: !345, line: 1109)
!472 = !DISubprogram(name: "fma", scope: !342, file: !342, line: 335, type: !473, flags: DIFlagPrototyped, spFlags: 0)
!473 = !DISubroutineType(types: !474)
!474 = !{!64, !64, !64, !64}
!475 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !476, file: !345, line: 1110)
!476 = !DISubprogram(name: "fmaf", scope: !342, file: !342, line: 335, type: !477, flags: DIFlagPrototyped, spFlags: 0)
!477 = !DISubroutineType(types: !478)
!478 = !{!45, !45, !45, !45}
!479 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !480, file: !345, line: 1111)
!480 = !DISubprogram(name: "fmal", scope: !342, file: !342, line: 335, type: !481, flags: DIFlagPrototyped, spFlags: 0)
!481 = !DISubroutineType(types: !482)
!482 = !{!412, !412, !412, !412}
!483 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !484, file: !345, line: 1113)
!484 = !DISubprogram(name: "fmax", scope: !342, file: !342, line: 329, type: !352, flags: DIFlagPrototyped, spFlags: 0)
!485 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !486, file: !345, line: 1114)
!486 = !DISubprogram(name: "fmaxf", scope: !342, file: !342, line: 329, type: !435, flags: DIFlagPrototyped, spFlags: 0)
!487 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !488, file: !345, line: 1115)
!488 = !DISubprogram(name: "fmaxl", scope: !342, file: !342, line: 329, type: !439, flags: DIFlagPrototyped, spFlags: 0)
!489 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !490, file: !345, line: 1117)
!490 = !DISubprogram(name: "fmin", scope: !342, file: !342, line: 332, type: !352, flags: DIFlagPrototyped, spFlags: 0)
!491 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !492, file: !345, line: 1118)
!492 = !DISubprogram(name: "fminf", scope: !342, file: !342, line: 332, type: !435, flags: DIFlagPrototyped, spFlags: 0)
!493 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !494, file: !345, line: 1119)
!494 = !DISubprogram(name: "fminl", scope: !342, file: !342, line: 332, type: !439, flags: DIFlagPrototyped, spFlags: 0)
!495 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !496, file: !345, line: 1121)
!496 = !DISubprogram(name: "hypot", scope: !342, file: !342, line: 147, type: !352, flags: DIFlagPrototyped, spFlags: 0)
!497 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !498, file: !345, line: 1122)
!498 = !DISubprogram(name: "hypotf", scope: !342, file: !342, line: 147, type: !435, flags: DIFlagPrototyped, spFlags: 0)
!499 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !500, file: !345, line: 1123)
!500 = !DISubprogram(name: "hypotl", scope: !342, file: !342, line: 147, type: !439, flags: DIFlagPrototyped, spFlags: 0)
!501 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !502, file: !345, line: 1125)
!502 = !DISubprogram(name: "ilogb", scope: !342, file: !342, line: 280, type: !503, flags: DIFlagPrototyped, spFlags: 0)
!503 = !DISubroutineType(types: !504)
!504 = !{!13, !64}
!505 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !506, file: !345, line: 1126)
!506 = !DISubprogram(name: "ilogbf", scope: !342, file: !342, line: 280, type: !507, flags: DIFlagPrototyped, spFlags: 0)
!507 = !DISubroutineType(types: !508)
!508 = !{!13, !45}
!509 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !510, file: !345, line: 1127)
!510 = !DISubprogram(name: "ilogbl", scope: !342, file: !342, line: 280, type: !511, flags: DIFlagPrototyped, spFlags: 0)
!511 = !DISubroutineType(types: !512)
!512 = !{!13, !412}
!513 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !514, file: !345, line: 1129)
!514 = !DISubprogram(name: "lgamma", scope: !342, file: !342, line: 230, type: !343, flags: DIFlagPrototyped, spFlags: 0)
!515 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !516, file: !345, line: 1130)
!516 = !DISubprogram(name: "lgammaf", scope: !342, file: !342, line: 230, type: !406, flags: DIFlagPrototyped, spFlags: 0)
!517 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !518, file: !345, line: 1131)
!518 = !DISubprogram(name: "lgammal", scope: !342, file: !342, line: 230, type: !410, flags: DIFlagPrototyped, spFlags: 0)
!519 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !520, file: !345, line: 1134)
!520 = !DISubprogram(name: "llrint", scope: !342, file: !342, line: 316, type: !521, flags: DIFlagPrototyped, spFlags: 0)
!521 = !DISubroutineType(types: !522)
!522 = !{!523, !64}
!523 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!524 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !525, file: !345, line: 1135)
!525 = !DISubprogram(name: "llrintf", scope: !342, file: !342, line: 316, type: !526, flags: DIFlagPrototyped, spFlags: 0)
!526 = !DISubroutineType(types: !527)
!527 = !{!523, !45}
!528 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !529, file: !345, line: 1136)
!529 = !DISubprogram(name: "llrintl", scope: !342, file: !342, line: 316, type: !530, flags: DIFlagPrototyped, spFlags: 0)
!530 = !DISubroutineType(types: !531)
!531 = !{!523, !412}
!532 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !533, file: !345, line: 1138)
!533 = !DISubprogram(name: "llround", scope: !342, file: !342, line: 322, type: !521, flags: DIFlagPrototyped, spFlags: 0)
!534 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !535, file: !345, line: 1139)
!535 = !DISubprogram(name: "llroundf", scope: !342, file: !342, line: 322, type: !526, flags: DIFlagPrototyped, spFlags: 0)
!536 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !537, file: !345, line: 1140)
!537 = !DISubprogram(name: "llroundl", scope: !342, file: !342, line: 322, type: !530, flags: DIFlagPrototyped, spFlags: 0)
!538 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !539, file: !345, line: 1143)
!539 = !DISubprogram(name: "log1p", scope: !342, file: !342, line: 122, type: !343, flags: DIFlagPrototyped, spFlags: 0)
!540 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !541, file: !345, line: 1144)
!541 = !DISubprogram(name: "log1pf", scope: !342, file: !342, line: 122, type: !406, flags: DIFlagPrototyped, spFlags: 0)
!542 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !543, file: !345, line: 1145)
!543 = !DISubprogram(name: "log1pl", scope: !342, file: !342, line: 122, type: !410, flags: DIFlagPrototyped, spFlags: 0)
!544 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !545, file: !345, line: 1147)
!545 = !DISubprogram(name: "log2", scope: !342, file: !342, line: 133, type: !343, flags: DIFlagPrototyped, spFlags: 0)
!546 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !547, file: !345, line: 1148)
!547 = !DISubprogram(name: "log2f", scope: !342, file: !342, line: 133, type: !406, flags: DIFlagPrototyped, spFlags: 0)
!548 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !549, file: !345, line: 1149)
!549 = !DISubprogram(name: "log2l", scope: !342, file: !342, line: 133, type: !410, flags: DIFlagPrototyped, spFlags: 0)
!550 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !551, file: !345, line: 1151)
!551 = !DISubprogram(name: "logb", scope: !342, file: !342, line: 125, type: !343, flags: DIFlagPrototyped, spFlags: 0)
!552 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !553, file: !345, line: 1152)
!553 = !DISubprogram(name: "logbf", scope: !342, file: !342, line: 125, type: !406, flags: DIFlagPrototyped, spFlags: 0)
!554 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !555, file: !345, line: 1153)
!555 = !DISubprogram(name: "logbl", scope: !342, file: !342, line: 125, type: !410, flags: DIFlagPrototyped, spFlags: 0)
!556 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !557, file: !345, line: 1155)
!557 = !DISubprogram(name: "lrint", scope: !342, file: !342, line: 314, type: !558, flags: DIFlagPrototyped, spFlags: 0)
!558 = !DISubroutineType(types: !559)
!559 = !{!560, !64}
!560 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!561 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !562, file: !345, line: 1156)
!562 = !DISubprogram(name: "lrintf", scope: !342, file: !342, line: 314, type: !563, flags: DIFlagPrototyped, spFlags: 0)
!563 = !DISubroutineType(types: !564)
!564 = !{!560, !45}
!565 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !566, file: !345, line: 1157)
!566 = !DISubprogram(name: "lrintl", scope: !342, file: !342, line: 314, type: !567, flags: DIFlagPrototyped, spFlags: 0)
!567 = !DISubroutineType(types: !568)
!568 = !{!560, !412}
!569 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !570, file: !345, line: 1159)
!570 = !DISubprogram(name: "lround", scope: !342, file: !342, line: 320, type: !558, flags: DIFlagPrototyped, spFlags: 0)
!571 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !572, file: !345, line: 1160)
!572 = !DISubprogram(name: "lroundf", scope: !342, file: !342, line: 320, type: !563, flags: DIFlagPrototyped, spFlags: 0)
!573 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !574, file: !345, line: 1161)
!574 = !DISubprogram(name: "lroundl", scope: !342, file: !342, line: 320, type: !567, flags: DIFlagPrototyped, spFlags: 0)
!575 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !576, file: !345, line: 1163)
!576 = !DISubprogram(name: "nan", scope: !342, file: !342, line: 201, type: !577, flags: DIFlagPrototyped, spFlags: 0)
!577 = !DISubroutineType(types: !578)
!578 = !{!64, !579}
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !581)
!581 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!582 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !583, file: !345, line: 1164)
!583 = !DISubprogram(name: "nanf", scope: !342, file: !342, line: 201, type: !584, flags: DIFlagPrototyped, spFlags: 0)
!584 = !DISubroutineType(types: !585)
!585 = !{!45, !579}
!586 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !587, file: !345, line: 1165)
!587 = !DISubprogram(name: "nanl", scope: !342, file: !342, line: 201, type: !588, flags: DIFlagPrototyped, spFlags: 0)
!588 = !DISubroutineType(types: !589)
!589 = !{!412, !579}
!590 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !591, file: !345, line: 1167)
!591 = !DISubprogram(name: "nearbyint", scope: !342, file: !342, line: 294, type: !343, flags: DIFlagPrototyped, spFlags: 0)
!592 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !593, file: !345, line: 1168)
!593 = !DISubprogram(name: "nearbyintf", scope: !342, file: !342, line: 294, type: !406, flags: DIFlagPrototyped, spFlags: 0)
!594 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !595, file: !345, line: 1169)
!595 = !DISubprogram(name: "nearbyintl", scope: !342, file: !342, line: 294, type: !410, flags: DIFlagPrototyped, spFlags: 0)
!596 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !597, file: !345, line: 1171)
!597 = !DISubprogram(name: "nextafter", scope: !342, file: !342, line: 259, type: !352, flags: DIFlagPrototyped, spFlags: 0)
!598 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !599, file: !345, line: 1172)
!599 = !DISubprogram(name: "nextafterf", scope: !342, file: !342, line: 259, type: !435, flags: DIFlagPrototyped, spFlags: 0)
!600 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !601, file: !345, line: 1173)
!601 = !DISubprogram(name: "nextafterl", scope: !342, file: !342, line: 259, type: !439, flags: DIFlagPrototyped, spFlags: 0)
!602 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !603, file: !345, line: 1175)
!603 = !DISubprogram(name: "nexttoward", scope: !342, file: !342, line: 261, type: !604, flags: DIFlagPrototyped, spFlags: 0)
!604 = !DISubroutineType(types: !605)
!605 = !{!64, !64, !412}
!606 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !607, file: !345, line: 1176)
!607 = !DISubprogram(name: "nexttowardf", scope: !342, file: !342, line: 261, type: !608, flags: DIFlagPrototyped, spFlags: 0)
!608 = !DISubroutineType(types: !609)
!609 = !{!45, !45, !412}
!610 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !611, file: !345, line: 1177)
!611 = !DISubprogram(name: "nexttowardl", scope: !342, file: !342, line: 261, type: !439, flags: DIFlagPrototyped, spFlags: 0)
!612 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !613, file: !345, line: 1179)
!613 = !DISubprogram(name: "remainder", scope: !342, file: !342, line: 272, type: !352, flags: DIFlagPrototyped, spFlags: 0)
!614 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !615, file: !345, line: 1180)
!615 = !DISubprogram(name: "remainderf", scope: !342, file: !342, line: 272, type: !435, flags: DIFlagPrototyped, spFlags: 0)
!616 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !617, file: !345, line: 1181)
!617 = !DISubprogram(name: "remainderl", scope: !342, file: !342, line: 272, type: !439, flags: DIFlagPrototyped, spFlags: 0)
!618 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !619, file: !345, line: 1183)
!619 = !DISubprogram(name: "remquo", scope: !342, file: !342, line: 307, type: !620, flags: DIFlagPrototyped, spFlags: 0)
!620 = !DISubroutineType(types: !621)
!621 = !{!64, !64, !64, !372}
!622 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !623, file: !345, line: 1184)
!623 = !DISubprogram(name: "remquof", scope: !342, file: !342, line: 307, type: !624, flags: DIFlagPrototyped, spFlags: 0)
!624 = !DISubroutineType(types: !625)
!625 = !{!45, !45, !45, !372}
!626 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !627, file: !345, line: 1185)
!627 = !DISubprogram(name: "remquol", scope: !342, file: !342, line: 307, type: !628, flags: DIFlagPrototyped, spFlags: 0)
!628 = !DISubroutineType(types: !629)
!629 = !{!412, !412, !412, !372}
!630 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !631, file: !345, line: 1187)
!631 = !DISubprogram(name: "rint", scope: !342, file: !342, line: 256, type: !343, flags: DIFlagPrototyped, spFlags: 0)
!632 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !633, file: !345, line: 1188)
!633 = !DISubprogram(name: "rintf", scope: !342, file: !342, line: 256, type: !406, flags: DIFlagPrototyped, spFlags: 0)
!634 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !635, file: !345, line: 1189)
!635 = !DISubprogram(name: "rintl", scope: !342, file: !342, line: 256, type: !410, flags: DIFlagPrototyped, spFlags: 0)
!636 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !637, file: !345, line: 1191)
!637 = !DISubprogram(name: "round", scope: !342, file: !342, line: 298, type: !343, flags: DIFlagPrototyped, spFlags: 0)
!638 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !639, file: !345, line: 1192)
!639 = !DISubprogram(name: "roundf", scope: !342, file: !342, line: 298, type: !406, flags: DIFlagPrototyped, spFlags: 0)
!640 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !641, file: !345, line: 1193)
!641 = !DISubprogram(name: "roundl", scope: !342, file: !342, line: 298, type: !410, flags: DIFlagPrototyped, spFlags: 0)
!642 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !643, file: !345, line: 1195)
!643 = !DISubprogram(name: "scalbln", scope: !342, file: !342, line: 290, type: !644, flags: DIFlagPrototyped, spFlags: 0)
!644 = !DISubroutineType(types: !645)
!645 = !{!64, !64, !560}
!646 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !647, file: !345, line: 1196)
!647 = !DISubprogram(name: "scalblnf", scope: !342, file: !342, line: 290, type: !648, flags: DIFlagPrototyped, spFlags: 0)
!648 = !DISubroutineType(types: !649)
!649 = !{!45, !45, !560}
!650 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !651, file: !345, line: 1197)
!651 = !DISubprogram(name: "scalblnl", scope: !342, file: !342, line: 290, type: !652, flags: DIFlagPrototyped, spFlags: 0)
!652 = !DISubroutineType(types: !653)
!653 = !{!412, !412, !560}
!654 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !655, file: !345, line: 1199)
!655 = !DISubprogram(name: "scalbn", scope: !342, file: !342, line: 276, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!656 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !657, file: !345, line: 1200)
!657 = !DISubprogram(name: "scalbnf", scope: !342, file: !342, line: 276, type: !658, flags: DIFlagPrototyped, spFlags: 0)
!658 = !DISubroutineType(types: !659)
!659 = !{!45, !45, !13}
!660 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !661, file: !345, line: 1201)
!661 = !DISubprogram(name: "scalbnl", scope: !342, file: !342, line: 276, type: !662, flags: DIFlagPrototyped, spFlags: 0)
!662 = !DISubroutineType(types: !663)
!663 = !{!412, !412, !13}
!664 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !665, file: !345, line: 1203)
!665 = !DISubprogram(name: "tgamma", scope: !342, file: !342, line: 235, type: !343, flags: DIFlagPrototyped, spFlags: 0)
!666 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !667, file: !345, line: 1204)
!667 = !DISubprogram(name: "tgammaf", scope: !342, file: !342, line: 235, type: !406, flags: DIFlagPrototyped, spFlags: 0)
!668 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !669, file: !345, line: 1205)
!669 = !DISubprogram(name: "tgammal", scope: !342, file: !342, line: 235, type: !410, flags: DIFlagPrototyped, spFlags: 0)
!670 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !671, file: !345, line: 1207)
!671 = !DISubprogram(name: "trunc", scope: !342, file: !342, line: 302, type: !343, flags: DIFlagPrototyped, spFlags: 0)
!672 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !673, file: !345, line: 1208)
!673 = !DISubprogram(name: "truncf", scope: !342, file: !342, line: 302, type: !406, flags: DIFlagPrototyped, spFlags: 0)
!674 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !675, file: !345, line: 1209)
!675 = !DISubprogram(name: "truncl", scope: !342, file: !342, line: 302, type: !410, flags: DIFlagPrototyped, spFlags: 0)
!676 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !154, entity: !677, file: !681, line: 38)
!677 = !DISubprogram(name: "abs", linkageName: "_ZSt3absg", scope: !334, file: !339, line: 103, type: !678, flags: DIFlagPrototyped, spFlags: 0)
!678 = !DISubroutineType(types: !679)
!679 = !{!680, !680}
!680 = !DIBasicType(name: "__float128", size: 128, encoding: DW_ATE_float)
!681 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/math.h", directory: "")
!682 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !154, entity: !683, file: !681, line: 54)
!683 = !DISubprogram(name: "modf", linkageName: "_ZSt4modfePe", scope: !334, file: !345, line: 380, type: !684, flags: DIFlagPrototyped, spFlags: 0)
!684 = !DISubroutineType(types: !685)
!685 = !{!412, !412, !686}
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!687 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !688, file: !690, line: 127)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !336, line: 62, baseType: !689)
!689 = !DICompositeType(tag: DW_TAG_structure_type, file: !336, line: 58, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!690 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cstdlib", directory: "")
!691 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !692, file: !690, line: 128)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !336, line: 70, baseType: !693)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !336, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !694, identifier: "_ZTS6ldiv_t")
!694 = !{!695, !696}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !693, file: !336, line: 68, baseType: !560, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !693, file: !336, line: 69, baseType: !560, size: 64, offset: 64)
!697 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !698, file: !690, line: 130)
!698 = !DISubprogram(name: "abort", scope: !336, file: !336, line: 591, type: !699, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!699 = !DISubroutineType(types: !700)
!700 = !{null}
!701 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !702, file: !690, line: 134)
!702 = !DISubprogram(name: "atexit", scope: !336, file: !336, line: 595, type: !703, flags: DIFlagPrototyped, spFlags: 0)
!703 = !DISubroutineType(types: !704)
!704 = !{!13, !705}
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!706 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !707, file: !690, line: 137)
!707 = !DISubprogram(name: "at_quick_exit", scope: !336, file: !336, line: 600, type: !703, flags: DIFlagPrototyped, spFlags: 0)
!708 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !709, file: !690, line: 140)
!709 = !DISubprogram(name: "atof", scope: !336, file: !336, line: 101, type: !577, flags: DIFlagPrototyped, spFlags: 0)
!710 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !711, file: !690, line: 141)
!711 = !DISubprogram(name: "atoi", scope: !336, file: !336, line: 104, type: !712, flags: DIFlagPrototyped, spFlags: 0)
!712 = !DISubroutineType(types: !713)
!713 = !{!13, !579}
!714 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !715, file: !690, line: 142)
!715 = !DISubprogram(name: "atol", scope: !336, file: !336, line: 107, type: !716, flags: DIFlagPrototyped, spFlags: 0)
!716 = !DISubroutineType(types: !717)
!717 = !{!560, !579}
!718 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !719, file: !690, line: 143)
!719 = !DISubprogram(name: "bsearch", scope: !336, file: !336, line: 820, type: !720, flags: DIFlagPrototyped, spFlags: 0)
!720 = !DISubroutineType(types: !721)
!721 = !{!104, !722, !722, !724, !724, !727}
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !725, line: 46, baseType: !726)
!725 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!726 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !336, line: 808, baseType: !728)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DISubroutineType(types: !730)
!730 = !{!13, !722, !722}
!731 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !732, file: !690, line: 144)
!732 = !DISubprogram(name: "calloc", scope: !336, file: !336, line: 542, type: !733, flags: DIFlagPrototyped, spFlags: 0)
!733 = !DISubroutineType(types: !734)
!734 = !{!104, !724, !724}
!735 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !736, file: !690, line: 145)
!736 = !DISubprogram(name: "div", scope: !336, file: !336, line: 852, type: !737, flags: DIFlagPrototyped, spFlags: 0)
!737 = !DISubroutineType(types: !738)
!738 = !{!688, !13, !13}
!739 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !740, file: !690, line: 146)
!740 = !DISubprogram(name: "exit", scope: !336, file: !336, line: 617, type: !741, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!741 = !DISubroutineType(types: !742)
!742 = !{null, !13}
!743 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !744, file: !690, line: 147)
!744 = !DISubprogram(name: "free", scope: !336, file: !336, line: 565, type: !745, flags: DIFlagPrototyped, spFlags: 0)
!745 = !DISubroutineType(types: !746)
!746 = !{null, !104}
!747 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !748, file: !690, line: 148)
!748 = !DISubprogram(name: "getenv", scope: !336, file: !336, line: 634, type: !749, flags: DIFlagPrototyped, spFlags: 0)
!749 = !DISubroutineType(types: !750)
!750 = !{!751, !579}
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!752 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !753, file: !690, line: 149)
!753 = !DISubprogram(name: "labs", scope: !336, file: !336, line: 841, type: !754, flags: DIFlagPrototyped, spFlags: 0)
!754 = !DISubroutineType(types: !755)
!755 = !{!560, !560}
!756 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !757, file: !690, line: 150)
!757 = !DISubprogram(name: "ldiv", scope: !336, file: !336, line: 854, type: !758, flags: DIFlagPrototyped, spFlags: 0)
!758 = !DISubroutineType(types: !759)
!759 = !{!692, !560, !560}
!760 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !761, file: !690, line: 151)
!761 = !DISubprogram(name: "malloc", scope: !336, file: !336, line: 539, type: !762, flags: DIFlagPrototyped, spFlags: 0)
!762 = !DISubroutineType(types: !763)
!763 = !{!104, !724}
!764 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !765, file: !690, line: 153)
!765 = !DISubprogram(name: "mblen", scope: !336, file: !336, line: 922, type: !766, flags: DIFlagPrototyped, spFlags: 0)
!766 = !DISubroutineType(types: !767)
!767 = !{!13, !579, !724}
!768 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !769, file: !690, line: 154)
!769 = !DISubprogram(name: "mbstowcs", scope: !336, file: !336, line: 933, type: !770, flags: DIFlagPrototyped, spFlags: 0)
!770 = !DISubroutineType(types: !771)
!771 = !{!724, !772, !775, !724}
!772 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !773)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!775 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !579)
!776 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !777, file: !690, line: 155)
!777 = !DISubprogram(name: "mbtowc", scope: !336, file: !336, line: 925, type: !778, flags: DIFlagPrototyped, spFlags: 0)
!778 = !DISubroutineType(types: !779)
!779 = !{!13, !772, !775, !724}
!780 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !781, file: !690, line: 157)
!781 = !DISubprogram(name: "qsort", scope: !336, file: !336, line: 830, type: !782, flags: DIFlagPrototyped, spFlags: 0)
!782 = !DISubroutineType(types: !783)
!783 = !{null, !104, !724, !724, !727}
!784 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !785, file: !690, line: 160)
!785 = !DISubprogram(name: "quick_exit", scope: !336, file: !336, line: 623, type: !741, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!786 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !787, file: !690, line: 163)
!787 = !DISubprogram(name: "rand", scope: !336, file: !336, line: 453, type: !788, flags: DIFlagPrototyped, spFlags: 0)
!788 = !DISubroutineType(types: !789)
!789 = !{!13}
!790 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !791, file: !690, line: 164)
!791 = !DISubprogram(name: "realloc", scope: !336, file: !336, line: 550, type: !792, flags: DIFlagPrototyped, spFlags: 0)
!792 = !DISubroutineType(types: !793)
!793 = !{!104, !104, !724}
!794 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !795, file: !690, line: 165)
!795 = !DISubprogram(name: "srand", scope: !336, file: !336, line: 455, type: !796, flags: DIFlagPrototyped, spFlags: 0)
!796 = !DISubroutineType(types: !797)
!797 = !{null, !56}
!798 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !799, file: !690, line: 166)
!799 = !DISubprogram(name: "strtod", scope: !336, file: !336, line: 117, type: !800, flags: DIFlagPrototyped, spFlags: 0)
!800 = !DISubroutineType(types: !801)
!801 = !{!64, !775, !802}
!802 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !803)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!804 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !805, file: !690, line: 167)
!805 = !DISubprogram(name: "strtol", scope: !336, file: !336, line: 176, type: !806, flags: DIFlagPrototyped, spFlags: 0)
!806 = !DISubroutineType(types: !807)
!807 = !{!560, !775, !802, !13}
!808 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !809, file: !690, line: 168)
!809 = !DISubprogram(name: "strtoul", scope: !336, file: !336, line: 180, type: !810, flags: DIFlagPrototyped, spFlags: 0)
!810 = !DISubroutineType(types: !811)
!811 = !{!726, !775, !802, !13}
!812 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !813, file: !690, line: 169)
!813 = !DISubprogram(name: "system", scope: !336, file: !336, line: 784, type: !712, flags: DIFlagPrototyped, spFlags: 0)
!814 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !815, file: !690, line: 171)
!815 = !DISubprogram(name: "wcstombs", scope: !336, file: !336, line: 936, type: !816, flags: DIFlagPrototyped, spFlags: 0)
!816 = !DISubroutineType(types: !817)
!817 = !{!724, !818, !819, !724}
!818 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !751)
!819 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !820)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !774)
!822 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !823, file: !690, line: 172)
!823 = !DISubprogram(name: "wctomb", scope: !336, file: !336, line: 929, type: !824, flags: DIFlagPrototyped, spFlags: 0)
!824 = !DISubroutineType(types: !825)
!825 = !{!13, !751, !774}
!826 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !827, entity: !828, file: !690, line: 200)
!827 = !DINamespace(name: "__gnu_cxx", scope: null)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !336, line: 80, baseType: !829)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !336, line: 76, size: 128, flags: DIFlagTypePassByValue, elements: !830, identifier: "_ZTS7lldiv_t")
!830 = !{!831, !832}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !829, file: !336, line: 78, baseType: !523, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !829, file: !336, line: 79, baseType: !523, size: 64, offset: 64)
!833 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !827, entity: !834, file: !690, line: 206)
!834 = !DISubprogram(name: "_Exit", scope: !336, file: !336, line: 629, type: !741, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!835 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !827, entity: !836, file: !690, line: 210)
!836 = !DISubprogram(name: "llabs", scope: !336, file: !336, line: 844, type: !837, flags: DIFlagPrototyped, spFlags: 0)
!837 = !DISubroutineType(types: !838)
!838 = !{!523, !523}
!839 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !827, entity: !840, file: !690, line: 216)
!840 = !DISubprogram(name: "lldiv", scope: !336, file: !336, line: 858, type: !841, flags: DIFlagPrototyped, spFlags: 0)
!841 = !DISubroutineType(types: !842)
!842 = !{!828, !523, !523}
!843 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !827, entity: !844, file: !690, line: 227)
!844 = !DISubprogram(name: "atoll", scope: !336, file: !336, line: 112, type: !845, flags: DIFlagPrototyped, spFlags: 0)
!845 = !DISubroutineType(types: !846)
!846 = !{!523, !579}
!847 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !827, entity: !848, file: !690, line: 228)
!848 = !DISubprogram(name: "strtoll", scope: !336, file: !336, line: 200, type: !849, flags: DIFlagPrototyped, spFlags: 0)
!849 = !DISubroutineType(types: !850)
!850 = !{!523, !775, !802, !13}
!851 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !827, entity: !852, file: !690, line: 229)
!852 = !DISubprogram(name: "strtoull", scope: !336, file: !336, line: 205, type: !853, flags: DIFlagPrototyped, spFlags: 0)
!853 = !DISubroutineType(types: !854)
!854 = !{!855, !775, !802, !13}
!855 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!856 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !827, entity: !857, file: !690, line: 231)
!857 = !DISubprogram(name: "strtof", scope: !336, file: !336, line: 123, type: !858, flags: DIFlagPrototyped, spFlags: 0)
!858 = !DISubroutineType(types: !859)
!859 = !{!45, !775, !802}
!860 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !827, entity: !861, file: !690, line: 232)
!861 = !DISubprogram(name: "strtold", scope: !336, file: !336, line: 126, type: !862, flags: DIFlagPrototyped, spFlags: 0)
!862 = !DISubroutineType(types: !863)
!863 = !{!412, !775, !802}
!864 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !828, file: !690, line: 240)
!865 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !834, file: !690, line: 242)
!866 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !836, file: !690, line: 244)
!867 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !868, file: !690, line: 245)
!868 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !827, file: !690, line: 213, type: !841, flags: DIFlagPrototyped, spFlags: 0)
!869 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !840, file: !690, line: 246)
!870 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !844, file: !690, line: 248)
!871 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !857, file: !690, line: 249)
!872 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !848, file: !690, line: 250)
!873 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !852, file: !690, line: 251)
!874 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !334, entity: !861, file: !690, line: 252)
!875 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !154, entity: !698, file: !876, line: 38)
!876 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/stdlib.h", directory: "")
