; ModuleID = 'cones.cpp'
source_filename = "cones.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"struct.pov::Object_Struct" = type { %"struct.pov::Method_Struct"*, i32, %"struct.pov::Object_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Interior_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Light_Source_Struct"*, %"struct.pov::Bounding_Box_Struct", %"struct.pov::Transform_Struct"*, %"struct.pov::Transform_Struct"*, float, i32 }
%"struct.pov::Method_Struct" = type { {}*, i32 (double*, %"struct.pov::Object_Struct"*)*, void (double*, %"struct.pov::Object_Struct"*, %"struct.pov::istk_entry"*)*, void (double*, %"struct.pov::Object_Struct"*, %"struct.pov::istk_entry"*)*, i8* (%"struct.pov::Object_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*)*, void (%"struct.pov::Object_Struct"*)* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "Cone_Methods", linkageName: "_ZN3pov12Cone_MethodsE", scope: !2, file: !3, line: 95, type: !4, isLocal: false, isDefinition: true)
!2 = !DINamespace(name: "pov", scope: null)
!3 = !DIFile(filename: "cones.cpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "METHODS", scope: !2, file: !5, line: 1432, baseType: !6)
!5 = !DIFile(filename: "./frame.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!6 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Method_Struct", scope: !2, file: !5, line: 1517, size: 704, flags: DIFlagTypePassByValue, elements: !7, identifier: "_ZTSN3pov13Method_StructE")
!7 = !{!8, !108, !114, !121, !123, !128, !133, !135, !137, !142, !147}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "All_Intersections_Method", scope: !6, file: !5, line: 1519, baseType: !9, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALL_INTERSECTIONS_METHOD", scope: !2, file: !5, line: 1434, baseType: !10)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !14, !57, !72}
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !2, file: !5, line: 678, baseType: !16)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !2, file: !5, line: 1535, size: 960, flags: DIFlagTypePassByValue, elements: !17, identifier: "_ZTSN3pov13Object_StructE")
!17 = !{!18, !20, !21, !22, !26, !27, !31, !32, !33, !37, !49, !53, !54, !55}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !16, file: !5, line: 1537, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !16, file: !5, line: 1537, baseType: !13, size: 32, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !16, file: !5, line: 1537, baseType: !14, size: 64, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !16, file: !5, line: 1537, baseType: !23, size: 64, offset: 192)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXTURE", scope: !2, file: !5, line: 1035, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "Texture_Struct", scope: !2, file: !5, line: 1359, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov14Texture_StructE")
!26 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !16, file: !5, line: 1537, baseType: !23, size: 64, offset: 256)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !16, file: !5, line: 1537, baseType: !28, size: 64, offset: 320)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERIOR", scope: !2, file: !5, line: 1124, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "Interior_Struct", scope: !2, file: !5, line: 1126, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov15Interior_StructE")
!31 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !16, file: !5, line: 1537, baseType: !14, size: 64, offset: 384)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !16, file: !5, line: 1537, baseType: !14, size: 64, offset: 448)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !16, file: !5, line: 1537, baseType: !34, size: 64, offset: 512)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIGHT_SOURCE", scope: !2, file: !5, line: 1041, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Source_Struct", scope: !2, file: !5, line: 1580, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov19Light_Source_StructE")
!37 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !16, file: !5, line: 1537, baseType: !38, size: 192, offset: 576)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", scope: !2, file: !5, line: 888, baseType: !39)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Bounding_Box_Struct", scope: !2, file: !5, line: 890, size: 192, flags: DIFlagTypePassByValue, elements: !40, identifier: "_ZTSN3pov19Bounding_Box_StructE")
!40 = !{!41, !48}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "Lower_Left", scope: !39, file: !5, line: 892, baseType: !42, size: 96)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VECT", scope: !2, file: !5, line: 886, baseType: !43)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 96, elements: !46)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VAL", scope: !2, file: !5, line: 884, baseType: !45)
!45 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!46 = !{!47}
!47 = !DISubrange(count: 3)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "Lengths", scope: !39, file: !5, line: 892, baseType: !42, size: 96, offset: 96)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !16, file: !5, line: 1537, baseType: !50, size: 64, offset: 768)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM", scope: !2, file: !5, line: 1014, baseType: !52)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "Transform_Struct", scope: !2, file: !5, line: 1016, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov16Transform_StructE")
!53 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !16, file: !5, line: 1537, baseType: !50, size: 64, offset: 832)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !16, file: !5, line: 1537, baseType: !45, size: 32, offset: 896)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !16, file: !5, line: 1537, baseType: !56, size: 32, offset: 928)
!56 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", scope: !2, file: !5, line: 680, baseType: !59)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Ray_Struct", scope: !2, file: !5, line: 1797, size: 6848, flags: DIFlagTypePassByValue, elements: !60, identifier: "_ZTSN3pov10Ray_StructE")
!60 = !{!61, !65, !66, !67, !68}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "Initial", scope: !59, file: !5, line: 1799, baseType: !62, size: 192)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !2, file: !5, line: 691, baseType: !63)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 192, elements: !46)
!64 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !59, file: !5, line: 1800, baseType: !62, size: 192, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "Index", scope: !59, file: !5, line: 1801, baseType: !13, size: 32, offset: 384)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "Optimisiation_Flags", scope: !59, file: !5, line: 1802, baseType: !56, size: 32, offset: 416)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "Interiors", scope: !59, file: !5, line: 1803, baseType: !69, size: 6400, offset: 448)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 6400, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 100)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISTACK", scope: !2, file: !5, line: 681, baseType: !74)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "istack_struct", scope: !2, file: !5, line: 1635, size: 192, flags: DIFlagTypePassByValue, elements: !75, identifier: "_ZTSN3pov13istack_structE")
!75 = !{!76, !78, !106, !107}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !74, file: !5, line: 1637, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "istack", scope: !74, file: !5, line: 1638, baseType: !79, size: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "istk_entry", scope: !2, file: !5, line: 1610, size: 1600, flags: DIFlagTypePassByValue, elements: !81, identifier: "_ZTSN3pov10istk_entryE")
!81 = !{!82, !83, !84, !85, !86, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !105}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "Depth", scope: !80, file: !5, line: 1612, baseType: !64, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "IPoint", scope: !80, file: !5, line: 1613, baseType: !62, size: 192, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "INormal", scope: !80, file: !5, line: 1614, baseType: !62, size: 192, offset: 256)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "PNormal", scope: !80, file: !5, line: 1615, baseType: !62, size: 192, offset: 448)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "Iuv", scope: !80, file: !5, line: 1616, baseType: !87, size: 128, offset: 640)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !2, file: !5, line: 690, baseType: !88)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 128, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 2)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !80, file: !5, line: 1617, baseType: !14, size: 64, offset: 768)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "i1", scope: !80, file: !5, line: 1624, baseType: !13, size: 32, offset: 832)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "i2", scope: !80, file: !5, line: 1624, baseType: !13, size: 32, offset: 864)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !80, file: !5, line: 1625, baseType: !64, size: 64, offset: 896)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !80, file: !5, line: 1625, baseType: !64, size: 64, offset: 960)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !80, file: !5, line: 1626, baseType: !64, size: 64, offset: 1024)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !80, file: !5, line: 1626, baseType: !64, size: 64, offset: 1088)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !80, file: !5, line: 1627, baseType: !64, size: 64, offset: 1152)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "d4", scope: !80, file: !5, line: 1627, baseType: !64, size: 64, offset: 1216)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !80, file: !5, line: 1628, baseType: !64, size: 64, offset: 1280)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !80, file: !5, line: 1628, baseType: !64, size: 64, offset: 1344)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !80, file: !5, line: 1628, baseType: !64, size: 64, offset: 1408)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "Pointer", scope: !80, file: !5, line: 1630, baseType: !104, size: 64, offset: 1472)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "Csg", scope: !80, file: !5, line: 1632, baseType: !104, size: 64, offset: 1536)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !74, file: !5, line: 1639, baseType: !56, size: 32, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "top_entry", scope: !74, file: !5, line: 1640, baseType: !56, size: 32, offset: 160)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "Inside_Method", scope: !6, file: !5, line: 1520, baseType: !109, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "INSIDE_METHOD", scope: !2, file: !5, line: 1435, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!13, !113, !14}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Method", scope: !6, file: !5, line: 1521, baseType: !115, size: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "NORMAL_METHOD", scope: !2, file: !5, line: 1436, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{null, !113, !14, !119}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERSECTION", scope: !2, file: !5, line: 682, baseType: !80)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "UVCoord_Method", scope: !6, file: !5, line: 1522, baseType: !122, size: 64, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "UVCOORD_METHOD", scope: !2, file: !5, line: 1437, baseType: !116)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "Copy_Method", scope: !6, file: !5, line: 1523, baseType: !124, size: 64, offset: 256)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "COPY_METHOD", scope: !2, file: !5, line: 1438, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!104, !14}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "Translate_Method", scope: !6, file: !5, line: 1524, baseType: !129, size: 64, offset: 320)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSLATE_METHOD", scope: !2, file: !5, line: 1439, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !14, !113, !50}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "Rotate_Method", scope: !6, file: !5, line: 1525, baseType: !134, size: 64, offset: 384)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "ROTATE_METHOD", scope: !2, file: !5, line: 1440, baseType: !130)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "Scale_Method", scope: !6, file: !5, line: 1526, baseType: !136, size: 64, offset: 448)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCALE_METHOD", scope: !2, file: !5, line: 1441, baseType: !130)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "Transform_Method", scope: !6, file: !5, line: 1527, baseType: !138, size: 64, offset: 512)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM_METHOD", scope: !2, file: !5, line: 1442, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{null, !14, !50}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "Invert_Method", scope: !6, file: !5, line: 1528, baseType: !143, size: 64, offset: 576)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "INVERT_METHOD", scope: !2, file: !5, line: 1443, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{null, !14}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy_Method", scope: !6, file: !5, line: 1529, baseType: !148, size: 64, offset: 640)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "DESTROY_METHOD", scope: !2, file: !5, line: 1444, baseType: !144)
!149 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !150, retainedTypes: !284, globals: !309, imports: !320, splitDebugInlining: false, nameTableKind: None)
!150 = !{!151, !278}
!151 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "STATS", scope: !2, file: !152, line: 149, baseType: !56, size: 32, elements: !153, identifier: "_ZTSN3pov5STATSE")
!152 = !DIFile(filename: "./povray.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!153 = !{!154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277}
!154 = !DIEnumerator(name: "Number_Of_Pixels", value: 0, isUnsigned: true)
!155 = !DIEnumerator(name: "Number_Of_Pixels_Supersampled", value: 1, isUnsigned: true)
!156 = !DIEnumerator(name: "Number_Of_Samples", value: 2, isUnsigned: true)
!157 = !DIEnumerator(name: "Number_Of_Rays", value: 3, isUnsigned: true)
!158 = !DIEnumerator(name: "Calls_To_DNoise", value: 4, isUnsigned: true)
!159 = !DIEnumerator(name: "Calls_To_Noise", value: 5, isUnsigned: true)
!160 = !DIEnumerator(name: "ADC_Saves", value: 6, isUnsigned: true)
!161 = !DIEnumerator(name: "Istack_overflows", value: 7, isUnsigned: true)
!162 = !DIEnumerator(name: "Ray_RBezier_Tests", value: 8, isUnsigned: true)
!163 = !DIEnumerator(name: "Ray_RBezier_Tests_Succeeded", value: 9, isUnsigned: true)
!164 = !DIEnumerator(name: "Ray_Bicubic_Tests", value: 10, isUnsigned: true)
!165 = !DIEnumerator(name: "Ray_Bicubic_Tests_Succeeded", value: 11, isUnsigned: true)
!166 = !DIEnumerator(name: "Ray_Blob_Tests", value: 12, isUnsigned: true)
!167 = !DIEnumerator(name: "Ray_Blob_Tests_Succeeded", value: 13, isUnsigned: true)
!168 = !DIEnumerator(name: "Blob_Element_Tests", value: 14, isUnsigned: true)
!169 = !DIEnumerator(name: "Blob_Element_Tests_Succeeded", value: 15, isUnsigned: true)
!170 = !DIEnumerator(name: "Blob_Bound_Tests", value: 16, isUnsigned: true)
!171 = !DIEnumerator(name: "Blob_Bound_Tests_Succeeded", value: 17, isUnsigned: true)
!172 = !DIEnumerator(name: "Ray_Box_Tests", value: 18, isUnsigned: true)
!173 = !DIEnumerator(name: "Ray_Box_Tests_Succeeded", value: 19, isUnsigned: true)
!174 = !DIEnumerator(name: "Ray_Cone_Tests", value: 20, isUnsigned: true)
!175 = !DIEnumerator(name: "Ray_Cone_Tests_Succeeded", value: 21, isUnsigned: true)
!176 = !DIEnumerator(name: "Ray_CSG_Intersection_Tests", value: 22, isUnsigned: true)
!177 = !DIEnumerator(name: "Ray_CSG_Intersection_Tests_Succeeded", value: 23, isUnsigned: true)
!178 = !DIEnumerator(name: "Ray_CSG_Merge_Tests", value: 24, isUnsigned: true)
!179 = !DIEnumerator(name: "Ray_CSG_Merge_Tests_Succeeded", value: 25, isUnsigned: true)
!180 = !DIEnumerator(name: "Ray_CSG_Union_Tests", value: 26, isUnsigned: true)
!181 = !DIEnumerator(name: "Ray_CSG_Union_Tests_Succeeded", value: 27, isUnsigned: true)
!182 = !DIEnumerator(name: "Ray_Disc_Tests", value: 28, isUnsigned: true)
!183 = !DIEnumerator(name: "Ray_Disc_Tests_Succeeded", value: 29, isUnsigned: true)
!184 = !DIEnumerator(name: "Ray_Fractal_Tests", value: 30, isUnsigned: true)
!185 = !DIEnumerator(name: "Ray_Fractal_Tests_Succeeded", value: 31, isUnsigned: true)
!186 = !DIEnumerator(name: "Ray_HField_Tests", value: 32, isUnsigned: true)
!187 = !DIEnumerator(name: "Ray_HField_Tests_Succeeded", value: 33, isUnsigned: true)
!188 = !DIEnumerator(name: "Ray_HField_Box_Tests", value: 34, isUnsigned: true)
!189 = !DIEnumerator(name: "Ray_HField_Box_Tests_Succeeded", value: 35, isUnsigned: true)
!190 = !DIEnumerator(name: "Ray_HField_Triangle_Tests", value: 36, isUnsigned: true)
!191 = !DIEnumerator(name: "Ray_HField_Triangle_Tests_Succeeded", value: 37, isUnsigned: true)
!192 = !DIEnumerator(name: "Ray_HField_Block_Tests", value: 38, isUnsigned: true)
!193 = !DIEnumerator(name: "Ray_HField_Block_Tests_Succeeded", value: 39, isUnsigned: true)
!194 = !DIEnumerator(name: "Ray_HField_Cell_Tests", value: 40, isUnsigned: true)
!195 = !DIEnumerator(name: "Ray_HField_Cell_Tests_Succeeded", value: 41, isUnsigned: true)
!196 = !DIEnumerator(name: "Ray_IsoSurface_Tests", value: 42, isUnsigned: true)
!197 = !DIEnumerator(name: "Ray_IsoSurface_Tests_Succeeded", value: 43, isUnsigned: true)
!198 = !DIEnumerator(name: "Ray_IsoSurface_Bound_Tests", value: 44, isUnsigned: true)
!199 = !DIEnumerator(name: "Ray_IsoSurface_Bound_Tests_Succeeded", value: 45, isUnsigned: true)
!200 = !DIEnumerator(name: "Ray_IsoSurface_Cache", value: 46, isUnsigned: true)
!201 = !DIEnumerator(name: "Ray_IsoSurface_Cache_Succeeded", value: 47, isUnsigned: true)
!202 = !DIEnumerator(name: "Ray_Lathe_Tests", value: 48, isUnsigned: true)
!203 = !DIEnumerator(name: "Ray_Lathe_Tests_Succeeded", value: 49, isUnsigned: true)
!204 = !DIEnumerator(name: "Lathe_Bound_Tests", value: 50, isUnsigned: true)
!205 = !DIEnumerator(name: "Lathe_Bound_Tests_Succeeded", value: 51, isUnsigned: true)
!206 = !DIEnumerator(name: "Ray_Mesh_Tests", value: 52, isUnsigned: true)
!207 = !DIEnumerator(name: "Ray_Mesh_Tests_Succeeded", value: 53, isUnsigned: true)
!208 = !DIEnumerator(name: "Ray_Plane_Tests", value: 54, isUnsigned: true)
!209 = !DIEnumerator(name: "Ray_Plane_Tests_Succeeded", value: 55, isUnsigned: true)
!210 = !DIEnumerator(name: "Ray_Polygon_Tests", value: 56, isUnsigned: true)
!211 = !DIEnumerator(name: "Ray_Polygon_Tests_Succeeded", value: 57, isUnsigned: true)
!212 = !DIEnumerator(name: "Ray_Prism_Tests", value: 58, isUnsigned: true)
!213 = !DIEnumerator(name: "Ray_Prism_Tests_Succeeded", value: 59, isUnsigned: true)
!214 = !DIEnumerator(name: "Prism_Bound_Tests", value: 60, isUnsigned: true)
!215 = !DIEnumerator(name: "Prism_Bound_Tests_Succeeded", value: 61, isUnsigned: true)
!216 = !DIEnumerator(name: "Ray_Parametric_Tests", value: 62, isUnsigned: true)
!217 = !DIEnumerator(name: "Ray_Parametric_Tests_Succeeded", value: 63, isUnsigned: true)
!218 = !DIEnumerator(name: "Ray_Par_Bound_Tests", value: 64, isUnsigned: true)
!219 = !DIEnumerator(name: "Ray_Par_Bound_Tests_Succeeded", value: 65, isUnsigned: true)
!220 = !DIEnumerator(name: "Ray_Quadric_Tests", value: 66, isUnsigned: true)
!221 = !DIEnumerator(name: "Ray_Quadric_Tests_Succeeded", value: 67, isUnsigned: true)
!222 = !DIEnumerator(name: "Ray_Poly_Tests", value: 68, isUnsigned: true)
!223 = !DIEnumerator(name: "Ray_Poly_Tests_Succeeded", value: 69, isUnsigned: true)
!224 = !DIEnumerator(name: "Ray_Sphere_Tests", value: 70, isUnsigned: true)
!225 = !DIEnumerator(name: "Ray_Sphere_Tests_Succeeded", value: 71, isUnsigned: true)
!226 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests", value: 72, isUnsigned: true)
!227 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests_Succeeded", value: 73, isUnsigned: true)
!228 = !DIEnumerator(name: "Ray_Superellipsoid_Tests", value: 74, isUnsigned: true)
!229 = !DIEnumerator(name: "Ray_Superellipsoid_Tests_Succeeded", value: 75, isUnsigned: true)
!230 = !DIEnumerator(name: "Ray_Sor_Tests", value: 76, isUnsigned: true)
!231 = !DIEnumerator(name: "Ray_Sor_Tests_Succeeded", value: 77, isUnsigned: true)
!232 = !DIEnumerator(name: "Sor_Bound_Tests", value: 78, isUnsigned: true)
!233 = !DIEnumerator(name: "Sor_Bound_Tests_Succeeded", value: 79, isUnsigned: true)
!234 = !DIEnumerator(name: "Ray_Torus_Tests", value: 80, isUnsigned: true)
!235 = !DIEnumerator(name: "Ray_Torus_Tests_Succeeded", value: 81, isUnsigned: true)
!236 = !DIEnumerator(name: "Torus_Bound_Tests", value: 82, isUnsigned: true)
!237 = !DIEnumerator(name: "Torus_Bound_Tests_Succeeded", value: 83, isUnsigned: true)
!238 = !DIEnumerator(name: "Ray_Triangle_Tests", value: 84, isUnsigned: true)
!239 = !DIEnumerator(name: "Ray_Triangle_Tests_Succeeded", value: 85, isUnsigned: true)
!240 = !DIEnumerator(name: "Ray_TTF_Tests", value: 86, isUnsigned: true)
!241 = !DIEnumerator(name: "Ray_TTF_Tests_Succeeded", value: 87, isUnsigned: true)
!242 = !DIEnumerator(name: "Bounding_Region_Tests", value: 88, isUnsigned: true)
!243 = !DIEnumerator(name: "Bounding_Region_Tests_Succeeded", value: 89, isUnsigned: true)
!244 = !DIEnumerator(name: "Clipping_Region_Tests", value: 90, isUnsigned: true)
!245 = !DIEnumerator(name: "Clipping_Region_Tests_Succeeded", value: 91, isUnsigned: true)
!246 = !DIEnumerator(name: "Ray_IsoSurface_Find_Root", value: 92, isUnsigned: true)
!247 = !DIEnumerator(name: "Ray_Function_VM_Calls", value: 93, isUnsigned: true)
!248 = !DIEnumerator(name: "Ray_Function_VM_Instruction_Est", value: 94, isUnsigned: true)
!249 = !DIEnumerator(name: "VBuffer_Tests", value: 95, isUnsigned: true)
!250 = !DIEnumerator(name: "VBuffer_Tests_Succeeded", value: 96, isUnsigned: true)
!251 = !DIEnumerator(name: "LBuffer_Tests", value: 97, isUnsigned: true)
!252 = !DIEnumerator(name: "LBuffer_Tests_Succeeded", value: 98, isUnsigned: true)
!253 = !DIEnumerator(name: "Media_Samples", value: 99, isUnsigned: true)
!254 = !DIEnumerator(name: "Media_Intervals", value: 100, isUnsigned: true)
!255 = !DIEnumerator(name: "Reflected_Rays_Traced", value: 101, isUnsigned: true)
!256 = !DIEnumerator(name: "Refracted_Rays_Traced", value: 102, isUnsigned: true)
!257 = !DIEnumerator(name: "Transmitted_Rays_Traced", value: 103, isUnsigned: true)
!258 = !DIEnumerator(name: "Internal_Reflected_Rays_Traced", value: 104, isUnsigned: true)
!259 = !DIEnumerator(name: "Shadow_Cache_Hits", value: 105, isUnsigned: true)
!260 = !DIEnumerator(name: "Shadow_Rays_Succeeded", value: 106, isUnsigned: true)
!261 = !DIEnumerator(name: "Shadow_Ray_Tests", value: 107, isUnsigned: true)
!262 = !DIEnumerator(name: "nChecked", value: 108, isUnsigned: true)
!263 = !DIEnumerator(name: "nEnqueued", value: 109, isUnsigned: true)
!264 = !DIEnumerator(name: "totalQueues", value: 110, isUnsigned: true)
!265 = !DIEnumerator(name: "totalQueueResets", value: 111, isUnsigned: true)
!266 = !DIEnumerator(name: "totalQueueResizes", value: 112, isUnsigned: true)
!267 = !DIEnumerator(name: "Polynomials_Tested", value: 113, isUnsigned: true)
!268 = !DIEnumerator(name: "Roots_Eliminated", value: 114, isUnsigned: true)
!269 = !DIEnumerator(name: "Number_Of_Photons_Shot", value: 115, isUnsigned: true)
!270 = !DIEnumerator(name: "Number_Of_Photons_Stored", value: 116, isUnsigned: true)
!271 = !DIEnumerator(name: "Number_Of_Global_Photons_Stored", value: 117, isUnsigned: true)
!272 = !DIEnumerator(name: "Number_Of_Media_Photons_Stored", value: 118, isUnsigned: true)
!273 = !DIEnumerator(name: "Priority_Queue_Add", value: 119, isUnsigned: true)
!274 = !DIEnumerator(name: "Priority_Queue_Remove", value: 120, isUnsigned: true)
!275 = !DIEnumerator(name: "Gather_Performed_Count", value: 121, isUnsigned: true)
!276 = !DIEnumerator(name: "Gather_Expanded_Count", value: 122, isUnsigned: true)
!277 = !DIEnumerator(name: "MaxStat", value: 123, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !2, file: !5, line: 706, baseType: !56, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283}
!280 = !DIEnumerator(name: "X", value: 0, isUnsigned: true)
!281 = !DIEnumerator(name: "Y", value: 1, isUnsigned: true)
!282 = !DIEnumerator(name: "Z", value: 2, isUnsigned: true)
!283 = !DIEnumerator(name: "T", value: 3, isUnsigned: true)
!284 = !{!285, !44, !104}
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "CONE", scope: !2, file: !287, line: 51, baseType: !288)
!287 = !DIFile(filename: "./cones.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Cone_Struct", scope: !2, file: !287, line: 53, size: 1536, flags: DIFlagTypePassByValue, elements: !289, identifier: "_ZTSN3pov11Cone_StructE")
!289 = !{!290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !288, file: !287, line: 55, baseType: !19, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !288, file: !287, line: 55, baseType: !13, size: 32, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !288, file: !287, line: 55, baseType: !14, size: 64, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !288, file: !287, line: 55, baseType: !23, size: 64, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !288, file: !287, line: 55, baseType: !23, size: 64, offset: 256)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !288, file: !287, line: 55, baseType: !28, size: 64, offset: 320)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !288, file: !287, line: 55, baseType: !14, size: 64, offset: 384)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !288, file: !287, line: 55, baseType: !14, size: 64, offset: 448)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !288, file: !287, line: 55, baseType: !34, size: 64, offset: 512)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !288, file: !287, line: 55, baseType: !38, size: 192, offset: 576)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !288, file: !287, line: 55, baseType: !50, size: 64, offset: 768)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !288, file: !287, line: 55, baseType: !50, size: 64, offset: 832)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !288, file: !287, line: 55, baseType: !45, size: 32, offset: 896)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !288, file: !287, line: 55, baseType: !56, size: 32, offset: 928)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "apex", scope: !288, file: !287, line: 56, baseType: !62, size: 192, offset: 960)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !288, file: !287, line: 57, baseType: !62, size: 192, offset: 1152)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "apex_radius", scope: !288, file: !287, line: 58, baseType: !64, size: 64, offset: 1344)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "base_radius", scope: !288, file: !287, line: 59, baseType: !64, size: 64, offset: 1408)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !288, file: !287, line: 60, baseType: !64, size: 64, offset: 1472)
!309 = !{!0, !310, !313, !316, !318}
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression(DW_OP_constu, 4517329193108106637, DW_OP_stack_value))
!311 = distinct !DIGlobalVariable(name: "Cone_Tolerance", scope: !2, file: !3, line: 48, type: !312, isLocal: true, isDefinition: true)
!312 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression(DW_OP_constu, 3, DW_OP_stack_value))
!314 = distinct !DIGlobalVariable(name: "SIDE_HIT", scope: !2, file: !3, line: 56, type: !315, isLocal: true, isDefinition: true)
!315 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!317 = distinct !DIGlobalVariable(name: "CAP_HIT", scope: !2, file: !3, line: 55, type: !315, isLocal: true, isDefinition: true)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression(DW_OP_constu, 1, DW_OP_stack_value))
!319 = distinct !DIGlobalVariable(name: "BASE_HIT", scope: !2, file: !3, line: 54, type: !315, isLocal: true, isDefinition: true)
!320 = !{!321, !328, !334, !336, !338, !342, !344, !346, !348, !350, !352, !354, !356, !361, !365, !367, !369, !373, !375, !377, !379, !381, !383, !385, !388, !390, !392, !396, !401, !403, !405, !407, !409, !411, !413, !415, !417, !419, !421, !425, !429, !431, !433, !435, !437, !439, !441, !443, !445, !447, !449, !451, !453, !455, !457, !459, !463, !467, !471, !473, !475, !477, !479, !481, !483, !485, !487, !489, !493, !497, !501, !503, !505, !507, !512, !516, !520, !522, !524, !526, !528, !530, !532, !534, !536, !538, !540, !542, !544, !549, !553, !557, !559, !561, !563, !570, !574, !578, !580, !582, !584, !586, !588, !590, !594, !598, !600, !602, !604, !606, !610, !614, !618, !620, !622, !624, !626, !628, !630, !634, !638, !642, !644, !648, !652, !654, !656, !658, !660, !662, !664, !670, !675, !679, !685, !689, !694, !696, !698, !702, !706, !719, !723, !727, !731, !735, !740, !744, !748, !752, !756, !764, !768, !772, !774, !778, !782, !786, !792, !796, !800, !802, !810, !814, !821, !823, !827, !831, !835, !839, !844, !848, !852, !853, !854, !855, !857, !858, !859, !860, !861, !862, !863, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !900, !902, !904, !906, !908, !910, !912, !914, !916, !918, !920, !922, !924, !926, !932, !936, !942, !946, !950, !954, !958, !960, !962, !966, !970, !974, !978, !982, !984, !986, !988, !992, !996, !1000, !1002, !1004, !1007, !1009, !1010, !1012, !1014, !1016, !1018, !1020, !1022, !1024, !1026, !1028, !1030, !1031, !1032, !1033, !1035, !1036, !1038, !1040}
!321 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !323, file: !327, line: 52)
!322 = !DINamespace(name: "std", scope: null)
!323 = !DISubprogram(name: "abs", scope: !324, file: !324, line: 840, type: !325, flags: DIFlagPrototyped, spFlags: 0)
!324 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!325 = !DISubroutineType(types: !326)
!326 = !{!13, !13}
!327 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/std_abs.h", directory: "")
!328 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !329, file: !333, line: 83)
!329 = !DISubprogram(name: "acos", scope: !330, file: !330, line: 53, type: !331, flags: DIFlagPrototyped, spFlags: 0)
!330 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/mathcalls.h", directory: "")
!331 = !DISubroutineType(types: !332)
!332 = !{!64, !64}
!333 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cmath", directory: "")
!334 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !335, file: !333, line: 102)
!335 = !DISubprogram(name: "asin", scope: !330, file: !330, line: 55, type: !331, flags: DIFlagPrototyped, spFlags: 0)
!336 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !337, file: !333, line: 121)
!337 = !DISubprogram(name: "atan", scope: !330, file: !330, line: 57, type: !331, flags: DIFlagPrototyped, spFlags: 0)
!338 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !339, file: !333, line: 140)
!339 = !DISubprogram(name: "atan2", scope: !330, file: !330, line: 59, type: !340, flags: DIFlagPrototyped, spFlags: 0)
!340 = !DISubroutineType(types: !341)
!341 = !{!64, !64, !64}
!342 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !343, file: !333, line: 161)
!343 = !DISubprogram(name: "ceil", scope: !330, file: !330, line: 159, type: !331, flags: DIFlagPrototyped, spFlags: 0)
!344 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !345, file: !333, line: 180)
!345 = !DISubprogram(name: "cos", scope: !330, file: !330, line: 62, type: !331, flags: DIFlagPrototyped, spFlags: 0)
!346 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !347, file: !333, line: 199)
!347 = !DISubprogram(name: "cosh", scope: !330, file: !330, line: 71, type: !331, flags: DIFlagPrototyped, spFlags: 0)
!348 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !349, file: !333, line: 218)
!349 = !DISubprogram(name: "exp", scope: !330, file: !330, line: 95, type: !331, flags: DIFlagPrototyped, spFlags: 0)
!350 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !351, file: !333, line: 237)
!351 = !DISubprogram(name: "fabs", scope: !330, file: !330, line: 162, type: !331, flags: DIFlagPrototyped, spFlags: 0)
!352 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !353, file: !333, line: 256)
!353 = !DISubprogram(name: "floor", scope: !330, file: !330, line: 165, type: !331, flags: DIFlagPrototyped, spFlags: 0)
!354 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !355, file: !333, line: 275)
!355 = !DISubprogram(name: "fmod", scope: !330, file: !330, line: 168, type: !340, flags: DIFlagPrototyped, spFlags: 0)
!356 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !357, file: !333, line: 296)
!357 = !DISubprogram(name: "frexp", scope: !330, file: !330, line: 98, type: !358, flags: DIFlagPrototyped, spFlags: 0)
!358 = !DISubroutineType(types: !359)
!359 = !{!64, !64, !360}
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!361 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !362, file: !333, line: 315)
!362 = !DISubprogram(name: "ldexp", scope: !330, file: !330, line: 101, type: !363, flags: DIFlagPrototyped, spFlags: 0)
!363 = !DISubroutineType(types: !364)
!364 = !{!64, !64, !13}
!365 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !366, file: !333, line: 334)
!366 = !DISubprogram(name: "log", scope: !330, file: !330, line: 104, type: !331, flags: DIFlagPrototyped, spFlags: 0)
!367 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !368, file: !333, line: 353)
!368 = !DISubprogram(name: "log10", scope: !330, file: !330, line: 107, type: !331, flags: DIFlagPrototyped, spFlags: 0)
!369 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !370, file: !333, line: 372)
!370 = !DISubprogram(name: "modf", scope: !330, file: !330, line: 110, type: !371, flags: DIFlagPrototyped, spFlags: 0)
!371 = !DISubroutineType(types: !372)
!372 = !{!64, !64, !113}
!373 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !374, file: !333, line: 384)
!374 = !DISubprogram(name: "pow", scope: !330, file: !330, line: 140, type: !340, flags: DIFlagPrototyped, spFlags: 0)
!375 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !376, file: !333, line: 421)
!376 = !DISubprogram(name: "sin", scope: !330, file: !330, line: 64, type: !331, flags: DIFlagPrototyped, spFlags: 0)
!377 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !378, file: !333, line: 440)
!378 = !DISubprogram(name: "sinh", scope: !330, file: !330, line: 73, type: !331, flags: DIFlagPrototyped, spFlags: 0)
!379 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !380, file: !333, line: 459)
!380 = !DISubprogram(name: "sqrt", scope: !330, file: !330, line: 143, type: !331, flags: DIFlagPrototyped, spFlags: 0)
!381 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !382, file: !333, line: 478)
!382 = !DISubprogram(name: "tan", scope: !330, file: !330, line: 66, type: !331, flags: DIFlagPrototyped, spFlags: 0)
!383 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !384, file: !333, line: 497)
!384 = !DISubprogram(name: "tanh", scope: !330, file: !330, line: 75, type: !331, flags: DIFlagPrototyped, spFlags: 0)
!385 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !386, file: !333, line: 1065)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_t", file: !387, line: 150, baseType: !64)
!387 = !DIFile(filename: "/usr/include/math.h", directory: "")
!388 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !389, file: !333, line: 1066)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "float_t", file: !387, line: 149, baseType: !45)
!390 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !391, file: !333, line: 1069)
!391 = !DISubprogram(name: "acosh", scope: !330, file: !330, line: 85, type: !331, flags: DIFlagPrototyped, spFlags: 0)
!392 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !393, file: !333, line: 1070)
!393 = !DISubprogram(name: "acoshf", scope: !330, file: !330, line: 85, type: !394, flags: DIFlagPrototyped, spFlags: 0)
!394 = !DISubroutineType(types: !395)
!395 = !{!45, !45}
!396 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !397, file: !333, line: 1071)
!397 = !DISubprogram(name: "acoshl", scope: !330, file: !330, line: 85, type: !398, flags: DIFlagPrototyped, spFlags: 0)
!398 = !DISubroutineType(types: !399)
!399 = !{!400, !400}
!400 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!401 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !402, file: !333, line: 1073)
!402 = !DISubprogram(name: "asinh", scope: !330, file: !330, line: 87, type: !331, flags: DIFlagPrototyped, spFlags: 0)
!403 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !404, file: !333, line: 1074)
!404 = !DISubprogram(name: "asinhf", scope: !330, file: !330, line: 87, type: !394, flags: DIFlagPrototyped, spFlags: 0)
!405 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !406, file: !333, line: 1075)
!406 = !DISubprogram(name: "asinhl", scope: !330, file: !330, line: 87, type: !398, flags: DIFlagPrototyped, spFlags: 0)
!407 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !408, file: !333, line: 1077)
!408 = !DISubprogram(name: "atanh", scope: !330, file: !330, line: 89, type: !331, flags: DIFlagPrototyped, spFlags: 0)
!409 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !410, file: !333, line: 1078)
!410 = !DISubprogram(name: "atanhf", scope: !330, file: !330, line: 89, type: !394, flags: DIFlagPrototyped, spFlags: 0)
!411 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !412, file: !333, line: 1079)
!412 = !DISubprogram(name: "atanhl", scope: !330, file: !330, line: 89, type: !398, flags: DIFlagPrototyped, spFlags: 0)
!413 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !414, file: !333, line: 1081)
!414 = !DISubprogram(name: "cbrt", scope: !330, file: !330, line: 152, type: !331, flags: DIFlagPrototyped, spFlags: 0)
!415 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !416, file: !333, line: 1082)
!416 = !DISubprogram(name: "cbrtf", scope: !330, file: !330, line: 152, type: !394, flags: DIFlagPrototyped, spFlags: 0)
!417 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !418, file: !333, line: 1083)
!418 = !DISubprogram(name: "cbrtl", scope: !330, file: !330, line: 152, type: !398, flags: DIFlagPrototyped, spFlags: 0)
!419 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !420, file: !333, line: 1085)
!420 = !DISubprogram(name: "copysign", scope: !330, file: !330, line: 196, type: !340, flags: DIFlagPrototyped, spFlags: 0)
!421 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !422, file: !333, line: 1086)
!422 = !DISubprogram(name: "copysignf", scope: !330, file: !330, line: 196, type: !423, flags: DIFlagPrototyped, spFlags: 0)
!423 = !DISubroutineType(types: !424)
!424 = !{!45, !45, !45}
!425 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !426, file: !333, line: 1087)
!426 = !DISubprogram(name: "copysignl", scope: !330, file: !330, line: 196, type: !427, flags: DIFlagPrototyped, spFlags: 0)
!427 = !DISubroutineType(types: !428)
!428 = !{!400, !400, !400}
!429 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !430, file: !333, line: 1089)
!430 = !DISubprogram(name: "erf", scope: !330, file: !330, line: 228, type: !331, flags: DIFlagPrototyped, spFlags: 0)
!431 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !432, file: !333, line: 1090)
!432 = !DISubprogram(name: "erff", scope: !330, file: !330, line: 228, type: !394, flags: DIFlagPrototyped, spFlags: 0)
!433 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !434, file: !333, line: 1091)
!434 = !DISubprogram(name: "erfl", scope: !330, file: !330, line: 228, type: !398, flags: DIFlagPrototyped, spFlags: 0)
!435 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !436, file: !333, line: 1093)
!436 = !DISubprogram(name: "erfc", scope: !330, file: !330, line: 229, type: !331, flags: DIFlagPrototyped, spFlags: 0)
!437 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !438, file: !333, line: 1094)
!438 = !DISubprogram(name: "erfcf", scope: !330, file: !330, line: 229, type: !394, flags: DIFlagPrototyped, spFlags: 0)
!439 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !440, file: !333, line: 1095)
!440 = !DISubprogram(name: "erfcl", scope: !330, file: !330, line: 229, type: !398, flags: DIFlagPrototyped, spFlags: 0)
!441 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !442, file: !333, line: 1097)
!442 = !DISubprogram(name: "exp2", scope: !330, file: !330, line: 130, type: !331, flags: DIFlagPrototyped, spFlags: 0)
!443 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !444, file: !333, line: 1098)
!444 = !DISubprogram(name: "exp2f", scope: !330, file: !330, line: 130, type: !394, flags: DIFlagPrototyped, spFlags: 0)
!445 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !446, file: !333, line: 1099)
!446 = !DISubprogram(name: "exp2l", scope: !330, file: !330, line: 130, type: !398, flags: DIFlagPrototyped, spFlags: 0)
!447 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !448, file: !333, line: 1101)
!448 = !DISubprogram(name: "expm1", scope: !330, file: !330, line: 119, type: !331, flags: DIFlagPrototyped, spFlags: 0)
!449 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !450, file: !333, line: 1102)
!450 = !DISubprogram(name: "expm1f", scope: !330, file: !330, line: 119, type: !394, flags: DIFlagPrototyped, spFlags: 0)
!451 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !452, file: !333, line: 1103)
!452 = !DISubprogram(name: "expm1l", scope: !330, file: !330, line: 119, type: !398, flags: DIFlagPrototyped, spFlags: 0)
!453 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !454, file: !333, line: 1105)
!454 = !DISubprogram(name: "fdim", scope: !330, file: !330, line: 326, type: !340, flags: DIFlagPrototyped, spFlags: 0)
!455 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !456, file: !333, line: 1106)
!456 = !DISubprogram(name: "fdimf", scope: !330, file: !330, line: 326, type: !423, flags: DIFlagPrototyped, spFlags: 0)
!457 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !458, file: !333, line: 1107)
!458 = !DISubprogram(name: "fdiml", scope: !330, file: !330, line: 326, type: !427, flags: DIFlagPrototyped, spFlags: 0)
!459 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !460, file: !333, line: 1109)
!460 = !DISubprogram(name: "fma", scope: !330, file: !330, line: 335, type: !461, flags: DIFlagPrototyped, spFlags: 0)
!461 = !DISubroutineType(types: !462)
!462 = !{!64, !64, !64, !64}
!463 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !464, file: !333, line: 1110)
!464 = !DISubprogram(name: "fmaf", scope: !330, file: !330, line: 335, type: !465, flags: DIFlagPrototyped, spFlags: 0)
!465 = !DISubroutineType(types: !466)
!466 = !{!45, !45, !45, !45}
!467 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !468, file: !333, line: 1111)
!468 = !DISubprogram(name: "fmal", scope: !330, file: !330, line: 335, type: !469, flags: DIFlagPrototyped, spFlags: 0)
!469 = !DISubroutineType(types: !470)
!470 = !{!400, !400, !400, !400}
!471 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !472, file: !333, line: 1113)
!472 = !DISubprogram(name: "fmax", scope: !330, file: !330, line: 329, type: !340, flags: DIFlagPrototyped, spFlags: 0)
!473 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !474, file: !333, line: 1114)
!474 = !DISubprogram(name: "fmaxf", scope: !330, file: !330, line: 329, type: !423, flags: DIFlagPrototyped, spFlags: 0)
!475 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !476, file: !333, line: 1115)
!476 = !DISubprogram(name: "fmaxl", scope: !330, file: !330, line: 329, type: !427, flags: DIFlagPrototyped, spFlags: 0)
!477 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !478, file: !333, line: 1117)
!478 = !DISubprogram(name: "fmin", scope: !330, file: !330, line: 332, type: !340, flags: DIFlagPrototyped, spFlags: 0)
!479 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !480, file: !333, line: 1118)
!480 = !DISubprogram(name: "fminf", scope: !330, file: !330, line: 332, type: !423, flags: DIFlagPrototyped, spFlags: 0)
!481 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !482, file: !333, line: 1119)
!482 = !DISubprogram(name: "fminl", scope: !330, file: !330, line: 332, type: !427, flags: DIFlagPrototyped, spFlags: 0)
!483 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !484, file: !333, line: 1121)
!484 = !DISubprogram(name: "hypot", scope: !330, file: !330, line: 147, type: !340, flags: DIFlagPrototyped, spFlags: 0)
!485 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !486, file: !333, line: 1122)
!486 = !DISubprogram(name: "hypotf", scope: !330, file: !330, line: 147, type: !423, flags: DIFlagPrototyped, spFlags: 0)
!487 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !488, file: !333, line: 1123)
!488 = !DISubprogram(name: "hypotl", scope: !330, file: !330, line: 147, type: !427, flags: DIFlagPrototyped, spFlags: 0)
!489 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !490, file: !333, line: 1125)
!490 = !DISubprogram(name: "ilogb", scope: !330, file: !330, line: 280, type: !491, flags: DIFlagPrototyped, spFlags: 0)
!491 = !DISubroutineType(types: !492)
!492 = !{!13, !64}
!493 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !494, file: !333, line: 1126)
!494 = !DISubprogram(name: "ilogbf", scope: !330, file: !330, line: 280, type: !495, flags: DIFlagPrototyped, spFlags: 0)
!495 = !DISubroutineType(types: !496)
!496 = !{!13, !45}
!497 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !498, file: !333, line: 1127)
!498 = !DISubprogram(name: "ilogbl", scope: !330, file: !330, line: 280, type: !499, flags: DIFlagPrototyped, spFlags: 0)
!499 = !DISubroutineType(types: !500)
!500 = !{!13, !400}
!501 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !502, file: !333, line: 1129)
!502 = !DISubprogram(name: "lgamma", scope: !330, file: !330, line: 230, type: !331, flags: DIFlagPrototyped, spFlags: 0)
!503 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !504, file: !333, line: 1130)
!504 = !DISubprogram(name: "lgammaf", scope: !330, file: !330, line: 230, type: !394, flags: DIFlagPrototyped, spFlags: 0)
!505 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !506, file: !333, line: 1131)
!506 = !DISubprogram(name: "lgammal", scope: !330, file: !330, line: 230, type: !398, flags: DIFlagPrototyped, spFlags: 0)
!507 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !508, file: !333, line: 1134)
!508 = !DISubprogram(name: "llrint", scope: !330, file: !330, line: 316, type: !509, flags: DIFlagPrototyped, spFlags: 0)
!509 = !DISubroutineType(types: !510)
!510 = !{!511, !64}
!511 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!512 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !513, file: !333, line: 1135)
!513 = !DISubprogram(name: "llrintf", scope: !330, file: !330, line: 316, type: !514, flags: DIFlagPrototyped, spFlags: 0)
!514 = !DISubroutineType(types: !515)
!515 = !{!511, !45}
!516 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !517, file: !333, line: 1136)
!517 = !DISubprogram(name: "llrintl", scope: !330, file: !330, line: 316, type: !518, flags: DIFlagPrototyped, spFlags: 0)
!518 = !DISubroutineType(types: !519)
!519 = !{!511, !400}
!520 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !521, file: !333, line: 1138)
!521 = !DISubprogram(name: "llround", scope: !330, file: !330, line: 322, type: !509, flags: DIFlagPrototyped, spFlags: 0)
!522 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !523, file: !333, line: 1139)
!523 = !DISubprogram(name: "llroundf", scope: !330, file: !330, line: 322, type: !514, flags: DIFlagPrototyped, spFlags: 0)
!524 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !525, file: !333, line: 1140)
!525 = !DISubprogram(name: "llroundl", scope: !330, file: !330, line: 322, type: !518, flags: DIFlagPrototyped, spFlags: 0)
!526 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !527, file: !333, line: 1143)
!527 = !DISubprogram(name: "log1p", scope: !330, file: !330, line: 122, type: !331, flags: DIFlagPrototyped, spFlags: 0)
!528 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !529, file: !333, line: 1144)
!529 = !DISubprogram(name: "log1pf", scope: !330, file: !330, line: 122, type: !394, flags: DIFlagPrototyped, spFlags: 0)
!530 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !531, file: !333, line: 1145)
!531 = !DISubprogram(name: "log1pl", scope: !330, file: !330, line: 122, type: !398, flags: DIFlagPrototyped, spFlags: 0)
!532 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !533, file: !333, line: 1147)
!533 = !DISubprogram(name: "log2", scope: !330, file: !330, line: 133, type: !331, flags: DIFlagPrototyped, spFlags: 0)
!534 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !535, file: !333, line: 1148)
!535 = !DISubprogram(name: "log2f", scope: !330, file: !330, line: 133, type: !394, flags: DIFlagPrototyped, spFlags: 0)
!536 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !537, file: !333, line: 1149)
!537 = !DISubprogram(name: "log2l", scope: !330, file: !330, line: 133, type: !398, flags: DIFlagPrototyped, spFlags: 0)
!538 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !539, file: !333, line: 1151)
!539 = !DISubprogram(name: "logb", scope: !330, file: !330, line: 125, type: !331, flags: DIFlagPrototyped, spFlags: 0)
!540 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !541, file: !333, line: 1152)
!541 = !DISubprogram(name: "logbf", scope: !330, file: !330, line: 125, type: !394, flags: DIFlagPrototyped, spFlags: 0)
!542 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !543, file: !333, line: 1153)
!543 = !DISubprogram(name: "logbl", scope: !330, file: !330, line: 125, type: !398, flags: DIFlagPrototyped, spFlags: 0)
!544 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !545, file: !333, line: 1155)
!545 = !DISubprogram(name: "lrint", scope: !330, file: !330, line: 314, type: !546, flags: DIFlagPrototyped, spFlags: 0)
!546 = !DISubroutineType(types: !547)
!547 = !{!548, !64}
!548 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!549 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !550, file: !333, line: 1156)
!550 = !DISubprogram(name: "lrintf", scope: !330, file: !330, line: 314, type: !551, flags: DIFlagPrototyped, spFlags: 0)
!551 = !DISubroutineType(types: !552)
!552 = !{!548, !45}
!553 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !554, file: !333, line: 1157)
!554 = !DISubprogram(name: "lrintl", scope: !330, file: !330, line: 314, type: !555, flags: DIFlagPrototyped, spFlags: 0)
!555 = !DISubroutineType(types: !556)
!556 = !{!548, !400}
!557 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !558, file: !333, line: 1159)
!558 = !DISubprogram(name: "lround", scope: !330, file: !330, line: 320, type: !546, flags: DIFlagPrototyped, spFlags: 0)
!559 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !560, file: !333, line: 1160)
!560 = !DISubprogram(name: "lroundf", scope: !330, file: !330, line: 320, type: !551, flags: DIFlagPrototyped, spFlags: 0)
!561 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !562, file: !333, line: 1161)
!562 = !DISubprogram(name: "lroundl", scope: !330, file: !330, line: 320, type: !555, flags: DIFlagPrototyped, spFlags: 0)
!563 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !564, file: !333, line: 1163)
!564 = !DISubprogram(name: "nan", scope: !330, file: !330, line: 201, type: !565, flags: DIFlagPrototyped, spFlags: 0)
!565 = !DISubroutineType(types: !566)
!566 = !{!64, !567}
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !569)
!569 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!570 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !571, file: !333, line: 1164)
!571 = !DISubprogram(name: "nanf", scope: !330, file: !330, line: 201, type: !572, flags: DIFlagPrototyped, spFlags: 0)
!572 = !DISubroutineType(types: !573)
!573 = !{!45, !567}
!574 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !575, file: !333, line: 1165)
!575 = !DISubprogram(name: "nanl", scope: !330, file: !330, line: 201, type: !576, flags: DIFlagPrototyped, spFlags: 0)
!576 = !DISubroutineType(types: !577)
!577 = !{!400, !567}
!578 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !579, file: !333, line: 1167)
!579 = !DISubprogram(name: "nearbyint", scope: !330, file: !330, line: 294, type: !331, flags: DIFlagPrototyped, spFlags: 0)
!580 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !581, file: !333, line: 1168)
!581 = !DISubprogram(name: "nearbyintf", scope: !330, file: !330, line: 294, type: !394, flags: DIFlagPrototyped, spFlags: 0)
!582 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !583, file: !333, line: 1169)
!583 = !DISubprogram(name: "nearbyintl", scope: !330, file: !330, line: 294, type: !398, flags: DIFlagPrototyped, spFlags: 0)
!584 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !585, file: !333, line: 1171)
!585 = !DISubprogram(name: "nextafter", scope: !330, file: !330, line: 259, type: !340, flags: DIFlagPrototyped, spFlags: 0)
!586 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !587, file: !333, line: 1172)
!587 = !DISubprogram(name: "nextafterf", scope: !330, file: !330, line: 259, type: !423, flags: DIFlagPrototyped, spFlags: 0)
!588 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !589, file: !333, line: 1173)
!589 = !DISubprogram(name: "nextafterl", scope: !330, file: !330, line: 259, type: !427, flags: DIFlagPrototyped, spFlags: 0)
!590 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !591, file: !333, line: 1175)
!591 = !DISubprogram(name: "nexttoward", scope: !330, file: !330, line: 261, type: !592, flags: DIFlagPrototyped, spFlags: 0)
!592 = !DISubroutineType(types: !593)
!593 = !{!64, !64, !400}
!594 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !595, file: !333, line: 1176)
!595 = !DISubprogram(name: "nexttowardf", scope: !330, file: !330, line: 261, type: !596, flags: DIFlagPrototyped, spFlags: 0)
!596 = !DISubroutineType(types: !597)
!597 = !{!45, !45, !400}
!598 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !599, file: !333, line: 1177)
!599 = !DISubprogram(name: "nexttowardl", scope: !330, file: !330, line: 261, type: !427, flags: DIFlagPrototyped, spFlags: 0)
!600 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !601, file: !333, line: 1179)
!601 = !DISubprogram(name: "remainder", scope: !330, file: !330, line: 272, type: !340, flags: DIFlagPrototyped, spFlags: 0)
!602 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !603, file: !333, line: 1180)
!603 = !DISubprogram(name: "remainderf", scope: !330, file: !330, line: 272, type: !423, flags: DIFlagPrototyped, spFlags: 0)
!604 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !605, file: !333, line: 1181)
!605 = !DISubprogram(name: "remainderl", scope: !330, file: !330, line: 272, type: !427, flags: DIFlagPrototyped, spFlags: 0)
!606 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !607, file: !333, line: 1183)
!607 = !DISubprogram(name: "remquo", scope: !330, file: !330, line: 307, type: !608, flags: DIFlagPrototyped, spFlags: 0)
!608 = !DISubroutineType(types: !609)
!609 = !{!64, !64, !64, !360}
!610 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !611, file: !333, line: 1184)
!611 = !DISubprogram(name: "remquof", scope: !330, file: !330, line: 307, type: !612, flags: DIFlagPrototyped, spFlags: 0)
!612 = !DISubroutineType(types: !613)
!613 = !{!45, !45, !45, !360}
!614 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !615, file: !333, line: 1185)
!615 = !DISubprogram(name: "remquol", scope: !330, file: !330, line: 307, type: !616, flags: DIFlagPrototyped, spFlags: 0)
!616 = !DISubroutineType(types: !617)
!617 = !{!400, !400, !400, !360}
!618 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !619, file: !333, line: 1187)
!619 = !DISubprogram(name: "rint", scope: !330, file: !330, line: 256, type: !331, flags: DIFlagPrototyped, spFlags: 0)
!620 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !621, file: !333, line: 1188)
!621 = !DISubprogram(name: "rintf", scope: !330, file: !330, line: 256, type: !394, flags: DIFlagPrototyped, spFlags: 0)
!622 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !623, file: !333, line: 1189)
!623 = !DISubprogram(name: "rintl", scope: !330, file: !330, line: 256, type: !398, flags: DIFlagPrototyped, spFlags: 0)
!624 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !625, file: !333, line: 1191)
!625 = !DISubprogram(name: "round", scope: !330, file: !330, line: 298, type: !331, flags: DIFlagPrototyped, spFlags: 0)
!626 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !627, file: !333, line: 1192)
!627 = !DISubprogram(name: "roundf", scope: !330, file: !330, line: 298, type: !394, flags: DIFlagPrototyped, spFlags: 0)
!628 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !629, file: !333, line: 1193)
!629 = !DISubprogram(name: "roundl", scope: !330, file: !330, line: 298, type: !398, flags: DIFlagPrototyped, spFlags: 0)
!630 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !631, file: !333, line: 1195)
!631 = !DISubprogram(name: "scalbln", scope: !330, file: !330, line: 290, type: !632, flags: DIFlagPrototyped, spFlags: 0)
!632 = !DISubroutineType(types: !633)
!633 = !{!64, !64, !548}
!634 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !635, file: !333, line: 1196)
!635 = !DISubprogram(name: "scalblnf", scope: !330, file: !330, line: 290, type: !636, flags: DIFlagPrototyped, spFlags: 0)
!636 = !DISubroutineType(types: !637)
!637 = !{!45, !45, !548}
!638 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !639, file: !333, line: 1197)
!639 = !DISubprogram(name: "scalblnl", scope: !330, file: !330, line: 290, type: !640, flags: DIFlagPrototyped, spFlags: 0)
!640 = !DISubroutineType(types: !641)
!641 = !{!400, !400, !548}
!642 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !643, file: !333, line: 1199)
!643 = !DISubprogram(name: "scalbn", scope: !330, file: !330, line: 276, type: !363, flags: DIFlagPrototyped, spFlags: 0)
!644 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !645, file: !333, line: 1200)
!645 = !DISubprogram(name: "scalbnf", scope: !330, file: !330, line: 276, type: !646, flags: DIFlagPrototyped, spFlags: 0)
!646 = !DISubroutineType(types: !647)
!647 = !{!45, !45, !13}
!648 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !649, file: !333, line: 1201)
!649 = !DISubprogram(name: "scalbnl", scope: !330, file: !330, line: 276, type: !650, flags: DIFlagPrototyped, spFlags: 0)
!650 = !DISubroutineType(types: !651)
!651 = !{!400, !400, !13}
!652 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !653, file: !333, line: 1203)
!653 = !DISubprogram(name: "tgamma", scope: !330, file: !330, line: 235, type: !331, flags: DIFlagPrototyped, spFlags: 0)
!654 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !655, file: !333, line: 1204)
!655 = !DISubprogram(name: "tgammaf", scope: !330, file: !330, line: 235, type: !394, flags: DIFlagPrototyped, spFlags: 0)
!656 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !657, file: !333, line: 1205)
!657 = !DISubprogram(name: "tgammal", scope: !330, file: !330, line: 235, type: !398, flags: DIFlagPrototyped, spFlags: 0)
!658 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !659, file: !333, line: 1207)
!659 = !DISubprogram(name: "trunc", scope: !330, file: !330, line: 302, type: !331, flags: DIFlagPrototyped, spFlags: 0)
!660 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !661, file: !333, line: 1208)
!661 = !DISubprogram(name: "truncf", scope: !330, file: !330, line: 302, type: !394, flags: DIFlagPrototyped, spFlags: 0)
!662 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !663, file: !333, line: 1209)
!663 = !DISubprogram(name: "truncl", scope: !330, file: !330, line: 302, type: !398, flags: DIFlagPrototyped, spFlags: 0)
!664 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !665, file: !669, line: 38)
!665 = !DISubprogram(name: "abs", linkageName: "_ZSt3absg", scope: !322, file: !327, line: 103, type: !666, flags: DIFlagPrototyped, spFlags: 0)
!666 = !DISubroutineType(types: !667)
!667 = !{!668, !668}
!668 = !DIBasicType(name: "__float128", size: 128, encoding: DW_ATE_float)
!669 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/math.h", directory: "")
!670 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !671, file: !669, line: 54)
!671 = !DISubprogram(name: "modf", linkageName: "_ZSt4modfePe", scope: !322, file: !333, line: 380, type: !672, flags: DIFlagPrototyped, spFlags: 0)
!672 = !DISubroutineType(types: !673)
!673 = !{!400, !400, !674}
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!675 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !676, file: !678, line: 127)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !324, line: 62, baseType: !677)
!677 = !DICompositeType(tag: DW_TAG_structure_type, file: !324, line: 58, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!678 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cstdlib", directory: "")
!679 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !680, file: !678, line: 128)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !324, line: 70, baseType: !681)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !324, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !682, identifier: "_ZTS6ldiv_t")
!682 = !{!683, !684}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !681, file: !324, line: 68, baseType: !548, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !681, file: !324, line: 69, baseType: !548, size: 64, offset: 64)
!685 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !686, file: !678, line: 130)
!686 = !DISubprogram(name: "abort", scope: !324, file: !324, line: 591, type: !687, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!687 = !DISubroutineType(types: !688)
!688 = !{null}
!689 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !690, file: !678, line: 134)
!690 = !DISubprogram(name: "atexit", scope: !324, file: !324, line: 595, type: !691, flags: DIFlagPrototyped, spFlags: 0)
!691 = !DISubroutineType(types: !692)
!692 = !{!13, !693}
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!694 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !695, file: !678, line: 137)
!695 = !DISubprogram(name: "at_quick_exit", scope: !324, file: !324, line: 600, type: !691, flags: DIFlagPrototyped, spFlags: 0)
!696 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !697, file: !678, line: 140)
!697 = !DISubprogram(name: "atof", scope: !324, file: !324, line: 101, type: !565, flags: DIFlagPrototyped, spFlags: 0)
!698 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !699, file: !678, line: 141)
!699 = !DISubprogram(name: "atoi", scope: !324, file: !324, line: 104, type: !700, flags: DIFlagPrototyped, spFlags: 0)
!700 = !DISubroutineType(types: !701)
!701 = !{!13, !567}
!702 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !703, file: !678, line: 142)
!703 = !DISubprogram(name: "atol", scope: !324, file: !324, line: 107, type: !704, flags: DIFlagPrototyped, spFlags: 0)
!704 = !DISubroutineType(types: !705)
!705 = !{!548, !567}
!706 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !707, file: !678, line: 143)
!707 = !DISubprogram(name: "bsearch", scope: !324, file: !324, line: 820, type: !708, flags: DIFlagPrototyped, spFlags: 0)
!708 = !DISubroutineType(types: !709)
!709 = !{!104, !710, !710, !712, !712, !715}
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !713, line: 46, baseType: !714)
!713 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!714 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !324, line: 808, baseType: !716)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DISubroutineType(types: !718)
!718 = !{!13, !710, !710}
!719 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !720, file: !678, line: 144)
!720 = !DISubprogram(name: "calloc", scope: !324, file: !324, line: 542, type: !721, flags: DIFlagPrototyped, spFlags: 0)
!721 = !DISubroutineType(types: !722)
!722 = !{!104, !712, !712}
!723 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !724, file: !678, line: 145)
!724 = !DISubprogram(name: "div", scope: !324, file: !324, line: 852, type: !725, flags: DIFlagPrototyped, spFlags: 0)
!725 = !DISubroutineType(types: !726)
!726 = !{!676, !13, !13}
!727 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !728, file: !678, line: 146)
!728 = !DISubprogram(name: "exit", scope: !324, file: !324, line: 617, type: !729, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!729 = !DISubroutineType(types: !730)
!730 = !{null, !13}
!731 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !732, file: !678, line: 147)
!732 = !DISubprogram(name: "free", scope: !324, file: !324, line: 565, type: !733, flags: DIFlagPrototyped, spFlags: 0)
!733 = !DISubroutineType(types: !734)
!734 = !{null, !104}
!735 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !736, file: !678, line: 148)
!736 = !DISubprogram(name: "getenv", scope: !324, file: !324, line: 634, type: !737, flags: DIFlagPrototyped, spFlags: 0)
!737 = !DISubroutineType(types: !738)
!738 = !{!739, !567}
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!740 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !741, file: !678, line: 149)
!741 = !DISubprogram(name: "labs", scope: !324, file: !324, line: 841, type: !742, flags: DIFlagPrototyped, spFlags: 0)
!742 = !DISubroutineType(types: !743)
!743 = !{!548, !548}
!744 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !745, file: !678, line: 150)
!745 = !DISubprogram(name: "ldiv", scope: !324, file: !324, line: 854, type: !746, flags: DIFlagPrototyped, spFlags: 0)
!746 = !DISubroutineType(types: !747)
!747 = !{!680, !548, !548}
!748 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !749, file: !678, line: 151)
!749 = !DISubprogram(name: "malloc", scope: !324, file: !324, line: 539, type: !750, flags: DIFlagPrototyped, spFlags: 0)
!750 = !DISubroutineType(types: !751)
!751 = !{!104, !712}
!752 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !753, file: !678, line: 153)
!753 = !DISubprogram(name: "mblen", scope: !324, file: !324, line: 922, type: !754, flags: DIFlagPrototyped, spFlags: 0)
!754 = !DISubroutineType(types: !755)
!755 = !{!13, !567, !712}
!756 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !757, file: !678, line: 154)
!757 = !DISubprogram(name: "mbstowcs", scope: !324, file: !324, line: 933, type: !758, flags: DIFlagPrototyped, spFlags: 0)
!758 = !DISubroutineType(types: !759)
!759 = !{!712, !760, !763, !712}
!760 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !761)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!763 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !567)
!764 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !765, file: !678, line: 155)
!765 = !DISubprogram(name: "mbtowc", scope: !324, file: !324, line: 925, type: !766, flags: DIFlagPrototyped, spFlags: 0)
!766 = !DISubroutineType(types: !767)
!767 = !{!13, !760, !763, !712}
!768 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !769, file: !678, line: 157)
!769 = !DISubprogram(name: "qsort", scope: !324, file: !324, line: 830, type: !770, flags: DIFlagPrototyped, spFlags: 0)
!770 = !DISubroutineType(types: !771)
!771 = !{null, !104, !712, !712, !715}
!772 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !773, file: !678, line: 160)
!773 = !DISubprogram(name: "quick_exit", scope: !324, file: !324, line: 623, type: !729, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!774 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !775, file: !678, line: 163)
!775 = !DISubprogram(name: "rand", scope: !324, file: !324, line: 453, type: !776, flags: DIFlagPrototyped, spFlags: 0)
!776 = !DISubroutineType(types: !777)
!777 = !{!13}
!778 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !779, file: !678, line: 164)
!779 = !DISubprogram(name: "realloc", scope: !324, file: !324, line: 550, type: !780, flags: DIFlagPrototyped, spFlags: 0)
!780 = !DISubroutineType(types: !781)
!781 = !{!104, !104, !712}
!782 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !783, file: !678, line: 165)
!783 = !DISubprogram(name: "srand", scope: !324, file: !324, line: 455, type: !784, flags: DIFlagPrototyped, spFlags: 0)
!784 = !DISubroutineType(types: !785)
!785 = !{null, !56}
!786 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !787, file: !678, line: 166)
!787 = !DISubprogram(name: "strtod", scope: !324, file: !324, line: 117, type: !788, flags: DIFlagPrototyped, spFlags: 0)
!788 = !DISubroutineType(types: !789)
!789 = !{!64, !763, !790}
!790 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !791)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!792 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !793, file: !678, line: 167)
!793 = !DISubprogram(name: "strtol", scope: !324, file: !324, line: 176, type: !794, flags: DIFlagPrototyped, spFlags: 0)
!794 = !DISubroutineType(types: !795)
!795 = !{!548, !763, !790, !13}
!796 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !797, file: !678, line: 168)
!797 = !DISubprogram(name: "strtoul", scope: !324, file: !324, line: 180, type: !798, flags: DIFlagPrototyped, spFlags: 0)
!798 = !DISubroutineType(types: !799)
!799 = !{!714, !763, !790, !13}
!800 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !801, file: !678, line: 169)
!801 = !DISubprogram(name: "system", scope: !324, file: !324, line: 784, type: !700, flags: DIFlagPrototyped, spFlags: 0)
!802 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !803, file: !678, line: 171)
!803 = !DISubprogram(name: "wcstombs", scope: !324, file: !324, line: 936, type: !804, flags: DIFlagPrototyped, spFlags: 0)
!804 = !DISubroutineType(types: !805)
!805 = !{!712, !806, !807, !712}
!806 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !739)
!807 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !808)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !762)
!810 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !811, file: !678, line: 172)
!811 = !DISubprogram(name: "wctomb", scope: !324, file: !324, line: 929, type: !812, flags: DIFlagPrototyped, spFlags: 0)
!812 = !DISubroutineType(types: !813)
!813 = !{!13, !739, !762}
!814 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !815, entity: !816, file: !678, line: 200)
!815 = !DINamespace(name: "__gnu_cxx", scope: null)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !324, line: 80, baseType: !817)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !324, line: 76, size: 128, flags: DIFlagTypePassByValue, elements: !818, identifier: "_ZTS7lldiv_t")
!818 = !{!819, !820}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !817, file: !324, line: 78, baseType: !511, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !817, file: !324, line: 79, baseType: !511, size: 64, offset: 64)
!821 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !815, entity: !822, file: !678, line: 206)
!822 = !DISubprogram(name: "_Exit", scope: !324, file: !324, line: 629, type: !729, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!823 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !815, entity: !824, file: !678, line: 210)
!824 = !DISubprogram(name: "llabs", scope: !324, file: !324, line: 844, type: !825, flags: DIFlagPrototyped, spFlags: 0)
!825 = !DISubroutineType(types: !826)
!826 = !{!511, !511}
!827 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !815, entity: !828, file: !678, line: 216)
!828 = !DISubprogram(name: "lldiv", scope: !324, file: !324, line: 858, type: !829, flags: DIFlagPrototyped, spFlags: 0)
!829 = !DISubroutineType(types: !830)
!830 = !{!816, !511, !511}
!831 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !815, entity: !832, file: !678, line: 227)
!832 = !DISubprogram(name: "atoll", scope: !324, file: !324, line: 112, type: !833, flags: DIFlagPrototyped, spFlags: 0)
!833 = !DISubroutineType(types: !834)
!834 = !{!511, !567}
!835 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !815, entity: !836, file: !678, line: 228)
!836 = !DISubprogram(name: "strtoll", scope: !324, file: !324, line: 200, type: !837, flags: DIFlagPrototyped, spFlags: 0)
!837 = !DISubroutineType(types: !838)
!838 = !{!511, !763, !790, !13}
!839 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !815, entity: !840, file: !678, line: 229)
!840 = !DISubprogram(name: "strtoull", scope: !324, file: !324, line: 205, type: !841, flags: DIFlagPrototyped, spFlags: 0)
!841 = !DISubroutineType(types: !842)
!842 = !{!843, !763, !790, !13}
!843 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!844 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !815, entity: !845, file: !678, line: 231)
!845 = !DISubprogram(name: "strtof", scope: !324, file: !324, line: 123, type: !846, flags: DIFlagPrototyped, spFlags: 0)
!846 = !DISubroutineType(types: !847)
!847 = !{!45, !763, !790}
!848 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !815, entity: !849, file: !678, line: 232)
!849 = !DISubprogram(name: "strtold", scope: !324, file: !324, line: 126, type: !850, flags: DIFlagPrototyped, spFlags: 0)
!850 = !DISubroutineType(types: !851)
!851 = !{!400, !763, !790}
!852 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !816, file: !678, line: 240)
!853 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !822, file: !678, line: 242)
!854 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !824, file: !678, line: 244)
!855 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !856, file: !678, line: 245)
!856 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !815, file: !678, line: 213, type: !829, flags: DIFlagPrototyped, spFlags: 0)
!857 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !828, file: !678, line: 246)
!858 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !832, file: !678, line: 248)
!859 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !845, file: !678, line: 249)
!860 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !836, file: !678, line: 250)
!861 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !840, file: !678, line: 251)
!862 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !849, file: !678, line: 252)
!863 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !686, file: !864, line: 38)
!864 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/stdlib.h", directory: "")
!865 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !690, file: !864, line: 39)
!866 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !728, file: !864, line: 40)
!867 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !695, file: !864, line: 43)
!868 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !773, file: !864, line: 46)
!869 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !676, file: !864, line: 51)
!870 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !680, file: !864, line: 52)
!871 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !665, file: !864, line: 54)
!872 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !697, file: !864, line: 55)
!873 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !699, file: !864, line: 56)
!874 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !703, file: !864, line: 57)
!875 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !707, file: !864, line: 58)
!876 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !720, file: !864, line: 59)
!877 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !856, file: !864, line: 60)
!878 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !732, file: !864, line: 61)
!879 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !736, file: !864, line: 62)
!880 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !741, file: !864, line: 63)
!881 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !745, file: !864, line: 64)
!882 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !749, file: !864, line: 65)
!883 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !753, file: !864, line: 67)
!884 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !757, file: !864, line: 68)
!885 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !765, file: !864, line: 69)
!886 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !769, file: !864, line: 71)
!887 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !775, file: !864, line: 72)
!888 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !779, file: !864, line: 73)
!889 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !783, file: !864, line: 74)
!890 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !787, file: !864, line: 75)
!891 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !793, file: !864, line: 76)
!892 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !797, file: !864, line: 77)
!893 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !801, file: !864, line: 78)
!894 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !803, file: !864, line: 80)
!895 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !811, file: !864, line: 81)
!896 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !897, file: !899, line: 64)
!897 = !DISubprogram(name: "isalnum", scope: !898, file: !898, line: 108, type: !325, flags: DIFlagPrototyped, spFlags: 0)
!898 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!899 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cctype", directory: "")
!900 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !901, file: !899, line: 65)
!901 = !DISubprogram(name: "isalpha", scope: !898, file: !898, line: 109, type: !325, flags: DIFlagPrototyped, spFlags: 0)
!902 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !903, file: !899, line: 66)
!903 = !DISubprogram(name: "iscntrl", scope: !898, file: !898, line: 110, type: !325, flags: DIFlagPrototyped, spFlags: 0)
!904 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !905, file: !899, line: 67)
!905 = !DISubprogram(name: "isdigit", scope: !898, file: !898, line: 111, type: !325, flags: DIFlagPrototyped, spFlags: 0)
!906 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !907, file: !899, line: 68)
!907 = !DISubprogram(name: "isgraph", scope: !898, file: !898, line: 113, type: !325, flags: DIFlagPrototyped, spFlags: 0)
!908 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !909, file: !899, line: 69)
!909 = !DISubprogram(name: "islower", scope: !898, file: !898, line: 112, type: !325, flags: DIFlagPrototyped, spFlags: 0)
!910 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !911, file: !899, line: 70)
!911 = !DISubprogram(name: "isprint", scope: !898, file: !898, line: 114, type: !325, flags: DIFlagPrototyped, spFlags: 0)
!912 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !913, file: !899, line: 71)
!913 = !DISubprogram(name: "ispunct", scope: !898, file: !898, line: 115, type: !325, flags: DIFlagPrototyped, spFlags: 0)
!914 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !915, file: !899, line: 72)
!915 = !DISubprogram(name: "isspace", scope: !898, file: !898, line: 116, type: !325, flags: DIFlagPrototyped, spFlags: 0)
!916 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !917, file: !899, line: 73)
!917 = !DISubprogram(name: "isupper", scope: !898, file: !898, line: 117, type: !325, flags: DIFlagPrototyped, spFlags: 0)
!918 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !919, file: !899, line: 74)
!919 = !DISubprogram(name: "isxdigit", scope: !898, file: !898, line: 118, type: !325, flags: DIFlagPrototyped, spFlags: 0)
!920 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !921, file: !899, line: 75)
!921 = !DISubprogram(name: "tolower", scope: !898, file: !898, line: 122, type: !325, flags: DIFlagPrototyped, spFlags: 0)
!922 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !923, file: !899, line: 76)
!923 = !DISubprogram(name: "toupper", scope: !898, file: !898, line: 125, type: !325, flags: DIFlagPrototyped, spFlags: 0)
!924 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !925, file: !899, line: 87)
!925 = !DISubprogram(name: "isblank", scope: !898, file: !898, line: 130, type: !325, flags: DIFlagPrototyped, spFlags: 0)
!926 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !927, file: !931, line: 77)
!927 = !DISubprogram(name: "memchr", scope: !928, file: !928, line: 73, type: !929, flags: DIFlagPrototyped, spFlags: 0)
!928 = !DIFile(filename: "/usr/include/string.h", directory: "")
!929 = !DISubroutineType(types: !930)
!930 = !{!710, !710, !13, !712}
!931 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cstring", directory: "")
!932 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !933, file: !931, line: 78)
!933 = !DISubprogram(name: "memcmp", scope: !928, file: !928, line: 64, type: !934, flags: DIFlagPrototyped, spFlags: 0)
!934 = !DISubroutineType(types: !935)
!935 = !{!13, !710, !710, !712}
!936 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !937, file: !931, line: 79)
!937 = !DISubprogram(name: "memcpy", scope: !928, file: !928, line: 43, type: !938, flags: DIFlagPrototyped, spFlags: 0)
!938 = !DISubroutineType(types: !939)
!939 = !{!104, !940, !941, !712}
!940 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !104)
!941 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !710)
!942 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !943, file: !931, line: 80)
!943 = !DISubprogram(name: "memmove", scope: !928, file: !928, line: 47, type: !944, flags: DIFlagPrototyped, spFlags: 0)
!944 = !DISubroutineType(types: !945)
!945 = !{!104, !104, !710, !712}
!946 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !947, file: !931, line: 81)
!947 = !DISubprogram(name: "memset", scope: !928, file: !928, line: 61, type: !948, flags: DIFlagPrototyped, spFlags: 0)
!948 = !DISubroutineType(types: !949)
!949 = !{!104, !104, !13, !712}
!950 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !951, file: !931, line: 82)
!951 = !DISubprogram(name: "strcat", scope: !928, file: !928, line: 130, type: !952, flags: DIFlagPrototyped, spFlags: 0)
!952 = !DISubroutineType(types: !953)
!953 = !{!739, !806, !763}
!954 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !955, file: !931, line: 83)
!955 = !DISubprogram(name: "strcmp", scope: !928, file: !928, line: 137, type: !956, flags: DIFlagPrototyped, spFlags: 0)
!956 = !DISubroutineType(types: !957)
!957 = !{!13, !567, !567}
!958 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !959, file: !931, line: 84)
!959 = !DISubprogram(name: "strcoll", scope: !928, file: !928, line: 144, type: !956, flags: DIFlagPrototyped, spFlags: 0)
!960 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !961, file: !931, line: 85)
!961 = !DISubprogram(name: "strcpy", scope: !928, file: !928, line: 122, type: !952, flags: DIFlagPrototyped, spFlags: 0)
!962 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !963, file: !931, line: 86)
!963 = !DISubprogram(name: "strcspn", scope: !928, file: !928, line: 273, type: !964, flags: DIFlagPrototyped, spFlags: 0)
!964 = !DISubroutineType(types: !965)
!965 = !{!712, !567, !567}
!966 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !967, file: !931, line: 87)
!967 = !DISubprogram(name: "strerror", scope: !928, file: !928, line: 397, type: !968, flags: DIFlagPrototyped, spFlags: 0)
!968 = !DISubroutineType(types: !969)
!969 = !{!739, !13}
!970 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !971, file: !931, line: 88)
!971 = !DISubprogram(name: "strlen", scope: !928, file: !928, line: 385, type: !972, flags: DIFlagPrototyped, spFlags: 0)
!972 = !DISubroutineType(types: !973)
!973 = !{!712, !567}
!974 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !975, file: !931, line: 89)
!975 = !DISubprogram(name: "strncat", scope: !928, file: !928, line: 133, type: !976, flags: DIFlagPrototyped, spFlags: 0)
!976 = !DISubroutineType(types: !977)
!977 = !{!739, !806, !763, !712}
!978 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !979, file: !931, line: 90)
!979 = !DISubprogram(name: "strncmp", scope: !928, file: !928, line: 140, type: !980, flags: DIFlagPrototyped, spFlags: 0)
!980 = !DISubroutineType(types: !981)
!981 = !{!13, !567, !567, !712}
!982 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !983, file: !931, line: 91)
!983 = !DISubprogram(name: "strncpy", scope: !928, file: !928, line: 125, type: !976, flags: DIFlagPrototyped, spFlags: 0)
!984 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !985, file: !931, line: 92)
!985 = !DISubprogram(name: "strspn", scope: !928, file: !928, line: 277, type: !964, flags: DIFlagPrototyped, spFlags: 0)
!986 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !987, file: !931, line: 93)
!987 = !DISubprogram(name: "strtok", scope: !928, file: !928, line: 336, type: !952, flags: DIFlagPrototyped, spFlags: 0)
!988 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !989, file: !931, line: 94)
!989 = !DISubprogram(name: "strxfrm", scope: !928, file: !928, line: 147, type: !990, flags: DIFlagPrototyped, spFlags: 0)
!990 = !DISubroutineType(types: !991)
!991 = !{!712, !806, !763, !712}
!992 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !993, file: !931, line: 95)
!993 = !DISubprogram(name: "strchr", scope: !928, file: !928, line: 208, type: !994, flags: DIFlagPrototyped, spFlags: 0)
!994 = !DISubroutineType(types: !995)
!995 = !{!567, !567, !13}
!996 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !997, file: !931, line: 96)
!997 = !DISubprogram(name: "strpbrk", scope: !928, file: !928, line: 285, type: !998, flags: DIFlagPrototyped, spFlags: 0)
!998 = !DISubroutineType(types: !999)
!999 = !{!567, !567, !567}
!1000 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !1001, file: !931, line: 97)
!1001 = !DISubprogram(name: "strrchr", scope: !928, file: !928, line: 235, type: !994, flags: DIFlagPrototyped, spFlags: 0)
!1002 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !322, entity: !1003, file: !931, line: 98)
!1003 = !DISubprogram(name: "strstr", scope: !928, file: !928, line: 312, type: !998, flags: DIFlagPrototyped, spFlags: 0)
!1004 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !1005, entity: !322, file: !1006, line: 37)
!1005 = !DINamespace(name: "pov_base", scope: null)
!1006 = !DIFile(filename: "base/fileinputoutput.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!1007 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !2, entity: !322, file: !1008, line: 36)
!1008 = !DIFile(filename: "./pov_mem.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!1009 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !2, entity: !322, file: !5, line: 78)
!1010 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !2, entity: !322, file: !1011, line: 36)
!1011 = !DIFile(filename: "./atmosph.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!1012 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !2, entity: !322, file: !1013, line: 36)
!1013 = !DIFile(filename: "./camera.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!1014 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !2, entity: !322, file: !1015, line: 37)
!1015 = !DIFile(filename: "./bbox.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!1016 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !2, entity: !322, file: !1017, line: 39)
!1017 = !DIFile(filename: "./vlbuffer.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!1018 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !2, entity: !322, file: !1019, line: 38)
!1019 = !DIFile(filename: "./point.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!1020 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !2, entity: !322, file: !1021, line: 38)
!1021 = !DIFile(filename: "./media.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!1022 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !2, entity: !322, file: !1023, line: 36)
