; ModuleID = 'mesh.cpp'
source_filename = "mesh.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"struct.pov::Object_Struct" = type { %"struct.pov::Method_Struct"*, i32, %"struct.pov::Object_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Interior_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Light_Source_Struct"*, %"struct.pov::Bounding_Box_Struct", %"struct.pov::Transform_Struct"*, %"struct.pov::Transform_Struct"*, float, i32 }
%"struct.pov::Method_Struct" = type { {}*, i32 (double*, %"struct.pov::Object_Struct"*)*, void (double*, %"struct.pov::Object_Struct"*, %"struct.pov::istk_entry"*)*, void (double*, %"struct.pov::Object_Struct"*, %"struct.pov::istk_entry"*)*, i8* (%"struct.pov::Object_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*)*, void (%"struct.pov::Object_Struct"*)* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "Mesh_Methods", linkageName: "_ZN3pov12Mesh_MethodsE", scope: !2, file: !3, line: 147, type: !4, isLocal: false, isDefinition: true)
!2 = !DINamespace(name: "pov", scope: null)
!3 = !DIFile(filename: "mesh.cpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "METHODS", scope: !2, file: !5, line: 1432, baseType: !6)
!5 = !DIFile(filename: "./frame.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!6 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Method_Struct", scope: !2, file: !5, line: 1517, size: 704, flags: DIFlagTypePassByValue, elements: !7, identifier: "_ZTSN3pov13Method_StructE")
!7 = !{!8, !115, !121, !128, !130, !135, !140, !142, !144, !149, !154}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "All_Intersections_Method", scope: !6, file: !5, line: 1519, baseType: !9, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALL_INTERSECTIONS_METHOD", scope: !2, file: !5, line: 1434, baseType: !10)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !14, !65, !79}
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !2, file: !5, line: 678, baseType: !16)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !2, file: !5, line: 1535, size: 960, flags: DIFlagTypePassByValue, elements: !17, identifier: "_ZTSN3pov13Object_StructE")
!17 = !{!18, !20, !21, !22, !26, !27, !31, !32, !33, !37, !49, !61, !62, !63}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !16, file: !5, line: 1537, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !16, file: !5, line: 1537, baseType: !13, size: 32, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !16, file: !5, line: 1537, baseType: !14, size: 64, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !16, file: !5, line: 1537, baseType: !23, size: 64, offset: 192)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXTURE", scope: !2, file: !5, line: 1035, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "Texture_Struct", scope: !2, file: !5, line: 1359, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov14Texture_StructE")
!26 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !16, file: !5, line: 1537, baseType: !23, size: 64, offset: 256)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !16, file: !5, line: 1537, baseType: !28, size: 64, offset: 320)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERIOR", scope: !2, file: !5, line: 1124, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "Interior_Struct", scope: !2, file: !5, line: 1126, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov15Interior_StructE")
!31 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !16, file: !5, line: 1537, baseType: !14, size: 64, offset: 384)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !16, file: !5, line: 1537, baseType: !14, size: 64, offset: 448)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !16, file: !5, line: 1537, baseType: !34, size: 64, offset: 512)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIGHT_SOURCE", scope: !2, file: !5, line: 1041, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Source_Struct", scope: !2, file: !5, line: 1580, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov19Light_Source_StructE")
!37 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !16, file: !5, line: 1537, baseType: !38, size: 192, offset: 576)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", scope: !2, file: !5, line: 888, baseType: !39)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Bounding_Box_Struct", scope: !2, file: !5, line: 890, size: 192, flags: DIFlagTypePassByValue, elements: !40, identifier: "_ZTSN3pov19Bounding_Box_StructE")
!40 = !{!41, !48}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "Lower_Left", scope: !39, file: !5, line: 892, baseType: !42, size: 96)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VECT", scope: !2, file: !5, line: 886, baseType: !43)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 96, elements: !46)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VAL", scope: !2, file: !5, line: 884, baseType: !45)
!45 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!46 = !{!47}
!47 = !DISubrange(count: 3)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "Lengths", scope: !39, file: !5, line: 892, baseType: !42, size: 96, offset: 96)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !16, file: !5, line: 1537, baseType: !50, size: 64, offset: 768)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM", scope: !2, file: !5, line: 1014, baseType: !52)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Transform_Struct", scope: !2, file: !5, line: 1016, size: 2048, flags: DIFlagTypePassByValue, elements: !53, identifier: "_ZTSN3pov16Transform_StructE")
!53 = !{!54, !60}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "matrix", scope: !52, file: !5, line: 1018, baseType: !55, size: 1024)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "MATRIX", scope: !2, file: !5, line: 693, baseType: !56)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 1024, elements: !58)
!57 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!58 = !{!59, !59}
!59 = !DISubrange(count: 4)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !52, file: !5, line: 1019, baseType: !55, size: 1024, offset: 1024)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !16, file: !5, line: 1537, baseType: !50, size: 64, offset: 832)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !16, file: !5, line: 1537, baseType: !45, size: 32, offset: 896)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !16, file: !5, line: 1537, baseType: !64, size: 32, offset: 928)
!64 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", scope: !2, file: !5, line: 680, baseType: !67)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Ray_Struct", scope: !2, file: !5, line: 1797, size: 6848, flags: DIFlagTypePassByValue, elements: !68, identifier: "_ZTSN3pov10Ray_StructE")
!68 = !{!69, !72, !73, !74, !75}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "Initial", scope: !67, file: !5, line: 1799, baseType: !70, size: 192)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !2, file: !5, line: 691, baseType: !71)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 192, elements: !46)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !67, file: !5, line: 1800, baseType: !70, size: 192, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "Index", scope: !67, file: !5, line: 1801, baseType: !13, size: 32, offset: 384)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "Optimisiation_Flags", scope: !67, file: !5, line: 1802, baseType: !64, size: 32, offset: 416)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "Interiors", scope: !67, file: !5, line: 1803, baseType: !76, size: 6400, offset: 448)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 6400, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: 100)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISTACK", scope: !2, file: !5, line: 681, baseType: !81)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "istack_struct", scope: !2, file: !5, line: 1635, size: 192, flags: DIFlagTypePassByValue, elements: !82, identifier: "_ZTSN3pov13istack_structE")
!82 = !{!83, !85, !113, !114}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !81, file: !5, line: 1637, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "istack", scope: !81, file: !5, line: 1638, baseType: !86, size: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "istk_entry", scope: !2, file: !5, line: 1610, size: 1600, flags: DIFlagTypePassByValue, elements: !88, identifier: "_ZTSN3pov10istk_entryE")
!88 = !{!89, !90, !91, !92, !93, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !112}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "Depth", scope: !87, file: !5, line: 1612, baseType: !57, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "IPoint", scope: !87, file: !5, line: 1613, baseType: !70, size: 192, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "INormal", scope: !87, file: !5, line: 1614, baseType: !70, size: 192, offset: 256)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "PNormal", scope: !87, file: !5, line: 1615, baseType: !70, size: 192, offset: 448)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "Iuv", scope: !87, file: !5, line: 1616, baseType: !94, size: 128, offset: 640)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !2, file: !5, line: 690, baseType: !95)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 128, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 2)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !87, file: !5, line: 1617, baseType: !14, size: 64, offset: 768)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "i1", scope: !87, file: !5, line: 1624, baseType: !13, size: 32, offset: 832)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "i2", scope: !87, file: !5, line: 1624, baseType: !13, size: 32, offset: 864)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !87, file: !5, line: 1625, baseType: !57, size: 64, offset: 896)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !87, file: !5, line: 1625, baseType: !57, size: 64, offset: 960)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !87, file: !5, line: 1626, baseType: !57, size: 64, offset: 1024)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !87, file: !5, line: 1626, baseType: !57, size: 64, offset: 1088)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !87, file: !5, line: 1627, baseType: !57, size: 64, offset: 1152)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "d4", scope: !87, file: !5, line: 1627, baseType: !57, size: 64, offset: 1216)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !87, file: !5, line: 1628, baseType: !57, size: 64, offset: 1280)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !87, file: !5, line: 1628, baseType: !57, size: 64, offset: 1344)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !87, file: !5, line: 1628, baseType: !57, size: 64, offset: 1408)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "Pointer", scope: !87, file: !5, line: 1630, baseType: !111, size: 64, offset: 1472)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "Csg", scope: !87, file: !5, line: 1632, baseType: !111, size: 64, offset: 1536)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !81, file: !5, line: 1639, baseType: !64, size: 32, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "top_entry", scope: !81, file: !5, line: 1640, baseType: !64, size: 32, offset: 160)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "Inside_Method", scope: !6, file: !5, line: 1520, baseType: !116, size: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "INSIDE_METHOD", scope: !2, file: !5, line: 1435, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!13, !120, !14}
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Method", scope: !6, file: !5, line: 1521, baseType: !122, size: 64, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "NORMAL_METHOD", scope: !2, file: !5, line: 1436, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{null, !120, !14, !126}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERSECTION", scope: !2, file: !5, line: 682, baseType: !87)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "UVCoord_Method", scope: !6, file: !5, line: 1522, baseType: !129, size: 64, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "UVCOORD_METHOD", scope: !2, file: !5, line: 1437, baseType: !123)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "Copy_Method", scope: !6, file: !5, line: 1523, baseType: !131, size: 64, offset: 256)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "COPY_METHOD", scope: !2, file: !5, line: 1438, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!111, !14}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "Translate_Method", scope: !6, file: !5, line: 1524, baseType: !136, size: 64, offset: 320)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSLATE_METHOD", scope: !2, file: !5, line: 1439, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{null, !14, !120, !50}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "Rotate_Method", scope: !6, file: !5, line: 1525, baseType: !141, size: 64, offset: 384)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "ROTATE_METHOD", scope: !2, file: !5, line: 1440, baseType: !137)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "Scale_Method", scope: !6, file: !5, line: 1526, baseType: !143, size: 64, offset: 448)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCALE_METHOD", scope: !2, file: !5, line: 1441, baseType: !137)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "Transform_Method", scope: !6, file: !5, line: 1527, baseType: !145, size: 64, offset: 512)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM_METHOD", scope: !2, file: !5, line: 1442, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{null, !14, !50}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "Invert_Method", scope: !6, file: !5, line: 1528, baseType: !150, size: 64, offset: 576)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "INVERT_METHOD", scope: !2, file: !5, line: 1443, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{null, !14}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy_Method", scope: !6, file: !5, line: 1529, baseType: !155, size: 64, offset: 640)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "DESTROY_METHOD", scope: !2, file: !5, line: 1444, baseType: !151)
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(name: "Vertex_Hash_Table", linkageName: "_ZN3povL17Vertex_Hash_TableE", scope: !2, file: !3, line: 156, type: !158, isLocal: true, isDefinition: true)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "HASH_TABLE", scope: !2, file: !3, line: 87, baseType: !161)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Hash_Table_Struct", scope: !2, file: !3, line: 90, size: 192, flags: DIFlagTypePassByValue, elements: !162, identifier: "_ZTSN3pov17Hash_Table_StructE")
!162 = !{!163, !164, !167}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "Index", scope: !161, file: !3, line: 92, baseType: !13, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "P", scope: !161, file: !3, line: 93, baseType: !165, size: 96, offset: 32)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "SNGL_VECT", scope: !2, file: !5, line: 697, baseType: !166)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 96, elements: !46)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !161, file: !3, line: 94, baseType: !159, size: 64, offset: 128)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "Normal_Hash_Table", linkageName: "_ZN3povL17Normal_Hash_TableE", scope: !2, file: !3, line: 156, type: !158, isLocal: true, isDefinition: true)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "UV_Hash_Table", linkageName: "_ZN3povL13UV_Hash_TableE", scope: !2, file: !3, line: 157, type: !172, isLocal: true, isDefinition: true)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_HASH_TABLE", scope: !2, file: !3, line: 88, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UV_Hash_Table_Struct", scope: !2, file: !3, line: 97, size: 256, flags: DIFlagTypePassByValue, elements: !176, identifier: "_ZTSN3pov20UV_Hash_Table_StructE")
!176 = !{!177, !178, !179}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "Index", scope: !175, file: !3, line: 99, baseType: !13, size: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "P", scope: !175, file: !3, line: 100, baseType: !94, size: 128, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !175, file: !3, line: 101, baseType: !173, size: 64, offset: 192)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(name: "Mesh_Queue", linkageName: "_ZN3povL10Mesh_QueueE", scope: !2, file: !3, line: 159, type: !182, isLocal: true, isDefinition: true)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "PRIORITY_QUEUE", scope: !2, file: !184, line: 55, baseType: !185)
!184 = !DIFile(filename: "./bbox.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Priority_Queue_Struct", scope: !2, file: !184, line: 71, size: 128, flags: DIFlagTypePassByValue, elements: !186, identifier: "_ZTSN3pov21Priority_Queue_StructE")
!186 = !{!187, !188, !189}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "QSize", scope: !185, file: !184, line: 73, baseType: !64, size: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "Max_QSize", scope: !185, file: !184, line: 74, baseType: !64, size: 32, offset: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "Queue", scope: !185, file: !184, line: 75, baseType: !190, size: 64, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "QELEM", scope: !2, file: !184, line: 54, baseType: !192)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "Qelem_Struct", scope: !2, file: !184, line: 65, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov12Qelem_StructE")
!193 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !194, retainedTypes: !332, globals: !408, imports: !417, splitDebugInlining: false, nameTableKind: None)
!194 = !{!195, !201, !205}
!195 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !2, file: !5, line: 706, baseType: !64, size: 32, elements: !196)
!196 = !{!197, !198, !199, !200}
!197 = !DIEnumerator(name: "X", value: 0, isUnsigned: true)
!198 = !DIEnumerator(name: "Y", value: 1, isUnsigned: true)
!199 = !DIEnumerator(name: "Z", value: 2, isUnsigned: true)
!200 = !DIEnumerator(name: "T", value: 3, isUnsigned: true)
!201 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !2, file: !5, line: 700, baseType: !64, size: 32, elements: !202)
!202 = !{!203, !204}
!203 = !DIEnumerator(name: "U", value: 0, isUnsigned: true)
!204 = !DIEnumerator(name: "V", value: 1, isUnsigned: true)
!205 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "STATS", scope: !2, file: !206, line: 149, baseType: !64, size: 32, elements: !207, identifier: "_ZTSN3pov5STATSE")
!206 = !DIFile(filename: "./povray.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!207 = !{!208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331}
!208 = !DIEnumerator(name: "Number_Of_Pixels", value: 0, isUnsigned: true)
!209 = !DIEnumerator(name: "Number_Of_Pixels_Supersampled", value: 1, isUnsigned: true)
!210 = !DIEnumerator(name: "Number_Of_Samples", value: 2, isUnsigned: true)
!211 = !DIEnumerator(name: "Number_Of_Rays", value: 3, isUnsigned: true)
!212 = !DIEnumerator(name: "Calls_To_DNoise", value: 4, isUnsigned: true)
!213 = !DIEnumerator(name: "Calls_To_Noise", value: 5, isUnsigned: true)
!214 = !DIEnumerator(name: "ADC_Saves", value: 6, isUnsigned: true)
!215 = !DIEnumerator(name: "Istack_overflows", value: 7, isUnsigned: true)
!216 = !DIEnumerator(name: "Ray_RBezier_Tests", value: 8, isUnsigned: true)
!217 = !DIEnumerator(name: "Ray_RBezier_Tests_Succeeded", value: 9, isUnsigned: true)
!218 = !DIEnumerator(name: "Ray_Bicubic_Tests", value: 10, isUnsigned: true)
!219 = !DIEnumerator(name: "Ray_Bicubic_Tests_Succeeded", value: 11, isUnsigned: true)
!220 = !DIEnumerator(name: "Ray_Blob_Tests", value: 12, isUnsigned: true)
!221 = !DIEnumerator(name: "Ray_Blob_Tests_Succeeded", value: 13, isUnsigned: true)
!222 = !DIEnumerator(name: "Blob_Element_Tests", value: 14, isUnsigned: true)
!223 = !DIEnumerator(name: "Blob_Element_Tests_Succeeded", value: 15, isUnsigned: true)
!224 = !DIEnumerator(name: "Blob_Bound_Tests", value: 16, isUnsigned: true)
!225 = !DIEnumerator(name: "Blob_Bound_Tests_Succeeded", value: 17, isUnsigned: true)
!226 = !DIEnumerator(name: "Ray_Box_Tests", value: 18, isUnsigned: true)
!227 = !DIEnumerator(name: "Ray_Box_Tests_Succeeded", value: 19, isUnsigned: true)
!228 = !DIEnumerator(name: "Ray_Cone_Tests", value: 20, isUnsigned: true)
!229 = !DIEnumerator(name: "Ray_Cone_Tests_Succeeded", value: 21, isUnsigned: true)
!230 = !DIEnumerator(name: "Ray_CSG_Intersection_Tests", value: 22, isUnsigned: true)
!231 = !DIEnumerator(name: "Ray_CSG_Intersection_Tests_Succeeded", value: 23, isUnsigned: true)
!232 = !DIEnumerator(name: "Ray_CSG_Merge_Tests", value: 24, isUnsigned: true)
!233 = !DIEnumerator(name: "Ray_CSG_Merge_Tests_Succeeded", value: 25, isUnsigned: true)
!234 = !DIEnumerator(name: "Ray_CSG_Union_Tests", value: 26, isUnsigned: true)
!235 = !DIEnumerator(name: "Ray_CSG_Union_Tests_Succeeded", value: 27, isUnsigned: true)
!236 = !DIEnumerator(name: "Ray_Disc_Tests", value: 28, isUnsigned: true)
!237 = !DIEnumerator(name: "Ray_Disc_Tests_Succeeded", value: 29, isUnsigned: true)
!238 = !DIEnumerator(name: "Ray_Fractal_Tests", value: 30, isUnsigned: true)
!239 = !DIEnumerator(name: "Ray_Fractal_Tests_Succeeded", value: 31, isUnsigned: true)
!240 = !DIEnumerator(name: "Ray_HField_Tests", value: 32, isUnsigned: true)
!241 = !DIEnumerator(name: "Ray_HField_Tests_Succeeded", value: 33, isUnsigned: true)
!242 = !DIEnumerator(name: "Ray_HField_Box_Tests", value: 34, isUnsigned: true)
!243 = !DIEnumerator(name: "Ray_HField_Box_Tests_Succeeded", value: 35, isUnsigned: true)
!244 = !DIEnumerator(name: "Ray_HField_Triangle_Tests", value: 36, isUnsigned: true)
!245 = !DIEnumerator(name: "Ray_HField_Triangle_Tests_Succeeded", value: 37, isUnsigned: true)
!246 = !DIEnumerator(name: "Ray_HField_Block_Tests", value: 38, isUnsigned: true)
!247 = !DIEnumerator(name: "Ray_HField_Block_Tests_Succeeded", value: 39, isUnsigned: true)
!248 = !DIEnumerator(name: "Ray_HField_Cell_Tests", value: 40, isUnsigned: true)
!249 = !DIEnumerator(name: "Ray_HField_Cell_Tests_Succeeded", value: 41, isUnsigned: true)
!250 = !DIEnumerator(name: "Ray_IsoSurface_Tests", value: 42, isUnsigned: true)
!251 = !DIEnumerator(name: "Ray_IsoSurface_Tests_Succeeded", value: 43, isUnsigned: true)
!252 = !DIEnumerator(name: "Ray_IsoSurface_Bound_Tests", value: 44, isUnsigned: true)
!253 = !DIEnumerator(name: "Ray_IsoSurface_Bound_Tests_Succeeded", value: 45, isUnsigned: true)
!254 = !DIEnumerator(name: "Ray_IsoSurface_Cache", value: 46, isUnsigned: true)
!255 = !DIEnumerator(name: "Ray_IsoSurface_Cache_Succeeded", value: 47, isUnsigned: true)
!256 = !DIEnumerator(name: "Ray_Lathe_Tests", value: 48, isUnsigned: true)
!257 = !DIEnumerator(name: "Ray_Lathe_Tests_Succeeded", value: 49, isUnsigned: true)
!258 = !DIEnumerator(name: "Lathe_Bound_Tests", value: 50, isUnsigned: true)
!259 = !DIEnumerator(name: "Lathe_Bound_Tests_Succeeded", value: 51, isUnsigned: true)
!260 = !DIEnumerator(name: "Ray_Mesh_Tests", value: 52, isUnsigned: true)
!261 = !DIEnumerator(name: "Ray_Mesh_Tests_Succeeded", value: 53, isUnsigned: true)
!262 = !DIEnumerator(name: "Ray_Plane_Tests", value: 54, isUnsigned: true)
!263 = !DIEnumerator(name: "Ray_Plane_Tests_Succeeded", value: 55, isUnsigned: true)
!264 = !DIEnumerator(name: "Ray_Polygon_Tests", value: 56, isUnsigned: true)
!265 = !DIEnumerator(name: "Ray_Polygon_Tests_Succeeded", value: 57, isUnsigned: true)
!266 = !DIEnumerator(name: "Ray_Prism_Tests", value: 58, isUnsigned: true)
!267 = !DIEnumerator(name: "Ray_Prism_Tests_Succeeded", value: 59, isUnsigned: true)
!268 = !DIEnumerator(name: "Prism_Bound_Tests", value: 60, isUnsigned: true)
!269 = !DIEnumerator(name: "Prism_Bound_Tests_Succeeded", value: 61, isUnsigned: true)
!270 = !DIEnumerator(name: "Ray_Parametric_Tests", value: 62, isUnsigned: true)
!271 = !DIEnumerator(name: "Ray_Parametric_Tests_Succeeded", value: 63, isUnsigned: true)
!272 = !DIEnumerator(name: "Ray_Par_Bound_Tests", value: 64, isUnsigned: true)
!273 = !DIEnumerator(name: "Ray_Par_Bound_Tests_Succeeded", value: 65, isUnsigned: true)
!274 = !DIEnumerator(name: "Ray_Quadric_Tests", value: 66, isUnsigned: true)
!275 = !DIEnumerator(name: "Ray_Quadric_Tests_Succeeded", value: 67, isUnsigned: true)
!276 = !DIEnumerator(name: "Ray_Poly_Tests", value: 68, isUnsigned: true)
!277 = !DIEnumerator(name: "Ray_Poly_Tests_Succeeded", value: 69, isUnsigned: true)
!278 = !DIEnumerator(name: "Ray_Sphere_Tests", value: 70, isUnsigned: true)
!279 = !DIEnumerator(name: "Ray_Sphere_Tests_Succeeded", value: 71, isUnsigned: true)
!280 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests", value: 72, isUnsigned: true)
!281 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests_Succeeded", value: 73, isUnsigned: true)
!282 = !DIEnumerator(name: "Ray_Superellipsoid_Tests", value: 74, isUnsigned: true)
!283 = !DIEnumerator(name: "Ray_Superellipsoid_Tests_Succeeded", value: 75, isUnsigned: true)
!284 = !DIEnumerator(name: "Ray_Sor_Tests", value: 76, isUnsigned: true)
!285 = !DIEnumerator(name: "Ray_Sor_Tests_Succeeded", value: 77, isUnsigned: true)
!286 = !DIEnumerator(name: "Sor_Bound_Tests", value: 78, isUnsigned: true)
!287 = !DIEnumerator(name: "Sor_Bound_Tests_Succeeded", value: 79, isUnsigned: true)
!288 = !DIEnumerator(name: "Ray_Torus_Tests", value: 80, isUnsigned: true)
!289 = !DIEnumerator(name: "Ray_Torus_Tests_Succeeded", value: 81, isUnsigned: true)
!290 = !DIEnumerator(name: "Torus_Bound_Tests", value: 82, isUnsigned: true)
!291 = !DIEnumerator(name: "Torus_Bound_Tests_Succeeded", value: 83, isUnsigned: true)
!292 = !DIEnumerator(name: "Ray_Triangle_Tests", value: 84, isUnsigned: true)
!293 = !DIEnumerator(name: "Ray_Triangle_Tests_Succeeded", value: 85, isUnsigned: true)
!294 = !DIEnumerator(name: "Ray_TTF_Tests", value: 86, isUnsigned: true)
!295 = !DIEnumerator(name: "Ray_TTF_Tests_Succeeded", value: 87, isUnsigned: true)
!296 = !DIEnumerator(name: "Bounding_Region_Tests", value: 88, isUnsigned: true)
!297 = !DIEnumerator(name: "Bounding_Region_Tests_Succeeded", value: 89, isUnsigned: true)
!298 = !DIEnumerator(name: "Clipping_Region_Tests", value: 90, isUnsigned: true)
!299 = !DIEnumerator(name: "Clipping_Region_Tests_Succeeded", value: 91, isUnsigned: true)
!300 = !DIEnumerator(name: "Ray_IsoSurface_Find_Root", value: 92, isUnsigned: true)
!301 = !DIEnumerator(name: "Ray_Function_VM_Calls", value: 93, isUnsigned: true)
!302 = !DIEnumerator(name: "Ray_Function_VM_Instruction_Est", value: 94, isUnsigned: true)
!303 = !DIEnumerator(name: "VBuffer_Tests", value: 95, isUnsigned: true)
!304 = !DIEnumerator(name: "VBuffer_Tests_Succeeded", value: 96, isUnsigned: true)
!305 = !DIEnumerator(name: "LBuffer_Tests", value: 97, isUnsigned: true)
!306 = !DIEnumerator(name: "LBuffer_Tests_Succeeded", value: 98, isUnsigned: true)
!307 = !DIEnumerator(name: "Media_Samples", value: 99, isUnsigned: true)
!308 = !DIEnumerator(name: "Media_Intervals", value: 100, isUnsigned: true)
!309 = !DIEnumerator(name: "Reflected_Rays_Traced", value: 101, isUnsigned: true)
!310 = !DIEnumerator(name: "Refracted_Rays_Traced", value: 102, isUnsigned: true)
!311 = !DIEnumerator(name: "Transmitted_Rays_Traced", value: 103, isUnsigned: true)
!312 = !DIEnumerator(name: "Internal_Reflected_Rays_Traced", value: 104, isUnsigned: true)
!313 = !DIEnumerator(name: "Shadow_Cache_Hits", value: 105, isUnsigned: true)
!314 = !DIEnumerator(name: "Shadow_Rays_Succeeded", value: 106, isUnsigned: true)
!315 = !DIEnumerator(name: "Shadow_Ray_Tests", value: 107, isUnsigned: true)
!316 = !DIEnumerator(name: "nChecked", value: 108, isUnsigned: true)
!317 = !DIEnumerator(name: "nEnqueued", value: 109, isUnsigned: true)
!318 = !DIEnumerator(name: "totalQueues", value: 110, isUnsigned: true)
!319 = !DIEnumerator(name: "totalQueueResets", value: 111, isUnsigned: true)
!320 = !DIEnumerator(name: "totalQueueResizes", value: 112, isUnsigned: true)
!321 = !DIEnumerator(name: "Polynomials_Tested", value: 113, isUnsigned: true)
!322 = !DIEnumerator(name: "Roots_Eliminated", value: 114, isUnsigned: true)
!323 = !DIEnumerator(name: "Number_Of_Photons_Shot", value: 115, isUnsigned: true)
!324 = !DIEnumerator(name: "Number_Of_Photons_Stored", value: 116, isUnsigned: true)
!325 = !DIEnumerator(name: "Number_Of_Global_Photons_Stored", value: 117, isUnsigned: true)
!326 = !DIEnumerator(name: "Number_Of_Media_Photons_Stored", value: 118, isUnsigned: true)
!327 = !DIEnumerator(name: "Priority_Queue_Add", value: 119, isUnsigned: true)
!328 = !DIEnumerator(name: "Priority_Queue_Remove", value: 120, isUnsigned: true)
!329 = !DIEnumerator(name: "Gather_Performed_Count", value: 121, isUnsigned: true)
!330 = !DIEnumerator(name: "Gather_Expanded_Count", value: 122, isUnsigned: true)
!331 = !DIEnumerator(name: "MaxStat", value: 123, isUnsigned: true)
!332 = !{!333, !13, !402, !393, !111, !406, !64, !367, !173, !158, !172, !14, !369, !44, !364, !159}
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "MESH", scope: !2, file: !335, line: 51, baseType: !336)
!335 = !DIFile(filename: "./mesh.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mesh_Struct", scope: !2, file: !335, line: 55, size: 1216, flags: DIFlagTypePassByValue, elements: !337, identifier: "_ZTSN3pov11Mesh_StructE")
!337 = !{!338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !404, !405, !407}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !336, file: !335, line: 57, baseType: !19, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !336, file: !335, line: 57, baseType: !13, size: 32, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !336, file: !335, line: 57, baseType: !14, size: 64, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !336, file: !335, line: 57, baseType: !23, size: 64, offset: 192)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !336, file: !335, line: 57, baseType: !23, size: 64, offset: 256)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !336, file: !335, line: 57, baseType: !28, size: 64, offset: 320)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !336, file: !335, line: 57, baseType: !14, size: 64, offset: 384)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !336, file: !335, line: 57, baseType: !14, size: 64, offset: 448)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !336, file: !335, line: 57, baseType: !34, size: 64, offset: 512)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !336, file: !335, line: 57, baseType: !38, size: 192, offset: 576)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !336, file: !335, line: 57, baseType: !50, size: 64, offset: 768)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !336, file: !335, line: 57, baseType: !50, size: 64, offset: 832)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !336, file: !335, line: 57, baseType: !45, size: 32, offset: 896)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !336, file: !335, line: 57, baseType: !64, size: 32, offset: 928)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !336, file: !335, line: 58, baseType: !353, size: 64, offset: 960)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "MESH_DATA", scope: !2, file: !335, line: 52, baseType: !355)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mesh_Data_Struct", scope: !2, file: !335, line: 64, size: 832, flags: DIFlagTypePassByValue, elements: !356, identifier: "_ZTSN3pov16Mesh_Data_StructE")
!356 = !{!357, !358, !360, !361, !362, !363, !365, !366, !368, !392, !403}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !355, file: !335, line: 66, baseType: !13, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "Number_Of_UVCoords", scope: !355, file: !335, line: 67, baseType: !359, size: 64, offset: 64)
!359 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "Number_Of_Normals", scope: !355, file: !335, line: 68, baseType: !359, size: 64, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "Number_Of_Triangles", scope: !355, file: !335, line: 69, baseType: !359, size: 64, offset: 192)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "Number_Of_Vertices", scope: !355, file: !335, line: 70, baseType: !359, size: 64, offset: 256)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "Normals", scope: !355, file: !335, line: 71, baseType: !364, size: 64, offset: 320)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "Vertices", scope: !355, file: !335, line: 71, baseType: !364, size: 64, offset: 384)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "UVCoords", scope: !355, file: !335, line: 72, baseType: !367, size: 64, offset: 448)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "Triangles", scope: !355, file: !335, line: 73, baseType: !369, size: 64, offset: 512)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "MESH_TRIANGLE", scope: !2, file: !335, line: 53, baseType: !371)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mesh_Triangle_Struct", scope: !2, file: !335, line: 78, size: 1024, flags: DIFlagTypePassByValue, elements: !372, identifier: "_ZTSN3pov20Mesh_Triangle_StructE")
!372 = !{!373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "Smooth", scope: !371, file: !335, line: 80, baseType: !64, size: 1, flags: DIFlagBitField, extraData: i64 0)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "Dominant_Axis", scope: !371, file: !335, line: 81, baseType: !64, size: 2, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "vAxis", scope: !371, file: !335, line: 82, baseType: !64, size: 2, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ThreeTex", scope: !371, file: !335, line: 83, baseType: !64, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Ind", scope: !371, file: !335, line: 84, baseType: !359, size: 64, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "P1", scope: !371, file: !335, line: 85, baseType: !359, size: 64, offset: 128)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "P2", scope: !371, file: !335, line: 85, baseType: !359, size: 64, offset: 192)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "P3", scope: !371, file: !335, line: 85, baseType: !359, size: 64, offset: 256)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !371, file: !335, line: 86, baseType: !359, size: 64, offset: 320)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "Texture2", scope: !371, file: !335, line: 87, baseType: !359, size: 64, offset: 384)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "Texture3", scope: !371, file: !335, line: 87, baseType: !359, size: 64, offset: 448)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "N1", scope: !371, file: !335, line: 88, baseType: !359, size: 64, offset: 512)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "N2", scope: !371, file: !335, line: 88, baseType: !359, size: 64, offset: 576)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "N3", scope: !371, file: !335, line: 88, baseType: !359, size: 64, offset: 640)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "UV1", scope: !371, file: !335, line: 89, baseType: !359, size: 64, offset: 704)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "UV2", scope: !371, file: !335, line: 89, baseType: !359, size: 64, offset: 768)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "UV3", scope: !371, file: !335, line: 89, baseType: !359, size: 64, offset: 832)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "Distance", scope: !371, file: !335, line: 90, baseType: !45, size: 32, offset: 896)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "Perp", scope: !371, file: !335, line: 91, baseType: !165, size: 96, offset: 928)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "Tree", scope: !355, file: !335, line: 74, baseType: !393, size: 64, offset: 576)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_TREE", scope: !2, file: !5, line: 1546, baseType: !395)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BBox_Tree_Struct", scope: !2, file: !5, line: 1548, size: 320, flags: DIFlagTypePassByValue, elements: !396, identifier: "_ZTSN3pov16BBox_Tree_StructE")
!396 = !{!397, !399, !400, !401}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "Infinite", scope: !395, file: !5, line: 1550, baseType: !398, size: 16)
!398 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "Entries", scope: !395, file: !5, line: 1551, baseType: !398, size: 16, offset: 16)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !395, file: !5, line: 1552, baseType: !38, size: 192, offset: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "Node", scope: !395, file: !5, line: 1553, baseType: !402, size: 64, offset: 256)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "Inside_Vect", scope: !355, file: !335, line: 75, baseType: !70, size: 192, offset: 640)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "Number_Of_Textures", scope: !336, file: !335, line: 59, baseType: !359, size: 64, offset: 1024)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "Textures", scope: !336, file: !335, line: 60, baseType: !406, size: 64, offset: 1088)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "has_inside_vector", scope: !336, file: !335, line: 61, baseType: !398, size: 16, offset: 1152)
!408 = !{!0, !409, !412, !414, !156, !168, !170, !180}
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression(DW_OP_constu, 1000, DW_OP_stack_value))
!410 = distinct !DIGlobalVariable(name: "HASH_SIZE", scope: !2, file: !3, line: 78, type: !411, isLocal: true, isDefinition: true)
!411 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression(DW_OP_constu, 256, DW_OP_stack_value))
!413 = distinct !DIGlobalVariable(name: "INITIAL_NUMBER_OF_ENTRIES", scope: !2, file: !3, line: 80, type: !411, isLocal: true, isDefinition: true)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression(DW_OP_constu, 4517329193108106637, DW_OP_stack_value))
!415 = distinct !DIGlobalVariable(name: "DEPTH_TOLERANCE", scope: !2, file: !3, line: 74, type: !416, isLocal: true, isDefinition: true)
!416 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!417 = !{!418, !425, !431, !433, !435, !439, !441, !443, !445, !447, !449, !451, !453, !458, !462, !464, !466, !470, !472, !474, !476, !478, !480, !482, !485, !487, !489, !493, !498, !500, !502, !504, !506, !508, !510, !512, !514, !516, !518, !522, !526, !528, !530, !532, !534, !536, !538, !540, !542, !544, !546, !548, !550, !552, !554, !556, !560, !564, !568, !570, !572, !574, !576, !578, !580, !582, !584, !586, !590, !594, !598, !600, !602, !604, !609, !613, !617, !619, !621, !623, !625, !627, !629, !631, !633, !635, !637, !639, !641, !645, !649, !653, !655, !657, !659, !666, !670, !674, !676, !678, !680, !682, !684, !686, !690, !694, !696, !698, !700, !702, !706, !710, !714, !716, !718, !720, !722, !724, !726, !730, !734, !738, !740, !744, !748, !750, !752, !754, !756, !758, !760, !766, !771, !775, !781, !785, !790, !792, !794, !798, !802, !815, !819, !823, !827, !831, !836, !840, !844, !848, !852, !860, !864, !868, !870, !874, !878, !882, !888, !892, !896, !898, !906, !910, !917, !919, !923, !927, !931, !935, !940, !944, !948, !949, !950, !951, !953, !954, !955, !956, !957, !958, !959, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !996, !998, !1000, !1002, !1004, !1006, !1008, !1010, !1012, !1014, !1016, !1018, !1020, !1022, !1028, !1032, !1038, !1042, !1046, !1050, !1054, !1056, !1058, !1062, !1066, !1070, !1074, !1078, !1080, !1082, !1084, !1088, !1092, !1096, !1098, !1100, !1103, !1105, !1106, !1108, !1109, !1111, !1113, !1114, !1116, !1118, !1120, !1122, !1124, !1126, !1128, !1130, !1132, !1134, !1136, !1138, !1139, !1140, !1141, !1143, !1147, !1203, !1207}
!418 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !420, file: !424, line: 52)
!419 = !DINamespace(name: "std", scope: null)
!420 = !DISubprogram(name: "abs", scope: !421, file: !421, line: 840, type: !422, flags: DIFlagPrototyped, spFlags: 0)
!421 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!422 = !DISubroutineType(types: !423)
!423 = !{!13, !13}
!424 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/std_abs.h", directory: "")
!425 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !426, file: !430, line: 83)
!426 = !DISubprogram(name: "acos", scope: !427, file: !427, line: 53, type: !428, flags: DIFlagPrototyped, spFlags: 0)
!427 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/mathcalls.h", directory: "")
!428 = !DISubroutineType(types: !429)
!429 = !{!57, !57}
!430 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cmath", directory: "")
!431 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !432, file: !430, line: 102)
!432 = !DISubprogram(name: "asin", scope: !427, file: !427, line: 55, type: !428, flags: DIFlagPrototyped, spFlags: 0)
!433 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !434, file: !430, line: 121)
!434 = !DISubprogram(name: "atan", scope: !427, file: !427, line: 57, type: !428, flags: DIFlagPrototyped, spFlags: 0)
!435 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !436, file: !430, line: 140)
!436 = !DISubprogram(name: "atan2", scope: !427, file: !427, line: 59, type: !437, flags: DIFlagPrototyped, spFlags: 0)
!437 = !DISubroutineType(types: !438)
!438 = !{!57, !57, !57}
!439 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !440, file: !430, line: 161)
!440 = !DISubprogram(name: "ceil", scope: !427, file: !427, line: 159, type: !428, flags: DIFlagPrototyped, spFlags: 0)
!441 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !442, file: !430, line: 180)
!442 = !DISubprogram(name: "cos", scope: !427, file: !427, line: 62, type: !428, flags: DIFlagPrototyped, spFlags: 0)
!443 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !444, file: !430, line: 199)
!444 = !DISubprogram(name: "cosh", scope: !427, file: !427, line: 71, type: !428, flags: DIFlagPrototyped, spFlags: 0)
!445 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !446, file: !430, line: 218)
!446 = !DISubprogram(name: "exp", scope: !427, file: !427, line: 95, type: !428, flags: DIFlagPrototyped, spFlags: 0)
!447 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !448, file: !430, line: 237)
!448 = !DISubprogram(name: "fabs", scope: !427, file: !427, line: 162, type: !428, flags: DIFlagPrototyped, spFlags: 0)
!449 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !450, file: !430, line: 256)
!450 = !DISubprogram(name: "floor", scope: !427, file: !427, line: 165, type: !428, flags: DIFlagPrototyped, spFlags: 0)
!451 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !452, file: !430, line: 275)
!452 = !DISubprogram(name: "fmod", scope: !427, file: !427, line: 168, type: !437, flags: DIFlagPrototyped, spFlags: 0)
!453 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !454, file: !430, line: 296)
!454 = !DISubprogram(name: "frexp", scope: !427, file: !427, line: 98, type: !455, flags: DIFlagPrototyped, spFlags: 0)
!455 = !DISubroutineType(types: !456)
!456 = !{!57, !57, !457}
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!458 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !459, file: !430, line: 315)
!459 = !DISubprogram(name: "ldexp", scope: !427, file: !427, line: 101, type: !460, flags: DIFlagPrototyped, spFlags: 0)
!460 = !DISubroutineType(types: !461)
!461 = !{!57, !57, !13}
!462 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !463, file: !430, line: 334)
!463 = !DISubprogram(name: "log", scope: !427, file: !427, line: 104, type: !428, flags: DIFlagPrototyped, spFlags: 0)
!464 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !465, file: !430, line: 353)
!465 = !DISubprogram(name: "log10", scope: !427, file: !427, line: 107, type: !428, flags: DIFlagPrototyped, spFlags: 0)
!466 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !467, file: !430, line: 372)
!467 = !DISubprogram(name: "modf", scope: !427, file: !427, line: 110, type: !468, flags: DIFlagPrototyped, spFlags: 0)
!468 = !DISubroutineType(types: !469)
!469 = !{!57, !57, !120}
!470 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !471, file: !430, line: 384)
!471 = !DISubprogram(name: "pow", scope: !427, file: !427, line: 140, type: !437, flags: DIFlagPrototyped, spFlags: 0)
!472 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !473, file: !430, line: 421)
!473 = !DISubprogram(name: "sin", scope: !427, file: !427, line: 64, type: !428, flags: DIFlagPrototyped, spFlags: 0)
!474 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !475, file: !430, line: 440)
!475 = !DISubprogram(name: "sinh", scope: !427, file: !427, line: 73, type: !428, flags: DIFlagPrototyped, spFlags: 0)
!476 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !477, file: !430, line: 459)
!477 = !DISubprogram(name: "sqrt", scope: !427, file: !427, line: 143, type: !428, flags: DIFlagPrototyped, spFlags: 0)
!478 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !479, file: !430, line: 478)
!479 = !DISubprogram(name: "tan", scope: !427, file: !427, line: 66, type: !428, flags: DIFlagPrototyped, spFlags: 0)
!480 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !481, file: !430, line: 497)
!481 = !DISubprogram(name: "tanh", scope: !427, file: !427, line: 75, type: !428, flags: DIFlagPrototyped, spFlags: 0)
!482 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !483, file: !430, line: 1065)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_t", file: !484, line: 150, baseType: !57)
!484 = !DIFile(filename: "/usr/include/math.h", directory: "")
!485 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !486, file: !430, line: 1066)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "float_t", file: !484, line: 149, baseType: !45)
!487 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !488, file: !430, line: 1069)
!488 = !DISubprogram(name: "acosh", scope: !427, file: !427, line: 85, type: !428, flags: DIFlagPrototyped, spFlags: 0)
!489 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !490, file: !430, line: 1070)
!490 = !DISubprogram(name: "acoshf", scope: !427, file: !427, line: 85, type: !491, flags: DIFlagPrototyped, spFlags: 0)
!491 = !DISubroutineType(types: !492)
!492 = !{!45, !45}
!493 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !494, file: !430, line: 1071)
!494 = !DISubprogram(name: "acoshl", scope: !427, file: !427, line: 85, type: !495, flags: DIFlagPrototyped, spFlags: 0)
!495 = !DISubroutineType(types: !496)
!496 = !{!497, !497}
!497 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!498 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !499, file: !430, line: 1073)
!499 = !DISubprogram(name: "asinh", scope: !427, file: !427, line: 87, type: !428, flags: DIFlagPrototyped, spFlags: 0)
!500 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !501, file: !430, line: 1074)
!501 = !DISubprogram(name: "asinhf", scope: !427, file: !427, line: 87, type: !491, flags: DIFlagPrototyped, spFlags: 0)
!502 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !503, file: !430, line: 1075)
!503 = !DISubprogram(name: "asinhl", scope: !427, file: !427, line: 87, type: !495, flags: DIFlagPrototyped, spFlags: 0)
!504 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !505, file: !430, line: 1077)
!505 = !DISubprogram(name: "atanh", scope: !427, file: !427, line: 89, type: !428, flags: DIFlagPrototyped, spFlags: 0)
!506 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !507, file: !430, line: 1078)
!507 = !DISubprogram(name: "atanhf", scope: !427, file: !427, line: 89, type: !491, flags: DIFlagPrototyped, spFlags: 0)
!508 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !509, file: !430, line: 1079)
!509 = !DISubprogram(name: "atanhl", scope: !427, file: !427, line: 89, type: !495, flags: DIFlagPrototyped, spFlags: 0)
!510 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !511, file: !430, line: 1081)
!511 = !DISubprogram(name: "cbrt", scope: !427, file: !427, line: 152, type: !428, flags: DIFlagPrototyped, spFlags: 0)
!512 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !513, file: !430, line: 1082)
!513 = !DISubprogram(name: "cbrtf", scope: !427, file: !427, line: 152, type: !491, flags: DIFlagPrototyped, spFlags: 0)
!514 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !515, file: !430, line: 1083)
!515 = !DISubprogram(name: "cbrtl", scope: !427, file: !427, line: 152, type: !495, flags: DIFlagPrototyped, spFlags: 0)
!516 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !517, file: !430, line: 1085)
!517 = !DISubprogram(name: "copysign", scope: !427, file: !427, line: 196, type: !437, flags: DIFlagPrototyped, spFlags: 0)
!518 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !519, file: !430, line: 1086)
!519 = !DISubprogram(name: "copysignf", scope: !427, file: !427, line: 196, type: !520, flags: DIFlagPrototyped, spFlags: 0)
!520 = !DISubroutineType(types: !521)
!521 = !{!45, !45, !45}
!522 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !523, file: !430, line: 1087)
!523 = !DISubprogram(name: "copysignl", scope: !427, file: !427, line: 196, type: !524, flags: DIFlagPrototyped, spFlags: 0)
!524 = !DISubroutineType(types: !525)
!525 = !{!497, !497, !497}
!526 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !527, file: !430, line: 1089)
!527 = !DISubprogram(name: "erf", scope: !427, file: !427, line: 228, type: !428, flags: DIFlagPrototyped, spFlags: 0)
!528 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !529, file: !430, line: 1090)
!529 = !DISubprogram(name: "erff", scope: !427, file: !427, line: 228, type: !491, flags: DIFlagPrototyped, spFlags: 0)
!530 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !531, file: !430, line: 1091)
!531 = !DISubprogram(name: "erfl", scope: !427, file: !427, line: 228, type: !495, flags: DIFlagPrototyped, spFlags: 0)
!532 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !533, file: !430, line: 1093)
!533 = !DISubprogram(name: "erfc", scope: !427, file: !427, line: 229, type: !428, flags: DIFlagPrototyped, spFlags: 0)
!534 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !535, file: !430, line: 1094)
!535 = !DISubprogram(name: "erfcf", scope: !427, file: !427, line: 229, type: !491, flags: DIFlagPrototyped, spFlags: 0)
!536 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !537, file: !430, line: 1095)
!537 = !DISubprogram(name: "erfcl", scope: !427, file: !427, line: 229, type: !495, flags: DIFlagPrototyped, spFlags: 0)
!538 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !539, file: !430, line: 1097)
!539 = !DISubprogram(name: "exp2", scope: !427, file: !427, line: 130, type: !428, flags: DIFlagPrototyped, spFlags: 0)
!540 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !541, file: !430, line: 1098)
!541 = !DISubprogram(name: "exp2f", scope: !427, file: !427, line: 130, type: !491, flags: DIFlagPrototyped, spFlags: 0)
!542 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !543, file: !430, line: 1099)
!543 = !DISubprogram(name: "exp2l", scope: !427, file: !427, line: 130, type: !495, flags: DIFlagPrototyped, spFlags: 0)
!544 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !545, file: !430, line: 1101)
!545 = !DISubprogram(name: "expm1", scope: !427, file: !427, line: 119, type: !428, flags: DIFlagPrototyped, spFlags: 0)
!546 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !547, file: !430, line: 1102)
!547 = !DISubprogram(name: "expm1f", scope: !427, file: !427, line: 119, type: !491, flags: DIFlagPrototyped, spFlags: 0)
!548 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !549, file: !430, line: 1103)
!549 = !DISubprogram(name: "expm1l", scope: !427, file: !427, line: 119, type: !495, flags: DIFlagPrototyped, spFlags: 0)
!550 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !551, file: !430, line: 1105)
!551 = !DISubprogram(name: "fdim", scope: !427, file: !427, line: 326, type: !437, flags: DIFlagPrototyped, spFlags: 0)
!552 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !553, file: !430, line: 1106)
!553 = !DISubprogram(name: "fdimf", scope: !427, file: !427, line: 326, type: !520, flags: DIFlagPrototyped, spFlags: 0)
!554 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !555, file: !430, line: 1107)
!555 = !DISubprogram(name: "fdiml", scope: !427, file: !427, line: 326, type: !524, flags: DIFlagPrototyped, spFlags: 0)
!556 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !557, file: !430, line: 1109)
!557 = !DISubprogram(name: "fma", scope: !427, file: !427, line: 335, type: !558, flags: DIFlagPrototyped, spFlags: 0)
!558 = !DISubroutineType(types: !559)
!559 = !{!57, !57, !57, !57}
!560 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !561, file: !430, line: 1110)
!561 = !DISubprogram(name: "fmaf", scope: !427, file: !427, line: 335, type: !562, flags: DIFlagPrototyped, spFlags: 0)
!562 = !DISubroutineType(types: !563)
!563 = !{!45, !45, !45, !45}
!564 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !565, file: !430, line: 1111)
!565 = !DISubprogram(name: "fmal", scope: !427, file: !427, line: 335, type: !566, flags: DIFlagPrototyped, spFlags: 0)
!566 = !DISubroutineType(types: !567)
!567 = !{!497, !497, !497, !497}
!568 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !569, file: !430, line: 1113)
!569 = !DISubprogram(name: "fmax", scope: !427, file: !427, line: 329, type: !437, flags: DIFlagPrototyped, spFlags: 0)
!570 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !571, file: !430, line: 1114)
!571 = !DISubprogram(name: "fmaxf", scope: !427, file: !427, line: 329, type: !520, flags: DIFlagPrototyped, spFlags: 0)
!572 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !573, file: !430, line: 1115)
!573 = !DISubprogram(name: "fmaxl", scope: !427, file: !427, line: 329, type: !524, flags: DIFlagPrototyped, spFlags: 0)
!574 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !575, file: !430, line: 1117)
!575 = !DISubprogram(name: "fmin", scope: !427, file: !427, line: 332, type: !437, flags: DIFlagPrototyped, spFlags: 0)
!576 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !577, file: !430, line: 1118)
!577 = !DISubprogram(name: "fminf", scope: !427, file: !427, line: 332, type: !520, flags: DIFlagPrototyped, spFlags: 0)
!578 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !579, file: !430, line: 1119)
!579 = !DISubprogram(name: "fminl", scope: !427, file: !427, line: 332, type: !524, flags: DIFlagPrototyped, spFlags: 0)
!580 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !581, file: !430, line: 1121)
!581 = !DISubprogram(name: "hypot", scope: !427, file: !427, line: 147, type: !437, flags: DIFlagPrototyped, spFlags: 0)
!582 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !583, file: !430, line: 1122)
!583 = !DISubprogram(name: "hypotf", scope: !427, file: !427, line: 147, type: !520, flags: DIFlagPrototyped, spFlags: 0)
!584 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !585, file: !430, line: 1123)
!585 = !DISubprogram(name: "hypotl", scope: !427, file: !427, line: 147, type: !524, flags: DIFlagPrototyped, spFlags: 0)
!586 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !587, file: !430, line: 1125)
!587 = !DISubprogram(name: "ilogb", scope: !427, file: !427, line: 280, type: !588, flags: DIFlagPrototyped, spFlags: 0)
!588 = !DISubroutineType(types: !589)
!589 = !{!13, !57}
!590 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !591, file: !430, line: 1126)
!591 = !DISubprogram(name: "ilogbf", scope: !427, file: !427, line: 280, type: !592, flags: DIFlagPrototyped, spFlags: 0)
!592 = !DISubroutineType(types: !593)
!593 = !{!13, !45}
!594 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !595, file: !430, line: 1127)
!595 = !DISubprogram(name: "ilogbl", scope: !427, file: !427, line: 280, type: !596, flags: DIFlagPrototyped, spFlags: 0)
!596 = !DISubroutineType(types: !597)
!597 = !{!13, !497}
!598 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !599, file: !430, line: 1129)
!599 = !DISubprogram(name: "lgamma", scope: !427, file: !427, line: 230, type: !428, flags: DIFlagPrototyped, spFlags: 0)
!600 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !601, file: !430, line: 1130)
!601 = !DISubprogram(name: "lgammaf", scope: !427, file: !427, line: 230, type: !491, flags: DIFlagPrototyped, spFlags: 0)
!602 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !603, file: !430, line: 1131)
!603 = !DISubprogram(name: "lgammal", scope: !427, file: !427, line: 230, type: !495, flags: DIFlagPrototyped, spFlags: 0)
!604 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !605, file: !430, line: 1134)
!605 = !DISubprogram(name: "llrint", scope: !427, file: !427, line: 316, type: !606, flags: DIFlagPrototyped, spFlags: 0)
!606 = !DISubroutineType(types: !607)
!607 = !{!608, !57}
!608 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!609 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !610, file: !430, line: 1135)
!610 = !DISubprogram(name: "llrintf", scope: !427, file: !427, line: 316, type: !611, flags: DIFlagPrototyped, spFlags: 0)
!611 = !DISubroutineType(types: !612)
!612 = !{!608, !45}
!613 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !614, file: !430, line: 1136)
!614 = !DISubprogram(name: "llrintl", scope: !427, file: !427, line: 316, type: !615, flags: DIFlagPrototyped, spFlags: 0)
!615 = !DISubroutineType(types: !616)
!616 = !{!608, !497}
!617 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !618, file: !430, line: 1138)
!618 = !DISubprogram(name: "llround", scope: !427, file: !427, line: 322, type: !606, flags: DIFlagPrototyped, spFlags: 0)
!619 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !620, file: !430, line: 1139)
!620 = !DISubprogram(name: "llroundf", scope: !427, file: !427, line: 322, type: !611, flags: DIFlagPrototyped, spFlags: 0)
!621 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !622, file: !430, line: 1140)
!622 = !DISubprogram(name: "llroundl", scope: !427, file: !427, line: 322, type: !615, flags: DIFlagPrototyped, spFlags: 0)
!623 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !624, file: !430, line: 1143)
!624 = !DISubprogram(name: "log1p", scope: !427, file: !427, line: 122, type: !428, flags: DIFlagPrototyped, spFlags: 0)
!625 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !626, file: !430, line: 1144)
!626 = !DISubprogram(name: "log1pf", scope: !427, file: !427, line: 122, type: !491, flags: DIFlagPrototyped, spFlags: 0)
!627 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !628, file: !430, line: 1145)
!628 = !DISubprogram(name: "log1pl", scope: !427, file: !427, line: 122, type: !495, flags: DIFlagPrototyped, spFlags: 0)
!629 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !630, file: !430, line: 1147)
!630 = !DISubprogram(name: "log2", scope: !427, file: !427, line: 133, type: !428, flags: DIFlagPrototyped, spFlags: 0)
!631 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !632, file: !430, line: 1148)
!632 = !DISubprogram(name: "log2f", scope: !427, file: !427, line: 133, type: !491, flags: DIFlagPrototyped, spFlags: 0)
!633 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !634, file: !430, line: 1149)
!634 = !DISubprogram(name: "log2l", scope: !427, file: !427, line: 133, type: !495, flags: DIFlagPrototyped, spFlags: 0)
!635 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !636, file: !430, line: 1151)
!636 = !DISubprogram(name: "logb", scope: !427, file: !427, line: 125, type: !428, flags: DIFlagPrototyped, spFlags: 0)
!637 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !638, file: !430, line: 1152)
!638 = !DISubprogram(name: "logbf", scope: !427, file: !427, line: 125, type: !491, flags: DIFlagPrototyped, spFlags: 0)
!639 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !640, file: !430, line: 1153)
!640 = !DISubprogram(name: "logbl", scope: !427, file: !427, line: 125, type: !495, flags: DIFlagPrototyped, spFlags: 0)
!641 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !642, file: !430, line: 1155)
!642 = !DISubprogram(name: "lrint", scope: !427, file: !427, line: 314, type: !643, flags: DIFlagPrototyped, spFlags: 0)
!643 = !DISubroutineType(types: !644)
!644 = !{!359, !57}
!645 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !646, file: !430, line: 1156)
!646 = !DISubprogram(name: "lrintf", scope: !427, file: !427, line: 314, type: !647, flags: DIFlagPrototyped, spFlags: 0)
!647 = !DISubroutineType(types: !648)
!648 = !{!359, !45}
!649 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !650, file: !430, line: 1157)
!650 = !DISubprogram(name: "lrintl", scope: !427, file: !427, line: 314, type: !651, flags: DIFlagPrototyped, spFlags: 0)
!651 = !DISubroutineType(types: !652)
!652 = !{!359, !497}
!653 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !654, file: !430, line: 1159)
!654 = !DISubprogram(name: "lround", scope: !427, file: !427, line: 320, type: !643, flags: DIFlagPrototyped, spFlags: 0)
!655 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !656, file: !430, line: 1160)
!656 = !DISubprogram(name: "lroundf", scope: !427, file: !427, line: 320, type: !647, flags: DIFlagPrototyped, spFlags: 0)
!657 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !658, file: !430, line: 1161)
!658 = !DISubprogram(name: "lroundl", scope: !427, file: !427, line: 320, type: !651, flags: DIFlagPrototyped, spFlags: 0)
!659 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !660, file: !430, line: 1163)
!660 = !DISubprogram(name: "nan", scope: !427, file: !427, line: 201, type: !661, flags: DIFlagPrototyped, spFlags: 0)
!661 = !DISubroutineType(types: !662)
!662 = !{!57, !663}
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !665)
!665 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!666 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !667, file: !430, line: 1164)
!667 = !DISubprogram(name: "nanf", scope: !427, file: !427, line: 201, type: !668, flags: DIFlagPrototyped, spFlags: 0)
!668 = !DISubroutineType(types: !669)
!669 = !{!45, !663}
!670 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !671, file: !430, line: 1165)
!671 = !DISubprogram(name: "nanl", scope: !427, file: !427, line: 201, type: !672, flags: DIFlagPrototyped, spFlags: 0)
!672 = !DISubroutineType(types: !673)
!673 = !{!497, !663}
!674 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !675, file: !430, line: 1167)
!675 = !DISubprogram(name: "nearbyint", scope: !427, file: !427, line: 294, type: !428, flags: DIFlagPrototyped, spFlags: 0)
!676 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !677, file: !430, line: 1168)
!677 = !DISubprogram(name: "nearbyintf", scope: !427, file: !427, line: 294, type: !491, flags: DIFlagPrototyped, spFlags: 0)
!678 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !679, file: !430, line: 1169)
!679 = !DISubprogram(name: "nearbyintl", scope: !427, file: !427, line: 294, type: !495, flags: DIFlagPrototyped, spFlags: 0)
!680 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !681, file: !430, line: 1171)
!681 = !DISubprogram(name: "nextafter", scope: !427, file: !427, line: 259, type: !437, flags: DIFlagPrototyped, spFlags: 0)
!682 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !683, file: !430, line: 1172)
!683 = !DISubprogram(name: "nextafterf", scope: !427, file: !427, line: 259, type: !520, flags: DIFlagPrototyped, spFlags: 0)
!684 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !685, file: !430, line: 1173)
!685 = !DISubprogram(name: "nextafterl", scope: !427, file: !427, line: 259, type: !524, flags: DIFlagPrototyped, spFlags: 0)
!686 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !687, file: !430, line: 1175)
!687 = !DISubprogram(name: "nexttoward", scope: !427, file: !427, line: 261, type: !688, flags: DIFlagPrototyped, spFlags: 0)
!688 = !DISubroutineType(types: !689)
!689 = !{!57, !57, !497}
!690 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !691, file: !430, line: 1176)
!691 = !DISubprogram(name: "nexttowardf", scope: !427, file: !427, line: 261, type: !692, flags: DIFlagPrototyped, spFlags: 0)
!692 = !DISubroutineType(types: !693)
!693 = !{!45, !45, !497}
!694 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !695, file: !430, line: 1177)
!695 = !DISubprogram(name: "nexttowardl", scope: !427, file: !427, line: 261, type: !524, flags: DIFlagPrototyped, spFlags: 0)
!696 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !697, file: !430, line: 1179)
!697 = !DISubprogram(name: "remainder", scope: !427, file: !427, line: 272, type: !437, flags: DIFlagPrototyped, spFlags: 0)
!698 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !699, file: !430, line: 1180)
!699 = !DISubprogram(name: "remainderf", scope: !427, file: !427, line: 272, type: !520, flags: DIFlagPrototyped, spFlags: 0)
!700 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !701, file: !430, line: 1181)
!701 = !DISubprogram(name: "remainderl", scope: !427, file: !427, line: 272, type: !524, flags: DIFlagPrototyped, spFlags: 0)
!702 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !703, file: !430, line: 1183)
!703 = !DISubprogram(name: "remquo", scope: !427, file: !427, line: 307, type: !704, flags: DIFlagPrototyped, spFlags: 0)
!704 = !DISubroutineType(types: !705)
!705 = !{!57, !57, !57, !457}
!706 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !707, file: !430, line: 1184)
!707 = !DISubprogram(name: "remquof", scope: !427, file: !427, line: 307, type: !708, flags: DIFlagPrototyped, spFlags: 0)
!708 = !DISubroutineType(types: !709)
!709 = !{!45, !45, !45, !457}
!710 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !711, file: !430, line: 1185)
!711 = !DISubprogram(name: "remquol", scope: !427, file: !427, line: 307, type: !712, flags: DIFlagPrototyped, spFlags: 0)
!712 = !DISubroutineType(types: !713)
!713 = !{!497, !497, !497, !457}
!714 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !715, file: !430, line: 1187)
!715 = !DISubprogram(name: "rint", scope: !427, file: !427, line: 256, type: !428, flags: DIFlagPrototyped, spFlags: 0)
!716 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !717, file: !430, line: 1188)
!717 = !DISubprogram(name: "rintf", scope: !427, file: !427, line: 256, type: !491, flags: DIFlagPrototyped, spFlags: 0)
!718 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !719, file: !430, line: 1189)
!719 = !DISubprogram(name: "rintl", scope: !427, file: !427, line: 256, type: !495, flags: DIFlagPrototyped, spFlags: 0)
!720 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !721, file: !430, line: 1191)
!721 = !DISubprogram(name: "round", scope: !427, file: !427, line: 298, type: !428, flags: DIFlagPrototyped, spFlags: 0)
!722 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !723, file: !430, line: 1192)
!723 = !DISubprogram(name: "roundf", scope: !427, file: !427, line: 298, type: !491, flags: DIFlagPrototyped, spFlags: 0)
!724 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !725, file: !430, line: 1193)
!725 = !DISubprogram(name: "roundl", scope: !427, file: !427, line: 298, type: !495, flags: DIFlagPrototyped, spFlags: 0)
!726 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !727, file: !430, line: 1195)
!727 = !DISubprogram(name: "scalbln", scope: !427, file: !427, line: 290, type: !728, flags: DIFlagPrototyped, spFlags: 0)
!728 = !DISubroutineType(types: !729)
!729 = !{!57, !57, !359}
!730 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !731, file: !430, line: 1196)
!731 = !DISubprogram(name: "scalblnf", scope: !427, file: !427, line: 290, type: !732, flags: DIFlagPrototyped, spFlags: 0)
!732 = !DISubroutineType(types: !733)
!733 = !{!45, !45, !359}
!734 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !735, file: !430, line: 1197)
!735 = !DISubprogram(name: "scalblnl", scope: !427, file: !427, line: 290, type: !736, flags: DIFlagPrototyped, spFlags: 0)
!736 = !DISubroutineType(types: !737)
!737 = !{!497, !497, !359}
!738 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !739, file: !430, line: 1199)
!739 = !DISubprogram(name: "scalbn", scope: !427, file: !427, line: 276, type: !460, flags: DIFlagPrototyped, spFlags: 0)
!740 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !741, file: !430, line: 1200)
!741 = !DISubprogram(name: "scalbnf", scope: !427, file: !427, line: 276, type: !742, flags: DIFlagPrototyped, spFlags: 0)
!742 = !DISubroutineType(types: !743)
!743 = !{!45, !45, !13}
!744 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !745, file: !430, line: 1201)
!745 = !DISubprogram(name: "scalbnl", scope: !427, file: !427, line: 276, type: !746, flags: DIFlagPrototyped, spFlags: 0)
!746 = !DISubroutineType(types: !747)
!747 = !{!497, !497, !13}
!748 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !749, file: !430, line: 1203)
!749 = !DISubprogram(name: "tgamma", scope: !427, file: !427, line: 235, type: !428, flags: DIFlagPrototyped, spFlags: 0)
!750 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !751, file: !430, line: 1204)
!751 = !DISubprogram(name: "tgammaf", scope: !427, file: !427, line: 235, type: !491, flags: DIFlagPrototyped, spFlags: 0)
!752 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !753, file: !430, line: 1205)
!753 = !DISubprogram(name: "tgammal", scope: !427, file: !427, line: 235, type: !495, flags: DIFlagPrototyped, spFlags: 0)
!754 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !755, file: !430, line: 1207)
!755 = !DISubprogram(name: "trunc", scope: !427, file: !427, line: 302, type: !428, flags: DIFlagPrototyped, spFlags: 0)
!756 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !757, file: !430, line: 1208)
!757 = !DISubprogram(name: "truncf", scope: !427, file: !427, line: 302, type: !491, flags: DIFlagPrototyped, spFlags: 0)
!758 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !759, file: !430, line: 1209)
!759 = !DISubprogram(name: "truncl", scope: !427, file: !427, line: 302, type: !495, flags: DIFlagPrototyped, spFlags: 0)
!760 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !193, entity: !761, file: !765, line: 38)
!761 = !DISubprogram(name: "abs", linkageName: "_ZSt3absg", scope: !419, file: !424, line: 103, type: !762, flags: DIFlagPrototyped, spFlags: 0)
!762 = !DISubroutineType(types: !763)
!763 = !{!764, !764}
!764 = !DIBasicType(name: "__float128", size: 128, encoding: DW_ATE_float)
!765 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/math.h", directory: "")
!766 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !193, entity: !767, file: !765, line: 54)
!767 = !DISubprogram(name: "modf", linkageName: "_ZSt4modfePe", scope: !419, file: !430, line: 380, type: !768, flags: DIFlagPrototyped, spFlags: 0)
!768 = !DISubroutineType(types: !769)
!769 = !{!497, !497, !770}
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!771 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !772, file: !774, line: 127)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !421, line: 62, baseType: !773)
!773 = !DICompositeType(tag: DW_TAG_structure_type, file: !421, line: 58, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!774 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cstdlib", directory: "")
!775 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !776, file: !774, line: 128)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !421, line: 70, baseType: !777)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !421, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !778, identifier: "_ZTS6ldiv_t")
!778 = !{!779, !780}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !777, file: !421, line: 68, baseType: !359, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !777, file: !421, line: 69, baseType: !359, size: 64, offset: 64)
!781 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !782, file: !774, line: 130)
!782 = !DISubprogram(name: "abort", scope: !421, file: !421, line: 591, type: !783, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!783 = !DISubroutineType(types: !784)
!784 = !{null}
!785 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !786, file: !774, line: 134)
!786 = !DISubprogram(name: "atexit", scope: !421, file: !421, line: 595, type: !787, flags: DIFlagPrototyped, spFlags: 0)
!787 = !DISubroutineType(types: !788)
!788 = !{!13, !789}
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!790 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !791, file: !774, line: 137)
!791 = !DISubprogram(name: "at_quick_exit", scope: !421, file: !421, line: 600, type: !787, flags: DIFlagPrototyped, spFlags: 0)
!792 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !793, file: !774, line: 140)
!793 = !DISubprogram(name: "atof", scope: !421, file: !421, line: 101, type: !661, flags: DIFlagPrototyped, spFlags: 0)
!794 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !795, file: !774, line: 141)
!795 = !DISubprogram(name: "atoi", scope: !421, file: !421, line: 104, type: !796, flags: DIFlagPrototyped, spFlags: 0)
!796 = !DISubroutineType(types: !797)
!797 = !{!13, !663}
!798 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !799, file: !774, line: 142)
!799 = !DISubprogram(name: "atol", scope: !421, file: !421, line: 107, type: !800, flags: DIFlagPrototyped, spFlags: 0)
!800 = !DISubroutineType(types: !801)
!801 = !{!359, !663}
!802 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !803, file: !774, line: 143)
!803 = !DISubprogram(name: "bsearch", scope: !421, file: !421, line: 820, type: !804, flags: DIFlagPrototyped, spFlags: 0)
!804 = !DISubroutineType(types: !805)
!805 = !{!111, !806, !806, !808, !808, !811}
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !809, line: 46, baseType: !810)
!809 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!810 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !421, line: 808, baseType: !812)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DISubroutineType(types: !814)
!814 = !{!13, !806, !806}
!815 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !816, file: !774, line: 144)
!816 = !DISubprogram(name: "calloc", scope: !421, file: !421, line: 542, type: !817, flags: DIFlagPrototyped, spFlags: 0)
!817 = !DISubroutineType(types: !818)
!818 = !{!111, !808, !808}
!819 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !820, file: !774, line: 145)
!820 = !DISubprogram(name: "div", scope: !421, file: !421, line: 852, type: !821, flags: DIFlagPrototyped, spFlags: 0)
!821 = !DISubroutineType(types: !822)
!822 = !{!772, !13, !13}
!823 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !824, file: !774, line: 146)
!824 = !DISubprogram(name: "exit", scope: !421, file: !421, line: 617, type: !825, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!825 = !DISubroutineType(types: !826)
!826 = !{null, !13}
!827 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !828, file: !774, line: 147)
!828 = !DISubprogram(name: "free", scope: !421, file: !421, line: 565, type: !829, flags: DIFlagPrototyped, spFlags: 0)
!829 = !DISubroutineType(types: !830)
!830 = !{null, !111}
!831 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !832, file: !774, line: 148)
!832 = !DISubprogram(name: "getenv", scope: !421, file: !421, line: 634, type: !833, flags: DIFlagPrototyped, spFlags: 0)
!833 = !DISubroutineType(types: !834)
!834 = !{!835, !663}
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!836 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !837, file: !774, line: 149)
!837 = !DISubprogram(name: "labs", scope: !421, file: !421, line: 841, type: !838, flags: DIFlagPrototyped, spFlags: 0)
!838 = !DISubroutineType(types: !839)
!839 = !{!359, !359}
!840 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !841, file: !774, line: 150)
!841 = !DISubprogram(name: "ldiv", scope: !421, file: !421, line: 854, type: !842, flags: DIFlagPrototyped, spFlags: 0)
!842 = !DISubroutineType(types: !843)
!843 = !{!776, !359, !359}
!844 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !845, file: !774, line: 151)
!845 = !DISubprogram(name: "malloc", scope: !421, file: !421, line: 539, type: !846, flags: DIFlagPrototyped, spFlags: 0)
!846 = !DISubroutineType(types: !847)
!847 = !{!111, !808}
!848 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !849, file: !774, line: 153)
!849 = !DISubprogram(name: "mblen", scope: !421, file: !421, line: 922, type: !850, flags: DIFlagPrototyped, spFlags: 0)
!850 = !DISubroutineType(types: !851)
!851 = !{!13, !663, !808}
!852 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !853, file: !774, line: 154)
!853 = !DISubprogram(name: "mbstowcs", scope: !421, file: !421, line: 933, type: !854, flags: DIFlagPrototyped, spFlags: 0)
!854 = !DISubroutineType(types: !855)
!855 = !{!808, !856, !859, !808}
!856 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !857)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!859 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !663)
!860 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !861, file: !774, line: 155)
!861 = !DISubprogram(name: "mbtowc", scope: !421, file: !421, line: 925, type: !862, flags: DIFlagPrototyped, spFlags: 0)
!862 = !DISubroutineType(types: !863)
!863 = !{!13, !856, !859, !808}
!864 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !865, file: !774, line: 157)
!865 = !DISubprogram(name: "qsort", scope: !421, file: !421, line: 830, type: !866, flags: DIFlagPrototyped, spFlags: 0)
!866 = !DISubroutineType(types: !867)
!867 = !{null, !111, !808, !808, !811}
!868 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !869, file: !774, line: 160)
!869 = !DISubprogram(name: "quick_exit", scope: !421, file: !421, line: 623, type: !825, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!870 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !871, file: !774, line: 163)
!871 = !DISubprogram(name: "rand", scope: !421, file: !421, line: 453, type: !872, flags: DIFlagPrototyped, spFlags: 0)
!872 = !DISubroutineType(types: !873)
!873 = !{!13}
!874 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !875, file: !774, line: 164)
!875 = !DISubprogram(name: "realloc", scope: !421, file: !421, line: 550, type: !876, flags: DIFlagPrototyped, spFlags: 0)
!876 = !DISubroutineType(types: !877)
!877 = !{!111, !111, !808}
!878 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !879, file: !774, line: 165)
!879 = !DISubprogram(name: "srand", scope: !421, file: !421, line: 455, type: !880, flags: DIFlagPrototyped, spFlags: 0)
!880 = !DISubroutineType(types: !881)
!881 = !{null, !64}
!882 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !883, file: !774, line: 166)
!883 = !DISubprogram(name: "strtod", scope: !421, file: !421, line: 117, type: !884, flags: DIFlagPrototyped, spFlags: 0)
!884 = !DISubroutineType(types: !885)
!885 = !{!57, !859, !886}
!886 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !887)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!888 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !889, file: !774, line: 167)
!889 = !DISubprogram(name: "strtol", scope: !421, file: !421, line: 176, type: !890, flags: DIFlagPrototyped, spFlags: 0)
!890 = !DISubroutineType(types: !891)
!891 = !{!359, !859, !886, !13}
!892 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !893, file: !774, line: 168)
!893 = !DISubprogram(name: "strtoul", scope: !421, file: !421, line: 180, type: !894, flags: DIFlagPrototyped, spFlags: 0)
!894 = !DISubroutineType(types: !895)
!895 = !{!810, !859, !886, !13}
!896 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !897, file: !774, line: 169)
!897 = !DISubprogram(name: "system", scope: !421, file: !421, line: 784, type: !796, flags: DIFlagPrototyped, spFlags: 0)
!898 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !899, file: !774, line: 171)
!899 = !DISubprogram(name: "wcstombs", scope: !421, file: !421, line: 936, type: !900, flags: DIFlagPrototyped, spFlags: 0)
!900 = !DISubroutineType(types: !901)
!901 = !{!808, !902, !903, !808}
!902 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !835)
!903 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !904)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !858)
!906 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !907, file: !774, line: 172)
!907 = !DISubprogram(name: "wctomb", scope: !421, file: !421, line: 929, type: !908, flags: DIFlagPrototyped, spFlags: 0)
!908 = !DISubroutineType(types: !909)
!909 = !{!13, !835, !858}
!910 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !911, entity: !912, file: !774, line: 200)
!911 = !DINamespace(name: "__gnu_cxx", scope: null)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !421, line: 80, baseType: !913)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !421, line: 76, size: 128, flags: DIFlagTypePassByValue, elements: !914, identifier: "_ZTS7lldiv_t")
!914 = !{!915, !916}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !913, file: !421, line: 78, baseType: !608, size: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !913, file: !421, line: 79, baseType: !608, size: 64, offset: 64)
!917 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !911, entity: !918, file: !774, line: 206)
!918 = !DISubprogram(name: "_Exit", scope: !421, file: !421, line: 629, type: !825, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!919 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !911, entity: !920, file: !774, line: 210)
!920 = !DISubprogram(name: "llabs", scope: !421, file: !421, line: 844, type: !921, flags: DIFlagPrototyped, spFlags: 0)
!921 = !DISubroutineType(types: !922)
!922 = !{!608, !608}
!923 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !911, entity: !924, file: !774, line: 216)
!924 = !DISubprogram(name: "lldiv", scope: !421, file: !421, line: 858, type: !925, flags: DIFlagPrototyped, spFlags: 0)
!925 = !DISubroutineType(types: !926)
!926 = !{!912, !608, !608}
!927 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !911, entity: !928, file: !774, line: 227)
!928 = !DISubprogram(name: "atoll", scope: !421, file: !421, line: 112, type: !929, flags: DIFlagPrototyped, spFlags: 0)
!929 = !DISubroutineType(types: !930)
!930 = !{!608, !663}
!931 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !911, entity: !932, file: !774, line: 228)
!932 = !DISubprogram(name: "strtoll", scope: !421, file: !421, line: 200, type: !933, flags: DIFlagPrototyped, spFlags: 0)
!933 = !DISubroutineType(types: !934)
!934 = !{!608, !859, !886, !13}
!935 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !911, entity: !936, file: !774, line: 229)
!936 = !DISubprogram(name: "strtoull", scope: !421, file: !421, line: 205, type: !937, flags: DIFlagPrototyped, spFlags: 0)
!937 = !DISubroutineType(types: !938)
!938 = !{!939, !859, !886, !13}
!939 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!940 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !911, entity: !941, file: !774, line: 231)
!941 = !DISubprogram(name: "strtof", scope: !421, file: !421, line: 123, type: !942, flags: DIFlagPrototyped, spFlags: 0)
!942 = !DISubroutineType(types: !943)
!943 = !{!45, !859, !886}
!944 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !911, entity: !945, file: !774, line: 232)
!945 = !DISubprogram(name: "strtold", scope: !421, file: !421, line: 126, type: !946, flags: DIFlagPrototyped, spFlags: 0)
!946 = !DISubroutineType(types: !947)
!947 = !{!497, !859, !886}
!948 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !912, file: !774, line: 240)
!949 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !918, file: !774, line: 242)
!950 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !920, file: !774, line: 244)
!951 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !952, file: !774, line: 245)
!952 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !911, file: !774, line: 213, type: !925, flags: DIFlagPrototyped, spFlags: 0)
!953 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !924, file: !774, line: 246)
!954 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !928, file: !774, line: 248)
!955 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !941, file: !774, line: 249)
!956 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !932, file: !774, line: 250)
!957 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !936, file: !774, line: 251)
!958 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !945, file: !774, line: 252)
!959 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !193, entity: !782, file: !960, line: 38)
!960 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/stdlib.h", directory: "")
!961 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !193, entity: !786, file: !960, line: 39)
!962 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !193, entity: !824, file: !960, line: 40)
!963 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !193, entity: !791, file: !960, line: 43)
!964 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !193, entity: !869, file: !960, line: 46)
!965 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !193, entity: !772, file: !960, line: 51)
!966 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !193, entity: !776, file: !960, line: 52)
!967 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !193, entity: !761, file: !960, line: 54)
!968 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !193, entity: !793, file: !960, line: 55)
!969 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !193, entity: !795, file: !960, line: 56)
!970 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !193, entity: !799, file: !960, line: 57)
!971 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !193, entity: !803, file: !960, line: 58)
!972 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !193, entity: !816, file: !960, line: 59)
!973 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !193, entity: !952, file: !960, line: 60)
!974 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !193, entity: !828, file: !960, line: 61)
!975 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !193, entity: !832, file: !960, line: 62)
!976 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !193, entity: !837, file: !960, line: 63)
!977 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !193, entity: !841, file: !960, line: 64)
!978 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !193, entity: !845, file: !960, line: 65)
!979 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !193, entity: !849, file: !960, line: 67)
!980 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !193, entity: !853, file: !960, line: 68)
!981 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !193, entity: !861, file: !960, line: 69)
!982 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !193, entity: !865, file: !960, line: 71)
!983 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !193, entity: !871, file: !960, line: 72)
!984 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !193, entity: !875, file: !960, line: 73)
!985 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !193, entity: !879, file: !960, line: 74)
!986 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !193, entity: !883, file: !960, line: 75)
!987 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !193, entity: !889, file: !960, line: 76)
!988 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !193, entity: !893, file: !960, line: 77)
!989 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !193, entity: !897, file: !960, line: 78)
!990 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !193, entity: !899, file: !960, line: 80)
!991 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !193, entity: !907, file: !960, line: 81)
!992 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !993, file: !995, line: 64)
!993 = !DISubprogram(name: "isalnum", scope: !994, file: !994, line: 108, type: !422, flags: DIFlagPrototyped, spFlags: 0)
!994 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!995 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cctype", directory: "")
!996 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !997, file: !995, line: 65)
!997 = !DISubprogram(name: "isalpha", scope: !994, file: !994, line: 109, type: !422, flags: DIFlagPrototyped, spFlags: 0)
!998 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !419, entity: !999, file: !995, line: 66)
