; ModuleID = 'quatern.cpp'
source_filename = "quatern.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"struct.pov::Fractal_Struct" = type { %"struct.pov::Method_Struct"*, i32, %"struct.pov::Object_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Interior_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Light_Source_Struct"*, %"struct.pov::Bounding_Box_Struct", %"struct.pov::Transform_Struct"*, %"struct.pov::Transform_Struct"*, float, i32, [3 x double], [4 x double], [4 x double], double, double, i32, double, i32, i32, i32, %"struct.pov::cmplx", void (double*, i32, %"struct.pov::Fractal_Struct"*)*, {}*, i32 (double*, %"struct.pov::Fractal_Struct"*, double*)*, i32 (%"struct.pov::Ray_Struct"*, %"struct.pov::Fractal_Struct"*, double*, double*)*, void (%"struct.pov::cmplx"*, %"struct.pov::cmplx"*)*, double }

!316 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !317, file: !27, line: 1188)
!317 = !DISubprogram(name: "rintf", scope: !23, file: !23, line: 256, type: !90, flags: DIFlagPrototyped, spFlags: 0)
!318 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !319, file: !27, line: 1189)
!319 = !DISubprogram(name: "rintl", scope: !23, file: !23, line: 256, type: !94, flags: DIFlagPrototyped, spFlags: 0)
!320 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !321, file: !27, line: 1191)
!321 = !DISubprogram(name: "round", scope: !23, file: !23, line: 298, type: !24, flags: DIFlagPrototyped, spFlags: 0)
!322 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !323, file: !27, line: 1192)
!323 = !DISubprogram(name: "roundf", scope: !23, file: !23, line: 298, type: !90, flags: DIFlagPrototyped, spFlags: 0)
!324 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !325, file: !27, line: 1193)
!325 = !DISubprogram(name: "roundl", scope: !23, file: !23, line: 298, type: !94, flags: DIFlagPrototyped, spFlags: 0)
!326 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !327, file: !27, line: 1195)
!327 = !DISubprogram(name: "scalbln", scope: !23, file: !23, line: 290, type: !328, flags: DIFlagPrototyped, spFlags: 0)
!328 = !DISubroutineType(types: !329)
!329 = !{!26, !26, !244}
!330 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !331, file: !27, line: 1196)
!331 = !DISubprogram(name: "scalblnf", scope: !23, file: !23, line: 290, type: !332, flags: DIFlagPrototyped, spFlags: 0)
!332 = !DISubroutineType(types: !333)
!333 = !{!85, !85, !244}
!334 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !335, file: !27, line: 1197)
!335 = !DISubprogram(name: "scalblnl", scope: !23, file: !23, line: 290, type: !336, flags: DIFlagPrototyped, spFlags: 0)
!336 = !DISubroutineType(types: !337)
!337 = !{!96, !96, !244}
!338 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !339, file: !27, line: 1199)
!339 = !DISubprogram(name: "scalbn", scope: !23, file: !23, line: 276, type: !57, flags: DIFlagPrototyped, spFlags: 0)
!340 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !341, file: !27, line: 1200)
!341 = !DISubprogram(name: "scalbnf", scope: !23, file: !23, line: 276, type: !342, flags: DIFlagPrototyped, spFlags: 0)
!342 = !DISubroutineType(types: !343)
!343 = !{!85, !85, !19}
!344 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !345, file: !27, line: 1201)
!345 = !DISubprogram(name: "scalbnl", scope: !23, file: !23, line: 276, type: !346, flags: DIFlagPrototyped, spFlags: 0)
!346 = !DISubroutineType(types: !347)
!347 = !{!96, !96, !19}
!348 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !349, file: !27, line: 1203)
!349 = !DISubprogram(name: "tgamma", scope: !23, file: !23, line: 235, type: !24, flags: DIFlagPrototyped, spFlags: 0)
!350 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !351, file: !27, line: 1204)
!351 = !DISubprogram(name: "tgammaf", scope: !23, file: !23, line: 235, type: !90, flags: DIFlagPrototyped, spFlags: 0)
!352 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !353, file: !27, line: 1205)
!353 = !DISubprogram(name: "tgammal", scope: !23, file: !23, line: 235, type: !94, flags: DIFlagPrototyped, spFlags: 0)
!354 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !355, file: !27, line: 1207)
!355 = !DISubprogram(name: "trunc", scope: !23, file: !23, line: 302, type: !24, flags: DIFlagPrototyped, spFlags: 0)
!356 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !357, file: !27, line: 1208)
!357 = !DISubprogram(name: "truncf", scope: !23, file: !23, line: 302, type: !90, flags: DIFlagPrototyped, spFlags: 0)
!358 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !359, file: !27, line: 1209)
!359 = !DISubprogram(name: "truncl", scope: !23, file: !23, line: 302, type: !94, flags: DIFlagPrototyped, spFlags: 0)
!360 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !361, file: !365, line: 38)
!361 = !DISubprogram(name: "abs", linkageName: "_ZSt3absg", scope: !14, file: !20, line: 103, type: !362, flags: DIFlagPrototyped, spFlags: 0)
!362 = !DISubroutineType(types: !363)
!363 = !{!364, !364}
!364 = !DIBasicType(name: "__float128", size: 128, encoding: DW_ATE_float)
!365 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/math.h", directory: "")
!366 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !367, file: !365, line: 54)
!367 = !DISubprogram(name: "modf", linkageName: "_ZSt4modfePe", scope: !14, file: !27, line: 380, type: !368, flags: DIFlagPrototyped, spFlags: 0)
!368 = !DISubroutineType(types: !369)
!369 = !{!96, !96, !370}
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!371 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !372, file: !374, line: 127)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !16, line: 62, baseType: !373)
!373 = !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 58, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!374 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cstdlib", directory: "")
!375 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !376, file: !374, line: 128)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !16, line: 70, baseType: !377)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !378, identifier: "_ZTS6ldiv_t")
!378 = !{!379, !380}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !377, file: !16, line: 68, baseType: !244, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !377, file: !16, line: 69, baseType: !244, size: 64, offset: 64)
!381 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !382, file: !374, line: 130)
!382 = !DISubprogram(name: "abort", scope: !16, file: !16, line: 591, type: !383, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!383 = !DISubroutineType(types: !384)
!384 = !{null}
!385 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !386, file: !374, line: 134)
!386 = !DISubprogram(name: "atexit", scope: !16, file: !16, line: 595, type: !387, flags: DIFlagPrototyped, spFlags: 0)
!387 = !DISubroutineType(types: !388)
!388 = !{!19, !389}
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!390 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !391, file: !374, line: 137)
!391 = !DISubprogram(name: "at_quick_exit", scope: !16, file: !16, line: 600, type: !387, flags: DIFlagPrototyped, spFlags: 0)
!392 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !393, file: !374, line: 140)
!393 = !DISubprogram(name: "atof", scope: !16, file: !16, line: 101, type: !261, flags: DIFlagPrototyped, spFlags: 0)
!394 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !395, file: !374, line: 141)
!395 = !DISubprogram(name: "atoi", scope: !16, file: !16, line: 104, type: !396, flags: DIFlagPrototyped, spFlags: 0)
!396 = !DISubroutineType(types: !397)
!397 = !{!19, !263}
!398 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !399, file: !374, line: 142)
!399 = !DISubprogram(name: "atol", scope: !16, file: !16, line: 107, type: !400, flags: DIFlagPrototyped, spFlags: 0)
!400 = !DISubroutineType(types: !401)
!401 = !{!244, !263}
!402 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !403, file: !374, line: 143)
!403 = !DISubprogram(name: "bsearch", scope: !16, file: !16, line: 820, type: !404, flags: DIFlagPrototyped, spFlags: 0)
!404 = !DISubroutineType(types: !405)
!405 = !{!406, !407, !407, !409, !409, !412}
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !410, line: 46, baseType: !411)
!410 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!411 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !16, line: 808, baseType: !413)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!19, !407, !407}
!416 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !417, file: !374, line: 144)
!417 = !DISubprogram(name: "calloc", scope: !16, file: !16, line: 542, type: !418, flags: DIFlagPrototyped, spFlags: 0)
!418 = !DISubroutineType(types: !419)
!419 = !{!406, !409, !409}
!420 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !421, file: !374, line: 145)
!421 = !DISubprogram(name: "div", scope: !16, file: !16, line: 852, type: !422, flags: DIFlagPrototyped, spFlags: 0)
!422 = !DISubroutineType(types: !423)
!423 = !{!372, !19, !19}
!424 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !425, file: !374, line: 146)
!425 = !DISubprogram(name: "exit", scope: !16, file: !16, line: 617, type: !426, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!426 = !DISubroutineType(types: !427)
!427 = !{null, !19}
!428 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !429, file: !374, line: 147)
!429 = !DISubprogram(name: "free", scope: !16, file: !16, line: 565, type: !430, flags: DIFlagPrototyped, spFlags: 0)
!430 = !DISubroutineType(types: !431)
!431 = !{null, !406}
!432 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !433, file: !374, line: 148)
!433 = !DISubprogram(name: "getenv", scope: !16, file: !16, line: 634, type: !434, flags: DIFlagPrototyped, spFlags: 0)
!434 = !DISubroutineType(types: !435)
!435 = !{!436, !263}
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!437 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !438, file: !374, line: 149)
!438 = !DISubprogram(name: "labs", scope: !16, file: !16, line: 841, type: !439, flags: DIFlagPrototyped, spFlags: 0)
!439 = !DISubroutineType(types: !440)
!440 = !{!244, !244}
!441 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !442, file: !374, line: 150)
!442 = !DISubprogram(name: "ldiv", scope: !16, file: !16, line: 854, type: !443, flags: DIFlagPrototyped, spFlags: 0)
!443 = !DISubroutineType(types: !444)
!444 = !{!376, !244, !244}
!445 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !446, file: !374, line: 151)
!446 = !DISubprogram(name: "malloc", scope: !16, file: !16, line: 539, type: !447, flags: DIFlagPrototyped, spFlags: 0)
!447 = !DISubroutineType(types: !448)
!448 = !{!406, !409}
!449 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !450, file: !374, line: 153)
!450 = !DISubprogram(name: "mblen", scope: !16, file: !16, line: 922, type: !451, flags: DIFlagPrototyped, spFlags: 0)
!451 = !DISubroutineType(types: !452)
!452 = !{!19, !263, !409}
!453 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !454, file: !374, line: 154)
!454 = !DISubprogram(name: "mbstowcs", scope: !16, file: !16, line: 933, type: !455, flags: DIFlagPrototyped, spFlags: 0)
!455 = !DISubroutineType(types: !456)
!456 = !{!409, !457, !460, !409}
!457 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !458)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!460 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !263)
!461 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !462, file: !374, line: 155)
!462 = !DISubprogram(name: "mbtowc", scope: !16, file: !16, line: 925, type: !463, flags: DIFlagPrototyped, spFlags: 0)
!463 = !DISubroutineType(types: !464)
!464 = !{!19, !457, !460, !409}
!465 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !466, file: !374, line: 157)
!466 = !DISubprogram(name: "qsort", scope: !16, file: !16, line: 830, type: !467, flags: DIFlagPrototyped, spFlags: 0)
!467 = !DISubroutineType(types: !468)
!468 = !{null, !406, !409, !409, !412}
!469 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !470, file: !374, line: 160)
!470 = !DISubprogram(name: "quick_exit", scope: !16, file: !16, line: 623, type: !426, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!471 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !472, file: !374, line: 163)
!472 = !DISubprogram(name: "rand", scope: !16, file: !16, line: 453, type: !473, flags: DIFlagPrototyped, spFlags: 0)
!473 = !DISubroutineType(types: !474)
!474 = !{!19}
!475 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !476, file: !374, line: 164)
!476 = !DISubprogram(name: "realloc", scope: !16, file: !16, line: 550, type: !477, flags: DIFlagPrototyped, spFlags: 0)
!477 = !DISubroutineType(types: !478)
!478 = !{!406, !406, !409}
!479 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !480, file: !374, line: 165)
!480 = !DISubprogram(name: "srand", scope: !16, file: !16, line: 455, type: !481, flags: DIFlagPrototyped, spFlags: 0)
!481 = !DISubroutineType(types: !482)
!482 = !{null, !6}
!483 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !484, file: !374, line: 166)
!484 = !DISubprogram(name: "strtod", scope: !16, file: !16, line: 117, type: !485, flags: DIFlagPrototyped, spFlags: 0)
!485 = !DISubroutineType(types: !486)
!486 = !{!26, !460, !487}
!487 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !488)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!489 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !490, file: !374, line: 167)
!490 = !DISubprogram(name: "strtol", scope: !16, file: !16, line: 176, type: !491, flags: DIFlagPrototyped, spFlags: 0)
!491 = !DISubroutineType(types: !492)
!492 = !{!244, !460, !487, !19}
!493 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !494, file: !374, line: 168)
!494 = !DISubprogram(name: "strtoul", scope: !16, file: !16, line: 180, type: !495, flags: DIFlagPrototyped, spFlags: 0)
!495 = !DISubroutineType(types: !496)
!496 = !{!411, !460, !487, !19}
!497 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !498, file: !374, line: 169)
!498 = !DISubprogram(name: "system", scope: !16, file: !16, line: 784, type: !396, flags: DIFlagPrototyped, spFlags: 0)
!499 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !500, file: !374, line: 171)
!500 = !DISubprogram(name: "wcstombs", scope: !16, file: !16, line: 936, type: !501, flags: DIFlagPrototyped, spFlags: 0)
!501 = !DISubroutineType(types: !502)
!502 = !{!409, !503, !504, !409}
!503 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !436)
!504 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !505)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !459)
!507 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !508, file: !374, line: 172)
!508 = !DISubprogram(name: "wctomb", scope: !16, file: !16, line: 929, type: !509, flags: DIFlagPrototyped, spFlags: 0)
!509 = !DISubroutineType(types: !510)
!510 = !{!19, !436, !459}
!511 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !512, entity: !513, file: !374, line: 200)
!512 = !DINamespace(name: "__gnu_cxx", scope: null)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !16, line: 80, baseType: !514)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 76, size: 128, flags: DIFlagTypePassByValue, elements: !515, identifier: "_ZTS7lldiv_t")
!515 = !{!516, !517}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !514, file: !16, line: 78, baseType: !207, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !514, file: !16, line: 79, baseType: !207, size: 64, offset: 64)
!518 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !512, entity: !519, file: !374, line: 206)
!519 = !DISubprogram(name: "_Exit", scope: !16, file: !16, line: 629, type: !426, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!520 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !512, entity: !521, file: !374, line: 210)
!521 = !DISubprogram(name: "llabs", scope: !16, file: !16, line: 844, type: !522, flags: DIFlagPrototyped, spFlags: 0)
!522 = !DISubroutineType(types: !523)
!523 = !{!207, !207}
!524 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !512, entity: !525, file: !374, line: 216)
!525 = !DISubprogram(name: "lldiv", scope: !16, file: !16, line: 858, type: !526, flags: DIFlagPrototyped, spFlags: 0)
!526 = !DISubroutineType(types: !527)
!527 = !{!513, !207, !207}
!528 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !512, entity: !529, file: !374, line: 227)
!529 = !DISubprogram(name: "atoll", scope: !16, file: !16, line: 112, type: !530, flags: DIFlagPrototyped, spFlags: 0)
!530 = !DISubroutineType(types: !531)
!531 = !{!207, !263}
!532 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !512, entity: !533, file: !374, line: 228)
!533 = !DISubprogram(name: "strtoll", scope: !16, file: !16, line: 200, type: !534, flags: DIFlagPrototyped, spFlags: 0)
!534 = !DISubroutineType(types: !535)
!535 = !{!207, !460, !487, !19}
!536 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !512, entity: !537, file: !374, line: 229)
!537 = !DISubprogram(name: "strtoull", scope: !16, file: !16, line: 205, type: !538, flags: DIFlagPrototyped, spFlags: 0)
!538 = !DISubroutineType(types: !539)
!539 = !{!540, !460, !487, !19}
!540 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!541 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !512, entity: !542, file: !374, line: 231)
!542 = !DISubprogram(name: "strtof", scope: !16, file: !16, line: 123, type: !543, flags: DIFlagPrototyped, spFlags: 0)
!543 = !DISubroutineType(types: !544)
!544 = !{!85, !460, !487}
!545 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !512, entity: !546, file: !374, line: 232)
!546 = !DISubprogram(name: "strtold", scope: !16, file: !16, line: 126, type: !547, flags: DIFlagPrototyped, spFlags: 0)
!547 = !DISubroutineType(types: !548)
!548 = !{!96, !460, !487}
!549 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !513, file: !374, line: 240)
!550 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !519, file: !374, line: 242)
!551 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !521, file: !374, line: 244)
!552 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !553, file: !374, line: 245)
!553 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !512, file: !374, line: 213, type: !526, flags: DIFlagPrototyped, spFlags: 0)
!554 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !525, file: !374, line: 246)
!555 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !529, file: !374, line: 248)
!556 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !542, file: !374, line: 249)
!557 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !533, file: !374, line: 250)
!558 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !537, file: !374, line: 251)
!559 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !546, file: !374, line: 252)
!560 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !382, file: !561, line: 38)
!561 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/stdlib.h", directory: "")
!562 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !386, file: !561, line: 39)
!563 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !425, file: !561, line: 40)
!564 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !391, file: !561, line: 43)
!565 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !470, file: !561, line: 46)
!566 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !372, file: !561, line: 51)
!567 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !376, file: !561, line: 52)
!568 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !361, file: !561, line: 54)
!569 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !393, file: !561, line: 55)
!570 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !395, file: !561, line: 56)
!571 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !399, file: !561, line: 57)
!572 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !403, file: !561, line: 58)
!573 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !417, file: !561, line: 59)
!574 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !553, file: !561, line: 60)
!575 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !429, file: !561, line: 61)
!576 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !433, file: !561, line: 62)
!577 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !438, file: !561, line: 63)
!578 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !442, file: !561, line: 64)
!579 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !446, file: !561, line: 65)
!580 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !450, file: !561, line: 67)
!581 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !454, file: !561, line: 68)
!582 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !462, file: !561, line: 69)
!583 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !466, file: !561, line: 71)
!584 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !472, file: !561, line: 72)
!585 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !476, file: !561, line: 73)
!586 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !480, file: !561, line: 74)
!587 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !484, file: !561, line: 75)
!588 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !490, file: !561, line: 76)
!589 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !494, file: !561, line: 77)
!590 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !498, file: !561, line: 78)
!591 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !500, file: !561, line: 80)
!592 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !508, file: !561, line: 81)
!593 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !594, file: !596, line: 64)
!594 = !DISubprogram(name: "isalnum", scope: !595, file: !595, line: 108, type: !17, flags: DIFlagPrototyped, spFlags: 0)
!595 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!596 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cctype", directory: "")
!597 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !598, file: !596, line: 65)
!598 = !DISubprogram(name: "isalpha", scope: !595, file: !595, line: 109, type: !17, flags: DIFlagPrototyped, spFlags: 0)
!599 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !600, file: !596, line: 66)
!600 = !DISubprogram(name: "iscntrl", scope: !595, file: !595, line: 110, type: !17, flags: DIFlagPrototyped, spFlags: 0)
!601 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !602, file: !596, line: 67)
!602 = !DISubprogram(name: "isdigit", scope: !595, file: !595, line: 111, type: !17, flags: DIFlagPrototyped, spFlags: 0)
!603 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !604, file: !596, line: 68)
!604 = !DISubprogram(name: "isgraph", scope: !595, file: !595, line: 113, type: !17, flags: DIFlagPrototyped, spFlags: 0)
!605 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !606, file: !596, line: 69)
!606 = !DISubprogram(name: "islower", scope: !595, file: !595, line: 112, type: !17, flags: DIFlagPrototyped, spFlags: 0)
!607 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !608, file: !596, line: 70)
!608 = !DISubprogram(name: "isprint", scope: !595, file: !595, line: 114, type: !17, flags: DIFlagPrototyped, spFlags: 0)
!609 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !610, file: !596, line: 71)
!610 = !DISubprogram(name: "ispunct", scope: !595, file: !595, line: 115, type: !17, flags: DIFlagPrototyped, spFlags: 0)
!611 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !612, file: !596, line: 72)
!612 = !DISubprogram(name: "isspace", scope: !595, file: !595, line: 116, type: !17, flags: DIFlagPrototyped, spFlags: 0)
!613 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !614, file: !596, line: 73)
!614 = !DISubprogram(name: "isupper", scope: !595, file: !595, line: 117, type: !17, flags: DIFlagPrototyped, spFlags: 0)
!615 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !616, file: !596, line: 74)
!616 = !DISubprogram(name: "isxdigit", scope: !595, file: !595, line: 118, type: !17, flags: DIFlagPrototyped, spFlags: 0)
!617 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !618, file: !596, line: 75)
!618 = !DISubprogram(name: "tolower", scope: !595, file: !595, line: 122, type: !17, flags: DIFlagPrototyped, spFlags: 0)
!619 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !620, file: !596, line: 76)
!620 = !DISubprogram(name: "toupper", scope: !595, file: !595, line: 125, type: !17, flags: DIFlagPrototyped, spFlags: 0)
!621 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !622, file: !596, line: 87)
!622 = !DISubprogram(name: "isblank", scope: !595, file: !595, line: 130, type: !17, flags: DIFlagPrototyped, spFlags: 0)
!623 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !624, file: !628, line: 77)
!624 = !DISubprogram(name: "memchr", scope: !625, file: !625, line: 73, type: !626, flags: DIFlagPrototyped, spFlags: 0)
!625 = !DIFile(filename: "/usr/include/string.h", directory: "")
!626 = !DISubroutineType(types: !627)
!627 = !{!407, !407, !19, !409}
!628 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cstring", directory: "")
!629 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !630, file: !628, line: 78)
!630 = !DISubprogram(name: "memcmp", scope: !625, file: !625, line: 64, type: !631, flags: DIFlagPrototyped, spFlags: 0)
!631 = !DISubroutineType(types: !632)
!632 = !{!19, !407, !407, !409}
!633 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !634, file: !628, line: 79)
!634 = !DISubprogram(name: "memcpy", scope: !625, file: !625, line: 43, type: !635, flags: DIFlagPrototyped, spFlags: 0)
!635 = !DISubroutineType(types: !636)
!636 = !{!406, !637, !638, !409}
!637 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !406)
!638 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !407)
!639 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !640, file: !628, line: 80)
!640 = !DISubprogram(name: "memmove", scope: !625, file: !625, line: 47, type: !641, flags: DIFlagPrototyped, spFlags: 0)
!641 = !DISubroutineType(types: !642)
!642 = !{!406, !406, !407, !409}
!643 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !644, file: !628, line: 81)
!644 = !DISubprogram(name: "memset", scope: !625, file: !625, line: 61, type: !645, flags: DIFlagPrototyped, spFlags: 0)
!645 = !DISubroutineType(types: !646)
!646 = !{!406, !406, !19, !409}
!647 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !648, file: !628, line: 82)
!648 = !DISubprogram(name: "strcat", scope: !625, file: !625, line: 130, type: !649, flags: DIFlagPrototyped, spFlags: 0)
!649 = !DISubroutineType(types: !650)
!650 = !{!436, !503, !460}
!651 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !652, file: !628, line: 83)
!652 = !DISubprogram(name: "strcmp", scope: !625, file: !625, line: 137, type: !653, flags: DIFlagPrototyped, spFlags: 0)
!653 = !DISubroutineType(types: !654)
!654 = !{!19, !263, !263}
!655 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !656, file: !628, line: 84)
!656 = !DISubprogram(name: "strcoll", scope: !625, file: !625, line: 144, type: !653, flags: DIFlagPrototyped, spFlags: 0)
!657 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !658, file: !628, line: 85)
!658 = !DISubprogram(name: "strcpy", scope: !625, file: !625, line: 122, type: !649, flags: DIFlagPrototyped, spFlags: 0)
!659 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !660, file: !628, line: 86)
!660 = !DISubprogram(name: "strcspn", scope: !625, file: !625, line: 273, type: !661, flags: DIFlagPrototyped, spFlags: 0)
!661 = !DISubroutineType(types: !662)
!662 = !{!409, !263, !263}
!663 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !664, file: !628, line: 87)
!664 = !DISubprogram(name: "strerror", scope: !625, file: !625, line: 397, type: !665, flags: DIFlagPrototyped, spFlags: 0)
!665 = !DISubroutineType(types: !666)
!666 = !{!436, !19}
!667 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !668, file: !628, line: 88)
!668 = !DISubprogram(name: "strlen", scope: !625, file: !625, line: 385, type: !669, flags: DIFlagPrototyped, spFlags: 0)
!669 = !DISubroutineType(types: !670)
!670 = !{!409, !263}
!671 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !672, file: !628, line: 89)
!672 = !DISubprogram(name: "strncat", scope: !625, file: !625, line: 133, type: !673, flags: DIFlagPrototyped, spFlags: 0)
!673 = !DISubroutineType(types: !674)
!674 = !{!436, !503, !460, !409}
!675 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !676, file: !628, line: 90)
!676 = !DISubprogram(name: "strncmp", scope: !625, file: !625, line: 140, type: !677, flags: DIFlagPrototyped, spFlags: 0)
!677 = !DISubroutineType(types: !678)
!678 = !{!19, !263, !263, !409}
!679 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !680, file: !628, line: 91)
!680 = !DISubprogram(name: "strncpy", scope: !625, file: !625, line: 125, type: !673, flags: DIFlagPrototyped, spFlags: 0)
!681 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !682, file: !628, line: 92)
!682 = !DISubprogram(name: "strspn", scope: !625, file: !625, line: 277, type: !661, flags: DIFlagPrototyped, spFlags: 0)
!683 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !684, file: !628, line: 93)
!684 = !DISubprogram(name: "strtok", scope: !625, file: !625, line: 336, type: !649, flags: DIFlagPrototyped, spFlags: 0)
!685 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !686, file: !628, line: 94)
!686 = !DISubprogram(name: "strxfrm", scope: !625, file: !625, line: 147, type: !687, flags: DIFlagPrototyped, spFlags: 0)
!687 = !DISubroutineType(types: !688)
!688 = !{!409, !503, !460, !409}
!689 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !690, file: !628, line: 95)
!690 = !DISubprogram(name: "strchr", scope: !625, file: !625, line: 208, type: !691, flags: DIFlagPrototyped, spFlags: 0)
!691 = !DISubroutineType(types: !692)
!692 = !{!263, !263, !19}
!693 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !694, file: !628, line: 96)
!694 = !DISubprogram(name: "strpbrk", scope: !625, file: !625, line: 285, type: !695, flags: DIFlagPrototyped, spFlags: 0)
!695 = !DISubroutineType(types: !696)
!696 = !{!263, !263, !263}
!697 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !698, file: !628, line: 97)
!698 = !DISubprogram(name: "strrchr", scope: !625, file: !625, line: 235, type: !691, flags: DIFlagPrototyped, spFlags: 0)
!699 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !14, entity: !700, file: !628, line: 98)
!700 = !DISubprogram(name: "strstr", scope: !625, file: !625, line: 312, type: !695, flags: DIFlagPrototyped, spFlags: 0)
!701 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !702, entity: !14, file: !703, line: 37)
!702 = !DINamespace(name: "pov_base", scope: null)
!703 = !DIFile(filename: "base/fileinputoutput.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!704 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !5, entity: !14, file: !705, line: 36)
!705 = !DIFile(filename: "./pov_mem.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!706 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !5, entity: !14, file: !4, line: 78)
!707 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !5, entity: !14, file: !708, line: 36)
!708 = !DIFile(filename: "./atmosph.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!709 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !5, entity: !14, file: !710, line: 36)
!710 = !DIFile(filename: "./camera.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!711 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !5, entity: !14, file: !712, line: 37)
!712 = !DIFile(filename: "./bbox.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!713 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !5, entity: !14, file: !714, line: 39)
!714 = !DIFile(filename: "./vlbuffer.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!715 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !5, entity: !14, file: !716, line: 38)
!716 = !DIFile(filename: "./point.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!717 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !5, entity: !14, file: !718, line: 38)
!718 = !DIFile(filename: "./media.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!719 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !5, entity: !14, file: !720, line: 36)
!720 = !DIFile(filename: "./render.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!721 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !5, entity: !14, file: !722, line: 36)
!722 = !DIFile(filename: "./userio.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!723 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !5, entity: !14, file: !724, line: 36)
!724 = !DIFile(filename: "./csg.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!725 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !5, entity: !14, file: !726, line: 37)
!726 = !DIFile(filename: "./lightgrp.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!727 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !5, entity: !14, file: !728, line: 48)
!728 = !DIFile(filename: "./povray.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!729 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !5, entity: !702, file: !728, line: 50)
!730 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !5, entity: !14, file: !728, line: 485)
!731 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !5, entity: !14, file: !732, line: 37)
!732 = !DIFile(filename: "./vector.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!733 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !5, entity: !14, file: !734, line: 35)
!734 = !DIFile(filename: "./fractal.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!735 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !5, entity: !14, file: !736, line: 35)
!736 = !DIFile(filename: "./quatern.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!737 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !5, entity: !14, file: !738, line: 36)
!738 = !DIFile(filename: "./spheres.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!739 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !5, entity: !14, file: !1, line: 42)
!740 = !{i32 7, !"Dwarf Version", i32 4}
!741 = !{i32 2, !"Debug Info Version", i32 3}
!742 = !{i32 1, !"wchar_size", i32 4}
!743 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!744 = distinct !DISubprogram(name: "Iteration_z3", linkageName: "_ZN3pov12Iteration_z3EPdPNS_14Fractal_StructE", scope: !5, file: !1, line: 110, type: !745, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !842)
!745 = !DISubroutineType(types: !746)
!746 = !{!19, !67, !747}
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "FRACTAL", scope: !5, file: !734, line: 76, baseType: !749)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Fractal_Struct", scope: !5, file: !734, line: 84, size: 2560, flags: DIFlagTypePassByValue, elements: !750, identifier: "_ZTSN3pov14Fractal_StructE")
!750 = !{!751, !755, !756, !760, !764, !765, !769, !770, !771, !775, !786, !790, !791, !792, !793, !796, !800, !801, !802, !803, !804, !805, !806, !807, !808, !814, !819, !822, !827, !835, !841}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !749, file: !734, line: 86, baseType: !752, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "METHODS", scope: !5, file: !4, line: 1432, baseType: !754)
!754 = !DICompositeType(tag: DW_TAG_structure_type, name: "Method_Struct", scope: !5, file: !4, line: 1517, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov13Method_StructE")
!755 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !749, file: !734, line: 86, baseType: !19, size: 32, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !749, file: !734, line: 86, baseType: !757, size: 64, offset: 128)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !5, file: !4, line: 678, baseType: !759)
!759 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !5, file: !4, line: 1535, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov13Object_StructE")
!760 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !749, file: !734, line: 86, baseType: !761, size: 64, offset: 192)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXTURE", scope: !5, file: !4, line: 1035, baseType: !763)
!763 = !DICompositeType(tag: DW_TAG_structure_type, name: "Texture_Struct", scope: !5, file: !4, line: 1359, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov14Texture_StructE")
!764 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !749, file: !734, line: 86, baseType: !761, size: 64, offset: 256)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !749, file: !734, line: 86, baseType: !766, size: 64, offset: 320)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERIOR", scope: !5, file: !4, line: 1124, baseType: !768)
!768 = !DICompositeType(tag: DW_TAG_structure_type, name: "Interior_Struct", scope: !5, file: !4, line: 1126, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov15Interior_StructE")
!769 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !749, file: !734, line: 86, baseType: !757, size: 64, offset: 384)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !749, file: !734, line: 86, baseType: !757, size: 64, offset: 448)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !749, file: !734, line: 86, baseType: !772, size: 64, offset: 512)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIGHT_SOURCE", scope: !5, file: !4, line: 1041, baseType: !774)
!774 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Source_Struct", scope: !5, file: !4, line: 1580, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov19Light_Source_StructE")
!775 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !749, file: !734, line: 86, baseType: !776, size: 192, offset: 576)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", scope: !5, file: !4, line: 888, baseType: !777)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Bounding_Box_Struct", scope: !5, file: !4, line: 890, size: 192, flags: DIFlagTypePassByValue, elements: !778, identifier: "_ZTSN3pov19Bounding_Box_StructE")
!778 = !{!779, !785}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "Lower_Left", scope: !777, file: !4, line: 892, baseType: !780, size: 96)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VECT", scope: !5, file: !4, line: 886, baseType: !781)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !782, size: 96, elements: !783)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VAL", scope: !5, file: !4, line: 884, baseType: !85)
!783 = !{!784}
!784 = !DISubrange(count: 3)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "Lengths", scope: !777, file: !4, line: 892, baseType: !780, size: 96, offset: 96)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !749, file: !734, line: 86, baseType: !787, size: 64, offset: 768)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM", scope: !5, file: !4, line: 1014, baseType: !789)
!789 = !DICompositeType(tag: DW_TAG_structure_type, name: "Transform_Struct", scope: !5, file: !4, line: 1016, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov16Transform_StructE")
!790 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !749, file: !734, line: 86, baseType: !787, size: 64, offset: 832)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !749, file: !734, line: 86, baseType: !85, size: 32, offset: 896)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !749, file: !734, line: 86, baseType: !6, size: 32, offset: 928)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "Center", scope: !749, file: !734, line: 87, baseType: !794, size: 192, offset: 960)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !5, file: !4, line: 691, baseType: !795)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 192, elements: !783)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "Julia_Parm", scope: !749, file: !734, line: 88, baseType: !797, size: 256, offset: 1152)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 256, elements: !798)
!798 = !{!799}
!799 = !DISubrange(count: 4)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "Slice", scope: !749, file: !734, line: 89, baseType: !797, size: 256, offset: 1408)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "SliceDist", scope: !749, file: !734, line: 90, baseType: !26, size: 64, offset: 1664)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "Exit_Value", scope: !749, file: !734, line: 91, baseType: !26, size: 64, offset: 1728)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !749, file: !734, line: 92, baseType: !19, size: 32, offset: 1792)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "Precision", scope: !749, file: !734, line: 93, baseType: !26, size: 64, offset: 1856)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "Inverted", scope: !749, file: !734, line: 94, baseType: !19, size: 32, offset: 1920)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "Algebra", scope: !749, file: !734, line: 96, baseType: !19, size: 32, offset: 1952)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "Sub_Type", scope: !749, file: !734, line: 97, baseType: !19, size: 32, offset: 1984)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "exponent", scope: !749, file: !734, line: 98, baseType: !809, size: 128, offset: 2048)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMPLX", scope: !5, file: !734, line: 77, baseType: !810)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cmplx", scope: !5, file: !734, line: 77, size: 128, flags: DIFlagTypePassByValue, elements: !811, identifier: "_ZTSN3pov5cmplxE")
!811 = !{!812, !813}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !810, file: !734, line: 77, baseType: !26, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !810, file: !734, line: 77, baseType: !26, size: 64, offset: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Calc_Method", scope: !749, file: !734, line: 100, baseType: !815, size: 64, offset: 2176)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "NORMAL_CALC_METHOD", scope: !5, file: !734, line: 78, baseType: !816)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DISubroutineType(types: !818)
!818 = !{null, !67, !19, !747}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "Iteration_Method", scope: !749, file: !734, line: 101, baseType: !820, size: 64, offset: 2240)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "ITERATION_METHOD", scope: !5, file: !734, line: 79, baseType: !821)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "D_Iteration_Method", scope: !749, file: !734, line: 102, baseType: !823, size: 64, offset: 2304)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "D_ITERATION_METHOD", scope: !5, file: !734, line: 80, baseType: !824)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DISubroutineType(types: !826)
!826 = !{!19, !67, !747, !67}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "F_Bound_Method", scope: !749, file: !734, line: 103, baseType: !828, size: 64, offset: 2368)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "F_BOUND_METHOD", scope: !5, file: !734, line: 81, baseType: !829)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DISubroutineType(types: !831)
!831 = !{!19, !832, !747, !67, !67}
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", scope: !5, file: !4, line: 680, baseType: !834)
!834 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ray_Struct", scope: !5, file: !4, line: 1797, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov10Ray_StructE")
!835 = !DIDerivedType(tag: DW_TAG_member, name: "Complex_Function_Method", scope: !749, file: !734, line: 104, baseType: !836, size: 64, offset: 2432)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "COMPLEX_FUNCTION_METHOD", scope: !5, file: !734, line: 82, baseType: !837)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DISubroutineType(types: !839)
!839 = !{null, !840, !840}
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "Radius_Squared", scope: !749, file: !734, line: 106, baseType: !26, size: 64, offset: 2496)
!842 = !{}
!843 = !DILocalVariable(name: "point", arg: 1, scope: !744, file: !1, line: 110, type: !67)
!844 = !DILocation(line: 110, column: 25, scope: !744)
!845 = !DILocalVariable(name: "Julia", arg: 2, scope: !744, file: !1, line: 110, type: !747)
!846 = !DILocation(line: 110, column: 41, scope: !744)
!847 = !DILocalVariable(name: "i", scope: !744, file: !1, line: 112, type: !19)
!848 = !DILocation(line: 112, column: 7, scope: !744)
!849 = !DILocalVariable(name: "x", scope: !744, file: !1, line: 113, type: !26)
!850 = !DILocation(line: 113, column: 7, scope: !744)
!851 = !DILocalVariable(name: "y", scope: !744, file: !1, line: 113, type: !26)
!852 = !DILocation(line: 113, column: 10, scope: !744)
!853 = !DILocalVariable(name: "z", scope: !744, file: !1, line: 113, type: !26)
!854 = !DILocation(line: 113, column: 13, scope: !744)
!855 = !DILocalVariable(name: "w", scope: !744, file: !1, line: 113, type: !26)
!856 = !DILocation(line: 113, column: 16, scope: !744)
!857 = !DILocalVariable(name: "d", scope: !744, file: !1, line: 114, type: !26)
!858 = !DILocation(line: 114, column: 7, scope: !744)
!859 = !DILocalVariable(name: "x2", scope: !744, file: !1, line: 114, type: !26)
!860 = !DILocation(line: 114, column: 10, scope: !744)
!861 = !DILocalVariable(name: "tmp", scope: !744, file: !1, line: 114, type: !26)
!862 = !DILocation(line: 114, column: 14, scope: !744)
!863 = !DILocalVariable(name: "Exit_Value", scope: !744, file: !1, line: 115, type: !26)
!864 = !DILocation(line: 115, column: 7, scope: !744)
!865 = !DILocation(line: 117, column: 15, scope: !744)
!866 = !DILocation(line: 117, column: 13, scope: !744)
!867 = !DILocation(line: 117, column: 3, scope: !744)
!868 = !DILocation(line: 117, column: 9, scope: !744)
!869 = !DILocation(line: 118, column: 15, scope: !744)
!870 = !DILocation(line: 118, column: 13, scope: !744)
!871 = !DILocation(line: 118, column: 3, scope: !744)
!872 = !DILocation(line: 118, column: 9, scope: !744)
!873 = !DILocation(line: 119, column: 15, scope: !744)
!874 = !DILocation(line: 119, column: 13, scope: !744)
!875 = !DILocation(line: 119, column: 3, scope: !744)
!876 = !DILocation(line: 119, column: 9, scope: !744)
!877 = !DILocation(line: 120, column: 16, scope: !744)
!878 = !DILocation(line: 120, column: 23, scope: !744)
!879 = !DILocation(line: 121, column: 21, scope: !744)
!880 = !DILocation(line: 121, column: 28, scope: !744)
!881 = !DILocation(line: 121, column: 37, scope: !744)
!882 = !DILocation(line: 121, column: 36, scope: !744)
!883 = !DILocation(line: 121, column: 19, scope: !744)
!884 = !DILocation(line: 122, column: 21, scope: !744)
!885 = !DILocation(line: 122, column: 28, scope: !744)
!886 = !DILocation(line: 122, column: 37, scope: !744)
!887 = !DILocation(line: 122, column: 36, scope: !744)
!888 = !DILocation(line: 122, column: 19, scope: !744)
!889 = !DILocation(line: 123, column: 21, scope: !744)
!890 = !DILocation(line: 123, column: 28, scope: !744)
!891 = !DILocation(line: 123, column: 37, scope: !744)
!892 = !DILocation(line: 123, column: 36, scope: !744)
!893 = !DILocation(line: 123, column: 19, scope: !744)
!894 = !DILocation(line: 123, column: 40, scope: !744)
!895 = !DILocation(line: 123, column: 47, scope: !744)
!896 = !DILocation(line: 123, column: 39, scope: !744)
!897 = !DILocation(line: 120, column: 13, scope: !744)
!898 = !DILocation(line: 120, column: 3, scope: !744)
!899 = !DILocation(line: 120, column: 9, scope: !744)
!900 = !DILocation(line: 125, column: 16, scope: !744)
!901 = !DILocation(line: 125, column: 23, scope: !744)
!902 = !DILocation(line: 125, column: 14, scope: !744)
!903 = !DILocation(line: 127, column: 10, scope: !904)
!904 = distinct !DILexicalBlock(scope: !744, file: !1, line: 127, column: 3)
!905 = !DILocation(line: 127, column: 8, scope: !904)
!906 = !DILocation(line: 127, column: 15, scope: !907)
