; ModuleID = 'lathe.cpp'
source_filename = "lathe.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"struct.pov::Method_Struct" = type { i32 (%"struct.pov::Object_Struct"*, %"struct.pov::Ray_Struct"*, %"struct.pov::istack_struct"*)*, i32 (double*, %"struct.pov::Object_Struct"*)*, void (double*, %"struct.pov::Object_Struct"*, %"struct.pov::istk_entry"*)*, void (double*, %"struct.pov::Object_Struct"*, %"struct.pov::istk_entry"*)*, i8* (%"struct.pov::Object_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*)*, void (%"struct.pov::Object_Struct"*)* }
%"struct.pov::Object_Struct" = type { %"struct.pov::Method_Struct"*, i32, %"struct.pov::Object_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Interior_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Light_Source_Struct"*, %"struct.pov::Bounding_Box_Struct", %"struct.pov::Transform_Struct"*, %"struct.pov::Transform_Struct"*, float, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "Lathe_Methods", linkageName: "_ZN3povL13Lathe_MethodsE", scope: !2, file: !3, line: 176, type: !4, isLocal: true, isDefinition: true)
!2 = !DINamespace(name: "pov", scope: null)
!3 = !DIFile(filename: "lathe.cpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "METHODS", scope: !2, file: !5, line: 1432, baseType: !6)
!5 = !DIFile(filename: "./frame.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!6 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Method_Struct", scope: !2, file: !5, line: 1517, size: 704, flags: DIFlagTypePassByValue, elements: !7, identifier: "_ZTSN3pov13Method_StructE")
!7 = !{!8, !108, !114, !121, !123, !128, !133, !135, !137, !142, !147}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "All_Intersections_Method", scope: !6, file: !5, line: 1519, baseType: !9, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALL_INTERSECTIONS_METHOD", scope: !2, file: !5, line: 1434, baseType: !10)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !14, !57, !72}
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !2, file: !5, line: 678, baseType: !16)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !2, file: !5, line: 1535, size: 960, flags: DIFlagTypePassByValue, elements: !17, identifier: "_ZTSN3pov13Object_StructE")
!17 = !{!18, !20, !21, !22, !26, !27, !31, !32, !33, !37, !49, !53, !54, !55}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !16, file: !5, line: 1537, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !16, file: !5, line: 1537, baseType: !13, size: 32, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !16, file: !5, line: 1537, baseType: !14, size: 64, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !16, file: !5, line: 1537, baseType: !23, size: 64, offset: 192)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXTURE", scope: !2, file: !5, line: 1035, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "Texture_Struct", scope: !2, file: !5, line: 1359, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov14Texture_StructE")
!26 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !16, file: !5, line: 1537, baseType: !23, size: 64, offset: 256)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !16, file: !5, line: 1537, baseType: !28, size: 64, offset: 320)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERIOR", scope: !2, file: !5, line: 1124, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "Interior_Struct", scope: !2, file: !5, line: 1126, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov15Interior_StructE")
!31 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !16, file: !5, line: 1537, baseType: !14, size: 64, offset: 384)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !16, file: !5, line: 1537, baseType: !14, size: 64, offset: 448)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !16, file: !5, line: 1537, baseType: !34, size: 64, offset: 512)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIGHT_SOURCE", scope: !2, file: !5, line: 1041, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Source_Struct", scope: !2, file: !5, line: 1580, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov19Light_Source_StructE")
!37 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !16, file: !5, line: 1537, baseType: !38, size: 192, offset: 576)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", scope: !2, file: !5, line: 888, baseType: !39)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Bounding_Box_Struct", scope: !2, file: !5, line: 890, size: 192, flags: DIFlagTypePassByValue, elements: !40, identifier: "_ZTSN3pov19Bounding_Box_StructE")
!40 = !{!41, !48}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "Lower_Left", scope: !39, file: !5, line: 892, baseType: !42, size: 96)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VECT", scope: !2, file: !5, line: 886, baseType: !43)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 96, elements: !46)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VAL", scope: !2, file: !5, line: 884, baseType: !45)
!45 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!46 = !{!47}
!47 = !DISubrange(count: 3)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "Lengths", scope: !39, file: !5, line: 892, baseType: !42, size: 96, offset: 96)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !16, file: !5, line: 1537, baseType: !50, size: 64, offset: 768)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM", scope: !2, file: !5, line: 1014, baseType: !52)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "Transform_Struct", scope: !2, file: !5, line: 1016, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov16Transform_StructE")
!53 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !16, file: !5, line: 1537, baseType: !50, size: 64, offset: 832)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !16, file: !5, line: 1537, baseType: !45, size: 32, offset: 896)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !16, file: !5, line: 1537, baseType: !56, size: 32, offset: 928)
!56 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", scope: !2, file: !5, line: 680, baseType: !59)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Ray_Struct", scope: !2, file: !5, line: 1797, size: 6848, flags: DIFlagTypePassByValue, elements: !60, identifier: "_ZTSN3pov10Ray_StructE")
!60 = !{!61, !65, !66, !67, !68}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "Initial", scope: !59, file: !5, line: 1799, baseType: !62, size: 192)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !2, file: !5, line: 691, baseType: !63)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 192, elements: !46)
!64 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !59, file: !5, line: 1800, baseType: !62, size: 192, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "Index", scope: !59, file: !5, line: 1801, baseType: !13, size: 32, offset: 384)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "Optimisiation_Flags", scope: !59, file: !5, line: 1802, baseType: !56, size: 32, offset: 416)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "Interiors", scope: !59, file: !5, line: 1803, baseType: !69, size: 6400, offset: 448)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 6400, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 100)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISTACK", scope: !2, file: !5, line: 681, baseType: !74)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "istack_struct", scope: !2, file: !5, line: 1635, size: 192, flags: DIFlagTypePassByValue, elements: !75, identifier: "_ZTSN3pov13istack_structE")
!75 = !{!76, !78, !106, !107}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !74, file: !5, line: 1637, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "istack", scope: !74, file: !5, line: 1638, baseType: !79, size: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "istk_entry", scope: !2, file: !5, line: 1610, size: 1600, flags: DIFlagTypePassByValue, elements: !81, identifier: "_ZTSN3pov10istk_entryE")
!81 = !{!82, !83, !84, !85, !86, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !105}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "Depth", scope: !80, file: !5, line: 1612, baseType: !64, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "IPoint", scope: !80, file: !5, line: 1613, baseType: !62, size: 192, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "INormal", scope: !80, file: !5, line: 1614, baseType: !62, size: 192, offset: 256)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "PNormal", scope: !80, file: !5, line: 1615, baseType: !62, size: 192, offset: 448)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "Iuv", scope: !80, file: !5, line: 1616, baseType: !87, size: 128, offset: 640)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !2, file: !5, line: 690, baseType: !88)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 128, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 2)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !80, file: !5, line: 1617, baseType: !14, size: 64, offset: 768)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "i1", scope: !80, file: !5, line: 1624, baseType: !13, size: 32, offset: 832)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "i2", scope: !80, file: !5, line: 1624, baseType: !13, size: 32, offset: 864)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !80, file: !5, line: 1625, baseType: !64, size: 64, offset: 896)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !80, file: !5, line: 1625, baseType: !64, size: 64, offset: 960)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !80, file: !5, line: 1626, baseType: !64, size: 64, offset: 1024)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !80, file: !5, line: 1626, baseType: !64, size: 64, offset: 1088)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !80, file: !5, line: 1627, baseType: !64, size: 64, offset: 1152)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "d4", scope: !80, file: !5, line: 1627, baseType: !64, size: 64, offset: 1216)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !80, file: !5, line: 1628, baseType: !64, size: 64, offset: 1280)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !80, file: !5, line: 1628, baseType: !64, size: 64, offset: 1344)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !80, file: !5, line: 1628, baseType: !64, size: 64, offset: 1408)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "Pointer", scope: !80, file: !5, line: 1630, baseType: !104, size: 64, offset: 1472)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "Csg", scope: !80, file: !5, line: 1632, baseType: !104, size: 64, offset: 1536)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !74, file: !5, line: 1639, baseType: !56, size: 32, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "top_entry", scope: !74, file: !5, line: 1640, baseType: !56, size: 32, offset: 160)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "Inside_Method", scope: !6, file: !5, line: 1520, baseType: !109, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "INSIDE_METHOD", scope: !2, file: !5, line: 1435, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!13, !113, !14}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Method", scope: !6, file: !5, line: 1521, baseType: !115, size: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "NORMAL_METHOD", scope: !2, file: !5, line: 1436, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{null, !113, !14, !119}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERSECTION", scope: !2, file: !5, line: 682, baseType: !80)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "UVCoord_Method", scope: !6, file: !5, line: 1522, baseType: !122, size: 64, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "UVCOORD_METHOD", scope: !2, file: !5, line: 1437, baseType: !116)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "Copy_Method", scope: !6, file: !5, line: 1523, baseType: !124, size: 64, offset: 256)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "COPY_METHOD", scope: !2, file: !5, line: 1438, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!104, !14}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "Translate_Method", scope: !6, file: !5, line: 1524, baseType: !129, size: 64, offset: 320)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSLATE_METHOD", scope: !2, file: !5, line: 1439, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !14, !113, !50}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "Rotate_Method", scope: !6, file: !5, line: 1525, baseType: !134, size: 64, offset: 384)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "ROTATE_METHOD", scope: !2, file: !5, line: 1440, baseType: !130)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "Scale_Method", scope: !6, file: !5, line: 1526, baseType: !136, size: 64, offset: 448)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCALE_METHOD", scope: !2, file: !5, line: 1441, baseType: !130)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "Transform_Method", scope: !6, file: !5, line: 1527, baseType: !138, size: 64, offset: 512)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM_METHOD", scope: !2, file: !5, line: 1442, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{null, !14, !50}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "Invert_Method", scope: !6, file: !5, line: 1528, baseType: !143, size: 64, offset: 576)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "INVERT_METHOD", scope: !2, file: !5, line: 1443, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{null, !14}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy_Method", scope: !6, file: !5, line: 1529, baseType: !148, size: 64, offset: 640)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "DESTROY_METHOD", scope: !2, file: !5, line: 1444, baseType: !144)
!149 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !150, retainedTypes: !288, globals: !360, imports: !364, splitDebugInlining: false, nameTableKind: None)
!150 = !{!151, !157, !284}
!151 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !2, file: !5, line: 706, baseType: !56, size: 32, elements: !152)
!152 = !{!153, !154, !155, !156}
!153 = !DIEnumerator(name: "X", value: 0, isUnsigned: true)
!154 = !DIEnumerator(name: "Y", value: 1, isUnsigned: true)
!155 = !DIEnumerator(name: "Z", value: 2, isUnsigned: true)
!156 = !DIEnumerator(name: "T", value: 3, isUnsigned: true)
!157 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "STATS", scope: !2, file: !158, line: 149, baseType: !56, size: 32, elements: !159, identifier: "_ZTSN3pov5STATSE")
!158 = !DIFile(filename: "./povray.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!159 = !{!160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283}
!160 = !DIEnumerator(name: "Number_Of_Pixels", value: 0, isUnsigned: true)
!161 = !DIEnumerator(name: "Number_Of_Pixels_Supersampled", value: 1, isUnsigned: true)
!162 = !DIEnumerator(name: "Number_Of_Samples", value: 2, isUnsigned: true)
!163 = !DIEnumerator(name: "Number_Of_Rays", value: 3, isUnsigned: true)
!164 = !DIEnumerator(name: "Calls_To_DNoise", value: 4, isUnsigned: true)
!165 = !DIEnumerator(name: "Calls_To_Noise", value: 5, isUnsigned: true)
!166 = !DIEnumerator(name: "ADC_Saves", value: 6, isUnsigned: true)
!167 = !DIEnumerator(name: "Istack_overflows", value: 7, isUnsigned: true)
!168 = !DIEnumerator(name: "Ray_RBezier_Tests", value: 8, isUnsigned: true)
!169 = !DIEnumerator(name: "Ray_RBezier_Tests_Succeeded", value: 9, isUnsigned: true)
!170 = !DIEnumerator(name: "Ray_Bicubic_Tests", value: 10, isUnsigned: true)
!171 = !DIEnumerator(name: "Ray_Bicubic_Tests_Succeeded", value: 11, isUnsigned: true)
!172 = !DIEnumerator(name: "Ray_Blob_Tests", value: 12, isUnsigned: true)
!173 = !DIEnumerator(name: "Ray_Blob_Tests_Succeeded", value: 13, isUnsigned: true)
!174 = !DIEnumerator(name: "Blob_Element_Tests", value: 14, isUnsigned: true)
!175 = !DIEnumerator(name: "Blob_Element_Tests_Succeeded", value: 15, isUnsigned: true)
!176 = !DIEnumerator(name: "Blob_Bound_Tests", value: 16, isUnsigned: true)
!177 = !DIEnumerator(name: "Blob_Bound_Tests_Succeeded", value: 17, isUnsigned: true)
!178 = !DIEnumerator(name: "Ray_Box_Tests", value: 18, isUnsigned: true)
!179 = !DIEnumerator(name: "Ray_Box_Tests_Succeeded", value: 19, isUnsigned: true)
!180 = !DIEnumerator(name: "Ray_Cone_Tests", value: 20, isUnsigned: true)
!181 = !DIEnumerator(name: "Ray_Cone_Tests_Succeeded", value: 21, isUnsigned: true)
!182 = !DIEnumerator(name: "Ray_CSG_Intersection_Tests", value: 22, isUnsigned: true)
!183 = !DIEnumerator(name: "Ray_CSG_Intersection_Tests_Succeeded", value: 23, isUnsigned: true)
!184 = !DIEnumerator(name: "Ray_CSG_Merge_Tests", value: 24, isUnsigned: true)
!185 = !DIEnumerator(name: "Ray_CSG_Merge_Tests_Succeeded", value: 25, isUnsigned: true)
!186 = !DIEnumerator(name: "Ray_CSG_Union_Tests", value: 26, isUnsigned: true)
!187 = !DIEnumerator(name: "Ray_CSG_Union_Tests_Succeeded", value: 27, isUnsigned: true)
!188 = !DIEnumerator(name: "Ray_Disc_Tests", value: 28, isUnsigned: true)
!189 = !DIEnumerator(name: "Ray_Disc_Tests_Succeeded", value: 29, isUnsigned: true)
!190 = !DIEnumerator(name: "Ray_Fractal_Tests", value: 30, isUnsigned: true)
!191 = !DIEnumerator(name: "Ray_Fractal_Tests_Succeeded", value: 31, isUnsigned: true)
!192 = !DIEnumerator(name: "Ray_HField_Tests", value: 32, isUnsigned: true)
!193 = !DIEnumerator(name: "Ray_HField_Tests_Succeeded", value: 33, isUnsigned: true)
!194 = !DIEnumerator(name: "Ray_HField_Box_Tests", value: 34, isUnsigned: true)
!195 = !DIEnumerator(name: "Ray_HField_Box_Tests_Succeeded", value: 35, isUnsigned: true)
!196 = !DIEnumerator(name: "Ray_HField_Triangle_Tests", value: 36, isUnsigned: true)
!197 = !DIEnumerator(name: "Ray_HField_Triangle_Tests_Succeeded", value: 37, isUnsigned: true)
!198 = !DIEnumerator(name: "Ray_HField_Block_Tests", value: 38, isUnsigned: true)
!199 = !DIEnumerator(name: "Ray_HField_Block_Tests_Succeeded", value: 39, isUnsigned: true)
!200 = !DIEnumerator(name: "Ray_HField_Cell_Tests", value: 40, isUnsigned: true)
!201 = !DIEnumerator(name: "Ray_HField_Cell_Tests_Succeeded", value: 41, isUnsigned: true)
!202 = !DIEnumerator(name: "Ray_IsoSurface_Tests", value: 42, isUnsigned: true)
!203 = !DIEnumerator(name: "Ray_IsoSurface_Tests_Succeeded", value: 43, isUnsigned: true)
!204 = !DIEnumerator(name: "Ray_IsoSurface_Bound_Tests", value: 44, isUnsigned: true)
!205 = !DIEnumerator(name: "Ray_IsoSurface_Bound_Tests_Succeeded", value: 45, isUnsigned: true)
!206 = !DIEnumerator(name: "Ray_IsoSurface_Cache", value: 46, isUnsigned: true)
!207 = !DIEnumerator(name: "Ray_IsoSurface_Cache_Succeeded", value: 47, isUnsigned: true)
!208 = !DIEnumerator(name: "Ray_Lathe_Tests", value: 48, isUnsigned: true)
!209 = !DIEnumerator(name: "Ray_Lathe_Tests_Succeeded", value: 49, isUnsigned: true)
!210 = !DIEnumerator(name: "Lathe_Bound_Tests", value: 50, isUnsigned: true)
!211 = !DIEnumerator(name: "Lathe_Bound_Tests_Succeeded", value: 51, isUnsigned: true)
!212 = !DIEnumerator(name: "Ray_Mesh_Tests", value: 52, isUnsigned: true)
!213 = !DIEnumerator(name: "Ray_Mesh_Tests_Succeeded", value: 53, isUnsigned: true)
!214 = !DIEnumerator(name: "Ray_Plane_Tests", value: 54, isUnsigned: true)
!215 = !DIEnumerator(name: "Ray_Plane_Tests_Succeeded", value: 55, isUnsigned: true)
!216 = !DIEnumerator(name: "Ray_Polygon_Tests", value: 56, isUnsigned: true)
!217 = !DIEnumerator(name: "Ray_Polygon_Tests_Succeeded", value: 57, isUnsigned: true)
!218 = !DIEnumerator(name: "Ray_Prism_Tests", value: 58, isUnsigned: true)
!219 = !DIEnumerator(name: "Ray_Prism_Tests_Succeeded", value: 59, isUnsigned: true)
!220 = !DIEnumerator(name: "Prism_Bound_Tests", value: 60, isUnsigned: true)
!221 = !DIEnumerator(name: "Prism_Bound_Tests_Succeeded", value: 61, isUnsigned: true)
!222 = !DIEnumerator(name: "Ray_Parametric_Tests", value: 62, isUnsigned: true)
!223 = !DIEnumerator(name: "Ray_Parametric_Tests_Succeeded", value: 63, isUnsigned: true)
!224 = !DIEnumerator(name: "Ray_Par_Bound_Tests", value: 64, isUnsigned: true)
!225 = !DIEnumerator(name: "Ray_Par_Bound_Tests_Succeeded", value: 65, isUnsigned: true)
!226 = !DIEnumerator(name: "Ray_Quadric_Tests", value: 66, isUnsigned: true)
!227 = !DIEnumerator(name: "Ray_Quadric_Tests_Succeeded", value: 67, isUnsigned: true)
!228 = !DIEnumerator(name: "Ray_Poly_Tests", value: 68, isUnsigned: true)
!229 = !DIEnumerator(name: "Ray_Poly_Tests_Succeeded", value: 69, isUnsigned: true)
!230 = !DIEnumerator(name: "Ray_Sphere_Tests", value: 70, isUnsigned: true)
!231 = !DIEnumerator(name: "Ray_Sphere_Tests_Succeeded", value: 71, isUnsigned: true)
!232 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests", value: 72, isUnsigned: true)
!233 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests_Succeeded", value: 73, isUnsigned: true)
!234 = !DIEnumerator(name: "Ray_Superellipsoid_Tests", value: 74, isUnsigned: true)
!235 = !DIEnumerator(name: "Ray_Superellipsoid_Tests_Succeeded", value: 75, isUnsigned: true)
!236 = !DIEnumerator(name: "Ray_Sor_Tests", value: 76, isUnsigned: true)
!237 = !DIEnumerator(name: "Ray_Sor_Tests_Succeeded", value: 77, isUnsigned: true)
!238 = !DIEnumerator(name: "Sor_Bound_Tests", value: 78, isUnsigned: true)
!239 = !DIEnumerator(name: "Sor_Bound_Tests_Succeeded", value: 79, isUnsigned: true)
!240 = !DIEnumerator(name: "Ray_Torus_Tests", value: 80, isUnsigned: true)
!241 = !DIEnumerator(name: "Ray_Torus_Tests_Succeeded", value: 81, isUnsigned: true)
!242 = !DIEnumerator(name: "Torus_Bound_Tests", value: 82, isUnsigned: true)
!243 = !DIEnumerator(name: "Torus_Bound_Tests_Succeeded", value: 83, isUnsigned: true)
!244 = !DIEnumerator(name: "Ray_Triangle_Tests", value: 84, isUnsigned: true)
!245 = !DIEnumerator(name: "Ray_Triangle_Tests_Succeeded", value: 85, isUnsigned: true)
!246 = !DIEnumerator(name: "Ray_TTF_Tests", value: 86, isUnsigned: true)
!247 = !DIEnumerator(name: "Ray_TTF_Tests_Succeeded", value: 87, isUnsigned: true)
!248 = !DIEnumerator(name: "Bounding_Region_Tests", value: 88, isUnsigned: true)
!249 = !DIEnumerator(name: "Bounding_Region_Tests_Succeeded", value: 89, isUnsigned: true)
!250 = !DIEnumerator(name: "Clipping_Region_Tests", value: 90, isUnsigned: true)
!251 = !DIEnumerator(name: "Clipping_Region_Tests_Succeeded", value: 91, isUnsigned: true)
!252 = !DIEnumerator(name: "Ray_IsoSurface_Find_Root", value: 92, isUnsigned: true)
!253 = !DIEnumerator(name: "Ray_Function_VM_Calls", value: 93, isUnsigned: true)
!254 = !DIEnumerator(name: "Ray_Function_VM_Instruction_Est", value: 94, isUnsigned: true)
!255 = !DIEnumerator(name: "VBuffer_Tests", value: 95, isUnsigned: true)
!256 = !DIEnumerator(name: "VBuffer_Tests_Succeeded", value: 96, isUnsigned: true)
!257 = !DIEnumerator(name: "LBuffer_Tests", value: 97, isUnsigned: true)
!258 = !DIEnumerator(name: "LBuffer_Tests_Succeeded", value: 98, isUnsigned: true)
!259 = !DIEnumerator(name: "Media_Samples", value: 99, isUnsigned: true)
!260 = !DIEnumerator(name: "Media_Intervals", value: 100, isUnsigned: true)
!261 = !DIEnumerator(name: "Reflected_Rays_Traced", value: 101, isUnsigned: true)
!262 = !DIEnumerator(name: "Refracted_Rays_Traced", value: 102, isUnsigned: true)
!263 = !DIEnumerator(name: "Transmitted_Rays_Traced", value: 103, isUnsigned: true)
!264 = !DIEnumerator(name: "Internal_Reflected_Rays_Traced", value: 104, isUnsigned: true)
!265 = !DIEnumerator(name: "Shadow_Cache_Hits", value: 105, isUnsigned: true)
!266 = !DIEnumerator(name: "Shadow_Rays_Succeeded", value: 106, isUnsigned: true)
!267 = !DIEnumerator(name: "Shadow_Ray_Tests", value: 107, isUnsigned: true)
!268 = !DIEnumerator(name: "nChecked", value: 108, isUnsigned: true)
!269 = !DIEnumerator(name: "nEnqueued", value: 109, isUnsigned: true)
!270 = !DIEnumerator(name: "totalQueues", value: 110, isUnsigned: true)
!271 = !DIEnumerator(name: "totalQueueResets", value: 111, isUnsigned: true)
!272 = !DIEnumerator(name: "totalQueueResizes", value: 112, isUnsigned: true)
!273 = !DIEnumerator(name: "Polynomials_Tested", value: 113, isUnsigned: true)
!274 = !DIEnumerator(name: "Roots_Eliminated", value: 114, isUnsigned: true)
!275 = !DIEnumerator(name: "Number_Of_Photons_Shot", value: 115, isUnsigned: true)
!276 = !DIEnumerator(name: "Number_Of_Photons_Stored", value: 116, isUnsigned: true)
!277 = !DIEnumerator(name: "Number_Of_Global_Photons_Stored", value: 117, isUnsigned: true)
!278 = !DIEnumerator(name: "Number_Of_Media_Photons_Stored", value: 118, isUnsigned: true)
!279 = !DIEnumerator(name: "Priority_Queue_Add", value: 119, isUnsigned: true)
!280 = !DIEnumerator(name: "Priority_Queue_Remove", value: 120, isUnsigned: true)
!281 = !DIEnumerator(name: "Gather_Performed_Count", value: 121, isUnsigned: true)
!282 = !DIEnumerator(name: "Gather_Expanded_Count", value: 122, isUnsigned: true)
!283 = !DIEnumerator(name: "MaxStat", value: 123, isUnsigned: true)
!284 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !2, file: !5, line: 700, baseType: !56, size: 32, elements: !285)
!285 = !{!286, !287}
!286 = !DIEnumerator(name: "U", value: 0, isUnsigned: true)
!287 = !DIEnumerator(name: "V", value: 1, isUnsigned: true)
!288 = !{!289, !311, !317, !113, !104, !14, !64, !44}
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "LATHE", scope: !2, file: !291, line: 60, baseType: !292)
!291 = !DIFile(filename: "./lathe.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Lathe_Struct", scope: !2, file: !291, line: 76, size: 1344, flags: DIFlagTypePassByValue, elements: !293, identifier: "_ZTSN3pov12Lathe_StructE")
!293 = !{!294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !356, !357, !358, !359}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !292, file: !291, line: 78, baseType: !19, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !292, file: !291, line: 78, baseType: !13, size: 32, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !292, file: !291, line: 78, baseType: !14, size: 64, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !292, file: !291, line: 78, baseType: !23, size: 64, offset: 192)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !292, file: !291, line: 78, baseType: !23, size: 64, offset: 256)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !292, file: !291, line: 78, baseType: !28, size: 64, offset: 320)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !292, file: !291, line: 78, baseType: !14, size: 64, offset: 384)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !292, file: !291, line: 78, baseType: !14, size: 64, offset: 448)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !292, file: !291, line: 78, baseType: !34, size: 64, offset: 512)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !292, file: !291, line: 78, baseType: !38, size: 192, offset: 576)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !292, file: !291, line: 78, baseType: !50, size: 64, offset: 768)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !292, file: !291, line: 78, baseType: !50, size: 64, offset: 832)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !292, file: !291, line: 78, baseType: !45, size: 32, offset: 896)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !292, file: !291, line: 78, baseType: !56, size: 32, offset: 928)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "Spline_Type", scope: !292, file: !291, line: 79, baseType: !13, size: 32, offset: 960)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "Number", scope: !292, file: !291, line: 80, baseType: !13, size: 32, offset: 992)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "Spline", scope: !292, file: !291, line: 81, baseType: !311, size: 64, offset: 1024)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "LATHE_SPLINE", scope: !2, file: !291, line: 61, baseType: !313)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Lathe_Spline_Struct", scope: !2, file: !291, line: 69, size: 192, flags: DIFlagTypePassByValue, elements: !314, identifier: "_ZTSN3pov19Lathe_Spline_StructE")
!314 = !{!315, !316, !325}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "References", scope: !313, file: !291, line: 71, baseType: !13, size: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "Entry", scope: !313, file: !291, line: 72, baseType: !317, size: 64, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "LATHE_SPLINE_ENTRY", scope: !2, file: !291, line: 62, baseType: !319)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Lathe_Spline_Entry_Struct", scope: !2, file: !291, line: 64, size: 512, flags: DIFlagTypePassByValue, elements: !320, identifier: "_ZTSN3pov25Lathe_Spline_Entry_StructE")
!320 = !{!321, !322, !323, !324}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !319, file: !291, line: 66, baseType: !87, size: 128)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !319, file: !291, line: 66, baseType: !87, size: 128, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !319, file: !291, line: 66, baseType: !87, size: 128, offset: 256)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "D", scope: !319, file: !291, line: 66, baseType: !87, size: 128, offset: 384)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "BCyl", scope: !313, file: !291, line: 73, baseType: !326, size: 64, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "BCYL", scope: !2, file: !328, line: 50, baseType: !329)
!328 = !DIFile(filename: "./bcyl.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BCyl_Struct", scope: !2, file: !328, line: 67, size: 448, flags: DIFlagTypePassByValue, elements: !330, identifier: "_ZTSN3pov11BCyl_StructE")
!330 = !{!331, !332, !334, !335, !336, !337, !345, !346, !347}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !329, file: !328, line: 69, baseType: !13, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "nradius", scope: !329, file: !328, line: 70, baseType: !333, size: 16, offset: 32)
!333 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "nheight", scope: !329, file: !328, line: 71, baseType: !333, size: 16, offset: 48)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !329, file: !328, line: 72, baseType: !113, size: 64, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !329, file: !328, line: 73, baseType: !113, size: 64, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "rint", scope: !329, file: !328, line: 74, baseType: !338, size: 64, offset: 192)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "BCYL_INT", scope: !2, file: !328, line: 52, baseType: !340)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BCyl_Intersection_Struct", scope: !2, file: !328, line: 54, size: 320, flags: DIFlagTypePassByValue, elements: !341, identifier: "_ZTSN3pov24BCyl_Intersection_StructE")
!341 = !{!342, !343, !344}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !340, file: !328, line: 56, baseType: !13, size: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !340, file: !328, line: 57, baseType: !88, size: 128, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !340, file: !328, line: 58, baseType: !88, size: 128, offset: 192)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "hint", scope: !329, file: !328, line: 75, baseType: !338, size: 64, offset: 256)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "intervals", scope: !329, file: !328, line: 76, baseType: !338, size: 64, offset: 320)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !329, file: !328, line: 77, baseType: !348, size: 64, offset: 384)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "BCYL_ENTRY", scope: !2, file: !328, line: 51, baseType: !350)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BCyl_Entry_Struct", scope: !2, file: !328, line: 61, size: 64, flags: DIFlagTypePassByValue, elements: !351, identifier: "_ZTSN3pov17BCyl_Entry_StructE")
!351 = !{!352, !353, !354, !355}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "r1", scope: !350, file: !328, line: 63, baseType: !333, size: 16)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "r2", scope: !350, file: !328, line: 63, baseType: !333, size: 16, offset: 16)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "h1", scope: !350, file: !328, line: 64, baseType: !333, size: 16, offset: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "h2", scope: !350, file: !328, line: 64, baseType: !333, size: 16, offset: 48)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "Height1", scope: !292, file: !291, line: 82, baseType: !64, size: 64, offset: 1088)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "Height2", scope: !292, file: !291, line: 82, baseType: !64, size: 64, offset: 1152)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "Radius1", scope: !292, file: !291, line: 83, baseType: !64, size: 64, offset: 1216)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "Radius2", scope: !292, file: !291, line: 83, baseType: !64, size: 64, offset: 1280)
!360 = !{!0, !361}
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression(DW_OP_constu, 4547007122018943789, DW_OP_stack_value))
!362 = distinct !DIGlobalVariable(name: "DEPTH_TOLERANCE", scope: !2, file: !3, line: 138, type: !363, isLocal: true, isDefinition: true)
!363 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!364 = !{!365, !372, !378, !380, !382, !386, !388, !390, !392, !394, !396, !398, !400, !405, !409, !411, !413, !417, !419, !421, !423, !425, !427, !429, !432, !434, !436, !440, !445, !447, !449, !451, !453, !455, !457, !459, !461, !463, !465, !469, !473, !475, !477, !479, !481, !483, !485, !487, !489, !491, !493, !495, !497, !499, !501, !503, !507, !511, !515, !517, !519, !521, !523, !525, !527, !529, !531, !533, !537, !541, !545, !547, !549, !551, !556, !560, !564, !566, !568, !570, !572, !574, !576, !578, !580, !582, !584, !586, !588, !593, !597, !601, !603, !605, !607, !614, !618, !622, !624, !626, !628, !630, !632, !634, !638, !642, !644, !646, !648, !650, !654, !658, !662, !664, !666, !668, !670, !672, !674, !678, !682, !686, !688, !692, !696, !698, !700, !702, !704, !706, !708, !714, !719, !723, !729, !733, !738, !740, !742, !746, !750, !763, !767, !771, !775, !779, !784, !788, !792, !796, !800, !808, !812, !816, !818, !822, !826, !830, !836, !840, !844, !846, !854, !858, !865, !867, !871, !875, !879, !883, !888, !892, !896, !897, !898, !899, !901, !902, !903, !904, !905, !906, !907, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !944, !946, !948, !950, !952, !954, !956, !958, !960, !962, !964, !966, !968, !970, !976, !980, !986, !990, !994, !998, !1002, !1004, !1006, !1010, !1014, !1018, !1022, !1026, !1028, !1030, !1032, !1036, !1040, !1044, !1046, !1048, !1051, !1053, !1054, !1056, !1058, !1060, !1062, !1064, !1066, !1068, !1070, !1072, !1074, !1075, !1076, !1077, !1079, !1080, !1081, !1083, !1085, !1087, !1089, !1093, !1149, !1153}
!365 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !367, file: !371, line: 52)
!366 = !DINamespace(name: "std", scope: null)
!367 = !DISubprogram(name: "abs", scope: !368, file: !368, line: 840, type: !369, flags: DIFlagPrototyped, spFlags: 0)
!368 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!369 = !DISubroutineType(types: !370)
!370 = !{!13, !13}
!371 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/std_abs.h", directory: "")
!372 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !373, file: !377, line: 83)
!373 = !DISubprogram(name: "acos", scope: !374, file: !374, line: 53, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!374 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/mathcalls.h", directory: "")
!375 = !DISubroutineType(types: !376)
!376 = !{!64, !64}
!377 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cmath", directory: "")
!378 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !379, file: !377, line: 102)
!379 = !DISubprogram(name: "asin", scope: !374, file: !374, line: 55, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!380 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !381, file: !377, line: 121)
!381 = !DISubprogram(name: "atan", scope: !374, file: !374, line: 57, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!382 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !383, file: !377, line: 140)
!383 = !DISubprogram(name: "atan2", scope: !374, file: !374, line: 59, type: !384, flags: DIFlagPrototyped, spFlags: 0)
!384 = !DISubroutineType(types: !385)
!385 = !{!64, !64, !64}
!386 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !387, file: !377, line: 161)
!387 = !DISubprogram(name: "ceil", scope: !374, file: !374, line: 159, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!388 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !389, file: !377, line: 180)
!389 = !DISubprogram(name: "cos", scope: !374, file: !374, line: 62, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!390 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !391, file: !377, line: 199)
!391 = !DISubprogram(name: "cosh", scope: !374, file: !374, line: 71, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!392 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !393, file: !377, line: 218)
!393 = !DISubprogram(name: "exp", scope: !374, file: !374, line: 95, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!394 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !395, file: !377, line: 237)
!395 = !DISubprogram(name: "fabs", scope: !374, file: !374, line: 162, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!396 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !397, file: !377, line: 256)
!397 = !DISubprogram(name: "floor", scope: !374, file: !374, line: 165, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!398 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !399, file: !377, line: 275)
!399 = !DISubprogram(name: "fmod", scope: !374, file: !374, line: 168, type: !384, flags: DIFlagPrototyped, spFlags: 0)
!400 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !401, file: !377, line: 296)
!401 = !DISubprogram(name: "frexp", scope: !374, file: !374, line: 98, type: !402, flags: DIFlagPrototyped, spFlags: 0)
!402 = !DISubroutineType(types: !403)
!403 = !{!64, !64, !404}
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!405 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !406, file: !377, line: 315)
!406 = !DISubprogram(name: "ldexp", scope: !374, file: !374, line: 101, type: !407, flags: DIFlagPrototyped, spFlags: 0)
!407 = !DISubroutineType(types: !408)
!408 = !{!64, !64, !13}
!409 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !410, file: !377, line: 334)
!410 = !DISubprogram(name: "log", scope: !374, file: !374, line: 104, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!411 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !412, file: !377, line: 353)
!412 = !DISubprogram(name: "log10", scope: !374, file: !374, line: 107, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!413 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !414, file: !377, line: 372)
!414 = !DISubprogram(name: "modf", scope: !374, file: !374, line: 110, type: !415, flags: DIFlagPrototyped, spFlags: 0)
!415 = !DISubroutineType(types: !416)
!416 = !{!64, !64, !113}
!417 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !418, file: !377, line: 384)
!418 = !DISubprogram(name: "pow", scope: !374, file: !374, line: 140, type: !384, flags: DIFlagPrototyped, spFlags: 0)
!419 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !420, file: !377, line: 421)
!420 = !DISubprogram(name: "sin", scope: !374, file: !374, line: 64, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!421 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !422, file: !377, line: 440)
!422 = !DISubprogram(name: "sinh", scope: !374, file: !374, line: 73, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!423 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !424, file: !377, line: 459)
!424 = !DISubprogram(name: "sqrt", scope: !374, file: !374, line: 143, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!425 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !426, file: !377, line: 478)
!426 = !DISubprogram(name: "tan", scope: !374, file: !374, line: 66, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!427 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !428, file: !377, line: 497)
!428 = !DISubprogram(name: "tanh", scope: !374, file: !374, line: 75, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!429 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !430, file: !377, line: 1065)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_t", file: !431, line: 150, baseType: !64)
!431 = !DIFile(filename: "/usr/include/math.h", directory: "")
!432 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !433, file: !377, line: 1066)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "float_t", file: !431, line: 149, baseType: !45)
!434 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !435, file: !377, line: 1069)
!435 = !DISubprogram(name: "acosh", scope: !374, file: !374, line: 85, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!436 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !437, file: !377, line: 1070)
!437 = !DISubprogram(name: "acoshf", scope: !374, file: !374, line: 85, type: !438, flags: DIFlagPrototyped, spFlags: 0)
!438 = !DISubroutineType(types: !439)
!439 = !{!45, !45}
!440 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !441, file: !377, line: 1071)
!441 = !DISubprogram(name: "acoshl", scope: !374, file: !374, line: 85, type: !442, flags: DIFlagPrototyped, spFlags: 0)
!442 = !DISubroutineType(types: !443)
!443 = !{!444, !444}
!444 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!445 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !446, file: !377, line: 1073)
!446 = !DISubprogram(name: "asinh", scope: !374, file: !374, line: 87, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!447 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !448, file: !377, line: 1074)
!448 = !DISubprogram(name: "asinhf", scope: !374, file: !374, line: 87, type: !438, flags: DIFlagPrototyped, spFlags: 0)
!449 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !450, file: !377, line: 1075)
!450 = !DISubprogram(name: "asinhl", scope: !374, file: !374, line: 87, type: !442, flags: DIFlagPrototyped, spFlags: 0)
!451 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !452, file: !377, line: 1077)
!452 = !DISubprogram(name: "atanh", scope: !374, file: !374, line: 89, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!453 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !454, file: !377, line: 1078)
!454 = !DISubprogram(name: "atanhf", scope: !374, file: !374, line: 89, type: !438, flags: DIFlagPrototyped, spFlags: 0)
!455 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !456, file: !377, line: 1079)
!456 = !DISubprogram(name: "atanhl", scope: !374, file: !374, line: 89, type: !442, flags: DIFlagPrototyped, spFlags: 0)
!457 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !458, file: !377, line: 1081)
!458 = !DISubprogram(name: "cbrt", scope: !374, file: !374, line: 152, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!459 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !460, file: !377, line: 1082)
!460 = !DISubprogram(name: "cbrtf", scope: !374, file: !374, line: 152, type: !438, flags: DIFlagPrototyped, spFlags: 0)
!461 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !462, file: !377, line: 1083)
!462 = !DISubprogram(name: "cbrtl", scope: !374, file: !374, line: 152, type: !442, flags: DIFlagPrototyped, spFlags: 0)
!463 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !464, file: !377, line: 1085)
!464 = !DISubprogram(name: "copysign", scope: !374, file: !374, line: 196, type: !384, flags: DIFlagPrototyped, spFlags: 0)
!465 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !466, file: !377, line: 1086)
!466 = !DISubprogram(name: "copysignf", scope: !374, file: !374, line: 196, type: !467, flags: DIFlagPrototyped, spFlags: 0)
!467 = !DISubroutineType(types: !468)
!468 = !{!45, !45, !45}
!469 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !470, file: !377, line: 1087)
!470 = !DISubprogram(name: "copysignl", scope: !374, file: !374, line: 196, type: !471, flags: DIFlagPrototyped, spFlags: 0)
!471 = !DISubroutineType(types: !472)
!472 = !{!444, !444, !444}
!473 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !474, file: !377, line: 1089)
!474 = !DISubprogram(name: "erf", scope: !374, file: !374, line: 228, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!475 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !476, file: !377, line: 1090)
!476 = !DISubprogram(name: "erff", scope: !374, file: !374, line: 228, type: !438, flags: DIFlagPrototyped, spFlags: 0)
!477 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !478, file: !377, line: 1091)
!478 = !DISubprogram(name: "erfl", scope: !374, file: !374, line: 228, type: !442, flags: DIFlagPrototyped, spFlags: 0)
!479 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !480, file: !377, line: 1093)
!480 = !DISubprogram(name: "erfc", scope: !374, file: !374, line: 229, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!481 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !482, file: !377, line: 1094)
!482 = !DISubprogram(name: "erfcf", scope: !374, file: !374, line: 229, type: !438, flags: DIFlagPrototyped, spFlags: 0)
!483 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !484, file: !377, line: 1095)
!484 = !DISubprogram(name: "erfcl", scope: !374, file: !374, line: 229, type: !442, flags: DIFlagPrototyped, spFlags: 0)
!485 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !486, file: !377, line: 1097)
!486 = !DISubprogram(name: "exp2", scope: !374, file: !374, line: 130, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!487 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !488, file: !377, line: 1098)
!488 = !DISubprogram(name: "exp2f", scope: !374, file: !374, line: 130, type: !438, flags: DIFlagPrototyped, spFlags: 0)
!489 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !490, file: !377, line: 1099)
!490 = !DISubprogram(name: "exp2l", scope: !374, file: !374, line: 130, type: !442, flags: DIFlagPrototyped, spFlags: 0)
!491 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !492, file: !377, line: 1101)
!492 = !DISubprogram(name: "expm1", scope: !374, file: !374, line: 119, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!493 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !494, file: !377, line: 1102)
!494 = !DISubprogram(name: "expm1f", scope: !374, file: !374, line: 119, type: !438, flags: DIFlagPrototyped, spFlags: 0)
!495 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !496, file: !377, line: 1103)
!496 = !DISubprogram(name: "expm1l", scope: !374, file: !374, line: 119, type: !442, flags: DIFlagPrototyped, spFlags: 0)
!497 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !498, file: !377, line: 1105)
!498 = !DISubprogram(name: "fdim", scope: !374, file: !374, line: 326, type: !384, flags: DIFlagPrototyped, spFlags: 0)
!499 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !500, file: !377, line: 1106)
!500 = !DISubprogram(name: "fdimf", scope: !374, file: !374, line: 326, type: !467, flags: DIFlagPrototyped, spFlags: 0)
!501 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !502, file: !377, line: 1107)
!502 = !DISubprogram(name: "fdiml", scope: !374, file: !374, line: 326, type: !471, flags: DIFlagPrototyped, spFlags: 0)
!503 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !504, file: !377, line: 1109)
!504 = !DISubprogram(name: "fma", scope: !374, file: !374, line: 335, type: !505, flags: DIFlagPrototyped, spFlags: 0)
!505 = !DISubroutineType(types: !506)
!506 = !{!64, !64, !64, !64}
!507 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !508, file: !377, line: 1110)
!508 = !DISubprogram(name: "fmaf", scope: !374, file: !374, line: 335, type: !509, flags: DIFlagPrototyped, spFlags: 0)
!509 = !DISubroutineType(types: !510)
!510 = !{!45, !45, !45, !45}
!511 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !512, file: !377, line: 1111)
!512 = !DISubprogram(name: "fmal", scope: !374, file: !374, line: 335, type: !513, flags: DIFlagPrototyped, spFlags: 0)
!513 = !DISubroutineType(types: !514)
!514 = !{!444, !444, !444, !444}
!515 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !516, file: !377, line: 1113)
!516 = !DISubprogram(name: "fmax", scope: !374, file: !374, line: 329, type: !384, flags: DIFlagPrototyped, spFlags: 0)
!517 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !518, file: !377, line: 1114)
!518 = !DISubprogram(name: "fmaxf", scope: !374, file: !374, line: 329, type: !467, flags: DIFlagPrototyped, spFlags: 0)
!519 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !520, file: !377, line: 1115)
!520 = !DISubprogram(name: "fmaxl", scope: !374, file: !374, line: 329, type: !471, flags: DIFlagPrototyped, spFlags: 0)
!521 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !522, file: !377, line: 1117)
!522 = !DISubprogram(name: "fmin", scope: !374, file: !374, line: 332, type: !384, flags: DIFlagPrototyped, spFlags: 0)
!523 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !524, file: !377, line: 1118)
!524 = !DISubprogram(name: "fminf", scope: !374, file: !374, line: 332, type: !467, flags: DIFlagPrototyped, spFlags: 0)
!525 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !526, file: !377, line: 1119)
!526 = !DISubprogram(name: "fminl", scope: !374, file: !374, line: 332, type: !471, flags: DIFlagPrototyped, spFlags: 0)
!527 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !528, file: !377, line: 1121)
!528 = !DISubprogram(name: "hypot", scope: !374, file: !374, line: 147, type: !384, flags: DIFlagPrototyped, spFlags: 0)
!529 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !530, file: !377, line: 1122)
!530 = !DISubprogram(name: "hypotf", scope: !374, file: !374, line: 147, type: !467, flags: DIFlagPrototyped, spFlags: 0)
!531 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !532, file: !377, line: 1123)
!532 = !DISubprogram(name: "hypotl", scope: !374, file: !374, line: 147, type: !471, flags: DIFlagPrototyped, spFlags: 0)
!533 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !534, file: !377, line: 1125)
!534 = !DISubprogram(name: "ilogb", scope: !374, file: !374, line: 280, type: !535, flags: DIFlagPrototyped, spFlags: 0)
!535 = !DISubroutineType(types: !536)
!536 = !{!13, !64}
!537 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !538, file: !377, line: 1126)
!538 = !DISubprogram(name: "ilogbf", scope: !374, file: !374, line: 280, type: !539, flags: DIFlagPrototyped, spFlags: 0)
!539 = !DISubroutineType(types: !540)
!540 = !{!13, !45}
!541 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !542, file: !377, line: 1127)
!542 = !DISubprogram(name: "ilogbl", scope: !374, file: !374, line: 280, type: !543, flags: DIFlagPrototyped, spFlags: 0)
!543 = !DISubroutineType(types: !544)
!544 = !{!13, !444}
!545 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !546, file: !377, line: 1129)
!546 = !DISubprogram(name: "lgamma", scope: !374, file: !374, line: 230, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!547 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !548, file: !377, line: 1130)
!548 = !DISubprogram(name: "lgammaf", scope: !374, file: !374, line: 230, type: !438, flags: DIFlagPrototyped, spFlags: 0)
!549 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !550, file: !377, line: 1131)
!550 = !DISubprogram(name: "lgammal", scope: !374, file: !374, line: 230, type: !442, flags: DIFlagPrototyped, spFlags: 0)
!551 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !552, file: !377, line: 1134)
!552 = !DISubprogram(name: "llrint", scope: !374, file: !374, line: 316, type: !553, flags: DIFlagPrototyped, spFlags: 0)
!553 = !DISubroutineType(types: !554)
!554 = !{!555, !64}
!555 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!556 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !557, file: !377, line: 1135)
!557 = !DISubprogram(name: "llrintf", scope: !374, file: !374, line: 316, type: !558, flags: DIFlagPrototyped, spFlags: 0)
!558 = !DISubroutineType(types: !559)
!559 = !{!555, !45}
!560 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !561, file: !377, line: 1136)
!561 = !DISubprogram(name: "llrintl", scope: !374, file: !374, line: 316, type: !562, flags: DIFlagPrototyped, spFlags: 0)
!562 = !DISubroutineType(types: !563)
!563 = !{!555, !444}
!564 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !565, file: !377, line: 1138)
!565 = !DISubprogram(name: "llround", scope: !374, file: !374, line: 322, type: !553, flags: DIFlagPrototyped, spFlags: 0)
!566 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !567, file: !377, line: 1139)
!567 = !DISubprogram(name: "llroundf", scope: !374, file: !374, line: 322, type: !558, flags: DIFlagPrototyped, spFlags: 0)
!568 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !569, file: !377, line: 1140)
!569 = !DISubprogram(name: "llroundl", scope: !374, file: !374, line: 322, type: !562, flags: DIFlagPrototyped, spFlags: 0)
!570 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !571, file: !377, line: 1143)
!571 = !DISubprogram(name: "log1p", scope: !374, file: !374, line: 122, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!572 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !573, file: !377, line: 1144)
!573 = !DISubprogram(name: "log1pf", scope: !374, file: !374, line: 122, type: !438, flags: DIFlagPrototyped, spFlags: 0)
!574 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !575, file: !377, line: 1145)
!575 = !DISubprogram(name: "log1pl", scope: !374, file: !374, line: 122, type: !442, flags: DIFlagPrototyped, spFlags: 0)
!576 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !577, file: !377, line: 1147)
!577 = !DISubprogram(name: "log2", scope: !374, file: !374, line: 133, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!578 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !579, file: !377, line: 1148)
!579 = !DISubprogram(name: "log2f", scope: !374, file: !374, line: 133, type: !438, flags: DIFlagPrototyped, spFlags: 0)
!580 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !581, file: !377, line: 1149)
!581 = !DISubprogram(name: "log2l", scope: !374, file: !374, line: 133, type: !442, flags: DIFlagPrototyped, spFlags: 0)
!582 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !583, file: !377, line: 1151)
!583 = !DISubprogram(name: "logb", scope: !374, file: !374, line: 125, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!584 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !585, file: !377, line: 1152)
!585 = !DISubprogram(name: "logbf", scope: !374, file: !374, line: 125, type: !438, flags: DIFlagPrototyped, spFlags: 0)
!586 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !587, file: !377, line: 1153)
!587 = !DISubprogram(name: "logbl", scope: !374, file: !374, line: 125, type: !442, flags: DIFlagPrototyped, spFlags: 0)
!588 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !589, file: !377, line: 1155)
!589 = !DISubprogram(name: "lrint", scope: !374, file: !374, line: 314, type: !590, flags: DIFlagPrototyped, spFlags: 0)
!590 = !DISubroutineType(types: !591)
!591 = !{!592, !64}
!592 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!593 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !594, file: !377, line: 1156)
!594 = !DISubprogram(name: "lrintf", scope: !374, file: !374, line: 314, type: !595, flags: DIFlagPrototyped, spFlags: 0)
!595 = !DISubroutineType(types: !596)
!596 = !{!592, !45}
!597 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !598, file: !377, line: 1157)
!598 = !DISubprogram(name: "lrintl", scope: !374, file: !374, line: 314, type: !599, flags: DIFlagPrototyped, spFlags: 0)
!599 = !DISubroutineType(types: !600)
!600 = !{!592, !444}
!601 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !602, file: !377, line: 1159)
!602 = !DISubprogram(name: "lround", scope: !374, file: !374, line: 320, type: !590, flags: DIFlagPrototyped, spFlags: 0)
!603 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !604, file: !377, line: 1160)
!604 = !DISubprogram(name: "lroundf", scope: !374, file: !374, line: 320, type: !595, flags: DIFlagPrototyped, spFlags: 0)
!605 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !606, file: !377, line: 1161)
!606 = !DISubprogram(name: "lroundl", scope: !374, file: !374, line: 320, type: !599, flags: DIFlagPrototyped, spFlags: 0)
!607 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !608, file: !377, line: 1163)
!608 = !DISubprogram(name: "nan", scope: !374, file: !374, line: 201, type: !609, flags: DIFlagPrototyped, spFlags: 0)
!609 = !DISubroutineType(types: !610)
!610 = !{!64, !611}
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !613)
!613 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!614 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !615, file: !377, line: 1164)
!615 = !DISubprogram(name: "nanf", scope: !374, file: !374, line: 201, type: !616, flags: DIFlagPrototyped, spFlags: 0)
!616 = !DISubroutineType(types: !617)
!617 = !{!45, !611}
!618 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !619, file: !377, line: 1165)
!619 = !DISubprogram(name: "nanl", scope: !374, file: !374, line: 201, type: !620, flags: DIFlagPrototyped, spFlags: 0)
!620 = !DISubroutineType(types: !621)
!621 = !{!444, !611}
!622 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !623, file: !377, line: 1167)
!623 = !DISubprogram(name: "nearbyint", scope: !374, file: !374, line: 294, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!624 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !625, file: !377, line: 1168)
!625 = !DISubprogram(name: "nearbyintf", scope: !374, file: !374, line: 294, type: !438, flags: DIFlagPrototyped, spFlags: 0)
!626 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !627, file: !377, line: 1169)
!627 = !DISubprogram(name: "nearbyintl", scope: !374, file: !374, line: 294, type: !442, flags: DIFlagPrototyped, spFlags: 0)
!628 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !629, file: !377, line: 1171)
!629 = !DISubprogram(name: "nextafter", scope: !374, file: !374, line: 259, type: !384, flags: DIFlagPrototyped, spFlags: 0)
!630 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !631, file: !377, line: 1172)
!631 = !DISubprogram(name: "nextafterf", scope: !374, file: !374, line: 259, type: !467, flags: DIFlagPrototyped, spFlags: 0)
!632 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !633, file: !377, line: 1173)
!633 = !DISubprogram(name: "nextafterl", scope: !374, file: !374, line: 259, type: !471, flags: DIFlagPrototyped, spFlags: 0)
!634 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !635, file: !377, line: 1175)
!635 = !DISubprogram(name: "nexttoward", scope: !374, file: !374, line: 261, type: !636, flags: DIFlagPrototyped, spFlags: 0)
!636 = !DISubroutineType(types: !637)
!637 = !{!64, !64, !444}
!638 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !639, file: !377, line: 1176)
!639 = !DISubprogram(name: "nexttowardf", scope: !374, file: !374, line: 261, type: !640, flags: DIFlagPrototyped, spFlags: 0)
!640 = !DISubroutineType(types: !641)
!641 = !{!45, !45, !444}
!642 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !643, file: !377, line: 1177)
!643 = !DISubprogram(name: "nexttowardl", scope: !374, file: !374, line: 261, type: !471, flags: DIFlagPrototyped, spFlags: 0)
!644 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !645, file: !377, line: 1179)
!645 = !DISubprogram(name: "remainder", scope: !374, file: !374, line: 272, type: !384, flags: DIFlagPrototyped, spFlags: 0)
!646 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !647, file: !377, line: 1180)
!647 = !DISubprogram(name: "remainderf", scope: !374, file: !374, line: 272, type: !467, flags: DIFlagPrototyped, spFlags: 0)
!648 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !649, file: !377, line: 1181)
!649 = !DISubprogram(name: "remainderl", scope: !374, file: !374, line: 272, type: !471, flags: DIFlagPrototyped, spFlags: 0)
!650 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !651, file: !377, line: 1183)
!651 = !DISubprogram(name: "remquo", scope: !374, file: !374, line: 307, type: !652, flags: DIFlagPrototyped, spFlags: 0)
!652 = !DISubroutineType(types: !653)
!653 = !{!64, !64, !64, !404}
!654 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !655, file: !377, line: 1184)
!655 = !DISubprogram(name: "remquof", scope: !374, file: !374, line: 307, type: !656, flags: DIFlagPrototyped, spFlags: 0)
!656 = !DISubroutineType(types: !657)
!657 = !{!45, !45, !45, !404}
!658 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !659, file: !377, line: 1185)
!659 = !DISubprogram(name: "remquol", scope: !374, file: !374, line: 307, type: !660, flags: DIFlagPrototyped, spFlags: 0)
!660 = !DISubroutineType(types: !661)
!661 = !{!444, !444, !444, !404}
!662 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !663, file: !377, line: 1187)
!663 = !DISubprogram(name: "rint", scope: !374, file: !374, line: 256, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!664 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !665, file: !377, line: 1188)
!665 = !DISubprogram(name: "rintf", scope: !374, file: !374, line: 256, type: !438, flags: DIFlagPrototyped, spFlags: 0)
!666 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !667, file: !377, line: 1189)
!667 = !DISubprogram(name: "rintl", scope: !374, file: !374, line: 256, type: !442, flags: DIFlagPrototyped, spFlags: 0)
!668 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !669, file: !377, line: 1191)
!669 = !DISubprogram(name: "round", scope: !374, file: !374, line: 298, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!670 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !671, file: !377, line: 1192)
!671 = !DISubprogram(name: "roundf", scope: !374, file: !374, line: 298, type: !438, flags: DIFlagPrototyped, spFlags: 0)
!672 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !673, file: !377, line: 1193)
!673 = !DISubprogram(name: "roundl", scope: !374, file: !374, line: 298, type: !442, flags: DIFlagPrototyped, spFlags: 0)
!674 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !675, file: !377, line: 1195)
!675 = !DISubprogram(name: "scalbln", scope: !374, file: !374, line: 290, type: !676, flags: DIFlagPrototyped, spFlags: 0)
!676 = !DISubroutineType(types: !677)
!677 = !{!64, !64, !592}
!678 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !679, file: !377, line: 1196)
!679 = !DISubprogram(name: "scalblnf", scope: !374, file: !374, line: 290, type: !680, flags: DIFlagPrototyped, spFlags: 0)
!680 = !DISubroutineType(types: !681)
!681 = !{!45, !45, !592}
!682 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !683, file: !377, line: 1197)
!683 = !DISubprogram(name: "scalblnl", scope: !374, file: !374, line: 290, type: !684, flags: DIFlagPrototyped, spFlags: 0)
!684 = !DISubroutineType(types: !685)
!685 = !{!444, !444, !592}
!686 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !687, file: !377, line: 1199)
!687 = !DISubprogram(name: "scalbn", scope: !374, file: !374, line: 276, type: !407, flags: DIFlagPrototyped, spFlags: 0)
!688 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !689, file: !377, line: 1200)
!689 = !DISubprogram(name: "scalbnf", scope: !374, file: !374, line: 276, type: !690, flags: DIFlagPrototyped, spFlags: 0)
!690 = !DISubroutineType(types: !691)
!691 = !{!45, !45, !13}
!692 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !693, file: !377, line: 1201)
!693 = !DISubprogram(name: "scalbnl", scope: !374, file: !374, line: 276, type: !694, flags: DIFlagPrototyped, spFlags: 0)
!694 = !DISubroutineType(types: !695)
!695 = !{!444, !444, !13}
!696 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !697, file: !377, line: 1203)
!697 = !DISubprogram(name: "tgamma", scope: !374, file: !374, line: 235, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!698 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !699, file: !377, line: 1204)
!699 = !DISubprogram(name: "tgammaf", scope: !374, file: !374, line: 235, type: !438, flags: DIFlagPrototyped, spFlags: 0)
!700 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !701, file: !377, line: 1205)
!701 = !DISubprogram(name: "tgammal", scope: !374, file: !374, line: 235, type: !442, flags: DIFlagPrototyped, spFlags: 0)
!702 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !703, file: !377, line: 1207)
!703 = !DISubprogram(name: "trunc", scope: !374, file: !374, line: 302, type: !375, flags: DIFlagPrototyped, spFlags: 0)
!704 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !705, file: !377, line: 1208)
!705 = !DISubprogram(name: "truncf", scope: !374, file: !374, line: 302, type: !438, flags: DIFlagPrototyped, spFlags: 0)
!706 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !707, file: !377, line: 1209)
!707 = !DISubprogram(name: "truncl", scope: !374, file: !374, line: 302, type: !442, flags: DIFlagPrototyped, spFlags: 0)
!708 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !709, file: !713, line: 38)
!709 = !DISubprogram(name: "abs", linkageName: "_ZSt3absg", scope: !366, file: !371, line: 103, type: !710, flags: DIFlagPrototyped, spFlags: 0)
!710 = !DISubroutineType(types: !711)
!711 = !{!712, !712}
!712 = !DIBasicType(name: "__float128", size: 128, encoding: DW_ATE_float)
!713 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/math.h", directory: "")
!714 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !715, file: !713, line: 54)
!715 = !DISubprogram(name: "modf", linkageName: "_ZSt4modfePe", scope: !366, file: !377, line: 380, type: !716, flags: DIFlagPrototyped, spFlags: 0)
!716 = !DISubroutineType(types: !717)
!717 = !{!444, !444, !718}
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!719 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !720, file: !722, line: 127)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !368, line: 62, baseType: !721)
!721 = !DICompositeType(tag: DW_TAG_structure_type, file: !368, line: 58, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!722 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cstdlib", directory: "")
!723 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !724, file: !722, line: 128)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !368, line: 70, baseType: !725)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !368, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !726, identifier: "_ZTS6ldiv_t")
!726 = !{!727, !728}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !725, file: !368, line: 68, baseType: !592, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !725, file: !368, line: 69, baseType: !592, size: 64, offset: 64)
!729 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !730, file: !722, line: 130)
!730 = !DISubprogram(name: "abort", scope: !368, file: !368, line: 591, type: !731, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!731 = !DISubroutineType(types: !732)
!732 = !{null}
!733 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !734, file: !722, line: 134)
!734 = !DISubprogram(name: "atexit", scope: !368, file: !368, line: 595, type: !735, flags: DIFlagPrototyped, spFlags: 0)
!735 = !DISubroutineType(types: !736)
!736 = !{!13, !737}
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!738 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !739, file: !722, line: 137)
!739 = !DISubprogram(name: "at_quick_exit", scope: !368, file: !368, line: 600, type: !735, flags: DIFlagPrototyped, spFlags: 0)
!740 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !741, file: !722, line: 140)
!741 = !DISubprogram(name: "atof", scope: !368, file: !368, line: 101, type: !609, flags: DIFlagPrototyped, spFlags: 0)
!742 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !743, file: !722, line: 141)
!743 = !DISubprogram(name: "atoi", scope: !368, file: !368, line: 104, type: !744, flags: DIFlagPrototyped, spFlags: 0)
!744 = !DISubroutineType(types: !745)
!745 = !{!13, !611}
!746 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !747, file: !722, line: 142)
!747 = !DISubprogram(name: "atol", scope: !368, file: !368, line: 107, type: !748, flags: DIFlagPrototyped, spFlags: 0)
!748 = !DISubroutineType(types: !749)
!749 = !{!592, !611}
!750 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !751, file: !722, line: 143)
!751 = !DISubprogram(name: "bsearch", scope: !368, file: !368, line: 820, type: !752, flags: DIFlagPrototyped, spFlags: 0)
!752 = !DISubroutineType(types: !753)
!753 = !{!104, !754, !754, !756, !756, !759}
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !757, line: 46, baseType: !758)
!757 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!758 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !368, line: 808, baseType: !760)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DISubroutineType(types: !762)
!762 = !{!13, !754, !754}
!763 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !764, file: !722, line: 144)
!764 = !DISubprogram(name: "calloc", scope: !368, file: !368, line: 542, type: !765, flags: DIFlagPrototyped, spFlags: 0)
!765 = !DISubroutineType(types: !766)
!766 = !{!104, !756, !756}
!767 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !768, file: !722, line: 145)
!768 = !DISubprogram(name: "div", scope: !368, file: !368, line: 852, type: !769, flags: DIFlagPrototyped, spFlags: 0)
!769 = !DISubroutineType(types: !770)
!770 = !{!720, !13, !13}
!771 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !772, file: !722, line: 146)
!772 = !DISubprogram(name: "exit", scope: !368, file: !368, line: 617, type: !773, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!773 = !DISubroutineType(types: !774)
!774 = !{null, !13}
!775 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !776, file: !722, line: 147)
!776 = !DISubprogram(name: "free", scope: !368, file: !368, line: 565, type: !777, flags: DIFlagPrototyped, spFlags: 0)
!777 = !DISubroutineType(types: !778)
!778 = !{null, !104}
!779 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !780, file: !722, line: 148)
!780 = !DISubprogram(name: "getenv", scope: !368, file: !368, line: 634, type: !781, flags: DIFlagPrototyped, spFlags: 0)
!781 = !DISubroutineType(types: !782)
!782 = !{!783, !611}
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!784 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !785, file: !722, line: 149)
!785 = !DISubprogram(name: "labs", scope: !368, file: !368, line: 841, type: !786, flags: DIFlagPrototyped, spFlags: 0)
!786 = !DISubroutineType(types: !787)
!787 = !{!592, !592}
!788 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !789, file: !722, line: 150)
!789 = !DISubprogram(name: "ldiv", scope: !368, file: !368, line: 854, type: !790, flags: DIFlagPrototyped, spFlags: 0)
!790 = !DISubroutineType(types: !791)
!791 = !{!724, !592, !592}
!792 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !793, file: !722, line: 151)
!793 = !DISubprogram(name: "malloc", scope: !368, file: !368, line: 539, type: !794, flags: DIFlagPrototyped, spFlags: 0)
!794 = !DISubroutineType(types: !795)
!795 = !{!104, !756}
!796 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !797, file: !722, line: 153)
!797 = !DISubprogram(name: "mblen", scope: !368, file: !368, line: 922, type: !798, flags: DIFlagPrototyped, spFlags: 0)
!798 = !DISubroutineType(types: !799)
!799 = !{!13, !611, !756}
!800 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !801, file: !722, line: 154)
!801 = !DISubprogram(name: "mbstowcs", scope: !368, file: !368, line: 933, type: !802, flags: DIFlagPrototyped, spFlags: 0)
!802 = !DISubroutineType(types: !803)
!803 = !{!756, !804, !807, !756}
!804 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !805)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!807 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !611)
!808 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !809, file: !722, line: 155)
!809 = !DISubprogram(name: "mbtowc", scope: !368, file: !368, line: 925, type: !810, flags: DIFlagPrototyped, spFlags: 0)
!810 = !DISubroutineType(types: !811)
!811 = !{!13, !804, !807, !756}
!812 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !813, file: !722, line: 157)
!813 = !DISubprogram(name: "qsort", scope: !368, file: !368, line: 830, type: !814, flags: DIFlagPrototyped, spFlags: 0)
!814 = !DISubroutineType(types: !815)
!815 = !{null, !104, !756, !756, !759}
!816 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !817, file: !722, line: 160)
!817 = !DISubprogram(name: "quick_exit", scope: !368, file: !368, line: 623, type: !773, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!818 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !819, file: !722, line: 163)
!819 = !DISubprogram(name: "rand", scope: !368, file: !368, line: 453, type: !820, flags: DIFlagPrototyped, spFlags: 0)
!820 = !DISubroutineType(types: !821)
!821 = !{!13}
!822 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !823, file: !722, line: 164)
!823 = !DISubprogram(name: "realloc", scope: !368, file: !368, line: 550, type: !824, flags: DIFlagPrototyped, spFlags: 0)
!824 = !DISubroutineType(types: !825)
!825 = !{!104, !104, !756}
!826 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !827, file: !722, line: 165)
!827 = !DISubprogram(name: "srand", scope: !368, file: !368, line: 455, type: !828, flags: DIFlagPrototyped, spFlags: 0)
!828 = !DISubroutineType(types: !829)
!829 = !{null, !56}
!830 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !831, file: !722, line: 166)
!831 = !DISubprogram(name: "strtod", scope: !368, file: !368, line: 117, type: !832, flags: DIFlagPrototyped, spFlags: 0)
!832 = !DISubroutineType(types: !833)
!833 = !{!64, !807, !834}
!834 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !835)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!836 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !837, file: !722, line: 167)
!837 = !DISubprogram(name: "strtol", scope: !368, file: !368, line: 176, type: !838, flags: DIFlagPrototyped, spFlags: 0)
!838 = !DISubroutineType(types: !839)
!839 = !{!592, !807, !834, !13}
!840 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !841, file: !722, line: 168)
!841 = !DISubprogram(name: "strtoul", scope: !368, file: !368, line: 180, type: !842, flags: DIFlagPrototyped, spFlags: 0)
!842 = !DISubroutineType(types: !843)
!843 = !{!758, !807, !834, !13}
!844 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !845, file: !722, line: 169)
!845 = !DISubprogram(name: "system", scope: !368, file: !368, line: 784, type: !744, flags: DIFlagPrototyped, spFlags: 0)
!846 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !847, file: !722, line: 171)
!847 = !DISubprogram(name: "wcstombs", scope: !368, file: !368, line: 936, type: !848, flags: DIFlagPrototyped, spFlags: 0)
!848 = !DISubroutineType(types: !849)
!849 = !{!756, !850, !851, !756}
!850 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !783)
!851 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !852)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !806)
!854 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !855, file: !722, line: 172)
!855 = !DISubprogram(name: "wctomb", scope: !368, file: !368, line: 929, type: !856, flags: DIFlagPrototyped, spFlags: 0)
!856 = !DISubroutineType(types: !857)
!857 = !{!13, !783, !806}
!858 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !859, entity: !860, file: !722, line: 200)
!859 = !DINamespace(name: "__gnu_cxx", scope: null)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !368, line: 80, baseType: !861)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !368, line: 76, size: 128, flags: DIFlagTypePassByValue, elements: !862, identifier: "_ZTS7lldiv_t")
!862 = !{!863, !864}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !861, file: !368, line: 78, baseType: !555, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !861, file: !368, line: 79, baseType: !555, size: 64, offset: 64)
!865 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !859, entity: !866, file: !722, line: 206)
!866 = !DISubprogram(name: "_Exit", scope: !368, file: !368, line: 629, type: !773, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!867 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !859, entity: !868, file: !722, line: 210)
!868 = !DISubprogram(name: "llabs", scope: !368, file: !368, line: 844, type: !869, flags: DIFlagPrototyped, spFlags: 0)
!869 = !DISubroutineType(types: !870)
!870 = !{!555, !555}
!871 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !859, entity: !872, file: !722, line: 216)
!872 = !DISubprogram(name: "lldiv", scope: !368, file: !368, line: 858, type: !873, flags: DIFlagPrototyped, spFlags: 0)
!873 = !DISubroutineType(types: !874)
!874 = !{!860, !555, !555}
!875 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !859, entity: !876, file: !722, line: 227)
!876 = !DISubprogram(name: "atoll", scope: !368, file: !368, line: 112, type: !877, flags: DIFlagPrototyped, spFlags: 0)
!877 = !DISubroutineType(types: !878)
!878 = !{!555, !611}
!879 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !859, entity: !880, file: !722, line: 228)
!880 = !DISubprogram(name: "strtoll", scope: !368, file: !368, line: 200, type: !881, flags: DIFlagPrototyped, spFlags: 0)
!881 = !DISubroutineType(types: !882)
!882 = !{!555, !807, !834, !13}
!883 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !859, entity: !884, file: !722, line: 229)
!884 = !DISubprogram(name: "strtoull", scope: !368, file: !368, line: 205, type: !885, flags: DIFlagPrototyped, spFlags: 0)
!885 = !DISubroutineType(types: !886)
!886 = !{!887, !807, !834, !13}
!887 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!888 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !859, entity: !889, file: !722, line: 231)
!889 = !DISubprogram(name: "strtof", scope: !368, file: !368, line: 123, type: !890, flags: DIFlagPrototyped, spFlags: 0)
!890 = !DISubroutineType(types: !891)
!891 = !{!45, !807, !834}
!892 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !859, entity: !893, file: !722, line: 232)
!893 = !DISubprogram(name: "strtold", scope: !368, file: !368, line: 126, type: !894, flags: DIFlagPrototyped, spFlags: 0)
!894 = !DISubroutineType(types: !895)
!895 = !{!444, !807, !834}
!896 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !860, file: !722, line: 240)
!897 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !866, file: !722, line: 242)
!898 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !868, file: !722, line: 244)
!899 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !900, file: !722, line: 245)
!900 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !859, file: !722, line: 213, type: !873, flags: DIFlagPrototyped, spFlags: 0)
!901 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !872, file: !722, line: 246)
!902 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !876, file: !722, line: 248)
!903 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !889, file: !722, line: 249)
!904 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !880, file: !722, line: 250)
!905 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !884, file: !722, line: 251)
!906 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !893, file: !722, line: 252)
!907 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !149, entity: !730, file: !908, line: 38)
!908 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/stdlib.h", directory: "")
