; ModuleID = 'fractal.cpp'
source_filename = "fractal.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"struct.pov::Method_Struct" = type { i32 (%"struct.pov::Object_Struct"*, %"struct.pov::Ray_Struct"*, %"struct.pov::istack_struct"*)*, i32 (double*, %"struct.pov::Object_Struct"*)*, void (double*, %"struct.pov::Object_Struct"*, %"struct.pov::istk_entry"*)*, void (double*, %"struct.pov::Object_Struct"*, %"struct.pov::istk_entry"*)*, i8* (%"struct.pov::Object_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, double*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*, %"struct.pov::Transform_Struct"*)*, void (%"struct.pov::Object_Struct"*)*, void (%"struct.pov::Object_Struct"*)* }
%"struct.pov::Object_Struct" = type { %"struct.pov::Method_Struct"*, i32, %"struct.pov::Object_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Texture_Struct"*, %"struct.pov::Interior_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Object_Struct"*, %"struct.pov::Light_Source_Struct"*, %"struct.pov::Bounding_Box_Struct", %"struct.pov::Transform_Struct"*, %"struct.pov::Transform_Struct"*, float, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "Sx", linkageName: "_ZN3pov2SxE", scope: !2, file: !3, line: 93, type: !4, isLocal: false, isDefinition: true)
!2 = !DINamespace(name: "pov", scope: null)
!3 = !DIFile(filename: "fractal.cpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "Sy", linkageName: "_ZN3pov2SyE", scope: !2, file: !3, line: 93, type: !4, isLocal: false, isDefinition: true)
!8 = !DIGlobalVariableExpression(var: !9, expr: !DIExpression())
!9 = distinct !DIGlobalVariable(name: "Sz", linkageName: "_ZN3pov2SzE", scope: !2, file: !3, line: 93, type: !4, isLocal: false, isDefinition: true)
!10 = !DIGlobalVariableExpression(var: !11, expr: !DIExpression())
!11 = distinct !DIGlobalVariable(name: "Sw", linkageName: "_ZN3pov2SwE", scope: !2, file: !3, line: 93, type: !4, isLocal: false, isDefinition: true)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(name: "Precision", linkageName: "_ZN3pov9PrecisionE", scope: !2, file: !3, line: 94, type: !5, isLocal: false, isDefinition: true)
!14 = !DIGlobalVariableExpression(var: !15, expr: !DIExpression())
!15 = distinct !DIGlobalVariable(name: "Direction", linkageName: "_ZN3pov9DirectionE", scope: !2, file: !3, line: 95, type: !16, isLocal: false, isDefinition: true)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "VECTOR", scope: !2, file: !17, line: 691, baseType: !18)
!17 = !DIFile(filename: "./frame.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!18 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 192, elements: !19)
!19 = !{!20}
!20 = !DISubrange(count: 3)
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(name: "Fractal_Methods", linkageName: "_ZN3povL15Fractal_MethodsE", scope: !2, file: !3, line: 81, type: !23, isLocal: true, isDefinition: true)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "METHODS", scope: !2, file: !17, line: 1432, baseType: !24)
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Method_Struct", scope: !2, file: !17, line: 1517, size: 704, flags: DIFlagTypePassByValue, elements: !25, identifier: "_ZTSN3pov13Method_StructE")
!25 = !{!26, !121, !126, !133, !135, !140, !145, !147, !149, !154, !159}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "All_Intersections_Method", scope: !24, file: !17, line: 1519, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "ALL_INTERSECTIONS_METHOD", scope: !2, file: !17, line: 1434, baseType: !28)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DISubroutineType(types: !30)
!30 = !{!31, !32, !73, !85}
!31 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "OBJECT", scope: !2, file: !17, line: 678, baseType: !34)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object_Struct", scope: !2, file: !17, line: 1535, size: 960, flags: DIFlagTypePassByValue, elements: !35, identifier: "_ZTSN3pov13Object_StructE")
!35 = !{!36, !38, !39, !40, !44, !45, !49, !50, !51, !55, !65, !69, !70, !71}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !34, file: !17, line: 1537, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !34, file: !17, line: 1537, baseType: !31, size: 32, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !34, file: !17, line: 1537, baseType: !32, size: 64, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !34, file: !17, line: 1537, baseType: !41, size: 64, offset: 192)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "TEXTURE", scope: !2, file: !17, line: 1035, baseType: !43)
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "Texture_Struct", scope: !2, file: !17, line: 1359, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov14Texture_StructE")
!44 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !34, file: !17, line: 1537, baseType: !41, size: 64, offset: 256)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !34, file: !17, line: 1537, baseType: !46, size: 64, offset: 320)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERIOR", scope: !2, file: !17, line: 1124, baseType: !48)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "Interior_Struct", scope: !2, file: !17, line: 1126, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov15Interior_StructE")
!49 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !34, file: !17, line: 1537, baseType: !32, size: 64, offset: 384)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !34, file: !17, line: 1537, baseType: !32, size: 64, offset: 448)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !34, file: !17, line: 1537, baseType: !52, size: 64, offset: 512)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "LIGHT_SOURCE", scope: !2, file: !17, line: 1041, baseType: !54)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Source_Struct", scope: !2, file: !17, line: 1580, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov19Light_Source_StructE")
!55 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !34, file: !17, line: 1537, baseType: !56, size: 192, offset: 576)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX", scope: !2, file: !17, line: 888, baseType: !57)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Bounding_Box_Struct", scope: !2, file: !17, line: 890, size: 192, flags: DIFlagTypePassByValue, elements: !58, identifier: "_ZTSN3pov19Bounding_Box_StructE")
!58 = !{!59, !64}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "Lower_Left", scope: !57, file: !17, line: 892, baseType: !60, size: 96)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VECT", scope: !2, file: !17, line: 886, baseType: !61)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 96, elements: !19)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBOX_VAL", scope: !2, file: !17, line: 884, baseType: !63)
!63 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "Lengths", scope: !57, file: !17, line: 892, baseType: !60, size: 96, offset: 96)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !34, file: !17, line: 1537, baseType: !66, size: 64, offset: 768)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM", scope: !2, file: !17, line: 1014, baseType: !68)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "Transform_Struct", scope: !2, file: !17, line: 1016, flags: DIFlagFwdDecl, identifier: "_ZTSN3pov16Transform_StructE")
!69 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !34, file: !17, line: 1537, baseType: !66, size: 64, offset: 832)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !34, file: !17, line: 1537, baseType: !63, size: 32, offset: 896)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !34, file: !17, line: 1537, baseType: !72, size: 32, offset: 928)
!72 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "RAY", scope: !2, file: !17, line: 680, baseType: !75)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Ray_Struct", scope: !2, file: !17, line: 1797, size: 6848, flags: DIFlagTypePassByValue, elements: !76, identifier: "_ZTSN3pov10Ray_StructE")
!76 = !{!77, !78, !79, !80, !81}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "Initial", scope: !75, file: !17, line: 1799, baseType: !16, size: 192)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !75, file: !17, line: 1800, baseType: !16, size: 192, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "Index", scope: !75, file: !17, line: 1801, baseType: !31, size: 32, offset: 384)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "Optimisiation_Flags", scope: !75, file: !17, line: 1802, baseType: !72, size: 32, offset: 416)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "Interiors", scope: !75, file: !17, line: 1803, baseType: !82, size: 6400, offset: 448)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 6400, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 100)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "ISTACK", scope: !2, file: !17, line: 681, baseType: !87)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "istack_struct", scope: !2, file: !17, line: 1635, size: 192, flags: DIFlagTypePassByValue, elements: !88, identifier: "_ZTSN3pov13istack_structE")
!88 = !{!89, !91, !119, !120}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !87, file: !17, line: 1637, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "istack", scope: !87, file: !17, line: 1638, baseType: !92, size: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "istk_entry", scope: !2, file: !17, line: 1610, size: 1600, flags: DIFlagTypePassByValue, elements: !94, identifier: "_ZTSN3pov10istk_entryE")
!94 = !{!95, !96, !97, !98, !99, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !118}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "Depth", scope: !93, file: !17, line: 1612, baseType: !5, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "IPoint", scope: !93, file: !17, line: 1613, baseType: !16, size: 192, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "INormal", scope: !93, file: !17, line: 1614, baseType: !16, size: 192, offset: 256)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "PNormal", scope: !93, file: !17, line: 1615, baseType: !16, size: 192, offset: 448)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "Iuv", scope: !93, file: !17, line: 1616, baseType: !100, size: 128, offset: 640)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "UV_VECT", scope: !2, file: !17, line: 690, baseType: !101)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 128, elements: !102)
!102 = !{!103}
!103 = !DISubrange(count: 2)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "Object", scope: !93, file: !17, line: 1617, baseType: !32, size: 64, offset: 768)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "i1", scope: !93, file: !17, line: 1624, baseType: !31, size: 32, offset: 832)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "i2", scope: !93, file: !17, line: 1624, baseType: !31, size: 32, offset: 864)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !93, file: !17, line: 1625, baseType: !5, size: 64, offset: 896)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !93, file: !17, line: 1625, baseType: !5, size: 64, offset: 960)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !93, file: !17, line: 1626, baseType: !5, size: 64, offset: 1024)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !93, file: !17, line: 1626, baseType: !5, size: 64, offset: 1088)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "d3", scope: !93, file: !17, line: 1627, baseType: !5, size: 64, offset: 1152)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "d4", scope: !93, file: !17, line: 1627, baseType: !5, size: 64, offset: 1216)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "w1", scope: !93, file: !17, line: 1628, baseType: !5, size: 64, offset: 1280)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "w2", scope: !93, file: !17, line: 1628, baseType: !5, size: 64, offset: 1344)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "w3", scope: !93, file: !17, line: 1628, baseType: !5, size: 64, offset: 1408)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "Pointer", scope: !93, file: !17, line: 1630, baseType: !117, size: 64, offset: 1472)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "Csg", scope: !93, file: !17, line: 1632, baseType: !117, size: 64, offset: 1536)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !87, file: !17, line: 1639, baseType: !72, size: 32, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "top_entry", scope: !87, file: !17, line: 1640, baseType: !72, size: 32, offset: 160)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "Inside_Method", scope: !24, file: !17, line: 1520, baseType: !122, size: 64, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "INSIDE_METHOD", scope: !2, file: !17, line: 1435, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{!31, !4, !32}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Method", scope: !24, file: !17, line: 1521, baseType: !127, size: 64, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "NORMAL_METHOD", scope: !2, file: !17, line: 1436, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{null, !4, !32, !131}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTERSECTION", scope: !2, file: !17, line: 682, baseType: !93)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "UVCoord_Method", scope: !24, file: !17, line: 1522, baseType: !134, size: 64, offset: 192)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "UVCOORD_METHOD", scope: !2, file: !17, line: 1437, baseType: !128)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "Copy_Method", scope: !24, file: !17, line: 1523, baseType: !136, size: 64, offset: 256)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "COPY_METHOD", scope: !2, file: !17, line: 1438, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!117, !32}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "Translate_Method", scope: !24, file: !17, line: 1524, baseType: !141, size: 64, offset: 320)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSLATE_METHOD", scope: !2, file: !17, line: 1439, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{null, !32, !4, !66}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "Rotate_Method", scope: !24, file: !17, line: 1525, baseType: !146, size: 64, offset: 384)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "ROTATE_METHOD", scope: !2, file: !17, line: 1440, baseType: !142)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "Scale_Method", scope: !24, file: !17, line: 1526, baseType: !148, size: 64, offset: 448)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCALE_METHOD", scope: !2, file: !17, line: 1441, baseType: !142)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "Transform_Method", scope: !24, file: !17, line: 1527, baseType: !150, size: 64, offset: 512)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "TRANSFORM_METHOD", scope: !2, file: !17, line: 1442, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{null, !32, !66}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "Invert_Method", scope: !24, file: !17, line: 1528, baseType: !155, size: 64, offset: 576)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "INVERT_METHOD", scope: !2, file: !17, line: 1443, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{null, !32}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "Destroy_Method", scope: !24, file: !17, line: 1529, baseType: !160, size: 64, offset: 640)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "DESTROY_METHOD", scope: !2, file: !17, line: 1444, baseType: !156)
!161 = !DIGlobalVariableExpression(var: !162, expr: !DIExpression())
!162 = distinct !DIGlobalVariable(name: "Complex_Function_List", linkageName: "_ZN3povL21Complex_Function_ListE", scope: !2, file: !3, line: 97, type: !163, isLocal: true, isDefinition: true)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 960, elements: !176)
!164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "COMPLEX_FUNCTION_METHOD", scope: !2, file: !166, line: 82, baseType: !167)
!166 = !DIFile(filename: "./fractal.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{null, !170, !170}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMPLX", scope: !2, file: !166, line: 77, baseType: !172)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cmplx", scope: !2, file: !166, line: 77, size: 128, flags: DIFlagTypePassByValue, elements: !173, identifier: "_ZTSN3pov5cmplxE")
!173 = !{!174, !175}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !172, file: !166, line: 77, baseType: !5, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !172, file: !166, line: 77, baseType: !5, size: 64, offset: 64)
!176 = !{!177}
!177 = !DISubrange(count: 15)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(name: "Allocated_Iteration_Stack_Length", linkageName: "_ZN3povL32Allocated_Iteration_Stack_LengthE", scope: !2, file: !3, line: 91, type: !31, isLocal: true, isDefinition: true)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(name: "New_Point", scope: !182, file: !3, line: 385, type: !16, isLocal: true, isDefinition: true)
!182 = distinct !DISubprogram(name: "Inside_Fractal", linkageName: "_ZN3povL14Inside_FractalEPdPNS_13Object_StructE", scope: !2, file: !3, line: 381, type: !124, scopeLine: 382, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !183, retainedNodes: !1104)
!183 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !184, retainedTypes: !318, globals: !373, imports: !377, splitDebugInlining: false, nameTableKind: None)
!184 = !{!185, !191}
!185 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !2, file: !17, line: 706, baseType: !72, size: 32, elements: !186)
!186 = !{!187, !188, !189, !190}
!187 = !DIEnumerator(name: "X", value: 0, isUnsigned: true)
!188 = !DIEnumerator(name: "Y", value: 1, isUnsigned: true)
!189 = !DIEnumerator(name: "Z", value: 2, isUnsigned: true)
!190 = !DIEnumerator(name: "T", value: 3, isUnsigned: true)
!191 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "STATS", scope: !2, file: !192, line: 149, baseType: !72, size: 32, elements: !193, identifier: "_ZTSN3pov5STATSE")
!192 = !DIFile(filename: "./povray.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/511.povray_r/build/build_base_ld-loop-ext-m64.0000")
!193 = !{!194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317}
!194 = !DIEnumerator(name: "Number_Of_Pixels", value: 0, isUnsigned: true)
!195 = !DIEnumerator(name: "Number_Of_Pixels_Supersampled", value: 1, isUnsigned: true)
!196 = !DIEnumerator(name: "Number_Of_Samples", value: 2, isUnsigned: true)
!197 = !DIEnumerator(name: "Number_Of_Rays", value: 3, isUnsigned: true)
!198 = !DIEnumerator(name: "Calls_To_DNoise", value: 4, isUnsigned: true)
!199 = !DIEnumerator(name: "Calls_To_Noise", value: 5, isUnsigned: true)
!200 = !DIEnumerator(name: "ADC_Saves", value: 6, isUnsigned: true)
!201 = !DIEnumerator(name: "Istack_overflows", value: 7, isUnsigned: true)
!202 = !DIEnumerator(name: "Ray_RBezier_Tests", value: 8, isUnsigned: true)
!203 = !DIEnumerator(name: "Ray_RBezier_Tests_Succeeded", value: 9, isUnsigned: true)
!204 = !DIEnumerator(name: "Ray_Bicubic_Tests", value: 10, isUnsigned: true)
!205 = !DIEnumerator(name: "Ray_Bicubic_Tests_Succeeded", value: 11, isUnsigned: true)
!206 = !DIEnumerator(name: "Ray_Blob_Tests", value: 12, isUnsigned: true)
!207 = !DIEnumerator(name: "Ray_Blob_Tests_Succeeded", value: 13, isUnsigned: true)
!208 = !DIEnumerator(name: "Blob_Element_Tests", value: 14, isUnsigned: true)
!209 = !DIEnumerator(name: "Blob_Element_Tests_Succeeded", value: 15, isUnsigned: true)
!210 = !DIEnumerator(name: "Blob_Bound_Tests", value: 16, isUnsigned: true)
!211 = !DIEnumerator(name: "Blob_Bound_Tests_Succeeded", value: 17, isUnsigned: true)
!212 = !DIEnumerator(name: "Ray_Box_Tests", value: 18, isUnsigned: true)
!213 = !DIEnumerator(name: "Ray_Box_Tests_Succeeded", value: 19, isUnsigned: true)
!214 = !DIEnumerator(name: "Ray_Cone_Tests", value: 20, isUnsigned: true)
!215 = !DIEnumerator(name: "Ray_Cone_Tests_Succeeded", value: 21, isUnsigned: true)
!216 = !DIEnumerator(name: "Ray_CSG_Intersection_Tests", value: 22, isUnsigned: true)
!217 = !DIEnumerator(name: "Ray_CSG_Intersection_Tests_Succeeded", value: 23, isUnsigned: true)
!218 = !DIEnumerator(name: "Ray_CSG_Merge_Tests", value: 24, isUnsigned: true)
!219 = !DIEnumerator(name: "Ray_CSG_Merge_Tests_Succeeded", value: 25, isUnsigned: true)
!220 = !DIEnumerator(name: "Ray_CSG_Union_Tests", value: 26, isUnsigned: true)
!221 = !DIEnumerator(name: "Ray_CSG_Union_Tests_Succeeded", value: 27, isUnsigned: true)
!222 = !DIEnumerator(name: "Ray_Disc_Tests", value: 28, isUnsigned: true)
!223 = !DIEnumerator(name: "Ray_Disc_Tests_Succeeded", value: 29, isUnsigned: true)
!224 = !DIEnumerator(name: "Ray_Fractal_Tests", value: 30, isUnsigned: true)
!225 = !DIEnumerator(name: "Ray_Fractal_Tests_Succeeded", value: 31, isUnsigned: true)
!226 = !DIEnumerator(name: "Ray_HField_Tests", value: 32, isUnsigned: true)
!227 = !DIEnumerator(name: "Ray_HField_Tests_Succeeded", value: 33, isUnsigned: true)
!228 = !DIEnumerator(name: "Ray_HField_Box_Tests", value: 34, isUnsigned: true)
!229 = !DIEnumerator(name: "Ray_HField_Box_Tests_Succeeded", value: 35, isUnsigned: true)
!230 = !DIEnumerator(name: "Ray_HField_Triangle_Tests", value: 36, isUnsigned: true)
!231 = !DIEnumerator(name: "Ray_HField_Triangle_Tests_Succeeded", value: 37, isUnsigned: true)
!232 = !DIEnumerator(name: "Ray_HField_Block_Tests", value: 38, isUnsigned: true)
!233 = !DIEnumerator(name: "Ray_HField_Block_Tests_Succeeded", value: 39, isUnsigned: true)
!234 = !DIEnumerator(name: "Ray_HField_Cell_Tests", value: 40, isUnsigned: true)
!235 = !DIEnumerator(name: "Ray_HField_Cell_Tests_Succeeded", value: 41, isUnsigned: true)
!236 = !DIEnumerator(name: "Ray_IsoSurface_Tests", value: 42, isUnsigned: true)
!237 = !DIEnumerator(name: "Ray_IsoSurface_Tests_Succeeded", value: 43, isUnsigned: true)
!238 = !DIEnumerator(name: "Ray_IsoSurface_Bound_Tests", value: 44, isUnsigned: true)
!239 = !DIEnumerator(name: "Ray_IsoSurface_Bound_Tests_Succeeded", value: 45, isUnsigned: true)
!240 = !DIEnumerator(name: "Ray_IsoSurface_Cache", value: 46, isUnsigned: true)
!241 = !DIEnumerator(name: "Ray_IsoSurface_Cache_Succeeded", value: 47, isUnsigned: true)
!242 = !DIEnumerator(name: "Ray_Lathe_Tests", value: 48, isUnsigned: true)
!243 = !DIEnumerator(name: "Ray_Lathe_Tests_Succeeded", value: 49, isUnsigned: true)
!244 = !DIEnumerator(name: "Lathe_Bound_Tests", value: 50, isUnsigned: true)
!245 = !DIEnumerator(name: "Lathe_Bound_Tests_Succeeded", value: 51, isUnsigned: true)
!246 = !DIEnumerator(name: "Ray_Mesh_Tests", value: 52, isUnsigned: true)
!247 = !DIEnumerator(name: "Ray_Mesh_Tests_Succeeded", value: 53, isUnsigned: true)
!248 = !DIEnumerator(name: "Ray_Plane_Tests", value: 54, isUnsigned: true)
!249 = !DIEnumerator(name: "Ray_Plane_Tests_Succeeded", value: 55, isUnsigned: true)
!250 = !DIEnumerator(name: "Ray_Polygon_Tests", value: 56, isUnsigned: true)
!251 = !DIEnumerator(name: "Ray_Polygon_Tests_Succeeded", value: 57, isUnsigned: true)
!252 = !DIEnumerator(name: "Ray_Prism_Tests", value: 58, isUnsigned: true)
!253 = !DIEnumerator(name: "Ray_Prism_Tests_Succeeded", value: 59, isUnsigned: true)
!254 = !DIEnumerator(name: "Prism_Bound_Tests", value: 60, isUnsigned: true)
!255 = !DIEnumerator(name: "Prism_Bound_Tests_Succeeded", value: 61, isUnsigned: true)
!256 = !DIEnumerator(name: "Ray_Parametric_Tests", value: 62, isUnsigned: true)
!257 = !DIEnumerator(name: "Ray_Parametric_Tests_Succeeded", value: 63, isUnsigned: true)
!258 = !DIEnumerator(name: "Ray_Par_Bound_Tests", value: 64, isUnsigned: true)
!259 = !DIEnumerator(name: "Ray_Par_Bound_Tests_Succeeded", value: 65, isUnsigned: true)
!260 = !DIEnumerator(name: "Ray_Quadric_Tests", value: 66, isUnsigned: true)
!261 = !DIEnumerator(name: "Ray_Quadric_Tests_Succeeded", value: 67, isUnsigned: true)
!262 = !DIEnumerator(name: "Ray_Poly_Tests", value: 68, isUnsigned: true)
!263 = !DIEnumerator(name: "Ray_Poly_Tests_Succeeded", value: 69, isUnsigned: true)
!264 = !DIEnumerator(name: "Ray_Sphere_Tests", value: 70, isUnsigned: true)
!265 = !DIEnumerator(name: "Ray_Sphere_Tests_Succeeded", value: 71, isUnsigned: true)
!266 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests", value: 72, isUnsigned: true)
!267 = !DIEnumerator(name: "Ray_Sphere_Sweep_Tests_Succeeded", value: 73, isUnsigned: true)
!268 = !DIEnumerator(name: "Ray_Superellipsoid_Tests", value: 74, isUnsigned: true)
!269 = !DIEnumerator(name: "Ray_Superellipsoid_Tests_Succeeded", value: 75, isUnsigned: true)
!270 = !DIEnumerator(name: "Ray_Sor_Tests", value: 76, isUnsigned: true)
!271 = !DIEnumerator(name: "Ray_Sor_Tests_Succeeded", value: 77, isUnsigned: true)
!272 = !DIEnumerator(name: "Sor_Bound_Tests", value: 78, isUnsigned: true)
!273 = !DIEnumerator(name: "Sor_Bound_Tests_Succeeded", value: 79, isUnsigned: true)
!274 = !DIEnumerator(name: "Ray_Torus_Tests", value: 80, isUnsigned: true)
!275 = !DIEnumerator(name: "Ray_Torus_Tests_Succeeded", value: 81, isUnsigned: true)
!276 = !DIEnumerator(name: "Torus_Bound_Tests", value: 82, isUnsigned: true)
!277 = !DIEnumerator(name: "Torus_Bound_Tests_Succeeded", value: 83, isUnsigned: true)
!278 = !DIEnumerator(name: "Ray_Triangle_Tests", value: 84, isUnsigned: true)
!279 = !DIEnumerator(name: "Ray_Triangle_Tests_Succeeded", value: 85, isUnsigned: true)
!280 = !DIEnumerator(name: "Ray_TTF_Tests", value: 86, isUnsigned: true)
!281 = !DIEnumerator(name: "Ray_TTF_Tests_Succeeded", value: 87, isUnsigned: true)
!282 = !DIEnumerator(name: "Bounding_Region_Tests", value: 88, isUnsigned: true)
!283 = !DIEnumerator(name: "Bounding_Region_Tests_Succeeded", value: 89, isUnsigned: true)
!284 = !DIEnumerator(name: "Clipping_Region_Tests", value: 90, isUnsigned: true)
!285 = !DIEnumerator(name: "Clipping_Region_Tests_Succeeded", value: 91, isUnsigned: true)
!286 = !DIEnumerator(name: "Ray_IsoSurface_Find_Root", value: 92, isUnsigned: true)
!287 = !DIEnumerator(name: "Ray_Function_VM_Calls", value: 93, isUnsigned: true)
!288 = !DIEnumerator(name: "Ray_Function_VM_Instruction_Est", value: 94, isUnsigned: true)
!289 = !DIEnumerator(name: "VBuffer_Tests", value: 95, isUnsigned: true)
!290 = !DIEnumerator(name: "VBuffer_Tests_Succeeded", value: 96, isUnsigned: true)
!291 = !DIEnumerator(name: "LBuffer_Tests", value: 97, isUnsigned: true)
!292 = !DIEnumerator(name: "LBuffer_Tests_Succeeded", value: 98, isUnsigned: true)
!293 = !DIEnumerator(name: "Media_Samples", value: 99, isUnsigned: true)
!294 = !DIEnumerator(name: "Media_Intervals", value: 100, isUnsigned: true)
!295 = !DIEnumerator(name: "Reflected_Rays_Traced", value: 101, isUnsigned: true)
!296 = !DIEnumerator(name: "Refracted_Rays_Traced", value: 102, isUnsigned: true)
!297 = !DIEnumerator(name: "Transmitted_Rays_Traced", value: 103, isUnsigned: true)
!298 = !DIEnumerator(name: "Internal_Reflected_Rays_Traced", value: 104, isUnsigned: true)
!299 = !DIEnumerator(name: "Shadow_Cache_Hits", value: 105, isUnsigned: true)
!300 = !DIEnumerator(name: "Shadow_Rays_Succeeded", value: 106, isUnsigned: true)
!301 = !DIEnumerator(name: "Shadow_Ray_Tests", value: 107, isUnsigned: true)
!302 = !DIEnumerator(name: "nChecked", value: 108, isUnsigned: true)
!303 = !DIEnumerator(name: "nEnqueued", value: 109, isUnsigned: true)
!304 = !DIEnumerator(name: "totalQueues", value: 110, isUnsigned: true)
!305 = !DIEnumerator(name: "totalQueueResets", value: 111, isUnsigned: true)
!306 = !DIEnumerator(name: "totalQueueResizes", value: 112, isUnsigned: true)
!307 = !DIEnumerator(name: "Polynomials_Tested", value: 113, isUnsigned: true)
!308 = !DIEnumerator(name: "Roots_Eliminated", value: 114, isUnsigned: true)
!309 = !DIEnumerator(name: "Number_Of_Photons_Shot", value: 115, isUnsigned: true)
!310 = !DIEnumerator(name: "Number_Of_Photons_Stored", value: 116, isUnsigned: true)
!311 = !DIEnumerator(name: "Number_Of_Global_Photons_Stored", value: 117, isUnsigned: true)
!312 = !DIEnumerator(name: "Number_Of_Media_Photons_Stored", value: 118, isUnsigned: true)
!313 = !DIEnumerator(name: "Priority_Queue_Add", value: 119, isUnsigned: true)
!314 = !DIEnumerator(name: "Priority_Queue_Remove", value: 120, isUnsigned: true)
!315 = !DIEnumerator(name: "Gather_Performed_Count", value: 121, isUnsigned: true)
!316 = !DIEnumerator(name: "Gather_Expanded_Count", value: 122, isUnsigned: true)
!317 = !DIEnumerator(name: "MaxStat", value: 123, isUnsigned: true)
!318 = !{!319, !4, !117, !62}
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "FRACTAL", scope: !2, file: !166, line: 76, baseType: !321)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Fractal_Struct", scope: !2, file: !166, line: 84, size: 2560, flags: DIFlagTypePassByValue, elements: !322, identifier: "_ZTSN3pov14Fractal_StructE")
!322 = !{!323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !356, !361, !366, !371, !372}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "Methods", scope: !321, file: !166, line: 86, baseType: !37, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !321, file: !166, line: 86, baseType: !31, size: 32, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "Sibling", scope: !321, file: !166, line: 86, baseType: !32, size: 64, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "Texture", scope: !321, file: !166, line: 86, baseType: !41, size: 64, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "Interior_Texture", scope: !321, file: !166, line: 86, baseType: !41, size: 64, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "Interior", scope: !321, file: !166, line: 86, baseType: !46, size: 64, offset: 320)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "Bound", scope: !321, file: !166, line: 86, baseType: !32, size: 64, offset: 384)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "Clip", scope: !321, file: !166, line: 86, baseType: !32, size: 64, offset: 448)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "LLights", scope: !321, file: !166, line: 86, baseType: !52, size: 64, offset: 512)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "BBox", scope: !321, file: !166, line: 86, baseType: !56, size: 192, offset: 576)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "Trans", scope: !321, file: !166, line: 86, baseType: !66, size: 64, offset: 768)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "UV_Trans", scope: !321, file: !166, line: 86, baseType: !66, size: 64, offset: 832)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "Ph_Density", scope: !321, file: !166, line: 86, baseType: !63, size: 32, offset: 896)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !321, file: !166, line: 86, baseType: !72, size: 32, offset: 928)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "Center", scope: !321, file: !166, line: 87, baseType: !16, size: 192, offset: 960)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "Julia_Parm", scope: !321, file: !166, line: 88, baseType: !339, size: 256, offset: 1152)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 256, elements: !340)
!340 = !{!341}
!341 = !DISubrange(count: 4)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "Slice", scope: !321, file: !166, line: 89, baseType: !339, size: 256, offset: 1408)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "SliceDist", scope: !321, file: !166, line: 90, baseType: !5, size: 64, offset: 1664)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "Exit_Value", scope: !321, file: !166, line: 91, baseType: !5, size: 64, offset: 1728)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !321, file: !166, line: 92, baseType: !31, size: 32, offset: 1792)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "Precision", scope: !321, file: !166, line: 93, baseType: !5, size: 64, offset: 1856)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "Inverted", scope: !321, file: !166, line: 94, baseType: !31, size: 32, offset: 1920)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "Algebra", scope: !321, file: !166, line: 96, baseType: !31, size: 32, offset: 1952)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "Sub_Type", scope: !321, file: !166, line: 97, baseType: !31, size: 32, offset: 1984)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "exponent", scope: !321, file: !166, line: 98, baseType: !171, size: 128, offset: 2048)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "Normal_Calc_Method", scope: !321, file: !166, line: 100, baseType: !352, size: 64, offset: 2176)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "NORMAL_CALC_METHOD", scope: !2, file: !166, line: 78, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{null, !4, !31, !319}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "Iteration_Method", scope: !321, file: !166, line: 101, baseType: !357, size: 64, offset: 2240)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "ITERATION_METHOD", scope: !2, file: !166, line: 79, baseType: !358)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{!31, !4, !319}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "D_Iteration_Method", scope: !321, file: !166, line: 102, baseType: !362, size: 64, offset: 2304)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "D_ITERATION_METHOD", scope: !2, file: !166, line: 80, baseType: !363)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{!31, !4, !319, !4}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "F_Bound_Method", scope: !321, file: !166, line: 103, baseType: !367, size: 64, offset: 2368)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "F_BOUND_METHOD", scope: !2, file: !166, line: 81, baseType: !368)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DISubroutineType(types: !370)
!370 = !{!31, !73, !319, !4, !4}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "Complex_Function_Method", scope: !321, file: !166, line: 104, baseType: !165, size: 64, offset: 2432)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "Radius_Squared", scope: !321, file: !166, line: 106, baseType: !5, size: 64, offset: 2496)
!373 = !{!0, !6, !8, !10, !12, !14, !21, !374, !180, !161, !178}
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression(DW_OP_constu, 4502148214488346440, DW_OP_stack_value))
!375 = distinct !DIGlobalVariable(name: "Fractal_Tolerance", scope: !2, file: !3, line: 51, type: !376, isLocal: true, isDefinition: true)
!376 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!377 = !{!378, !385, !391, !393, !395, !399, !401, !403, !405, !407, !409, !411, !413, !418, !422, !424, !426, !430, !432, !434, !436, !438, !440, !442, !445, !447, !449, !453, !458, !460, !462, !464, !466, !468, !470, !472, !474, !476, !478, !482, !486, !488, !490, !492, !494, !496, !498, !500, !502, !504, !506, !508, !510, !512, !514, !516, !520, !524, !528, !530, !532, !534, !536, !538, !540, !542, !544, !546, !550, !554, !558, !560, !562, !564, !569, !573, !577, !579, !581, !583, !585, !587, !589, !591, !593, !595, !597, !599, !601, !606, !610, !614, !616, !618, !620, !627, !631, !635, !637, !639, !641, !643, !645, !647, !651, !655, !657, !659, !661, !663, !667, !671, !675, !677, !679, !681, !683, !685, !687, !691, !695, !699, !701, !705, !709, !711, !713, !715, !717, !719, !721, !727, !732, !736, !742, !746, !751, !753, !755, !759, !763, !776, !780, !784, !788, !792, !797, !801, !805, !809, !813, !821, !825, !829, !831, !835, !839, !843, !849, !853, !857, !859, !867, !871, !878, !880, !884, !888, !892, !896, !901, !905, !909, !910, !911, !912, !914, !915, !916, !917, !918, !919, !920, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !957, !959, !961, !963, !965, !967, !969, !971, !973, !975, !977, !979, !981, !983, !989, !993, !999, !1003, !1007, !1011, !1015, !1017, !1019, !1023, !1027, !1031, !1035, !1039, !1041, !1043, !1045, !1049, !1053, !1057, !1059, !1061, !1064, !1066, !1067, !1069, !1071, !1073, !1075, !1077, !1079, !1081, !1083, !1085, !1087, !1088, !1089, !1090, !1092, !1094, !1096, !1098, !1099, !1101, !1103}
!378 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !380, file: !384, line: 52)
!379 = !DINamespace(name: "std", scope: null)
!380 = !DISubprogram(name: "abs", scope: !381, file: !381, line: 840, type: !382, flags: DIFlagPrototyped, spFlags: 0)
!381 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!382 = !DISubroutineType(types: !383)
!383 = !{!31, !31}
!384 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/std_abs.h", directory: "")
!385 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !386, file: !390, line: 83)
!386 = !DISubprogram(name: "acos", scope: !387, file: !387, line: 53, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!387 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/mathcalls.h", directory: "")
!388 = !DISubroutineType(types: !389)
!389 = !{!5, !5}
!390 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cmath", directory: "")
!391 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !392, file: !390, line: 102)
!392 = !DISubprogram(name: "asin", scope: !387, file: !387, line: 55, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!393 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !394, file: !390, line: 121)
!394 = !DISubprogram(name: "atan", scope: !387, file: !387, line: 57, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!395 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !396, file: !390, line: 140)
!396 = !DISubprogram(name: "atan2", scope: !387, file: !387, line: 59, type: !397, flags: DIFlagPrototyped, spFlags: 0)
!397 = !DISubroutineType(types: !398)
!398 = !{!5, !5, !5}
!399 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !400, file: !390, line: 161)
!400 = !DISubprogram(name: "ceil", scope: !387, file: !387, line: 159, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!401 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !402, file: !390, line: 180)
!402 = !DISubprogram(name: "cos", scope: !387, file: !387, line: 62, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!403 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !404, file: !390, line: 199)
!404 = !DISubprogram(name: "cosh", scope: !387, file: !387, line: 71, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!405 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !406, file: !390, line: 218)
!406 = !DISubprogram(name: "exp", scope: !387, file: !387, line: 95, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!407 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !408, file: !390, line: 237)
!408 = !DISubprogram(name: "fabs", scope: !387, file: !387, line: 162, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!409 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !410, file: !390, line: 256)
!410 = !DISubprogram(name: "floor", scope: !387, file: !387, line: 165, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!411 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !412, file: !390, line: 275)
!412 = !DISubprogram(name: "fmod", scope: !387, file: !387, line: 168, type: !397, flags: DIFlagPrototyped, spFlags: 0)
!413 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !414, file: !390, line: 296)
!414 = !DISubprogram(name: "frexp", scope: !387, file: !387, line: 98, type: !415, flags: DIFlagPrototyped, spFlags: 0)
!415 = !DISubroutineType(types: !416)
!416 = !{!5, !5, !417}
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!418 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !419, file: !390, line: 315)
!419 = !DISubprogram(name: "ldexp", scope: !387, file: !387, line: 101, type: !420, flags: DIFlagPrototyped, spFlags: 0)
!420 = !DISubroutineType(types: !421)
!421 = !{!5, !5, !31}
!422 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !423, file: !390, line: 334)
!423 = !DISubprogram(name: "log", scope: !387, file: !387, line: 104, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!424 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !425, file: !390, line: 353)
!425 = !DISubprogram(name: "log10", scope: !387, file: !387, line: 107, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!426 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !427, file: !390, line: 372)
!427 = !DISubprogram(name: "modf", scope: !387, file: !387, line: 110, type: !428, flags: DIFlagPrototyped, spFlags: 0)
!428 = !DISubroutineType(types: !429)
!429 = !{!5, !5, !4}
!430 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !431, file: !390, line: 384)
!431 = !DISubprogram(name: "pow", scope: !387, file: !387, line: 140, type: !397, flags: DIFlagPrototyped, spFlags: 0)
!432 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !433, file: !390, line: 421)
!433 = !DISubprogram(name: "sin", scope: !387, file: !387, line: 64, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!434 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !435, file: !390, line: 440)
!435 = !DISubprogram(name: "sinh", scope: !387, file: !387, line: 73, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!436 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !437, file: !390, line: 459)
!437 = !DISubprogram(name: "sqrt", scope: !387, file: !387, line: 143, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!438 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !439, file: !390, line: 478)
!439 = !DISubprogram(name: "tan", scope: !387, file: !387, line: 66, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!440 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !441, file: !390, line: 497)
!441 = !DISubprogram(name: "tanh", scope: !387, file: !387, line: 75, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!442 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !443, file: !390, line: 1065)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_t", file: !444, line: 150, baseType: !5)
!444 = !DIFile(filename: "/usr/include/math.h", directory: "")
!445 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !446, file: !390, line: 1066)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "float_t", file: !444, line: 149, baseType: !63)
!447 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !448, file: !390, line: 1069)
!448 = !DISubprogram(name: "acosh", scope: !387, file: !387, line: 85, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!449 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !450, file: !390, line: 1070)
!450 = !DISubprogram(name: "acoshf", scope: !387, file: !387, line: 85, type: !451, flags: DIFlagPrototyped, spFlags: 0)
!451 = !DISubroutineType(types: !452)
!452 = !{!63, !63}
!453 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !454, file: !390, line: 1071)
!454 = !DISubprogram(name: "acoshl", scope: !387, file: !387, line: 85, type: !455, flags: DIFlagPrototyped, spFlags: 0)
!455 = !DISubroutineType(types: !456)
!456 = !{!457, !457}
!457 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!458 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !459, file: !390, line: 1073)
!459 = !DISubprogram(name: "asinh", scope: !387, file: !387, line: 87, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!460 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !461, file: !390, line: 1074)
!461 = !DISubprogram(name: "asinhf", scope: !387, file: !387, line: 87, type: !451, flags: DIFlagPrototyped, spFlags: 0)
!462 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !463, file: !390, line: 1075)
!463 = !DISubprogram(name: "asinhl", scope: !387, file: !387, line: 87, type: !455, flags: DIFlagPrototyped, spFlags: 0)
!464 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !465, file: !390, line: 1077)
!465 = !DISubprogram(name: "atanh", scope: !387, file: !387, line: 89, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!466 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !467, file: !390, line: 1078)
!467 = !DISubprogram(name: "atanhf", scope: !387, file: !387, line: 89, type: !451, flags: DIFlagPrototyped, spFlags: 0)
!468 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !469, file: !390, line: 1079)
!469 = !DISubprogram(name: "atanhl", scope: !387, file: !387, line: 89, type: !455, flags: DIFlagPrototyped, spFlags: 0)
!470 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !471, file: !390, line: 1081)
!471 = !DISubprogram(name: "cbrt", scope: !387, file: !387, line: 152, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!472 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !473, file: !390, line: 1082)
!473 = !DISubprogram(name: "cbrtf", scope: !387, file: !387, line: 152, type: !451, flags: DIFlagPrototyped, spFlags: 0)
!474 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !475, file: !390, line: 1083)
!475 = !DISubprogram(name: "cbrtl", scope: !387, file: !387, line: 152, type: !455, flags: DIFlagPrototyped, spFlags: 0)
!476 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !477, file: !390, line: 1085)
!477 = !DISubprogram(name: "copysign", scope: !387, file: !387, line: 196, type: !397, flags: DIFlagPrototyped, spFlags: 0)
!478 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !479, file: !390, line: 1086)
!479 = !DISubprogram(name: "copysignf", scope: !387, file: !387, line: 196, type: !480, flags: DIFlagPrototyped, spFlags: 0)
!480 = !DISubroutineType(types: !481)
!481 = !{!63, !63, !63}
!482 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !483, file: !390, line: 1087)
!483 = !DISubprogram(name: "copysignl", scope: !387, file: !387, line: 196, type: !484, flags: DIFlagPrototyped, spFlags: 0)
!484 = !DISubroutineType(types: !485)
!485 = !{!457, !457, !457}
!486 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !487, file: !390, line: 1089)
!487 = !DISubprogram(name: "erf", scope: !387, file: !387, line: 228, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!488 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !489, file: !390, line: 1090)
!489 = !DISubprogram(name: "erff", scope: !387, file: !387, line: 228, type: !451, flags: DIFlagPrototyped, spFlags: 0)
!490 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !491, file: !390, line: 1091)
!491 = !DISubprogram(name: "erfl", scope: !387, file: !387, line: 228, type: !455, flags: DIFlagPrototyped, spFlags: 0)
!492 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !493, file: !390, line: 1093)
!493 = !DISubprogram(name: "erfc", scope: !387, file: !387, line: 229, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!494 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !495, file: !390, line: 1094)
!495 = !DISubprogram(name: "erfcf", scope: !387, file: !387, line: 229, type: !451, flags: DIFlagPrototyped, spFlags: 0)
!496 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !497, file: !390, line: 1095)
!497 = !DISubprogram(name: "erfcl", scope: !387, file: !387, line: 229, type: !455, flags: DIFlagPrototyped, spFlags: 0)
!498 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !499, file: !390, line: 1097)
!499 = !DISubprogram(name: "exp2", scope: !387, file: !387, line: 130, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!500 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !501, file: !390, line: 1098)
!501 = !DISubprogram(name: "exp2f", scope: !387, file: !387, line: 130, type: !451, flags: DIFlagPrototyped, spFlags: 0)
!502 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !503, file: !390, line: 1099)
!503 = !DISubprogram(name: "exp2l", scope: !387, file: !387, line: 130, type: !455, flags: DIFlagPrototyped, spFlags: 0)
!504 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !505, file: !390, line: 1101)
!505 = !DISubprogram(name: "expm1", scope: !387, file: !387, line: 119, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!506 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !507, file: !390, line: 1102)
!507 = !DISubprogram(name: "expm1f", scope: !387, file: !387, line: 119, type: !451, flags: DIFlagPrototyped, spFlags: 0)
!508 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !509, file: !390, line: 1103)
!509 = !DISubprogram(name: "expm1l", scope: !387, file: !387, line: 119, type: !455, flags: DIFlagPrototyped, spFlags: 0)
!510 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !511, file: !390, line: 1105)
!511 = !DISubprogram(name: "fdim", scope: !387, file: !387, line: 326, type: !397, flags: DIFlagPrototyped, spFlags: 0)
!512 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !513, file: !390, line: 1106)
!513 = !DISubprogram(name: "fdimf", scope: !387, file: !387, line: 326, type: !480, flags: DIFlagPrototyped, spFlags: 0)
!514 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !515, file: !390, line: 1107)
!515 = !DISubprogram(name: "fdiml", scope: !387, file: !387, line: 326, type: !484, flags: DIFlagPrototyped, spFlags: 0)
!516 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !517, file: !390, line: 1109)
!517 = !DISubprogram(name: "fma", scope: !387, file: !387, line: 335, type: !518, flags: DIFlagPrototyped, spFlags: 0)
!518 = !DISubroutineType(types: !519)
!519 = !{!5, !5, !5, !5}
!520 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !521, file: !390, line: 1110)
!521 = !DISubprogram(name: "fmaf", scope: !387, file: !387, line: 335, type: !522, flags: DIFlagPrototyped, spFlags: 0)
!522 = !DISubroutineType(types: !523)
!523 = !{!63, !63, !63, !63}
!524 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !525, file: !390, line: 1111)
!525 = !DISubprogram(name: "fmal", scope: !387, file: !387, line: 335, type: !526, flags: DIFlagPrototyped, spFlags: 0)
!526 = !DISubroutineType(types: !527)
!527 = !{!457, !457, !457, !457}
!528 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !529, file: !390, line: 1113)
!529 = !DISubprogram(name: "fmax", scope: !387, file: !387, line: 329, type: !397, flags: DIFlagPrototyped, spFlags: 0)
!530 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !531, file: !390, line: 1114)
!531 = !DISubprogram(name: "fmaxf", scope: !387, file: !387, line: 329, type: !480, flags: DIFlagPrototyped, spFlags: 0)
!532 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !533, file: !390, line: 1115)
!533 = !DISubprogram(name: "fmaxl", scope: !387, file: !387, line: 329, type: !484, flags: DIFlagPrototyped, spFlags: 0)
!534 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !535, file: !390, line: 1117)
!535 = !DISubprogram(name: "fmin", scope: !387, file: !387, line: 332, type: !397, flags: DIFlagPrototyped, spFlags: 0)
!536 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !537, file: !390, line: 1118)
!537 = !DISubprogram(name: "fminf", scope: !387, file: !387, line: 332, type: !480, flags: DIFlagPrototyped, spFlags: 0)
!538 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !539, file: !390, line: 1119)
!539 = !DISubprogram(name: "fminl", scope: !387, file: !387, line: 332, type: !484, flags: DIFlagPrototyped, spFlags: 0)
!540 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !541, file: !390, line: 1121)
!541 = !DISubprogram(name: "hypot", scope: !387, file: !387, line: 147, type: !397, flags: DIFlagPrototyped, spFlags: 0)
!542 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !543, file: !390, line: 1122)
!543 = !DISubprogram(name: "hypotf", scope: !387, file: !387, line: 147, type: !480, flags: DIFlagPrototyped, spFlags: 0)
!544 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !545, file: !390, line: 1123)
!545 = !DISubprogram(name: "hypotl", scope: !387, file: !387, line: 147, type: !484, flags: DIFlagPrototyped, spFlags: 0)
!546 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !547, file: !390, line: 1125)
!547 = !DISubprogram(name: "ilogb", scope: !387, file: !387, line: 280, type: !548, flags: DIFlagPrototyped, spFlags: 0)
!548 = !DISubroutineType(types: !549)
!549 = !{!31, !5}
!550 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !551, file: !390, line: 1126)
!551 = !DISubprogram(name: "ilogbf", scope: !387, file: !387, line: 280, type: !552, flags: DIFlagPrototyped, spFlags: 0)
!552 = !DISubroutineType(types: !553)
!553 = !{!31, !63}
!554 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !555, file: !390, line: 1127)
!555 = !DISubprogram(name: "ilogbl", scope: !387, file: !387, line: 280, type: !556, flags: DIFlagPrototyped, spFlags: 0)
!556 = !DISubroutineType(types: !557)
!557 = !{!31, !457}
!558 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !559, file: !390, line: 1129)
!559 = !DISubprogram(name: "lgamma", scope: !387, file: !387, line: 230, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!560 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !561, file: !390, line: 1130)
!561 = !DISubprogram(name: "lgammaf", scope: !387, file: !387, line: 230, type: !451, flags: DIFlagPrototyped, spFlags: 0)
!562 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !563, file: !390, line: 1131)
!563 = !DISubprogram(name: "lgammal", scope: !387, file: !387, line: 230, type: !455, flags: DIFlagPrototyped, spFlags: 0)
!564 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !565, file: !390, line: 1134)
!565 = !DISubprogram(name: "llrint", scope: !387, file: !387, line: 316, type: !566, flags: DIFlagPrototyped, spFlags: 0)
!566 = !DISubroutineType(types: !567)
!567 = !{!568, !5}
!568 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!569 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !570, file: !390, line: 1135)
!570 = !DISubprogram(name: "llrintf", scope: !387, file: !387, line: 316, type: !571, flags: DIFlagPrototyped, spFlags: 0)
!571 = !DISubroutineType(types: !572)
!572 = !{!568, !63}
!573 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !574, file: !390, line: 1136)
!574 = !DISubprogram(name: "llrintl", scope: !387, file: !387, line: 316, type: !575, flags: DIFlagPrototyped, spFlags: 0)
!575 = !DISubroutineType(types: !576)
!576 = !{!568, !457}
!577 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !578, file: !390, line: 1138)
!578 = !DISubprogram(name: "llround", scope: !387, file: !387, line: 322, type: !566, flags: DIFlagPrototyped, spFlags: 0)
!579 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !580, file: !390, line: 1139)
!580 = !DISubprogram(name: "llroundf", scope: !387, file: !387, line: 322, type: !571, flags: DIFlagPrototyped, spFlags: 0)
!581 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !582, file: !390, line: 1140)
!582 = !DISubprogram(name: "llroundl", scope: !387, file: !387, line: 322, type: !575, flags: DIFlagPrototyped, spFlags: 0)
!583 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !584, file: !390, line: 1143)
!584 = !DISubprogram(name: "log1p", scope: !387, file: !387, line: 122, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!585 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !586, file: !390, line: 1144)
!586 = !DISubprogram(name: "log1pf", scope: !387, file: !387, line: 122, type: !451, flags: DIFlagPrototyped, spFlags: 0)
!587 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !588, file: !390, line: 1145)
!588 = !DISubprogram(name: "log1pl", scope: !387, file: !387, line: 122, type: !455, flags: DIFlagPrototyped, spFlags: 0)
!589 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !590, file: !390, line: 1147)
!590 = !DISubprogram(name: "log2", scope: !387, file: !387, line: 133, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!591 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !592, file: !390, line: 1148)
!592 = !DISubprogram(name: "log2f", scope: !387, file: !387, line: 133, type: !451, flags: DIFlagPrototyped, spFlags: 0)
!593 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !594, file: !390, line: 1149)
!594 = !DISubprogram(name: "log2l", scope: !387, file: !387, line: 133, type: !455, flags: DIFlagPrototyped, spFlags: 0)
!595 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !596, file: !390, line: 1151)
!596 = !DISubprogram(name: "logb", scope: !387, file: !387, line: 125, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!597 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !598, file: !390, line: 1152)
!598 = !DISubprogram(name: "logbf", scope: !387, file: !387, line: 125, type: !451, flags: DIFlagPrototyped, spFlags: 0)
!599 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !600, file: !390, line: 1153)
!600 = !DISubprogram(name: "logbl", scope: !387, file: !387, line: 125, type: !455, flags: DIFlagPrototyped, spFlags: 0)
!601 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !602, file: !390, line: 1155)
!602 = !DISubprogram(name: "lrint", scope: !387, file: !387, line: 314, type: !603, flags: DIFlagPrototyped, spFlags: 0)
!603 = !DISubroutineType(types: !604)
!604 = !{!605, !5}
!605 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!606 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !607, file: !390, line: 1156)
!607 = !DISubprogram(name: "lrintf", scope: !387, file: !387, line: 314, type: !608, flags: DIFlagPrototyped, spFlags: 0)
!608 = !DISubroutineType(types: !609)
!609 = !{!605, !63}
!610 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !611, file: !390, line: 1157)
!611 = !DISubprogram(name: "lrintl", scope: !387, file: !387, line: 314, type: !612, flags: DIFlagPrototyped, spFlags: 0)
!612 = !DISubroutineType(types: !613)
!613 = !{!605, !457}
!614 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !615, file: !390, line: 1159)
!615 = !DISubprogram(name: "lround", scope: !387, file: !387, line: 320, type: !603, flags: DIFlagPrototyped, spFlags: 0)
!616 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !617, file: !390, line: 1160)
!617 = !DISubprogram(name: "lroundf", scope: !387, file: !387, line: 320, type: !608, flags: DIFlagPrototyped, spFlags: 0)
!618 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !619, file: !390, line: 1161)
!619 = !DISubprogram(name: "lroundl", scope: !387, file: !387, line: 320, type: !612, flags: DIFlagPrototyped, spFlags: 0)
!620 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !621, file: !390, line: 1163)
!621 = !DISubprogram(name: "nan", scope: !387, file: !387, line: 201, type: !622, flags: DIFlagPrototyped, spFlags: 0)
!622 = !DISubroutineType(types: !623)
!623 = !{!5, !624}
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !626)
!626 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!627 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !628, file: !390, line: 1164)
!628 = !DISubprogram(name: "nanf", scope: !387, file: !387, line: 201, type: !629, flags: DIFlagPrototyped, spFlags: 0)
!629 = !DISubroutineType(types: !630)
!630 = !{!63, !624}
!631 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !632, file: !390, line: 1165)
!632 = !DISubprogram(name: "nanl", scope: !387, file: !387, line: 201, type: !633, flags: DIFlagPrototyped, spFlags: 0)
!633 = !DISubroutineType(types: !634)
!634 = !{!457, !624}
!635 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !636, file: !390, line: 1167)
!636 = !DISubprogram(name: "nearbyint", scope: !387, file: !387, line: 294, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!637 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !638, file: !390, line: 1168)
!638 = !DISubprogram(name: "nearbyintf", scope: !387, file: !387, line: 294, type: !451, flags: DIFlagPrototyped, spFlags: 0)
!639 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !640, file: !390, line: 1169)
!640 = !DISubprogram(name: "nearbyintl", scope: !387, file: !387, line: 294, type: !455, flags: DIFlagPrototyped, spFlags: 0)
!641 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !642, file: !390, line: 1171)
!642 = !DISubprogram(name: "nextafter", scope: !387, file: !387, line: 259, type: !397, flags: DIFlagPrototyped, spFlags: 0)
!643 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !644, file: !390, line: 1172)
!644 = !DISubprogram(name: "nextafterf", scope: !387, file: !387, line: 259, type: !480, flags: DIFlagPrototyped, spFlags: 0)
!645 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !646, file: !390, line: 1173)
!646 = !DISubprogram(name: "nextafterl", scope: !387, file: !387, line: 259, type: !484, flags: DIFlagPrototyped, spFlags: 0)
!647 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !648, file: !390, line: 1175)
!648 = !DISubprogram(name: "nexttoward", scope: !387, file: !387, line: 261, type: !649, flags: DIFlagPrototyped, spFlags: 0)
!649 = !DISubroutineType(types: !650)
!650 = !{!5, !5, !457}
!651 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !652, file: !390, line: 1176)
!652 = !DISubprogram(name: "nexttowardf", scope: !387, file: !387, line: 261, type: !653, flags: DIFlagPrototyped, spFlags: 0)
!653 = !DISubroutineType(types: !654)
!654 = !{!63, !63, !457}
!655 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !656, file: !390, line: 1177)
!656 = !DISubprogram(name: "nexttowardl", scope: !387, file: !387, line: 261, type: !484, flags: DIFlagPrototyped, spFlags: 0)
!657 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !658, file: !390, line: 1179)
!658 = !DISubprogram(name: "remainder", scope: !387, file: !387, line: 272, type: !397, flags: DIFlagPrototyped, spFlags: 0)
!659 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !660, file: !390, line: 1180)
!660 = !DISubprogram(name: "remainderf", scope: !387, file: !387, line: 272, type: !480, flags: DIFlagPrototyped, spFlags: 0)
!661 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !662, file: !390, line: 1181)
!662 = !DISubprogram(name: "remainderl", scope: !387, file: !387, line: 272, type: !484, flags: DIFlagPrototyped, spFlags: 0)
!663 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !664, file: !390, line: 1183)
!664 = !DISubprogram(name: "remquo", scope: !387, file: !387, line: 307, type: !665, flags: DIFlagPrototyped, spFlags: 0)
!665 = !DISubroutineType(types: !666)
!666 = !{!5, !5, !5, !417}
!667 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !668, file: !390, line: 1184)
!668 = !DISubprogram(name: "remquof", scope: !387, file: !387, line: 307, type: !669, flags: DIFlagPrototyped, spFlags: 0)
!669 = !DISubroutineType(types: !670)
!670 = !{!63, !63, !63, !417}
!671 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !672, file: !390, line: 1185)
!672 = !DISubprogram(name: "remquol", scope: !387, file: !387, line: 307, type: !673, flags: DIFlagPrototyped, spFlags: 0)
!673 = !DISubroutineType(types: !674)
!674 = !{!457, !457, !457, !417}
!675 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !676, file: !390, line: 1187)
!676 = !DISubprogram(name: "rint", scope: !387, file: !387, line: 256, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!677 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !678, file: !390, line: 1188)
!678 = !DISubprogram(name: "rintf", scope: !387, file: !387, line: 256, type: !451, flags: DIFlagPrototyped, spFlags: 0)
!679 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !680, file: !390, line: 1189)
!680 = !DISubprogram(name: "rintl", scope: !387, file: !387, line: 256, type: !455, flags: DIFlagPrototyped, spFlags: 0)
!681 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !682, file: !390, line: 1191)
!682 = !DISubprogram(name: "round", scope: !387, file: !387, line: 298, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!683 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !684, file: !390, line: 1192)
!684 = !DISubprogram(name: "roundf", scope: !387, file: !387, line: 298, type: !451, flags: DIFlagPrototyped, spFlags: 0)
!685 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !686, file: !390, line: 1193)
!686 = !DISubprogram(name: "roundl", scope: !387, file: !387, line: 298, type: !455, flags: DIFlagPrototyped, spFlags: 0)
!687 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !688, file: !390, line: 1195)
!688 = !DISubprogram(name: "scalbln", scope: !387, file: !387, line: 290, type: !689, flags: DIFlagPrototyped, spFlags: 0)
!689 = !DISubroutineType(types: !690)
!690 = !{!5, !5, !605}
!691 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !692, file: !390, line: 1196)
!692 = !DISubprogram(name: "scalblnf", scope: !387, file: !387, line: 290, type: !693, flags: DIFlagPrototyped, spFlags: 0)
!693 = !DISubroutineType(types: !694)
!694 = !{!63, !63, !605}
!695 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !696, file: !390, line: 1197)
!696 = !DISubprogram(name: "scalblnl", scope: !387, file: !387, line: 290, type: !697, flags: DIFlagPrototyped, spFlags: 0)
!697 = !DISubroutineType(types: !698)
!698 = !{!457, !457, !605}
!699 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !700, file: !390, line: 1199)
!700 = !DISubprogram(name: "scalbn", scope: !387, file: !387, line: 276, type: !420, flags: DIFlagPrototyped, spFlags: 0)
!701 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !702, file: !390, line: 1200)
!702 = !DISubprogram(name: "scalbnf", scope: !387, file: !387, line: 276, type: !703, flags: DIFlagPrototyped, spFlags: 0)
!703 = !DISubroutineType(types: !704)
!704 = !{!63, !63, !31}
!705 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !706, file: !390, line: 1201)
!706 = !DISubprogram(name: "scalbnl", scope: !387, file: !387, line: 276, type: !707, flags: DIFlagPrototyped, spFlags: 0)
!707 = !DISubroutineType(types: !708)
!708 = !{!457, !457, !31}
!709 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !710, file: !390, line: 1203)
!710 = !DISubprogram(name: "tgamma", scope: !387, file: !387, line: 235, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!711 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !712, file: !390, line: 1204)
!712 = !DISubprogram(name: "tgammaf", scope: !387, file: !387, line: 235, type: !451, flags: DIFlagPrototyped, spFlags: 0)
!713 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !714, file: !390, line: 1205)
!714 = !DISubprogram(name: "tgammal", scope: !387, file: !387, line: 235, type: !455, flags: DIFlagPrototyped, spFlags: 0)
!715 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !716, file: !390, line: 1207)
!716 = !DISubprogram(name: "trunc", scope: !387, file: !387, line: 302, type: !388, flags: DIFlagPrototyped, spFlags: 0)
!717 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !718, file: !390, line: 1208)
!718 = !DISubprogram(name: "truncf", scope: !387, file: !387, line: 302, type: !451, flags: DIFlagPrototyped, spFlags: 0)
!719 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !720, file: !390, line: 1209)
!720 = !DISubprogram(name: "truncl", scope: !387, file: !387, line: 302, type: !455, flags: DIFlagPrototyped, spFlags: 0)
!721 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !183, entity: !722, file: !726, line: 38)
!722 = !DISubprogram(name: "abs", linkageName: "_ZSt3absg", scope: !379, file: !384, line: 103, type: !723, flags: DIFlagPrototyped, spFlags: 0)
!723 = !DISubroutineType(types: !724)
!724 = !{!725, !725}
!725 = !DIBasicType(name: "__float128", size: 128, encoding: DW_ATE_float)
!726 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/math.h", directory: "")
!727 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !183, entity: !728, file: !726, line: 54)
!728 = !DISubprogram(name: "modf", linkageName: "_ZSt4modfePe", scope: !379, file: !390, line: 380, type: !729, flags: DIFlagPrototyped, spFlags: 0)
!729 = !DISubroutineType(types: !730)
!730 = !{!457, !457, !731}
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!732 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !733, file: !735, line: 127)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !381, line: 62, baseType: !734)
!734 = !DICompositeType(tag: DW_TAG_structure_type, file: !381, line: 58, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!735 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cstdlib", directory: "")
!736 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !737, file: !735, line: 128)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !381, line: 70, baseType: !738)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !381, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !739, identifier: "_ZTS6ldiv_t")
!739 = !{!740, !741}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !738, file: !381, line: 68, baseType: !605, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !738, file: !381, line: 69, baseType: !605, size: 64, offset: 64)
!742 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !743, file: !735, line: 130)
!743 = !DISubprogram(name: "abort", scope: !381, file: !381, line: 591, type: !744, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!744 = !DISubroutineType(types: !745)
!745 = !{null}
!746 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !747, file: !735, line: 134)
!747 = !DISubprogram(name: "atexit", scope: !381, file: !381, line: 595, type: !748, flags: DIFlagPrototyped, spFlags: 0)
!748 = !DISubroutineType(types: !749)
!749 = !{!31, !750}
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!751 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !752, file: !735, line: 137)
!752 = !DISubprogram(name: "at_quick_exit", scope: !381, file: !381, line: 600, type: !748, flags: DIFlagPrototyped, spFlags: 0)
!753 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !754, file: !735, line: 140)
!754 = !DISubprogram(name: "atof", scope: !381, file: !381, line: 101, type: !622, flags: DIFlagPrototyped, spFlags: 0)
!755 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !756, file: !735, line: 141)
!756 = !DISubprogram(name: "atoi", scope: !381, file: !381, line: 104, type: !757, flags: DIFlagPrototyped, spFlags: 0)
!757 = !DISubroutineType(types: !758)
!758 = !{!31, !624}
!759 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !760, file: !735, line: 142)
!760 = !DISubprogram(name: "atol", scope: !381, file: !381, line: 107, type: !761, flags: DIFlagPrototyped, spFlags: 0)
!761 = !DISubroutineType(types: !762)
!762 = !{!605, !624}
!763 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !764, file: !735, line: 143)
!764 = !DISubprogram(name: "bsearch", scope: !381, file: !381, line: 820, type: !765, flags: DIFlagPrototyped, spFlags: 0)
!765 = !DISubroutineType(types: !766)
!766 = !{!117, !767, !767, !769, !769, !772}
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !770, line: 46, baseType: !771)
!770 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!771 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !381, line: 808, baseType: !773)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DISubroutineType(types: !775)
!775 = !{!31, !767, !767}
!776 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !777, file: !735, line: 144)
!777 = !DISubprogram(name: "calloc", scope: !381, file: !381, line: 542, type: !778, flags: DIFlagPrototyped, spFlags: 0)
!778 = !DISubroutineType(types: !779)
!779 = !{!117, !769, !769}
!780 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !781, file: !735, line: 145)
!781 = !DISubprogram(name: "div", scope: !381, file: !381, line: 852, type: !782, flags: DIFlagPrototyped, spFlags: 0)
!782 = !DISubroutineType(types: !783)
!783 = !{!733, !31, !31}
!784 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !785, file: !735, line: 146)
!785 = !DISubprogram(name: "exit", scope: !381, file: !381, line: 617, type: !786, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!786 = !DISubroutineType(types: !787)
!787 = !{null, !31}
!788 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !789, file: !735, line: 147)
!789 = !DISubprogram(name: "free", scope: !381, file: !381, line: 565, type: !790, flags: DIFlagPrototyped, spFlags: 0)
!790 = !DISubroutineType(types: !791)
!791 = !{null, !117}
!792 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !793, file: !735, line: 148)
!793 = !DISubprogram(name: "getenv", scope: !381, file: !381, line: 634, type: !794, flags: DIFlagPrototyped, spFlags: 0)
!794 = !DISubroutineType(types: !795)
!795 = !{!796, !624}
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!797 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !798, file: !735, line: 149)
!798 = !DISubprogram(name: "labs", scope: !381, file: !381, line: 841, type: !799, flags: DIFlagPrototyped, spFlags: 0)
!799 = !DISubroutineType(types: !800)
!800 = !{!605, !605}
!801 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !802, file: !735, line: 150)
!802 = !DISubprogram(name: "ldiv", scope: !381, file: !381, line: 854, type: !803, flags: DIFlagPrototyped, spFlags: 0)
!803 = !DISubroutineType(types: !804)
!804 = !{!737, !605, !605}
!805 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !806, file: !735, line: 151)
!806 = !DISubprogram(name: "malloc", scope: !381, file: !381, line: 539, type: !807, flags: DIFlagPrototyped, spFlags: 0)
!807 = !DISubroutineType(types: !808)
!808 = !{!117, !769}
!809 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !810, file: !735, line: 153)
!810 = !DISubprogram(name: "mblen", scope: !381, file: !381, line: 922, type: !811, flags: DIFlagPrototyped, spFlags: 0)
!811 = !DISubroutineType(types: !812)
!812 = !{!31, !624, !769}
!813 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !814, file: !735, line: 154)
!814 = !DISubprogram(name: "mbstowcs", scope: !381, file: !381, line: 933, type: !815, flags: DIFlagPrototyped, spFlags: 0)
!815 = !DISubroutineType(types: !816)
!816 = !{!769, !817, !820, !769}
!817 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !818)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!820 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !624)
!821 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !822, file: !735, line: 155)
!822 = !DISubprogram(name: "mbtowc", scope: !381, file: !381, line: 925, type: !823, flags: DIFlagPrototyped, spFlags: 0)
!823 = !DISubroutineType(types: !824)
!824 = !{!31, !817, !820, !769}
!825 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !826, file: !735, line: 157)
!826 = !DISubprogram(name: "qsort", scope: !381, file: !381, line: 830, type: !827, flags: DIFlagPrototyped, spFlags: 0)
!827 = !DISubroutineType(types: !828)
!828 = !{null, !117, !769, !769, !772}
!829 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !830, file: !735, line: 160)
!830 = !DISubprogram(name: "quick_exit", scope: !381, file: !381, line: 623, type: !786, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!831 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !832, file: !735, line: 163)
!832 = !DISubprogram(name: "rand", scope: !381, file: !381, line: 453, type: !833, flags: DIFlagPrototyped, spFlags: 0)
!833 = !DISubroutineType(types: !834)
!834 = !{!31}
!835 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !836, file: !735, line: 164)
!836 = !DISubprogram(name: "realloc", scope: !381, file: !381, line: 550, type: !837, flags: DIFlagPrototyped, spFlags: 0)
!837 = !DISubroutineType(types: !838)
!838 = !{!117, !117, !769}
!839 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !840, file: !735, line: 165)
!840 = !DISubprogram(name: "srand", scope: !381, file: !381, line: 455, type: !841, flags: DIFlagPrototyped, spFlags: 0)
!841 = !DISubroutineType(types: !842)
!842 = !{null, !72}
!843 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !844, file: !735, line: 166)
!844 = !DISubprogram(name: "strtod", scope: !381, file: !381, line: 117, type: !845, flags: DIFlagPrototyped, spFlags: 0)
!845 = !DISubroutineType(types: !846)
!846 = !{!5, !820, !847}
!847 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !848)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!849 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !850, file: !735, line: 167)
!850 = !DISubprogram(name: "strtol", scope: !381, file: !381, line: 176, type: !851, flags: DIFlagPrototyped, spFlags: 0)
!851 = !DISubroutineType(types: !852)
!852 = !{!605, !820, !847, !31}
!853 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !854, file: !735, line: 168)
!854 = !DISubprogram(name: "strtoul", scope: !381, file: !381, line: 180, type: !855, flags: DIFlagPrototyped, spFlags: 0)
!855 = !DISubroutineType(types: !856)
!856 = !{!771, !820, !847, !31}
!857 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !858, file: !735, line: 169)
!858 = !DISubprogram(name: "system", scope: !381, file: !381, line: 784, type: !757, flags: DIFlagPrototyped, spFlags: 0)
!859 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !860, file: !735, line: 171)
!860 = !DISubprogram(name: "wcstombs", scope: !381, file: !381, line: 936, type: !861, flags: DIFlagPrototyped, spFlags: 0)
!861 = !DISubroutineType(types: !862)
!862 = !{!769, !863, !864, !769}
!863 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !796)
!864 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !865)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !819)
!867 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !868, file: !735, line: 172)
!868 = !DISubprogram(name: "wctomb", scope: !381, file: !381, line: 929, type: !869, flags: DIFlagPrototyped, spFlags: 0)
!869 = !DISubroutineType(types: !870)
!870 = !{!31, !796, !819}
!871 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !872, entity: !873, file: !735, line: 200)
!872 = !DINamespace(name: "__gnu_cxx", scope: null)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !381, line: 80, baseType: !874)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !381, line: 76, size: 128, flags: DIFlagTypePassByValue, elements: !875, identifier: "_ZTS7lldiv_t")
!875 = !{!876, !877}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !874, file: !381, line: 78, baseType: !568, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !874, file: !381, line: 79, baseType: !568, size: 64, offset: 64)
!878 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !872, entity: !879, file: !735, line: 206)
!879 = !DISubprogram(name: "_Exit", scope: !381, file: !381, line: 629, type: !786, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!880 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !872, entity: !881, file: !735, line: 210)
!881 = !DISubprogram(name: "llabs", scope: !381, file: !381, line: 844, type: !882, flags: DIFlagPrototyped, spFlags: 0)
!882 = !DISubroutineType(types: !883)
!883 = !{!568, !568}
!884 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !872, entity: !885, file: !735, line: 216)
!885 = !DISubprogram(name: "lldiv", scope: !381, file: !381, line: 858, type: !886, flags: DIFlagPrototyped, spFlags: 0)
!886 = !DISubroutineType(types: !887)
!887 = !{!873, !568, !568}
!888 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !872, entity: !889, file: !735, line: 227)
!889 = !DISubprogram(name: "atoll", scope: !381, file: !381, line: 112, type: !890, flags: DIFlagPrototyped, spFlags: 0)
!890 = !DISubroutineType(types: !891)
!891 = !{!568, !624}
!892 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !872, entity: !893, file: !735, line: 228)
!893 = !DISubprogram(name: "strtoll", scope: !381, file: !381, line: 200, type: !894, flags: DIFlagPrototyped, spFlags: 0)
!894 = !DISubroutineType(types: !895)
!895 = !{!568, !820, !847, !31}
!896 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !872, entity: !897, file: !735, line: 229)
!897 = !DISubprogram(name: "strtoull", scope: !381, file: !381, line: 205, type: !898, flags: DIFlagPrototyped, spFlags: 0)
!898 = !DISubroutineType(types: !899)
!899 = !{!900, !820, !847, !31}
!900 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!901 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !872, entity: !902, file: !735, line: 231)
!902 = !DISubprogram(name: "strtof", scope: !381, file: !381, line: 123, type: !903, flags: DIFlagPrototyped, spFlags: 0)
!903 = !DISubroutineType(types: !904)
!904 = !{!63, !820, !847}
!905 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !872, entity: !906, file: !735, line: 232)
!906 = !DISubprogram(name: "strtold", scope: !381, file: !381, line: 126, type: !907, flags: DIFlagPrototyped, spFlags: 0)
!907 = !DISubroutineType(types: !908)
!908 = !{!457, !820, !847}
!909 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !873, file: !735, line: 240)
!910 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !879, file: !735, line: 242)
!911 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !881, file: !735, line: 244)
!912 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !913, file: !735, line: 245)
!913 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !872, file: !735, line: 213, type: !886, flags: DIFlagPrototyped, spFlags: 0)
!914 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !885, file: !735, line: 246)
!915 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !889, file: !735, line: 248)
!916 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !902, file: !735, line: 249)
!917 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !893, file: !735, line: 250)
!918 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !897, file: !735, line: 251)
!919 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !379, entity: !906, file: !735, line: 252)
!920 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !183, entity: !743, file: !921, line: 38)
!921 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/stdlib.h", directory: "")
