; ModuleID = 'main.c'
source_filename = "main.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.MAIN_Param = type { i32, i8*, i32, i32, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }

@srcGrid = internal global [26000000 x double]* null, align 8, !dbg !0
@dstGrid = internal global [26000000 x double]* null, align 8, !dbg !25
@.str = private unnamed_addr constant [14 x i8] c"timestep: %i\0A\00", align 1
@.str.1 = private unnamed_addr constant [109 x i8] c"syntax: lbm <time steps> <result file> <0: nil, 1: cmp, 2: str> <0: ldc, 1: channel flow> [<obstacle file>]\0A\00", align 1
@.str.2 = private unnamed_addr constant [55 x i8] c"MAIN_parseCommandLine: cannot stat obstacle file '%s'\0A\00", align 1
@.str.3 = private unnamed_addr constant [82 x i8] c"MAIN_parseCommandLine:\0A\09size of file '%s' is %i bytes\0A\09expected size is %i bytes\0A\00", align 1
@.str.4 = private unnamed_addr constant [53 x i8] c"MAIN_parseCommandLine: cannot stat result file '%s'\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "srcGrid", scope: !2, file: !3, line: 21, type: !27, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !16, globals: !24, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "main.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/519.lbm_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{!5, !12}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 27, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./main.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/519.lbm_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "NOTHING", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "COMPARE", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "STORE", value: 2, isUnsigned: true)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 28, baseType: !7, size: 32, elements: !13)
!13 = !{!14, !15}
!14 = !DIEnumerator(name: "LDC", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "CHANNEL", value: 1, isUnsigned: true)
!16 = !{!17, !18, !19, !20, !21}
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "MAIN_Action", file: !6, line: 27, baseType: !5)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "MAIN_SimType", file: !6, line: 28, baseType: !12)
!19 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!24 = !{!0, !25}
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "dstGrid", scope: !2, file: !3, line: 21, type: !27, isLocal: true, isDefinition: true)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "LBM_GridPtr", file: !28, line: 9, baseType: !29)
!28 = !DIFile(filename: "./lbm_1d_array.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/519.lbm_r/build/build_base_ld-loop-ext-m64.0000")
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "LBM_Grid", file: !28, line: 8, baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 1664000000, elements: !32)
!32 = !{!33}
!33 = !DISubrange(count: 26000000)
!34 = !{i32 7, !"Dwarf Version", i32 4}
!35 = !{i32 2, !"Debug Info Version", i32 3}
!36 = !{i32 1, !"wchar_size", i32 4}
!37 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!38 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 25, type: !39, scopeLine: 25, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !44)
!39 = !DISubroutineType(types: !40)
!40 = !{!19, !19, !41}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = !{}
!45 = !DILocalVariable(name: "nArgs", arg: 1, scope: !38, file: !3, line: 25, type: !19)
!46 = !DILocation(line: 25, column: 15, scope: !38)
!47 = !DILocalVariable(name: "arg", arg: 2, scope: !38, file: !3, line: 25, type: !41)
!48 = !DILocation(line: 25, column: 28, scope: !38)
!49 = !DILocalVariable(name: "param", scope: !38, file: !3, line: 26, type: !50)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "MAIN_Param", file: !6, line: 36, baseType: !51)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 30, size: 256, elements: !52)
!52 = !{!53, !54, !55, !56, !57}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "nTimeSteps", scope: !51, file: !6, line: 31, baseType: !19, size: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "resultFilename", scope: !51, file: !6, line: 32, baseType: !42, size: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !51, file: !6, line: 33, baseType: !17, size: 32, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "simType", scope: !51, file: !6, line: 34, baseType: !18, size: 32, offset: 160)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleFilename", scope: !51, file: !6, line: 35, baseType: !42, size: 64, offset: 192)
!58 = !DILocation(line: 26, column: 13, scope: !38)
!59 = !DILocalVariable(name: "t", scope: !38, file: !3, line: 30, type: !19)
!60 = !DILocation(line: 30, column: 6, scope: !38)
!61 = !DILocation(line: 32, column: 25, scope: !38)
!62 = !DILocation(line: 32, column: 32, scope: !38)
!63 = !DILocation(line: 32, column: 2, scope: !38)
!64 = !DILocation(line: 33, column: 2, scope: !38)
!65 = !DILocation(line: 34, column: 2, scope: !38)
!66 = !DILocation(line: 39, column: 9, scope: !67)
!67 = distinct !DILexicalBlock(scope: !38, file: !3, line: 39, column: 2)
!68 = !DILocation(line: 39, column: 7, scope: !67)
!69 = !DILocation(line: 39, column: 14, scope: !70)
!70 = distinct !DILexicalBlock(scope: !67, file: !3, line: 39, column: 2)
!71 = !DILocation(line: 39, column: 25, scope: !70)
!72 = !DILocation(line: 39, column: 16, scope: !70)
!73 = !DILocation(line: 39, column: 2, scope: !67)
!74 = !DILocation(line: 40, column: 13, scope: !75)
!75 = distinct !DILexicalBlock(scope: !76, file: !3, line: 40, column: 7)
!76 = distinct !DILexicalBlock(scope: !70, file: !3, line: 39, column: 43)
!77 = !DILocation(line: 40, column: 21, scope: !75)
!78 = !DILocation(line: 40, column: 7, scope: !76)
!79 = !DILocation(line: 41, column: 26, scope: !80)
!80 = distinct !DILexicalBlock(scope: !75, file: !3, line: 40, column: 34)
!81 = !DILocation(line: 41, column: 25, scope: !80)
!82 = !DILocation(line: 41, column: 4, scope: !80)
!83 = !DILocation(line: 42, column: 3, scope: !80)
!84 = !DILocation(line: 44, column: 33, scope: !76)
!85 = !DILocation(line: 44, column: 32, scope: !76)
!86 = !DILocation(line: 44, column: 43, scope: !76)
!87 = !DILocation(line: 44, column: 42, scope: !76)
!88 = !DILocation(line: 44, column: 3, scope: !76)
!89 = !DILocation(line: 45, column: 3, scope: !76)
!90 = !DILocation(line: 47, column: 8, scope: !91)
!91 = distinct !DILexicalBlock(scope: !76, file: !3, line: 47, column: 7)
!92 = !DILocation(line: 47, column: 10, scope: !91)
!93 = !DILocation(line: 47, column: 16, scope: !91)
!94 = !DILocation(line: 47, column: 7, scope: !76)
!95 = !DILocation(line: 48, column: 30, scope: !96)
!96 = distinct !DILexicalBlock(scope: !91, file: !3, line: 47, column: 23)
!97 = !DILocation(line: 48, column: 4, scope: !96)
!98 = !DILocation(line: 49, column: 29, scope: !96)
!99 = !DILocation(line: 49, column: 28, scope: !96)
!100 = !DILocation(line: 49, column: 4, scope: !96)
!101 = !DILocation(line: 50, column: 3, scope: !96)
!102 = !DILocation(line: 51, column: 2, scope: !76)
!103 = !DILocation(line: 39, column: 38, scope: !70)
!104 = !DILocation(line: 39, column: 2, scope: !70)
!105 = distinct !{!105, !73, !106}
!106 = !DILocation(line: 51, column: 2, scope: !67)
!107 = !DILocation(line: 56, column: 2, scope: !38)
!108 = !DILocation(line: 58, column: 2, scope: !38)
!109 = distinct !DISubprogram(name: "MAIN_parseCommandLine", scope: !3, file: !3, line: 63, type: !110, scopeLine: 63, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !44)
!110 = !DISubroutineType(types: !111)
!111 = !{null, !19, !41, !112}
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!113 = !DILocalVariable(name: "nArgs", arg: 1, scope: !109, file: !3, line: 63, type: !19)
!114 = !DILocation(line: 63, column: 33, scope: !109)
!115 = !DILocalVariable(name: "arg", arg: 2, scope: !109, file: !3, line: 63, type: !41)
!116 = !DILocation(line: 63, column: 46, scope: !109)
!117 = !DILocalVariable(name: "param", arg: 3, scope: !109, file: !3, line: 63, type: !112)
!118 = !DILocation(line: 63, column: 65, scope: !109)
!119 = !DILocalVariable(name: "fileStat", scope: !109, file: !3, line: 64, type: !120)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !121, line: 46, size: 1152, elements: !122)
!121 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!122 = !{!123, !127, !129, !131, !133, !135, !137, !138, !139, !142, !144, !146, !154, !155, !156}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !120, file: !121, line: 48, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !125, line: 145, baseType: !126)
!125 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!126 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !120, file: !121, line: 53, baseType: !128, size: 64, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !125, line: 148, baseType: !126)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !120, file: !121, line: 61, baseType: !130, size: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !125, line: 151, baseType: !126)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !120, file: !121, line: 62, baseType: !132, size: 32, offset: 192)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !125, line: 150, baseType: !7)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !120, file: !121, line: 64, baseType: !134, size: 32, offset: 224)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !125, line: 146, baseType: !7)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !120, file: !121, line: 65, baseType: !136, size: 32, offset: 256)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !125, line: 147, baseType: !7)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !120, file: !121, line: 67, baseType: !19, size: 32, offset: 288)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !120, file: !121, line: 69, baseType: !124, size: 64, offset: 320)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !120, file: !121, line: 74, baseType: !140, size: 64, offset: 384)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !125, line: 152, baseType: !141)
!141 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !120, file: !121, line: 78, baseType: !143, size: 64, offset: 448)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !125, line: 174, baseType: !141)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !120, file: !121, line: 80, baseType: !145, size: 64, offset: 512)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !125, line: 179, baseType: !141)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !120, file: !121, line: 91, baseType: !147, size: 128, offset: 576)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !148, line: 10, size: 128, elements: !149)
!148 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!149 = !{!150, !152}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !147, file: !148, line: 12, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !125, line: 160, baseType: !141)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !147, file: !148, line: 16, baseType: !153, size: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !125, line: 196, baseType: !141)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !120, file: !121, line: 92, baseType: !147, size: 128, offset: 704)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !120, file: !121, line: 93, baseType: !147, size: 128, offset: 832)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !120, file: !121, line: 106, baseType: !157, size: 192, offset: 960)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 192, elements: !158)
!158 = !{!159}
!159 = !DISubrange(count: 3)
!160 = !DILocation(line: 64, column: 14, scope: !109)
!161 = !DILocation(line: 66, column: 6, scope: !162)
!162 = distinct !DILexicalBlock(scope: !109, file: !3, line: 66, column: 6)
!163 = !DILocation(line: 66, column: 12, scope: !162)
!164 = !DILocation(line: 66, column: 16, scope: !162)
!165 = !DILocation(line: 66, column: 19, scope: !162)
!166 = !DILocation(line: 66, column: 25, scope: !162)
!167 = !DILocation(line: 66, column: 6, scope: !109)
!168 = !DILocation(line: 67, column: 3, scope: !169)
!169 = distinct !DILexicalBlock(scope: !162, file: !3, line: 66, column: 31)
!170 = !DILocation(line: 68, column: 3, scope: !169)
!171 = !DILocation(line: 71, column: 32, scope: !109)
!172 = !DILocation(line: 71, column: 26, scope: !109)
!173 = !DILocation(line: 71, column: 2, scope: !109)
!174 = !DILocation(line: 71, column: 9, scope: !109)
!175 = !DILocation(line: 71, column: 24, scope: !109)
!176 = !DILocation(line: 72, column: 26, scope: !109)
!177 = !DILocation(line: 72, column: 2, scope: !109)
!178 = !DILocation(line: 72, column: 9, scope: !109)
!179 = !DILocation(line: 72, column: 24, scope: !109)
!180 = !DILocation(line: 73, column: 46, scope: !109)
!181 = !DILocation(line: 73, column: 40, scope: !109)
!182 = !DILocation(line: 73, column: 2, scope: !109)
!183 = !DILocation(line: 73, column: 9, scope: !109)
!184 = !DILocation(line: 73, column: 24, scope: !109)
!185 = !DILocation(line: 74, column: 47, scope: !109)
!186 = !DILocation(line: 74, column: 41, scope: !109)
!187 = !DILocation(line: 74, column: 2, scope: !109)
!188 = !DILocation(line: 74, column: 9, scope: !109)
!189 = !DILocation(line: 74, column: 24, scope: !109)
!190 = !DILocation(line: 76, column: 6, scope: !191)
!191 = distinct !DILexicalBlock(scope: !109, file: !3, line: 76, column: 6)
!192 = !DILocation(line: 76, column: 12, scope: !191)
!193 = !DILocation(line: 76, column: 6, scope: !109)
!194 = !DILocation(line: 77, column: 29, scope: !195)
!195 = distinct !DILexicalBlock(scope: !191, file: !3, line: 76, column: 19)
!196 = !DILocation(line: 77, column: 3, scope: !195)
!197 = !DILocation(line: 77, column: 10, scope: !195)
!198 = !DILocation(line: 77, column: 27, scope: !195)
!199 = !DILocation(line: 79, column: 13, scope: !200)
!200 = distinct !DILexicalBlock(scope: !195, file: !3, line: 79, column: 7)
!201 = !DILocation(line: 79, column: 20, scope: !200)
!202 = !DILocation(line: 79, column: 7, scope: !200)
!203 = !DILocation(line: 79, column: 50, scope: !200)
!204 = !DILocation(line: 79, column: 7, scope: !195)
!205 = !DILocation(line: 81, column: 13, scope: !206)
!206 = distinct !DILexicalBlock(scope: !200, file: !3, line: 79, column: 57)
!207 = !DILocation(line: 81, column: 20, scope: !206)
!208 = !DILocation(line: 80, column: 4, scope: !206)
!209 = !DILocation(line: 82, column: 4, scope: !206)
!210 = !DILocation(line: 84, column: 16, scope: !211)
!211 = distinct !DILexicalBlock(scope: !195, file: !3, line: 84, column: 7)
!212 = !DILocation(line: 84, column: 24, scope: !211)
!213 = !DILocation(line: 84, column: 7, scope: !195)
!214 = !DILocation(line: 88, column: 12, scope: !215)
!215 = distinct !DILexicalBlock(scope: !211, file: !3, line: 84, column: 68)
!216 = !DILocation(line: 88, column: 19, scope: !215)
!217 = !DILocation(line: 88, column: 52, scope: !215)
!218 = !DILocation(line: 88, column: 37, scope: !215)
!219 = !DILocation(line: 85, column: 4, scope: !215)
!220 = !DILocation(line: 90, column: 4, scope: !215)
!221 = !DILocation(line: 92, column: 2, scope: !195)
!222 = !DILocation(line: 93, column: 7, scope: !191)
!223 = !DILocation(line: 93, column: 14, scope: !191)
!224 = !DILocation(line: 93, column: 31, scope: !191)
!225 = !DILocation(line: 95, column: 6, scope: !226)
