; ModuleID = 'lbm.c'
source_filename = "lbm.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@.str = private unnamed_addr constant [49 x i8] c"LBM_allocateGrid: could not allocate %.1f MByte\0A\00", align 1
@.str.1 = private unnamed_addr constant [3 x i8] c"rb\00", align 1
@.str.2 = private unnamed_addr constant [148 x i8] c"LBM_showGridStatistics:\0A\09nObstacleCells: %7i nAccelCells: %7i nFluidCells: %7i\0A\09minRho: %8.6f maxRho: %8.6f Mass: %e\0A\09minU  : %8.6f maxU  : %8.6f\0A\0A\00", align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"wb\00", align 1
@.str.4 = private unnamed_addr constant [2 x i8] c"w\00", align 1
@.str.5 = private unnamed_addr constant [10 x i8] c"%e %e %e\0A\00", align 1
@.str.6 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.7 = private unnamed_addr constant [10 x i8] c"%f %f %f\0A\00", align 1
@.str.8 = private unnamed_addr constant [43 x i8] c"LBM_compareVelocityField: maxDiff = %e  \0A\0A\00", align 1

; Function Attrs: noinline nounwind uwtable

!105 = !DILocation(line: 61, column: 3, scope: !99)
!106 = !DILocation(line: 61, column: 21, scope: !99)
!107 = !DILocation(line: 62, column: 3, scope: !99)
!108 = !DILocation(line: 62, column: 21, scope: !99)
!109 = !DILocation(line: 63, column: 3, scope: !99)
!110 = !DILocation(line: 63, column: 21, scope: !99)
!111 = !DILocation(line: 64, column: 3, scope: !99)
!112 = !DILocation(line: 64, column: 21, scope: !99)
!113 = !DILocation(line: 65, column: 3, scope: !99)
!114 = !DILocation(line: 65, column: 21, scope: !99)
!115 = !DILocation(line: 66, column: 3, scope: !99)
!116 = !DILocation(line: 66, column: 21, scope: !99)
!117 = !DILocation(line: 67, column: 3, scope: !99)
!118 = !DILocation(line: 67, column: 21, scope: !99)
!119 = !DILocation(line: 68, column: 3, scope: !99)
!120 = !DILocation(line: 68, column: 21, scope: !99)
!121 = !DILocation(line: 69, column: 3, scope: !99)
!122 = !DILocation(line: 69, column: 21, scope: !99)
!123 = !DILocation(line: 70, column: 3, scope: !99)
!124 = !DILocation(line: 70, column: 21, scope: !99)
!125 = !DILocation(line: 71, column: 3, scope: !99)
!126 = !DILocation(line: 71, column: 21, scope: !99)
!127 = !DILocation(line: 72, column: 3, scope: !99)
!128 = !DILocation(line: 72, column: 21, scope: !99)
!129 = !DILocation(line: 73, column: 3, scope: !99)
!130 = !DILocation(line: 73, column: 21, scope: !99)
!131 = !DILocation(line: 74, column: 3, scope: !99)
!132 = !DILocation(line: 74, column: 21, scope: !99)
!133 = !DILocation(line: 75, column: 3, scope: !99)
!134 = !DILocation(line: 75, column: 21, scope: !99)
!135 = !DILocation(line: 76, column: 3, scope: !99)
!136 = !DILocation(line: 76, column: 21, scope: !99)
!137 = !DILocalVariable(name: "_aux_", scope: !138, file: !1, line: 78, type: !139)
!138 = distinct !DILexicalBlock(scope: !99, file: !1, line: 78, column: 3)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!140 = !DILocation(line: 78, column: 3, scope: !138)
!141 = !DILocation(line: 79, column: 2, scope: !99)
!142 = distinct !{!142, !94, !143}
!143 = !DILocation(line: 79, column: 2, scope: !95)
!144 = !DILocation(line: 80, column: 1, scope: !86)
!145 = distinct !DISubprogram(name: "LBM_swapGrids", scope: !1, file: !1, line: 84, type: !146, scopeLine: 84, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !50)
!146 = !DISubroutineType(types: !147)
!147 = !{null, !148, !148}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "LBM_GridPtr", file: !150, line: 9, baseType: !151)
!150 = !DIFile(filename: "./lbm_1d_array.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/519.lbm_r/build/build_base_ld-loop-ext-m64.0000")
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "LBM_Grid", file: !150, line: 8, baseType: !153)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 1664000000, elements: !154)
!154 = !{!155}
!155 = !DISubrange(count: 26000000)
!156 = !DILocalVariable(name: "grid1", arg: 1, scope: !145, file: !1, line: 84, type: !148)
!157 = !DILocation(line: 84, column: 34, scope: !145)
!158 = !DILocalVariable(name: "grid2", arg: 2, scope: !145, file: !1, line: 84, type: !148)
!159 = !DILocation(line: 84, column: 54, scope: !145)
!160 = !DILocalVariable(name: "aux", scope: !145, file: !1, line: 85, type: !149)
!161 = !DILocation(line: 85, column: 14, scope: !145)
!162 = !DILocation(line: 85, column: 21, scope: !145)
!163 = !DILocation(line: 85, column: 20, scope: !145)
!164 = !DILocation(line: 86, column: 12, scope: !145)
!165 = !DILocation(line: 86, column: 11, scope: !145)
!166 = !DILocation(line: 86, column: 3, scope: !145)
!167 = !DILocation(line: 86, column: 9, scope: !145)
!168 = !DILocation(line: 87, column: 11, scope: !145)
!169 = !DILocation(line: 87, column: 3, scope: !145)
!170 = !DILocation(line: 87, column: 9, scope: !145)
!171 = !DILocation(line: 88, column: 1, scope: !145)
!172 = distinct !DISubprogram(name: "LBM_loadObstacleFile", scope: !1, file: !1, line: 92, type: !173, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !50)
!173 = !DISubroutineType(types: !174)
!174 = !{null, !48, !175}
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!177 = !DILocalVariable(name: "grid", arg: 1, scope: !172, file: !1, line: 92, type: !48)
!178 = !DILocation(line: 92, column: 37, scope: !172)
!179 = !DILocalVariable(name: "filename", arg: 2, scope: !172, file: !1, line: 92, type: !175)
!180 = !DILocation(line: 92, column: 55, scope: !172)
!181 = !DILocalVariable(name: "x", scope: !172, file: !1, line: 93, type: !92)
!182 = !DILocation(line: 93, column: 6, scope: !172)
!183 = !DILocalVariable(name: "y", scope: !172, file: !1, line: 93, type: !92)
!184 = !DILocation(line: 93, column: 10, scope: !172)
!185 = !DILocalVariable(name: "z", scope: !172, file: !1, line: 93, type: !92)
!186 = !DILocation(line: 93, column: 14, scope: !172)
!187 = !DILocalVariable(name: "file", scope: !172, file: !1, line: 95, type: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !190, line: 7, baseType: !191)
!190 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !192, line: 49, size: 1728, elements: !193)
!192 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!193 = !{!194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !209, !211, !212, !213, !217, !219, !221, !225, !228, !230, !233, !236, !237, !238, !239, !240}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !191, file: !192, line: 51, baseType: !92, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !191, file: !192, line: 54, baseType: !38, size: 64, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !191, file: !192, line: 55, baseType: !38, size: 64, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !191, file: !192, line: 56, baseType: !38, size: 64, offset: 192)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !191, file: !192, line: 57, baseType: !38, size: 64, offset: 256)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !191, file: !192, line: 58, baseType: !38, size: 64, offset: 320)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !191, file: !192, line: 59, baseType: !38, size: 64, offset: 384)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !191, file: !192, line: 60, baseType: !38, size: 64, offset: 448)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !191, file: !192, line: 61, baseType: !38, size: 64, offset: 512)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !191, file: !192, line: 64, baseType: !38, size: 64, offset: 576)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !191, file: !192, line: 65, baseType: !38, size: 64, offset: 640)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !191, file: !192, line: 66, baseType: !38, size: 64, offset: 704)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !191, file: !192, line: 68, baseType: !207, size: 64, offset: 768)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !192, line: 36, flags: DIFlagFwdDecl)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !191, file: !192, line: 70, baseType: !210, size: 64, offset: 832)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !191, file: !192, line: 72, baseType: !92, size: 32, offset: 896)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !191, file: !192, line: 73, baseType: !92, size: 32, offset: 928)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !191, file: !192, line: 74, baseType: !214, size: 64, offset: 960)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !215, line: 152, baseType: !216)
!215 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!216 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !191, file: !192, line: 77, baseType: !218, size: 16, offset: 1024)
!218 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !191, file: !192, line: 78, baseType: !220, size: 8, offset: 1040)
!220 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !191, file: !192, line: 79, baseType: !222, size: 8, offset: 1048)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 8, elements: !223)
!223 = !{!224}
!224 = !DISubrange(count: 1)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !191, file: !192, line: 81, baseType: !226, size: 64, offset: 1088)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !192, line: 43, baseType: null)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !191, file: !192, line: 89, baseType: !229, size: 64, offset: 1152)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !215, line: 153, baseType: !216)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !191, file: !192, line: 91, baseType: !231, size: 64, offset: 1216)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !192, line: 37, flags: DIFlagFwdDecl)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !191, file: !192, line: 92, baseType: !234, size: 64, offset: 1280)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !192, line: 38, flags: DIFlagFwdDecl)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !191, file: !192, line: 93, baseType: !210, size: 64, offset: 1344)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !191, file: !192, line: 94, baseType: !35, size: 64, offset: 1408)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !191, file: !192, line: 95, baseType: !55, size: 64, offset: 1472)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !191, file: !192, line: 96, baseType: !92, size: 32, offset: 1536)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !191, file: !192, line: 98, baseType: !241, size: 160, offset: 1568)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 160, elements: !242)
!242 = !{!243}
!243 = !DISubrange(count: 20)
!244 = !DILocation(line: 95, column: 8, scope: !172)
!245 = !DILocation(line: 95, column: 22, scope: !172)
!246 = !DILocation(line: 95, column: 15, scope: !172)
!247 = !DILocation(line: 97, column: 9, scope: !248)
!248 = distinct !DILexicalBlock(scope: !172, file: !1, line: 97, column: 2)
!249 = !DILocation(line: 97, column: 7, scope: !248)
!250 = !DILocation(line: 97, column: 14, scope: !251)
!251 = distinct !DILexicalBlock(scope: !248, file: !1, line: 97, column: 2)
!252 = !DILocation(line: 97, column: 16, scope: !251)
!253 = !DILocation(line: 97, column: 2, scope: !248)
!254 = !DILocation(line: 98, column: 10, scope: !255)
!255 = distinct !DILexicalBlock(scope: !256, file: !1, line: 98, column: 3)
!256 = distinct !DILexicalBlock(scope: !251, file: !1, line: 97, column: 32)
!257 = !DILocation(line: 98, column: 8, scope: !255)
!258 = !DILocation(line: 98, column: 15, scope: !259)
!259 = distinct !DILexicalBlock(scope: !255, file: !1, line: 98, column: 3)
!260 = !DILocation(line: 98, column: 17, scope: !259)
!261 = !DILocation(line: 98, column: 3, scope: !255)
!262 = !DILocation(line: 99, column: 11, scope: !263)
!263 = distinct !DILexicalBlock(scope: !264, file: !1, line: 99, column: 4)
!264 = distinct !DILexicalBlock(scope: !259, file: !1, line: 98, column: 33)
!265 = !DILocation(line: 99, column: 9, scope: !263)
!266 = !DILocation(line: 99, column: 16, scope: !267)
!267 = distinct !DILexicalBlock(scope: !263, file: !1, line: 99, column: 4)
!268 = !DILocation(line: 99, column: 18, scope: !267)
!269 = !DILocation(line: 99, column: 4, scope: !263)
!270 = !DILocation(line: 100, column: 16, scope: !271)
!271 = distinct !DILexicalBlock(scope: !272, file: !1, line: 100, column: 9)
!272 = distinct !DILexicalBlock(scope: !267, file: !1, line: 99, column: 34)
!273 = !DILocation(line: 100, column: 9, scope: !271)
!274 = !DILocation(line: 100, column: 23, scope: !271)
!275 = !DILocation(line: 100, column: 9, scope: !272)
!276 = !DILocalVariable(name: "_aux_", scope: !277, file: !1, line: 100, type: !139)
!277 = distinct !DILexicalBlock(scope: !271, file: !1, line: 100, column: 32)
!278 = !DILocation(line: 100, column: 32, scope: !277)
!279 = !DILocation(line: 101, column: 4, scope: !272)
!280 = !DILocation(line: 99, column: 29, scope: !267)
!281 = !DILocation(line: 99, column: 4, scope: !267)
!282 = distinct !{!282, !269, !283}
!283 = !DILocation(line: 101, column: 4, scope: !263)
!284 = !DILocation(line: 102, column: 11, scope: !264)
!285 = !DILocation(line: 102, column: 4, scope: !264)
!286 = !DILocation(line: 103, column: 3, scope: !264)
!287 = !DILocation(line: 98, column: 28, scope: !259)
!288 = !DILocation(line: 98, column: 3, scope: !259)
!289 = distinct !{!289, !261, !290}
!290 = !DILocation(line: 103, column: 3, scope: !255)
!291 = !DILocation(line: 104, column: 10, scope: !256)
!292 = !DILocation(line: 104, column: 3, scope: !256)
!293 = !DILocation(line: 105, column: 2, scope: !256)
!294 = !DILocation(line: 97, column: 27, scope: !251)
!295 = !DILocation(line: 97, column: 2, scope: !251)
!296 = distinct !{!296, !253, !297}
!297 = !DILocation(line: 105, column: 2, scope: !248)
!298 = !DILocation(line: 107, column: 10, scope: !172)
!299 = !DILocation(line: 107, column: 2, scope: !172)
!300 = !DILocation(line: 108, column: 1, scope: !172)
!301 = distinct !DISubprogram(name: "LBM_initializeSpecialCellsForLDC", scope: !1, file: !1, line: 112, type: !87, scopeLine: 112, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !50)
!302 = !DILocalVariable(name: "grid", arg: 1, scope: !301, file: !1, line: 112, type: !48)
!303 = !DILocation(line: 112, column: 49, scope: !301)
!304 = !DILocalVariable(name: "x", scope: !301, file: !1, line: 113, type: !92)
