; ModuleID = 'simulator/task.cc'
source_filename = "simulator/task.cc"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._Task = type { i64, [1 x %struct.__jmp_buf_tag], [1 x %struct.__jmp_buf_tag], i32, i32, %struct._Task*, void (i8*)*, i8*, i32, %struct._Task*, i64 }
%struct.__jmp_buf_tag = type { [8 x i64], i32, %struct.__sigset_t }
%struct.__sigset_t = type { [16 x i64] }

@main_task = dso_local global %struct._Task zeroinitializer, align 8, !dbg !0
@current_task = dso_local global %struct._Task* null, align 8, !dbg !10
@tmp_jmpb = dso_local global [1 x %struct.__jmp_buf_tag] zeroinitializer, align 16, !dbg !58

; Function Attrs: noinline nounwind uwtable
define dso_local i32 @_Z4distP5_TaskS0_(%struct._Task* %from, %struct._Task* %to) #0 !dbg !64 {
entry:
  %from.addr = alloca %struct._Task*, align 8
  %to.addr = alloca %struct._Task*, align 8
  %c1 = alloca i8*, align 8
  %c2 = alloca i8*, align 8
  store %struct._Task* %from, %struct._Task** %from.addr, align 8
  call void @llvm.dbg.declare(metadata %struct._Task** %from.addr, metadata !67, metadata !DIExpression()), !dbg !68
  store %struct._Task* %to, %struct._Task** %to.addr, align 8
  call void @llvm.dbg.declare(metadata %struct._Task** %to.addr, metadata !69, metadata !DIExpression()), !dbg !70
  call void @llvm.dbg.declare(metadata i8** %c1, metadata !71, metadata !DIExpression()), !dbg !72

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "main_task", scope: !2, file: !3, line: 24, type: !13, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !9, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "simulator/task.cc", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/520.omnetpp_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{}
!5 = !{!6, !8}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!8 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!9 = !{!0, !10, !58}
!10 = !DIGlobalVariableExpression(var: !11, expr: !DIExpression())
!11 = distinct !DIGlobalVariable(name: "current_task", scope: !2, file: !3, line: 25, type: !12, isLocal: false, isDefinition: true)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Task", file: !14, line: 46, size: 3712, flags: DIFlagTypePassByValue, elements: !15, identifier: "_ZTS5_Task")
!14 = !DIFile(filename: "simulator/task.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/520.omnetpp_r/build/build_base_ld-loop-ext-m64.0000")
!15 = !{!16, !18, !44, !45, !46, !47, !48, !54, !55, !56, !57}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "guardbeef1", scope: !13, file: !14, line: 48, baseType: !17, size: 64)
!17 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "jmpb", scope: !13, file: !14, line: 49, baseType: !19, size: 1600, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "jmp_buf", file: !20, line: 45, baseType: !21)
!20 = !DIFile(filename: "/usr/include/setjmp.h", directory: "")
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1600, elements: !42)
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__jmp_buf_tag", file: !20, line: 33, size: 1600, flags: DIFlagTypePassByValue, elements: !23, identifier: "_ZTS13__jmp_buf_tag")
!23 = !{!24, !31, !33}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "__jmpbuf", scope: !22, file: !20, line: 39, baseType: !25, size: 512)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "__jmp_buf", file: !26, line: 31, baseType: !27)
!26 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/setjmp.h", directory: "")
!27 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 512, elements: !29)
!28 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!29 = !{!30}
!30 = !DISubrange(count: 8)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__mask_was_saved", scope: !22, file: !20, line: 40, baseType: !32, size: 32, offset: 512)
!32 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "__saved_mask", scope: !22, file: !20, line: 41, baseType: !34, size: 1024, offset: 576)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !35, line: 8, baseType: !36)
!35 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__sigset_t.h", directory: "")
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !35, line: 5, size: 1024, flags: DIFlagTypePassByValue, elements: !37, identifier: "_ZTS10__sigset_t")
!37 = !{!38}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !36, file: !35, line: 7, baseType: !39, size: 1024)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 1024, elements: !40)
!40 = !{!41}
!41 = !DISubrange(count: 16)
!42 = !{!43}
!43 = !DISubrange(count: 1)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "rst_jmpb", scope: !13, file: !14, line: 50, baseType: !19, size: 1600, offset: 1664)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !13, file: !14, line: 51, baseType: !32, size: 32, offset: 3264)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !13, file: !14, line: 52, baseType: !8, size: 32, offset: 3296)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !13, file: !14, line: 53, baseType: !12, size: 64, offset: 3328)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "fnp", scope: !13, file: !14, line: 55, baseType: !49, size: 64, offset: 3392)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Task_fn", file: !14, line: 44, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DISubroutineType(types: !52)
!52 = !{null, !53}
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !13, file: !14, line: 56, baseType: !53, size: 64, offset: 3456)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "stack_size", scope: !13, file: !14, line: 57, baseType: !8, size: 32, offset: 3520)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "prevbeef", scope: !13, file: !14, line: 59, baseType: !12, size: 64, offset: 3584)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "guardbeef2", scope: !13, file: !14, line: 60, baseType: !17, size: 64, offset: 3648)
!58 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression())
!59 = distinct !DIGlobalVariable(name: "tmp_jmpb", scope: !2, file: !3, line: 26, type: !19, isLocal: false, isDefinition: true)
!60 = !{i32 7, !"Dwarf Version", i32 4}
!61 = !{i32 2, !"Debug Info Version", i32 3}
!62 = !{i32 1, !"wchar_size", i32 4}
!63 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!64 = distinct !DISubprogram(name: "dist", linkageName: "_Z4distP5_TaskS0_", scope: !3, file: !3, line: 28, type: !65, scopeLine: 29, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!65 = !DISubroutineType(types: !66)
!66 = !{!8, !12, !12}
!67 = !DILocalVariable(name: "from", arg: 1, scope: !64, file: !3, line: 28, type: !12)
!68 = !DILocation(line: 28, column: 23, scope: !64)
!69 = !DILocalVariable(name: "to", arg: 2, scope: !64, file: !3, line: 28, type: !12)
!70 = !DILocation(line: 28, column: 36, scope: !64)
!71 = !DILocalVariable(name: "c1", scope: !64, file: !3, line: 30, type: !6)
!72 = !DILocation(line: 30, column: 11, scope: !64)
!73 = !DILocation(line: 30, column: 25, scope: !64)
!74 = !DILocation(line: 30, column: 16, scope: !64)
!75 = !DILocalVariable(name: "c2", scope: !64, file: !3, line: 31, type: !6)
!76 = !DILocation(line: 31, column: 11, scope: !64)
!77 = !DILocation(line: 31, column: 25, scope: !64)
!78 = !DILocation(line: 31, column: 16, scope: !64)
!79 = !DILocation(line: 33, column: 24, scope: !64)
!80 = !DILocation(line: 33, column: 27, scope: !64)
!81 = !DILocation(line: 33, column: 26, scope: !64)
!82 = !DILocation(line: 33, column: 32, scope: !64)
!83 = !DILocation(line: 33, column: 35, scope: !64)
!84 = !DILocation(line: 33, column: 34, scope: !64)
!85 = !DILocation(line: 33, column: 40, scope: !64)
!86 = !DILocation(line: 33, column: 43, scope: !64)
!87 = !DILocation(line: 33, column: 42, scope: !64)
!88 = !DILocation(line: 33, column: 22, scope: !64)
!89 = !DILocation(line: 33, column: 5, scope: !64)
!90 = distinct !DISubprogram(name: "eat", linkageName: "_Z3eatP5_TaskjS0_", scope: !3, file: !3, line: 36, type: !91, scopeLine: 37, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!91 = !DISubroutineType(types: !92)
!92 = !{null, !12, !8, !12}
!93 = !DILocalVariable(name: "p", arg: 1, scope: !90, file: !3, line: 36, type: !12)
!94 = !DILocation(line: 36, column: 18, scope: !90)
!95 = !DILocalVariable(name: "size", arg: 2, scope: !90, file: !3, line: 36, type: !8)
!96 = !DILocation(line: 36, column: 30, scope: !90)
!97 = !DILocalVariable(name: "prevbeef", arg: 3, scope: !90, file: !3, line: 36, type: !12)
!98 = !DILocation(line: 36, column: 43, scope: !90)
!99 = !DILocalVariable(name: "d", scope: !90, file: !3, line: 38, type: !8)
!100 = !DILocation(line: 38, column: 14, scope: !90)
!101 = !DILocalVariable(name: "t", scope: !90, file: !3, line: 39, type: !13)
!102 = !DILocation(line: 39, column: 11, scope: !90)
!103 = !DILocation(line: 45, column: 7, scope: !90)
!104 = !DILocation(line: 45, column: 18, scope: !90)
!105 = !DILocation(line: 46, column: 7, scope: !90)
!106 = !DILocation(line: 46, column: 18, scope: !90)
!107 = !DILocation(line: 47, column: 18, scope: !90)
!108 = !DILocation(line: 47, column: 7, scope: !90)
!109 = !DILocation(line: 47, column: 16, scope: !90)
!110 = !DILocation(line: 50, column: 15, scope: !90)
!111 = !DILocation(line: 50, column: 9, scope: !90)
!112 = !DILocation(line: 50, column: 7, scope: !90)
!113 = !DILocation(line: 51, column: 9, scope: !114)
!114 = distinct !DILexicalBlock(scope: !90, file: !3, line: 51, column: 9)
!115 = !DILocation(line: 51, column: 13, scope: !114)
!116 = !DILocation(line: 51, column: 11, scope: !114)
!117 = !DILocation(line: 51, column: 9, scope: !90)
!118 = !DILocation(line: 53, column: 14, scope: !119)
