; ModuleID = 'ElemStack.cpp'
source_filename = "ElemStack.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"class.xercesc_2_7::ElemStack" = type { i32, i32, %"class.xercesc_2_7::XMLStringPool", %"struct.xercesc_2_7::ElemStack::StackElem"**, i32, i32, i32, i32, i32, i32, i32, %"class.xercesc_2_7::ValueVectorOf"*, %"class.xercesc_2_7::MemoryManager"* }
%"class.xercesc_2_7::XMLStringPool" = type { %"class.xercesc_2_7::XSerializable", %"class.xercesc_2_7::MemoryManager"*, %"struct.xercesc_2_7::XMLStringPool::PoolElem"**, %"class.xercesc_2_7::RefHashTableOf"*, i32, i32 }
%"class.xercesc_2_7::XSerializable" = type { i32 (...)** }
%"struct.xercesc_2_7::XMLStringPool::PoolElem" = type { i32, i16* }
%"class.xercesc_2_7::RefHashTableOf" = type { %"class.xercesc_2_7::MemoryManager"*, i8, %"struct.xercesc_2_7::RefHashTableBucketElem"**, i32, i32, i32, %"class.xercesc_2_7::HashBase"* }
%"struct.xercesc_2_7::RefHashTableBucketElem" = type { %"struct.xercesc_2_7::XMLStringPool::PoolElem"*, %"struct.xercesc_2_7::RefHashTableBucketElem"*, i8* }
%"class.xercesc_2_7::HashBase" = type { i32 (...)** }
%"struct.xercesc_2_7::ElemStack::StackElem" = type { %"class.xercesc_2_7::XMLElementDecl"*, i32, i32, i32, %"class.xercesc_2_7::QName"**, %"struct.xercesc_2_7::PrefMapElem"*, i32, i32, i8, i8, i8, i32, %"class.xercesc_2_7::Grammar"*, i32, i16*, i32, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !776, imports: !778, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "ElemStack.cpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !278, !282, !695}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MapModes", scope: !5, file: !4, line: 127, baseType: !42, size: 32, elements: !275, identifier: "_ZTSN11xercesc_2_79ElemStack8MapModesE")
!4 = !DIFile(filename: "./xercesc/internal/ElemStack.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!5 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "ElemStack", scope: !6, file: !4, line: 66, size: 832, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !7, identifier: "_ZTSN11xercesc_2_79ElemStackE")
!6 = !DINamespace(name: "xercesc_2_7", scope: null)
!7 = !{!8, !41, !43, !44, !47, !92, !93, !94, !95, !96, !97, !98, !99, !168, !169, !173, !176, !179, !183, !188, !192, !197, !200, !203, !206, !207, !210, !211, !212, !215, !218, !221, !224, !227, !228, !234, !237, !238, !241, !244, !249, !252, !255, !258, !259, !262, !266, !270, !274}
!8 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !5, baseType: !9, flags: DIFlagPublic, extraData: i32 0)
!9 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "XMemory", scope: !6, file: !10, line: 40, size: 8, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !11, identifier: "_ZTSN11xercesc_2_77XMemoryE")
!10 = !DIFile(filename: "./xercesc/util/XMemory.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!11 = !{!12, !19, !25, !28, !31, !34, !37}
!12 = !DISubprogram(name: "operator new", linkageName: "_ZN11xercesc_2_77XMemorynwEm", scope: !9, file: !10, line: 54, type: !13, scopeLine: 54, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!13 = !DISubroutineType(types: !14)
!14 = !{!15, !16}
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !17, line: 46, baseType: !18)
!17 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!18 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!19 = !DISubprogram(name: "operator new", linkageName: "_ZN11xercesc_2_77XMemorynwEmPNS_13MemoryManagerE", scope: !9, file: !10, line: 82, type: !20, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!20 = !DISubroutineType(types: !21)
!21 = !{!15, !16, !22}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "MemoryManager", scope: !6, file: !24, line: 38, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_713MemoryManagerE")
!24 = !DIFile(filename: "./xercesc/framework/MemoryManager.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!25 = !DISubprogram(name: "operator new", linkageName: "_ZN11xercesc_2_77XMemorynwEmPv", scope: !9, file: !10, line: 90, type: !26, scopeLine: 90, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!26 = !DISubroutineType(types: !27)
!27 = !{!15, !16, !15}
!28 = !DISubprogram(name: "operator delete", linkageName: "_ZN11xercesc_2_77XMemorydlEPv", scope: !9, file: !10, line: 97, type: !29, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!29 = !DISubroutineType(types: !30)
!30 = !{null, !15}
!31 = !DISubprogram(name: "operator delete", linkageName: "_ZN11xercesc_2_77XMemorydlEPvPNS_13MemoryManagerE", scope: !9, file: !10, line: 107, type: !32, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!32 = !DISubroutineType(types: !33)
!33 = !{null, !15, !22}
!34 = !DISubprogram(name: "operator delete", linkageName: "_ZN11xercesc_2_77XMemorydlEPvS1_", scope: !9, file: !10, line: 115, type: !35, scopeLine: 115, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!35 = !DISubroutineType(types: !36)
!36 = !{null, !15, !15}
!37 = !DISubprogram(name: "XMemory", scope: !9, file: !10, line: 130, type: !38, scopeLine: 130, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!38 = !DISubroutineType(types: !39)
!39 = !{null, !40}
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "fEmptyNamespaceId", scope: !5, file: !4, line: 265, baseType: !42, size: 32)
!42 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "fGlobalPoolId", scope: !5, file: !4, line: 266, baseType: !42, size: 32, offset: 32)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "fPrefixPool", scope: !5, file: !4, line: 267, baseType: !45, size: 320, offset: 64)
!45 = !DICompositeType(tag: DW_TAG_class_type, name: "XMLStringPool", scope: !6, file: !46, line: 43, flags: DIFlagFwdDecl)
!46 = !DIFile(filename: "./xercesc/util/StringPool.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!47 = !DIDerivedType(tag: DW_TAG_member, name: "fStack", scope: !5, file: !4, line: 268, baseType: !48, size: 64, offset: 384)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StackElem", scope: !5, file: !4, line: 98, size: 704, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !51, identifier: "_ZTSN11xercesc_2_79ElemStack9StackElemE")
!51 = !{!52, !53, !57, !58, !59, !60, !65, !72, !73, !74, !76, !77, !78, !79, !83, !84, !89, !90}
!52 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !50, baseType: !9, extraData: i32 0)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "fThisElement", scope: !50, file: !4, line: 100, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DICompositeType(tag: DW_TAG_class_type, name: "XMLElementDecl", scope: !6, file: !56, line: 50, flags: DIFlagFwdDecl)
!56 = !DIFile(filename: "./xercesc/framework/XMLElementDecl.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!57 = !DIDerivedType(tag: DW_TAG_member, name: "fReaderNum", scope: !50, file: !4, line: 101, baseType: !42, size: 32, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "fChildCapacity", scope: !50, file: !4, line: 103, baseType: !42, size: 32, offset: 96)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "fChildCount", scope: !50, file: !4, line: 104, baseType: !42, size: 32, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "fChildren", scope: !50, file: !4, line: 105, baseType: !61, size: 64, offset: 192)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DICompositeType(tag: DW_TAG_class_type, name: "QName", scope: !6, file: !64, line: 33, flags: DIFlagFwdDecl)
!64 = !DIFile(filename: "./xercesc/util/QName.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!65 = !DIDerivedType(tag: DW_TAG_member, name: "fMap", scope: !50, file: !4, line: 107, baseType: !66, size: 64, offset: 256)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PrefMapElem", scope: !6, file: !4, line: 33, size: 64, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !68, identifier: "_ZTSN11xercesc_2_711PrefMapElemE")
!68 = !{!69, !70, !71}
!69 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !67, baseType: !9, extraData: i32 0)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "fPrefId", scope: !67, file: !4, line: 35, baseType: !42, size: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "fURIId", scope: !67, file: !4, line: 36, baseType: !42, size: 32, offset: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "fMapCapacity", scope: !50, file: !4, line: 108, baseType: !42, size: 32, offset: 320)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "fMapCount", scope: !50, file: !4, line: 109, baseType: !42, size: 32, offset: 352)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "fValidationFlag", scope: !50, file: !4, line: 111, baseType: !75, size: 8, offset: 384)
!75 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "fCommentOrPISeen", scope: !50, file: !4, line: 112, baseType: !75, size: 8, offset: 392)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "fReferenceEscaped", scope: !50, file: !4, line: 113, baseType: !75, size: 8, offset: 400)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "fCurrentScope", scope: !50, file: !4, line: 115, baseType: !42, size: 32, offset: 416)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "fCurrentGrammar", scope: !50, file: !4, line: 119, baseType: !80, size: 64, offset: 448)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DICompositeType(tag: DW_TAG_class_type, name: "Grammar", scope: !6, file: !82, line: 42, flags: DIFlagFwdDecl)
!82 = !DIFile(filename: "./xercesc/validators/common/Grammar.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!83 = !DIDerivedType(tag: DW_TAG_member, name: "fCurrentURI", scope: !50, file: !4, line: 120, baseType: !42, size: 32, offset: 512)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "fSchemaElemName", scope: !50, file: !4, line: 121, baseType: !85, size: 64, offset: 576)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMLCh", file: !87, line: 67, baseType: !88)
!87 = !DIFile(filename: "./xercesc/util/Compilers/GCCDefs.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!88 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "fSchemaElemNameMaxLen", scope: !50, file: !4, line: 122, baseType: !42, size: 32, offset: 640)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "fPrefixColonPos", scope: !50, file: !4, line: 124, baseType: !91, size: 32, offset: 672)
!91 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "fStackCapacity", scope: !5, file: !4, line: 269, baseType: !42, size: 32, offset: 448)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "fStackTop", scope: !5, file: !4, line: 270, baseType: !42, size: 32, offset: 480)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "fUnknownNamespaceId", scope: !5, file: !4, line: 271, baseType: !42, size: 32, offset: 512)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "fXMLNamespaceId", scope: !5, file: !4, line: 272, baseType: !42, size: 32, offset: 544)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "fXMLPoolId", scope: !5, file: !4, line: 273, baseType: !42, size: 32, offset: 576)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "fXMLNSNamespaceId", scope: !5, file: !4, line: 274, baseType: !42, size: 32, offset: 608)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "fXMLNSPoolId", scope: !5, file: !4, line: 275, baseType: !42, size: 32, offset: 640)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "fNamespaceMap", scope: !5, file: !4, line: 276, baseType: !100, size: 64, offset: 704)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "ValueVectorOf<xercesc_2_7::PrefMapElem *>", scope: !6, file: !102, line: 32, size: 256, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !103, templateParams: !166, identifier: "_ZTSN11xercesc_2_713ValueVectorOfIPNS_11PrefMapElemEEE")
!102 = !DIFile(filename: "./xercesc/util/ValueVectorOf.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!103 = !{!104, !105, !106, !107, !108, !110, !111, !118, !123, !126, !130, !135, !138, !139, !142, !143, !146, !150, !154, !157, !158, !161, !162}
!104 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !101, baseType: !9, flags: DIFlagPublic, extraData: i32 0)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "fCallDestructor", scope: !101, file: !102, line: 97, baseType: !75, size: 8)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "fCurCount", scope: !101, file: !102, line: 98, baseType: !42, size: 32, offset: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "fMaxCount", scope: !101, file: !102, line: 99, baseType: !42, size: 32, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "fElemList", scope: !101, file: !102, line: 100, baseType: !109, size: 64, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "fMemoryManager", scope: !101, file: !102, line: 101, baseType: !22, size: 64, offset: 192)
!111 = !DISubprogram(name: "ValueVectorOf", scope: !101, file: !102, line: 38, type: !112, scopeLine: 38, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!112 = !DISubroutineType(types: !113)
!113 = !{null, !114, !115, !116, !117}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !75)
!118 = !DISubprogram(name: "ValueVectorOf", scope: !101, file: !102, line: 44, type: !119, scopeLine: 44, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!119 = !DISubroutineType(types: !120)
!120 = !{null, !114, !121}
!121 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !101)
!123 = !DISubprogram(name: "~ValueVectorOf", scope: !101, file: !102, line: 45, type: !124, scopeLine: 45, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!124 = !DISubroutineType(types: !125)
!125 = !{null, !114}
!126 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPNS_11PrefMapElemEEaSERKS3_", scope: !101, file: !102, line: 51, type: !127, scopeLine: 51, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!127 = !DISubroutineType(types: !128)
!128 = !{!129, !114, !121}
!129 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !101, size: 64)
!130 = !DISubprogram(name: "addElement", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPNS_11PrefMapElemEE10addElementERKS2_", scope: !101, file: !102, line: 57, type: !131, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !114, !133}
!133 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !66)
!135 = !DISubprogram(name: "setElementAt", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPNS_11PrefMapElemEE12setElementAtERKS2_j", scope: !101, file: !102, line: 58, type: !136, scopeLine: 58, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!136 = !DISubroutineType(types: !137)
!137 = !{null, !114, !133, !115}
!138 = !DISubprogram(name: "insertElementAt", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPNS_11PrefMapElemEE15insertElementAtERKS2_j", scope: !101, file: !102, line: 59, type: !136, scopeLine: 59, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!139 = !DISubprogram(name: "removeElementAt", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPNS_11PrefMapElemEE15removeElementAtEj", scope: !101, file: !102, line: 60, type: !140, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!140 = !DISubroutineType(types: !141)
!141 = !{null, !114, !115}
!142 = !DISubprogram(name: "removeAllElements", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPNS_11PrefMapElemEE17removeAllElementsEv", scope: !101, file: !102, line: 61, type: !124, scopeLine: 61, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!143 = !DISubprogram(name: "containsElement", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPNS_11PrefMapElemEE15containsElementERKS2_j", scope: !101, file: !102, line: 62, type: !144, scopeLine: 62, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!144 = !DISubroutineType(types: !145)
!145 = !{!75, !114, !133, !115}
!146 = !DISubprogram(name: "elementAt", linkageName: "_ZNK11xercesc_2_713ValueVectorOfIPNS_11PrefMapElemEE9elementAtEj", scope: !101, file: !102, line: 68, type: !147, scopeLine: 68, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!147 = !DISubroutineType(types: !148)
!148 = !{!133, !149, !115}
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!150 = !DISubprogram(name: "elementAt", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPNS_11PrefMapElemEE9elementAtEj", scope: !101, file: !102, line: 69, type: !151, scopeLine: 69, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!151 = !DISubroutineType(types: !152)
!152 = !{!153, !114, !115}
!153 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !66, size: 64)
!154 = !DISubprogram(name: "curCapacity", linkageName: "_ZNK11xercesc_2_713ValueVectorOfIPNS_11PrefMapElemEE11curCapacityEv", scope: !101, file: !102, line: 70, type: !155, scopeLine: 70, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!155 = !DISubroutineType(types: !156)
!156 = !{!42, !149}
!157 = !DISubprogram(name: "size", linkageName: "_ZNK11xercesc_2_713ValueVectorOfIPNS_11PrefMapElemEE4sizeEv", scope: !101, file: !102, line: 71, type: !155, scopeLine: 71, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!158 = !DISubprogram(name: "getMemoryManager", linkageName: "_ZNK11xercesc_2_713ValueVectorOfIPNS_11PrefMapElemEE16getMemoryManagerEv", scope: !101, file: !102, line: 72, type: !159, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!159 = !DISubroutineType(types: !160)
!160 = !{!22, !149}
!161 = !DISubprogram(name: "ensureExtraCapacity", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPNS_11PrefMapElemEE19ensureExtraCapacityEj", scope: !101, file: !102, line: 78, type: !140, scopeLine: 78, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!162 = !DISubprogram(name: "rawData", linkageName: "_ZNK11xercesc_2_713ValueVectorOfIPNS_11PrefMapElemEE7rawDataEv", scope: !101, file: !102, line: 79, type: !163, scopeLine: 79, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!163 = !DISubroutineType(types: !164)
!164 = !{!165, !149}
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!166 = !{!167}
!167 = !DITemplateTypeParameter(name: "TElem", type: !66)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "fMemoryManager", scope: !5, file: !4, line: 277, baseType: !22, size: 64, offset: 768)
!169 = !DISubprogram(name: "ElemStack", scope: !5, file: !4, line: 137, type: !170, scopeLine: 137, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!170 = !DISubroutineType(types: !171)
!171 = !{null, !172, !116}
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!173 = !DISubprogram(name: "~ElemStack", scope: !5, file: !4, line: 138, type: !174, scopeLine: 138, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!174 = !DISubroutineType(types: !175)
!175 = !{null, !172}
!176 = !DISubprogram(name: "addLevel", linkageName: "_ZN11xercesc_2_79ElemStack8addLevelEv", scope: !5, file: !4, line: 144, type: !177, scopeLine: 144, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!177 = !DISubroutineType(types: !178)
!178 = !{!42, !172}
!179 = !DISubprogram(name: "addLevel", linkageName: "_ZN11xercesc_2_79ElemStack8addLevelEPNS_14XMLElementDeclEj", scope: !5, file: !4, line: 145, type: !180, scopeLine: 145, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!180 = !DISubroutineType(types: !181)
!181 = !{!42, !172, !182, !115}
!182 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!183 = !DISubprogram(name: "popTop", linkageName: "_ZN11xercesc_2_79ElemStack6popTopEv", scope: !5, file: !4, line: 146, type: !184, scopeLine: 146, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!184 = !DISubroutineType(types: !185)
!185 = !{!186, !172}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!188 = !DISubprogram(name: "addChild", linkageName: "_ZN11xercesc_2_79ElemStack8addChildEPNS_5QNameEb", scope: !5, file: !4, line: 152, type: !189, scopeLine: 152, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!189 = !DISubroutineType(types: !190)
!190 = !{!42, !172, !191, !117}
!191 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!192 = !DISubprogram(name: "topElement", linkageName: "_ZNK11xercesc_2_79ElemStack10topElementEv", scope: !5, file: !4, line: 153, type: !193, scopeLine: 153, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!193 = !DISubroutineType(types: !194)
!194 = !{!186, !195}
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!196 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!197 = !DISubprogram(name: "setElement", linkageName: "_ZN11xercesc_2_79ElemStack10setElementEPNS_14XMLElementDeclEj", scope: !5, file: !4, line: 154, type: !198, scopeLine: 154, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!198 = !DISubroutineType(types: !199)
!199 = !{null, !172, !182, !115}
!200 = !DISubprogram(name: "setValidationFlag", linkageName: "_ZN11xercesc_2_79ElemStack17setValidationFlagEb", scope: !5, file: !4, line: 156, type: !201, scopeLine: 156, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!201 = !DISubroutineType(types: !202)
!202 = !{null, !172, !75}
!203 = !DISubprogram(name: "getValidationFlag", linkageName: "_ZN11xercesc_2_79ElemStack17getValidationFlagEv", scope: !5, file: !4, line: 157, type: !204, scopeLine: 157, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!204 = !DISubroutineType(types: !205)
!205 = !{!75, !172}
!206 = !DISubprogram(name: "setCommentOrPISeen", linkageName: "_ZN11xercesc_2_79ElemStack18setCommentOrPISeenEv", scope: !5, file: !4, line: 159, type: !174, scopeLine: 159, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!207 = !DISubprogram(name: "getCommentOrPISeen", linkageName: "_ZNK11xercesc_2_79ElemStack18getCommentOrPISeenEv", scope: !5, file: !4, line: 160, type: !208, scopeLine: 160, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!208 = !DISubroutineType(types: !209)
!209 = !{!75, !195}
!210 = !DISubprogram(name: "setReferenceEscaped", linkageName: "_ZN11xercesc_2_79ElemStack19setReferenceEscapedEv", scope: !5, file: !4, line: 162, type: !174, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!211 = !DISubprogram(name: "getReferenceEscaped", linkageName: "_ZNK11xercesc_2_79ElemStack19getReferenceEscapedEv", scope: !5, file: !4, line: 163, type: !208, scopeLine: 163, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!212 = !DISubprogram(name: "setCurrentScope", linkageName: "_ZN11xercesc_2_79ElemStack15setCurrentScopeEi", scope: !5, file: !4, line: 165, type: !213, scopeLine: 165, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!213 = !DISubroutineType(types: !214)
!214 = !{null, !172, !91}
!215 = !DISubprogram(name: "getCurrentScope", linkageName: "_ZN11xercesc_2_79ElemStack15getCurrentScopeEv", scope: !5, file: !4, line: 166, type: !216, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!216 = !DISubroutineType(types: !217)
!217 = !{!91, !172}
!218 = !DISubprogram(name: "setCurrentGrammar", linkageName: "_ZN11xercesc_2_79ElemStack17setCurrentGrammarEPNS_7GrammarE", scope: !5, file: !4, line: 168, type: !219, scopeLine: 168, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!219 = !DISubroutineType(types: !220)
!220 = !{null, !172, !80}
!221 = !DISubprogram(name: "getCurrentGrammar", linkageName: "_ZN11xercesc_2_79ElemStack17getCurrentGrammarEv", scope: !5, file: !4, line: 169, type: !222, scopeLine: 169, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!222 = !DISubroutineType(types: !223)
!223 = !{!80, !172}
!224 = !DISubprogram(name: "setCurrentURI", linkageName: "_ZN11xercesc_2_79ElemStack13setCurrentURIEj", scope: !5, file: !4, line: 171, type: !225, scopeLine: 171, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!225 = !DISubroutineType(types: !226)
!226 = !{null, !172, !42}
!227 = !DISubprogram(name: "getCurrentURI", linkageName: "_ZN11xercesc_2_79ElemStack13getCurrentURIEv", scope: !5, file: !4, line: 172, type: !177, scopeLine: 172, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!228 = !DISubprogram(name: "setCurrentSchemaElemName", linkageName: "_ZN11xercesc_2_79ElemStack24setCurrentSchemaElemNameEPKt", scope: !5, file: !4, line: 174, type: !229, scopeLine: 174, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!229 = !DISubroutineType(types: !230)
!230 = !{null, !172, !231}
!231 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !86)
!234 = !DISubprogram(name: "getCurrentSchemaElemName", linkageName: "_ZN11xercesc_2_79ElemStack24getCurrentSchemaElemNameEv", scope: !5, file: !4, line: 175, type: !235, scopeLine: 175, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!235 = !DISubroutineType(types: !236)
!236 = !{!85, !172}
!237 = !DISubprogram(name: "setPrefixColonPos", linkageName: "_ZN11xercesc_2_79ElemStack17setPrefixColonPosEi", scope: !5, file: !4, line: 177, type: !213, scopeLine: 177, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!238 = !DISubprogram(name: "getPrefixColonPos", linkageName: "_ZNK11xercesc_2_79ElemStack17getPrefixColonPosEv", scope: !5, file: !4, line: 178, type: !239, scopeLine: 178, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!239 = !DISubroutineType(types: !240)
!240 = !{!91, !195}
!241 = !DISubprogram(name: "addPrefix", linkageName: "_ZN11xercesc_2_79ElemStack9addPrefixEPKtj", scope: !5, file: !4, line: 183, type: !242, scopeLine: 183, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!242 = !DISubroutineType(types: !243)
!243 = !{null, !172, !231, !115}
!244 = !DISubprogram(name: "mapPrefixToURI", linkageName: "_ZNK11xercesc_2_79ElemStack14mapPrefixToURIEPKtNS0_8MapModesERb", scope: !5, file: !4, line: 188, type: !245, scopeLine: 188, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!245 = !DISubroutineType(types: !246)
!246 = !{!42, !195, !231, !247, !248}
!247 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3)
!248 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !75, size: 64)
!249 = !DISubprogram(name: "getNamespaceMap", linkageName: "_ZNK11xercesc_2_79ElemStack15getNamespaceMapEv", scope: !5, file: !4, line: 194, type: !250, scopeLine: 194, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!250 = !DISubroutineType(types: !251)
!251 = !{!100, !195}
!252 = !DISubprogram(name: "getPrefixId", linkageName: "_ZNK11xercesc_2_79ElemStack11getPrefixIdEPKt", scope: !5, file: !4, line: 195, type: !253, scopeLine: 195, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!253 = !DISubroutineType(types: !254)
!254 = !{!42, !195, !231}
!255 = !DISubprogram(name: "getPrefixForId", linkageName: "_ZNK11xercesc_2_79ElemStack14getPrefixForIdEj", scope: !5, file: !4, line: 196, type: !256, scopeLine: 196, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!256 = !DISubroutineType(types: !257)
!257 = !{!232, !195, !42}
!258 = !DISubprogram(name: "isEmpty", linkageName: "_ZNK11xercesc_2_79ElemStack7isEmptyEv", scope: !5, file: !4, line: 201, type: !208, scopeLine: 201, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!259 = !DISubprogram(name: "reset", linkageName: "_ZN11xercesc_2_79ElemStack5resetEjjjj", scope: !5, file: !4, line: 202, type: !260, scopeLine: 202, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!260 = !DISubroutineType(types: !261)
!261 = !{null, !172, !115, !115, !115, !115}
!262 = !DISubprogram(name: "ElemStack", scope: !5, file: !4, line: 215, type: !263, scopeLine: 215, flags: DIFlagPrototyped, spFlags: 0)
!263 = !DISubroutineType(types: !264)
!264 = !{null, !172, !265}
!265 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !196, size: 64)
!266 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_79ElemStackaSERKS0_", scope: !5, file: !4, line: 216, type: !267, scopeLine: 216, flags: DIFlagPrototyped, spFlags: 0)
!267 = !DISubroutineType(types: !268)
!268 = !{!269, !172, !265}
!269 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !5, size: 64)
!270 = !DISubprogram(name: "expandMap", linkageName: "_ZN11xercesc_2_79ElemStack9expandMapEPNS0_9StackElemE", scope: !5, file: !4, line: 222, type: !271, scopeLine: 222, flags: DIFlagPrototyped, spFlags: 0)
!271 = !DISubroutineType(types: !272)
!272 = !{null, !172, !273}
!273 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!274 = !DISubprogram(name: "expandStack", linkageName: "_ZN11xercesc_2_79ElemStack11expandStackEv", scope: !5, file: !4, line: 223, type: !174, scopeLine: 223, flags: DIFlagPrototyped, spFlags: 0)
!275 = !{!276, !277}
!276 = !DIEnumerator(name: "Mode_Attribute", value: 0, isUnsigned: true)
!277 = !DIEnumerator(name: "Mode_Element", value: 1, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !81, file: !82, line: 66, baseType: !42, size: 32, elements: !279, identifier: "_ZTSN11xercesc_2_77GrammarUt_E")
!279 = !{!280, !281}
!280 = !DIEnumerator(name: "UNKNOWN_SCOPE", value: 4294967295, isUnsigned: true)
!281 = !DIEnumerator(name: "TOP_LEVEL_SCOPE", value: 4294967294, isUnsigned: true)
!282 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Codes", scope: !284, file: !283, line: 14, baseType: !42, size: 32, elements: !290, identifier: "_ZTSN11xercesc_2_710XMLExcepts5CodesE")
!283 = !DIFile(filename: "./xercesc/util/XMLExceptMsgs.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!284 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "XMLExcepts", scope: !6, file: !283, line: 11, size: 8, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !285, identifier: "_ZTSN11xercesc_2_710XMLExceptsE")
!285 = !{!286}
!286 = !DISubprogram(name: "XMLExcepts", scope: !284, file: !283, line: 427, type: !287, scopeLine: 427, flags: DIFlagPrototyped, spFlags: 0)
!287 = !DISubroutineType(types: !288)
!288 = !{null, !289}
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!290 = !{!291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694}
!291 = !DIEnumerator(name: "NoError", value: 0, isUnsigned: true)
!292 = !DIEnumerator(name: "W_LowBounds", value: 1, isUnsigned: true)
!293 = !DIEnumerator(name: "Scan_CouldNotOpenSource_Warning", value: 2, isUnsigned: true)
!294 = !DIEnumerator(name: "GC_ExistingGrammar", value: 3, isUnsigned: true)
!295 = !DIEnumerator(name: "W_HighBounds", value: 4, isUnsigned: true)
!296 = !DIEnumerator(name: "F_LowBounds", value: 5, isUnsigned: true)
!297 = !DIEnumerator(name: "Array_BadIndex", value: 6, isUnsigned: true)
!298 = !DIEnumerator(name: "Array_BadNewSize", value: 7, isUnsigned: true)
!299 = !DIEnumerator(name: "AttrList_BadIndex", value: 8, isUnsigned: true)
!300 = !DIEnumerator(name: "AttDef_BadAttType", value: 9, isUnsigned: true)
!301 = !DIEnumerator(name: "AttDef_BadDefAttType", value: 10, isUnsigned: true)
!302 = !DIEnumerator(name: "Bitset_BadIndex", value: 11, isUnsigned: true)
!303 = !DIEnumerator(name: "Bitset_NotEqualSize", value: 12, isUnsigned: true)
!304 = !DIEnumerator(name: "BufMgr_NoMoreBuffers", value: 13, isUnsigned: true)
!305 = !DIEnumerator(name: "BufMgr_BufferNotInPool", value: 14, isUnsigned: true)
!306 = !DIEnumerator(name: "CPtr_PointerIsZero", value: 15, isUnsigned: true)
!307 = !DIEnumerator(name: "CM_BinOpHadUnaryType", value: 16, isUnsigned: true)
!308 = !DIEnumerator(name: "CM_MustBeMixedOrChildren", value: 17, isUnsigned: true)
!309 = !DIEnumerator(name: "CM_NoPCDATAHere", value: 18, isUnsigned: true)
!310 = !DIEnumerator(name: "CM_NotValidForSpecType", value: 19, isUnsigned: true)
!311 = !DIEnumerator(name: "CM_UnaryOpHadBinType", value: 20, isUnsigned: true)
!312 = !DIEnumerator(name: "CM_UnknownCMType", value: 21, isUnsigned: true)
!313 = !DIEnumerator(name: "CM_UnknownCMSpecType", value: 22, isUnsigned: true)
!314 = !DIEnumerator(name: "CM_NoParentCSN", value: 23, isUnsigned: true)
!315 = !DIEnumerator(name: "CM_NotValidSpecTypeForNode", value: 24, isUnsigned: true)
!316 = !DIEnumerator(name: "DTD_UnknownCreateReason", value: 25, isUnsigned: true)
!317 = !DIEnumerator(name: "ElemStack_EmptyStack", value: 26, isUnsigned: true)
!318 = !DIEnumerator(name: "ElemStack_BadIndex", value: 27, isUnsigned: true)
!319 = !DIEnumerator(name: "ElemStack_StackUnderflow", value: 28, isUnsigned: true)
!320 = !DIEnumerator(name: "ElemStack_NoParentPushed", value: 29, isUnsigned: true)
!321 = !DIEnumerator(name: "Enum_NoMoreElements", value: 30, isUnsigned: true)
!322 = !DIEnumerator(name: "File_CouldNotOpenFile", value: 31, isUnsigned: true)
!323 = !DIEnumerator(name: "File_CouldNotGetCurPos", value: 32, isUnsigned: true)
!324 = !DIEnumerator(name: "File_CouldNotCloseFile", value: 33, isUnsigned: true)
!325 = !DIEnumerator(name: "File_CouldNotSeekToEnd", value: 34, isUnsigned: true)
!326 = !DIEnumerator(name: "File_CouldNotSeekToPos", value: 35, isUnsigned: true)
!327 = !DIEnumerator(name: "File_CouldNotDupHandle", value: 36, isUnsigned: true)
!328 = !DIEnumerator(name: "File_CouldNotReadFromFile", value: 37, isUnsigned: true)
!329 = !DIEnumerator(name: "File_CouldNotWriteToFile", value: 38, isUnsigned: true)
!330 = !DIEnumerator(name: "File_CouldNotResetFile", value: 39, isUnsigned: true)
!331 = !DIEnumerator(name: "File_CouldNotGetSize", value: 40, isUnsigned: true)
!332 = !DIEnumerator(name: "File_CouldNotGetBasePathName", value: 41, isUnsigned: true)
!333 = !DIEnumerator(name: "File_BasePathUnderflow", value: 42, isUnsigned: true)
!334 = !DIEnumerator(name: "Gen_ParseInProgress", value: 43, isUnsigned: true)
!335 = !DIEnumerator(name: "Gen_NoDTDValidator", value: 44, isUnsigned: true)
!336 = !DIEnumerator(name: "Gen_CouldNotOpenDTD", value: 45, isUnsigned: true)
!337 = !DIEnumerator(name: "Gen_CouldNotOpenExtEntity", value: 46, isUnsigned: true)
!338 = !DIEnumerator(name: "Gen_UnexpectedEOF", value: 47, isUnsigned: true)
!339 = !DIEnumerator(name: "HshTbl_ZeroModulus", value: 48, isUnsigned: true)
!340 = !DIEnumerator(name: "HshTbl_BadHashFromKey", value: 49, isUnsigned: true)
!341 = !DIEnumerator(name: "HshTbl_NoSuchKeyExists", value: 50, isUnsigned: true)
!342 = !DIEnumerator(name: "Mutex_CouldNotCreate", value: 51, isUnsigned: true)
!343 = !DIEnumerator(name: "Mutex_CouldNotClose", value: 52, isUnsigned: true)
!344 = !DIEnumerator(name: "Mutex_CouldNotLock", value: 53, isUnsigned: true)
!345 = !DIEnumerator(name: "Mutex_CouldNotUnlock", value: 54, isUnsigned: true)
!346 = !DIEnumerator(name: "Mutex_CouldNotDestroy", value: 55, isUnsigned: true)
!347 = !DIEnumerator(name: "NetAcc_InternalError", value: 56, isUnsigned: true)
!348 = !DIEnumerator(name: "NetAcc_LengthError", value: 57, isUnsigned: true)
!349 = !DIEnumerator(name: "NetAcc_InitFailed", value: 58, isUnsigned: true)
!350 = !DIEnumerator(name: "NetAcc_TargetResolution", value: 59, isUnsigned: true)
!351 = !DIEnumerator(name: "NetAcc_CreateSocket", value: 60, isUnsigned: true)
!352 = !DIEnumerator(name: "NetAcc_ConnSocket", value: 61, isUnsigned: true)
!353 = !DIEnumerator(name: "NetAcc_WriteSocket", value: 62, isUnsigned: true)
!354 = !DIEnumerator(name: "NetAcc_ReadSocket", value: 63, isUnsigned: true)
!355 = !DIEnumerator(name: "NetAcc_UnsupportedMethod", value: 64, isUnsigned: true)
!356 = !DIEnumerator(name: "Pool_ElemAlreadyExists", value: 65, isUnsigned: true)
!357 = !DIEnumerator(name: "Pool_BadHashFromKey", value: 66, isUnsigned: true)
!358 = !DIEnumerator(name: "Pool_InvalidId", value: 67, isUnsigned: true)
!359 = !DIEnumerator(name: "Pool_ZeroModulus", value: 68, isUnsigned: true)
!360 = !DIEnumerator(name: "RdrMgr_ReaderIdNotFound", value: 69, isUnsigned: true)
!361 = !DIEnumerator(name: "Reader_BadAutoEncoding", value: 70, isUnsigned: true)
!362 = !DIEnumerator(name: "Reader_CouldNotDecodeFirstLine", value: 71, isUnsigned: true)
!363 = !DIEnumerator(name: "Reader_NelLsepinDecl", value: 72, isUnsigned: true)
!364 = !DIEnumerator(name: "Reader_EOIInMultiSeq", value: 73, isUnsigned: true)
!365 = !DIEnumerator(name: "Reader_SrcOfsNotSupported", value: 74, isUnsigned: true)
!366 = !DIEnumerator(name: "Reader_EncodingStrRequired", value: 75, isUnsigned: true)
!367 = !DIEnumerator(name: "Scan_CouldNotOpenSource", value: 76, isUnsigned: true)
!368 = !DIEnumerator(name: "Scan_UnbalancedStartEnd", value: 77, isUnsigned: true)
!369 = !DIEnumerator(name: "Scan_BadPScanToken", value: 78, isUnsigned: true)
!370 = !DIEnumerator(name: "Stack_BadIndex", value: 79, isUnsigned: true)
!371 = !DIEnumerator(name: "Stack_EmptyStack", value: 80, isUnsigned: true)
!372 = !DIEnumerator(name: "Str_ZeroSizedTargetBuf", value: 81, isUnsigned: true)
!373 = !DIEnumerator(name: "Str_UnknownRadix", value: 82, isUnsigned: true)
!374 = !DIEnumerator(name: "Str_TargetBufTooSmall", value: 83, isUnsigned: true)
!375 = !DIEnumerator(name: "Str_StartIndexPastEnd", value: 84, isUnsigned: true)
!376 = !DIEnumerator(name: "Str_ConvertOverflow", value: 85, isUnsigned: true)
!377 = !DIEnumerator(name: "Strm_StdErrWriteFailure", value: 86, isUnsigned: true)
!378 = !DIEnumerator(name: "Strm_StdOutWriteFailure", value: 87, isUnsigned: true)
!379 = !DIEnumerator(name: "Strm_ConWriteFailure", value: 88, isUnsigned: true)
!380 = !DIEnumerator(name: "StrPool_IllegalId", value: 89, isUnsigned: true)
!381 = !DIEnumerator(name: "Trans_CouldNotCreateDefCvtr", value: 90, isUnsigned: true)
!382 = !DIEnumerator(name: "Trans_InvalidSizeReq", value: 91, isUnsigned: true)
!383 = !DIEnumerator(name: "Trans_Unrepresentable", value: 92, isUnsigned: true)
!384 = !DIEnumerator(name: "Trans_NotValidForEncoding", value: 93, isUnsigned: true)
!385 = !DIEnumerator(name: "Trans_BadBlockSize", value: 94, isUnsigned: true)
!386 = !DIEnumerator(name: "Trans_BadSrcSeq", value: 95, isUnsigned: true)
!387 = !DIEnumerator(name: "Trans_BadSrcCP", value: 96, isUnsigned: true)
!388 = !DIEnumerator(name: "Trans_BadTrailingSurrogate", value: 97, isUnsigned: true)
!389 = !DIEnumerator(name: "Trans_CantCreateCvtrFor", value: 98, isUnsigned: true)
!390 = !DIEnumerator(name: "URL_MalformedURL", value: 99, isUnsigned: true)
!391 = !DIEnumerator(name: "URL_UnsupportedProto", value: 100, isUnsigned: true)
!392 = !DIEnumerator(name: "URL_UnsupportedProto1", value: 101, isUnsigned: true)
!393 = !DIEnumerator(name: "URL_OnlyLocalHost", value: 102, isUnsigned: true)
!394 = !DIEnumerator(name: "URL_NoProtocolPresent", value: 103, isUnsigned: true)
!395 = !DIEnumerator(name: "URL_ExpectingTwoSlashes", value: 104, isUnsigned: true)
!396 = !DIEnumerator(name: "URL_IncorrectEscapedCharRef", value: 105, isUnsigned: true)
!397 = !DIEnumerator(name: "URL_UnterminatedHostComponent", value: 106, isUnsigned: true)
!398 = !DIEnumerator(name: "URL_RelativeBaseURL", value: 107, isUnsigned: true)
!399 = !DIEnumerator(name: "URL_BaseUnderflow", value: 108, isUnsigned: true)
!400 = !DIEnumerator(name: "URL_BadPortField", value: 109, isUnsigned: true)
!401 = !DIEnumerator(name: "UTF8_FormatError", value: 110, isUnsigned: true)
!402 = !DIEnumerator(name: "UTF8_Invalid_2BytesSeq", value: 111, isUnsigned: true)
!403 = !DIEnumerator(name: "UTF8_Invalid_3BytesSeq", value: 112, isUnsigned: true)
!404 = !DIEnumerator(name: "UTF8_Irregular_3BytesSeq", value: 113, isUnsigned: true)
!405 = !DIEnumerator(name: "UTF8_Invalid_4BytesSeq", value: 114, isUnsigned: true)
!406 = !DIEnumerator(name: "UTF8_Exceede_BytesLimit", value: 115, isUnsigned: true)
!407 = !DIEnumerator(name: "Vector_BadIndex", value: 116, isUnsigned: true)
!408 = !DIEnumerator(name: "Val_InvalidElemId", value: 117, isUnsigned: true)
!409 = !DIEnumerator(name: "Val_CantHaveIntSS", value: 118, isUnsigned: true)
!410 = !DIEnumerator(name: "XMLRec_UnknownEncoding", value: 119, isUnsigned: true)
!411 = !DIEnumerator(name: "Parser_Parse1", value: 120, isUnsigned: true)
!412 = !DIEnumerator(name: "Parser_Parse2", value: 121, isUnsigned: true)
!413 = !DIEnumerator(name: "Parser_Next1", value: 122, isUnsigned: true)
!414 = !DIEnumerator(name: "Parser_Next2", value: 123, isUnsigned: true)
!415 = !DIEnumerator(name: "Parser_Next3", value: 124, isUnsigned: true)
!416 = !DIEnumerator(name: "Parser_Next4", value: 125, isUnsigned: true)
!417 = !DIEnumerator(name: "Parser_Factor1", value: 126, isUnsigned: true)
!418 = !DIEnumerator(name: "Parser_Factor2", value: 127, isUnsigned: true)
!419 = !DIEnumerator(name: "Parser_Factor3", value: 128, isUnsigned: true)
!420 = !DIEnumerator(name: "Parser_Factor4", value: 129, isUnsigned: true)
!421 = !DIEnumerator(name: "Parser_Factor5", value: 130, isUnsigned: true)
!422 = !DIEnumerator(name: "Parser_Factor6", value: 131, isUnsigned: true)
!423 = !DIEnumerator(name: "Parser_Atom1", value: 132, isUnsigned: true)
!424 = !DIEnumerator(name: "Parser_Atom2", value: 133, isUnsigned: true)
!425 = !DIEnumerator(name: "Parser_Atom3", value: 134, isUnsigned: true)
!426 = !DIEnumerator(name: "Parser_Atom4", value: 135, isUnsigned: true)
!427 = !DIEnumerator(name: "Parser_Atom5", value: 136, isUnsigned: true)
!428 = !DIEnumerator(name: "Parser_CC1", value: 137, isUnsigned: true)
!429 = !DIEnumerator(name: "Parser_CC2", value: 138, isUnsigned: true)
!430 = !DIEnumerator(name: "Parser_CC3", value: 139, isUnsigned: true)
!431 = !DIEnumerator(name: "Parser_CC4", value: 140, isUnsigned: true)
!432 = !DIEnumerator(name: "Parser_CC5", value: 141, isUnsigned: true)
!433 = !DIEnumerator(name: "Parser_CC6", value: 142, isUnsigned: true)
!434 = !DIEnumerator(name: "Parser_Ope1", value: 143, isUnsigned: true)
!435 = !DIEnumerator(name: "Parser_Ope2", value: 144, isUnsigned: true)
!436 = !DIEnumerator(name: "Parser_Ope3", value: 145, isUnsigned: true)
!437 = !DIEnumerator(name: "Parser_Descape1", value: 146, isUnsigned: true)
!438 = !DIEnumerator(name: "Parser_Descape2", value: 147, isUnsigned: true)
!439 = !DIEnumerator(name: "Parser_Descape3", value: 148, isUnsigned: true)
!440 = !DIEnumerator(name: "Parser_Descape4", value: 149, isUnsigned: true)
!441 = !DIEnumerator(name: "Parser_Descape5", value: 150, isUnsigned: true)
!442 = !DIEnumerator(name: "Parser_Process1", value: 151, isUnsigned: true)
!443 = !DIEnumerator(name: "Parser_Process2", value: 152, isUnsigned: true)
!444 = !DIEnumerator(name: "Parser_Quantifier1", value: 153, isUnsigned: true)
!445 = !DIEnumerator(name: "Parser_Quantifier2", value: 154, isUnsigned: true)
!446 = !DIEnumerator(name: "Parser_Quantifier3", value: 155, isUnsigned: true)
!447 = !DIEnumerator(name: "Parser_Quantifier4", value: 156, isUnsigned: true)
!448 = !DIEnumerator(name: "Parser_Quantifier5", value: 157, isUnsigned: true)
!449 = !DIEnumerator(name: "Gen_NoSchemaValidator", value: 158, isUnsigned: true)
!450 = !DIEnumerator(name: "XUTIL_UnCopyableNodeType", value: 159, isUnsigned: true)
!451 = !DIEnumerator(name: "SubGrpComparator_NGR", value: 160, isUnsigned: true)
!452 = !DIEnumerator(name: "FACET_Invalid_Len", value: 161, isUnsigned: true)
!453 = !DIEnumerator(name: "FACET_Invalid_maxLen", value: 162, isUnsigned: true)
!454 = !DIEnumerator(name: "FACET_Invalid_minLen", value: 163, isUnsigned: true)
!455 = !DIEnumerator(name: "FACET_NonNeg_Len", value: 164, isUnsigned: true)
!456 = !DIEnumerator(name: "FACET_NonNeg_maxLen", value: 165, isUnsigned: true)
!457 = !DIEnumerator(name: "FACET_NonNeg_minLen", value: 166, isUnsigned: true)
!458 = !DIEnumerator(name: "FACET_Len_maxLen", value: 167, isUnsigned: true)
!459 = !DIEnumerator(name: "FACET_Len_minLen", value: 168, isUnsigned: true)
!460 = !DIEnumerator(name: "FACET_maxLen_minLen", value: 169, isUnsigned: true)
!461 = !DIEnumerator(name: "FACET_bool_Pattern", value: 170, isUnsigned: true)
!462 = !DIEnumerator(name: "FACET_Invalid_Tag", value: 171, isUnsigned: true)
!463 = !DIEnumerator(name: "FACET_Len_baseLen", value: 172, isUnsigned: true)
!464 = !DIEnumerator(name: "FACET_minLen_baseminLen", value: 173, isUnsigned: true)
!465 = !DIEnumerator(name: "FACET_minLen_basemaxLen", value: 174, isUnsigned: true)
!466 = !DIEnumerator(name: "FACET_maxLen_basemaxLen", value: 175, isUnsigned: true)
!467 = !DIEnumerator(name: "FACET_maxLen_baseminLen", value: 176, isUnsigned: true)
!468 = !DIEnumerator(name: "FACET_Len_baseMinLen", value: 177, isUnsigned: true)
!469 = !DIEnumerator(name: "FACET_Len_baseMaxLen", value: 178, isUnsigned: true)
!470 = !DIEnumerator(name: "FACET_minLen_baseLen", value: 179, isUnsigned: true)
!471 = !DIEnumerator(name: "FACET_maxLen_baseLen", value: 180, isUnsigned: true)
!472 = !DIEnumerator(name: "FACET_enum_base", value: 181, isUnsigned: true)
!473 = !DIEnumerator(name: "FACET_Invalid_WS", value: 182, isUnsigned: true)
!474 = !DIEnumerator(name: "FACET_WS_collapse", value: 183, isUnsigned: true)
!475 = !DIEnumerator(name: "FACET_WS_replace", value: 184, isUnsigned: true)
!476 = !DIEnumerator(name: "FACET_Invalid_MaxIncl", value: 185, isUnsigned: true)
!477 = !DIEnumerator(name: "FACET_Invalid_MaxExcl", value: 186, isUnsigned: true)
!478 = !DIEnumerator(name: "FACET_Invalid_MinIncl", value: 187, isUnsigned: true)
!479 = !DIEnumerator(name: "FACET_Invalid_MinExcl", value: 188, isUnsigned: true)
!480 = !DIEnumerator(name: "FACET_Invalid_TotalDigit", value: 189, isUnsigned: true)
!481 = !DIEnumerator(name: "FACET_Invalid_FractDigit", value: 190, isUnsigned: true)
!482 = !DIEnumerator(name: "FACET_PosInt_TotalDigit", value: 191, isUnsigned: true)
!483 = !DIEnumerator(name: "FACET_NonNeg_FractDigit", value: 192, isUnsigned: true)
!484 = !DIEnumerator(name: "FACET_max_Incl_Excl", value: 193, isUnsigned: true)
!485 = !DIEnumerator(name: "FACET_min_Incl_Excl", value: 194, isUnsigned: true)
!486 = !DIEnumerator(name: "FACET_maxExcl_minExcl", value: 195, isUnsigned: true)
!487 = !DIEnumerator(name: "FACET_maxExcl_minIncl", value: 196, isUnsigned: true)
!488 = !DIEnumerator(name: "FACET_maxIncl_minExcl", value: 197, isUnsigned: true)
!489 = !DIEnumerator(name: "FACET_maxIncl_minIncl", value: 198, isUnsigned: true)
!490 = !DIEnumerator(name: "FACET_TotDigit_FractDigit", value: 199, isUnsigned: true)
!491 = !DIEnumerator(name: "FACET_maxIncl_base_maxExcl", value: 200, isUnsigned: true)
!492 = !DIEnumerator(name: "FACET_maxIncl_base_maxIncl", value: 201, isUnsigned: true)
!493 = !DIEnumerator(name: "FACET_maxIncl_base_minIncl", value: 202, isUnsigned: true)
!494 = !DIEnumerator(name: "FACET_maxIncl_base_minExcl", value: 203, isUnsigned: true)
!495 = !DIEnumerator(name: "FACET_maxExcl_base_maxExcl", value: 204, isUnsigned: true)
!496 = !DIEnumerator(name: "FACET_maxExcl_base_maxIncl", value: 205, isUnsigned: true)
!497 = !DIEnumerator(name: "FACET_maxExcl_base_minIncl", value: 206, isUnsigned: true)
!498 = !DIEnumerator(name: "FACET_maxExcl_base_minExcl", value: 207, isUnsigned: true)
!499 = !DIEnumerator(name: "FACET_minExcl_base_maxExcl", value: 208, isUnsigned: true)
!500 = !DIEnumerator(name: "FACET_minExcl_base_maxIncl", value: 209, isUnsigned: true)
!501 = !DIEnumerator(name: "FACET_minExcl_base_minIncl", value: 210, isUnsigned: true)
!502 = !DIEnumerator(name: "FACET_minExcl_base_minExcl", value: 211, isUnsigned: true)
!503 = !DIEnumerator(name: "FACET_minIncl_base_maxExcl", value: 212, isUnsigned: true)
!504 = !DIEnumerator(name: "FACET_minIncl_base_maxIncl", value: 213, isUnsigned: true)
!505 = !DIEnumerator(name: "FACET_minIncl_base_minIncl", value: 214, isUnsigned: true)
!506 = !DIEnumerator(name: "FACET_minIncl_base_minExcl", value: 215, isUnsigned: true)
!507 = !DIEnumerator(name: "FACET_maxIncl_notFromBase", value: 216, isUnsigned: true)
!508 = !DIEnumerator(name: "FACET_maxExcl_notFromBase", value: 217, isUnsigned: true)
!509 = !DIEnumerator(name: "FACET_minIncl_notFromBase", value: 218, isUnsigned: true)
!510 = !DIEnumerator(name: "FACET_minExcl_notFromBase", value: 219, isUnsigned: true)
!511 = !DIEnumerator(name: "FACET_totalDigit_base_totalDigit", value: 220, isUnsigned: true)
!512 = !DIEnumerator(name: "FACET_fractDigit_base_totalDigit", value: 221, isUnsigned: true)
!513 = !DIEnumerator(name: "FACET_fractDigit_base_fractDigit", value: 222, isUnsigned: true)
!514 = !DIEnumerator(name: "FACET_maxIncl_base_fixed", value: 223, isUnsigned: true)
!515 = !DIEnumerator(name: "FACET_maxExcl_base_fixed", value: 224, isUnsigned: true)
!516 = !DIEnumerator(name: "FACET_minIncl_base_fixed", value: 225, isUnsigned: true)
!517 = !DIEnumerator(name: "FACET_minExcl_base_fixed", value: 226, isUnsigned: true)
!518 = !DIEnumerator(name: "FACET_totalDigit_base_fixed", value: 227, isUnsigned: true)
!519 = !DIEnumerator(name: "FACET_fractDigit_base_fixed", value: 228, isUnsigned: true)
!520 = !DIEnumerator(name: "FACET_maxLen_base_fixed", value: 229, isUnsigned: true)
!521 = !DIEnumerator(name: "FACET_minLen_base_fixed", value: 230, isUnsigned: true)
!522 = !DIEnumerator(name: "FACET_len_base_fixed", value: 231, isUnsigned: true)
!523 = !DIEnumerator(name: "FACET_whitespace_base_fixed", value: 232, isUnsigned: true)
!524 = !DIEnumerator(name: "FACET_internalError_fixed", value: 233, isUnsigned: true)
!525 = !DIEnumerator(name: "FACET_List_Null_baseValidator", value: 234, isUnsigned: true)
!526 = !DIEnumerator(name: "FACET_Union_Null_memberTypeValidators", value: 235, isUnsigned: true)
!527 = !DIEnumerator(name: "FACET_Union_Null_baseValidator", value: 236, isUnsigned: true)
!528 = !DIEnumerator(name: "FACET_Union_invalid_baseValidatorType", value: 237, isUnsigned: true)
!529 = !DIEnumerator(name: "VALUE_NotMatch_Pattern", value: 238, isUnsigned: true)
!530 = !DIEnumerator(name: "VALUE_Not_Base64", value: 239, isUnsigned: true)
!531 = !DIEnumerator(name: "VALUE_Not_HexBin", value: 240, isUnsigned: true)
!532 = !DIEnumerator(name: "VALUE_GT_maxLen", value: 241, isUnsigned: true)
!533 = !DIEnumerator(name: "VALUE_LT_minLen", value: 242, isUnsigned: true)
!534 = !DIEnumerator(name: "VALUE_NE_Len", value: 243, isUnsigned: true)
!535 = !DIEnumerator(name: "VALUE_NotIn_Enumeration", value: 244, isUnsigned: true)
!536 = !DIEnumerator(name: "VALUE_exceed_totalDigit", value: 245, isUnsigned: true)
!537 = !DIEnumerator(name: "VALUE_exceed_fractDigit", value: 246, isUnsigned: true)
!538 = !DIEnumerator(name: "VALUE_exceed_maxIncl", value: 247, isUnsigned: true)
!539 = !DIEnumerator(name: "VALUE_exceed_maxExcl", value: 248, isUnsigned: true)
!540 = !DIEnumerator(name: "VALUE_exceed_minIncl", value: 249, isUnsigned: true)
!541 = !DIEnumerator(name: "VALUE_exceed_minExcl", value: 250, isUnsigned: true)
!542 = !DIEnumerator(name: "VALUE_WS_replaced", value: 251, isUnsigned: true)
!543 = !DIEnumerator(name: "VALUE_WS_collapsed", value: 252, isUnsigned: true)
!544 = !DIEnumerator(name: "VALUE_Invalid_NCName", value: 253, isUnsigned: true)
!545 = !DIEnumerator(name: "VALUE_Invalid_Name", value: 254, isUnsigned: true)
!546 = !DIEnumerator(name: "VALUE_ID_Not_Unique", value: 255, isUnsigned: true)
!547 = !DIEnumerator(name: "VALUE_ENTITY_Invalid", value: 256, isUnsigned: true)
!548 = !DIEnumerator(name: "VALUE_QName_Invalid", value: 257, isUnsigned: true)
!549 = !DIEnumerator(name: "VALUE_NOTATION_Invalid", value: 258, isUnsigned: true)
!550 = !DIEnumerator(name: "VALUE_no_match_memberType", value: 259, isUnsigned: true)
!551 = !DIEnumerator(name: "VALUE_URI_Malformed", value: 260, isUnsigned: true)
!552 = !DIEnumerator(name: "XMLNUM_emptyString", value: 261, isUnsigned: true)
!553 = !DIEnumerator(name: "XMLNUM_WSString", value: 262, isUnsigned: true)
!554 = !DIEnumerator(name: "XMLNUM_2ManyDecPoint", value: 263, isUnsigned: true)
!555 = !DIEnumerator(name: "XMLNUM_Inv_chars", value: 264, isUnsigned: true)
!556 = !DIEnumerator(name: "XMLNUM_null_ptr", value: 265, isUnsigned: true)
!557 = !DIEnumerator(name: "XMLNUM_URI_Component_Empty", value: 266, isUnsigned: true)
!558 = !DIEnumerator(name: "XMLNUM_URI_Component_for_GenURI_Only", value: 267, isUnsigned: true)
!559 = !DIEnumerator(name: "XMLNUM_URI_Component_Invalid_EscapeSequence", value: 268, isUnsigned: true)
!560 = !DIEnumerator(name: "XMLNUM_URI_Component_Invalid_Char", value: 269, isUnsigned: true)
!561 = !DIEnumerator(name: "XMLNUM_URI_Component_Set_Null", value: 270, isUnsigned: true)
!562 = !DIEnumerator(name: "XMLNUM_URI_Component_Not_Conformant", value: 271, isUnsigned: true)
!563 = !DIEnumerator(name: "XMLNUM_URI_No_Scheme", value: 272, isUnsigned: true)
!564 = !DIEnumerator(name: "XMLNUM_URI_NullHost", value: 273, isUnsigned: true)
!565 = !DIEnumerator(name: "XMLNUM_URI_NullPath", value: 274, isUnsigned: true)
!566 = !DIEnumerator(name: "XMLNUM_URI_Component_inPath", value: 275, isUnsigned: true)
!567 = !DIEnumerator(name: "XMLNUM_URI_PortNo_Invalid", value: 276, isUnsigned: true)
!568 = !DIEnumerator(name: "XMLNUM_DBL_FLT_maxNeg", value: 277, isUnsigned: true)
!569 = !DIEnumerator(name: "XMLNUM_DBL_FLT_maxPos", value: 278, isUnsigned: true)
!570 = !DIEnumerator(name: "XMLNUM_DBL_FLT_minNegPos", value: 279, isUnsigned: true)
!571 = !DIEnumerator(name: "XMLNUM_DBL_FLT_InvalidType", value: 280, isUnsigned: true)
!572 = !DIEnumerator(name: "XMLNUM_DBL_FLT_No_Exponent", value: 281, isUnsigned: true)
!573 = !DIEnumerator(name: "Regex_Result_Not_Set", value: 282, isUnsigned: true)
!574 = !DIEnumerator(name: "Regex_CompactRangesError", value: 283, isUnsigned: true)
!575 = !DIEnumerator(name: "Regex_MergeRangesTypeMismatch", value: 284, isUnsigned: true)
!576 = !DIEnumerator(name: "Regex_SubtractRangesError", value: 285, isUnsigned: true)
!577 = !DIEnumerator(name: "Regex_IntersectRangesError", value: 286, isUnsigned: true)
!578 = !DIEnumerator(name: "Regex_ComplementRangesInvalidArg", value: 287, isUnsigned: true)
!579 = !DIEnumerator(name: "Regex_InvalidCategoryName", value: 288, isUnsigned: true)
!580 = !DIEnumerator(name: "Regex_KeywordNotFound", value: 289, isUnsigned: true)
!581 = !DIEnumerator(name: "Regex_BadRefNo", value: 290, isUnsigned: true)
!582 = !DIEnumerator(name: "Regex_UnknownOption", value: 291, isUnsigned: true)
!583 = !DIEnumerator(name: "Regex_UnknownTokenType", value: 292, isUnsigned: true)
!584 = !DIEnumerator(name: "Regex_RangeTokenGetError", value: 293, isUnsigned: true)
!585 = !DIEnumerator(name: "Regex_NotSupported", value: 294, isUnsigned: true)
!586 = !DIEnumerator(name: "Regex_InvalidChildIndex", value: 295, isUnsigned: true)
!587 = !DIEnumerator(name: "Regex_RepPatMatchesZeroString", value: 296, isUnsigned: true)
!588 = !DIEnumerator(name: "Regex_InvalidRepPattern", value: 297, isUnsigned: true)
!589 = !DIEnumerator(name: "NEL_RepeatedCalls", value: 298, isUnsigned: true)
!590 = !DIEnumerator(name: "RethrowError", value: 299, isUnsigned: true)
!591 = !DIEnumerator(name: "Out_Of_Memory", value: 300, isUnsigned: true)
!592 = !DIEnumerator(name: "DV_InvalidOperation", value: 301, isUnsigned: true)
!593 = !DIEnumerator(name: "XPath_NoAttrSelector", value: 302, isUnsigned: true)
!594 = !DIEnumerator(name: "XPath_NoUnionAtStart", value: 303, isUnsigned: true)
!595 = !DIEnumerator(name: "XPath_NoMultipleUnion", value: 304, isUnsigned: true)
!596 = !DIEnumerator(name: "XPath_MissingAttr", value: 305, isUnsigned: true)
!597 = !DIEnumerator(name: "XPath_ExpectedToken1", value: 306, isUnsigned: true)
!598 = !DIEnumerator(name: "XPath_PrefixNoURI", value: 307, isUnsigned: true)
!599 = !DIEnumerator(name: "XPath_NoDoubleColon", value: 308, isUnsigned: true)
!600 = !DIEnumerator(name: "XPath_ExpectedStep1", value: 309, isUnsigned: true)
!601 = !DIEnumerator(name: "XPath_ExpectedStep2", value: 310, isUnsigned: true)
!602 = !DIEnumerator(name: "XPath_ExpectedStep3", value: 311, isUnsigned: true)
!603 = !DIEnumerator(name: "XPath_NoForwardSlash", value: 312, isUnsigned: true)
!604 = !DIEnumerator(name: "XPath_NoDoubleForwardSlash", value: 313, isUnsigned: true)
!605 = !DIEnumerator(name: "XPath_NoForwardSlashAtStart", value: 314, isUnsigned: true)
!606 = !DIEnumerator(name: "XPath_NoSelectionOfRoot", value: 315, isUnsigned: true)
!607 = !DIEnumerator(name: "XPath_EmptyExpr", value: 316, isUnsigned: true)
!608 = !DIEnumerator(name: "XPath_NoUnionAtEnd", value: 317, isUnsigned: true)
!609 = !DIEnumerator(name: "XPath_InvalidChar", value: 318, isUnsigned: true)
!610 = !DIEnumerator(name: "XPath_TokenNotSupported", value: 319, isUnsigned: true)
!611 = !DIEnumerator(name: "XPath_FindSolution", value: 320, isUnsigned: true)
!612 = !DIEnumerator(name: "DateTime_Assert_Buffer_Fail", value: 321, isUnsigned: true)
!613 = !DIEnumerator(name: "DateTime_dt_missingT", value: 322, isUnsigned: true)
!614 = !DIEnumerator(name: "DateTime_gDay_invalid", value: 323, isUnsigned: true)
!615 = !DIEnumerator(name: "DateTime_gMth_invalid", value: 324, isUnsigned: true)
!616 = !DIEnumerator(name: "DateTime_gMthDay_invalid", value: 325, isUnsigned: true)
!617 = !DIEnumerator(name: "DateTime_dur_Start_dashP", value: 326, isUnsigned: true)
!618 = !DIEnumerator(name: "DateTime_dur_noP", value: 327, isUnsigned: true)
!619 = !DIEnumerator(name: "DateTime_dur_DashNotFirst", value: 328, isUnsigned: true)
!620 = !DIEnumerator(name: "DateTime_dur_inv_b4T", value: 329, isUnsigned: true)
!621 = !DIEnumerator(name: "DateTime_dur_NoTimeAfterT", value: 330, isUnsigned: true)
!622 = !DIEnumerator(name: "DateTime_dur_NoElementAtAll", value: 331, isUnsigned: true)
!623 = !DIEnumerator(name: "DateTime_dur_inv_seconds", value: 332, isUnsigned: true)
!624 = !DIEnumerator(name: "DateTime_date_incomplete", value: 333, isUnsigned: true)
!625 = !DIEnumerator(name: "DateTime_date_invalid", value: 334, isUnsigned: true)
!626 = !DIEnumerator(name: "DateTime_time_incomplete", value: 335, isUnsigned: true)
!627 = !DIEnumerator(name: "DateTime_time_invalid", value: 336, isUnsigned: true)
!628 = !DIEnumerator(name: "DateTime_ms_noDigit", value: 337, isUnsigned: true)
!629 = !DIEnumerator(name: "DateTime_ym_incomplete", value: 338, isUnsigned: true)
!630 = !DIEnumerator(name: "DateTime_ym_invalid", value: 339, isUnsigned: true)
!631 = !DIEnumerator(name: "DateTime_year_tooShort", value: 340, isUnsigned: true)
!632 = !DIEnumerator(name: "DateTime_year_leadingZero", value: 341, isUnsigned: true)
!633 = !DIEnumerator(name: "DateTime_ym_noMonth", value: 342, isUnsigned: true)
!634 = !DIEnumerator(name: "DateTime_tz_noUTCsign", value: 343, isUnsigned: true)
!635 = !DIEnumerator(name: "DateTime_tz_stuffAfterZ", value: 344, isUnsigned: true)
!636 = !DIEnumerator(name: "DateTime_tz_invalid", value: 345, isUnsigned: true)
!637 = !DIEnumerator(name: "DateTime_year_zero", value: 346, isUnsigned: true)
!638 = !DIEnumerator(name: "DateTime_mth_invalid", value: 347, isUnsigned: true)
!639 = !DIEnumerator(name: "DateTime_day_invalid", value: 348, isUnsigned: true)
!640 = !DIEnumerator(name: "DateTime_hour_invalid", value: 349, isUnsigned: true)
!641 = !DIEnumerator(name: "DateTime_min_invalid", value: 350, isUnsigned: true)
!642 = !DIEnumerator(name: "DateTime_second_invalid", value: 351, isUnsigned: true)
!643 = !DIEnumerator(name: "DateTime_tz_hh_invalid", value: 352, isUnsigned: true)
!644 = !DIEnumerator(name: "PD_EmptyBase", value: 353, isUnsigned: true)
!645 = !DIEnumerator(name: "PD_NSCompat1", value: 354, isUnsigned: true)
!646 = !DIEnumerator(name: "PD_OccurRangeE", value: 355, isUnsigned: true)
!647 = !DIEnumerator(name: "PD_NameTypeOK1", value: 356, isUnsigned: true)
!648 = !DIEnumerator(name: "PD_NameTypeOK2", value: 357, isUnsigned: true)
!649 = !DIEnumerator(name: "PD_NameTypeOK3", value: 358, isUnsigned: true)
!650 = !DIEnumerator(name: "PD_NameTypeOK4", value: 359, isUnsigned: true)
!651 = !DIEnumerator(name: "PD_NameTypeOK5", value: 360, isUnsigned: true)
!652 = !DIEnumerator(name: "PD_NameTypeOK6", value: 361, isUnsigned: true)
!653 = !DIEnumerator(name: "PD_NameTypeOK7", value: 362, isUnsigned: true)
!654 = !DIEnumerator(name: "PD_RecurseAsIfGroup", value: 363, isUnsigned: true)
!655 = !DIEnumerator(name: "PD_Recurse1", value: 364, isUnsigned: true)
!656 = !DIEnumerator(name: "PD_Recurse2", value: 365, isUnsigned: true)
!657 = !DIEnumerator(name: "PD_ForbiddenRes1", value: 366, isUnsigned: true)
!658 = !DIEnumerator(name: "PD_ForbiddenRes2", value: 367, isUnsigned: true)
!659 = !DIEnumerator(name: "PD_ForbiddenRes3", value: 368, isUnsigned: true)
!660 = !DIEnumerator(name: "PD_ForbiddenRes4", value: 369, isUnsigned: true)
!661 = !DIEnumerator(name: "PD_NSSubset1", value: 370, isUnsigned: true)
!662 = !DIEnumerator(name: "PD_NSSubset2", value: 371, isUnsigned: true)
!663 = !DIEnumerator(name: "PD_NSRecurseCheckCardinality1", value: 372, isUnsigned: true)
!664 = !DIEnumerator(name: "PD_RecurseUnordered", value: 373, isUnsigned: true)
!665 = !DIEnumerator(name: "PD_MapAndSum", value: 374, isUnsigned: true)
!666 = !DIEnumerator(name: "PD_InvalidContentType", value: 375, isUnsigned: true)
!667 = !DIEnumerator(name: "NodeIDMap_GrowErr", value: 376, isUnsigned: true)
!668 = !DIEnumerator(name: "XSer_ProtoType_Null_ClassName", value: 377, isUnsigned: true)
!669 = !DIEnumerator(name: "XSer_ProtoType_NameLen_Dif", value: 378, isUnsigned: true)
!670 = !DIEnumerator(name: "XSer_ProtoType_Name_Dif", value: 379, isUnsigned: true)
!671 = !DIEnumerator(name: "XSer_InStream_Read_LT_Req", value: 380, isUnsigned: true)
!672 = !DIEnumerator(name: "XSer_InStream_Read_OverFlow", value: 381, isUnsigned: true)
!673 = !DIEnumerator(name: "XSer_Storing_Violation", value: 382, isUnsigned: true)
!674 = !DIEnumerator(name: "XSer_StoreBuffer_Violation", value: 383, isUnsigned: true)
!675 = !DIEnumerator(name: "XSer_LoadPool_UppBnd_Exceed", value: 384, isUnsigned: true)
!676 = !DIEnumerator(name: "XSer_LoadPool_NoTally_ObjCnt", value: 385, isUnsigned: true)
!677 = !DIEnumerator(name: "XSer_Loading_Violation", value: 386, isUnsigned: true)
!678 = !DIEnumerator(name: "XSer_LoadBuffer_Violation", value: 387, isUnsigned: true)
!679 = !DIEnumerator(name: "XSer_Inv_ClassIndex", value: 388, isUnsigned: true)
!680 = !DIEnumerator(name: "XSer_Inv_FillBuffer_Size", value: 389, isUnsigned: true)
!681 = !DIEnumerator(name: "XSer_Inv_checkFillBuffer_Size", value: 390, isUnsigned: true)
!682 = !DIEnumerator(name: "XSer_Inv_checkFlushBuffer_Size", value: 391, isUnsigned: true)
!683 = !DIEnumerator(name: "XSer_Inv_Null_Pointer", value: 392, isUnsigned: true)
!684 = !DIEnumerator(name: "XSer_Inv_Buffer_Len", value: 393, isUnsigned: true)
!685 = !DIEnumerator(name: "XSer_CreateObject_Fail", value: 394, isUnsigned: true)
!686 = !DIEnumerator(name: "XSer_ObjCount_UppBnd_Exceed", value: 395, isUnsigned: true)
!687 = !DIEnumerator(name: "XSer_GrammarPool_Locked", value: 396, isUnsigned: true)
!688 = !DIEnumerator(name: "XSer_GrammarPool_Empty", value: 397, isUnsigned: true)
!689 = !DIEnumerator(name: "XSer_GrammarPool_NotEmpty", value: 398, isUnsigned: true)
!690 = !DIEnumerator(name: "XSer_StringPool_NotEmpty", value: 399, isUnsigned: true)
!691 = !DIEnumerator(name: "XSer_Storer_NewerThan_Loader", value: 400, isUnsigned: true)
!692 = !DIEnumerator(name: "F_HighBounds", value: 401, isUnsigned: true)
!693 = !DIEnumerator(name: "E_LowBounds", value: 402, isUnsigned: true)
!694 = !DIEnumerator(name: "E_HighBounds", value: 403, isUnsigned: true)
!695 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MapModes", scope: !696, file: !4, line: 322, baseType: !42, size: 32, elements: !275, identifier: "_ZTSN11xercesc_2_711WFElemStack8MapModesE")
!696 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "WFElemStack", scope: !6, file: !4, line: 281, size: 832, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !697, identifier: "_ZTSN11xercesc_2_711WFElemStackE")
!697 = !{!698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !721, !722, !723, !727, !730, !733, !736, !741, !746, !749, !752, !753, !756, !760, !763, !766, !770, !774, !775}
!698 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !696, baseType: !9, flags: DIFlagPublic, extraData: i32 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "fEmptyNamespaceId", scope: !696, file: !4, line: 438, baseType: !42, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "fGlobalPoolId", scope: !696, file: !4, line: 439, baseType: !42, size: 32, offset: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "fStackCapacity", scope: !696, file: !4, line: 440, baseType: !42, size: 32, offset: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "fStackTop", scope: !696, file: !4, line: 441, baseType: !42, size: 32, offset: 96)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "fUnknownNamespaceId", scope: !696, file: !4, line: 442, baseType: !42, size: 32, offset: 128)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "fXMLNamespaceId", scope: !696, file: !4, line: 443, baseType: !42, size: 32, offset: 160)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "fXMLPoolId", scope: !696, file: !4, line: 444, baseType: !42, size: 32, offset: 192)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "fXMLNSNamespaceId", scope: !696, file: !4, line: 445, baseType: !42, size: 32, offset: 224)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "fXMLNSPoolId", scope: !696, file: !4, line: 446, baseType: !42, size: 32, offset: 256)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "fMapCapacity", scope: !696, file: !4, line: 447, baseType: !42, size: 32, offset: 288)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "fMap", scope: !696, file: !4, line: 448, baseType: !66, size: 64, offset: 320)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "fStack", scope: !696, file: !4, line: 449, baseType: !711, size: 64, offset: 384)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StackElem", scope: !696, file: !4, line: 313, size: 192, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !714, identifier: "_ZTSN11xercesc_2_711WFElemStack9StackElemE")
!714 = !{!715, !716, !717, !718, !719, !720}
!715 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !713, baseType: !9, extraData: i32 0)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "fTopPrefix", scope: !713, file: !4, line: 315, baseType: !91, size: 32)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "fCurrentURI", scope: !713, file: !4, line: 316, baseType: !42, size: 32, offset: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "fReaderNum", scope: !713, file: !4, line: 317, baseType: !42, size: 32, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "fElemMaxLength", scope: !713, file: !4, line: 318, baseType: !42, size: 32, offset: 96)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "fThisElement", scope: !713, file: !4, line: 319, baseType: !85, size: 64, offset: 128)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "fPrefixPool", scope: !696, file: !4, line: 450, baseType: !45, size: 320, offset: 448)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "fMemoryManager", scope: !696, file: !4, line: 451, baseType: !22, size: 64, offset: 768)
!723 = !DISubprogram(name: "WFElemStack", scope: !696, file: !4, line: 332, type: !724, scopeLine: 332, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!724 = !DISubroutineType(types: !725)
!725 = !{null, !726, !116}
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!727 = !DISubprogram(name: "~WFElemStack", scope: !696, file: !4, line: 333, type: !728, scopeLine: 333, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!728 = !DISubroutineType(types: !729)
!729 = !{null, !726}
!730 = !DISubprogram(name: "addLevel", linkageName: "_ZN11xercesc_2_711WFElemStack8addLevelEv", scope: !696, file: !4, line: 339, type: !731, scopeLine: 339, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!731 = !DISubroutineType(types: !732)
!732 = !{!42, !726}
!733 = !DISubprogram(name: "addLevel", linkageName: "_ZN11xercesc_2_711WFElemStack8addLevelEPKtjj", scope: !696, file: !4, line: 340, type: !734, scopeLine: 340, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!734 = !DISubroutineType(types: !735)
!735 = !{!42, !726, !231, !115, !115}
!736 = !DISubprogram(name: "popTop", linkageName: "_ZN11xercesc_2_711WFElemStack6popTopEv", scope: !696, file: !4, line: 342, type: !737, scopeLine: 342, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!737 = !DISubroutineType(types: !738)
!738 = !{!739, !726}
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !713)
!741 = !DISubprogram(name: "topElement", linkageName: "_ZNK11xercesc_2_711WFElemStack10topElementEv", scope: !696, file: !4, line: 348, type: !742, scopeLine: 348, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!742 = !DISubroutineType(types: !743)
!743 = !{!739, !744}
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!745 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !696)
!746 = !DISubprogram(name: "setElement", linkageName: "_ZN11xercesc_2_711WFElemStack10setElementEPKtjj", scope: !696, file: !4, line: 349, type: !747, scopeLine: 349, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!747 = !DISubroutineType(types: !748)
!748 = !{null, !726, !231, !115, !115}
!749 = !DISubprogram(name: "setCurrentURI", linkageName: "_ZN11xercesc_2_711WFElemStack13setCurrentURIEj", scope: !696, file: !4, line: 352, type: !750, scopeLine: 352, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!750 = !DISubroutineType(types: !751)
!751 = !{null, !726, !42}
!752 = !DISubprogram(name: "getCurrentURI", linkageName: "_ZN11xercesc_2_711WFElemStack13getCurrentURIEv", scope: !696, file: !4, line: 353, type: !731, scopeLine: 353, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!753 = !DISubprogram(name: "addPrefix", linkageName: "_ZN11xercesc_2_711WFElemStack9addPrefixEPKtj", scope: !696, file: !4, line: 358, type: !754, scopeLine: 358, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!754 = !DISubroutineType(types: !755)
!755 = !{null, !726, !231, !115}
!756 = !DISubprogram(name: "mapPrefixToURI", linkageName: "_ZNK11xercesc_2_711WFElemStack14mapPrefixToURIEPKtNS0_8MapModesERb", scope: !696, file: !4, line: 363, type: !757, scopeLine: 363, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!757 = !DISubroutineType(types: !758)
!758 = !{!42, !744, !231, !759, !248}
!759 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !695)
!760 = !DISubprogram(name: "isEmpty", linkageName: "_ZNK11xercesc_2_711WFElemStack7isEmptyEv", scope: !696, file: !4, line: 374, type: !761, scopeLine: 374, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!761 = !DISubroutineType(types: !762)
!762 = !{!75, !744}
!763 = !DISubprogram(name: "reset", linkageName: "_ZN11xercesc_2_711WFElemStack5resetEjjjj", scope: !696, file: !4, line: 375, type: !764, scopeLine: 375, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!764 = !DISubroutineType(types: !765)
!765 = !{null, !726, !115, !115, !115, !115}
!766 = !DISubprogram(name: "WFElemStack", scope: !696, file: !4, line: 388, type: !767, scopeLine: 388, flags: DIFlagPrototyped, spFlags: 0)
!767 = !DISubroutineType(types: !768)
!768 = !{null, !726, !769}
!769 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !745, size: 64)
!770 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_711WFElemStackaSERKS0_", scope: !696, file: !4, line: 389, type: !771, scopeLine: 389, flags: DIFlagPrototyped, spFlags: 0)
!771 = !DISubroutineType(types: !772)
!772 = !{!773, !726, !769}
!773 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !696, size: 64)
!774 = !DISubprogram(name: "expandMap", linkageName: "_ZN11xercesc_2_711WFElemStack9expandMapEv", scope: !696, file: !4, line: 395, type: !728, scopeLine: 395, flags: DIFlagPrototyped, spFlags: 0)
!775 = !DISubprogram(name: "expandStack", linkageName: "_ZN11xercesc_2_711WFElemStack11expandStackEv", scope: !696, file: !4, line: 396, type: !728, scopeLine: 396, flags: DIFlagPrototyped, spFlags: 0)
!776 = !{!48, !42, !61, !91, !66, !711, !85, !109, !777}
!777 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!778 = !{!779, !788, !792, !798, !802, !806, !816, !820, !822, !824, !828, !832, !836, !840, !844, !846, !848, !850, !854, !858, !862, !864, !866, !868, !874, !878, !885, !889, !894, !896, !900, !904, !908, !916, !920, !924, !928, !930, !934, !938, !942, !944, !948, !955, !959, !963, !965, !969, !973, !977, !983, !987, !991, !993, !1000, !1004, !1012, !1014, !1018, !1022, !1026, !1030, !1035, !1040, !1045, !1046, !1047, !1048, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1095, !1097, !1152}
!779 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !781, file: !787, line: 77)
!780 = !DINamespace(name: "std", scope: null)
!781 = !DISubprogram(name: "memchr", scope: !782, file: !782, line: 73, type: !783, flags: DIFlagPrototyped, spFlags: 0)
!782 = !DIFile(filename: "/usr/include/string.h", directory: "")
!783 = !DISubroutineType(types: !784)
!784 = !{!785, !785, !91, !16}
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!787 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cstring", directory: "")
!788 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !789, file: !787, line: 78)
!789 = !DISubprogram(name: "memcmp", scope: !782, file: !782, line: 64, type: !790, flags: DIFlagPrototyped, spFlags: 0)
!790 = !DISubroutineType(types: !791)
!791 = !{!91, !785, !785, !16}
!792 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !793, file: !787, line: 79)
!793 = !DISubprogram(name: "memcpy", scope: !782, file: !782, line: 43, type: !794, flags: DIFlagPrototyped, spFlags: 0)
!794 = !DISubroutineType(types: !795)
!795 = !{!15, !796, !797, !16}
!796 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !15)
!797 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !785)
!798 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !799, file: !787, line: 80)
!799 = !DISubprogram(name: "memmove", scope: !782, file: !782, line: 47, type: !800, flags: DIFlagPrototyped, spFlags: 0)
!800 = !DISubroutineType(types: !801)
!801 = !{!15, !15, !785, !16}
!802 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !803, file: !787, line: 81)
!803 = !DISubprogram(name: "memset", scope: !782, file: !782, line: 61, type: !804, flags: DIFlagPrototyped, spFlags: 0)
!804 = !DISubroutineType(types: !805)
!805 = !{!15, !15, !91, !16}
!806 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !807, file: !787, line: 82)
!807 = !DISubprogram(name: "strcat", scope: !782, file: !782, line: 130, type: !808, flags: DIFlagPrototyped, spFlags: 0)
!808 = !DISubroutineType(types: !809)
!809 = !{!810, !812, !813}
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!812 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !810)
!813 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !814)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !811)
!816 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !817, file: !787, line: 83)
!817 = !DISubprogram(name: "strcmp", scope: !782, file: !782, line: 137, type: !818, flags: DIFlagPrototyped, spFlags: 0)
!818 = !DISubroutineType(types: !819)
!819 = !{!91, !814, !814}
!820 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !821, file: !787, line: 84)
!821 = !DISubprogram(name: "strcoll", scope: !782, file: !782, line: 144, type: !818, flags: DIFlagPrototyped, spFlags: 0)
!822 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !823, file: !787, line: 85)
!823 = !DISubprogram(name: "strcpy", scope: !782, file: !782, line: 122, type: !808, flags: DIFlagPrototyped, spFlags: 0)
!824 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !825, file: !787, line: 86)
!825 = !DISubprogram(name: "strcspn", scope: !782, file: !782, line: 273, type: !826, flags: DIFlagPrototyped, spFlags: 0)
!826 = !DISubroutineType(types: !827)
!827 = !{!16, !814, !814}
!828 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !829, file: !787, line: 87)
!829 = !DISubprogram(name: "strerror", scope: !782, file: !782, line: 397, type: !830, flags: DIFlagPrototyped, spFlags: 0)
!830 = !DISubroutineType(types: !831)
!831 = !{!810, !91}
!832 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !833, file: !787, line: 88)
!833 = !DISubprogram(name: "strlen", scope: !782, file: !782, line: 385, type: !834, flags: DIFlagPrototyped, spFlags: 0)
!834 = !DISubroutineType(types: !835)
!835 = !{!16, !814}
!836 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !837, file: !787, line: 89)
!837 = !DISubprogram(name: "strncat", scope: !782, file: !782, line: 133, type: !838, flags: DIFlagPrototyped, spFlags: 0)
!838 = !DISubroutineType(types: !839)
!839 = !{!810, !812, !813, !16}
!840 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !841, file: !787, line: 90)
!841 = !DISubprogram(name: "strncmp", scope: !782, file: !782, line: 140, type: !842, flags: DIFlagPrototyped, spFlags: 0)
!842 = !DISubroutineType(types: !843)
!843 = !{!91, !814, !814, !16}
!844 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !845, file: !787, line: 91)
!845 = !DISubprogram(name: "strncpy", scope: !782, file: !782, line: 125, type: !838, flags: DIFlagPrototyped, spFlags: 0)
!846 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !847, file: !787, line: 92)
!847 = !DISubprogram(name: "strspn", scope: !782, file: !782, line: 277, type: !826, flags: DIFlagPrototyped, spFlags: 0)
!848 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !849, file: !787, line: 93)
!849 = !DISubprogram(name: "strtok", scope: !782, file: !782, line: 336, type: !808, flags: DIFlagPrototyped, spFlags: 0)
!850 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !851, file: !787, line: 94)
!851 = !DISubprogram(name: "strxfrm", scope: !782, file: !782, line: 147, type: !852, flags: DIFlagPrototyped, spFlags: 0)
!852 = !DISubroutineType(types: !853)
!853 = !{!16, !812, !813, !16}
!854 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !855, file: !787, line: 95)
!855 = !DISubprogram(name: "strchr", scope: !782, file: !782, line: 208, type: !856, flags: DIFlagPrototyped, spFlags: 0)
!856 = !DISubroutineType(types: !857)
!857 = !{!814, !814, !91}
!858 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !859, file: !787, line: 96)
!859 = !DISubprogram(name: "strpbrk", scope: !782, file: !782, line: 285, type: !860, flags: DIFlagPrototyped, spFlags: 0)
!860 = !DISubroutineType(types: !861)
!861 = !{!814, !814, !814}
!862 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !863, file: !787, line: 97)
!863 = !DISubprogram(name: "strrchr", scope: !782, file: !782, line: 235, type: !856, flags: DIFlagPrototyped, spFlags: 0)
!864 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !865, file: !787, line: 98)
!865 = !DISubprogram(name: "strstr", scope: !782, file: !782, line: 312, type: !860, flags: DIFlagPrototyped, spFlags: 0)
!866 = !DIImportedEntity(tag: DW_TAG_imported_declaration, name: "xercesc", scope: !0, entity: !6, file: !867, line: 433)
!867 = !DIFile(filename: "./xercesc/util/XercesDefs.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!868 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !869, file: !873, line: 52)
!869 = !DISubprogram(name: "abs", scope: !870, file: !870, line: 840, type: !871, flags: DIFlagPrototyped, spFlags: 0)
!870 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!871 = !DISubroutineType(types: !872)
!872 = !{!91, !91}
!873 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/std_abs.h", directory: "")
!874 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !875, file: !877, line: 127)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !870, line: 62, baseType: !876)
!876 = !DICompositeType(tag: DW_TAG_structure_type, file: !870, line: 58, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!877 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cstdlib", directory: "")
!878 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !879, file: !877, line: 128)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !870, line: 70, baseType: !880)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !870, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !881, identifier: "_ZTS6ldiv_t")
!881 = !{!882, !884}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !880, file: !870, line: 68, baseType: !883, size: 64)
!883 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !880, file: !870, line: 69, baseType: !883, size: 64, offset: 64)
!885 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !886, file: !877, line: 130)
!886 = !DISubprogram(name: "abort", scope: !870, file: !870, line: 591, type: !887, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!887 = !DISubroutineType(types: !888)
!888 = !{null}
!889 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !890, file: !877, line: 134)
!890 = !DISubprogram(name: "atexit", scope: !870, file: !870, line: 595, type: !891, flags: DIFlagPrototyped, spFlags: 0)
!891 = !DISubroutineType(types: !892)
!892 = !{!91, !893}
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!894 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !895, file: !877, line: 137)
!895 = !DISubprogram(name: "at_quick_exit", scope: !870, file: !870, line: 600, type: !891, flags: DIFlagPrototyped, spFlags: 0)
!896 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !897, file: !877, line: 140)
!897 = !DISubprogram(name: "atof", scope: !870, file: !870, line: 101, type: !898, flags: DIFlagPrototyped, spFlags: 0)
!898 = !DISubroutineType(types: !899)
!899 = !{!777, !814}
!900 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !901, file: !877, line: 141)
!901 = !DISubprogram(name: "atoi", scope: !870, file: !870, line: 104, type: !902, flags: DIFlagPrototyped, spFlags: 0)
!902 = !DISubroutineType(types: !903)
!903 = !{!91, !814}
!904 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !905, file: !877, line: 142)
!905 = !DISubprogram(name: "atol", scope: !870, file: !870, line: 107, type: !906, flags: DIFlagPrototyped, spFlags: 0)
!906 = !DISubroutineType(types: !907)
!907 = !{!883, !814}
!908 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !909, file: !877, line: 143)
!909 = !DISubprogram(name: "bsearch", scope: !870, file: !870, line: 820, type: !910, flags: DIFlagPrototyped, spFlags: 0)
!910 = !DISubroutineType(types: !911)
!911 = !{!15, !785, !785, !16, !16, !912}
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !870, line: 808, baseType: !913)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DISubroutineType(types: !915)
!915 = !{!91, !785, !785}
!916 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !917, file: !877, line: 144)
!917 = !DISubprogram(name: "calloc", scope: !870, file: !870, line: 542, type: !918, flags: DIFlagPrototyped, spFlags: 0)
!918 = !DISubroutineType(types: !919)
!919 = !{!15, !16, !16}
!920 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !921, file: !877, line: 145)
!921 = !DISubprogram(name: "div", scope: !870, file: !870, line: 852, type: !922, flags: DIFlagPrototyped, spFlags: 0)
!922 = !DISubroutineType(types: !923)
!923 = !{!875, !91, !91}
!924 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !925, file: !877, line: 146)
!925 = !DISubprogram(name: "exit", scope: !870, file: !870, line: 617, type: !926, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!926 = !DISubroutineType(types: !927)
!927 = !{null, !91}
!928 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !929, file: !877, line: 147)
!929 = !DISubprogram(name: "free", scope: !870, file: !870, line: 565, type: !29, flags: DIFlagPrototyped, spFlags: 0)
!930 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !931, file: !877, line: 148)
!931 = !DISubprogram(name: "getenv", scope: !870, file: !870, line: 634, type: !932, flags: DIFlagPrototyped, spFlags: 0)
!932 = !DISubroutineType(types: !933)
!933 = !{!810, !814}
!934 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !935, file: !877, line: 149)
!935 = !DISubprogram(name: "labs", scope: !870, file: !870, line: 841, type: !936, flags: DIFlagPrototyped, spFlags: 0)
!936 = !DISubroutineType(types: !937)
!937 = !{!883, !883}
!938 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !939, file: !877, line: 150)
!939 = !DISubprogram(name: "ldiv", scope: !870, file: !870, line: 854, type: !940, flags: DIFlagPrototyped, spFlags: 0)
!940 = !DISubroutineType(types: !941)
!941 = !{!879, !883, !883}
!942 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !943, file: !877, line: 151)
!943 = !DISubprogram(name: "malloc", scope: !870, file: !870, line: 539, type: !13, flags: DIFlagPrototyped, spFlags: 0)
!944 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !945, file: !877, line: 153)
!945 = !DISubprogram(name: "mblen", scope: !870, file: !870, line: 922, type: !946, flags: DIFlagPrototyped, spFlags: 0)
!946 = !DISubroutineType(types: !947)
!947 = !{!91, !814, !16}
!948 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !949, file: !877, line: 154)
!949 = !DISubprogram(name: "mbstowcs", scope: !870, file: !870, line: 933, type: !950, flags: DIFlagPrototyped, spFlags: 0)
!950 = !DISubroutineType(types: !951)
!951 = !{!16, !952, !813, !16}
!952 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !953)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!955 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !956, file: !877, line: 155)
!956 = !DISubprogram(name: "mbtowc", scope: !870, file: !870, line: 925, type: !957, flags: DIFlagPrototyped, spFlags: 0)
!957 = !DISubroutineType(types: !958)
!958 = !{!91, !952, !813, !16}
!959 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !960, file: !877, line: 157)
!960 = !DISubprogram(name: "qsort", scope: !870, file: !870, line: 830, type: !961, flags: DIFlagPrototyped, spFlags: 0)
!961 = !DISubroutineType(types: !962)
!962 = !{null, !15, !16, !16, !912}
!963 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !964, file: !877, line: 160)
!964 = !DISubprogram(name: "quick_exit", scope: !870, file: !870, line: 623, type: !926, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!965 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !966, file: !877, line: 163)
!966 = !DISubprogram(name: "rand", scope: !870, file: !870, line: 453, type: !967, flags: DIFlagPrototyped, spFlags: 0)
!967 = !DISubroutineType(types: !968)
!968 = !{!91}
!969 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !970, file: !877, line: 164)
!970 = !DISubprogram(name: "realloc", scope: !870, file: !870, line: 550, type: !971, flags: DIFlagPrototyped, spFlags: 0)
!971 = !DISubroutineType(types: !972)
!972 = !{!15, !15, !16}
!973 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !974, file: !877, line: 165)
!974 = !DISubprogram(name: "srand", scope: !870, file: !870, line: 455, type: !975, flags: DIFlagPrototyped, spFlags: 0)
!975 = !DISubroutineType(types: !976)
!976 = !{null, !42}
!977 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !978, file: !877, line: 166)
!978 = !DISubprogram(name: "strtod", scope: !870, file: !870, line: 117, type: !979, flags: DIFlagPrototyped, spFlags: 0)
!979 = !DISubroutineType(types: !980)
!980 = !{!777, !813, !981}
!981 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !982)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!983 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !984, file: !877, line: 167)
!984 = !DISubprogram(name: "strtol", scope: !870, file: !870, line: 176, type: !985, flags: DIFlagPrototyped, spFlags: 0)
!985 = !DISubroutineType(types: !986)
!986 = !{!883, !813, !981, !91}
!987 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !988, file: !877, line: 168)
!988 = !DISubprogram(name: "strtoul", scope: !870, file: !870, line: 180, type: !989, flags: DIFlagPrototyped, spFlags: 0)
!989 = !DISubroutineType(types: !990)
!990 = !{!18, !813, !981, !91}
!991 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !992, file: !877, line: 169)
!992 = !DISubprogram(name: "system", scope: !870, file: !870, line: 784, type: !902, flags: DIFlagPrototyped, spFlags: 0)
!993 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !994, file: !877, line: 171)
!994 = !DISubprogram(name: "wcstombs", scope: !870, file: !870, line: 936, type: !995, flags: DIFlagPrototyped, spFlags: 0)
!995 = !DISubroutineType(types: !996)
!996 = !{!16, !812, !997, !16}
!997 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !998)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !954)
!1000 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !1001, file: !877, line: 172)
!1001 = !DISubprogram(name: "wctomb", scope: !870, file: !870, line: 929, type: !1002, flags: DIFlagPrototyped, spFlags: 0)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!91, !810, !954}
!1004 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1005, entity: !1006, file: !877, line: 200)
!1005 = !DINamespace(name: "__gnu_cxx", scope: null)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !870, line: 80, baseType: !1007)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !870, line: 76, size: 128, flags: DIFlagTypePassByValue, elements: !1008, identifier: "_ZTS7lldiv_t")
!1008 = !{!1009, !1011}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !1007, file: !870, line: 78, baseType: !1010, size: 64)
!1010 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !1007, file: !870, line: 79, baseType: !1010, size: 64, offset: 64)
!1012 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1005, entity: !1013, file: !877, line: 206)
!1013 = !DISubprogram(name: "_Exit", scope: !870, file: !870, line: 629, type: !926, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!1014 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1005, entity: !1015, file: !877, line: 210)
!1015 = !DISubprogram(name: "llabs", scope: !870, file: !870, line: 844, type: !1016, flags: DIFlagPrototyped, spFlags: 0)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!1010, !1010}
!1018 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1005, entity: !1019, file: !877, line: 216)
!1019 = !DISubprogram(name: "lldiv", scope: !870, file: !870, line: 858, type: !1020, flags: DIFlagPrototyped, spFlags: 0)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!1006, !1010, !1010}
!1022 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1005, entity: !1023, file: !877, line: 227)
!1023 = !DISubprogram(name: "atoll", scope: !870, file: !870, line: 112, type: !1024, flags: DIFlagPrototyped, spFlags: 0)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!1010, !814}
!1026 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1005, entity: !1027, file: !877, line: 228)
!1027 = !DISubprogram(name: "strtoll", scope: !870, file: !870, line: 200, type: !1028, flags: DIFlagPrototyped, spFlags: 0)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!1010, !813, !981, !91}
!1030 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1005, entity: !1031, file: !877, line: 229)
!1031 = !DISubprogram(name: "strtoull", scope: !870, file: !870, line: 205, type: !1032, flags: DIFlagPrototyped, spFlags: 0)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!1034, !813, !981, !91}
!1034 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1035 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1005, entity: !1036, file: !877, line: 231)
!1036 = !DISubprogram(name: "strtof", scope: !870, file: !870, line: 123, type: !1037, flags: DIFlagPrototyped, spFlags: 0)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{!1039, !813, !981}
!1039 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1040 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1005, entity: !1041, file: !877, line: 232)
!1041 = !DISubprogram(name: "strtold", scope: !870, file: !870, line: 126, type: !1042, flags: DIFlagPrototyped, spFlags: 0)
!1042 = !DISubroutineType(types: !1043)
!1043 = !{!1044, !813, !981}
!1044 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!1045 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !1006, file: !877, line: 240)
!1046 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !1013, file: !877, line: 242)
!1047 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !1015, file: !877, line: 244)
!1048 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !1049, file: !877, line: 245)
!1049 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !1005, file: !877, line: 213, type: !1020, flags: DIFlagPrototyped, spFlags: 0)
!1050 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !780, entity: !1019, file: !877, line: 246)
