; ModuleID = 'ValueStoreCache.cpp'
source_filename = "ValueStoreCache.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"class.xercesc_2_7::ValueStoreCache" = type { %"class.xercesc_2_7::RefVectorOf"*, %"class.xercesc_2_7::RefHashTableOf.8"*, %"class.xercesc_2_7::RefHash2KeysTableOf"*, %"class.xercesc_2_7::RefStackOf"*, %"class.xercesc_2_7::XMLScanner"*, %"class.xercesc_2_7::MemoryManager"* }
%"class.xercesc_2_7::RefVectorOf" = type { %"class.xercesc_2_7::BaseRefVectorOf" }
%"class.xercesc_2_7::BaseRefVectorOf" = type { i32 (...)**, i8, i32, i32, %"class.xercesc_2_7::ValueStore"**, %"class.xercesc_2_7::MemoryManager"* }
%"class.xercesc_2_7::ValueStore" = type { i8, i32, %"class.xercesc_2_7::IdentityConstraint"*, %"class.xercesc_2_7::FieldValueMap", %"class.xercesc_2_7::RefVectorOf.7"*, %"class.xercesc_2_7::ValueStore"*, %"class.xercesc_2_7::XMLScanner"*, %"class.xercesc_2_7::MemoryManager"* }
%"class.xercesc_2_7::IdentityConstraint" = type <{ %"class.xercesc_2_7::XSerializable", i16*, i16*, %"class.xercesc_2_7::IC_Selector"*, %"class.xercesc_2_7::RefVectorOf.0"*, %"class.xercesc_2_7::MemoryManager"*, i32, [4 x i8] }>
%"class.xercesc_2_7::XSerializable" = type { i32 (...)** }
%"class.xercesc_2_7::IC_Selector" = type opaque
%"class.xercesc_2_7::RefVectorOf.0" = type { %"class.xercesc_2_7::BaseRefVectorOf.1" }

!411 = !DIEnumerator(name: "XSer_GrammarPool_Empty", value: 397, isUnsigned: true)
!412 = !DIEnumerator(name: "XSer_GrammarPool_NotEmpty", value: 398, isUnsigned: true)
!413 = !DIEnumerator(name: "XSer_StringPool_NotEmpty", value: 399, isUnsigned: true)
!414 = !DIEnumerator(name: "XSer_Storer_NewerThan_Loader", value: 400, isUnsigned: true)
!415 = !DIEnumerator(name: "F_HighBounds", value: 401, isUnsigned: true)
!416 = !DIEnumerator(name: "E_LowBounds", value: 402, isUnsigned: true)
!417 = !DIEnumerator(name: "E_HighBounds", value: 403, isUnsigned: true)
!418 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ICType", scope: !420, file: !419, line: 50, baseType: !12, size: 32, elements: !421, identifier: "_ZTSN11xercesc_2_718IdentityConstraint6ICTypeE")
!419 = !DIFile(filename: "./xercesc/validators/schema/identity/IdentityConstraint.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!420 = !DICompositeType(tag: DW_TAG_class_type, name: "IdentityConstraint", scope: !6, file: !419, line: 44, flags: DIFlagFwdDecl)
!421 = !{!422, !423, !424, !425}
!422 = !DIEnumerator(name: "UNIQUE", value: 0, isUnsigned: true)
!423 = !DIEnumerator(name: "KEY", value: 1, isUnsigned: true)
!424 = !DIEnumerator(name: "KEYREF", value: 2, isUnsigned: true)
!425 = !DIEnumerator(name: "UNKNOWN", value: 3, isUnsigned: true)
!426 = !{!427, !469, !12, !439, !757, !837}
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "RefHashTableOf<xercesc_2_7::ValueStore>", scope: !6, file: !430, line: 72, size: 384, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !431, templateParams: !861, identifier: "_ZTSN11xercesc_2_714RefHashTableOfINS_10ValueStoreEEE")
!430 = !DIFile(filename: "./xercesc/util/RefHashTableOf.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!431 = !{!432, !465, !466, !468, !1148, !1149, !1150, !1151, !1152, !1156, !1159, !1162, !1165, !1169, !1172, !1175, !1176, !1177, !1180, !1183, !1186, !1187, !1190, !1193, !1196, !1197, !1200, !1203, !1207, !1211, !1214, !1218, !1221}
!432 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !429, baseType: !433, flags: DIFlagPublic, extraData: i32 0)
!433 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "XMemory", scope: !6, file: !434, line: 40, size: 8, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !435, identifier: "_ZTSN11xercesc_2_77XMemoryE")
!434 = !DIFile(filename: "./xercesc/util/XMemory.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!435 = !{!436, !443, !449, !452, !455, !458, !461}
!436 = !DISubprogram(name: "operator new", linkageName: "_ZN11xercesc_2_77XMemorynwEm", scope: !433, file: !434, line: 54, type: !437, scopeLine: 54, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!437 = !DISubroutineType(types: !438)
!438 = !{!439, !440}
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !441, line: 46, baseType: !442)
!441 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!442 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!443 = !DISubprogram(name: "operator new", linkageName: "_ZN11xercesc_2_77XMemorynwEmPNS_13MemoryManagerE", scope: !433, file: !434, line: 82, type: !444, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!444 = !DISubroutineType(types: !445)
!445 = !{!439, !440, !446}
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DICompositeType(tag: DW_TAG_class_type, name: "MemoryManager", scope: !6, file: !448, line: 38, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_713MemoryManagerE")
!448 = !DIFile(filename: "./xercesc/framework/MemoryManager.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!449 = !DISubprogram(name: "operator new", linkageName: "_ZN11xercesc_2_77XMemorynwEmPv", scope: !433, file: !434, line: 90, type: !450, scopeLine: 90, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!450 = !DISubroutineType(types: !451)
!451 = !{!439, !440, !439}
!452 = !DISubprogram(name: "operator delete", linkageName: "_ZN11xercesc_2_77XMemorydlEPv", scope: !433, file: !434, line: 97, type: !453, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!453 = !DISubroutineType(types: !454)
!454 = !{null, !439}
!455 = !DISubprogram(name: "operator delete", linkageName: "_ZN11xercesc_2_77XMemorydlEPvPNS_13MemoryManagerE", scope: !433, file: !434, line: 107, type: !456, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!456 = !DISubroutineType(types: !457)
!457 = !{null, !439, !446}
!458 = !DISubprogram(name: "operator delete", linkageName: "_ZN11xercesc_2_77XMemorydlEPvS1_", scope: !433, file: !434, line: 115, type: !459, scopeLine: 115, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!459 = !DISubroutineType(types: !460)
!460 = !{null, !439, !439}
!461 = !DISubprogram(name: "XMemory", scope: !433, file: !434, line: 130, type: !462, scopeLine: 130, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!462 = !DISubroutineType(types: !463)
!463 = !{null, !464}
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "fMemoryManager", scope: !429, file: !430, line: 178, baseType: !446, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "fAdoptedElems", scope: !429, file: !430, line: 179, baseType: !467, size: 8, offset: 64)
!467 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "fBucketList", scope: !429, file: !430, line: 180, baseType: !469, size: 64, offset: 128)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RefHashTableBucketElem<xercesc_2_7::ValueStore>", scope: !6, file: !430, line: 49, size: 192, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !472, templateParams: !861, identifier: "_ZTSN11xercesc_2_722RefHashTableBucketElemINS_10ValueStoreEEE")
!472 = !{!473, !1129, !1130, !1131, !1135, !1138, !1139, !1144}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "fData", scope: !471, file: !430, line: 59, baseType: !474, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "ValueStore", scope: !6, file: !476, line: 47, size: 640, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !477, identifier: "_ZTSN11xercesc_2_710ValueStoreE")
!476 = !DIFile(filename: "./xercesc/validators/schema/identity/ValueStore.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!477 = !{!478, !479, !480, !482, !484, !686, !690, !691, !695, !696, !702, !705, !710, !715, !716, !717, !723, !728, !731, !1114, !1115, !1118, !1122, !1126}
!478 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !475, baseType: !433, flags: DIFlagPublic, extraData: i32 0)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "fDoReportError", scope: !475, file: !476, line: 118, baseType: !467, size: 8)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "fValuesCount", scope: !475, file: !476, line: 119, baseType: !481, size: 32, offset: 32)
!481 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "fIdentityConstraint", scope: !475, file: !476, line: 120, baseType: !483, size: 64, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "fValues", scope: !475, file: !476, line: 121, baseType: !485, size: 256, offset: 128)
!485 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "FieldValueMap", scope: !6, file: !486, line: 45, size: 256, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !487, identifier: "_ZTSN11xercesc_2_713FieldValueMapE")
!486 = !DIFile(filename: "./xercesc/validators/schema/identity/FieldValueMap.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!487 = !{!488, !489, !561, !629, !633, !634, !638, !643, !646, !650, !656, !663, !666, !669, !675, !678, !681, !682}
!488 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !485, baseType: !433, flags: DIFlagPublic, extraData: i32 0)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "fFields", scope: !485, file: !486, line: 90, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "ValueVectorOf<xercesc_2_7::IC_Field *>", scope: !6, file: !492, line: 32, size: 256, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !493, templateParams: !559, identifier: "_ZTSN11xercesc_2_713ValueVectorOfIPNS_8IC_FieldEEE")
!492 = !DIFile(filename: "./xercesc/util/ValueVectorOf.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!493 = !{!494, !495, !496, !497, !498, !503, !504, !511, !516, !519, !523, !528, !531, !532, !535, !536, !539, !543, !547, !550, !551, !554, !555}
!494 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !491, baseType: !433, flags: DIFlagPublic, extraData: i32 0)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "fCallDestructor", scope: !491, file: !492, line: 97, baseType: !467, size: 8)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "fCurCount", scope: !491, file: !492, line: 98, baseType: !12, size: 32, offset: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "fMaxCount", scope: !491, file: !492, line: 99, baseType: !12, size: 32, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "fElemList", scope: !491, file: !492, line: 100, baseType: !499, size: 64, offset: 128)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DICompositeType(tag: DW_TAG_class_type, name: "IC_Field", scope: !6, file: !502, line: 41, flags: DIFlagFwdDecl)
!502 = !DIFile(filename: "./xercesc/validators/schema/identity/IC_Field.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!503 = !DIDerivedType(tag: DW_TAG_member, name: "fMemoryManager", scope: !491, file: !492, line: 101, baseType: !446, size: 64, offset: 192)
!504 = !DISubprogram(name: "ValueVectorOf", scope: !491, file: !492, line: 38, type: !505, scopeLine: 38, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!505 = !DISubroutineType(types: !506)
!506 = !{null, !507, !508, !509, !510}
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!508 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!509 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !446)
!510 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !467)
!511 = !DISubprogram(name: "ValueVectorOf", scope: !491, file: !492, line: 44, type: !512, scopeLine: 44, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!512 = !DISubroutineType(types: !513)
!513 = !{null, !507, !514}
!514 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !515, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !491)
!516 = !DISubprogram(name: "~ValueVectorOf", scope: !491, file: !492, line: 45, type: !517, scopeLine: 45, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!517 = !DISubroutineType(types: !518)
!518 = !{null, !507}
!519 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPNS_8IC_FieldEEaSERKS3_", scope: !491, file: !492, line: 51, type: !520, scopeLine: 51, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!520 = !DISubroutineType(types: !521)
!521 = !{!522, !507, !514}
!522 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !491, size: 64)
!523 = !DISubprogram(name: "addElement", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPNS_8IC_FieldEE10addElementERKS2_", scope: !491, file: !492, line: 57, type: !524, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!524 = !DISubroutineType(types: !525)
!525 = !{null, !507, !526}
!526 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !527, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !500)
!528 = !DISubprogram(name: "setElementAt", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPNS_8IC_FieldEE12setElementAtERKS2_j", scope: !491, file: !492, line: 58, type: !529, scopeLine: 58, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!529 = !DISubroutineType(types: !530)
!530 = !{null, !507, !526, !508}
!531 = !DISubprogram(name: "insertElementAt", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPNS_8IC_FieldEE15insertElementAtERKS2_j", scope: !491, file: !492, line: 59, type: !529, scopeLine: 59, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!532 = !DISubprogram(name: "removeElementAt", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPNS_8IC_FieldEE15removeElementAtEj", scope: !491, file: !492, line: 60, type: !533, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!533 = !DISubroutineType(types: !534)
!534 = !{null, !507, !508}
!535 = !DISubprogram(name: "removeAllElements", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPNS_8IC_FieldEE17removeAllElementsEv", scope: !491, file: !492, line: 61, type: !517, scopeLine: 61, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!536 = !DISubprogram(name: "containsElement", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPNS_8IC_FieldEE15containsElementERKS2_j", scope: !491, file: !492, line: 62, type: !537, scopeLine: 62, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!537 = !DISubroutineType(types: !538)
!538 = !{!467, !507, !526, !508}
!539 = !DISubprogram(name: "elementAt", linkageName: "_ZNK11xercesc_2_713ValueVectorOfIPNS_8IC_FieldEE9elementAtEj", scope: !491, file: !492, line: 68, type: !540, scopeLine: 68, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!540 = !DISubroutineType(types: !541)
!541 = !{!526, !542, !508}
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!543 = !DISubprogram(name: "elementAt", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPNS_8IC_FieldEE9elementAtEj", scope: !491, file: !492, line: 69, type: !544, scopeLine: 69, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!544 = !DISubroutineType(types: !545)
!545 = !{!546, !507, !508}
!546 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !500, size: 64)
!547 = !DISubprogram(name: "curCapacity", linkageName: "_ZNK11xercesc_2_713ValueVectorOfIPNS_8IC_FieldEE11curCapacityEv", scope: !491, file: !492, line: 70, type: !548, scopeLine: 70, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!548 = !DISubroutineType(types: !549)
!549 = !{!12, !542}
!550 = !DISubprogram(name: "size", linkageName: "_ZNK11xercesc_2_713ValueVectorOfIPNS_8IC_FieldEE4sizeEv", scope: !491, file: !492, line: 71, type: !548, scopeLine: 71, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!551 = !DISubprogram(name: "getMemoryManager", linkageName: "_ZNK11xercesc_2_713ValueVectorOfIPNS_8IC_FieldEE16getMemoryManagerEv", scope: !491, file: !492, line: 72, type: !552, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!552 = !DISubroutineType(types: !553)
!553 = !{!446, !542}
!554 = !DISubprogram(name: "ensureExtraCapacity", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPNS_8IC_FieldEE19ensureExtraCapacityEj", scope: !491, file: !492, line: 78, type: !533, scopeLine: 78, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!555 = !DISubprogram(name: "rawData", linkageName: "_ZNK11xercesc_2_713ValueVectorOfIPNS_8IC_FieldEE7rawDataEv", scope: !491, file: !492, line: 79, type: !556, scopeLine: 79, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!556 = !DISubroutineType(types: !557)
!557 = !{!558, !542}
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!559 = !{!560}
!560 = !DITemplateTypeParameter(name: "TElem", type: !500)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "fValidators", scope: !485, file: !486, line: 91, baseType: !562, size: 64, offset: 64)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "ValueVectorOf<xercesc_2_7::DatatypeValidator *>", scope: !6, file: !492, line: 32, size: 256, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !564, templateParams: !627, identifier: "_ZTSN11xercesc_2_713ValueVectorOfIPNS_17DatatypeValidatorEEE")
!564 = !{!565, !566, !567, !568, !569, !574, !575, !579, !584, !587, !591, !596, !599, !600, !603, !604, !607, !611, !615, !618, !619, !622, !623}
!565 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !563, baseType: !433, flags: DIFlagPublic, extraData: i32 0)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "fCallDestructor", scope: !563, file: !492, line: 97, baseType: !467, size: 8)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "fCurCount", scope: !563, file: !492, line: 98, baseType: !12, size: 32, offset: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "fMaxCount", scope: !563, file: !492, line: 99, baseType: !12, size: 32, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "fElemList", scope: !563, file: !492, line: 100, baseType: !570, size: 64, offset: 128)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DICompositeType(tag: DW_TAG_class_type, name: "DatatypeValidator", scope: !6, file: !573, line: 54, flags: DIFlagFwdDecl)
!573 = !DIFile(filename: "./xercesc/validators/datatype/DatatypeValidator.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!574 = !DIDerivedType(tag: DW_TAG_member, name: "fMemoryManager", scope: !563, file: !492, line: 101, baseType: !446, size: 64, offset: 192)
!575 = !DISubprogram(name: "ValueVectorOf", scope: !563, file: !492, line: 38, type: !576, scopeLine: 38, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!576 = !DISubroutineType(types: !577)
!577 = !{null, !578, !508, !509, !510}
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!579 = !DISubprogram(name: "ValueVectorOf", scope: !563, file: !492, line: 44, type: !580, scopeLine: 44, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!580 = !DISubroutineType(types: !581)
!581 = !{null, !578, !582}
!582 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !563)
!584 = !DISubprogram(name: "~ValueVectorOf", scope: !563, file: !492, line: 45, type: !585, scopeLine: 45, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!585 = !DISubroutineType(types: !586)
!586 = !{null, !578}
!587 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPNS_17DatatypeValidatorEEaSERKS3_", scope: !563, file: !492, line: 51, type: !588, scopeLine: 51, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!588 = !DISubroutineType(types: !589)
!589 = !{!590, !578, !582}
!590 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !563, size: 64)
!591 = !DISubprogram(name: "addElement", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPNS_17DatatypeValidatorEE10addElementERKS2_", scope: !563, file: !492, line: 57, type: !592, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!592 = !DISubroutineType(types: !593)
!593 = !{null, !578, !594}
!594 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !571)
!596 = !DISubprogram(name: "setElementAt", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPNS_17DatatypeValidatorEE12setElementAtERKS2_j", scope: !563, file: !492, line: 58, type: !597, scopeLine: 58, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!597 = !DISubroutineType(types: !598)
!598 = !{null, !578, !594, !508}
!599 = !DISubprogram(name: "insertElementAt", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPNS_17DatatypeValidatorEE15insertElementAtERKS2_j", scope: !563, file: !492, line: 59, type: !597, scopeLine: 59, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!600 = !DISubprogram(name: "removeElementAt", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPNS_17DatatypeValidatorEE15removeElementAtEj", scope: !563, file: !492, line: 60, type: !601, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!601 = !DISubroutineType(types: !602)
!602 = !{null, !578, !508}
!603 = !DISubprogram(name: "removeAllElements", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPNS_17DatatypeValidatorEE17removeAllElementsEv", scope: !563, file: !492, line: 61, type: !585, scopeLine: 61, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!604 = !DISubprogram(name: "containsElement", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPNS_17DatatypeValidatorEE15containsElementERKS2_j", scope: !563, file: !492, line: 62, type: !605, scopeLine: 62, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!605 = !DISubroutineType(types: !606)
!606 = !{!467, !578, !594, !508}
!607 = !DISubprogram(name: "elementAt", linkageName: "_ZNK11xercesc_2_713ValueVectorOfIPNS_17DatatypeValidatorEE9elementAtEj", scope: !563, file: !492, line: 68, type: !608, scopeLine: 68, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!608 = !DISubroutineType(types: !609)
!609 = !{!594, !610, !508}
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!611 = !DISubprogram(name: "elementAt", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPNS_17DatatypeValidatorEE9elementAtEj", scope: !563, file: !492, line: 69, type: !612, scopeLine: 69, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!612 = !DISubroutineType(types: !613)
!613 = !{!614, !578, !508}
!614 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !571, size: 64)
!615 = !DISubprogram(name: "curCapacity", linkageName: "_ZNK11xercesc_2_713ValueVectorOfIPNS_17DatatypeValidatorEE11curCapacityEv", scope: !563, file: !492, line: 70, type: !616, scopeLine: 70, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!616 = !DISubroutineType(types: !617)
!617 = !{!12, !610}
!618 = !DISubprogram(name: "size", linkageName: "_ZNK11xercesc_2_713ValueVectorOfIPNS_17DatatypeValidatorEE4sizeEv", scope: !563, file: !492, line: 71, type: !616, scopeLine: 71, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!619 = !DISubprogram(name: "getMemoryManager", linkageName: "_ZNK11xercesc_2_713ValueVectorOfIPNS_17DatatypeValidatorEE16getMemoryManagerEv", scope: !563, file: !492, line: 72, type: !620, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!620 = !DISubroutineType(types: !621)
!621 = !{!446, !610}
!622 = !DISubprogram(name: "ensureExtraCapacity", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPNS_17DatatypeValidatorEE19ensureExtraCapacityEj", scope: !563, file: !492, line: 78, type: !601, scopeLine: 78, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!623 = !DISubprogram(name: "rawData", linkageName: "_ZNK11xercesc_2_713ValueVectorOfIPNS_17DatatypeValidatorEE7rawDataEv", scope: !563, file: !492, line: 79, type: !624, scopeLine: 79, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!624 = !DISubroutineType(types: !625)
!625 = !{!626, !610}
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!627 = !{!628}
!628 = !DITemplateTypeParameter(name: "TElem", type: !571)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "fValues", scope: !485, file: !486, line: 92, baseType: !630, size: 64, offset: 128)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DICompositeType(tag: DW_TAG_class_type, name: "RefArrayVectorOf<unsigned short>", scope: !6, file: !632, line: 28, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_716RefArrayVectorOfItEE")
!632 = !DIFile(filename: "./xercesc/util/RefArrayVectorOf.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!633 = !DIDerivedType(tag: DW_TAG_member, name: "fMemoryManager", scope: !485, file: !486, line: 93, baseType: !446, size: 64, offset: 192)
!634 = !DISubprogram(name: "FieldValueMap", scope: !485, file: !486, line: 51, type: !635, scopeLine: 51, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!635 = !DISubroutineType(types: !636)
!636 = !{null, !637, !509}
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!638 = !DISubprogram(name: "FieldValueMap", scope: !485, file: !486, line: 52, type: !639, scopeLine: 52, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!639 = !DISubroutineType(types: !640)
!640 = !{null, !637, !641}
!641 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !642, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !485)
!643 = !DISubprogram(name: "~FieldValueMap", scope: !485, file: !486, line: 53, type: !644, scopeLine: 53, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!644 = !DISubroutineType(types: !645)
!645 = !{null, !637}
!646 = !DISubprogram(name: "getDatatypeValidatorAt", linkageName: "_ZNK11xercesc_2_713FieldValueMap22getDatatypeValidatorAtEj", scope: !485, file: !486, line: 58, type: !647, scopeLine: 58, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!647 = !DISubroutineType(types: !648)
!648 = !{!571, !649, !508}
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!650 = !DISubprogram(name: "getDatatypeValidatorFor", linkageName: "_ZNK11xercesc_2_713FieldValueMap23getDatatypeValidatorForEPKNS_8IC_FieldE", scope: !485, file: !486, line: 59, type: !651, scopeLine: 59, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!651 = !DISubroutineType(types: !652)
!652 = !{!571, !649, !653}
!653 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !654)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !501)
!656 = !DISubprogram(name: "getValueAt", linkageName: "_ZNK11xercesc_2_713FieldValueMap10getValueAtEj", scope: !485, file: !486, line: 60, type: !657, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!657 = !DISubroutineType(types: !658)
!658 = !{!659, !649, !508}
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMLCh", file: !661, line: 67, baseType: !662)
!661 = !DIFile(filename: "./xercesc/util/Compilers/GCCDefs.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!662 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!663 = !DISubprogram(name: "getValueFor", linkageName: "_ZNK11xercesc_2_713FieldValueMap11getValueForEPKNS_8IC_FieldE", scope: !485, file: !486, line: 61, type: !664, scopeLine: 61, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!664 = !DISubroutineType(types: !665)
!665 = !{!659, !649, !653}
!666 = !DISubprogram(name: "keyAt", linkageName: "_ZNK11xercesc_2_713FieldValueMap5keyAtEj", scope: !485, file: !486, line: 62, type: !667, scopeLine: 62, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!667 = !DISubroutineType(types: !668)
!668 = !{!500, !649, !508}
!669 = !DISubprogram(name: "put", linkageName: "_ZN11xercesc_2_713FieldValueMap3putEPNS_8IC_FieldEPNS_17DatatypeValidatorEPKt", scope: !485, file: !486, line: 67, type: !670, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!670 = !DISubroutineType(types: !671)
!671 = !{null, !637, !527, !595, !672}
!672 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !660)
!675 = !DISubprogram(name: "size", linkageName: "_ZNK11xercesc_2_713FieldValueMap4sizeEv", scope: !485, file: !486, line: 73, type: !676, scopeLine: 73, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!676 = !DISubroutineType(types: !677)
!677 = !{!12, !649}
!678 = !DISubprogram(name: "indexOf", linkageName: "_ZNK11xercesc_2_713FieldValueMap7indexOfEPKNS_8IC_FieldE", scope: !485, file: !486, line: 74, type: !679, scopeLine: 74, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!679 = !DISubroutineType(types: !680)
!680 = !{!481, !649, !653}
!681 = !DISubprogram(name: "cleanUp", linkageName: "_ZN11xercesc_2_713FieldValueMap7cleanUpEv", scope: !485, file: !486, line: 80, type: !644, scopeLine: 80, flags: DIFlagPrototyped, spFlags: 0)
!682 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_713FieldValueMapaSERKS0_", scope: !485, file: !486, line: 85, type: !683, scopeLine: 85, flags: DIFlagPrototyped, spFlags: 0)
!683 = !DISubroutineType(types: !684)
!684 = !{!685, !637, !641}
!685 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !485, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "fValueTuples", scope: !475, file: !476, line: 122, baseType: !687, size: 64, offset: 384)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DICompositeType(tag: DW_TAG_class_type, name: "RefVectorOf<xercesc_2_7::FieldValueMap>", scope: !6, file: !689, line: 32, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_711RefVectorOfINS_13FieldValueMapEEE")
!689 = !DIFile(filename: "./xercesc/util/RefVectorOf.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!690 = !DIDerivedType(tag: DW_TAG_member, name: "fKeyValueStore", scope: !475, file: !476, line: 123, baseType: !474, size: 64, offset: 448)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "fScanner", scope: !475, file: !476, line: 124, baseType: !692, size: 64, offset: 512)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DICompositeType(tag: DW_TAG_class_type, name: "XMLScanner", scope: !6, file: !694, line: 59, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_710XMLScannerE")
!694 = !DIFile(filename: "./xercesc/validators/schema/identity/ValueStoreCache.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!695 = !DIDerivedType(tag: DW_TAG_member, name: "fMemoryManager", scope: !475, file: !476, line: 125, baseType: !446, size: 64, offset: 576)
!696 = !DISubprogram(name: "ValueStore", scope: !475, file: !476, line: 53, type: !697, scopeLine: 53, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!697 = !DISubroutineType(types: !698)
!698 = !{null, !699, !700, !701, !509}
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!700 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !483)
!701 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !692)
!702 = !DISubprogram(name: "~ValueStore", scope: !475, file: !476, line: 56, type: !703, scopeLine: 56, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!703 = !DISubroutineType(types: !704)
!704 = !{null, !699}
!705 = !DISubprogram(name: "getIdentityConstraint", linkageName: "_ZNK11xercesc_2_710ValueStore21getIdentityConstraintEv", scope: !475, file: !476, line: 61, type: !706, scopeLine: 61, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!706 = !DISubroutineType(types: !707)
!707 = !{!483, !708}
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!709 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !475)
!710 = !DISubprogram(name: "append", linkageName: "_ZN11xercesc_2_710ValueStore6appendEPKS0_", scope: !475, file: !476, line: 66, type: !711, scopeLine: 66, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!711 = !DISubroutineType(types: !712)
!712 = !{null, !699, !713}
!713 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !714)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!715 = !DISubprogram(name: "startValueScope", linkageName: "_ZN11xercesc_2_710ValueStore15startValueScopeEv", scope: !475, file: !476, line: 67, type: !703, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!716 = !DISubprogram(name: "endValueScope", linkageName: "_ZN11xercesc_2_710ValueStore13endValueScopeEv", scope: !475, file: !476, line: 68, type: !703, scopeLine: 68, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!717 = !DISubprogram(name: "addValue", linkageName: "_ZN11xercesc_2_710ValueStore8addValueEPNS_14FieldActivatorEPNS_8IC_FieldEPNS_17DatatypeValidatorEPKt", scope: !475, file: !476, line: 69, type: !718, scopeLine: 69, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!718 = !DISubroutineType(types: !719)
!719 = !{null, !699, !720, !527, !595, !672}
!720 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !721)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DICompositeType(tag: DW_TAG_class_type, name: "FieldActivator", scope: !6, file: !502, line: 38, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_714FieldActivatorE")
!723 = !DISubprogram(name: "contains", linkageName: "_ZN11xercesc_2_710ValueStore8containsEPKNS_13FieldValueMapE", scope: !475, file: !476, line: 73, type: !724, scopeLine: 73, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!724 = !DISubroutineType(types: !725)
!725 = !{!467, !699, !726}
!726 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !727)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!728 = !DISubprogram(name: "addValue", linkageName: "_ZN11xercesc_2_710ValueStore8addValueEPNS_8IC_FieldEPNS_17DatatypeValidatorEPKt", scope: !475, file: !476, line: 78, type: !729, scopeLine: 78, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!729 = !DISubroutineType(types: !730)
!730 = !{null, !699, !527, !595, !672}
!731 = !DISubprogram(name: "endDcocumentFragment", linkageName: "_ZN11xercesc_2_710ValueStore20endDcocumentFragmentEPNS_15ValueStoreCacheE", scope: !475, file: !476, line: 85, type: !732, scopeLine: 85, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!732 = !DISubroutineType(types: !733)
!733 = !{null, !699, !734}
!734 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !735)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "ValueStoreCache", scope: !6, file: !694, line: 62, size: 384, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !737, identifier: "_ZTSN11xercesc_2_715ValueStoreCacheE")
!737 = !{!738, !739, !827, !828, !939, !1065, !1066, !1067, !1071, !1074, !1077, !1078, !1079, !1080, !1081, !1088, !1091, !1097, !1100, !1103, !1108, !1112, !1113}
!738 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !736, baseType: !433, flags: DIFlagPublic, extraData: i32 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "fValueStores", scope: !736, file: !694, line: 122, baseType: !740, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "RefVectorOf<xercesc_2_7::ValueStore>", scope: !6, file: !689, line: 32, size: 320, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !742, vtableHolder: !744, templateParams: !809, identifier: "_ZTSN11xercesc_2_711RefVectorOfINS_10ValueStoreEEE")
!742 = !{!743, !811, !815, !818, !823}
!743 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !741, baseType: !744, flags: DIFlagPublic, extraData: i32 0)
!744 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "BaseRefVectorOf<xercesc_2_7::ValueStore>", scope: !6, file: !745, line: 33, size: 320, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !746, vtableHolder: !744, templateParams: !809, identifier: "_ZTSN11xercesc_2_715BaseRefVectorOfINS_10ValueStoreEEE")
!745 = !DIFile(filename: "./xercesc/util/BaseRefVectorOf.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!746 = !{!747, !748, !753, !754, !755, !756, !758, !759, !763, !766, !770, !773, !774, !777, !778, !781, !782, !785, !786, !787, !792, !795, !796, !797, !800, !801, !805}
!747 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !744, baseType: !433, flags: DIFlagPublic, extraData: i32 0)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$BaseRefVectorOf", scope: !745, file: !745, baseType: !749, size: 64, flags: DIFlagArtificial)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !751, size: 64)
!751 = !DISubroutineType(types: !752)
!752 = !{!481}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "fAdoptedElems", scope: !744, file: !745, line: 89, baseType: !467, size: 8, offset: 64, flags: DIFlagProtected)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "fCurCount", scope: !744, file: !745, line: 90, baseType: !12, size: 32, offset: 96, flags: DIFlagProtected)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "fMaxCount", scope: !744, file: !745, line: 91, baseType: !12, size: 32, offset: 128, flags: DIFlagProtected)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "fElemList", scope: !744, file: !745, line: 92, baseType: !757, size: 64, offset: 192, flags: DIFlagProtected)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "fMemoryManager", scope: !744, file: !745, line: 93, baseType: !446, size: 64, offset: 256, flags: DIFlagProtected)
!759 = !DISubprogram(name: "BaseRefVectorOf", scope: !744, file: !745, line: 39, type: !760, scopeLine: 39, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!760 = !DISubroutineType(types: !761)
!761 = !{null, !762, !508, !510, !509}
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!763 = !DISubprogram(name: "~BaseRefVectorOf", scope: !744, file: !745, line: 45, type: !764, scopeLine: 45, containingType: !744, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!764 = !DISubroutineType(types: !765)
!765 = !{null, !762}
!766 = !DISubprogram(name: "addElement", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfINS_10ValueStoreEE10addElementEPS1_", scope: !744, file: !745, line: 51, type: !767, scopeLine: 51, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!767 = !DISubroutineType(types: !768)
!768 = !{null, !762, !769}
!769 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !474)
!770 = !DISubprogram(name: "setElementAt", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfINS_10ValueStoreEE12setElementAtEPS1_j", scope: !744, file: !745, line: 52, type: !771, scopeLine: 52, containingType: !744, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!771 = !DISubroutineType(types: !772)
!772 = !{null, !762, !769, !508}
!773 = !DISubprogram(name: "insertElementAt", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfINS_10ValueStoreEE15insertElementAtEPS1_j", scope: !744, file: !745, line: 53, type: !771, scopeLine: 53, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!774 = !DISubprogram(name: "orphanElementAt", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfINS_10ValueStoreEE15orphanElementAtEj", scope: !744, file: !745, line: 54, type: !775, scopeLine: 54, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!775 = !DISubroutineType(types: !776)
!776 = !{!474, !762, !508}
!777 = !DISubprogram(name: "removeAllElements", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfINS_10ValueStoreEE17removeAllElementsEv", scope: !744, file: !745, line: 55, type: !764, scopeLine: 55, containingType: !744, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!778 = !DISubprogram(name: "removeElementAt", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfINS_10ValueStoreEE15removeElementAtEj", scope: !744, file: !745, line: 56, type: !779, scopeLine: 56, containingType: !744, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!779 = !DISubroutineType(types: !780)
!780 = !{null, !762, !508}
!781 = !DISubprogram(name: "removeLastElement", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfINS_10ValueStoreEE17removeLastElementEv", scope: !744, file: !745, line: 57, type: !764, scopeLine: 57, containingType: !744, virtualIndex: 5, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!782 = !DISubprogram(name: "containsElement", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfINS_10ValueStoreEE15containsElementEPKS1_", scope: !744, file: !745, line: 58, type: !783, scopeLine: 58, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!783 = !DISubroutineType(types: !784)
!784 = !{!467, !762, !713}
!785 = !DISubprogram(name: "cleanup", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfINS_10ValueStoreEE7cleanupEv", scope: !744, file: !745, line: 59, type: !764, scopeLine: 59, containingType: !744, virtualIndex: 6, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!786 = !DISubprogram(name: "reinitialize", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfINS_10ValueStoreEE12reinitializeEv", scope: !744, file: !745, line: 60, type: !764, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!787 = !DISubprogram(name: "curCapacity", linkageName: "_ZNK11xercesc_2_715BaseRefVectorOfINS_10ValueStoreEE11curCapacityEv", scope: !744, file: !745, line: 66, type: !788, scopeLine: 66, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!788 = !DISubroutineType(types: !789)
!789 = !{!12, !790}
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!791 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !744)
!792 = !DISubprogram(name: "elementAt", linkageName: "_ZNK11xercesc_2_715BaseRefVectorOfINS_10ValueStoreEE9elementAtEj", scope: !744, file: !745, line: 67, type: !793, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!793 = !DISubroutineType(types: !794)
!794 = !{!714, !790, !508}
!795 = !DISubprogram(name: "elementAt", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfINS_10ValueStoreEE9elementAtEj", scope: !744, file: !745, line: 68, type: !775, scopeLine: 68, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!796 = !DISubprogram(name: "size", linkageName: "_ZNK11xercesc_2_715BaseRefVectorOfINS_10ValueStoreEE4sizeEv", scope: !744, file: !745, line: 69, type: !788, scopeLine: 69, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!797 = !DISubprogram(name: "getMemoryManager", linkageName: "_ZNK11xercesc_2_715BaseRefVectorOfINS_10ValueStoreEE16getMemoryManagerEv", scope: !744, file: !745, line: 70, type: !798, scopeLine: 70, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!798 = !DISubroutineType(types: !799)
!799 = !{!446, !790}
!800 = !DISubprogram(name: "ensureExtraCapacity", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfINS_10ValueStoreEE19ensureExtraCapacityEj", scope: !744, file: !745, line: 76, type: !779, scopeLine: 76, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!801 = !DISubprogram(name: "BaseRefVectorOf", scope: !744, file: !745, line: 82, type: !802, scopeLine: 82, flags: DIFlagPrototyped, spFlags: 0)
!802 = !DISubroutineType(types: !803)
!803 = !{null, !762, !804}
!804 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !791, size: 64)
!805 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfINS_10ValueStoreEEaSERKS2_", scope: !744, file: !745, line: 83, type: !806, scopeLine: 83, flags: DIFlagPrototyped, spFlags: 0)
!806 = !DISubroutineType(types: !807)
!807 = !{!808, !762, !804}
!808 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !744, size: 64)
!809 = !{!810}
!810 = !DITemplateTypeParameter(name: "TElem", type: !475)
!811 = !DISubprogram(name: "RefVectorOf", scope: !741, file: !689, line: 38, type: !812, scopeLine: 38, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!812 = !DISubroutineType(types: !813)
!813 = !{null, !814, !508, !510, !509}
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!815 = !DISubprogram(name: "~RefVectorOf", scope: !741, file: !689, line: 45, type: !816, scopeLine: 45, containingType: !741, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!816 = !DISubroutineType(types: !817)
!817 = !{null, !814}
!818 = !DISubprogram(name: "RefVectorOf", scope: !741, file: !689, line: 51, type: !819, scopeLine: 51, flags: DIFlagPrototyped, spFlags: 0)
!819 = !DISubroutineType(types: !820)
!820 = !{null, !814, !821}
!821 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !822, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !741)
!823 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_711RefVectorOfINS_10ValueStoreEEaSERKS2_", scope: !741, file: !689, line: 52, type: !824, scopeLine: 52, flags: DIFlagPrototyped, spFlags: 0)
!824 = !DISubroutineType(types: !825)
!825 = !{!826, !814, !821}
!826 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !741, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "fGlobalICMap", scope: !736, file: !694, line: 123, baseType: !428, size: 64, offset: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "fIC2ValueStoreMap", scope: !736, file: !694, line: 124, baseType: !829, size: 64, offset: 128)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "RefHash2KeysTableOf<xercesc_2_7::ValueStore>", scope: !6, file: !831, line: 72, size: 320, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !832, templateParams: !861, identifier: "_ZTSN11xercesc_2_719RefHash2KeysTableOfINS_10ValueStoreEEE")
!831 = !DIFile(filename: "./xercesc/util/RefHash2KeysTableOf.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!832 = !{!833, !834, !835, !836, !863, !864, !865, !869, !873, !876, !879, !882, !887, !894, !897, !900, !901, !904, !907, !910, !913, !916, !919, !923, !927, !931, !935, !938}
!833 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !830, baseType: !433, flags: DIFlagPublic, extraData: i32 0)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "fMemoryManager", scope: !830, file: !831, line: 173, baseType: !446, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "fAdoptedElems", scope: !830, file: !831, line: 174, baseType: !467, size: 8, offset: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "fBucketList", scope: !830, file: !831, line: 175, baseType: !837, size: 64, offset: 128)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RefHash2KeysTableBucketElem<xercesc_2_7::ValueStore>", scope: !6, file: !831, line: 50, size: 256, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !840, templateParams: !861, identifier: "_ZTSN11xercesc_2_727RefHash2KeysTableBucketElemINS_10ValueStoreEEE")
!840 = !{!841, !842, !843, !844, !845, !849, !852, !857}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "fData", scope: !839, file: !831, line: 58, baseType: !474, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "fNext", scope: !839, file: !831, line: 59, baseType: !838, size: 64, offset: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "fKey1", scope: !839, file: !831, line: 60, baseType: !439, size: 64, offset: 128)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "fKey2", scope: !839, file: !831, line: 61, baseType: !481, size: 32, offset: 192)
!845 = !DISubprogram(name: "RefHash2KeysTableBucketElem", scope: !839, file: !831, line: 52, type: !846, scopeLine: 52, flags: DIFlagPrototyped, spFlags: 0)
!846 = !DISubroutineType(types: !847)
!847 = !{null, !848, !439, !481, !769, !838}
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!849 = !DISubprogram(name: "~RefHash2KeysTableBucketElem", scope: !839, file: !831, line: 56, type: !850, scopeLine: 56, flags: DIFlagPrototyped, spFlags: 0)
!850 = !DISubroutineType(types: !851)
!851 = !{null, !848}
!852 = !DISubprogram(name: "RefHash2KeysTableBucketElem", scope: !839, file: !831, line: 67, type: !853, scopeLine: 67, flags: DIFlagPrivate | DIFlagPrototyped, spFlags: 0)
!853 = !DISubroutineType(types: !854)
!854 = !{null, !848, !855}
!855 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !856, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !839)
!857 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_727RefHash2KeysTableBucketElemINS_10ValueStoreEEaSERKS2_", scope: !839, file: !831, line: 68, type: !858, scopeLine: 68, flags: DIFlagPrivate | DIFlagPrototyped, spFlags: 0)
!858 = !DISubroutineType(types: !859)
!859 = !{!860, !848, !855}
!860 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !839, size: 64)
!861 = !{!862}
!862 = !DITemplateTypeParameter(name: "TVal", type: !475)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "fHashModulus", scope: !830, file: !831, line: 176, baseType: !12, size: 32, offset: 192)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "fCount", scope: !830, file: !831, line: 177, baseType: !12, size: 32, offset: 224)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "fHash", scope: !830, file: !831, line: 178, baseType: !866, size: 64, offset: 256)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DICompositeType(tag: DW_TAG_class_type, name: "HashBase", scope: !6, file: !868, line: 32, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_78HashBaseE")
!868 = !DIFile(filename: "./xercesc/util/HashBase.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!869 = !DISubprogram(name: "RefHash2KeysTableOf", scope: !830, file: !831, line: 79, type: !870, scopeLine: 79, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!870 = !DISubroutineType(types: !871)
!871 = !{null, !872, !508, !509}
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!873 = !DISubprogram(name: "RefHash2KeysTableOf", scope: !830, file: !831, line: 85, type: !874, scopeLine: 85, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!874 = !DISubroutineType(types: !875)
!875 = !{null, !872, !508, !510, !509}
!876 = !DISubprogram(name: "RefHash2KeysTableOf", scope: !830, file: !831, line: 94, type: !877, scopeLine: 94, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!877 = !DISubroutineType(types: !878)
!878 = !{null, !872, !508, !510, !866, !509}
!879 = !DISubprogram(name: "~RefHash2KeysTableOf", scope: !830, file: !831, line: 101, type: !880, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!880 = !DISubroutineType(types: !881)
!881 = !{null, !872}
!882 = !DISubprogram(name: "isEmpty", linkageName: "_ZNK11xercesc_2_719RefHash2KeysTableOfINS_10ValueStoreEE7isEmptyEv", scope: !830, file: !831, line: 107, type: !883, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!883 = !DISubroutineType(types: !884)
!884 = !{!467, !885}
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!886 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !830)
!887 = !DISubprogram(name: "containsKey", linkageName: "_ZNK11xercesc_2_719RefHash2KeysTableOfINS_10ValueStoreEE11containsKeyEPKvi", scope: !830, file: !831, line: 108, type: !888, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!888 = !DISubroutineType(types: !889)
!889 = !{!467, !885, !890, !893}
!890 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !891)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!893 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !481)
!894 = !DISubprogram(name: "removeKey", linkageName: "_ZN11xercesc_2_719RefHash2KeysTableOfINS_10ValueStoreEE9removeKeyEPKvi", scope: !830, file: !831, line: 109, type: !895, scopeLine: 109, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!895 = !DISubroutineType(types: !896)
!896 = !{null, !872, !890, !893}
!897 = !DISubprogram(name: "removeKey", linkageName: "_ZN11xercesc_2_719RefHash2KeysTableOfINS_10ValueStoreEE9removeKeyEPKv", scope: !830, file: !831, line: 110, type: !898, scopeLine: 110, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!898 = !DISubroutineType(types: !899)
!899 = !{null, !872, !890}
!900 = !DISubprogram(name: "removeAll", linkageName: "_ZN11xercesc_2_719RefHash2KeysTableOfINS_10ValueStoreEE9removeAllEv", scope: !830, file: !831, line: 111, type: !880, scopeLine: 111, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!901 = !DISubprogram(name: "transferElement", linkageName: "_ZN11xercesc_2_719RefHash2KeysTableOfINS_10ValueStoreEE15transferElementEPKvPv", scope: !830, file: !831, line: 112, type: !902, scopeLine: 112, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!902 = !DISubroutineType(types: !903)
!903 = !{null, !872, !890, !439}
!904 = !DISubprogram(name: "get", linkageName: "_ZN11xercesc_2_719RefHash2KeysTableOfINS_10ValueStoreEE3getEPKvi", scope: !830, file: !831, line: 117, type: !905, scopeLine: 117, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!905 = !DISubroutineType(types: !906)
!906 = !{!474, !872, !890, !893}
!907 = !DISubprogram(name: "get", linkageName: "_ZNK11xercesc_2_719RefHash2KeysTableOfINS_10ValueStoreEE3getEPKvi", scope: !830, file: !831, line: 118, type: !908, scopeLine: 118, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!908 = !DISubroutineType(types: !909)
!909 = !{!714, !885, !890, !893}
!910 = !DISubprogram(name: "getMemoryManager", linkageName: "_ZNK11xercesc_2_719RefHash2KeysTableOfINS_10ValueStoreEE16getMemoryManagerEv", scope: !830, file: !831, line: 120, type: !911, scopeLine: 120, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!911 = !DISubroutineType(types: !912)
!912 = !{!446, !885}
!913 = !DISubprogram(name: "getHashModulus", linkageName: "_ZNK11xercesc_2_719RefHash2KeysTableOfINS_10ValueStoreEE14getHashModulusEv", scope: !830, file: !831, line: 121, type: !914, scopeLine: 121, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!914 = !DISubroutineType(types: !915)
!915 = !{!12, !885}
!916 = !DISubprogram(name: "put", linkageName: "_ZN11xercesc_2_719RefHash2KeysTableOfINS_10ValueStoreEE3putEPviPS1_", scope: !830, file: !831, line: 126, type: !917, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!917 = !DISubroutineType(types: !918)
!918 = !{null, !872, !439, !481, !769}
!919 = !DISubprogram(name: "RefHash2KeysTableOf", scope: !830, file: !831, line: 139, type: !920, scopeLine: 139, flags: DIFlagPrototyped, spFlags: 0)
!920 = !DISubroutineType(types: !921)
!921 = !{null, !872, !922}
!922 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !886, size: 64)
!923 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_719RefHash2KeysTableOfINS_10ValueStoreEEaSERKS2_", scope: !830, file: !831, line: 140, type: !924, scopeLine: 140, flags: DIFlagPrototyped, spFlags: 0)
!924 = !DISubroutineType(types: !925)
!925 = !{!926, !872, !922}
!926 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !830, size: 64)
!927 = !DISubprogram(name: "findBucketElem", linkageName: "_ZN11xercesc_2_719RefHash2KeysTableOfINS_10ValueStoreEE14findBucketElemEPKviRj", scope: !830, file: !831, line: 145, type: !928, scopeLine: 145, flags: DIFlagPrototyped, spFlags: 0)
!928 = !DISubroutineType(types: !929)
!929 = !{!838, !872, !890, !893, !930}
!930 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !12, size: 64)
!931 = !DISubprogram(name: "findBucketElem", linkageName: "_ZNK11xercesc_2_719RefHash2KeysTableOfINS_10ValueStoreEE14findBucketElemEPKviRj", scope: !830, file: !831, line: 146, type: !932, scopeLine: 146, flags: DIFlagPrototyped, spFlags: 0)
!932 = !DISubroutineType(types: !933)
!933 = !{!934, !885, !890, !893, !930}
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!935 = !DISubprogram(name: "initialize", linkageName: "_ZN11xercesc_2_719RefHash2KeysTableOfINS_10ValueStoreEE10initializeEj", scope: !830, file: !831, line: 147, type: !936, scopeLine: 147, flags: DIFlagPrototyped, spFlags: 0)
!936 = !DISubroutineType(types: !937)
!937 = !{null, !872, !508}
!938 = !DISubprogram(name: "rehash", linkageName: "_ZN11xercesc_2_719RefHash2KeysTableOfINS_10ValueStoreEE6rehashEv", scope: !830, file: !831, line: 148, type: !880, scopeLine: 148, flags: DIFlagPrototyped, spFlags: 0)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "fGlobalMapStack", scope: !736, file: !694, line: 125, baseType: !940, size: 64, offset: 192)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "RefStackOf<xercesc_2_7::RefHashTableOf<xercesc_2_7::ValueStore> >", scope: !6, file: !942, line: 36, size: 384, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !943, templateParams: !1010, identifier: "_ZTSN11xercesc_2_710RefStackOfINS_14RefHashTableOfINS_10ValueStoreEEEEE")
!942 = !DIFile(filename: "./xercesc/util/RefStackOf.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!943 = !{!944, !945, !1028, !1032, !1035, !1040, !1043, !1046, !1049, !1050, !1053, !1056, !1057, !1061}
!944 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !941, baseType: !433, flags: DIFlagPublic, extraData: i32 0)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "fVector", scope: !941, file: !942, line: 85, baseType: !946, size: 320, offset: 64)
!946 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "RefVectorOf<xercesc_2_7::RefHashTableOf<xercesc_2_7::ValueStore> >", scope: !6, file: !689, line: 32, size: 320, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !947, vtableHolder: !949, templateParams: !1010, identifier: "_ZTSN11xercesc_2_711RefVectorOfINS_14RefHashTableOfINS_10ValueStoreEEEEE")
!947 = !{!948, !1012, !1016, !1019, !1024}
!948 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !946, baseType: !949, flags: DIFlagPublic, extraData: i32 0)
!949 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "BaseRefVectorOf<xercesc_2_7::RefHashTableOf<xercesc_2_7::ValueStore> >", scope: !6, file: !745, line: 33, size: 320, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !950, vtableHolder: !949, templateParams: !1010, identifier: "_ZTSN11xercesc_2_715BaseRefVectorOfINS_14RefHashTableOfINS_10ValueStoreEEEEE")
!950 = !{!951, !748, !952, !953, !954, !955, !956, !957, !961, !964, !968, !971, !972, !975, !976, !979, !980, !986, !987, !988, !993, !996, !997, !998, !1001, !1002, !1006}
!951 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !949, baseType: !433, flags: DIFlagPublic, extraData: i32 0)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "fAdoptedElems", scope: !949, file: !745, line: 89, baseType: !467, size: 8, offset: 64, flags: DIFlagProtected)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "fCurCount", scope: !949, file: !745, line: 90, baseType: !12, size: 32, offset: 96, flags: DIFlagProtected)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "fMaxCount", scope: !949, file: !745, line: 91, baseType: !12, size: 32, offset: 128, flags: DIFlagProtected)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "fElemList", scope: !949, file: !745, line: 92, baseType: !427, size: 64, offset: 192, flags: DIFlagProtected)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "fMemoryManager", scope: !949, file: !745, line: 93, baseType: !446, size: 64, offset: 256, flags: DIFlagProtected)
!957 = !DISubprogram(name: "BaseRefVectorOf", scope: !949, file: !745, line: 39, type: !958, scopeLine: 39, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!958 = !DISubroutineType(types: !959)
!959 = !{null, !960, !508, !510, !509}
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!961 = !DISubprogram(name: "~BaseRefVectorOf", scope: !949, file: !745, line: 45, type: !962, scopeLine: 45, containingType: !949, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!962 = !DISubroutineType(types: !963)
!963 = !{null, !960}
!964 = !DISubprogram(name: "addElement", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfINS_14RefHashTableOfINS_10ValueStoreEEEE10addElementEPS3_", scope: !949, file: !745, line: 51, type: !965, scopeLine: 51, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!965 = !DISubroutineType(types: !966)
!966 = !{null, !960, !967}
!967 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !428)
!968 = !DISubprogram(name: "setElementAt", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfINS_14RefHashTableOfINS_10ValueStoreEEEE12setElementAtEPS3_j", scope: !949, file: !745, line: 52, type: !969, scopeLine: 52, containingType: !949, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!969 = !DISubroutineType(types: !970)
!970 = !{null, !960, !967, !508}
!971 = !DISubprogram(name: "insertElementAt", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfINS_14RefHashTableOfINS_10ValueStoreEEEE15insertElementAtEPS3_j", scope: !949, file: !745, line: 53, type: !969, scopeLine: 53, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!972 = !DISubprogram(name: "orphanElementAt", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfINS_14RefHashTableOfINS_10ValueStoreEEEE15orphanElementAtEj", scope: !949, file: !745, line: 54, type: !973, scopeLine: 54, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!973 = !DISubroutineType(types: !974)
!974 = !{!428, !960, !508}
!975 = !DISubprogram(name: "removeAllElements", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfINS_14RefHashTableOfINS_10ValueStoreEEEE17removeAllElementsEv", scope: !949, file: !745, line: 55, type: !962, scopeLine: 55, containingType: !949, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!976 = !DISubprogram(name: "removeElementAt", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfINS_14RefHashTableOfINS_10ValueStoreEEEE15removeElementAtEj", scope: !949, file: !745, line: 56, type: !977, scopeLine: 56, containingType: !949, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!977 = !DISubroutineType(types: !978)
!978 = !{null, !960, !508}
!979 = !DISubprogram(name: "removeLastElement", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfINS_14RefHashTableOfINS_10ValueStoreEEEE17removeLastElementEv", scope: !949, file: !745, line: 57, type: !962, scopeLine: 57, containingType: !949, virtualIndex: 5, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!980 = !DISubprogram(name: "containsElement", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfINS_14RefHashTableOfINS_10ValueStoreEEEE15containsElementEPKS3_", scope: !949, file: !745, line: 58, type: !981, scopeLine: 58, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!981 = !DISubroutineType(types: !982)
!982 = !{!467, !960, !983}
!983 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !984)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !429)
!986 = !DISubprogram(name: "cleanup", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfINS_14RefHashTableOfINS_10ValueStoreEEEE7cleanupEv", scope: !949, file: !745, line: 59, type: !962, scopeLine: 59, containingType: !949, virtualIndex: 6, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!987 = !DISubprogram(name: "reinitialize", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfINS_14RefHashTableOfINS_10ValueStoreEEEE12reinitializeEv", scope: !949, file: !745, line: 60, type: !962, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!988 = !DISubprogram(name: "curCapacity", linkageName: "_ZNK11xercesc_2_715BaseRefVectorOfINS_14RefHashTableOfINS_10ValueStoreEEEE11curCapacityEv", scope: !949, file: !745, line: 66, type: !989, scopeLine: 66, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!989 = !DISubroutineType(types: !990)
!990 = !{!12, !991}
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!992 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !949)
!993 = !DISubprogram(name: "elementAt", linkageName: "_ZNK11xercesc_2_715BaseRefVectorOfINS_14RefHashTableOfINS_10ValueStoreEEEE9elementAtEj", scope: !949, file: !745, line: 67, type: !994, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!994 = !DISubroutineType(types: !995)
!995 = !{!984, !991, !508}
!996 = !DISubprogram(name: "elementAt", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfINS_14RefHashTableOfINS_10ValueStoreEEEE9elementAtEj", scope: !949, file: !745, line: 68, type: !973, scopeLine: 68, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!997 = !DISubprogram(name: "size", linkageName: "_ZNK11xercesc_2_715BaseRefVectorOfINS_14RefHashTableOfINS_10ValueStoreEEEE4sizeEv", scope: !949, file: !745, line: 69, type: !989, scopeLine: 69, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!998 = !DISubprogram(name: "getMemoryManager", linkageName: "_ZNK11xercesc_2_715BaseRefVectorOfINS_14RefHashTableOfINS_10ValueStoreEEEE16getMemoryManagerEv", scope: !949, file: !745, line: 70, type: !999, scopeLine: 70, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!446, !991}
!1001 = !DISubprogram(name: "ensureExtraCapacity", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfINS_14RefHashTableOfINS_10ValueStoreEEEE19ensureExtraCapacityEj", scope: !949, file: !745, line: 76, type: !977, scopeLine: 76, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1002 = !DISubprogram(name: "BaseRefVectorOf", scope: !949, file: !745, line: 82, type: !1003, scopeLine: 82, flags: DIFlagPrototyped, spFlags: 0)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{null, !960, !1005}
!1005 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !992, size: 64)
!1006 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfINS_14RefHashTableOfINS_10ValueStoreEEEEaSERKS4_", scope: !949, file: !745, line: 83, type: !1007, scopeLine: 83, flags: DIFlagPrototyped, spFlags: 0)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{!1009, !960, !1005}
!1009 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !949, size: 64)
!1010 = !{!1011}
!1011 = !DITemplateTypeParameter(name: "TElem", type: !429)
!1012 = !DISubprogram(name: "RefVectorOf", scope: !946, file: !689, line: 38, type: !1013, scopeLine: 38, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{null, !1015, !508, !510, !509}
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!1016 = !DISubprogram(name: "~RefVectorOf", scope: !946, file: !689, line: 45, type: !1017, scopeLine: 45, containingType: !946, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{null, !1015}
!1019 = !DISubprogram(name: "RefVectorOf", scope: !946, file: !689, line: 51, type: !1020, scopeLine: 51, flags: DIFlagPrototyped, spFlags: 0)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{null, !1015, !1022}
!1022 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1023, size: 64)
!1023 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !946)
!1024 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_711RefVectorOfINS_14RefHashTableOfINS_10ValueStoreEEEEaSERKS4_", scope: !946, file: !689, line: 52, type: !1025, scopeLine: 52, flags: DIFlagPrototyped, spFlags: 0)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!1027, !1015, !1022}
!1027 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !946, size: 64)
!1028 = !DISubprogram(name: "RefStackOf", scope: !941, file: !942, line: 42, type: !1029, scopeLine: 42, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{null, !1031, !508, !510, !509}
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!1032 = !DISubprogram(name: "~RefStackOf", scope: !941, file: !942, line: 45, type: !1033, scopeLine: 45, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{null, !1031}
!1035 = !DISubprogram(name: "elementAt", linkageName: "_ZNK11xercesc_2_710RefStackOfINS_14RefHashTableOfINS_10ValueStoreEEEE9elementAtEj", scope: !941, file: !942, line: 51, type: !1036, scopeLine: 51, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!984, !1038, !508}
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!1039 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !941)
!1040 = !DISubprogram(name: "push", linkageName: "_ZN11xercesc_2_710RefStackOfINS_14RefHashTableOfINS_10ValueStoreEEEE4pushEPS3_", scope: !941, file: !942, line: 52, type: !1041, scopeLine: 52, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{null, !1031, !967}
!1043 = !DISubprogram(name: "peek", linkageName: "_ZNK11xercesc_2_710RefStackOfINS_14RefHashTableOfINS_10ValueStoreEEEE4peekEv", scope: !941, file: !942, line: 53, type: !1044, scopeLine: 53, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!984, !1038}
!1046 = !DISubprogram(name: "pop", linkageName: "_ZN11xercesc_2_710RefStackOfINS_14RefHashTableOfINS_10ValueStoreEEEE3popEv", scope: !941, file: !942, line: 54, type: !1047, scopeLine: 54, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!428, !1031}
!1049 = !DISubprogram(name: "removeAllElements", linkageName: "_ZN11xercesc_2_710RefStackOfINS_14RefHashTableOfINS_10ValueStoreEEEE17removeAllElementsEv", scope: !941, file: !942, line: 55, type: !1033, scopeLine: 55, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1050 = !DISubprogram(name: "empty", linkageName: "_ZN11xercesc_2_710RefStackOfINS_14RefHashTableOfINS_10ValueStoreEEEE5emptyEv", scope: !941, file: !942, line: 61, type: !1051, scopeLine: 61, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!467, !1031}
!1053 = !DISubprogram(name: "curCapacity", linkageName: "_ZN11xercesc_2_710RefStackOfINS_14RefHashTableOfINS_10ValueStoreEEEE11curCapacityEv", scope: !941, file: !942, line: 62, type: !1054, scopeLine: 62, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{!12, !1031}
!1056 = !DISubprogram(name: "size", linkageName: "_ZN11xercesc_2_710RefStackOfINS_14RefHashTableOfINS_10ValueStoreEEEE4sizeEv", scope: !941, file: !942, line: 63, type: !1054, scopeLine: 63, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1057 = !DISubprogram(name: "RefStackOf", scope: !941, file: !942, line: 75, type: !1058, scopeLine: 75, flags: DIFlagPrototyped, spFlags: 0)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{null, !1031, !1060}
!1060 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1039, size: 64)
!1061 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_710RefStackOfINS_14RefHashTableOfINS_10ValueStoreEEEEaSERKS4_", scope: !941, file: !942, line: 76, type: !1062, scopeLine: 76, flags: DIFlagPrototyped, spFlags: 0)
!1062 = !DISubroutineType(types: !1063)
!1063 = !{!1064, !1031, !1060}
!1064 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !941, size: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "fScanner", scope: !736, file: !694, line: 126, baseType: !692, size: 64, offset: 256)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "fMemoryManager", scope: !736, file: !694, line: 127, baseType: !446, size: 64, offset: 320)
!1067 = !DISubprogram(name: "ValueStoreCache", scope: !736, file: !694, line: 68, type: !1068, scopeLine: 68, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{null, !1070, !509}
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!1071 = !DISubprogram(name: "~ValueStoreCache", scope: !736, file: !694, line: 69, type: !1072, scopeLine: 69, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{null, !1070}
!1074 = !DISubprogram(name: "setScanner", linkageName: "_ZN11xercesc_2_715ValueStoreCache10setScannerEPNS_10XMLScannerE", scope: !736, file: !694, line: 74, type: !1075, scopeLine: 74, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1075 = !DISubroutineType(types: !1076)
!1076 = !{null, !1070, !701}
!1077 = !DISubprogram(name: "startDocument", linkageName: "_ZN11xercesc_2_715ValueStoreCache13startDocumentEv", scope: !736, file: !694, line: 79, type: !1072, scopeLine: 79, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1078 = !DISubprogram(name: "startElement", linkageName: "_ZN11xercesc_2_715ValueStoreCache12startElementEv", scope: !736, file: !694, line: 80, type: !1072, scopeLine: 80, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1079 = !DISubprogram(name: "endElement", linkageName: "_ZN11xercesc_2_715ValueStoreCache10endElementEv", scope: !736, file: !694, line: 81, type: !1072, scopeLine: 81, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1080 = !DISubprogram(name: "endDocument", linkageName: "_ZN11xercesc_2_715ValueStoreCache11endDocumentEv", scope: !736, file: !694, line: 82, type: !1072, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1081 = !DISubprogram(name: "initValueStoresFor", linkageName: "_ZN11xercesc_2_715ValueStoreCache18initValueStoresForEPNS_17SchemaElementDeclEi", scope: !736, file: !694, line: 87, type: !1082, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1082 = !DISubroutineType(types: !1083)
!1083 = !{null, !1070, !1084, !893}
!1084 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1085)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64)
!1086 = !DICompositeType(tag: DW_TAG_class_type, name: "SchemaElementDecl", scope: !6, file: !1087, line: 42, flags: DIFlagFwdDecl)
!1087 = !DIFile(filename: "./xercesc/validators/schema/SchemaElementDecl.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!1088 = !DISubprogram(name: "getValueStoreFor", linkageName: "_ZN11xercesc_2_715ValueStoreCache16getValueStoreForEPKNS_8IC_FieldEi", scope: !736, file: !694, line: 93, type: !1089, scopeLine: 93, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1089 = !DISubroutineType(types: !1090)
!1090 = !{!474, !1070, !653, !893}
!1091 = !DISubprogram(name: "getValueStoreFor", linkageName: "_ZN11xercesc_2_715ValueStoreCache16getValueStoreForEPKNS_18IdentityConstraintEi", scope: !736, file: !694, line: 94, type: !1092, scopeLine: 94, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!474, !1070, !1094, !893}
!1094 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1095)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64)
!1096 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !420)
!1097 = !DISubprogram(name: "getGlobalValueStoreFor", linkageName: "_ZN11xercesc_2_715ValueStoreCache22getGlobalValueStoreForEPKNS_18IdentityConstraintE", scope: !736, file: !694, line: 95, type: !1098, scopeLine: 95, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1098 = !DISubroutineType(types: !1099)
!1099 = !{!474, !1070, !1094}
!1100 = !DISubprogram(name: "transplant", linkageName: "_ZN11xercesc_2_715ValueStoreCache10transplantEPNS_18IdentityConstraintEi", scope: !736, file: !694, line: 104, type: !1101, scopeLine: 104, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1101 = !DISubroutineType(types: !1102)
!1102 = !{null, !1070, !700, !893}
!1103 = !DISubprogram(name: "ValueStoreCache", scope: !736, file: !694, line: 110, type: !1104, scopeLine: 110, flags: DIFlagPrototyped, spFlags: 0)
!1104 = !DISubroutineType(types: !1105)
!1105 = !{null, !1070, !1106}
!1106 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1107, size: 64)
!1107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !736)
!1108 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_715ValueStoreCacheaSERKS0_", scope: !736, file: !694, line: 111, type: !1109, scopeLine: 111, flags: DIFlagPrototyped, spFlags: 0)
!1109 = !DISubroutineType(types: !1110)
!1110 = !{!1111, !1070, !1106}
!1111 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !736, size: 64)
!1112 = !DISubprogram(name: "init", linkageName: "_ZN11xercesc_2_715ValueStoreCache4initEv", scope: !736, file: !694, line: 116, type: !1072, scopeLine: 116, flags: DIFlagPrototyped, spFlags: 0)
!1113 = !DISubprogram(name: "cleanUp", linkageName: "_ZN11xercesc_2_715ValueStoreCache7cleanUpEv", scope: !736, file: !694, line: 117, type: !1072, scopeLine: 117, flags: DIFlagPrototyped, spFlags: 0)
!1114 = !DISubprogram(name: "duplicateValue", linkageName: "_ZN11xercesc_2_710ValueStore14duplicateValueEv", scope: !475, file: !476, line: 90, type: !703, scopeLine: 90, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1115 = !DISubprogram(name: "reportNilError", linkageName: "_ZN11xercesc_2_710ValueStore14reportNilErrorEPNS_18IdentityConstraintE", scope: !475, file: !476, line: 91, type: !1116, scopeLine: 91, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{null, !699, !700}
!1118 = !DISubprogram(name: "ValueStore", scope: !475, file: !476, line: 97, type: !1119, scopeLine: 97, flags: DIFlagPrototyped, spFlags: 0)
!1119 = !DISubroutineType(types: !1120)
!1120 = !{null, !699, !1121}
!1121 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !709, size: 64)
!1122 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_710ValueStoreaSERKS0_", scope: !475, file: !476, line: 98, type: !1123, scopeLine: 98, flags: DIFlagPrototyped, spFlags: 0)
!1123 = !DISubroutineType(types: !1124)
!1124 = !{!1125, !699, !1121}
!1125 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !475, size: 64)
!1126 = !DISubprogram(name: "isDuplicateOf", linkageName: "_ZN11xercesc_2_710ValueStore13isDuplicateOfEPNS_17DatatypeValidatorEPKtS2_S4_", scope: !475, file: !476, line: 111, type: !1127, scopeLine: 111, flags: DIFlagPrototyped, spFlags: 0)
!1127 = !DISubroutineType(types: !1128)
!1128 = !{!467, !699, !595, !672, !595, !672}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "fNext", scope: !471, file: !430, line: 60, baseType: !470, size: 64, offset: 64)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "fKey", scope: !471, file: !430, line: 61, baseType: !439, size: 64, offset: 128)
!1131 = !DISubprogram(name: "RefHashTableBucketElem", scope: !471, file: !430, line: 51, type: !1132, scopeLine: 51, flags: DIFlagPrototyped, spFlags: 0)
!1132 = !DISubroutineType(types: !1133)
!1133 = !{null, !1134, !439, !769, !470}
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!1135 = !DISubprogram(name: "RefHashTableBucketElem", scope: !471, file: !430, line: 56, type: !1136, scopeLine: 56, flags: DIFlagPrototyped, spFlags: 0)
!1136 = !DISubroutineType(types: !1137)
!1137 = !{null, !1134}
!1138 = !DISubprogram(name: "~RefHashTableBucketElem", scope: !471, file: !430, line: 57, type: !1136, scopeLine: 57, flags: DIFlagPrototyped, spFlags: 0)
!1139 = !DISubprogram(name: "RefHashTableBucketElem", scope: !471, file: !430, line: 67, type: !1140, scopeLine: 67, flags: DIFlagPrivate | DIFlagPrototyped, spFlags: 0)
!1140 = !DISubroutineType(types: !1141)
!1141 = !{null, !1134, !1142}
!1142 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1143, size: 64)
!1143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !471)
!1144 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_722RefHashTableBucketElemINS_10ValueStoreEEaSERKS2_", scope: !471, file: !430, line: 68, type: !1145, scopeLine: 68, flags: DIFlagPrivate | DIFlagPrototyped, spFlags: 0)
!1145 = !DISubroutineType(types: !1146)
!1146 = !{!1147, !1134, !1142}
!1147 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !471, size: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "fHashModulus", scope: !429, file: !430, line: 181, baseType: !12, size: 32, offset: 192)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "fInitialModulus", scope: !429, file: !430, line: 182, baseType: !12, size: 32, offset: 224)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "fCount", scope: !429, file: !430, line: 183, baseType: !12, size: 32, offset: 256)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "fHash", scope: !429, file: !430, line: 184, baseType: !866, size: 64, offset: 320)
!1152 = !DISubprogram(name: "RefHashTableOf", scope: !429, file: !430, line: 79, type: !1153, scopeLine: 79, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1153 = !DISubroutineType(types: !1154)
!1154 = !{null, !1155, !508, !509}
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!1156 = !DISubprogram(name: "RefHashTableOf", scope: !429, file: !430, line: 85, type: !1157, scopeLine: 85, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1157 = !DISubroutineType(types: !1158)
!1158 = !{null, !1155, !508, !510, !509}
!1159 = !DISubprogram(name: "RefHashTableOf", scope: !429, file: !430, line: 94, type: !1160, scopeLine: 94, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1160 = !DISubroutineType(types: !1161)
!1161 = !{null, !1155, !508, !510, !866, !509}
!1162 = !DISubprogram(name: "~RefHashTableOf", scope: !429, file: !430, line: 101, type: !1163, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1163 = !DISubroutineType(types: !1164)
!1164 = !{null, !1155}
!1165 = !DISubprogram(name: "isEmpty", linkageName: "_ZNK11xercesc_2_714RefHashTableOfINS_10ValueStoreEE7isEmptyEv", scope: !429, file: !430, line: 107, type: !1166, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1166 = !DISubroutineType(types: !1167)
!1167 = !{!467, !1168}
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!1169 = !DISubprogram(name: "containsKey", linkageName: "_ZNK11xercesc_2_714RefHashTableOfINS_10ValueStoreEE11containsKeyEPKv", scope: !429, file: !430, line: 108, type: !1170, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1170 = !DISubroutineType(types: !1171)
!1171 = !{!467, !1168, !890}
!1172 = !DISubprogram(name: "removeKey", linkageName: "_ZN11xercesc_2_714RefHashTableOfINS_10ValueStoreEE9removeKeyEPKv", scope: !429, file: !430, line: 109, type: !1173, scopeLine: 109, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1173 = !DISubroutineType(types: !1174)
!1174 = !{null, !1155, !890}
!1175 = !DISubprogram(name: "removeAll", linkageName: "_ZN11xercesc_2_714RefHashTableOfINS_10ValueStoreEE9removeAllEv", scope: !429, file: !430, line: 110, type: !1163, scopeLine: 110, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1176 = !DISubprogram(name: "cleanup", linkageName: "_ZN11xercesc_2_714RefHashTableOfINS_10ValueStoreEE7cleanupEv", scope: !429, file: !430, line: 111, type: !1163, scopeLine: 111, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1177 = !DISubprogram(name: "reinitialize", linkageName: "_ZN11xercesc_2_714RefHashTableOfINS_10ValueStoreEE12reinitializeEPNS_8HashBaseE", scope: !429, file: !430, line: 112, type: !1178, scopeLine: 112, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1178 = !DISubroutineType(types: !1179)
!1179 = !{null, !1155, !866}
!1180 = !DISubprogram(name: "transferElement", linkageName: "_ZN11xercesc_2_714RefHashTableOfINS_10ValueStoreEE15transferElementEPKvPv", scope: !429, file: !430, line: 113, type: !1181, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1181 = !DISubroutineType(types: !1182)
!1182 = !{null, !1155, !890, !439}
!1183 = !DISubprogram(name: "orphanKey", linkageName: "_ZN11xercesc_2_714RefHashTableOfINS_10ValueStoreEE9orphanKeyEPKv", scope: !429, file: !430, line: 114, type: !1184, scopeLine: 114, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1184 = !DISubroutineType(types: !1185)
!1185 = !{!474, !1155, !890}
!1186 = !DISubprogram(name: "get", linkageName: "_ZN11xercesc_2_714RefHashTableOfINS_10ValueStoreEE3getEPKv", scope: !429, file: !430, line: 119, type: !1184, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1187 = !DISubprogram(name: "get", linkageName: "_ZNK11xercesc_2_714RefHashTableOfINS_10ValueStoreEE3getEPKv", scope: !429, file: !430, line: 120, type: !1188, scopeLine: 120, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1188 = !DISubroutineType(types: !1189)
!1189 = !{!714, !1168, !890}
!1190 = !DISubprogram(name: "getMemoryManager", linkageName: "_ZNK11xercesc_2_714RefHashTableOfINS_10ValueStoreEE16getMemoryManagerEv", scope: !429, file: !430, line: 121, type: !1191, scopeLine: 121, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1191 = !DISubroutineType(types: !1192)
!1192 = !{!446, !1168}
!1193 = !DISubprogram(name: "getHashModulus", linkageName: "_ZNK11xercesc_2_714RefHashTableOfINS_10ValueStoreEE14getHashModulusEv", scope: !429, file: !430, line: 122, type: !1194, scopeLine: 122, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1194 = !DISubroutineType(types: !1195)
!1195 = !{!12, !1168}
!1196 = !DISubprogram(name: "getCount", linkageName: "_ZNK11xercesc_2_714RefHashTableOfINS_10ValueStoreEE8getCountEv", scope: !429, file: !430, line: 123, type: !1194, scopeLine: 123, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1197 = !DISubprogram(name: "setAdoptElements", linkageName: "_ZN11xercesc_2_714RefHashTableOfINS_10ValueStoreEE16setAdoptElementsEb", scope: !429, file: !430, line: 128, type: !1198, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1198 = !DISubroutineType(types: !1199)
!1199 = !{null, !1155, !510}
!1200 = !DISubprogram(name: "put", linkageName: "_ZN11xercesc_2_714RefHashTableOfINS_10ValueStoreEE3putEPvPS1_", scope: !429, file: !430, line: 134, type: !1201, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1201 = !DISubroutineType(types: !1202)
!1202 = !{null, !1155, !439, !769}
!1203 = !DISubprogram(name: "RefHashTableOf", scope: !429, file: !430, line: 147, type: !1204, scopeLine: 147, flags: DIFlagPrototyped, spFlags: 0)
!1204 = !DISubroutineType(types: !1205)
!1205 = !{null, !1155, !1206}
!1206 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !985, size: 64)
!1207 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_714RefHashTableOfINS_10ValueStoreEEaSERKS2_", scope: !429, file: !430, line: 148, type: !1208, scopeLine: 148, flags: DIFlagPrototyped, spFlags: 0)
!1208 = !DISubroutineType(types: !1209)
!1209 = !{!1210, !1155, !1206}
!1210 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !429, size: 64)
!1211 = !DISubprogram(name: "findBucketElem", linkageName: "_ZN11xercesc_2_714RefHashTableOfINS_10ValueStoreEE14findBucketElemEPKvRj", scope: !429, file: !430, line: 153, type: !1212, scopeLine: 153, flags: DIFlagPrototyped, spFlags: 0)
!1212 = !DISubroutineType(types: !1213)
!1213 = !{!470, !1155, !890, !930}
!1214 = !DISubprogram(name: "findBucketElem", linkageName: "_ZNK11xercesc_2_714RefHashTableOfINS_10ValueStoreEE14findBucketElemEPKvRj", scope: !429, file: !430, line: 154, type: !1215, scopeLine: 154, flags: DIFlagPrototyped, spFlags: 0)
!1215 = !DISubroutineType(types: !1216)
!1216 = !{!1217, !1168, !890, !930}
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64)
!1218 = !DISubprogram(name: "initialize", linkageName: "_ZN11xercesc_2_714RefHashTableOfINS_10ValueStoreEE10initializeEj", scope: !429, file: !430, line: 155, type: !1219, scopeLine: 155, flags: DIFlagPrototyped, spFlags: 0)
!1219 = !DISubroutineType(types: !1220)
!1220 = !{null, !1155, !508}
!1221 = !DISubprogram(name: "rehash", linkageName: "_ZN11xercesc_2_714RefHashTableOfINS_10ValueStoreEE6rehashEv", scope: !429, file: !430, line: 156, type: !1163, scopeLine: 156, flags: DIFlagPrototyped, spFlags: 0)
!1222 = !{!1223, !1225, !1232, !1236, !1243, !1247, !1252, !1254, !1262, !1266, !1270, !1278, !1282, !1286, !1290, !1292, !1297, !1301, !1305, !1307, !1311, !1319, !1323, !1327, !1329, !1331, !1335, !1339, !1345, !1349, !1353, !1355, !1363, !1367, !1375, !1377, !1381, !1385, !1389, !1393, !1398, !1403, !1408, !1409, !1410, !1411, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1462, !1466, !1472, !1476, !1480, !1484, !1488, !1490, !1492, !1496, !1500, !1504, !1508, !1512, !1514, !1516, !1518, !1522, !1526, !1530, !1532, !1534, !1536, !1538, !1593}
!1223 = !DIImportedEntity(tag: DW_TAG_imported_declaration, name: "xercesc", scope: !0, entity: !6, file: !1224, line: 433)
!1224 = !DIFile(filename: "./xercesc/util/XercesDefs.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!1225 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1226, entity: !1227, file: !1231, line: 52)
!1226 = !DINamespace(name: "std", scope: null)
!1227 = !DISubprogram(name: "abs", scope: !1228, file: !1228, line: 840, type: !1229, flags: DIFlagPrototyped, spFlags: 0)
!1228 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!1229 = !DISubroutineType(types: !1230)
!1230 = !{!481, !481}
!1231 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/std_abs.h", directory: "")
!1232 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1226, entity: !1233, file: !1235, line: 127)
!1233 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !1228, line: 62, baseType: !1234)
!1234 = !DICompositeType(tag: DW_TAG_structure_type, file: !1228, line: 58, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!1235 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cstdlib", directory: "")
!1236 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1226, entity: !1237, file: !1235, line: 128)
!1237 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !1228, line: 70, baseType: !1238)
!1238 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1228, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !1239, identifier: "_ZTS6ldiv_t")
!1239 = !{!1240, !1242}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !1238, file: !1228, line: 68, baseType: !1241, size: 64)
!1241 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !1238, file: !1228, line: 69, baseType: !1241, size: 64, offset: 64)
!1243 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1226, entity: !1244, file: !1235, line: 130)
!1244 = !DISubprogram(name: "abort", scope: !1228, file: !1228, line: 591, type: !1245, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!1245 = !DISubroutineType(types: !1246)
!1246 = !{null}
!1247 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1226, entity: !1248, file: !1235, line: 134)
!1248 = !DISubprogram(name: "atexit", scope: !1228, file: !1228, line: 595, type: !1249, flags: DIFlagPrototyped, spFlags: 0)
!1249 = !DISubroutineType(types: !1250)
!1250 = !{!481, !1251}
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64)
!1252 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1226, entity: !1253, file: !1235, line: 137)
!1253 = !DISubprogram(name: "at_quick_exit", scope: !1228, file: !1228, line: 600, type: !1249, flags: DIFlagPrototyped, spFlags: 0)
!1254 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1226, entity: !1255, file: !1235, line: 140)
!1255 = !DISubprogram(name: "atof", scope: !1228, file: !1228, line: 101, type: !1256, flags: DIFlagPrototyped, spFlags: 0)
!1256 = !DISubroutineType(types: !1257)
!1257 = !{!1258, !1259}
!1258 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64)
!1260 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1261)
!1261 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!1262 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1226, entity: !1263, file: !1235, line: 141)
!1263 = !DISubprogram(name: "atoi", scope: !1228, file: !1228, line: 104, type: !1264, flags: DIFlagPrototyped, spFlags: 0)
!1264 = !DISubroutineType(types: !1265)
!1265 = !{!481, !1259}
!1266 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1226, entity: !1267, file: !1235, line: 142)
!1267 = !DISubprogram(name: "atol", scope: !1228, file: !1228, line: 107, type: !1268, flags: DIFlagPrototyped, spFlags: 0)
!1268 = !DISubroutineType(types: !1269)
!1269 = !{!1241, !1259}
!1270 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1226, entity: !1271, file: !1235, line: 143)
!1271 = !DISubprogram(name: "bsearch", scope: !1228, file: !1228, line: 820, type: !1272, flags: DIFlagPrototyped, spFlags: 0)
!1272 = !DISubroutineType(types: !1273)
!1273 = !{!439, !891, !891, !440, !440, !1274}
!1274 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !1228, line: 808, baseType: !1275)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64)
!1276 = !DISubroutineType(types: !1277)
!1277 = !{!481, !891, !891}
!1278 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1226, entity: !1279, file: !1235, line: 144)
!1279 = !DISubprogram(name: "calloc", scope: !1228, file: !1228, line: 542, type: !1280, flags: DIFlagPrototyped, spFlags: 0)
!1280 = !DISubroutineType(types: !1281)
!1281 = !{!439, !440, !440}
!1282 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1226, entity: !1283, file: !1235, line: 145)
!1283 = !DISubprogram(name: "div", scope: !1228, file: !1228, line: 852, type: !1284, flags: DIFlagPrototyped, spFlags: 0)
!1284 = !DISubroutineType(types: !1285)
!1285 = !{!1233, !481, !481}
!1286 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1226, entity: !1287, file: !1235, line: 146)
!1287 = !DISubprogram(name: "exit", scope: !1228, file: !1228, line: 617, type: !1288, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!1288 = !DISubroutineType(types: !1289)
!1289 = !{null, !481}
!1290 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1226, entity: !1291, file: !1235, line: 147)
!1291 = !DISubprogram(name: "free", scope: !1228, file: !1228, line: 565, type: !453, flags: DIFlagPrototyped, spFlags: 0)
!1292 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1226, entity: !1293, file: !1235, line: 148)
!1293 = !DISubprogram(name: "getenv", scope: !1228, file: !1228, line: 634, type: !1294, flags: DIFlagPrototyped, spFlags: 0)
!1294 = !DISubroutineType(types: !1295)
!1295 = !{!1296, !1259}
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64)
!1297 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1226, entity: !1298, file: !1235, line: 149)
!1298 = !DISubprogram(name: "labs", scope: !1228, file: !1228, line: 841, type: !1299, flags: DIFlagPrototyped, spFlags: 0)
!1299 = !DISubroutineType(types: !1300)
!1300 = !{!1241, !1241}
!1301 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1226, entity: !1302, file: !1235, line: 150)
!1302 = !DISubprogram(name: "ldiv", scope: !1228, file: !1228, line: 854, type: !1303, flags: DIFlagPrototyped, spFlags: 0)
!1303 = !DISubroutineType(types: !1304)
!1304 = !{!1237, !1241, !1241}
!1305 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1226, entity: !1306, file: !1235, line: 151)
!1306 = !DISubprogram(name: "malloc", scope: !1228, file: !1228, line: 539, type: !437, flags: DIFlagPrototyped, spFlags: 0)
!1307 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1226, entity: !1308, file: !1235, line: 153)
!1308 = !DISubprogram(name: "mblen", scope: !1228, file: !1228, line: 922, type: !1309, flags: DIFlagPrototyped, spFlags: 0)
!1309 = !DISubroutineType(types: !1310)
!1310 = !{!481, !1259, !440}
!1311 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1226, entity: !1312, file: !1235, line: 154)
!1312 = !DISubprogram(name: "mbstowcs", scope: !1228, file: !1228, line: 933, type: !1313, flags: DIFlagPrototyped, spFlags: 0)
!1313 = !DISubroutineType(types: !1314)
!1314 = !{!440, !1315, !1318, !440}
!1315 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1316)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64)
!1317 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
