; ModuleID = 'XSWildcard.cpp'
source_filename = "XSWildcard.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"class.xercesc_2_7::XSWildcard" = type { %"class.xercesc_2_7::XSObject.base", i32, i32, %"class.xercesc_2_7::RefArrayVectorOf"*, %"class.xercesc_2_7::XSAnnotation"* }
%"class.xercesc_2_7::XSObject.base" = type <{ i32 (...)**, i32, [4 x i8], %"class.xercesc_2_7::XSModel"*, %"class.xercesc_2_7::MemoryManager"*, i32 }>
%"class.xercesc_2_7::RefArrayVectorOf" = type { %"class.xercesc_2_7::BaseRefVectorOf" }
%"class.xercesc_2_7::BaseRefVectorOf" = type { i32 (...)**, i8, i32, i32, i16**, %"class.xercesc_2_7::MemoryManager"* }
%"class.xercesc_2_7::SchemaAttDef" = type { %"class.xercesc_2_7::XMLAttDef", i32, i32, i32, i32, %"class.xercesc_2_7::QName"*, %"class.xercesc_2_7::DatatypeValidator"*, %"class.xercesc_2_7::DatatypeValidator"*, %"class.xercesc_2_7::DatatypeValidator"*, %"class.xercesc_2_7::ValueVectorOf"*, %"class.xercesc_2_7::SchemaAttDef"* }
%"class.xercesc_2_7::XMLAttDef" = type { %"class.xercesc_2_7::XSerializable", i32, i32, i32, i8, i8, i32, i16*, i16*, %"class.xercesc_2_7::MemoryManager"* }
%"class.xercesc_2_7::XSerializable" = type { i32 (...)** }
%"class.xercesc_2_7::QName" = type { %"class.xercesc_2_7::XSerializable", i32, i32, i32, i32, i16*, i16*, i16*, %"class.xercesc_2_7::MemoryManager"* }

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !1339, imports: !1340, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "XSWildcard.cpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !28, !37, !1302, !1324, !377, !846}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "COMPONENT_TYPE", scope: !5, file: !4, line: 60, baseType: !12, size: 32, elements: !13, identifier: "_ZTSN11xercesc_2_711XSConstants14COMPONENT_TYPEE")
!4 = !DIFile(filename: "./xercesc/framework/psvi/XSConstants.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!5 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "XSConstants", scope: !6, file: !4, line: 55, size: 8, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !7, identifier: "_ZTSN11xercesc_2_711XSConstantsE")
!6 = !DINamespace(name: "xercesc_2_7", scope: null)
!7 = !{!8}
!8 = !DISubprogram(name: "XSConstants", scope: !5, file: !4, line: 190, type: !9, scopeLine: 190, flags: DIFlagPrototyped, spFlags: 0)
!9 = !DISubroutineType(types: !10)
!10 = !{null, !11}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!12 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27}
!14 = !DIEnumerator(name: "ATTRIBUTE_DECLARATION", value: 1, isUnsigned: true)
!15 = !DIEnumerator(name: "ELEMENT_DECLARATION", value: 2, isUnsigned: true)
!16 = !DIEnumerator(name: "TYPE_DEFINITION", value: 3, isUnsigned: true)
!17 = !DIEnumerator(name: "ATTRIBUTE_USE", value: 4, isUnsigned: true)
!18 = !DIEnumerator(name: "ATTRIBUTE_GROUP_DEFINITION", value: 5, isUnsigned: true)
!19 = !DIEnumerator(name: "MODEL_GROUP_DEFINITION", value: 6, isUnsigned: true)
!20 = !DIEnumerator(name: "MODEL_GROUP", value: 7, isUnsigned: true)
!21 = !DIEnumerator(name: "PARTICLE", value: 8, isUnsigned: true)
!22 = !DIEnumerator(name: "WILDCARD", value: 9, isUnsigned: true)
!23 = !DIEnumerator(name: "IDENTITY_CONSTRAINT", value: 10, isUnsigned: true)
!24 = !DIEnumerator(name: "NOTATION_DECLARATION", value: 11, isUnsigned: true)
!25 = !DIEnumerator(name: "ANNOTATION", value: 12, isUnsigned: true)
!26 = !DIEnumerator(name: "FACET", value: 13, isUnsigned: true)
!27 = !DIEnumerator(name: "MULTIVALUE_FACET", value: 14, isUnsigned: true)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "NAMESPACE_CONSTRAINT", scope: !30, file: !29, line: 45, baseType: !12, size: 32, elements: !1298, identifier: "_ZTSN11xercesc_2_710XSWildcard20NAMESPACE_CONSTRAINTE")
!29 = !DIFile(filename: "./xercesc/framework/psvi/XSWildcard.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!30 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "XSWildcard", scope: !6, file: !29, line: 40, size: 512, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !31, vtableHolder: !33)
!31 = !{!32, !35, !36, !42, !183, !186, !348, !1270, !1273, !1278, !1281, !1284, !1287, !1291, !1295}
!32 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !30, baseType: !33, flags: DIFlagPublic, extraData: i32 0)
!33 = !DICompositeType(tag: DW_TAG_class_type, name: "XSObject", scope: !6, file: !34, line: 41, flags: DIFlagFwdDecl)
!34 = !DIFile(filename: "./xercesc/framework/psvi/XSObject.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!35 = !DIDerivedType(tag: DW_TAG_member, name: "fConstraintType", scope: !30, file: !29, line: 171, baseType: !28, size: 32, offset: 288, flags: DIFlagProtected)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "fProcessContents", scope: !30, file: !29, line: 172, baseType: !37, size: 32, offset: 320, flags: DIFlagProtected)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PROCESS_CONTENTS", scope: !30, file: !29, line: 61, baseType: !12, size: 32, elements: !38, identifier: "_ZTSN11xercesc_2_710XSWildcard16PROCESS_CONTENTSE")
!38 = !{!39, !40, !41}
!39 = !DIEnumerator(name: "PC_STRICT", value: 1, isUnsigned: true)
!40 = !DIEnumerator(name: "PC_SKIP", value: 2, isUnsigned: true)
!41 = !DIEnumerator(name: "PC_LAX", value: 3, isUnsigned: true)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "fNsConstraintList", scope: !30, file: !29, line: 173, baseType: !43, size: 64, offset: 384, flags: DIFlagProtected)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "StringList", scope: !6, file: !4, line: 53, baseType: !45)
!45 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "RefArrayVectorOf<unsigned short>", scope: !6, file: !46, line: 28, size: 320, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !47, vtableHolder: !49, templateParams: !156, identifier: "_ZTSN11xercesc_2_716RefArrayVectorOfItEE")
!46 = !DIFile(filename: "./xercesc/util/RefArrayVectorOf.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!47 = !{!48, !158, !162, !165, !168, !169, !172, !173, !174, !179}
!48 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !45, baseType: !49, flags: DIFlagPublic, extraData: i32 0)
!49 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "BaseRefVectorOf<unsigned short>", scope: !6, file: !50, line: 33, size: 320, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !51, vtableHolder: !49, templateParams: !156, identifier: "_ZTSN11xercesc_2_715BaseRefVectorOfItEE")
!50 = !DIFile(filename: "./xercesc/util/BaseRefVectorOf.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!51 = !{!52, !85, !91, !93, !94, !95, !99, !100, !107, !110, !114, !117, !118, !121, !122, !125, !126, !132, !133, !134, !139, !142, !143, !144, !147, !148, !152}
!52 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !49, baseType: !53, flags: DIFlagPublic, extraData: i32 0)
!53 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "XMemory", scope: !6, file: !54, line: 40, size: 8, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !55, identifier: "_ZTSN11xercesc_2_77XMemoryE")
!54 = !DIFile(filename: "./xercesc/util/XMemory.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!55 = !{!56, !63, !69, !72, !75, !78, !81}
!56 = !DISubprogram(name: "operator new", linkageName: "_ZN11xercesc_2_77XMemorynwEm", scope: !53, file: !54, line: 54, type: !57, scopeLine: 54, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!57 = !DISubroutineType(types: !58)
!58 = !{!59, !60}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !61, line: 46, baseType: !62)
!61 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!62 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!63 = !DISubprogram(name: "operator new", linkageName: "_ZN11xercesc_2_77XMemorynwEmPNS_13MemoryManagerE", scope: !53, file: !54, line: 82, type: !64, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!64 = !DISubroutineType(types: !65)
!65 = !{!59, !60, !66}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DICompositeType(tag: DW_TAG_class_type, name: "MemoryManager", scope: !6, file: !68, line: 38, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_713MemoryManagerE")
!68 = !DIFile(filename: "./xercesc/framework/MemoryManager.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!69 = !DISubprogram(name: "operator new", linkageName: "_ZN11xercesc_2_77XMemorynwEmPv", scope: !53, file: !54, line: 90, type: !70, scopeLine: 90, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!70 = !DISubroutineType(types: !71)
!71 = !{!59, !60, !59}
!72 = !DISubprogram(name: "operator delete", linkageName: "_ZN11xercesc_2_77XMemorydlEPv", scope: !53, file: !54, line: 97, type: !73, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!73 = !DISubroutineType(types: !74)
!74 = !{null, !59}
!75 = !DISubprogram(name: "operator delete", linkageName: "_ZN11xercesc_2_77XMemorydlEPvPNS_13MemoryManagerE", scope: !53, file: !54, line: 107, type: !76, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!76 = !DISubroutineType(types: !77)
!77 = !{null, !59, !66}
!78 = !DISubprogram(name: "operator delete", linkageName: "_ZN11xercesc_2_77XMemorydlEPvS1_", scope: !53, file: !54, line: 115, type: !79, scopeLine: 115, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!79 = !DISubroutineType(types: !80)
!80 = !{null, !59, !59}
!81 = !DISubprogram(name: "XMemory", scope: !53, file: !54, line: 130, type: !82, scopeLine: 130, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!82 = !DISubroutineType(types: !83)
!83 = !{null, !84}
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$BaseRefVectorOf", scope: !50, file: !50, baseType: !86, size: 64, flags: DIFlagArtificial)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !88, size: 64)
!88 = !DISubroutineType(types: !89)
!89 = !{!90}
!90 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "fAdoptedElems", scope: !49, file: !50, line: 89, baseType: !92, size: 8, offset: 64, flags: DIFlagProtected)
!92 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "fCurCount", scope: !49, file: !50, line: 90, baseType: !12, size: 32, offset: 96, flags: DIFlagProtected)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "fMaxCount", scope: !49, file: !50, line: 91, baseType: !12, size: 32, offset: 128, flags: DIFlagProtected)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "fElemList", scope: !49, file: !50, line: 92, baseType: !96, size: 64, offset: 192, flags: DIFlagProtected)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "fMemoryManager", scope: !49, file: !50, line: 93, baseType: !66, size: 64, offset: 256, flags: DIFlagProtected)
!100 = !DISubprogram(name: "BaseRefVectorOf", scope: !49, file: !50, line: 39, type: !101, scopeLine: 39, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!101 = !DISubroutineType(types: !102)
!102 = !{null, !103, !104, !105, !106}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !92)
!106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !66)
!107 = !DISubprogram(name: "~BaseRefVectorOf", scope: !49, file: !50, line: 45, type: !108, scopeLine: 45, containingType: !49, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!108 = !DISubroutineType(types: !109)
!109 = !{null, !103}
!110 = !DISubprogram(name: "addElement", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfItE10addElementEPt", scope: !49, file: !50, line: 51, type: !111, scopeLine: 51, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!111 = !DISubroutineType(types: !112)
!112 = !{null, !103, !113}
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !97)
!114 = !DISubprogram(name: "setElementAt", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfItE12setElementAtEPtj", scope: !49, file: !50, line: 52, type: !115, scopeLine: 52, containingType: !49, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!115 = !DISubroutineType(types: !116)
!116 = !{null, !103, !113, !104}
!117 = !DISubprogram(name: "insertElementAt", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfItE15insertElementAtEPtj", scope: !49, file: !50, line: 53, type: !115, scopeLine: 53, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!118 = !DISubprogram(name: "orphanElementAt", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfItE15orphanElementAtEj", scope: !49, file: !50, line: 54, type: !119, scopeLine: 54, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!119 = !DISubroutineType(types: !120)
!120 = !{!97, !103, !104}
!121 = !DISubprogram(name: "removeAllElements", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfItE17removeAllElementsEv", scope: !49, file: !50, line: 55, type: !108, scopeLine: 55, containingType: !49, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!122 = !DISubprogram(name: "removeElementAt", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfItE15removeElementAtEj", scope: !49, file: !50, line: 56, type: !123, scopeLine: 56, containingType: !49, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!123 = !DISubroutineType(types: !124)
!124 = !{null, !103, !104}
!125 = !DISubprogram(name: "removeLastElement", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfItE17removeLastElementEv", scope: !49, file: !50, line: 57, type: !108, scopeLine: 57, containingType: !49, virtualIndex: 5, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!126 = !DISubprogram(name: "containsElement", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfItE15containsElementEPKt", scope: !49, file: !50, line: 58, type: !127, scopeLine: 58, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!127 = !DISubroutineType(types: !128)
!128 = !{!92, !103, !129}
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!132 = !DISubprogram(name: "cleanup", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfItE7cleanupEv", scope: !49, file: !50, line: 59, type: !108, scopeLine: 59, containingType: !49, virtualIndex: 6, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!133 = !DISubprogram(name: "reinitialize", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfItE12reinitializeEv", scope: !49, file: !50, line: 60, type: !108, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!134 = !DISubprogram(name: "curCapacity", linkageName: "_ZNK11xercesc_2_715BaseRefVectorOfItE11curCapacityEv", scope: !49, file: !50, line: 66, type: !135, scopeLine: 66, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!135 = !DISubroutineType(types: !136)
!136 = !{!12, !137}
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!139 = !DISubprogram(name: "elementAt", linkageName: "_ZNK11xercesc_2_715BaseRefVectorOfItE9elementAtEj", scope: !49, file: !50, line: 67, type: !140, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!140 = !DISubroutineType(types: !141)
!141 = !{!130, !137, !104}
!142 = !DISubprogram(name: "elementAt", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfItE9elementAtEj", scope: !49, file: !50, line: 68, type: !119, scopeLine: 68, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!143 = !DISubprogram(name: "size", linkageName: "_ZNK11xercesc_2_715BaseRefVectorOfItE4sizeEv", scope: !49, file: !50, line: 69, type: !135, scopeLine: 69, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!144 = !DISubprogram(name: "getMemoryManager", linkageName: "_ZNK11xercesc_2_715BaseRefVectorOfItE16getMemoryManagerEv", scope: !49, file: !50, line: 70, type: !145, scopeLine: 70, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!145 = !DISubroutineType(types: !146)
!146 = !{!66, !137}
!147 = !DISubprogram(name: "ensureExtraCapacity", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfItE19ensureExtraCapacityEj", scope: !49, file: !50, line: 76, type: !123, scopeLine: 76, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!148 = !DISubprogram(name: "BaseRefVectorOf", scope: !49, file: !50, line: 82, type: !149, scopeLine: 82, flags: DIFlagPrototyped, spFlags: 0)
!149 = !DISubroutineType(types: !150)
!150 = !{null, !103, !151}
!151 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !138, size: 64)
!152 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfItEaSERKS1_", scope: !49, file: !50, line: 83, type: !153, scopeLine: 83, flags: DIFlagPrototyped, spFlags: 0)
!153 = !DISubroutineType(types: !154)
!154 = !{!155, !103, !151}
!155 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !49, size: 64)
!156 = !{!157}
!157 = !DITemplateTypeParameter(name: "TElem", type: !98)
!158 = !DISubprogram(name: "RefArrayVectorOf", scope: !45, file: !46, line: 34, type: !159, scopeLine: 34, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!159 = !DISubroutineType(types: !160)
!160 = !{null, !161, !104, !105, !106}
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!162 = !DISubprogram(name: "~RefArrayVectorOf", scope: !45, file: !46, line: 41, type: !163, scopeLine: 41, containingType: !45, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!163 = !DISubroutineType(types: !164)
!164 = !{null, !161}
!165 = !DISubprogram(name: "setElementAt", linkageName: "_ZN11xercesc_2_716RefArrayVectorOfItE12setElementAtEPtj", scope: !45, file: !46, line: 46, type: !166, scopeLine: 46, containingType: !45, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!166 = !DISubroutineType(types: !167)
!167 = !{null, !161, !113, !104}
!168 = !DISubprogram(name: "removeAllElements", linkageName: "_ZN11xercesc_2_716RefArrayVectorOfItE17removeAllElementsEv", scope: !45, file: !46, line: 47, type: !163, scopeLine: 47, containingType: !45, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!169 = !DISubprogram(name: "removeElementAt", linkageName: "_ZN11xercesc_2_716RefArrayVectorOfItE15removeElementAtEj", scope: !45, file: !46, line: 48, type: !170, scopeLine: 48, containingType: !45, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!170 = !DISubroutineType(types: !171)
!171 = !{null, !161, !104}
!172 = !DISubprogram(name: "removeLastElement", linkageName: "_ZN11xercesc_2_716RefArrayVectorOfItE17removeLastElementEv", scope: !45, file: !46, line: 49, type: !163, scopeLine: 49, containingType: !45, virtualIndex: 5, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!173 = !DISubprogram(name: "cleanup", linkageName: "_ZN11xercesc_2_716RefArrayVectorOfItE7cleanupEv", scope: !45, file: !46, line: 50, type: !163, scopeLine: 50, containingType: !45, virtualIndex: 6, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!174 = !DISubprogram(name: "RefArrayVectorOf", scope: !45, file: !46, line: 55, type: !175, scopeLine: 55, flags: DIFlagPrototyped, spFlags: 0)
!175 = !DISubroutineType(types: !176)
!176 = !{null, !161, !177}
!177 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!179 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_716RefArrayVectorOfItEaSERKS1_", scope: !45, file: !46, line: 56, type: !180, scopeLine: 56, flags: DIFlagPrototyped, spFlags: 0)
!180 = !DISubroutineType(types: !181)
!181 = !{!182, !161, !177}
!182 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !45, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "fAnnotation", scope: !30, file: !29, line: 174, baseType: !184, size: 64, offset: 448, flags: DIFlagProtected)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DICompositeType(tag: DW_TAG_class_type, name: "XSAnnotation", scope: !6, file: !4, line: 34, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_712XSAnnotationE")
!186 = !DISubprogram(name: "XSWildcard", scope: !30, file: !29, line: 93, type: !187, scopeLine: 93, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!187 = !DISubroutineType(types: !188)
!188 = !{null, !189, !190, !194, !195, !106}
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!190 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DICompositeType(tag: DW_TAG_class_type, name: "SchemaAttDef", scope: !6, file: !193, line: 40, flags: DIFlagFwdDecl)
!193 = !DIFile(filename: "./xercesc/validators/schema/SchemaAttDef.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!195 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "XSModel", scope: !6, file: !198, line: 58, size: 2432, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !199, identifier: "_ZTSN11xercesc_2_77XSModelE")
!198 = !DIFile(filename: "./xercesc/framework/psvi/XSModel.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!199 = !{!200, !201, !202, !203, !208, !214, !219, !223, !227, !231, !235, !237, !238, !239, !240, !247, !253, !256, !259, !262, !265, !272, !275, !280, !285, !291, !296, !301, !306, !310, !313, !319, !322, !325, !332, !336, !339, !344}
!200 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !197, baseType: !53, flags: DIFlagPublic, extraData: i32 0)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "fMemoryManager", scope: !197, file: !198, line: 286, baseType: !106, size: 64, flags: DIFlagProtected)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "fNamespaceStringList", scope: !197, file: !198, line: 288, baseType: !43, size: 64, offset: 64, flags: DIFlagProtected)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "fXSNamespaceItemList", scope: !197, file: !198, line: 289, baseType: !204, size: 64, offset: 128, flags: DIFlagProtected)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "XSNamespaceItemList", scope: !6, file: !4, line: 50, baseType: !206)
!206 = !DICompositeType(tag: DW_TAG_class_type, name: "RefVectorOf<xercesc_2_7::XSNamespaceItem>", scope: !6, file: !207, line: 32, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_711RefVectorOfINS_15XSNamespaceItemEEE")
!207 = !DIFile(filename: "./xercesc/util/RefVectorOf.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!208 = !DIDerivedType(tag: DW_TAG_member, name: "fIdVector", scope: !197, file: !198, line: 291, baseType: !209, size: 896, offset: 192, flags: DIFlagProtected)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 896, elements: !212)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DICompositeType(tag: DW_TAG_class_type, name: "RefVectorOf<xercesc_2_7::XSObject>", scope: !6, file: !207, line: 32, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_711RefVectorOfINS_8XSObjectEEE")
!212 = !{!213}
!213 = !DISubrange(count: 14)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "fComponentMap", scope: !197, file: !198, line: 309, baseType: !215, size: 896, offset: 1088, flags: DIFlagProtected)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !216, size: 896, elements: !212)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DICompositeType(tag: DW_TAG_class_type, name: "XSNamedMap<xercesc_2_7::XSObject>", scope: !6, file: !218, line: 40, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_710XSNamedMapINS_8XSObjectEEE")
!218 = !DIFile(filename: "./xercesc/framework/psvi/XSNamedMap.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!219 = !DIDerivedType(tag: DW_TAG_member, name: "fURIStringPool", scope: !197, file: !198, line: 310, baseType: !220, size: 64, offset: 1984, flags: DIFlagProtected)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DICompositeType(tag: DW_TAG_class_type, name: "XMLStringPool", scope: !6, file: !222, line: 43, flags: DIFlagFwdDecl)
!222 = !DIFile(filename: "./xercesc/util/StringPool.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!223 = !DIDerivedType(tag: DW_TAG_member, name: "fXSAnnotationList", scope: !197, file: !198, line: 311, baseType: !224, size: 64, offset: 2048, flags: DIFlagProtected)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "XSAnnotationList", scope: !6, file: !4, line: 46, baseType: !226)
!226 = !DICompositeType(tag: DW_TAG_class_type, name: "RefVectorOf<xercesc_2_7::XSAnnotation>", scope: !6, file: !207, line: 32, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_711RefVectorOfINS_12XSAnnotationEEE")
!227 = !DIDerivedType(tag: DW_TAG_member, name: "fHashNamespace", scope: !197, file: !198, line: 312, baseType: !228, size: 64, offset: 2112, flags: DIFlagProtected)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DICompositeType(tag: DW_TAG_class_type, name: "RefHashTableOf<xercesc_2_7::XSNamespaceItem>", scope: !6, file: !230, line: 72, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_714RefHashTableOfINS_15XSNamespaceItemEEE")
!230 = !DIFile(filename: "./xercesc/util/RefHashTableOf.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!231 = !DIDerivedType(tag: DW_TAG_member, name: "fObjFactory", scope: !197, file: !198, line: 313, baseType: !232, size: 64, offset: 2176, flags: DIFlagProtected)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DICompositeType(tag: DW_TAG_class_type, name: "XSObjectFactory", scope: !6, file: !234, line: 368, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_715XSObjectFactoryE")
!234 = !DIFile(filename: "./xercesc/framework/psvi/XSSimpleTypeDefinition.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!235 = !DIDerivedType(tag: DW_TAG_member, name: "fDeleteNamespace", scope: !197, file: !198, line: 314, baseType: !236, size: 64, offset: 2240, flags: DIFlagProtected)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "fParent", scope: !197, file: !198, line: 315, baseType: !196, size: 64, offset: 2304, flags: DIFlagProtected)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "fDeleteParent", scope: !197, file: !198, line: 316, baseType: !92, size: 8, offset: 2368, flags: DIFlagProtected)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "fAddedS4SGrammar", scope: !197, file: !198, line: 317, baseType: !92, size: 8, offset: 2376, flags: DIFlagProtected)
!240 = !DISubprogram(name: "XSModel", scope: !197, file: !198, line: 72, type: !241, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!241 = !DISubroutineType(types: !242)
!242 = !{null, !243, !244, !106}
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DICompositeType(tag: DW_TAG_class_type, name: "XMLGrammarPool", scope: !6, file: !246, line: 38, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_714XMLGrammarPoolE")
!246 = !DIFile(filename: "./xercesc/internal/XSerializeEngine.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!247 = !DISubprogram(name: "XSModel", scope: !197, file: !198, line: 84, type: !248, scopeLine: 84, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!248 = !DISubroutineType(types: !249)
!249 = !{null, !243, !196, !250, !106}
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DICompositeType(tag: DW_TAG_class_type, name: "GrammarResolver", scope: !6, file: !252, line: 31, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_715GrammarResolverE")
!252 = !DIFile(filename: "./xercesc/framework/XMLContentModel.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!253 = !DISubprogram(name: "~XSModel", scope: !197, file: !198, line: 92, type: !254, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !243}
!256 = !DISubprogram(name: "getNamespaces", linkageName: "_ZN11xercesc_2_77XSModel13getNamespacesEv", scope: !197, file: !198, line: 106, type: !257, scopeLine: 106, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!257 = !DISubroutineType(types: !258)
!258 = !{!43, !243}
!259 = !DISubprogram(name: "getNamespaceItems", linkageName: "_ZN11xercesc_2_77XSModel17getNamespaceItemsEv", scope: !197, file: !198, line: 116, type: !260, scopeLine: 116, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!260 = !DISubroutineType(types: !261)
!261 = !{!204, !243}
!262 = !DISubprogram(name: "getComponents", linkageName: "_ZN11xercesc_2_77XSModel13getComponentsENS_11XSConstants14COMPONENT_TYPEE", scope: !197, file: !198, line: 128, type: !263, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!263 = !DISubroutineType(types: !264)
!264 = !{!216, !243, !3}
!265 = !DISubprogram(name: "getComponentsByNamespace", linkageName: "_ZN11xercesc_2_77XSModel24getComponentsByNamespaceENS_11XSConstants14COMPONENT_TYPEEPKt", scope: !197, file: !198, line: 142, type: !266, scopeLine: 142, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!266 = !DISubroutineType(types: !267)
!267 = !{!216, !243, !3, !268}
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMLCh", file: !271, line: 67, baseType: !98)
!271 = !DIFile(filename: "./xercesc/util/Compilers/GCCDefs.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!272 = !DISubprogram(name: "getAnnotations", linkageName: "_ZN11xercesc_2_77XSModel14getAnnotationsEv", scope: !197, file: !198, line: 148, type: !273, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!273 = !DISubroutineType(types: !274)
!274 = !{!224, !243}
!275 = !DISubprogram(name: "getElementDeclaration", linkageName: "_ZN11xercesc_2_77XSModel21getElementDeclarationEPKtS2_", scope: !197, file: !198, line: 157, type: !276, scopeLine: 157, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!276 = !DISubroutineType(types: !277)
!277 = !{!278, !243, !268, !268}
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DICompositeType(tag: DW_TAG_class_type, name: "XSElementDeclaration", scope: !6, file: !198, line: 51, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_720XSElementDeclarationE")
!280 = !DISubprogram(name: "getAttributeDeclaration", linkageName: "_ZN11xercesc_2_77XSModel23getAttributeDeclarationEPKtS2_", scope: !197, file: !198, line: 167, type: !281, scopeLine: 167, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!281 = !DISubroutineType(types: !282)
!282 = !{!283, !243, !268, !268}
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DICompositeType(tag: DW_TAG_class_type, name: "XSAttributeDeclaration", scope: !6, file: !198, line: 49, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_722XSAttributeDeclarationE")
!285 = !DISubprogram(name: "getTypeDefinition", linkageName: "_ZN11xercesc_2_77XSModel17getTypeDefinitionEPKtS2_", scope: !197, file: !198, line: 178, type: !286, scopeLine: 178, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!286 = !DISubroutineType(types: !287)
!287 = !{!288, !243, !268, !268}
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DICompositeType(tag: DW_TAG_class_type, name: "XSTypeDefinition", scope: !6, file: !290, line: 38, flags: DIFlagFwdDecl)
!290 = !DIFile(filename: "./xercesc/framework/psvi/XSTypeDefinition.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!291 = !DISubprogram(name: "getAttributeGroup", linkageName: "_ZN11xercesc_2_77XSModel17getAttributeGroupEPKtS2_", scope: !197, file: !198, line: 188, type: !292, scopeLine: 188, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!292 = !DISubroutineType(types: !293)
!293 = !{!294, !243, !268, !268}
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DICompositeType(tag: DW_TAG_class_type, name: "XSAttributeGroupDefinition", scope: !6, file: !198, line: 50, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_726XSAttributeGroupDefinitionE")
!296 = !DISubprogram(name: "getModelGroupDefinition", linkageName: "_ZN11xercesc_2_77XSModel23getModelGroupDefinitionEPKtS2_", scope: !197, file: !198, line: 198, type: !297, scopeLine: 198, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!297 = !DISubroutineType(types: !298)
!298 = !{!299, !243, !268, !268}
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DICompositeType(tag: DW_TAG_class_type, name: "XSModelGroupDefinition", scope: !6, file: !198, line: 52, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_722XSModelGroupDefinitionE")
!301 = !DISubprogram(name: "getNotationDeclaration", linkageName: "_ZN11xercesc_2_77XSModel22getNotationDeclarationEPKtS2_", scope: !197, file: !198, line: 208, type: !302, scopeLine: 208, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!302 = !DISubroutineType(types: !303)
!303 = !{!304, !243, !268, !268}
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DICompositeType(tag: DW_TAG_class_type, name: "XSNotationDeclaration", scope: !6, file: !198, line: 54, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_721XSNotationDeclarationE")
!306 = !DISubprogram(name: "getXSObjectById", linkageName: "_ZN11xercesc_2_77XSModel15getXSObjectByIdEjNS_11XSConstants14COMPONENT_TYPEE", scope: !197, file: !198, line: 220, type: !307, scopeLine: 220, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!307 = !DISubroutineType(types: !308)
!308 = !{!309, !243, !12, !3}
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!310 = !DISubprogram(name: "getURIStringPool", linkageName: "_ZN11xercesc_2_77XSModel16getURIStringPoolEv", scope: !197, file: !198, line: 229, type: !311, scopeLine: 229, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!311 = !DISubroutineType(types: !312)
!312 = !{!220, !243}
!313 = !DISubprogram(name: "getNamespaceItem", linkageName: "_ZN11xercesc_2_77XSModel16getNamespaceItemEPKt", scope: !197, file: !198, line: 231, type: !314, scopeLine: 231, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!314 = !DISubroutineType(types: !315)
!315 = !{!316, !243, !318}
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DICompositeType(tag: DW_TAG_class_type, name: "XSNamespaceItem", scope: !6, file: !4, line: 38, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_715XSNamespaceItemE")
!318 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !268)
!319 = !DISubprogram(name: "getXSObject", linkageName: "_ZN11xercesc_2_77XSModel11getXSObjectEPv", scope: !197, file: !198, line: 240, type: !320, scopeLine: 240, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!320 = !DISubroutineType(types: !321)
!321 = !{!309, !243, !59}
!322 = !DISubprogram(name: "addGrammarToXSModel", linkageName: "_ZN11xercesc_2_77XSModel19addGrammarToXSModelEPNS_15XSNamespaceItemE", scope: !197, file: !198, line: 248, type: !323, scopeLine: 248, flags: DIFlagPrototyped, spFlags: 0)
!323 = !DISubroutineType(types: !324)
!324 = !{null, !243, !316}
!325 = !DISubprogram(name: "addS4SToXSModel", linkageName: "_ZN11xercesc_2_77XSModel15addS4SToXSModelEPNS_15XSNamespaceItemEPNS_14RefHashTableOfINS_17DatatypeValidatorEEE", scope: !197, file: !198, line: 252, type: !326, scopeLine: 252, flags: DIFlagPrototyped, spFlags: 0)
!326 = !DISubroutineType(types: !327)
!327 = !{null, !243, !328, !329}
!328 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !316)
!329 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !330)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DICompositeType(tag: DW_TAG_class_type, name: "RefHashTableOf<xercesc_2_7::DatatypeValidator>", scope: !6, file: !230, line: 72, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_714RefHashTableOfINS_17DatatypeValidatorEEE")
!332 = !DISubprogram(name: "addComponentToNamespace", linkageName: "_ZN11xercesc_2_77XSModel23addComponentToNamespaceEPNS_15XSNamespaceItemEPNS_8XSObjectEib", scope: !197, file: !198, line: 257, type: !333, scopeLine: 257, flags: DIFlagPrototyped, spFlags: 0)
!333 = !DISubroutineType(types: !334)
!334 = !{null, !243, !328, !335, !90, !92}
!335 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !309)
!336 = !DISubprogram(name: "addComponentToIdVector", linkageName: "_ZN11xercesc_2_77XSModel22addComponentToIdVectorEPNS_8XSObjectEi", scope: !197, file: !198, line: 265, type: !337, scopeLine: 265, flags: DIFlagPrototyped, spFlags: 0)
!337 = !DISubroutineType(types: !338)
!338 = !{null, !243, !335, !90}
!339 = !DISubprogram(name: "XSModel", scope: !197, file: !198, line: 274, type: !340, scopeLine: 274, flags: DIFlagPrototyped, spFlags: 0)
!340 = !DISubroutineType(types: !341)
!341 = !{null, !243, !342}
!342 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !197)
!344 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_77XSModelaSERKS0_", scope: !197, file: !198, line: 275, type: !345, scopeLine: 275, flags: DIFlagPrototyped, spFlags: 0)
!345 = !DISubroutineType(types: !346)
!346 = !{!347, !243, !342}
!347 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !197, size: 64)
!348 = !DISubprogram(name: "XSWildcard", scope: !30, file: !29, line: 101, type: !349, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!349 = !DISubroutineType(types: !350)
!350 = !{null, !189, !351, !194, !195, !106}
!351 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !354)
!354 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "ContentSpecNode", scope: !6, file: !355, line: 36, size: 512, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !356, vtableHolder: !358, identifier: "_ZTSN11xercesc_2_715ContentSpecNodeE")
!355 = !DIFile(filename: "./xercesc/validators/common/ContentSpecNode.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!356 = !{!357, !360, !361, !364, !365, !369, !373, !375, !376, !399, !400, !401, !402, !403, !407, !411, !415, !418, !423, !427, !430, !433, !439, !442, !447, !450, !453, !454, !455, !458, !459, !460, !463, !464, !467, !468, !471, !474, !475, !478, !481, !482, !485, !486, !554, !557, !558, !559, !563, !564, !568, !1266}
!357 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !354, baseType: !358, flags: DIFlagPublic, extraData: i32 0)
!358 = !DICompositeType(tag: DW_TAG_class_type, name: "XSerializable", scope: !6, file: !359, line: 29, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_713XSerializableE")
!359 = !DIFile(filename: "./xercesc/internal/XSerializable.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!360 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !354, baseType: !53, flags: DIFlagPublic, extraData: i32 0)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "classContentSpecNode", scope: !354, file: !355, line: 144, baseType: !362, flags: DIFlagPublic | DIFlagStaticMember)
!362 = !DICompositeType(tag: DW_TAG_class_type, name: "XProtoType", scope: !6, file: !363, line: 32, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_710XProtoTypeE")
!363 = !DIFile(filename: "./xercesc/internal/XProtoType.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!364 = !DIDerivedType(tag: DW_TAG_member, name: "fMemoryManager", scope: !354, file: !355, line: 189, baseType: !66, size: 64, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "fElement", scope: !354, file: !355, line: 190, baseType: !366, size: 64, offset: 128)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DICompositeType(tag: DW_TAG_class_type, name: "QName", scope: !6, file: !368, line: 33, flags: DIFlagFwdDecl)
!368 = !DIFile(filename: "./xercesc/util/QName.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!369 = !DIDerivedType(tag: DW_TAG_member, name: "fElementDecl", scope: !354, file: !355, line: 191, baseType: !370, size: 64, offset: 192)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DICompositeType(tag: DW_TAG_class_type, name: "XMLElementDecl", scope: !6, file: !372, line: 50, flags: DIFlagFwdDecl)
!372 = !DIFile(filename: "./xercesc/framework/XMLElementDecl.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!373 = !DIDerivedType(tag: DW_TAG_member, name: "fFirst", scope: !354, file: !355, line: 192, baseType: !374, size: 64, offset: 256)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "fSecond", scope: !354, file: !355, line: 193, baseType: !374, size: 64, offset: 320)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "fType", scope: !354, file: !355, line: 194, baseType: !377, size: 32, offset: 384)
!377 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "NodeTypes", scope: !354, file: !355, line: 42, baseType: !90, size: 32, elements: !378, identifier: "_ZTSN11xercesc_2_715ContentSpecNode9NodeTypesE")
!378 = !{!379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398}
!379 = !DIEnumerator(name: "Leaf", value: 0)
!380 = !DIEnumerator(name: "ZeroOrOne", value: 1)
!381 = !DIEnumerator(name: "ZeroOrMore", value: 2)
!382 = !DIEnumerator(name: "OneOrMore", value: 3)
!383 = !DIEnumerator(name: "Choice", value: 4)
!384 = !DIEnumerator(name: "Sequence", value: 5)
!385 = !DIEnumerator(name: "Any", value: 6)
!386 = !DIEnumerator(name: "Any_Other", value: 7)
!387 = !DIEnumerator(name: "Any_NS", value: 8)
!388 = !DIEnumerator(name: "All", value: 9)
!389 = !DIEnumerator(name: "Any_NS_Choice", value: 20)
!390 = !DIEnumerator(name: "ModelGroupSequence", value: 21)
!391 = !DIEnumerator(name: "Any_Lax", value: 22)
!392 = !DIEnumerator(name: "Any_Other_Lax", value: 23)
!393 = !DIEnumerator(name: "Any_NS_Lax", value: 24)
!394 = !DIEnumerator(name: "ModelGroupChoice", value: 36)
!395 = !DIEnumerator(name: "Any_Skip", value: 38)
!396 = !DIEnumerator(name: "Any_Other_Skip", value: 39)
!397 = !DIEnumerator(name: "Any_NS_Skip", value: 40)
!398 = !DIEnumerator(name: "UnknownType", value: -1)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "fAdoptFirst", scope: !354, file: !355, line: 195, baseType: !92, size: 8, offset: 416)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "fAdoptSecond", scope: !354, file: !355, line: 196, baseType: !92, size: 8, offset: 424)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "fMinOccurs", scope: !354, file: !355, line: 197, baseType: !90, size: 32, offset: 448)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "fMaxOccurs", scope: !354, file: !355, line: 198, baseType: !90, size: 32, offset: 480)
!403 = !DISubprogram(name: "ContentSpecNode", scope: !354, file: !355, line: 71, type: !404, scopeLine: 71, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!404 = !DISubroutineType(types: !405)
!405 = !{null, !406, !106}
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!407 = !DISubprogram(name: "ContentSpecNode", scope: !354, file: !355, line: 72, type: !408, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!408 = !DISubroutineType(types: !409)
!409 = !{null, !406, !410, !106}
!410 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !366)
!411 = !DISubprogram(name: "ContentSpecNode", scope: !354, file: !355, line: 77, type: !412, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!412 = !DISubroutineType(types: !413)
!413 = !{null, !406, !414, !106}
!414 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !370)
!415 = !DISubprogram(name: "ContentSpecNode", scope: !354, file: !355, line: 82, type: !416, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!416 = !DISubroutineType(types: !417)
!417 = !{null, !406, !410, !105, !106}
!418 = !DISubprogram(name: "ContentSpecNode", scope: !354, file: !355, line: 88, type: !419, scopeLine: 88, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!419 = !DISubroutineType(types: !420)
!420 = !{null, !406, !421, !422, !422, !105, !105, !106}
!421 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !377)
!422 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !374)
!423 = !DISubprogram(name: "ContentSpecNode", scope: !354, file: !355, line: 97, type: !424, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!424 = !DISubroutineType(types: !425)
!425 = !{null, !406, !426}
!426 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !353, size: 64)
!427 = !DISubprogram(name: "~ContentSpecNode", scope: !354, file: !355, line: 98, type: !428, scopeLine: 98, containingType: !354, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!428 = !DISubroutineType(types: !429)
!429 = !{null, !406}
!430 = !DISubprogram(name: "getElement", linkageName: "_ZN11xercesc_2_715ContentSpecNode10getElementEv", scope: !354, file: !355, line: 103, type: !431, scopeLine: 103, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!431 = !DISubroutineType(types: !432)
!432 = !{!366, !406}
!433 = !DISubprogram(name: "getElement", linkageName: "_ZNK11xercesc_2_715ContentSpecNode10getElementEv", scope: !354, file: !355, line: 104, type: !434, scopeLine: 104, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!434 = !DISubroutineType(types: !435)
!435 = !{!436, !438}
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !367)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!439 = !DISubprogram(name: "getElementDecl", linkageName: "_ZN11xercesc_2_715ContentSpecNode14getElementDeclEv", scope: !354, file: !355, line: 105, type: !440, scopeLine: 105, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!440 = !DISubroutineType(types: !441)
!441 = !{!370, !406}
!442 = !DISubprogram(name: "getElementDecl", linkageName: "_ZNK11xercesc_2_715ContentSpecNode14getElementDeclEv", scope: !354, file: !355, line: 106, type: !443, scopeLine: 106, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!443 = !DISubroutineType(types: !444)
!444 = !{!445, !438}
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !371)
!447 = !DISubprogram(name: "getFirst", linkageName: "_ZN11xercesc_2_715ContentSpecNode8getFirstEv", scope: !354, file: !355, line: 107, type: !448, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!448 = !DISubroutineType(types: !449)
!449 = !{!374, !406}
!450 = !DISubprogram(name: "getFirst", linkageName: "_ZNK11xercesc_2_715ContentSpecNode8getFirstEv", scope: !354, file: !355, line: 108, type: !451, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!451 = !DISubroutineType(types: !452)
!452 = !{!352, !438}
!453 = !DISubprogram(name: "getSecond", linkageName: "_ZN11xercesc_2_715ContentSpecNode9getSecondEv", scope: !354, file: !355, line: 109, type: !448, scopeLine: 109, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!454 = !DISubprogram(name: "getSecond", linkageName: "_ZNK11xercesc_2_715ContentSpecNode9getSecondEv", scope: !354, file: !355, line: 110, type: !451, scopeLine: 110, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!455 = !DISubprogram(name: "getType", linkageName: "_ZNK11xercesc_2_715ContentSpecNode7getTypeEv", scope: !354, file: !355, line: 111, type: !456, scopeLine: 111, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!456 = !DISubroutineType(types: !457)
!457 = !{!377, !438}
!458 = !DISubprogram(name: "orphanFirst", linkageName: "_ZN11xercesc_2_715ContentSpecNode11orphanFirstEv", scope: !354, file: !355, line: 112, type: !448, scopeLine: 112, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!459 = !DISubprogram(name: "orphanSecond", linkageName: "_ZN11xercesc_2_715ContentSpecNode12orphanSecondEv", scope: !354, file: !355, line: 113, type: !448, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!460 = !DISubprogram(name: "getMinOccurs", linkageName: "_ZNK11xercesc_2_715ContentSpecNode12getMinOccursEv", scope: !354, file: !355, line: 114, type: !461, scopeLine: 114, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!461 = !DISubroutineType(types: !462)
!462 = !{!90, !438}
!463 = !DISubprogram(name: "getMaxOccurs", linkageName: "_ZNK11xercesc_2_715ContentSpecNode12getMaxOccursEv", scope: !354, file: !355, line: 115, type: !461, scopeLine: 115, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!464 = !DISubprogram(name: "isFirstAdopted", linkageName: "_ZNK11xercesc_2_715ContentSpecNode14isFirstAdoptedEv", scope: !354, file: !355, line: 116, type: !465, scopeLine: 116, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!465 = !DISubroutineType(types: !466)
!466 = !{!92, !438}
!467 = !DISubprogram(name: "isSecondAdopted", linkageName: "_ZNK11xercesc_2_715ContentSpecNode15isSecondAdoptedEv", scope: !354, file: !355, line: 117, type: !465, scopeLine: 117, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!468 = !DISubprogram(name: "setElement", linkageName: "_ZN11xercesc_2_715ContentSpecNode10setElementEPNS_5QNameE", scope: !354, file: !355, line: 123, type: !469, scopeLine: 123, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!469 = !DISubroutineType(types: !470)
!470 = !{null, !406, !410}
!471 = !DISubprogram(name: "setFirst", linkageName: "_ZN11xercesc_2_715ContentSpecNode8setFirstEPS0_", scope: !354, file: !355, line: 124, type: !472, scopeLine: 124, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!472 = !DISubroutineType(types: !473)
!473 = !{null, !406, !422}
!474 = !DISubprogram(name: "setSecond", linkageName: "_ZN11xercesc_2_715ContentSpecNode9setSecondEPS0_", scope: !354, file: !355, line: 125, type: !472, scopeLine: 125, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!475 = !DISubprogram(name: "setType", linkageName: "_ZN11xercesc_2_715ContentSpecNode7setTypeENS0_9NodeTypesE", scope: !354, file: !355, line: 126, type: !476, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!476 = !DISubroutineType(types: !477)
!477 = !{null, !406, !421}
!478 = !DISubprogram(name: "setMinOccurs", linkageName: "_ZN11xercesc_2_715ContentSpecNode12setMinOccursEi", scope: !354, file: !355, line: 127, type: !479, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!479 = !DISubroutineType(types: !480)
!480 = !{null, !406, !90}
!481 = !DISubprogram(name: "setMaxOccurs", linkageName: "_ZN11xercesc_2_715ContentSpecNode12setMaxOccursEi", scope: !354, file: !355, line: 128, type: !479, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!482 = !DISubprogram(name: "setAdoptFirst", linkageName: "_ZN11xercesc_2_715ContentSpecNode13setAdoptFirstEb", scope: !354, file: !355, line: 129, type: !483, scopeLine: 129, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!483 = !DISubroutineType(types: !484)
!484 = !{null, !406, !92}
!485 = !DISubprogram(name: "setAdoptSecond", linkageName: "_ZN11xercesc_2_715ContentSpecNode14setAdoptSecondEb", scope: !354, file: !355, line: 130, type: !483, scopeLine: 130, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!486 = !DISubprogram(name: "formatSpec", linkageName: "_ZNK11xercesc_2_715ContentSpecNode10formatSpecERNS_9XMLBufferE", scope: !354, file: !355, line: 136, type: !487, scopeLine: 136, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!487 = !DISubroutineType(types: !488)
!488 = !{null, !438, !489}
!489 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !490, size: 64)
!490 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "XMLBuffer", scope: !6, file: !491, line: 51, size: 320, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !492, identifier: "_ZTSN11xercesc_2_79XMLBufferE")
!491 = !DIFile(filename: "./xercesc/framework/XMLBuffer.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!492 = !{!493, !494, !495, !496, !497, !498, !499, !502, !504, !508, !511, !514, !517, !520, !523, !524, !525, !530, !533, !534, !537, !540, !541, !544, !548, !551}
!493 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !490, baseType: !53, flags: DIFlagPublic, extraData: i32 0)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "fIndex", scope: !490, file: !491, line: 254, baseType: !12, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "fCapacity", scope: !490, file: !491, line: 255, baseType: !12, size: 32, offset: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "fFullSize", scope: !490, file: !491, line: 256, baseType: !12, size: 32, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "fUsed", scope: !490, file: !491, line: 257, baseType: !92, size: 8, offset: 96)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "fMemoryManager", scope: !490, file: !491, line: 258, baseType: !106, size: 64, offset: 128)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "fFullHandler", scope: !490, file: !491, line: 259, baseType: !500, size: 64, offset: 192)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DICompositeType(tag: DW_TAG_class_type, name: "XMLBufferFullHandler", scope: !6, file: !491, line: 270, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_720XMLBufferFullHandlerE")
!502 = !DIDerivedType(tag: DW_TAG_member, name: "fBuffer", scope: !490, file: !491, line: 260, baseType: !503, size: 64, offset: 256)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!504 = !DISubprogram(name: "XMLBuffer", scope: !490, file: !491, line: 60, type: !505, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!505 = !DISubroutineType(types: !506)
!506 = !{null, !507, !104, !106}
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!508 = !DISubprogram(name: "~XMLBuffer", scope: !490, file: !491, line: 81, type: !509, scopeLine: 81, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!509 = !DISubroutineType(types: !510)
!510 = !{null, !507}
!511 = !DISubprogram(name: "setFullHandler", linkageName: "_ZN11xercesc_2_79XMLBuffer14setFullHandlerEPNS_20XMLBufferFullHandlerEj", scope: !490, file: !491, line: 90, type: !512, scopeLine: 90, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!512 = !DISubroutineType(types: !513)
!513 = !{null, !507, !500, !104}
!514 = !DISubprogram(name: "append", linkageName: "_ZN11xercesc_2_79XMLBuffer6appendEt", scope: !490, file: !491, line: 119, type: !515, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!515 = !DISubroutineType(types: !516)
!516 = !{null, !507, !269}
!517 = !DISubprogram(name: "append", linkageName: "_ZN11xercesc_2_79XMLBuffer6appendEPKtj", scope: !490, file: !491, line: 127, type: !518, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!518 = !DISubroutineType(types: !519)
!519 = !{null, !507, !318, !104}
!520 = !DISubprogram(name: "append", linkageName: "_ZN11xercesc_2_79XMLBuffer6appendEPKt", scope: !490, file: !491, line: 141, type: !521, scopeLine: 141, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!521 = !DISubroutineType(types: !522)
!522 = !{null, !507, !318}
!523 = !DISubprogram(name: "set", linkageName: "_ZN11xercesc_2_79XMLBuffer3setEPKtj", scope: !490, file: !491, line: 156, type: !518, scopeLine: 156, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!524 = !DISubprogram(name: "set", linkageName: "_ZN11xercesc_2_79XMLBuffer3setEPKt", scope: !490, file: !491, line: 162, type: !521, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!525 = !DISubprogram(name: "getRawBuffer", linkageName: "_ZNK11xercesc_2_79XMLBuffer12getRawBufferEv", scope: !490, file: !491, line: 168, type: !526, scopeLine: 168, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!526 = !DISubroutineType(types: !527)
!527 = !{!268, !528}
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!529 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !490)
!530 = !DISubprogram(name: "getRawBuffer", linkageName: "_ZN11xercesc_2_79XMLBuffer12getRawBufferEv", scope: !490, file: !491, line: 174, type: !531, scopeLine: 174, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!531 = !DISubroutineType(types: !532)
!532 = !{!503, !507}
!533 = !DISubprogram(name: "reset", linkageName: "_ZN11xercesc_2_79XMLBuffer5resetEv", scope: !490, file: !491, line: 180, type: !509, scopeLine: 180, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!534 = !DISubprogram(name: "getInUse", linkageName: "_ZNK11xercesc_2_79XMLBuffer8getInUseEv", scope: !490, file: !491, line: 189, type: !535, scopeLine: 189, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!535 = !DISubroutineType(types: !536)
!536 = !{!92, !528}
!537 = !DISubprogram(name: "getLen", linkageName: "_ZNK11xercesc_2_79XMLBuffer6getLenEv", scope: !490, file: !491, line: 194, type: !538, scopeLine: 194, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!538 = !DISubroutineType(types: !539)
!539 = !{!12, !528}
!540 = !DISubprogram(name: "isEmpty", linkageName: "_ZNK11xercesc_2_79XMLBuffer7isEmptyEv", scope: !490, file: !491, line: 199, type: !535, scopeLine: 199, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!541 = !DISubprogram(name: "setInUse", linkageName: "_ZN11xercesc_2_79XMLBuffer8setInUseEb", scope: !490, file: !491, line: 207, type: !542, scopeLine: 207, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!542 = !DISubroutineType(types: !543)
!543 = !{null, !507, !105}
!544 = !DISubprogram(name: "XMLBuffer", scope: !490, file: !491, line: 216, type: !545, scopeLine: 216, flags: DIFlagPrototyped, spFlags: 0)
!545 = !DISubroutineType(types: !546)
!546 = !{null, !507, !547}
!547 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !529, size: 64)
!548 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_79XMLBufferaSERKS0_", scope: !490, file: !491, line: 217, type: !549, scopeLine: 217, flags: DIFlagPrototyped, spFlags: 0)
!549 = !DISubroutineType(types: !550)
!550 = !{!489, !507, !547}
!551 = !DISubprogram(name: "insureCapacity", linkageName: "_ZN11xercesc_2_79XMLBuffer14insureCapacityEj", scope: !490, file: !491, line: 227, type: !552, scopeLine: 227, flags: DIFlagPrototyped, spFlags: 0)
!552 = !DISubroutineType(types: !553)
!553 = !{null, !507, !104}
!554 = !DISubprogram(name: "hasAllContent", linkageName: "_ZN11xercesc_2_715ContentSpecNode13hasAllContentEv", scope: !354, file: !355, line: 137, type: !555, scopeLine: 137, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!555 = !DISubroutineType(types: !556)
!556 = !{!92, !406}
!557 = !DISubprogram(name: "getMinTotalRange", linkageName: "_ZNK11xercesc_2_715ContentSpecNode16getMinTotalRangeEv", scope: !354, file: !355, line: 138, type: !461, scopeLine: 138, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!558 = !DISubprogram(name: "getMaxTotalRange", linkageName: "_ZNK11xercesc_2_715ContentSpecNode16getMaxTotalRangeEv", scope: !354, file: !355, line: 139, type: !461, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!559 = !DISubprogram(name: "createObject", linkageName: "_ZN11xercesc_2_715ContentSpecNode12createObjectEPNS_13MemoryManagerE", scope: !354, file: !355, line: 144, type: !560, scopeLine: 144, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!560 = !DISubroutineType(types: !561)
!561 = !{!562, !66}
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!563 = !DISubprogram(name: "isSerializable", linkageName: "_ZNK11xercesc_2_715ContentSpecNode14isSerializableEv", scope: !354, file: !355, line: 144, type: !465, scopeLine: 144, containingType: !354, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!564 = !DISubprogram(name: "getProtoType", linkageName: "_ZNK11xercesc_2_715ContentSpecNode12getProtoTypeEv", scope: !354, file: !355, line: 144, type: !565, scopeLine: 144, containingType: !354, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!565 = !DISubroutineType(types: !566)
!566 = !{!567, !438}
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!568 = !DISubprogram(name: "serialize", linkageName: "_ZN11xercesc_2_715ContentSpecNode9serializeERNS_16XSerializeEngineE", scope: !354, file: !355, line: 144, type: !569, scopeLine: 144, containingType: !354, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!569 = !DISubroutineType(types: !570)
!570 = !{null, !406, !571}
!571 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !572, size: 64)
!572 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "XSerializeEngine", scope: !6, file: !246, line: 42, size: 832, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !573, identifier: "_ZTSN11xercesc_2_716XSerializeEngineE")
!573 = !{!574, !575, !576, !579, !580, !582, !586, !590, !591, !593, !599, !600, !601, !602, !605, !609, !611, !615, !618, !621, !624, !627, !628, !633, !634, !637, !640, !643, !646, !650, !654, !660, !663, !667, !670, !673, !677, !680, !684, !689, !692, !695, !699, !702, !705, !709, !713, !716, !719, !722, !726, !729, !732, !735, !739, !742, !746, !750, !753, !757, !761, !765, !769, !772, !776, !780, !784, !788, !792, !796, !799, !800, !801, !802, !806, !807, !811, !814, !817, !818, !821, !822, !825, !826, !827, !828, !829, !830, !833, !834, !835, !836, !839, !842, !1259, !1262, !1263}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "toReadBufferLen", scope: !572, file: !246, line: 51, baseType: !105, flags: DIFlagPublic | DIFlagStaticMember)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "toWriteBufferLen", scope: !572, file: !246, line: 301, baseType: !105, flags: DIFlagPublic | DIFlagStaticMember)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "fStoreLoad", scope: !572, file: !246, line: 695, baseType: !577, size: 16)
!577 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !578)
!578 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "fStorerLevel", scope: !572, file: !246, line: 696, baseType: !578, size: 16, offset: 16)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "fGrammarPool", scope: !572, file: !246, line: 698, baseType: !581, size: 64, offset: 64)
!581 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !244)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "fInputStream", scope: !572, file: !246, line: 699, baseType: !583, size: 64, offset: 128)
!583 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !584)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DICompositeType(tag: DW_TAG_class_type, name: "BinInputStream", scope: !6, file: !246, line: 37, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_714BinInputStreamE")
!586 = !DIDerivedType(tag: DW_TAG_member, name: "fOutputStream", scope: !572, file: !246, line: 700, baseType: !587, size: 64, offset: 192)
!587 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !588)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DICompositeType(tag: DW_TAG_class_type, name: "BinOutputStream", scope: !6, file: !246, line: 36, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_715BinOutputStreamE")
!590 = !DIDerivedType(tag: DW_TAG_member, name: "fBufCount", scope: !572, file: !246, line: 702, baseType: !62, size: 64, offset: 256)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "fBufSize", scope: !572, file: !246, line: 705, baseType: !592, size: 64, offset: 320)
!592 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "fBufStart", scope: !572, file: !246, line: 706, baseType: !594, size: 64, offset: 384)
!594 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !595)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMLByte", file: !597, line: 384, baseType: !598)
!597 = !DIFile(filename: "./xercesc/util/XercesDefs.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!598 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "fBufEnd", scope: !572, file: !246, line: 707, baseType: !594, size: 64, offset: 448)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "fBufCur", scope: !572, file: !246, line: 708, baseType: !595, size: 64, offset: 512)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "fBufLoadMax", scope: !572, file: !246, line: 709, baseType: !595, size: 64, offset: 576)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "fStorePool", scope: !572, file: !246, line: 722, baseType: !603, size: 64, offset: 640)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DICompositeType(tag: DW_TAG_class_type, name: "RefHashTableOf<xercesc_2_7::XSerializedObjectId>", scope: !6, file: !230, line: 72, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_714RefHashTableOfINS_19XSerializedObjectIdEEE")
!605 = !DIDerivedType(tag: DW_TAG_member, name: "fLoadPool", scope: !572, file: !246, line: 731, baseType: !606, size: 64, offset: 704)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DICompositeType(tag: DW_TAG_class_type, name: "ValueVectorOf<void *>", scope: !6, file: !608, line: 32, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_713ValueVectorOfIPvEE")
!608 = !DIFile(filename: "./xercesc/util/ValueVectorOf.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!609 = !DIDerivedType(tag: DW_TAG_member, name: "fObjectCount", scope: !572, file: !246, line: 736, baseType: !610, size: 32, offset: 768)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "XSerializedObjectId_t", scope: !572, file: !246, line: 53, baseType: !12)
!611 = !DISubprogram(name: "~XSerializeEngine", scope: !572, file: !246, line: 60, type: !612, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!612 = !DISubroutineType(types: !613)
!613 = !{null, !614}
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!615 = !DISubprogram(name: "XSerializeEngine", scope: !572, file: !246, line: 76, type: !616, scopeLine: 76, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!616 = !DISubroutineType(types: !617)
!617 = !{null, !614, !584, !581, !62}
!618 = !DISubprogram(name: "XSerializeEngine", scope: !572, file: !246, line: 95, type: !619, scopeLine: 95, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!619 = !DISubroutineType(types: !620)
!620 = !{null, !614, !588, !581, !62}
!621 = !DISubprogram(name: "XSerializeEngine", scope: !572, file: !246, line: 116, type: !622, scopeLine: 116, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!622 = !DISubroutineType(types: !623)
!623 = !{null, !614, !584, !106, !62}
!624 = !DISubprogram(name: "XSerializeEngine", scope: !572, file: !246, line: 137, type: !625, scopeLine: 137, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!625 = !DISubroutineType(types: !626)
!626 = !{null, !614, !588, !106, !62}
!627 = !DISubprogram(name: "flush", linkageName: "_ZN11xercesc_2_716XSerializeEngine5flushEv", scope: !572, file: !246, line: 148, type: !612, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!628 = !DISubprogram(name: "isStoring", linkageName: "_ZNK11xercesc_2_716XSerializeEngine9isStoringEv", scope: !572, file: !246, line: 158, type: !629, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!629 = !DISubroutineType(types: !630)
!630 = !{!92, !631}
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!632 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !572)
!633 = !DISubprogram(name: "isLoading", linkageName: "_ZNK11xercesc_2_716XSerializeEngine9isLoadingEv", scope: !572, file: !246, line: 168, type: !629, scopeLine: 168, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!634 = !DISubprogram(name: "getGrammarPool", linkageName: "_ZNK11xercesc_2_716XSerializeEngine14getGrammarPoolEv", scope: !572, file: !246, line: 177, type: !635, scopeLine: 177, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!635 = !DISubroutineType(types: !636)
!636 = !{!244, !631}
!637 = !DISubprogram(name: "getStringPool", linkageName: "_ZNK11xercesc_2_716XSerializeEngine13getStringPoolEv", scope: !572, file: !246, line: 186, type: !638, scopeLine: 186, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!638 = !DISubroutineType(types: !639)
!639 = !{!220, !631}
!640 = !DISubprogram(name: "getMemoryManager", linkageName: "_ZNK11xercesc_2_716XSerializeEngine16getMemoryManagerEv", scope: !572, file: !246, line: 195, type: !641, scopeLine: 195, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!641 = !DISubroutineType(types: !642)
!642 = !{!66, !631}
!643 = !DISubprogram(name: "getStorerLevel", linkageName: "_ZNK11xercesc_2_716XSerializeEngine14getStorerLevelEv", scope: !572, file: !246, line: 209, type: !644, scopeLine: 209, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!644 = !DISubroutineType(types: !645)
!645 = !{!98, !631}
!646 = !DISubprogram(name: "write", linkageName: "_ZN11xercesc_2_716XSerializeEngine5writeEPNS_13XSerializableE", scope: !572, file: !246, line: 221, type: !647, scopeLine: 221, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!647 = !DISubroutineType(types: !648)
!648 = !{null, !614, !649}
!649 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !562)
!650 = !DISubprogram(name: "write", linkageName: "_ZN11xercesc_2_716XSerializeEngine5writeEPNS_10XProtoTypeE", scope: !572, file: !246, line: 233, type: !651, scopeLine: 233, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!651 = !DISubroutineType(types: !652)
!652 = !{null, !614, !653}
!653 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !567)
!654 = !DISubprogram(name: "write", linkageName: "_ZN11xercesc_2_716XSerializeEngine5writeEPKhi", scope: !572, file: !246, line: 246, type: !655, scopeLine: 246, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!655 = !DISubroutineType(types: !656)
!656 = !{null, !614, !657, !90}
!657 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !658)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !596)
!660 = !DISubprogram(name: "write", linkageName: "_ZN11xercesc_2_716XSerializeEngine5writeEPKti", scope: !572, file: !246, line: 260, type: !661, scopeLine: 260, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!661 = !DISubroutineType(types: !662)
!662 = !{null, !614, !318, !90}
!663 = !DISubprogram(name: "writeString", linkageName: "_ZN11xercesc_2_716XSerializeEngine11writeStringEPKtib", scope: !572, file: !246, line: 278, type: !664, scopeLine: 278, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!664 = !DISubroutineType(types: !665)
!665 = !{null, !614, !318, !666, !92}
!666 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !90)
!667 = !DISubprogram(name: "writeString", linkageName: "_ZN11xercesc_2_716XSerializeEngine11writeStringEPKhib", scope: !572, file: !246, line: 297, type: !668, scopeLine: 297, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!668 = !DISubroutineType(types: !669)
!669 = !{null, !614, !657, !666, !92}
!670 = !DISubprogram(name: "read", linkageName: "_ZN11xercesc_2_716XSerializeEngine4readEPNS_10XProtoTypeE", scope: !572, file: !246, line: 313, type: !671, scopeLine: 313, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!671 = !DISubroutineType(types: !672)
!672 = !{!562, !614, !653}
!673 = !DISubprogram(name: "read", linkageName: "_ZN11xercesc_2_716XSerializeEngine4readEPNS_10XProtoTypeEPj", scope: !572, file: !246, line: 328, type: !674, scopeLine: 328, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!674 = !DISubroutineType(types: !675)
!675 = !{!92, !614, !653, !676}
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!677 = !DISubprogram(name: "read", linkageName: "_ZN11xercesc_2_716XSerializeEngine4readEPhi", scope: !572, file: !246, line: 342, type: !678, scopeLine: 342, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!678 = !DISubroutineType(types: !679)
!679 = !{null, !614, !594, !90}
!680 = !DISubprogram(name: "read", linkageName: "_ZN11xercesc_2_716XSerializeEngine4readEPti", scope: !572, file: !246, line: 356, type: !681, scopeLine: 356, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!681 = !DISubroutineType(types: !682)
!682 = !{null, !614, !683, !90}
!683 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !503)
!684 = !DISubprogram(name: "readString", linkageName: "_ZN11xercesc_2_716XSerializeEngine10readStringERPtRiS3_b", scope: !572, file: !246, line: 375, type: !685, scopeLine: 375, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!685 = !DISubroutineType(types: !686)
!686 = !{null, !614, !687, !688, !688, !92}
!687 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !503, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !90, size: 64)
!689 = !DISubprogram(name: "readString", linkageName: "_ZN11xercesc_2_716XSerializeEngine10readStringERPtRi", scope: !572, file: !246, line: 394, type: !690, scopeLine: 394, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!690 = !DISubroutineType(types: !691)
!691 = !{null, !614, !687, !688}
!692 = !DISubprogram(name: "readString", linkageName: "_ZN11xercesc_2_716XSerializeEngine10readStringERPt", scope: !572, file: !246, line: 407, type: !693, scopeLine: 407, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!693 = !DISubroutineType(types: !694)
!694 = !{null, !614, !687}
!695 = !DISubprogram(name: "readString", linkageName: "_ZN11xercesc_2_716XSerializeEngine10readStringERPhRiS3_b", scope: !572, file: !246, line: 425, type: !696, scopeLine: 425, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!696 = !DISubroutineType(types: !697)
!697 = !{null, !614, !698, !688, !688, !92}
!698 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !595, size: 64)
!699 = !DISubprogram(name: "readString", linkageName: "_ZN11xercesc_2_716XSerializeEngine10readStringERPhRi", scope: !572, file: !246, line: 445, type: !700, scopeLine: 445, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!700 = !DISubroutineType(types: !701)
!701 = !{null, !614, !698, !688}
!702 = !DISubprogram(name: "readString", linkageName: "_ZN11xercesc_2_716XSerializeEngine10readStringERPh", scope: !572, file: !246, line: 464, type: !703, scopeLine: 464, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!703 = !DISubroutineType(types: !704)
!704 = !{null, !614, !698}
!705 = !DISubprogram(name: "needToStoreObject", linkageName: "_ZN11xercesc_2_716XSerializeEngine17needToStoreObjectEPv", scope: !572, file: !246, line: 477, type: !706, scopeLine: 477, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!706 = !DISubroutineType(types: !707)
!707 = !{!92, !614, !708}
!708 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !59)
!709 = !DISubprogram(name: "needToLoadObject", linkageName: "_ZN11xercesc_2_716XSerializeEngine16needToLoadObjectEPPv", scope: !572, file: !246, line: 490, type: !710, scopeLine: 490, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!710 = !DISubroutineType(types: !711)
!711 = !{!92, !614, !712}
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!713 = !DISubprogram(name: "registerObject", linkageName: "_ZN11xercesc_2_716XSerializeEngine14registerObjectEPv", scope: !572, file: !246, line: 504, type: !714, scopeLine: 504, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!714 = !DISubroutineType(types: !715)
!715 = !{null, !614, !708}
!716 = !DISubprogram(name: "operator<<", linkageName: "_ZN11xercesc_2_716XSerializeEnginelsEh", scope: !572, file: !246, line: 522, type: !717, scopeLine: 522, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!717 = !DISubroutineType(types: !718)
!718 = !{!571, !614, !596}
!719 = !DISubprogram(name: "operator<<", linkageName: "_ZN11xercesc_2_716XSerializeEnginelsEt", scope: !572, file: !246, line: 523, type: !720, scopeLine: 523, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!720 = !DISubroutineType(types: !721)
!721 = !{!571, !614, !270}
!722 = !DISubprogram(name: "operator<<", linkageName: "_ZN11xercesc_2_716XSerializeEnginelsEc", scope: !572, file: !246, line: 525, type: !723, scopeLine: 525, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!723 = !DISubroutineType(types: !724)
!724 = !{!571, !614, !725}
!725 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!726 = !DISubprogram(name: "operator<<", linkageName: "_ZN11xercesc_2_716XSerializeEnginelsEs", scope: !572, file: !246, line: 526, type: !727, scopeLine: 526, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!727 = !DISubroutineType(types: !728)
!728 = !{!571, !614, !578}
!729 = !DISubprogram(name: "operator<<", linkageName: "_ZN11xercesc_2_716XSerializeEnginelsEi", scope: !572, file: !246, line: 527, type: !730, scopeLine: 527, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!730 = !DISubroutineType(types: !731)
!731 = !{!571, !614, !90}
!732 = !DISubprogram(name: "operator<<", linkageName: "_ZN11xercesc_2_716XSerializeEnginelsEj", scope: !572, file: !246, line: 528, type: !733, scopeLine: 528, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!733 = !DISubroutineType(types: !734)
!734 = !{!571, !614, !12}
!735 = !DISubprogram(name: "operator<<", linkageName: "_ZN11xercesc_2_716XSerializeEnginelsEl", scope: !572, file: !246, line: 529, type: !736, scopeLine: 529, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!736 = !DISubroutineType(types: !737)
!737 = !{!571, !614, !738}
!738 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!739 = !DISubprogram(name: "operator<<", linkageName: "_ZN11xercesc_2_716XSerializeEnginelsEm", scope: !572, file: !246, line: 530, type: !740, scopeLine: 530, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!740 = !DISubroutineType(types: !741)
!741 = !{!571, !614, !62}
!742 = !DISubprogram(name: "operator<<", linkageName: "_ZN11xercesc_2_716XSerializeEnginelsEf", scope: !572, file: !246, line: 531, type: !743, scopeLine: 531, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!743 = !DISubroutineType(types: !744)
!744 = !{!571, !614, !745}
!745 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!746 = !DISubprogram(name: "operator<<", linkageName: "_ZN11xercesc_2_716XSerializeEnginelsEd", scope: !572, file: !246, line: 532, type: !747, scopeLine: 532, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!747 = !DISubroutineType(types: !748)
!748 = !{!571, !614, !749}
!749 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!750 = !DISubprogram(name: "operator<<", linkageName: "_ZN11xercesc_2_716XSerializeEnginelsEb", scope: !572, file: !246, line: 533, type: !751, scopeLine: 533, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!751 = !DISubroutineType(types: !752)
!752 = !{!571, !614, !92}
!753 = !DISubprogram(name: "operator>>", linkageName: "_ZN11xercesc_2_716XSerializeEnginersERh", scope: !572, file: !246, line: 542, type: !754, scopeLine: 542, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!754 = !DISubroutineType(types: !755)
!755 = !{!571, !614, !756}
!756 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !596, size: 64)
!757 = !DISubprogram(name: "operator>>", linkageName: "_ZN11xercesc_2_716XSerializeEnginersERt", scope: !572, file: !246, line: 543, type: !758, scopeLine: 543, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!758 = !DISubroutineType(types: !759)
!759 = !{!571, !614, !760}
!760 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !270, size: 64)
!761 = !DISubprogram(name: "operator>>", linkageName: "_ZN11xercesc_2_716XSerializeEnginersERc", scope: !572, file: !246, line: 545, type: !762, scopeLine: 545, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!762 = !DISubroutineType(types: !763)
!763 = !{!571, !614, !764}
!764 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !725, size: 64)
!765 = !DISubprogram(name: "operator>>", linkageName: "_ZN11xercesc_2_716XSerializeEnginersERs", scope: !572, file: !246, line: 546, type: !766, scopeLine: 546, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!766 = !DISubroutineType(types: !767)
!767 = !{!571, !614, !768}
!768 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !578, size: 64)
!769 = !DISubprogram(name: "operator>>", linkageName: "_ZN11xercesc_2_716XSerializeEnginersERi", scope: !572, file: !246, line: 547, type: !770, scopeLine: 547, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!770 = !DISubroutineType(types: !771)
!771 = !{!571, !614, !688}
!772 = !DISubprogram(name: "operator>>", linkageName: "_ZN11xercesc_2_716XSerializeEnginersERj", scope: !572, file: !246, line: 548, type: !773, scopeLine: 548, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!773 = !DISubroutineType(types: !774)
!774 = !{!571, !614, !775}
!775 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !12, size: 64)
!776 = !DISubprogram(name: "operator>>", linkageName: "_ZN11xercesc_2_716XSerializeEnginersERl", scope: !572, file: !246, line: 549, type: !777, scopeLine: 549, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!777 = !DISubroutineType(types: !778)
!778 = !{!571, !614, !779}
!779 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !738, size: 64)
!780 = !DISubprogram(name: "operator>>", linkageName: "_ZN11xercesc_2_716XSerializeEnginersERm", scope: !572, file: !246, line: 550, type: !781, scopeLine: 550, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!781 = !DISubroutineType(types: !782)
!782 = !{!571, !614, !783}
!783 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !62, size: 64)
!784 = !DISubprogram(name: "operator>>", linkageName: "_ZN11xercesc_2_716XSerializeEnginersERf", scope: !572, file: !246, line: 551, type: !785, scopeLine: 551, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!785 = !DISubroutineType(types: !786)
!786 = !{!571, !614, !787}
!787 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !745, size: 64)
!788 = !DISubprogram(name: "operator>>", linkageName: "_ZN11xercesc_2_716XSerializeEnginersERd", scope: !572, file: !246, line: 552, type: !789, scopeLine: 552, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!789 = !DISubroutineType(types: !790)
!790 = !{!571, !614, !791}
!791 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !749, size: 64)
!792 = !DISubprogram(name: "operator>>", linkageName: "_ZN11xercesc_2_716XSerializeEnginersERb", scope: !572, file: !246, line: 553, type: !793, scopeLine: 553, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!793 = !DISubroutineType(types: !794)
!794 = !{!571, !614, !795}
!795 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !92, size: 64)
!796 = !DISubprogram(name: "getBufSize", linkageName: "_ZNK11xercesc_2_716XSerializeEngine10getBufSizeEv", scope: !572, file: !246, line: 561, type: !797, scopeLine: 561, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!797 = !DISubroutineType(types: !798)
!798 = !{!62, !631}
!799 = !DISubprogram(name: "getBufCur", linkageName: "_ZNK11xercesc_2_716XSerializeEngine9getBufCurEv", scope: !572, file: !246, line: 564, type: !797, scopeLine: 564, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!800 = !DISubprogram(name: "getBufCurAccumulated", linkageName: "_ZNK11xercesc_2_716XSerializeEngine20getBufCurAccumulatedEv", scope: !572, file: !246, line: 567, type: !797, scopeLine: 567, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!801 = !DISubprogram(name: "getBufCount", linkageName: "_ZNK11xercesc_2_716XSerializeEngine11getBufCountEv", scope: !572, file: !246, line: 570, type: !797, scopeLine: 570, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!802 = !DISubprogram(name: "trace", linkageName: "_ZNK11xercesc_2_716XSerializeEngine5traceEPc", scope: !572, file: !246, line: 572, type: !803, scopeLine: 572, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!803 = !DISubroutineType(types: !804)
!804 = !{null, !631, !805}
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!806 = !DISubprogram(name: "XSerializeEngine", scope: !572, file: !246, line: 578, type: !612, scopeLine: 578, flags: DIFlagPrototyped, spFlags: 0)
!807 = !DISubprogram(name: "XSerializeEngine", scope: !572, file: !246, line: 579, type: !808, scopeLine: 579, flags: DIFlagPrototyped, spFlags: 0)
!808 = !DISubroutineType(types: !809)
!809 = !{null, !614, !810}
!810 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !632, size: 64)
!811 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_716XSerializeEngineaSERKS0_", scope: !572, file: !246, line: 580, type: !812, scopeLine: 580, flags: DIFlagPrototyped, spFlags: 0)
!812 = !DISubroutineType(types: !813)
!813 = !{!571, !614, !810}
!814 = !DISubprogram(name: "lookupStorePool", linkageName: "_ZNK11xercesc_2_716XSerializeEngine15lookupStorePoolEPv", scope: !572, file: !246, line: 587, type: !815, scopeLine: 587, flags: DIFlagPrototyped, spFlags: 0)
!815 = !DISubroutineType(types: !816)
!816 = !{!610, !631, !708}
!817 = !DISubprogram(name: "addStorePool", linkageName: "_ZN11xercesc_2_716XSerializeEngine12addStorePoolEPv", scope: !572, file: !246, line: 588, type: !714, scopeLine: 588, flags: DIFlagPrototyped, spFlags: 0)
!818 = !DISubprogram(name: "lookupLoadPool", linkageName: "_ZNK11xercesc_2_716XSerializeEngine14lookupLoadPoolEj", scope: !572, file: !246, line: 595, type: !819, scopeLine: 595, flags: DIFlagPrototyped, spFlags: 0)
!819 = !DISubroutineType(types: !820)
!820 = !{!562, !631, !610}
!821 = !DISubprogram(name: "addLoadPool", linkageName: "_ZN11xercesc_2_716XSerializeEngine11addLoadPoolEPv", scope: !572, file: !246, line: 596, type: !714, scopeLine: 596, flags: DIFlagPrototyped, spFlags: 0)
!822 = !DISubprogram(name: "checkAndFillBuffer", linkageName: "_ZN11xercesc_2_716XSerializeEngine18checkAndFillBufferEi", scope: !572, file: !246, line: 603, type: !823, scopeLine: 603, flags: DIFlagPrototyped, spFlags: 0)
!823 = !DISubroutineType(types: !824)
!824 = !{null, !614, !90}
!825 = !DISubprogram(name: "checkAndFlushBuffer", linkageName: "_ZN11xercesc_2_716XSerializeEngine19checkAndFlushBufferEi", scope: !572, file: !246, line: 605, type: !823, scopeLine: 605, flags: DIFlagPrototyped, spFlags: 0)
!826 = !DISubprogram(name: "fillBuffer", linkageName: "_ZN11xercesc_2_716XSerializeEngine10fillBufferEv", scope: !572, file: !246, line: 607, type: !612, scopeLine: 607, flags: DIFlagPrototyped, spFlags: 0)
!827 = !DISubprogram(name: "flushBuffer", linkageName: "_ZN11xercesc_2_716XSerializeEngine11flushBufferEv", scope: !572, file: !246, line: 609, type: !612, scopeLine: 609, flags: DIFlagPrototyped, spFlags: 0)
!828 = !DISubprogram(name: "pumpCount", linkageName: "_ZN11xercesc_2_716XSerializeEngine9pumpCountEv", scope: !572, file: !246, line: 611, type: !612, scopeLine: 611, flags: DIFlagPrototyped, spFlags: 0)
!829 = !DISubprogram(name: "resetBuffer", linkageName: "_ZN11xercesc_2_716XSerializeEngine11resetBufferEv", scope: !572, file: !246, line: 613, type: !612, scopeLine: 613, flags: DIFlagPrototyped, spFlags: 0)
!830 = !DISubprogram(name: "ensureStoring", linkageName: "_ZNK11xercesc_2_716XSerializeEngine13ensureStoringEv", scope: !572, file: !246, line: 620, type: !831, scopeLine: 620, flags: DIFlagPrototyped, spFlags: 0)
!831 = !DISubroutineType(types: !832)
!832 = !{null, !631}
!833 = !DISubprogram(name: "ensureLoading", linkageName: "_ZNK11xercesc_2_716XSerializeEngine13ensureLoadingEv", scope: !572, file: !246, line: 622, type: !831, scopeLine: 622, flags: DIFlagPrototyped, spFlags: 0)
!834 = !DISubprogram(name: "ensureStoreBuffer", linkageName: "_ZNK11xercesc_2_716XSerializeEngine17ensureStoreBufferEv", scope: !572, file: !246, line: 624, type: !831, scopeLine: 624, flags: DIFlagPrototyped, spFlags: 0)
!835 = !DISubprogram(name: "ensureLoadBuffer", linkageName: "_ZNK11xercesc_2_716XSerializeEngine16ensureLoadBufferEv", scope: !572, file: !246, line: 626, type: !831, scopeLine: 626, flags: DIFlagPrototyped, spFlags: 0)
!836 = !DISubprogram(name: "ensurePointer", linkageName: "_ZNK11xercesc_2_716XSerializeEngine13ensurePointerEPv", scope: !572, file: !246, line: 628, type: !837, scopeLine: 628, flags: DIFlagPrototyped, spFlags: 0)
!837 = !DISubroutineType(types: !838)
!838 = !{null, !631, !708}
!839 = !DISubprogram(name: "ensureBufferLen", linkageName: "_ZNK11xercesc_2_716XSerializeEngine15ensureBufferLenEi", scope: !572, file: !246, line: 630, type: !840, scopeLine: 630, flags: DIFlagPrototyped, spFlags: 0)
!840 = !DISubroutineType(types: !841)
!841 = !{null, !631, !90}
!842 = !DISubprogram(name: "Assert", linkageName: "_ZNK11xercesc_2_716XSerializeEngine6AssertEbNS_10XMLExcepts5CodesE", scope: !572, file: !246, line: 632, type: !843, scopeLine: 632, flags: DIFlagPrototyped, spFlags: 0)
!843 = !DISubroutineType(types: !844)
!844 = !{null, !631, !92, !845}
!845 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !846)
!846 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Codes", scope: !848, file: !847, line: 14, baseType: !12, size: 32, elements: !854, identifier: "_ZTSN11xercesc_2_710XMLExcepts5CodesE")
!847 = !DIFile(filename: "./xercesc/util/XMLExceptMsgs.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!848 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "XMLExcepts", scope: !6, file: !847, line: 11, size: 8, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !849, identifier: "_ZTSN11xercesc_2_710XMLExceptsE")
!849 = !{!850}
!850 = !DISubprogram(name: "XMLExcepts", scope: !848, file: !847, line: 427, type: !851, scopeLine: 427, flags: DIFlagPrototyped, spFlags: 0)
!851 = !DISubroutineType(types: !852)
!852 = !{null, !853}
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!854 = !{!855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258}
!855 = !DIEnumerator(name: "NoError", value: 0, isUnsigned: true)
!856 = !DIEnumerator(name: "W_LowBounds", value: 1, isUnsigned: true)
!857 = !DIEnumerator(name: "Scan_CouldNotOpenSource_Warning", value: 2, isUnsigned: true)
!858 = !DIEnumerator(name: "GC_ExistingGrammar", value: 3, isUnsigned: true)
!859 = !DIEnumerator(name: "W_HighBounds", value: 4, isUnsigned: true)
!860 = !DIEnumerator(name: "F_LowBounds", value: 5, isUnsigned: true)
!861 = !DIEnumerator(name: "Array_BadIndex", value: 6, isUnsigned: true)
!862 = !DIEnumerator(name: "Array_BadNewSize", value: 7, isUnsigned: true)
!863 = !DIEnumerator(name: "AttrList_BadIndex", value: 8, isUnsigned: true)
!864 = !DIEnumerator(name: "AttDef_BadAttType", value: 9, isUnsigned: true)
!865 = !DIEnumerator(name: "AttDef_BadDefAttType", value: 10, isUnsigned: true)
!866 = !DIEnumerator(name: "Bitset_BadIndex", value: 11, isUnsigned: true)
!867 = !DIEnumerator(name: "Bitset_NotEqualSize", value: 12, isUnsigned: true)
!868 = !DIEnumerator(name: "BufMgr_NoMoreBuffers", value: 13, isUnsigned: true)
!869 = !DIEnumerator(name: "BufMgr_BufferNotInPool", value: 14, isUnsigned: true)
!870 = !DIEnumerator(name: "CPtr_PointerIsZero", value: 15, isUnsigned: true)
!871 = !DIEnumerator(name: "CM_BinOpHadUnaryType", value: 16, isUnsigned: true)
!872 = !DIEnumerator(name: "CM_MustBeMixedOrChildren", value: 17, isUnsigned: true)
!873 = !DIEnumerator(name: "CM_NoPCDATAHere", value: 18, isUnsigned: true)
!874 = !DIEnumerator(name: "CM_NotValidForSpecType", value: 19, isUnsigned: true)
!875 = !DIEnumerator(name: "CM_UnaryOpHadBinType", value: 20, isUnsigned: true)
!876 = !DIEnumerator(name: "CM_UnknownCMType", value: 21, isUnsigned: true)
!877 = !DIEnumerator(name: "CM_UnknownCMSpecType", value: 22, isUnsigned: true)
!878 = !DIEnumerator(name: "CM_NoParentCSN", value: 23, isUnsigned: true)
!879 = !DIEnumerator(name: "CM_NotValidSpecTypeForNode", value: 24, isUnsigned: true)
!880 = !DIEnumerator(name: "DTD_UnknownCreateReason", value: 25, isUnsigned: true)
!881 = !DIEnumerator(name: "ElemStack_EmptyStack", value: 26, isUnsigned: true)
!882 = !DIEnumerator(name: "ElemStack_BadIndex", value: 27, isUnsigned: true)
!883 = !DIEnumerator(name: "ElemStack_StackUnderflow", value: 28, isUnsigned: true)
!884 = !DIEnumerator(name: "ElemStack_NoParentPushed", value: 29, isUnsigned: true)
!885 = !DIEnumerator(name: "Enum_NoMoreElements", value: 30, isUnsigned: true)
!886 = !DIEnumerator(name: "File_CouldNotOpenFile", value: 31, isUnsigned: true)
!887 = !DIEnumerator(name: "File_CouldNotGetCurPos", value: 32, isUnsigned: true)
!888 = !DIEnumerator(name: "File_CouldNotCloseFile", value: 33, isUnsigned: true)
!889 = !DIEnumerator(name: "File_CouldNotSeekToEnd", value: 34, isUnsigned: true)
!890 = !DIEnumerator(name: "File_CouldNotSeekToPos", value: 35, isUnsigned: true)
!891 = !DIEnumerator(name: "File_CouldNotDupHandle", value: 36, isUnsigned: true)
