; ModuleID = 'DTDValidator.cpp'
source_filename = "DTDValidator.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"class.xercesc_2_7::NameIdPool.8" = type <{ %"class.xercesc_2_7::MemoryManager"*, %"struct.xercesc_2_7::NameIdPoolBucketElem.9"**, %"class.xercesc_2_7::DTDEntityDecl"**, i32, i32, i32, [4 x i8] }>
%"class.xercesc_2_7::MemoryManager" = type { i32 (...)** }
%"struct.xercesc_2_7::NameIdPoolBucketElem.9" = type { %"class.xercesc_2_7::DTDEntityDecl"*, %"struct.xercesc_2_7::NameIdPoolBucketElem.9"* }
%"class.xercesc_2_7::DTDEntityDecl" = type <{ %"class.xercesc_2_7::XMLEntityDecl", i8, i8, i8, [5 x i8] }>
%"class.xercesc_2_7::XMLEntityDecl" = type { %"class.xercesc_2_7::XSerializable", i32, i32, i16*, i16*, i16*, i16*, i16*, i16*, %"class.xercesc_2_7::MemoryManager"* }
%"class.xercesc_2_7::XSerializable" = type { i32 (...)** }
%"class.xercesc_2_7::DTDValidator" = type { %"class.xercesc_2_7::XMLValidator", %"class.xercesc_2_7::DTDGrammar"* }
%"class.xercesc_2_7::XMLValidator" = type { i32 (...)**, %"class.xercesc_2_7::XMLBufferMgr"*, %"class.xercesc_2_7::XMLErrorReporter"*, %"class.xercesc_2_7::ReaderMgr"*, %"class.xercesc_2_7::XMLScanner"* }
%"class.xercesc_2_7::XMLBufferMgr" = type { i32, %"class.xercesc_2_7::MemoryManager"*, %"class.xercesc_2_7::XMLBuffer"** }

!1020 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_713XMLRecognizeraSERKS0_", scope: !963, file: !962, line: 142, type: !1021, scopeLine: 142, flags: DIFlagPrototyped, spFlags: 0)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!1023, !1013, !1018}
!1023 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !963, size: 64)
!1024 = !{!1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038}
!1025 = !DIEnumerator(name: "EBCDIC", value: 0, isUnsigned: true)
!1026 = !DIEnumerator(name: "UCS_4B", value: 1, isUnsigned: true)
!1027 = !DIEnumerator(name: "UCS_4L", value: 2, isUnsigned: true)
!1028 = !DIEnumerator(name: "US_ASCII", value: 3, isUnsigned: true)
!1029 = !DIEnumerator(name: "UTF_8", value: 4, isUnsigned: true)
!1030 = !DIEnumerator(name: "UTF_16B", value: 5, isUnsigned: true)
!1031 = !DIEnumerator(name: "UTF_16L", value: 6, isUnsigned: true)
!1032 = !DIEnumerator(name: "XERCES_XMLCH", value: 7, isUnsigned: true)
!1033 = !DIEnumerator(name: "Encodings_Count", value: 8, isUnsigned: true)
!1034 = !DIEnumerator(name: "Encodings_Min", value: 0, isUnsigned: true)
!1035 = !DIEnumerator(name: "Encodings_Max", value: 7, isUnsigned: true)
!1036 = !DIEnumerator(name: "OtherEncoding", value: 999, isUnsigned: true)
!1037 = !DIEnumerator(name: "Def_UTF16", value: 6, isUnsigned: true)
!1038 = !DIEnumerator(name: "Def_UCS4", value: 2, isUnsigned: true)
!1039 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RefFrom", scope: !1041, file: !1040, line: 70, baseType: !12, size: 32, elements: !1342, identifier: "_ZTSN11xercesc_2_79XMLReader7RefFromE")
!1040 = !DIFile(filename: "./xercesc/internal/XMLReader.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!1041 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "XMLReader", scope: !6, file: !1040, line: 52, size: 1311936, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !1042, identifier: "_ZTSN11xercesc_2_79XMLReaderE")
!1042 = !{!1043, !1073, !1074, !1078, !1079, !1081, !1083, !1086, !1087, !1088, !1090, !1091, !1092, !1093, !1094, !1098, !1099, !1100, !1101, !1102, !1107, !1108, !1109, !1110, !1111, !1114, !1115, !1116, !1119, !1124, !1126, !1127, !1133, !1134, !1139, !1140, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1163, !1166, !1169, !1172, !1175, !1178, !1245, !1249, !1253, !1256, !1259, !1262, !1265, !1266, !1267, !1271, !1274, !1275, !1278, !1279, !1282, !1285, !1286, !1289, !1290, !1293, !1296, !1299, !1300, !1301, !1302, !1305, !1306, !1309, !1312, !1315, !1319, !1323, !1324, !1325, !1326, !1329, !1330, !1333, !1339}
!1043 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !1041, baseType: !1044, flags: DIFlagPublic, extraData: i32 0)
!1044 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "XMemory", scope: !6, file: !1045, line: 40, size: 8, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !1046, identifier: "_ZTSN11xercesc_2_77XMemoryE")
!1045 = !DIFile(filename: "./xercesc/util/XMemory.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!1046 = !{!1047, !1054, !1057, !1060, !1063, !1066, !1069}
!1047 = !DISubprogram(name: "operator new", linkageName: "_ZN11xercesc_2_77XMemorynwEm", scope: !1044, file: !1045, line: 54, type: !1048, scopeLine: 54, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{!1050, !1051}
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1052, line: 46, baseType: !1053)
!1052 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!1053 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1054 = !DISubprogram(name: "operator new", linkageName: "_ZN11xercesc_2_77XMemorynwEmPNS_13MemoryManagerE", scope: !1044, file: !1045, line: 82, type: !1055, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!1050, !1051, !1007}
!1057 = !DISubprogram(name: "operator new", linkageName: "_ZN11xercesc_2_77XMemorynwEmPv", scope: !1044, file: !1045, line: 90, type: !1058, scopeLine: 90, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{!1050, !1051, !1050}
!1060 = !DISubprogram(name: "operator delete", linkageName: "_ZN11xercesc_2_77XMemorydlEPv", scope: !1044, file: !1045, line: 97, type: !1061, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{null, !1050}
!1063 = !DISubprogram(name: "operator delete", linkageName: "_ZN11xercesc_2_77XMemorydlEPvPNS_13MemoryManagerE", scope: !1044, file: !1045, line: 107, type: !1064, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!1064 = !DISubroutineType(types: !1065)
!1065 = !{null, !1050, !1007}
!1066 = !DISubprogram(name: "operator delete", linkageName: "_ZN11xercesc_2_77XMemorydlEPvS1_", scope: !1044, file: !1045, line: 115, type: !1067, scopeLine: 115, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{null, !1050, !1050}
!1069 = !DISubprogram(name: "XMemory", scope: !1044, file: !1045, line: 130, type: !1070, scopeLine: 130, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!1070 = !DISubroutineType(types: !1071)
!1071 = !{null, !1072}
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "fCharIndex", scope: !1041, file: !1040, line: 427, baseType: !12, size: 32)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "fCharBuf", scope: !1041, file: !1040, line: 428, baseType: !1075, size: 262144, offset: 32)
!1075 = !DICompositeType(tag: DW_TAG_array_type, baseType: !999, size: 262144, elements: !1076)
!1076 = !{!1077}
!1077 = !DISubrange(count: 16384)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "fCharsAvail", scope: !1041, file: !1040, line: 429, baseType: !12, size: 32, offset: 262176)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "fCharSizeBuf", scope: !1041, file: !1040, line: 430, baseType: !1080, size: 131072, offset: 262208)
!1080 = !DICompositeType(tag: DW_TAG_array_type, baseType: !978, size: 131072, elements: !1076)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "fCharOfsBuf", scope: !1041, file: !1040, line: 431, baseType: !1082, size: 524288, offset: 393280)
!1082 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 524288, elements: !1076)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "fCurCol", scope: !1041, file: !1040, line: 432, baseType: !1084, size: 64, offset: 917568)
!1084 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMLSSize_t", file: !1000, line: 91, baseType: !1085)
!1085 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "fCurLine", scope: !1041, file: !1040, line: 433, baseType: !1084, size: 64, offset: 917632)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "fEncoding", scope: !1041, file: !1040, line: 434, baseType: !961, size: 32, offset: 917696)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "fEncodingStr", scope: !1041, file: !1040, line: 435, baseType: !1089, size: 64, offset: 917760)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "fForcedEncoding", scope: !1041, file: !1040, line: 436, baseType: !472, size: 8, offset: 917824)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "fNoMore", scope: !1041, file: !1040, line: 437, baseType: !472, size: 8, offset: 917832)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "fPublicId", scope: !1041, file: !1040, line: 438, baseType: !1089, size: 64, offset: 917888)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "fRawBufIndex", scope: !1041, file: !1040, line: 439, baseType: !12, size: 32, offset: 917952)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "fRawByteBuf", scope: !1041, file: !1040, line: 440, baseType: !1095, size: 393216, offset: 917984)
!1095 = !DICompositeType(tag: DW_TAG_array_type, baseType: !976, size: 393216, elements: !1096)
!1096 = !{!1097}
!1097 = !DISubrange(count: 49152)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "fRawBytesAvail", scope: !1041, file: !1040, line: 441, baseType: !12, size: 32, offset: 1311200)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "fReaderNum", scope: !1041, file: !1040, line: 442, baseType: !12, size: 32, offset: 1311232)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "fRefFrom", scope: !1041, file: !1040, line: 443, baseType: !1039, size: 32, offset: 1311264)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "fSentTrailingSpace", scope: !1041, file: !1040, line: 444, baseType: !472, size: 8, offset: 1311296)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "fSource", scope: !1041, file: !1040, line: 445, baseType: !1103, size: 32, offset: 1311328)
!1103 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Sources", scope: !1041, file: !1040, line: 64, baseType: !12, size: 32, elements: !1104, identifier: "_ZTSN11xercesc_2_79XMLReader7SourcesE")
!1104 = !{!1105, !1106}
!1105 = !DIEnumerator(name: "Source_Internal", value: 0, isUnsigned: true)
!1106 = !DIEnumerator(name: "Source_External", value: 1, isUnsigned: true)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "fSrcOfsBase", scope: !1041, file: !1040, line: 446, baseType: !12, size: 32, offset: 1311360)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "fSrcOfsSupported", scope: !1041, file: !1040, line: 447, baseType: !472, size: 8, offset: 1311392)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "fCalculateSrcOfs", scope: !1041, file: !1040, line: 448, baseType: !472, size: 8, offset: 1311400)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "fSystemId", scope: !1041, file: !1040, line: 449, baseType: !1089, size: 64, offset: 1311424)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "fStream", scope: !1041, file: !1040, line: 450, baseType: !1112, size: 64, offset: 1311488)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64)
!1113 = !DICompositeType(tag: DW_TAG_class_type, name: "BinInputStream", scope: !6, file: !1040, line: 32, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_714BinInputStreamE")
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "fSwapped", scope: !1041, file: !1040, line: 451, baseType: !472, size: 8, offset: 1311552)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "fThrowAtEnd", scope: !1041, file: !1040, line: 452, baseType: !472, size: 8, offset: 1311560)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "fTranscoder", scope: !1041, file: !1040, line: 453, baseType: !1117, size: 64, offset: 1311616)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = !DICompositeType(tag: DW_TAG_class_type, name: "XMLTranscoder", scope: !6, file: !1040, line: 35, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_713XMLTranscoderE")
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "fType", scope: !1041, file: !1040, line: 454, baseType: !1120, size: 32, offset: 1311680)
!1120 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Types", scope: !1041, file: !1040, line: 58, baseType: !12, size: 32, elements: !1121, identifier: "_ZTSN11xercesc_2_79XMLReader5TypesE")
!1121 = !{!1122, !1123}
!1122 = !DIEnumerator(name: "Type_PE", value: 0, isUnsigned: true)
!1123 = !DIEnumerator(name: "Type_General", value: 1, isUnsigned: true)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "fgCharCharsTable", scope: !1041, file: !1040, line: 455, baseType: !1125, size: 64, offset: 1311744)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "fNEL", scope: !1041, file: !1040, line: 456, baseType: !472, size: 8, offset: 1311808)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "fXMLVersion", scope: !1041, file: !1040, line: 457, baseType: !1128, size: 32, offset: 1311840)
!1128 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "XMLVersion", scope: !1041, file: !1040, line: 76, baseType: !12, size: 32, elements: !1129, identifier: "_ZTSN11xercesc_2_79XMLReader10XMLVersionE")
!1129 = !{!1130, !1131, !1132}
!1130 = !DIEnumerator(name: "XMLV1_0", value: 0, isUnsigned: true)
!1131 = !DIEnumerator(name: "XMLV1_1", value: 1, isUnsigned: true)
!1132 = !DIEnumerator(name: "XMLV_Unknown", value: 2, isUnsigned: true)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "fMemoryManager", scope: !1041, file: !1040, line: 458, baseType: !1007, size: 64, offset: 1311872)
!1134 = !DISubprogram(name: "isAllSpaces", linkageName: "_ZNK11xercesc_2_79XMLReader11isAllSpacesEPKtj", scope: !1041, file: !1040, line: 87, type: !1135, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1135 = !DISubroutineType(types: !1136)
!1136 = !{!472, !1137, !996, !972}
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!1138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1041)
!1139 = !DISubprogram(name: "containsWhiteSpace", linkageName: "_ZNK11xercesc_2_79XMLReader18containsWhiteSpaceEPKtj", scope: !1041, file: !1040, line: 93, type: !1135, scopeLine: 93, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1140 = !DISubprogram(name: "isXMLLetter", linkageName: "_ZNK11xercesc_2_79XMLReader11isXMLLetterEt", scope: !1041, file: !1040, line: 100, type: !1141, scopeLine: 100, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1141 = !DISubroutineType(types: !1142)
!1142 = !{!472, !1137, !998}
!1143 = !DISubprogram(name: "isFirstNameChar", linkageName: "_ZNK11xercesc_2_79XMLReader15isFirstNameCharEt", scope: !1041, file: !1040, line: 101, type: !1141, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1144 = !DISubprogram(name: "isNameChar", linkageName: "_ZNK11xercesc_2_79XMLReader10isNameCharEt", scope: !1041, file: !1040, line: 102, type: !1141, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1145 = !DISubprogram(name: "isPlainContentChar", linkageName: "_ZNK11xercesc_2_79XMLReader18isPlainContentCharEt", scope: !1041, file: !1040, line: 103, type: !1141, scopeLine: 103, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1146 = !DISubprogram(name: "isSpecialStartTagChar", linkageName: "_ZNK11xercesc_2_79XMLReader21isSpecialStartTagCharEt", scope: !1041, file: !1040, line: 104, type: !1141, scopeLine: 104, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1147 = !DISubprogram(name: "isXMLChar", linkageName: "_ZNK11xercesc_2_79XMLReader9isXMLCharEt", scope: !1041, file: !1040, line: 105, type: !1141, scopeLine: 105, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1148 = !DISubprogram(name: "isWhitespace", linkageName: "_ZNK11xercesc_2_79XMLReader12isWhitespaceEt", scope: !1041, file: !1040, line: 106, type: !1141, scopeLine: 106, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1149 = !DISubprogram(name: "isControlChar", linkageName: "_ZNK11xercesc_2_79XMLReader13isControlCharEt", scope: !1041, file: !1040, line: 107, type: !1141, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1150 = !DISubprogram(name: "isPublicIdChar", linkageName: "_ZNK11xercesc_2_79XMLReader14isPublicIdCharEt", scope: !1041, file: !1040, line: 108, type: !1141, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1151 = !DISubprogram(name: "isFirstNCNameChar", linkageName: "_ZNK11xercesc_2_79XMLReader17isFirstNCNameCharEt", scope: !1041, file: !1040, line: 109, type: !1141, scopeLine: 109, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1152 = !DISubprogram(name: "isNCNameChar", linkageName: "_ZNK11xercesc_2_79XMLReader12isNCNameCharEt", scope: !1041, file: !1040, line: 110, type: !1141, scopeLine: 110, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1153 = !DISubprogram(name: "XMLReader", scope: !1041, file: !1040, line: 115, type: !1154, scopeLine: 115, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1154 = !DISubroutineType(types: !1155)
!1155 = !{null, !1156, !996, !996, !1157, !1158, !1159, !1160, !1161, !1161, !1162, !1006}
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!1157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1112)
!1158 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1039)
!1159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1120)
!1160 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1103)
!1161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !472)
!1162 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1128)
!1163 = !DISubprogram(name: "XMLReader", scope: !1041, file: !1040, line: 129, type: !1164, scopeLine: 129, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1164 = !DISubroutineType(types: !1165)
!1165 = !{null, !1156, !996, !996, !1157, !996, !1158, !1159, !1160, !1161, !1161, !1162, !1006}
!1166 = !DISubprogram(name: "XMLReader", scope: !1041, file: !1040, line: 144, type: !1167, scopeLine: 144, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1167 = !DISubroutineType(types: !1168)
!1168 = !{null, !1156, !996, !996, !1157, !961, !1158, !1159, !1160, !1161, !1161, !1162, !1006}
!1169 = !DISubprogram(name: "~XMLReader", scope: !1041, file: !1040, line: 159, type: !1170, scopeLine: 159, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1170 = !DISubroutineType(types: !1171)
!1171 = !{null, !1156}
!1172 = !DISubprogram(name: "charsLeftInBuffer", linkageName: "_ZNK11xercesc_2_79XMLReader17charsLeftInBufferEv", scope: !1041, file: !1040, line: 165, type: !1173, scopeLine: 165, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1173 = !DISubroutineType(types: !1174)
!1174 = !{!1053, !1137}
!1175 = !DISubprogram(name: "refreshCharBuffer", linkageName: "_ZN11xercesc_2_79XMLReader17refreshCharBufferEv", scope: !1041, file: !1040, line: 166, type: !1176, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1176 = !DISubroutineType(types: !1177)
!1177 = !{!472, !1156}
!1178 = !DISubprogram(name: "getName", linkageName: "_ZN11xercesc_2_79XMLReader7getNameERNS_9XMLBufferEb", scope: !1041, file: !1040, line: 172, type: !1179, scopeLine: 172, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1179 = !DISubroutineType(types: !1180)
!1180 = !{!472, !1156, !1181, !1161}
!1181 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1182, size: 64)
!1182 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "XMLBuffer", scope: !6, file: !1183, line: 51, size: 320, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !1184, identifier: "_ZTSN11xercesc_2_79XMLBufferE")
!1183 = !DIFile(filename: "./xercesc/framework/XMLBuffer.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!1184 = !{!1185, !1186, !1187, !1188, !1189, !1190, !1191, !1194, !1195, !1199, !1202, !1205, !1208, !1211, !1214, !1215, !1216, !1221, !1224, !1225, !1228, !1231, !1232, !1235, !1239, !1242}
!1185 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !1182, baseType: !1044, flags: DIFlagPublic, extraData: i32 0)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "fIndex", scope: !1182, file: !1183, line: 254, baseType: !12, size: 32)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "fCapacity", scope: !1182, file: !1183, line: 255, baseType: !12, size: 32, offset: 32)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "fFullSize", scope: !1182, file: !1183, line: 256, baseType: !12, size: 32, offset: 64)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "fUsed", scope: !1182, file: !1183, line: 257, baseType: !472, size: 8, offset: 96)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "fMemoryManager", scope: !1182, file: !1183, line: 258, baseType: !1006, size: 64, offset: 128)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "fFullHandler", scope: !1182, file: !1183, line: 259, baseType: !1192, size: 64, offset: 192)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1193, size: 64)
!1193 = !DICompositeType(tag: DW_TAG_class_type, name: "XMLBufferFullHandler", scope: !6, file: !1183, line: 270, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_720XMLBufferFullHandlerE")
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "fBuffer", scope: !1182, file: !1183, line: 260, baseType: !1089, size: 64, offset: 256)
!1195 = !DISubprogram(name: "XMLBuffer", scope: !1182, file: !1183, line: 60, type: !1196, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1196 = !DISubroutineType(types: !1197)
!1197 = !{null, !1198, !972, !1006}
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!1199 = !DISubprogram(name: "~XMLBuffer", scope: !1182, file: !1183, line: 81, type: !1200, scopeLine: 81, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1200 = !DISubroutineType(types: !1201)
!1201 = !{null, !1198}
!1202 = !DISubprogram(name: "setFullHandler", linkageName: "_ZN11xercesc_2_79XMLBuffer14setFullHandlerEPNS_20XMLBufferFullHandlerEj", scope: !1182, file: !1183, line: 90, type: !1203, scopeLine: 90, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1203 = !DISubroutineType(types: !1204)
!1204 = !{null, !1198, !1192, !972}
!1205 = !DISubprogram(name: "append", linkageName: "_ZN11xercesc_2_79XMLBuffer6appendEt", scope: !1182, file: !1183, line: 119, type: !1206, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1206 = !DISubroutineType(types: !1207)
!1207 = !{null, !1198, !998}
!1208 = !DISubprogram(name: "append", linkageName: "_ZN11xercesc_2_79XMLBuffer6appendEPKtj", scope: !1182, file: !1183, line: 127, type: !1209, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1209 = !DISubroutineType(types: !1210)
!1210 = !{null, !1198, !996, !972}
!1211 = !DISubprogram(name: "append", linkageName: "_ZN11xercesc_2_79XMLBuffer6appendEPKt", scope: !1182, file: !1183, line: 141, type: !1212, scopeLine: 141, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1212 = !DISubroutineType(types: !1213)
!1213 = !{null, !1198, !996}
!1214 = !DISubprogram(name: "set", linkageName: "_ZN11xercesc_2_79XMLBuffer3setEPKtj", scope: !1182, file: !1183, line: 156, type: !1209, scopeLine: 156, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1215 = !DISubprogram(name: "set", linkageName: "_ZN11xercesc_2_79XMLBuffer3setEPKt", scope: !1182, file: !1183, line: 162, type: !1212, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1216 = !DISubprogram(name: "getRawBuffer", linkageName: "_ZNK11xercesc_2_79XMLBuffer12getRawBufferEv", scope: !1182, file: !1183, line: 168, type: !1217, scopeLine: 168, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1217 = !DISubroutineType(types: !1218)
!1218 = !{!997, !1219}
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!1220 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1182)
!1221 = !DISubprogram(name: "getRawBuffer", linkageName: "_ZN11xercesc_2_79XMLBuffer12getRawBufferEv", scope: !1182, file: !1183, line: 174, type: !1222, scopeLine: 174, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1222 = !DISubroutineType(types: !1223)
!1223 = !{!1089, !1198}
!1224 = !DISubprogram(name: "reset", linkageName: "_ZN11xercesc_2_79XMLBuffer5resetEv", scope: !1182, file: !1183, line: 180, type: !1200, scopeLine: 180, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1225 = !DISubprogram(name: "getInUse", linkageName: "_ZNK11xercesc_2_79XMLBuffer8getInUseEv", scope: !1182, file: !1183, line: 189, type: !1226, scopeLine: 189, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1226 = !DISubroutineType(types: !1227)
!1227 = !{!472, !1219}
!1228 = !DISubprogram(name: "getLen", linkageName: "_ZNK11xercesc_2_79XMLBuffer6getLenEv", scope: !1182, file: !1183, line: 194, type: !1229, scopeLine: 194, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1229 = !DISubroutineType(types: !1230)
!1230 = !{!12, !1219}
!1231 = !DISubprogram(name: "isEmpty", linkageName: "_ZNK11xercesc_2_79XMLBuffer7isEmptyEv", scope: !1182, file: !1183, line: 199, type: !1226, scopeLine: 199, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1232 = !DISubprogram(name: "setInUse", linkageName: "_ZN11xercesc_2_79XMLBuffer8setInUseEb", scope: !1182, file: !1183, line: 207, type: !1233, scopeLine: 207, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1233 = !DISubroutineType(types: !1234)
!1234 = !{null, !1198, !1161}
!1235 = !DISubprogram(name: "XMLBuffer", scope: !1182, file: !1183, line: 216, type: !1236, scopeLine: 216, flags: DIFlagPrototyped, spFlags: 0)
!1236 = !DISubroutineType(types: !1237)
!1237 = !{null, !1198, !1238}
!1238 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1220, size: 64)
!1239 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_79XMLBufferaSERKS0_", scope: !1182, file: !1183, line: 217, type: !1240, scopeLine: 217, flags: DIFlagPrototyped, spFlags: 0)
!1240 = !DISubroutineType(types: !1241)
!1241 = !{!1181, !1198, !1238}
!1242 = !DISubprogram(name: "insureCapacity", linkageName: "_ZN11xercesc_2_79XMLBuffer14insureCapacityEj", scope: !1182, file: !1183, line: 227, type: !1243, scopeLine: 227, flags: DIFlagPrototyped, spFlags: 0)
!1243 = !DISubroutineType(types: !1244)
!1244 = !{null, !1198, !972}
!1245 = !DISubprogram(name: "getQName", linkageName: "_ZN11xercesc_2_79XMLReader8getQNameERNS_9XMLBufferEPi", scope: !1041, file: !1040, line: 173, type: !1246, scopeLine: 173, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1246 = !DISubroutineType(types: !1247)
!1247 = !{!472, !1156, !1181, !1248}
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!1249 = !DISubprogram(name: "getNextChar", linkageName: "_ZN11xercesc_2_79XMLReader11getNextCharERt", scope: !1041, file: !1040, line: 174, type: !1250, scopeLine: 174, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1250 = !DISubroutineType(types: !1251)
!1251 = !{!472, !1156, !1252}
!1252 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !999, size: 64)
!1253 = !DISubprogram(name: "getNextCharIfNot", linkageName: "_ZN11xercesc_2_79XMLReader16getNextCharIfNotEtRt", scope: !1041, file: !1040, line: 175, type: !1254, scopeLine: 175, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1254 = !DISubroutineType(types: !1255)
!1255 = !{!472, !1156, !998, !1252}
!1256 = !DISubprogram(name: "movePlainContentChars", linkageName: "_ZN11xercesc_2_79XMLReader21movePlainContentCharsERNS_9XMLBufferE", scope: !1041, file: !1040, line: 176, type: !1257, scopeLine: 176, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1257 = !DISubroutineType(types: !1258)
!1258 = !{null, !1156, !1181}
!1259 = !DISubprogram(name: "getSpaces", linkageName: "_ZN11xercesc_2_79XMLReader9getSpacesERNS_9XMLBufferE", scope: !1041, file: !1040, line: 177, type: !1260, scopeLine: 177, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1260 = !DISubroutineType(types: !1261)
!1261 = !{!472, !1156, !1181}
!1262 = !DISubprogram(name: "getUpToCharOrWS", linkageName: "_ZN11xercesc_2_79XMLReader15getUpToCharOrWSERNS_9XMLBufferEt", scope: !1041, file: !1040, line: 178, type: !1263, scopeLine: 178, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1263 = !DISubroutineType(types: !1264)
!1264 = !{!472, !1156, !1181, !998}
!1265 = !DISubprogram(name: "peekNextChar", linkageName: "_ZN11xercesc_2_79XMLReader12peekNextCharERt", scope: !1041, file: !1040, line: 179, type: !1250, scopeLine: 179, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1266 = !DISubprogram(name: "skipIfQuote", linkageName: "_ZN11xercesc_2_79XMLReader11skipIfQuoteERt", scope: !1041, file: !1040, line: 180, type: !1250, scopeLine: 180, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1267 = !DISubprogram(name: "skipSpaces", linkageName: "_ZN11xercesc_2_79XMLReader10skipSpacesERbb", scope: !1041, file: !1040, line: 181, type: !1268, scopeLine: 181, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1268 = !DISubroutineType(types: !1269)
!1269 = !{!472, !1156, !1270, !472}
!1270 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !472, size: 64)
!1271 = !DISubprogram(name: "skippedChar", linkageName: "_ZN11xercesc_2_79XMLReader11skippedCharEt", scope: !1041, file: !1040, line: 182, type: !1272, scopeLine: 182, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1272 = !DISubroutineType(types: !1273)
!1273 = !{!472, !1156, !998}
!1274 = !DISubprogram(name: "skippedSpace", linkageName: "_ZN11xercesc_2_79XMLReader12skippedSpaceEv", scope: !1041, file: !1040, line: 183, type: !1176, scopeLine: 183, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1275 = !DISubprogram(name: "skippedString", linkageName: "_ZN11xercesc_2_79XMLReader13skippedStringEPKt", scope: !1041, file: !1040, line: 184, type: !1276, scopeLine: 184, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1276 = !DISubroutineType(types: !1277)
!1277 = !{!472, !1156, !996}
!1278 = !DISubprogram(name: "peekString", linkageName: "_ZN11xercesc_2_79XMLReader10peekStringEPKt", scope: !1041, file: !1040, line: 185, type: !1276, scopeLine: 185, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1279 = !DISubprogram(name: "getColumnNumber", linkageName: "_ZNK11xercesc_2_79XMLReader15getColumnNumberEv", scope: !1041, file: !1040, line: 191, type: !1280, scopeLine: 191, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1280 = !DISubroutineType(types: !1281)
!1281 = !{!1084, !1137}
!1282 = !DISubprogram(name: "getEncodingStr", linkageName: "_ZNK11xercesc_2_79XMLReader14getEncodingStrEv", scope: !1041, file: !1040, line: 192, type: !1283, scopeLine: 192, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1283 = !DISubroutineType(types: !1284)
!1284 = !{!997, !1137}
!1285 = !DISubprogram(name: "getLineNumber", linkageName: "_ZNK11xercesc_2_79XMLReader13getLineNumberEv", scope: !1041, file: !1040, line: 193, type: !1280, scopeLine: 193, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1286 = !DISubprogram(name: "getNoMoreFlag", linkageName: "_ZNK11xercesc_2_79XMLReader13getNoMoreFlagEv", scope: !1041, file: !1040, line: 194, type: !1287, scopeLine: 194, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1287 = !DISubroutineType(types: !1288)
!1288 = !{!472, !1137}
!1289 = !DISubprogram(name: "getPublicId", linkageName: "_ZNK11xercesc_2_79XMLReader11getPublicIdEv", scope: !1041, file: !1040, line: 195, type: !1283, scopeLine: 195, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1290 = !DISubprogram(name: "getReaderNum", linkageName: "_ZNK11xercesc_2_79XMLReader12getReaderNumEv", scope: !1041, file: !1040, line: 196, type: !1291, scopeLine: 196, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1291 = !DISubroutineType(types: !1292)
!1292 = !{!12, !1137}
!1293 = !DISubprogram(name: "getRefFrom", linkageName: "_ZNK11xercesc_2_79XMLReader10getRefFromEv", scope: !1041, file: !1040, line: 197, type: !1294, scopeLine: 197, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1294 = !DISubroutineType(types: !1295)
!1295 = !{!1039, !1137}
!1296 = !DISubprogram(name: "getSource", linkageName: "_ZNK11xercesc_2_79XMLReader9getSourceEv", scope: !1041, file: !1040, line: 198, type: !1297, scopeLine: 198, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1297 = !DISubroutineType(types: !1298)
!1298 = !{!1103, !1137}
!1299 = !DISubprogram(name: "getSrcOffset", linkageName: "_ZNK11xercesc_2_79XMLReader12getSrcOffsetEv", scope: !1041, file: !1040, line: 199, type: !1291, scopeLine: 199, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1300 = !DISubprogram(name: "getSystemId", linkageName: "_ZNK11xercesc_2_79XMLReader11getSystemIdEv", scope: !1041, file: !1040, line: 200, type: !1283, scopeLine: 200, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1301 = !DISubprogram(name: "getThrowAtEnd", linkageName: "_ZNK11xercesc_2_79XMLReader13getThrowAtEndEv", scope: !1041, file: !1040, line: 201, type: !1287, scopeLine: 201, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1302 = !DISubprogram(name: "getType", linkageName: "_ZNK11xercesc_2_79XMLReader7getTypeEv", scope: !1041, file: !1040, line: 202, type: !1303, scopeLine: 202, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1303 = !DISubroutineType(types: !1304)
!1304 = !{!1120, !1137}
!1305 = !DISubprogram(name: "setEncoding", linkageName: "_ZN11xercesc_2_79XMLReader11setEncodingEPKt", scope: !1041, file: !1040, line: 208, type: !1276, scopeLine: 208, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1306 = !DISubprogram(name: "setReaderNum", linkageName: "_ZN11xercesc_2_79XMLReader12setReaderNumEj", scope: !1041, file: !1040, line: 212, type: !1307, scopeLine: 212, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1307 = !DISubroutineType(types: !1308)
!1308 = !{null, !1156, !972}
!1309 = !DISubprogram(name: "setThrowAtEnd", linkageName: "_ZN11xercesc_2_79XMLReader13setThrowAtEndEb", scope: !1041, file: !1040, line: 213, type: !1310, scopeLine: 213, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1310 = !DISubroutineType(types: !1311)
!1311 = !{null, !1156, !1161}
!1312 = !DISubprogram(name: "setXMLVersion", linkageName: "_ZN11xercesc_2_79XMLReader13setXMLVersionENS0_10XMLVersionE", scope: !1041, file: !1040, line: 214, type: !1313, scopeLine: 214, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1313 = !DISubroutineType(types: !1314)
!1314 = !{null, !1156, !1162}
!1315 = !DISubprogram(name: "XMLReader", scope: !1041, file: !1040, line: 221, type: !1316, scopeLine: 221, flags: DIFlagPrototyped, spFlags: 0)
!1316 = !DISubroutineType(types: !1317)
!1317 = !{null, !1156, !1318}
!1318 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1138, size: 64)
!1319 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_79XMLReaderaSERKS0_", scope: !1041, file: !1040, line: 222, type: !1320, scopeLine: 222, flags: DIFlagPrototyped, spFlags: 0)
!1320 = !DISubroutineType(types: !1321)
!1321 = !{!1322, !1156, !1318}
!1322 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1041, size: 64)
!1323 = !DISubprogram(name: "checkForSwapped", linkageName: "_ZN11xercesc_2_79XMLReader15checkForSwappedEv", scope: !1041, file: !1040, line: 250, type: !1170, scopeLine: 250, flags: DIFlagPrototyped, spFlags: 0)
!1324 = !DISubprogram(name: "doInitCharSizeChecks", linkageName: "_ZN11xercesc_2_79XMLReader20doInitCharSizeChecksEv", scope: !1041, file: !1040, line: 252, type: !1170, scopeLine: 252, flags: DIFlagPrototyped, spFlags: 0)
!1325 = !DISubprogram(name: "doInitDecode", linkageName: "_ZN11xercesc_2_79XMLReader12doInitDecodeEv", scope: !1041, file: !1040, line: 254, type: !1170, scopeLine: 254, flags: DIFlagPrototyped, spFlags: 0)
!1326 = !DISubprogram(name: "getNextRawByte", linkageName: "_ZN11xercesc_2_79XMLReader14getNextRawByteEb", scope: !1041, file: !1040, line: 256, type: !1327, scopeLine: 256, flags: DIFlagPrototyped, spFlags: 0)
!1327 = !DISubroutineType(types: !1328)
!1328 = !{!976, !1156, !1161}
!1329 = !DISubprogram(name: "refreshRawBuffer", linkageName: "_ZN11xercesc_2_79XMLReader16refreshRawBufferEv", scope: !1041, file: !1040, line: 261, type: !1170, scopeLine: 261, flags: DIFlagPrototyped, spFlags: 0)
!1330 = !DISubprogram(name: "setTranscoder", linkageName: "_ZN11xercesc_2_79XMLReader13setTranscoderEPKt", scope: !1041, file: !1040, line: 263, type: !1331, scopeLine: 263, flags: DIFlagPrototyped, spFlags: 0)
!1331 = !DISubroutineType(types: !1332)
!1332 = !{null, !1156, !996}
!1333 = !DISubprogram(name: "xcodeMoreChars", linkageName: "_ZN11xercesc_2_79XMLReader14xcodeMoreCharsEPtPhj", scope: !1041, file: !1040, line: 268, type: !1334, scopeLine: 268, flags: DIFlagPrototyped, spFlags: 0)
!1334 = !DISubroutineType(types: !1335)
!1335 = !{!12, !1156, !1336, !1337, !972}
!1336 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1089)
!1337 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1338)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!1339 = !DISubprogram(name: "handleEOL", linkageName: "_ZN11xercesc_2_79XMLReader9handleEOLERtb", scope: !1041, file: !1040, line: 275, type: !1340, scopeLine: 275, flags: DIFlagPrototyped, spFlags: 0)
!1340 = !DISubroutineType(types: !1341)
!1341 = !{null, !1156, !1252, !472}
!1342 = !{!1343, !1344}
!1343 = !DIEnumerator(name: "RefFrom_Literal", value: 0, isUnsigned: true)
!1344 = !DIEnumerator(name: "RefFrom_NonLiteral", value: 1, isUnsigned: true)
!1345 = !{!1346, !1050, !12, !1089, !1347, !1350}
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1348, size: 64)
!1348 = !DICompositeType(tag: DW_TAG_class_type, name: "DTDGrammar", scope: !6, file: !1349, line: 46, flags: DIFlagFwdDecl)
!1349 = !DIFile(filename: "./xercesc/validators/DTD/DTDGrammar.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64)
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64)
!1352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RefHashTableBucketElem<xercesc_2_7::XMLRefInfo>", scope: !6, file: !1353, line: 49, size: 192, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !1354, templateParams: !1738, identifier: "_ZTSN11xercesc_2_722RefHashTableBucketElemINS_10XMLRefInfoEEE")
!1353 = !DIFile(filename: "./xercesc/util/RefHashTableOf.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!1354 = !{!1355, !1718, !1719, !1720, !1725, !1728, !1729, !1734}
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "fData", scope: !1352, file: !1353, line: 59, baseType: !1356, size: 64)
!1356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1357, size: 64)
!1357 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "XMLRefInfo", scope: !6, file: !1358, line: 47, size: 256, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !1359, vtableHolder: !1361, identifier: "_ZTSN11xercesc_2_710XMLRefInfoE")
!1358 = !DIFile(filename: "./xercesc/framework/XMLRefInfo.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!1359 = !{!1360, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1681, !1684, !1689, !1692, !1693, !1696, !1697, !1700, !1701, !1704, !1707, !1710, !1714}
!1360 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !1357, baseType: !1361, flags: DIFlagPublic, extraData: i32 0)
!1361 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "XSerializable", scope: !6, file: !1362, line: 29, size: 64, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !1363, vtableHolder: !1361, identifier: "_ZTSN11xercesc_2_713XSerializableE")
!1362 = !DIFile(filename: "./xercesc/internal/XSerializable.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!1363 = !{!1364, !1369, !1373, !1378, !1659, !1662, !1663, !1667}
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$XSerializable", scope: !1362, file: !1362, baseType: !1365, size: 64, flags: DIFlagArtificial)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !1367, size: 64)
!1367 = !DISubroutineType(types: !1368)
!1368 = !{!430}
!1369 = !DISubprogram(name: "~XSerializable", scope: !1361, file: !1362, line: 36, type: !1370, scopeLine: 36, containingType: !1361, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!1370 = !DISubroutineType(types: !1371)
!1371 = !{null, !1372}
!1372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!1373 = !DISubprogram(name: "isSerializable", linkageName: "_ZNK11xercesc_2_713XSerializable14isSerializableEv", scope: !1361, file: !1362, line: 41, type: !1374, scopeLine: 41, containingType: !1361, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!1374 = !DISubroutineType(types: !1375)
!1375 = !{!472, !1376}
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!1377 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1361)
!1378 = !DISubprogram(name: "serialize", linkageName: "_ZN11xercesc_2_713XSerializable9serializeERNS_16XSerializeEngineE", scope: !1361, file: !1362, line: 43, type: !1379, scopeLine: 43, containingType: !1361, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!1379 = !DISubroutineType(types: !1380)
!1380 = !{null, !1372, !1381}
!1381 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1382, size: 64)
!1382 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "XSerializeEngine", scope: !6, file: !1383, line: 42, size: 832, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !1384, identifier: "_ZTSN11xercesc_2_716XSerializeEngineE")
!1383 = !DIFile(filename: "./xercesc/internal/XSerializeEngine.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!1384 = !{!1385, !1386, !1387, !1390, !1391, !1396, !1397, !1401, !1402, !1404, !1406, !1407, !1408, !1409, !1412, !1416, !1418, !1422, !1425, !1428, !1431, !1434, !1435, !1440, !1441, !1444, !1450, !1453, !1456, !1461, !1468, !1471, !1474, !1478, !1481, !1484, !1488, !1491, !1494, !1499, !1502, !1505, !1509, !1512, !1515, !1519, !1523, !1526, !1529, !1532, !1535, !1538, !1541, !1544, !1547, !1550, !1554, !1558, !1561, !1565, !1568, !1572, !1576, !1579, !1583, !1587, !1591, !1595, !1599, !1602, !1605, !1606, !1607, !1608, !1612, !1613, !1617, !1620, !1623, !1624, !1627, !1628, !1631, !1632, !1633, !1634, !1635, !1636, !1639, !1640, !1641, !1642, !1645, !1648, !1652, !1655, !1656}
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "toReadBufferLen", scope: !1382, file: !1383, line: 51, baseType: !1161, flags: DIFlagPublic | DIFlagStaticMember)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "toWriteBufferLen", scope: !1382, file: !1383, line: 301, baseType: !1161, flags: DIFlagPublic | DIFlagStaticMember)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "fStoreLoad", scope: !1382, file: !1383, line: 695, baseType: !1388, size: 16)
!1388 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1389)
!1389 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "fStorerLevel", scope: !1382, file: !1383, line: 696, baseType: !1389, size: 16, offset: 16)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "fGrammarPool", scope: !1382, file: !1383, line: 698, baseType: !1392, size: 64, offset: 64)
!1392 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1393)
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1394, size: 64)
!1394 = !DICompositeType(tag: DW_TAG_class_type, name: "XMLGrammarPool", scope: !6, file: !1395, line: 42, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_714XMLGrammarPoolE")
!1395 = !DIFile(filename: "./xercesc/framework/XMLGrammarPool.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "fInputStream", scope: !1382, file: !1383, line: 699, baseType: !1157, size: 64, offset: 128)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "fOutputStream", scope: !1382, file: !1383, line: 700, baseType: !1398, size: 64, offset: 192)
!1398 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1399)
!1399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1400, size: 64)
!1400 = !DICompositeType(tag: DW_TAG_class_type, name: "BinOutputStream", scope: !6, file: !1383, line: 36, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_715BinOutputStreamE")
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "fBufCount", scope: !1382, file: !1383, line: 702, baseType: !1053, size: 64, offset: 256)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "fBufSize", scope: !1382, file: !1383, line: 705, baseType: !1403, size: 64, offset: 320)
!1403 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1053)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "fBufStart", scope: !1382, file: !1383, line: 706, baseType: !1405, size: 64, offset: 384)
!1405 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1125)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "fBufEnd", scope: !1382, file: !1383, line: 707, baseType: !1405, size: 64, offset: 448)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "fBufCur", scope: !1382, file: !1383, line: 708, baseType: !1125, size: 64, offset: 512)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "fBufLoadMax", scope: !1382, file: !1383, line: 709, baseType: !1125, size: 64, offset: 576)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "fStorePool", scope: !1382, file: !1383, line: 722, baseType: !1410, size: 64, offset: 640)
!1410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1411, size: 64)
!1411 = !DICompositeType(tag: DW_TAG_class_type, name: "RefHashTableOf<xercesc_2_7::XSerializedObjectId>", scope: !6, file: !1353, line: 72, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_714RefHashTableOfINS_19XSerializedObjectIdEEE")
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "fLoadPool", scope: !1382, file: !1383, line: 731, baseType: !1413, size: 64, offset: 704)
!1413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1414, size: 64)
!1414 = !DICompositeType(tag: DW_TAG_class_type, name: "ValueVectorOf<void *>", scope: !6, file: !1415, line: 32, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_713ValueVectorOfIPvEE")
!1415 = !DIFile(filename: "./xercesc/util/ValueVectorOf.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "fObjectCount", scope: !1382, file: !1383, line: 736, baseType: !1417, size: 32, offset: 768)
!1417 = !DIDerivedType(tag: DW_TAG_typedef, name: "XSerializedObjectId_t", scope: !1382, file: !1383, line: 53, baseType: !12)
!1418 = !DISubprogram(name: "~XSerializeEngine", scope: !1382, file: !1383, line: 60, type: !1419, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1419 = !DISubroutineType(types: !1420)
!1420 = !{null, !1421}
!1421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1382, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!1422 = !DISubprogram(name: "XSerializeEngine", scope: !1382, file: !1383, line: 76, type: !1423, scopeLine: 76, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1423 = !DISubroutineType(types: !1424)
!1424 = !{null, !1421, !1112, !1392, !1053}
!1425 = !DISubprogram(name: "XSerializeEngine", scope: !1382, file: !1383, line: 95, type: !1426, scopeLine: 95, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1426 = !DISubroutineType(types: !1427)
!1427 = !{null, !1421, !1399, !1392, !1053}
!1428 = !DISubprogram(name: "XSerializeEngine", scope: !1382, file: !1383, line: 116, type: !1429, scopeLine: 116, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1429 = !DISubroutineType(types: !1430)
!1430 = !{null, !1421, !1112, !1006, !1053}
!1431 = !DISubprogram(name: "XSerializeEngine", scope: !1382, file: !1383, line: 137, type: !1432, scopeLine: 137, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1432 = !DISubroutineType(types: !1433)
!1433 = !{null, !1421, !1399, !1006, !1053}
!1434 = !DISubprogram(name: "flush", linkageName: "_ZN11xercesc_2_716XSerializeEngine5flushEv", scope: !1382, file: !1383, line: 148, type: !1419, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1435 = !DISubprogram(name: "isStoring", linkageName: "_ZNK11xercesc_2_716XSerializeEngine9isStoringEv", scope: !1382, file: !1383, line: 158, type: !1436, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1436 = !DISubroutineType(types: !1437)
!1437 = !{!472, !1438}
!1438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1439, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!1439 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1382)
!1440 = !DISubprogram(name: "isLoading", linkageName: "_ZNK11xercesc_2_716XSerializeEngine9isLoadingEv", scope: !1382, file: !1383, line: 168, type: !1436, scopeLine: 168, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1441 = !DISubprogram(name: "getGrammarPool", linkageName: "_ZNK11xercesc_2_716XSerializeEngine14getGrammarPoolEv", scope: !1382, file: !1383, line: 177, type: !1442, scopeLine: 177, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1442 = !DISubroutineType(types: !1443)
!1443 = !{!1393, !1438}
!1444 = !DISubprogram(name: "getStringPool", linkageName: "_ZNK11xercesc_2_716XSerializeEngine13getStringPoolEv", scope: !1382, file: !1383, line: 186, type: !1445, scopeLine: 186, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1445 = !DISubroutineType(types: !1446)
!1446 = !{!1447, !1438}
!1447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1448, size: 64)
!1448 = !DICompositeType(tag: DW_TAG_class_type, name: "XMLStringPool", scope: !6, file: !1449, line: 43, flags: DIFlagFwdDecl)
!1449 = !DIFile(filename: "./xercesc/util/StringPool.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!1450 = !DISubprogram(name: "getMemoryManager", linkageName: "_ZNK11xercesc_2_716XSerializeEngine16getMemoryManagerEv", scope: !1382, file: !1383, line: 195, type: !1451, scopeLine: 195, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1451 = !DISubroutineType(types: !1452)
!1452 = !{!1007, !1438}
!1453 = !DISubprogram(name: "getStorerLevel", linkageName: "_ZNK11xercesc_2_716XSerializeEngine14getStorerLevelEv", scope: !1382, file: !1383, line: 209, type: !1454, scopeLine: 209, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1454 = !DISubroutineType(types: !1455)
!1455 = !{!1001, !1438}
!1456 = !DISubprogram(name: "write", linkageName: "_ZN11xercesc_2_716XSerializeEngine5writeEPNS_13XSerializableE", scope: !1382, file: !1383, line: 221, type: !1457, scopeLine: 221, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1457 = !DISubroutineType(types: !1458)
!1458 = !{null, !1421, !1459}
!1459 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1460)
!1460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64)
!1461 = !DISubprogram(name: "write", linkageName: "_ZN11xercesc_2_716XSerializeEngine5writeEPNS_10XProtoTypeE", scope: !1382, file: !1383, line: 233, type: !1462, scopeLine: 233, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1462 = !DISubroutineType(types: !1463)
!1463 = !{null, !1421, !1464}
!1464 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1465)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64)
!1466 = !DICompositeType(tag: DW_TAG_class_type, name: "XProtoType", scope: !6, file: !1467, line: 32, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_710XProtoTypeE")
!1467 = !DIFile(filename: "./xercesc/internal/XProtoType.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!1468 = !DISubprogram(name: "write", linkageName: "_ZN11xercesc_2_716XSerializeEngine5writeEPKhi", scope: !1382, file: !1383, line: 246, type: !1469, scopeLine: 246, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1469 = !DISubroutineType(types: !1470)
!1470 = !{null, !1421, !991, !430}
!1471 = !DISubprogram(name: "write", linkageName: "_ZN11xercesc_2_716XSerializeEngine5writeEPKti", scope: !1382, file: !1383, line: 260, type: !1472, scopeLine: 260, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1472 = !DISubroutineType(types: !1473)
!1473 = !{null, !1421, !996, !430}
!1474 = !DISubprogram(name: "writeString", linkageName: "_ZN11xercesc_2_716XSerializeEngine11writeStringEPKtib", scope: !1382, file: !1383, line: 278, type: !1475, scopeLine: 278, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1475 = !DISubroutineType(types: !1476)
!1476 = !{null, !1421, !996, !1477, !472}
!1477 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !430)
!1478 = !DISubprogram(name: "writeString", linkageName: "_ZN11xercesc_2_716XSerializeEngine11writeStringEPKhib", scope: !1382, file: !1383, line: 297, type: !1479, scopeLine: 297, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1479 = !DISubroutineType(types: !1480)
!1480 = !{null, !1421, !991, !1477, !472}
!1481 = !DISubprogram(name: "read", linkageName: "_ZN11xercesc_2_716XSerializeEngine4readEPNS_10XProtoTypeE", scope: !1382, file: !1383, line: 313, type: !1482, scopeLine: 313, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1482 = !DISubroutineType(types: !1483)
!1483 = !{!1460, !1421, !1464}
!1484 = !DISubprogram(name: "read", linkageName: "_ZN11xercesc_2_716XSerializeEngine4readEPNS_10XProtoTypeEPj", scope: !1382, file: !1383, line: 328, type: !1485, scopeLine: 328, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1485 = !DISubroutineType(types: !1486)
!1486 = !{!472, !1421, !1464, !1487}
!1487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1417, size: 64)
!1488 = !DISubprogram(name: "read", linkageName: "_ZN11xercesc_2_716XSerializeEngine4readEPhi", scope: !1382, file: !1383, line: 342, type: !1489, scopeLine: 342, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1489 = !DISubroutineType(types: !1490)
!1490 = !{null, !1421, !1405, !430}
!1491 = !DISubprogram(name: "read", linkageName: "_ZN11xercesc_2_716XSerializeEngine4readEPti", scope: !1382, file: !1383, line: 356, type: !1492, scopeLine: 356, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1492 = !DISubroutineType(types: !1493)
!1493 = !{null, !1421, !1336, !430}
!1494 = !DISubprogram(name: "readString", linkageName: "_ZN11xercesc_2_716XSerializeEngine10readStringERPtRiS3_b", scope: !1382, file: !1383, line: 375, type: !1495, scopeLine: 375, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1495 = !DISubroutineType(types: !1496)
!1496 = !{null, !1421, !1497, !1498, !1498, !472}
!1497 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1089, size: 64)
!1498 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !430, size: 64)
!1499 = !DISubprogram(name: "readString", linkageName: "_ZN11xercesc_2_716XSerializeEngine10readStringERPtRi", scope: !1382, file: !1383, line: 394, type: !1500, scopeLine: 394, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1500 = !DISubroutineType(types: !1501)
!1501 = !{null, !1421, !1497, !1498}
!1502 = !DISubprogram(name: "readString", linkageName: "_ZN11xercesc_2_716XSerializeEngine10readStringERPt", scope: !1382, file: !1383, line: 407, type: !1503, scopeLine: 407, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1503 = !DISubroutineType(types: !1504)
!1504 = !{null, !1421, !1497}
!1505 = !DISubprogram(name: "readString", linkageName: "_ZN11xercesc_2_716XSerializeEngine10readStringERPhRiS3_b", scope: !1382, file: !1383, line: 425, type: !1506, scopeLine: 425, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1506 = !DISubroutineType(types: !1507)
!1507 = !{null, !1421, !1508, !1498, !1498, !472}
!1508 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1125, size: 64)
!1509 = !DISubprogram(name: "readString", linkageName: "_ZN11xercesc_2_716XSerializeEngine10readStringERPhRi", scope: !1382, file: !1383, line: 445, type: !1510, scopeLine: 445, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1510 = !DISubroutineType(types: !1511)
!1511 = !{null, !1421, !1508, !1498}
!1512 = !DISubprogram(name: "readString", linkageName: "_ZN11xercesc_2_716XSerializeEngine10readStringERPh", scope: !1382, file: !1383, line: 464, type: !1513, scopeLine: 464, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1513 = !DISubroutineType(types: !1514)
!1514 = !{null, !1421, !1508}
!1515 = !DISubprogram(name: "needToStoreObject", linkageName: "_ZN11xercesc_2_716XSerializeEngine17needToStoreObjectEPv", scope: !1382, file: !1383, line: 477, type: !1516, scopeLine: 477, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1516 = !DISubroutineType(types: !1517)
!1517 = !{!472, !1421, !1518}
!1518 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1050)
!1519 = !DISubprogram(name: "needToLoadObject", linkageName: "_ZN11xercesc_2_716XSerializeEngine16needToLoadObjectEPPv", scope: !1382, file: !1383, line: 490, type: !1520, scopeLine: 490, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1520 = !DISubroutineType(types: !1521)
!1521 = !{!472, !1421, !1522}
!1522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1523 = !DISubprogram(name: "registerObject", linkageName: "_ZN11xercesc_2_716XSerializeEngine14registerObjectEPv", scope: !1382, file: !1383, line: 504, type: !1524, scopeLine: 504, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1524 = !DISubroutineType(types: !1525)
!1525 = !{null, !1421, !1518}
!1526 = !DISubprogram(name: "operator<<", linkageName: "_ZN11xercesc_2_716XSerializeEnginelsEh", scope: !1382, file: !1383, line: 522, type: !1527, scopeLine: 522, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1527 = !DISubroutineType(types: !1528)
!1528 = !{!1381, !1421, !976}
!1529 = !DISubprogram(name: "operator<<", linkageName: "_ZN11xercesc_2_716XSerializeEnginelsEt", scope: !1382, file: !1383, line: 523, type: !1530, scopeLine: 523, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1530 = !DISubroutineType(types: !1531)
!1531 = !{!1381, !1421, !999}
!1532 = !DISubprogram(name: "operator<<", linkageName: "_ZN11xercesc_2_716XSerializeEnginelsEc", scope: !1382, file: !1383, line: 525, type: !1533, scopeLine: 525, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1533 = !DISubroutineType(types: !1534)
!1534 = !{!1381, !1421, !968}
!1535 = !DISubprogram(name: "operator<<", linkageName: "_ZN11xercesc_2_716XSerializeEnginelsEs", scope: !1382, file: !1383, line: 526, type: !1536, scopeLine: 526, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1536 = !DISubroutineType(types: !1537)
!1537 = !{!1381, !1421, !1389}
!1538 = !DISubprogram(name: "operator<<", linkageName: "_ZN11xercesc_2_716XSerializeEnginelsEi", scope: !1382, file: !1383, line: 527, type: !1539, scopeLine: 527, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1539 = !DISubroutineType(types: !1540)
!1540 = !{!1381, !1421, !430}
!1541 = !DISubprogram(name: "operator<<", linkageName: "_ZN11xercesc_2_716XSerializeEnginelsEj", scope: !1382, file: !1383, line: 528, type: !1542, scopeLine: 528, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1542 = !DISubroutineType(types: !1543)
!1543 = !{!1381, !1421, !12}
!1544 = !DISubprogram(name: "operator<<", linkageName: "_ZN11xercesc_2_716XSerializeEnginelsEl", scope: !1382, file: !1383, line: 529, type: !1545, scopeLine: 529, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1545 = !DISubroutineType(types: !1546)
!1546 = !{!1381, !1421, !1085}
!1547 = !DISubprogram(name: "operator<<", linkageName: "_ZN11xercesc_2_716XSerializeEnginelsEm", scope: !1382, file: !1383, line: 530, type: !1548, scopeLine: 530, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1548 = !DISubroutineType(types: !1549)
!1549 = !{!1381, !1421, !1053}
!1550 = !DISubprogram(name: "operator<<", linkageName: "_ZN11xercesc_2_716XSerializeEnginelsEf", scope: !1382, file: !1383, line: 531, type: !1551, scopeLine: 531, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1551 = !DISubroutineType(types: !1552)
!1552 = !{!1381, !1421, !1553}
!1553 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1554 = !DISubprogram(name: "operator<<", linkageName: "_ZN11xercesc_2_716XSerializeEnginelsEd", scope: !1382, file: !1383, line: 532, type: !1555, scopeLine: 532, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1555 = !DISubroutineType(types: !1556)
!1556 = !{!1381, !1421, !1557}
!1557 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!1558 = !DISubprogram(name: "operator<<", linkageName: "_ZN11xercesc_2_716XSerializeEnginelsEb", scope: !1382, file: !1383, line: 533, type: !1559, scopeLine: 533, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1559 = !DISubroutineType(types: !1560)
!1560 = !{!1381, !1421, !472}
!1561 = !DISubprogram(name: "operator>>", linkageName: "_ZN11xercesc_2_716XSerializeEnginersERh", scope: !1382, file: !1383, line: 542, type: !1562, scopeLine: 542, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1562 = !DISubroutineType(types: !1563)
!1563 = !{!1381, !1421, !1564}
!1564 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !976, size: 64)
!1565 = !DISubprogram(name: "operator>>", linkageName: "_ZN11xercesc_2_716XSerializeEnginersERt", scope: !1382, file: !1383, line: 543, type: !1566, scopeLine: 543, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1566 = !DISubroutineType(types: !1567)
!1567 = !{!1381, !1421, !1252}
!1568 = !DISubprogram(name: "operator>>", linkageName: "_ZN11xercesc_2_716XSerializeEnginersERc", scope: !1382, file: !1383, line: 545, type: !1569, scopeLine: 545, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1569 = !DISubroutineType(types: !1570)
!1570 = !{!1381, !1421, !1571}
!1571 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !968, size: 64)
!1572 = !DISubprogram(name: "operator>>", linkageName: "_ZN11xercesc_2_716XSerializeEnginersERs", scope: !1382, file: !1383, line: 546, type: !1573, scopeLine: 546, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1573 = !DISubroutineType(types: !1574)
!1574 = !{!1381, !1421, !1575}
!1575 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1389, size: 64)
!1576 = !DISubprogram(name: "operator>>", linkageName: "_ZN11xercesc_2_716XSerializeEnginersERi", scope: !1382, file: !1383, line: 547, type: !1577, scopeLine: 547, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1577 = !DISubroutineType(types: !1578)
!1578 = !{!1381, !1421, !1498}
!1579 = !DISubprogram(name: "operator>>", linkageName: "_ZN11xercesc_2_716XSerializeEnginersERj", scope: !1382, file: !1383, line: 548, type: !1580, scopeLine: 548, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1580 = !DISubroutineType(types: !1581)
!1581 = !{!1381, !1421, !1582}
!1582 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !12, size: 64)
!1583 = !DISubprogram(name: "operator>>", linkageName: "_ZN11xercesc_2_716XSerializeEnginersERl", scope: !1382, file: !1383, line: 549, type: !1584, scopeLine: 549, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1584 = !DISubroutineType(types: !1585)
!1585 = !{!1381, !1421, !1586}
!1586 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1085, size: 64)
!1587 = !DISubprogram(name: "operator>>", linkageName: "_ZN11xercesc_2_716XSerializeEnginersERm", scope: !1382, file: !1383, line: 550, type: !1588, scopeLine: 550, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1588 = !DISubroutineType(types: !1589)
!1589 = !{!1381, !1421, !1590}
!1590 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1053, size: 64)
!1591 = !DISubprogram(name: "operator>>", linkageName: "_ZN11xercesc_2_716XSerializeEnginersERf", scope: !1382, file: !1383, line: 551, type: !1592, scopeLine: 551, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1592 = !DISubroutineType(types: !1593)
!1593 = !{!1381, !1421, !1594}
!1594 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1553, size: 64)
!1595 = !DISubprogram(name: "operator>>", linkageName: "_ZN11xercesc_2_716XSerializeEnginersERd", scope: !1382, file: !1383, line: 552, type: !1596, scopeLine: 552, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1596 = !DISubroutineType(types: !1597)
!1597 = !{!1381, !1421, !1598}
!1598 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1557, size: 64)
!1599 = !DISubprogram(name: "operator>>", linkageName: "_ZN11xercesc_2_716XSerializeEnginersERb", scope: !1382, file: !1383, line: 553, type: !1600, scopeLine: 553, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1600 = !DISubroutineType(types: !1601)
!1601 = !{!1381, !1421, !1270}
!1602 = !DISubprogram(name: "getBufSize", linkageName: "_ZNK11xercesc_2_716XSerializeEngine10getBufSizeEv", scope: !1382, file: !1383, line: 561, type: !1603, scopeLine: 561, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1603 = !DISubroutineType(types: !1604)
!1604 = !{!1053, !1438}
!1605 = !DISubprogram(name: "getBufCur", linkageName: "_ZNK11xercesc_2_716XSerializeEngine9getBufCurEv", scope: !1382, file: !1383, line: 564, type: !1603, scopeLine: 564, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1606 = !DISubprogram(name: "getBufCurAccumulated", linkageName: "_ZNK11xercesc_2_716XSerializeEngine20getBufCurAccumulatedEv", scope: !1382, file: !1383, line: 567, type: !1603, scopeLine: 567, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1607 = !DISubprogram(name: "getBufCount", linkageName: "_ZNK11xercesc_2_716XSerializeEngine11getBufCountEv", scope: !1382, file: !1383, line: 570, type: !1603, scopeLine: 570, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1608 = !DISubprogram(name: "trace", linkageName: "_ZNK11xercesc_2_716XSerializeEngine5traceEPc", scope: !1382, file: !1383, line: 572, type: !1609, scopeLine: 572, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1609 = !DISubroutineType(types: !1610)
!1610 = !{null, !1438, !1611}
!1611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!1612 = !DISubprogram(name: "XSerializeEngine", scope: !1382, file: !1383, line: 578, type: !1419, scopeLine: 578, flags: DIFlagPrototyped, spFlags: 0)
!1613 = !DISubprogram(name: "XSerializeEngine", scope: !1382, file: !1383, line: 579, type: !1614, scopeLine: 579, flags: DIFlagPrototyped, spFlags: 0)
!1614 = !DISubroutineType(types: !1615)
!1615 = !{null, !1421, !1616}
!1616 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1439, size: 64)
!1617 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_716XSerializeEngineaSERKS0_", scope: !1382, file: !1383, line: 580, type: !1618, scopeLine: 580, flags: DIFlagPrototyped, spFlags: 0)
!1618 = !DISubroutineType(types: !1619)
!1619 = !{!1381, !1421, !1616}
!1620 = !DISubprogram(name: "lookupStorePool", linkageName: "_ZNK11xercesc_2_716XSerializeEngine15lookupStorePoolEPv", scope: !1382, file: !1383, line: 587, type: !1621, scopeLine: 587, flags: DIFlagPrototyped, spFlags: 0)
!1621 = !DISubroutineType(types: !1622)
!1622 = !{!1417, !1438, !1518}
!1623 = !DISubprogram(name: "addStorePool", linkageName: "_ZN11xercesc_2_716XSerializeEngine12addStorePoolEPv", scope: !1382, file: !1383, line: 588, type: !1524, scopeLine: 588, flags: DIFlagPrototyped, spFlags: 0)
!1624 = !DISubprogram(name: "lookupLoadPool", linkageName: "_ZNK11xercesc_2_716XSerializeEngine14lookupLoadPoolEj", scope: !1382, file: !1383, line: 595, type: !1625, scopeLine: 595, flags: DIFlagPrototyped, spFlags: 0)
!1625 = !DISubroutineType(types: !1626)
!1626 = !{!1460, !1438, !1417}
!1627 = !DISubprogram(name: "addLoadPool", linkageName: "_ZN11xercesc_2_716XSerializeEngine11addLoadPoolEPv", scope: !1382, file: !1383, line: 596, type: !1524, scopeLine: 596, flags: DIFlagPrototyped, spFlags: 0)
!1628 = !DISubprogram(name: "checkAndFillBuffer", linkageName: "_ZN11xercesc_2_716XSerializeEngine18checkAndFillBufferEi", scope: !1382, file: !1383, line: 603, type: !1629, scopeLine: 603, flags: DIFlagPrototyped, spFlags: 0)
!1629 = !DISubroutineType(types: !1630)
!1630 = !{null, !1421, !430}
!1631 = !DISubprogram(name: "checkAndFlushBuffer", linkageName: "_ZN11xercesc_2_716XSerializeEngine19checkAndFlushBufferEi", scope: !1382, file: !1383, line: 605, type: !1629, scopeLine: 605, flags: DIFlagPrototyped, spFlags: 0)
!1632 = !DISubprogram(name: "fillBuffer", linkageName: "_ZN11xercesc_2_716XSerializeEngine10fillBufferEv", scope: !1382, file: !1383, line: 607, type: !1419, scopeLine: 607, flags: DIFlagPrototyped, spFlags: 0)
!1633 = !DISubprogram(name: "flushBuffer", linkageName: "_ZN11xercesc_2_716XSerializeEngine11flushBufferEv", scope: !1382, file: !1383, line: 609, type: !1419, scopeLine: 609, flags: DIFlagPrototyped, spFlags: 0)
!1634 = !DISubprogram(name: "pumpCount", linkageName: "_ZN11xercesc_2_716XSerializeEngine9pumpCountEv", scope: !1382, file: !1383, line: 611, type: !1419, scopeLine: 611, flags: DIFlagPrototyped, spFlags: 0)
!1635 = !DISubprogram(name: "resetBuffer", linkageName: "_ZN11xercesc_2_716XSerializeEngine11resetBufferEv", scope: !1382, file: !1383, line: 613, type: !1419, scopeLine: 613, flags: DIFlagPrototyped, spFlags: 0)
!1636 = !DISubprogram(name: "ensureStoring", linkageName: "_ZNK11xercesc_2_716XSerializeEngine13ensureStoringEv", scope: !1382, file: !1383, line: 620, type: !1637, scopeLine: 620, flags: DIFlagPrototyped, spFlags: 0)
!1637 = !DISubroutineType(types: !1638)
!1638 = !{null, !1438}
!1639 = !DISubprogram(name: "ensureLoading", linkageName: "_ZNK11xercesc_2_716XSerializeEngine13ensureLoadingEv", scope: !1382, file: !1383, line: 622, type: !1637, scopeLine: 622, flags: DIFlagPrototyped, spFlags: 0)
!1640 = !DISubprogram(name: "ensureStoreBuffer", linkageName: "_ZNK11xercesc_2_716XSerializeEngine17ensureStoreBufferEv", scope: !1382, file: !1383, line: 624, type: !1637, scopeLine: 624, flags: DIFlagPrototyped, spFlags: 0)
!1641 = !DISubprogram(name: "ensureLoadBuffer", linkageName: "_ZNK11xercesc_2_716XSerializeEngine16ensureLoadBufferEv", scope: !1382, file: !1383, line: 626, type: !1637, scopeLine: 626, flags: DIFlagPrototyped, spFlags: 0)
!1642 = !DISubprogram(name: "ensurePointer", linkageName: "_ZNK11xercesc_2_716XSerializeEngine13ensurePointerEPv", scope: !1382, file: !1383, line: 628, type: !1643, scopeLine: 628, flags: DIFlagPrototyped, spFlags: 0)
!1643 = !DISubroutineType(types: !1644)
!1644 = !{null, !1438, !1518}
!1645 = !DISubprogram(name: "ensureBufferLen", linkageName: "_ZNK11xercesc_2_716XSerializeEngine15ensureBufferLenEi", scope: !1382, file: !1383, line: 630, type: !1646, scopeLine: 630, flags: DIFlagPrototyped, spFlags: 0)
!1646 = !DISubroutineType(types: !1647)
!1647 = !{null, !1438, !430}
!1648 = !DISubprogram(name: "Assert", linkageName: "_ZNK11xercesc_2_716XSerializeEngine6AssertEbNS_10XMLExcepts5CodesE", scope: !1382, file: !1383, line: 632, type: !1649, scopeLine: 632, flags: DIFlagPrototyped, spFlags: 0)
!1649 = !DISubroutineType(types: !1650)
!1650 = !{null, !1438, !472, !1651}
!1651 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3)
!1652 = !DISubprogram(name: "calBytesNeeded", linkageName: "_ZNK11xercesc_2_716XSerializeEngine14calBytesNeededEm", scope: !1382, file: !1383, line: 636, type: !1653, scopeLine: 636, flags: DIFlagPrototyped, spFlags: 0)
!1653 = !DISubroutineType(types: !1654)
!1654 = !{!1051, !1438, !1051}
!1655 = !DISubprogram(name: "alignAdjust", linkageName: "_ZNK11xercesc_2_716XSerializeEngine11alignAdjustEm", scope: !1382, file: !1383, line: 638, type: !1653, scopeLine: 638, flags: DIFlagPrototyped, spFlags: 0)
!1656 = !DISubprogram(name: "alignBufCur", linkageName: "_ZN11xercesc_2_716XSerializeEngine11alignBufCurEm", scope: !1382, file: !1383, line: 640, type: !1657, scopeLine: 640, flags: DIFlagPrototyped, spFlags: 0)
!1657 = !DISubroutineType(types: !1658)
!1658 = !{null, !1421, !1051}
!1659 = !DISubprogram(name: "getProtoType", linkageName: "_ZNK11xercesc_2_713XSerializable12getProtoTypeEv", scope: !1361, file: !1362, line: 45, type: !1660, scopeLine: 45, containingType: !1361, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!1660 = !DISubroutineType(types: !1661)
!1661 = !{!1465, !1376}
!1662 = !DISubprogram(name: "XSerializable", scope: !1361, file: !1362, line: 48, type: !1370, scopeLine: 48, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!1663 = !DISubprogram(name: "XSerializable", scope: !1361, file: !1362, line: 49, type: !1664, scopeLine: 49, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!1664 = !DISubroutineType(types: !1665)
!1665 = !{null, !1372, !1666}
!1666 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1377, size: 64)
!1667 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_713XSerializableaSERKS0_", scope: !1361, file: !1362, line: 55, type: !1668, scopeLine: 55, flags: DIFlagPrototyped, spFlags: 0)
!1668 = !DISubroutineType(types: !1669)
!1669 = !{!1670, !1372, !1666}
!1670 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1361, size: 64)
!1671 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !1357, baseType: !1044, flags: DIFlagPublic, extraData: i32 0)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "classXMLRefInfo", scope: !1357, file: !1358, line: 88, baseType: !1466, flags: DIFlagPublic | DIFlagStaticMember)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "fDeclared", scope: !1357, file: !1358, line: 119, baseType: !472, size: 8, offset: 64)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "fUsed", scope: !1357, file: !1358, line: 120, baseType: !472, size: 8, offset: 72)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "fRefName", scope: !1357, file: !1358, line: 121, baseType: !1089, size: 64, offset: 128)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "fMemoryManager", scope: !1357, file: !1358, line: 122, baseType: !1007, size: 64, offset: 192)
!1677 = !DISubprogram(name: "XMLRefInfo", scope: !1357, file: !1358, line: 56, type: !1678, scopeLine: 56, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1678 = !DISubroutineType(types: !1679)
!1679 = !{null, !1680, !996, !1161, !1161, !1006}
!1680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1357, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!1681 = !DISubprogram(name: "~XMLRefInfo", scope: !1357, file: !1358, line: 67, type: !1682, scopeLine: 67, containingType: !1357, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!1682 = !DISubroutineType(types: !1683)
!1683 = !{null, !1680}
!1684 = !DISubprogram(name: "getDeclared", linkageName: "_ZNK11xercesc_2_710XMLRefInfo11getDeclaredEv", scope: !1357, file: !1358, line: 74, type: !1685, scopeLine: 74, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1685 = !DISubroutineType(types: !1686)
!1686 = !{!472, !1687}
!1687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1688, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!1688 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1357)
!1689 = !DISubprogram(name: "getRefName", linkageName: "_ZNK11xercesc_2_710XMLRefInfo10getRefNameEv", scope: !1357, file: !1358, line: 75, type: !1690, scopeLine: 75, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1690 = !DISubroutineType(types: !1691)
!1691 = !{!997, !1687}
!1692 = !DISubprogram(name: "getUsed", linkageName: "_ZNK11xercesc_2_710XMLRefInfo7getUsedEv", scope: !1357, file: !1358, line: 76, type: !1685, scopeLine: 76, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1693 = !DISubprogram(name: "setDeclared", linkageName: "_ZN11xercesc_2_710XMLRefInfo11setDeclaredEb", scope: !1357, file: !1358, line: 82, type: !1694, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1694 = !DISubroutineType(types: !1695)
!1695 = !{null, !1680, !1161}
!1696 = !DISubprogram(name: "setUsed", linkageName: "_ZN11xercesc_2_710XMLRefInfo7setUsedEb", scope: !1357, file: !1358, line: 83, type: !1694, scopeLine: 83, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1697 = !DISubprogram(name: "createObject", linkageName: "_ZN11xercesc_2_710XMLRefInfo12createObjectEPNS_13MemoryManagerE", scope: !1357, file: !1358, line: 88, type: !1698, scopeLine: 88, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!1698 = !DISubroutineType(types: !1699)
!1699 = !{!1460, !1007}
!1700 = !DISubprogram(name: "isSerializable", linkageName: "_ZNK11xercesc_2_710XMLRefInfo14isSerializableEv", scope: !1357, file: !1358, line: 88, type: !1685, scopeLine: 88, containingType: !1357, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!1701 = !DISubprogram(name: "getProtoType", linkageName: "_ZNK11xercesc_2_710XMLRefInfo12getProtoTypeEv", scope: !1357, file: !1358, line: 88, type: !1702, scopeLine: 88, containingType: !1357, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!1702 = !DISubroutineType(types: !1703)
!1703 = !{!1465, !1687}
!1704 = !DISubprogram(name: "serialize", linkageName: "_ZN11xercesc_2_710XMLRefInfo9serializeERNS_16XSerializeEngineE", scope: !1357, file: !1358, line: 88, type: !1705, scopeLine: 88, containingType: !1357, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!1705 = !DISubroutineType(types: !1706)
!1706 = !{null, !1680, !1381}
!1707 = !DISubprogram(name: "XMLRefInfo", scope: !1357, file: !1358, line: 90, type: !1708, scopeLine: 90, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1708 = !DISubroutineType(types: !1709)
!1709 = !{null, !1680, !1006}
!1710 = !DISubprogram(name: "XMLRefInfo", scope: !1357, file: !1358, line: 99, type: !1711, scopeLine: 99, flags: DIFlagPrototyped, spFlags: 0)
!1711 = !DISubroutineType(types: !1712)
!1712 = !{null, !1680, !1713}
!1713 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1688, size: 64)
!1714 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_710XMLRefInfoaSERS0_", scope: !1357, file: !1358, line: 100, type: !1715, scopeLine: 100, flags: DIFlagPrototyped, spFlags: 0)
!1715 = !DISubroutineType(types: !1716)
!1716 = !{!1717, !1680, !1717}
!1717 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1357, size: 64)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "fNext", scope: !1352, file: !1353, line: 60, baseType: !1351, size: 64, offset: 64)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "fKey", scope: !1352, file: !1353, line: 61, baseType: !1050, size: 64, offset: 128)
!1720 = !DISubprogram(name: "RefHashTableBucketElem", scope: !1352, file: !1353, line: 51, type: !1721, scopeLine: 51, flags: DIFlagPrototyped, spFlags: 0)
!1721 = !DISubroutineType(types: !1722)
!1722 = !{null, !1723, !1050, !1724, !1351}
!1723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!1724 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1356)
!1725 = !DISubprogram(name: "RefHashTableBucketElem", scope: !1352, file: !1353, line: 56, type: !1726, scopeLine: 56, flags: DIFlagPrototyped, spFlags: 0)
!1726 = !DISubroutineType(types: !1727)
!1727 = !{null, !1723}
!1728 = !DISubprogram(name: "~RefHashTableBucketElem", scope: !1352, file: !1353, line: 57, type: !1726, scopeLine: 57, flags: DIFlagPrototyped, spFlags: 0)
!1729 = !DISubprogram(name: "RefHashTableBucketElem", scope: !1352, file: !1353, line: 67, type: !1730, scopeLine: 67, flags: DIFlagPrivate | DIFlagPrototyped, spFlags: 0)
!1730 = !DISubroutineType(types: !1731)
!1731 = !{null, !1723, !1732}
!1732 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1733, size: 64)
!1733 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1352)
!1734 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_722RefHashTableBucketElemINS_10XMLRefInfoEEaSERKS2_", scope: !1352, file: !1353, line: 68, type: !1735, scopeLine: 68, flags: DIFlagPrivate | DIFlagPrototyped, spFlags: 0)
!1735 = !DISubroutineType(types: !1736)
!1736 = !{!1737, !1723, !1732}
!1737 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1352, size: 64)
!1738 = !{!1739}
!1739 = !DITemplateTypeParameter(name: "TVal", type: !1357)
!1740 = !{!1741, !1744, !1746, !1748, !1751}
!1741 = !DIGlobalVariableExpression(var: !1742, expr: !DIExpression(DW_OP_constu, 32, DW_OP_stack_value))
!1742 = distinct !DIGlobalVariable(name: "chSpace", scope: !6, file: !1743, line: 71, type: !998, isLocal: true, isDefinition: true)
!1743 = !DIFile(filename: "./xercesc/util/XMLUniDefs.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!1744 = !DIGlobalVariableExpression(var: !1745, expr: !DIExpression(DW_OP_constu, 58, DW_OP_stack_value))
!1745 = distinct !DIGlobalVariable(name: "chColon", scope: !6, file: !1743, line: 51, type: !998, isLocal: true, isDefinition: true)
!1746 = !DIGlobalVariableExpression(var: !1747, expr: !DIExpression(DW_OP_constu, 0, DW_OP_stack_value))
!1747 = distinct !DIGlobalVariable(name: "chNull", scope: !6, file: !1743, line: 35, type: !998, isLocal: true, isDefinition: true)
!1748 = !DIGlobalVariableExpression(var: !1749, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!1749 = distinct !DIGlobalVariable(name: "gFirstNameCharMask", scope: !6, file: !1750, line: 33, type: !975, isLocal: true, isDefinition: true)
!1750 = !DIFile(filename: "./xercesc/util/XMLChar.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!1751 = !DIGlobalVariableExpression(var: !1752, expr: !DIExpression(DW_OP_constu, 4, DW_OP_stack_value))
!1752 = distinct !DIGlobalVariable(name: "gNameCharMask", scope: !6, file: !1750, line: 34, type: !975, isLocal: true, isDefinition: true)
!1753 = !{!1754, !1755, !1762, !1766, !1772, !1776, !1781, !1783, !1788, !1792, !1796, !1806, !1810, !1814, !1818, !1820, !1824, !1828, !1832, !1834, !1838, !1846, !1850, !1854, !1856, !1858, !1862, !1866, !1872, !1876, !1880, !1882, !1890, !1894, !1902, !1904, !1908, !1912, !1916, !1920, !1925, !1929, !1934, !1935, !1936, !1937, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1947, !1948, !1949, !1950, !1951, !1952, !1953, !1958, !1959, !1960, !1961, !1962, !1963, !1964, !1965, !1966, !1967, !1968, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1977, !1978, !1979, !1980, !1981, !1982, !1988, !1992, !1998, !2002, !2006, !2010, !2014, !2016, !2018, !2022, !2026, !2030, !2034, !2038, !2040, !2042, !2044, !2048, !2052, !2056, !2058, !2060, !2061, !2063, !2118}
!1754 = !DIImportedEntity(tag: DW_TAG_imported_declaration, name: "xercesc", scope: !0, entity: !6, file: !977, line: 433)
!1755 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1756, entity: !1757, file: !1761, line: 52)
!1756 = !DINamespace(name: "std", scope: null)
!1757 = !DISubprogram(name: "abs", scope: !1758, file: !1758, line: 840, type: !1759, flags: DIFlagPrototyped, spFlags: 0)
!1758 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!1759 = !DISubroutineType(types: !1760)
!1760 = !{!430, !430}
!1761 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/std_abs.h", directory: "")
!1762 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1756, entity: !1763, file: !1765, line: 127)
!1763 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !1758, line: 62, baseType: !1764)
!1764 = !DICompositeType(tag: DW_TAG_structure_type, file: !1758, line: 58, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!1765 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cstdlib", directory: "")
!1766 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1756, entity: !1767, file: !1765, line: 128)
!1767 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !1758, line: 70, baseType: !1768)
!1768 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1758, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !1769, identifier: "_ZTS6ldiv_t")
!1769 = !{!1770, !1771}
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !1768, file: !1758, line: 68, baseType: !1085, size: 64)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !1768, file: !1758, line: 69, baseType: !1085, size: 64, offset: 64)
!1772 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1756, entity: !1773, file: !1765, line: 130)
!1773 = !DISubprogram(name: "abort", scope: !1758, file: !1758, line: 591, type: !1774, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!1774 = !DISubroutineType(types: !1775)
!1775 = !{null}
!1776 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1756, entity: !1777, file: !1765, line: 134)
!1777 = !DISubprogram(name: "atexit", scope: !1758, file: !1758, line: 595, type: !1778, flags: DIFlagPrototyped, spFlags: 0)
!1778 = !DISubroutineType(types: !1779)
!1779 = !{!430, !1780}
!1780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1774, size: 64)
!1781 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1756, entity: !1782, file: !1765, line: 137)
!1782 = !DISubprogram(name: "at_quick_exit", scope: !1758, file: !1758, line: 600, type: !1778, flags: DIFlagPrototyped, spFlags: 0)
!1783 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1756, entity: !1784, file: !1765, line: 140)
!1784 = !DISubprogram(name: "atof", scope: !1758, file: !1758, line: 101, type: !1785, flags: DIFlagPrototyped, spFlags: 0)
!1785 = !DISubroutineType(types: !1786)
!1786 = !{!1557, !1787}
!1787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!1788 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1756, entity: !1789, file: !1765, line: 141)
!1789 = !DISubprogram(name: "atoi", scope: !1758, file: !1758, line: 104, type: !1790, flags: DIFlagPrototyped, spFlags: 0)
!1790 = !DISubroutineType(types: !1791)
!1791 = !{!430, !1787}
!1792 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1756, entity: !1793, file: !1765, line: 142)
!1793 = !DISubprogram(name: "atol", scope: !1758, file: !1758, line: 107, type: !1794, flags: DIFlagPrototyped, spFlags: 0)
!1794 = !DISubroutineType(types: !1795)
!1795 = !{!1085, !1787}
!1796 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1756, entity: !1797, file: !1765, line: 143)
!1797 = !DISubprogram(name: "bsearch", scope: !1758, file: !1758, line: 820, type: !1798, flags: DIFlagPrototyped, spFlags: 0)
!1798 = !DISubroutineType(types: !1799)
!1799 = !{!1050, !1800, !1800, !1051, !1051, !1802}
!1800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1801, size: 64)
!1801 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1802 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !1758, line: 808, baseType: !1803)
!1803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1804, size: 64)
!1804 = !DISubroutineType(types: !1805)
!1805 = !{!430, !1800, !1800}
!1806 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1756, entity: !1807, file: !1765, line: 144)
!1807 = !DISubprogram(name: "calloc", scope: !1758, file: !1758, line: 542, type: !1808, flags: DIFlagPrototyped, spFlags: 0)
!1808 = !DISubroutineType(types: !1809)
!1809 = !{!1050, !1051, !1051}
!1810 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1756, entity: !1811, file: !1765, line: 145)
!1811 = !DISubprogram(name: "div", scope: !1758, file: !1758, line: 852, type: !1812, flags: DIFlagPrototyped, spFlags: 0)
!1812 = !DISubroutineType(types: !1813)
!1813 = !{!1763, !430, !430}
!1814 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1756, entity: !1815, file: !1765, line: 146)
!1815 = !DISubprogram(name: "exit", scope: !1758, file: !1758, line: 617, type: !1816, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!1816 = !DISubroutineType(types: !1817)
!1817 = !{null, !430}
!1818 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1756, entity: !1819, file: !1765, line: 147)
!1819 = !DISubprogram(name: "free", scope: !1758, file: !1758, line: 565, type: !1061, flags: DIFlagPrototyped, spFlags: 0)
!1820 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1756, entity: !1821, file: !1765, line: 148)
!1821 = !DISubprogram(name: "getenv", scope: !1758, file: !1758, line: 634, type: !1822, flags: DIFlagPrototyped, spFlags: 0)
!1822 = !DISubroutineType(types: !1823)
!1823 = !{!1611, !1787}
!1824 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1756, entity: !1825, file: !1765, line: 149)
!1825 = !DISubprogram(name: "labs", scope: !1758, file: !1758, line: 841, type: !1826, flags: DIFlagPrototyped, spFlags: 0)
!1826 = !DISubroutineType(types: !1827)
!1827 = !{!1085, !1085}
!1828 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1756, entity: !1829, file: !1765, line: 150)
!1829 = !DISubprogram(name: "ldiv", scope: !1758, file: !1758, line: 854, type: !1830, flags: DIFlagPrototyped, spFlags: 0)
!1830 = !DISubroutineType(types: !1831)
!1831 = !{!1767, !1085, !1085}
!1832 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1756, entity: !1833, file: !1765, line: 151)
!1833 = !DISubprogram(name: "malloc", scope: !1758, file: !1758, line: 539, type: !1048, flags: DIFlagPrototyped, spFlags: 0)
!1834 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1756, entity: !1835, file: !1765, line: 153)
!1835 = !DISubprogram(name: "mblen", scope: !1758, file: !1758, line: 922, type: !1836, flags: DIFlagPrototyped, spFlags: 0)
!1836 = !DISubroutineType(types: !1837)
!1837 = !{!430, !1787, !1051}
!1838 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1756, entity: !1839, file: !1765, line: 154)
!1839 = !DISubprogram(name: "mbstowcs", scope: !1758, file: !1758, line: 933, type: !1840, flags: DIFlagPrototyped, spFlags: 0)
!1840 = !DISubroutineType(types: !1841)
!1841 = !{!1051, !1842, !1845, !1051}
!1842 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1843)
!1843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1844, size: 64)
!1844 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!1845 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1787)
!1846 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1756, entity: !1847, file: !1765, line: 155)
!1847 = !DISubprogram(name: "mbtowc", scope: !1758, file: !1758, line: 925, type: !1848, flags: DIFlagPrototyped, spFlags: 0)
!1848 = !DISubroutineType(types: !1849)
!1849 = !{!430, !1842, !1845, !1051}
!1850 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1756, entity: !1851, file: !1765, line: 157)
!1851 = !DISubprogram(name: "qsort", scope: !1758, file: !1758, line: 830, type: !1852, flags: DIFlagPrototyped, spFlags: 0)
!1852 = !DISubroutineType(types: !1853)
!1853 = !{null, !1050, !1051, !1051, !1802}
!1854 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1756, entity: !1855, file: !1765, line: 160)
!1855 = !DISubprogram(name: "quick_exit", scope: !1758, file: !1758, line: 623, type: !1816, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!1856 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1756, entity: !1857, file: !1765, line: 163)
!1857 = !DISubprogram(name: "rand", scope: !1758, file: !1758, line: 453, type: !1367, flags: DIFlagPrototyped, spFlags: 0)
!1858 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1756, entity: !1859, file: !1765, line: 164)
!1859 = !DISubprogram(name: "realloc", scope: !1758, file: !1758, line: 550, type: !1860, flags: DIFlagPrototyped, spFlags: 0)
!1860 = !DISubroutineType(types: !1861)
!1861 = !{!1050, !1050, !1051}
!1862 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1756, entity: !1863, file: !1765, line: 165)
!1863 = !DISubprogram(name: "srand", scope: !1758, file: !1758, line: 455, type: !1864, flags: DIFlagPrototyped, spFlags: 0)
!1864 = !DISubroutineType(types: !1865)
!1865 = !{null, !12}
!1866 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1756, entity: !1867, file: !1765, line: 166)
!1867 = !DISubprogram(name: "strtod", scope: !1758, file: !1758, line: 117, type: !1868, flags: DIFlagPrototyped, spFlags: 0)
!1868 = !DISubroutineType(types: !1869)
!1869 = !{!1557, !1845, !1870}
!1870 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1871)
!1871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1611, size: 64)
!1872 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1756, entity: !1873, file: !1765, line: 167)
!1873 = !DISubprogram(name: "strtol", scope: !1758, file: !1758, line: 176, type: !1874, flags: DIFlagPrototyped, spFlags: 0)
!1874 = !DISubroutineType(types: !1875)
!1875 = !{!1085, !1845, !1870, !430}
!1876 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1756, entity: !1877, file: !1765, line: 168)
!1877 = !DISubprogram(name: "strtoul", scope: !1758, file: !1758, line: 180, type: !1878, flags: DIFlagPrototyped, spFlags: 0)
!1878 = !DISubroutineType(types: !1879)
!1879 = !{!1053, !1845, !1870, !430}
!1880 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1756, entity: !1881, file: !1765, line: 169)
!1881 = !DISubprogram(name: "system", scope: !1758, file: !1758, line: 784, type: !1790, flags: DIFlagPrototyped, spFlags: 0)
!1882 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1756, entity: !1883, file: !1765, line: 171)
!1883 = !DISubprogram(name: "wcstombs", scope: !1758, file: !1758, line: 936, type: !1884, flags: DIFlagPrototyped, spFlags: 0)
!1884 = !DISubroutineType(types: !1885)
!1885 = !{!1051, !1886, !1887, !1051}
!1886 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1611)
!1887 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1888)
!1888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1889, size: 64)
!1889 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1844)
!1890 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1756, entity: !1891, file: !1765, line: 172)
!1891 = !DISubprogram(name: "wctomb", scope: !1758, file: !1758, line: 929, type: !1892, flags: DIFlagPrototyped, spFlags: 0)
!1892 = !DISubroutineType(types: !1893)
!1893 = !{!430, !1611, !1844}
!1894 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1895, entity: !1896, file: !1765, line: 200)
!1895 = !DINamespace(name: "__gnu_cxx", scope: null)
!1896 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !1758, line: 80, baseType: !1897)
!1897 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1758, line: 76, size: 128, flags: DIFlagTypePassByValue, elements: !1898, identifier: "_ZTS7lldiv_t")
!1898 = !{!1899, !1901}
!1899 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !1897, file: !1758, line: 78, baseType: !1900, size: 64)
!1900 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!1901 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !1897, file: !1758, line: 79, baseType: !1900, size: 64, offset: 64)
!1902 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1895, entity: !1903, file: !1765, line: 206)
!1903 = !DISubprogram(name: "_Exit", scope: !1758, file: !1758, line: 629, type: !1816, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!1904 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1895, entity: !1905, file: !1765, line: 210)
!1905 = !DISubprogram(name: "llabs", scope: !1758, file: !1758, line: 844, type: !1906, flags: DIFlagPrototyped, spFlags: 0)
!1906 = !DISubroutineType(types: !1907)
!1907 = !{!1900, !1900}
!1908 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1895, entity: !1909, file: !1765, line: 216)
!1909 = !DISubprogram(name: "lldiv", scope: !1758, file: !1758, line: 858, type: !1910, flags: DIFlagPrototyped, spFlags: 0)
!1910 = !DISubroutineType(types: !1911)
!1911 = !{!1896, !1900, !1900}
!1912 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1895, entity: !1913, file: !1765, line: 227)
!1913 = !DISubprogram(name: "atoll", scope: !1758, file: !1758, line: 112, type: !1914, flags: DIFlagPrototyped, spFlags: 0)
!1914 = !DISubroutineType(types: !1915)
!1915 = !{!1900, !1787}
!1916 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1895, entity: !1917, file: !1765, line: 228)
!1917 = !DISubprogram(name: "strtoll", scope: !1758, file: !1758, line: 200, type: !1918, flags: DIFlagPrototyped, spFlags: 0)
!1918 = !DISubroutineType(types: !1919)
!1919 = !{!1900, !1845, !1870, !430}
!1920 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1895, entity: !1921, file: !1765, line: 229)
!1921 = !DISubprogram(name: "strtoull", scope: !1758, file: !1758, line: 205, type: !1922, flags: DIFlagPrototyped, spFlags: 0)
!1922 = !DISubroutineType(types: !1923)
!1923 = !{!1924, !1845, !1870, !430}
!1924 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1925 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1895, entity: !1926, file: !1765, line: 231)
!1926 = !DISubprogram(name: "strtof", scope: !1758, file: !1758, line: 123, type: !1927, flags: DIFlagPrototyped, spFlags: 0)
!1927 = !DISubroutineType(types: !1928)
!1928 = !{!1553, !1845, !1870}
!1929 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1895, entity: !1930, file: !1765, line: 232)
!1930 = !DISubprogram(name: "strtold", scope: !1758, file: !1758, line: 126, type: !1931, flags: DIFlagPrototyped, spFlags: 0)
!1931 = !DISubroutineType(types: !1932)
!1932 = !{!1933, !1845, !1870}
!1933 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!1934 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1756, entity: !1896, file: !1765, line: 240)
!1935 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1756, entity: !1903, file: !1765, line: 242)
!1936 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1756, entity: !1905, file: !1765, line: 244)
!1937 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1756, entity: !1938, file: !1765, line: 245)
!1938 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !1895, file: !1765, line: 213, type: !1910, flags: DIFlagPrototyped, spFlags: 0)
!1939 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1756, entity: !1909, file: !1765, line: 246)
!1940 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1756, entity: !1913, file: !1765, line: 248)
!1941 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1756, entity: !1926, file: !1765, line: 249)
!1942 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !1756, entity: !1917, file: !1765, line: 250)
