; ModuleID = 'XMLScanner.cpp'
source_filename = "XMLScanner.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"class.xercesc_2_7::XMLRegisterCleanup" = type { void ()*, %"class.xercesc_2_7::XMLRegisterCleanup"*, %"class.xercesc_2_7::XMLRegisterCleanup"* }
%"class.xercesc_2_7::XMLMsgLoader" = type { i32 (...)** }
%"class.xercesc_2_7::XMLMutex" = type { i8* }
%"class.xercesc_2_7::MemoryManager" = type { i32 (...)** }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "scannerMutexCleanup", linkageName: "_ZN11xercesc_2_7L19scannerMutexCleanupE", scope: !2, file: !3, line: 55, type: !4, isLocal: true, isDefinition: true)
!2 = !DINamespace(name: "xercesc_2_7", scope: null)
!3 = !DIFile(filename: "XMLScanner.cpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!4 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "XMLRegisterCleanup", scope: !2, file: !5, line: 41, size: 192, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !6, identifier: "_ZTSN11xercesc_2_718XMLRegisterCleanupE")
!5 = !DIFile(filename: "./xercesc/util/XMLRegisterCleanup.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!6 = !{!7, !12, !14, !15, !19, !22, !23, !24, !29, !33}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "m_cleanupFn", scope: !4, file: !5, line: 73, baseType: !8, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMLCleanupFn", scope: !4, file: !5, line: 45, baseType: !9)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DISubroutineType(types: !11)
!11 = !{null}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "m_nextCleanup", scope: !4, file: !5, line: 76, baseType: !13, size: 64, offset: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "m_prevCleanup", scope: !4, file: !5, line: 76, baseType: !13, size: 64, offset: 128)
!15 = !DISubprogram(name: "doCleanup", linkageName: "_ZN11xercesc_2_718XMLRegisterCleanup9doCleanupEv", scope: !4, file: !5, line: 47, type: !16, scopeLine: 47, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!16 = !DISubroutineType(types: !17)
!17 = !{null, !18}
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!19 = !DISubprogram(name: "registerCleanup", linkageName: "_ZN11xercesc_2_718XMLRegisterCleanup15registerCleanupEPFvvE", scope: !4, file: !5, line: 53, type: !20, scopeLine: 53, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!20 = !DISubroutineType(types: !21)
!21 = !{null, !18, !8}
!22 = !DISubprogram(name: "unregisterCleanup", linkageName: "_ZN11xercesc_2_718XMLRegisterCleanup17unregisterCleanupEv", scope: !4, file: !5, line: 59, type: !16, scopeLine: 59, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!23 = !DISubprogram(name: "XMLRegisterCleanup", scope: !4, file: !5, line: 63, type: !16, scopeLine: 63, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!24 = !DISubprogram(name: "XMLRegisterCleanup", scope: !4, file: !5, line: 69, type: !25, scopeLine: 69, flags: DIFlagPrototyped, spFlags: 0)
!25 = !DISubroutineType(types: !26)
!26 = !{null, !18, !27}
!27 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!29 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_718XMLRegisterCleanupaSERKS0_", scope: !4, file: !5, line: 70, type: !30, scopeLine: 70, flags: DIFlagPrototyped, spFlags: 0)
!30 = !DISubroutineType(types: !31)
!31 = !{!32, !18, !27}
!32 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !4, size: 64)
!33 = !DISubprogram(name: "resetCleanup", linkageName: "_ZN11xercesc_2_718XMLRegisterCleanup12resetCleanupEv", scope: !4, file: !5, line: 79, type: !16, scopeLine: 79, flags: DIFlagPrototyped, spFlags: 0)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "cleanupMsgLoader", linkageName: "_ZN11xercesc_2_7L16cleanupMsgLoaderE", scope: !2, file: !3, line: 58, type: !4, isLocal: true, isDefinition: true)
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(name: "gMsgLoader", linkageName: "_ZN11xercesc_2_7L10gMsgLoaderE", scope: !2, file: !3, line: 57, type: !38, isLocal: true, isDefinition: true)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "XMLMsgLoader", scope: !2, file: !40, line: 47, size: 64, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !41, vtableHolder: !39, identifier: "_ZTSN11xercesc_2_712XMLMsgLoaderE")
!40 = !DIFile(filename: "./xercesc/util/XMLMsgLoader.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!41 = !{!42, !75, !81, !84, !85, !92, !96, !106, !113, !119, !122, !125, !126, !127, !132, !133, !136, !140}
!42 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !39, baseType: !43, flags: DIFlagPublic, extraData: i32 0)
!43 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "XMemory", scope: !2, file: !44, line: 40, size: 8, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !45, identifier: "_ZTSN11xercesc_2_77XMemoryE")
!44 = !DIFile(filename: "./xercesc/util/XMemory.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!45 = !{!46, !53, !59, !62, !65, !68, !71}
!46 = !DISubprogram(name: "operator new", linkageName: "_ZN11xercesc_2_77XMemorynwEm", scope: !43, file: !44, line: 54, type: !47, scopeLine: 54, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!47 = !DISubroutineType(types: !48)
!48 = !{!49, !50}
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !51, line: 46, baseType: !52)
!51 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!52 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!53 = !DISubprogram(name: "operator new", linkageName: "_ZN11xercesc_2_77XMemorynwEmPNS_13MemoryManagerE", scope: !43, file: !44, line: 82, type: !54, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!54 = !DISubroutineType(types: !55)
!55 = !{!49, !50, !56}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DICompositeType(tag: DW_TAG_class_type, name: "MemoryManager", scope: !2, file: !58, line: 38, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_713MemoryManagerE")
!58 = !DIFile(filename: "./xercesc/framework/MemoryManager.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!59 = !DISubprogram(name: "operator new", linkageName: "_ZN11xercesc_2_77XMemorynwEmPv", scope: !43, file: !44, line: 90, type: !60, scopeLine: 90, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!60 = !DISubroutineType(types: !61)
!61 = !{!49, !50, !49}
!62 = !DISubprogram(name: "operator delete", linkageName: "_ZN11xercesc_2_77XMemorydlEPv", scope: !43, file: !44, line: 97, type: !63, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!63 = !DISubroutineType(types: !64)
!64 = !{null, !49}
!65 = !DISubprogram(name: "operator delete", linkageName: "_ZN11xercesc_2_77XMemorydlEPvPNS_13MemoryManagerE", scope: !43, file: !44, line: 107, type: !66, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!66 = !DISubroutineType(types: !67)
!67 = !{null, !49, !56}
!68 = !DISubprogram(name: "operator delete", linkageName: "_ZN11xercesc_2_77XMemorydlEPvS1_", scope: !43, file: !44, line: 115, type: !69, scopeLine: 115, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!69 = !DISubroutineType(types: !70)
!70 = !{null, !49, !49}
!71 = !DISubprogram(name: "XMemory", scope: !43, file: !44, line: 130, type: !72, scopeLine: 130, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!72 = !DISubroutineType(types: !73)
!73 = !{null, !74}
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$XMLMsgLoader", scope: !40, file: !40, baseType: !76, size: 64, flags: DIFlagArtificial)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !78, size: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{!80}
!80 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "fLocale", scope: !39, file: !40, line: 171, baseType: !82, flags: DIFlagStaticMember)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "fPath", scope: !39, file: !40, line: 172, baseType: !82, flags: DIFlagStaticMember)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "fLanguage", scope: !39, file: !40, line: 173, baseType: !86, flags: DIFlagStaticMember)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, elements: !90)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMLCh", file: !88, line: 67, baseType: !89)
!88 = !DIFile(filename: "./xercesc/util/Compilers/GCCDefs.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!89 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!90 = !{!91}
!91 = !DISubrange(count: -1)
!92 = !DISubprogram(name: "~XMLMsgLoader", scope: !39, file: !40, line: 63, type: !93, scopeLine: 63, containingType: !39, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!93 = !DISubroutineType(types: !94)
!94 = !{null, !95}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!96 = !DISubprogram(name: "loadMsg", linkageName: "_ZN11xercesc_2_712XMLMsgLoader7loadMsgEjPtj", scope: !39, file: !40, line: 69, type: !97, scopeLine: 69, containingType: !39, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!97 = !DISubroutineType(types: !98)
!98 = !{!99, !95, !100, !103, !105}
!99 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !101)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMLMsgId", scope: !39, file: !40, line: 57, baseType: !102)
!102 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!103 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!106 = !DISubprogram(name: "loadMsg", linkageName: "_ZN11xercesc_2_712XMLMsgLoader7loadMsgEjPtjPKtS3_S3_S3_PNS_13MemoryManagerE", scope: !39, file: !40, line: 76, type: !107, scopeLine: 76, containingType: !39, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!107 = !DISubroutineType(types: !108)
!108 = !{!99, !95, !100, !103, !105, !109, !109, !109, !109, !112}
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !87)
!112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!113 = !DISubprogram(name: "loadMsg", linkageName: "_ZN11xercesc_2_712XMLMsgLoader7loadMsgEjPtjPKcS3_S3_S3_PNS_13MemoryManagerE", scope: !39, file: !40, line: 88, type: !114, scopeLine: 88, containingType: !39, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!114 = !DISubroutineType(types: !115)
!115 = !{!99, !95, !100, !103, !105, !116, !116, !116, !116, !112}
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !83)
!119 = !DISubprogram(name: "setLocale", linkageName: "_ZN11xercesc_2_712XMLMsgLoader9setLocaleEPKc", scope: !39, file: !40, line: 108, type: !120, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!120 = !DISubroutineType(types: !121)
!121 = !{null, !116}
!122 = !DISubprogram(name: "getLocale", linkageName: "_ZN11xercesc_2_712XMLMsgLoader9getLocaleEv", scope: !39, file: !40, line: 113, type: !123, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!123 = !DISubroutineType(types: !124)
!124 = !{!117}
!125 = !DISubprogram(name: "setNLSHome", linkageName: "_ZN11xercesc_2_712XMLMsgLoader10setNLSHomeEPKc", scope: !39, file: !40, line: 125, type: !120, scopeLine: 125, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!126 = !DISubprogram(name: "getNLSHome", linkageName: "_ZN11xercesc_2_712XMLMsgLoader10getNLSHomeEv", scope: !39, file: !40, line: 130, type: !123, scopeLine: 130, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!127 = !DISubprogram(name: "getLanguageName", linkageName: "_ZNK11xercesc_2_712XMLMsgLoader15getLanguageNameEv", scope: !39, file: !40, line: 137, type: !128, scopeLine: 137, containingType: !39, virtualIndex: 5, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!128 = !DISubroutineType(types: !129)
!129 = !{!110, !130}
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!132 = !DISubprogram(name: "XMLMsgLoader", scope: !39, file: !40, line: 144, type: !93, scopeLine: 144, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!133 = !DISubprogram(name: "setLanguageName", linkageName: "_ZN11xercesc_2_712XMLMsgLoader15setLanguageNameEPt", scope: !39, file: !40, line: 149, type: !134, scopeLine: 149, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!134 = !DISubroutineType(types: !135)
!135 = !{null, !95, !103}
!136 = !DISubprogram(name: "XMLMsgLoader", scope: !39, file: !40, line: 155, type: !137, scopeLine: 155, flags: DIFlagPrototyped, spFlags: 0)
!137 = !DISubroutineType(types: !138)
!138 = !{null, !95, !139}
!139 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !131, size: 64)
!140 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_712XMLMsgLoaderaSERKS0_", scope: !39, file: !40, line: 156, type: !141, scopeLine: 156, flags: DIFlagPrototyped, spFlags: 0)
!141 = !DISubroutineType(types: !142)
!142 = !{!143, !95, !139}
!143 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !39, size: 64)
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(name: "sScannerMutex", linkageName: "_ZN11xercesc_2_7L13sScannerMutexE", scope: !2, file: !3, line: 54, type: !146, isLocal: true, isDefinition: true)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "XMLMutex", scope: !2, file: !148, line: 30, size: 64, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !149, identifier: "_ZTSN11xercesc_2_78XMLMutexE")
!148 = !DIFile(filename: "./xercesc/util/Mutexes.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!149 = !{!150, !151, !152, !156, !159, !160, !161, !166}
!150 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !147, baseType: !43, flags: DIFlagPublic, extraData: i32 0)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "fHandle", scope: !147, file: !148, line: 64, baseType: !49, size: 64)
!152 = !DISubprogram(name: "XMLMutex", scope: !147, file: !148, line: 36, type: !153, scopeLine: 36, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!153 = !DISubroutineType(types: !154)
!154 = !{null, !155, !112}
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!156 = !DISubprogram(name: "~XMLMutex", scope: !147, file: !148, line: 38, type: !157, scopeLine: 38, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!157 = !DISubroutineType(types: !158)
!158 = !{null, !155}
!159 = !DISubprogram(name: "lock", linkageName: "_ZN11xercesc_2_78XMLMutex4lockEv", scope: !147, file: !148, line: 44, type: !157, scopeLine: 44, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!160 = !DISubprogram(name: "unlock", linkageName: "_ZN11xercesc_2_78XMLMutex6unlockEv", scope: !147, file: !148, line: 45, type: !157, scopeLine: 45, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!161 = !DISubprogram(name: "XMLMutex", scope: !147, file: !148, line: 52, type: !162, scopeLine: 52, flags: DIFlagPrototyped, spFlags: 0)
!162 = !DISubroutineType(types: !163)
!163 = !{null, !155, !164}
!164 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !147)
!166 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_78XMLMutexaSERKS0_", scope: !147, file: !148, line: 53, type: !167, scopeLine: 53, flags: DIFlagPrototyped, spFlags: 0)
!167 = !DISubroutineType(types: !168)
!168 = !{!169, !155, !164}
!169 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !147, size: 64)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "sRegistered", linkageName: "_ZN11xercesc_2_7L11sRegisteredE", scope: !2, file: !3, line: 52, type: !99, isLocal: true, isDefinition: true)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "gScannerId", linkageName: "_ZN11xercesc_2_7L10gScannerIdE", scope: !2, file: !3, line: 51, type: !174, isLocal: true, isDefinition: true)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMLUInt32", file: !88, line: 73, baseType: !102)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "gCDATAStr", scope: !177, file: !3, line: 1907, type: !3677, isLocal: true, isDefinition: true)
!177 = distinct !DISubprogram(name: "senseNextToken", linkageName: "_ZN11xercesc_2_710XMLScanner14senseNextTokenERj", scope: !178, file: !3, line: 1864, type: !2977, scopeLine: 1865, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3017, declaration: !2976, retainedNodes: !3160)
!178 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "XMLScanner", scope: !2, file: !179, line: 68, size: 6208, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !180, vtableHolder: !183)
!179 = !DIFile(filename: "./xercesc/internal/XMLScanner.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!180 = !{!181, !182, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !292, !293, !294, !295, !296, !297, !495, !606, !610, !614, !618, !622, !625, !628, !632, !633, !636, !640, !646, !913, !914, !915, !916, !917, !918, !919, !920, !924, !1199, !1200, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1393, !1398, !1405, !1408, !1757, !1760, !1763, !1766, !1769, !1779, !1782, !1788, !1793, !1799, !1806, !1833, !1836, !1841, !1844, !1849, !1852, !1855, !1858, !1859, !1860, !1861, !1866, !1869, !1874, !1877, !1882, !1885, !1890, !1893, !1894, !1895, !2736, !2740, !2743, !2744, !2751, !2756, !2759, !2760, !2765, !2768, !2771, !2776, !2779, !2780, !2783, !2784, !2787, !2788, !2789, !2790, !2791, !2792, !2795, !2798, !2801, !2804, !2807, !2810, !2811, !2812, !2813, !2814, !2815, !2816, !2817, !2818, !2819, !2820, !2823, !2826, !2829, !2830, !2833, !2836, !2839, !2842, !2845, !2849, !2853, !2857, !2858, !2859, !2863, !2866, !2867, !2868, !2869, !2870, !2871, !2872, !2875, !2878, !2879, !2882, !2883, !2887, !2888, !2889, !2890, !2895, !2896, !2900, !2901, !2902, !2903, !2904, !2905, !2906, !2907, !2908, !2909, !2910, !2911, !2914, !2917, !2920, !2923, !2926, !2929, !2932, !2933, !2934, !2935, !2938, !2946, !2947, !2948, !2949, !2953, !2956, !2957, !2958, !2959, !2960, !2961, !2969, !2972, !2973, !2976, !2989, !2992, !2993, !2996, !2997, !2998, !3002, !3003, !3007, !3011, !3012, !3013, !3014}
!181 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !178, baseType: !43, flags: DIFlagPublic, extraData: i32 0)
!182 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !178, baseType: !183, flags: DIFlagPublic, extraData: i32 0)
!183 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "XMLBufferFullHandler", scope: !2, file: !184, line: 270, size: 64, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !185, vtableHolder: !183, identifier: "_ZTSN11xercesc_2_720XMLBufferFullHandlerE")
!184 = !DIFile(filename: "./xercesc/framework/XMLBuffer.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!185 = !{!186, !187, !191}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$XMLBufferFullHandler", scope: !184, file: !184, baseType: !76, size: 64, flags: DIFlagArtificial)
!187 = !DISubprogram(name: "~XMLBufferFullHandler", scope: !183, file: !184, line: 274, type: !188, scopeLine: 274, containingType: !183, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!188 = !DISubroutineType(types: !189)
!189 = !{null, !190}
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!191 = !DISubprogram(name: "bufferFull", linkageName: "_ZN11xercesc_2_720XMLBufferFullHandler10bufferFullERNS_9XMLBufferE", scope: !183, file: !184, line: 282, type: !192, scopeLine: 282, containingType: !183, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!192 = !DISubroutineType(types: !193)
!193 = !{!99, !190, !194}
!194 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !195, size: 64)
!195 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "XMLBuffer", scope: !2, file: !184, line: 51, size: 320, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !196, identifier: "_ZTSN11xercesc_2_79XMLBufferE")
!196 = !{!197, !198, !199, !200, !201, !202, !203, !205, !206, !210, !213, !216, !219, !222, !225, !226, !227, !232, !235, !236, !239, !242, !243, !247, !251, !254}
!197 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !195, baseType: !43, flags: DIFlagPublic, extraData: i32 0)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "fIndex", scope: !195, file: !184, line: 254, baseType: !102, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "fCapacity", scope: !195, file: !184, line: 255, baseType: !102, size: 32, offset: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "fFullSize", scope: !195, file: !184, line: 256, baseType: !102, size: 32, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "fUsed", scope: !195, file: !184, line: 257, baseType: !99, size: 8, offset: 96)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "fMemoryManager", scope: !195, file: !184, line: 258, baseType: !112, size: 64, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "fFullHandler", scope: !195, file: !184, line: 259, baseType: !204, size: 64, offset: 192)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "fBuffer", scope: !195, file: !184, line: 260, baseType: !104, size: 64, offset: 256)
!206 = !DISubprogram(name: "XMLBuffer", scope: !195, file: !184, line: 60, type: !207, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!207 = !DISubroutineType(types: !208)
!208 = !{null, !209, !105, !112}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!210 = !DISubprogram(name: "~XMLBuffer", scope: !195, file: !184, line: 81, type: !211, scopeLine: 81, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!211 = !DISubroutineType(types: !212)
!212 = !{null, !209}
!213 = !DISubprogram(name: "setFullHandler", linkageName: "_ZN11xercesc_2_79XMLBuffer14setFullHandlerEPNS_20XMLBufferFullHandlerEj", scope: !195, file: !184, line: 90, type: !214, scopeLine: 90, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!214 = !DISubroutineType(types: !215)
!215 = !{null, !209, !204, !105}
!216 = !DISubprogram(name: "append", linkageName: "_ZN11xercesc_2_79XMLBuffer6appendEt", scope: !195, file: !184, line: 119, type: !217, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!217 = !DISubroutineType(types: !218)
!218 = !{null, !209, !111}
!219 = !DISubprogram(name: "append", linkageName: "_ZN11xercesc_2_79XMLBuffer6appendEPKtj", scope: !195, file: !184, line: 127, type: !220, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!220 = !DISubroutineType(types: !221)
!221 = !{null, !209, !109, !105}
!222 = !DISubprogram(name: "append", linkageName: "_ZN11xercesc_2_79XMLBuffer6appendEPKt", scope: !195, file: !184, line: 141, type: !223, scopeLine: 141, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!223 = !DISubroutineType(types: !224)
!224 = !{null, !209, !109}
!225 = !DISubprogram(name: "set", linkageName: "_ZN11xercesc_2_79XMLBuffer3setEPKtj", scope: !195, file: !184, line: 156, type: !220, scopeLine: 156, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!226 = !DISubprogram(name: "set", linkageName: "_ZN11xercesc_2_79XMLBuffer3setEPKt", scope: !195, file: !184, line: 162, type: !223, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!227 = !DISubprogram(name: "getRawBuffer", linkageName: "_ZNK11xercesc_2_79XMLBuffer12getRawBufferEv", scope: !195, file: !184, line: 168, type: !228, scopeLine: 168, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!228 = !DISubroutineType(types: !229)
!229 = !{!110, !230}
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!231 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !195)
!232 = !DISubprogram(name: "getRawBuffer", linkageName: "_ZN11xercesc_2_79XMLBuffer12getRawBufferEv", scope: !195, file: !184, line: 174, type: !233, scopeLine: 174, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!233 = !DISubroutineType(types: !234)
!234 = !{!104, !209}
!235 = !DISubprogram(name: "reset", linkageName: "_ZN11xercesc_2_79XMLBuffer5resetEv", scope: !195, file: !184, line: 180, type: !211, scopeLine: 180, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!236 = !DISubprogram(name: "getInUse", linkageName: "_ZNK11xercesc_2_79XMLBuffer8getInUseEv", scope: !195, file: !184, line: 189, type: !237, scopeLine: 189, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!237 = !DISubroutineType(types: !238)
!238 = !{!99, !230}
!239 = !DISubprogram(name: "getLen", linkageName: "_ZNK11xercesc_2_79XMLBuffer6getLenEv", scope: !195, file: !184, line: 194, type: !240, scopeLine: 194, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!240 = !DISubroutineType(types: !241)
!241 = !{!102, !230}
!242 = !DISubprogram(name: "isEmpty", linkageName: "_ZNK11xercesc_2_79XMLBuffer7isEmptyEv", scope: !195, file: !184, line: 199, type: !237, scopeLine: 199, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!243 = !DISubprogram(name: "setInUse", linkageName: "_ZN11xercesc_2_79XMLBuffer8setInUseEb", scope: !195, file: !184, line: 207, type: !244, scopeLine: 207, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!244 = !DISubroutineType(types: !245)
!245 = !{null, !209, !246}
!246 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !99)
!247 = !DISubprogram(name: "XMLBuffer", scope: !195, file: !184, line: 216, type: !248, scopeLine: 216, flags: DIFlagPrototyped, spFlags: 0)
!248 = !DISubroutineType(types: !249)
!249 = !{null, !209, !250}
!250 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !231, size: 64)
!251 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_79XMLBufferaSERKS0_", scope: !195, file: !184, line: 217, type: !252, scopeLine: 217, flags: DIFlagPrototyped, spFlags: 0)
!252 = !DISubroutineType(types: !253)
!253 = !{!194, !209, !250}
!254 = !DISubprogram(name: "insureCapacity", linkageName: "_ZN11xercesc_2_79XMLBuffer14insureCapacityEj", scope: !195, file: !184, line: 227, type: !255, scopeLine: 227, flags: DIFlagPrototyped, spFlags: 0)
!255 = !DISubroutineType(types: !256)
!256 = !{null, !209, !105}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "fBufferSize", scope: !178, file: !179, line: 724, baseType: !50, size: 64, offset: 64, flags: DIFlagProtected)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "fStandardUriConformant", scope: !178, file: !179, line: 725, baseType: !99, size: 8, offset: 128, flags: DIFlagProtected)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "fCalculateSrcOfs", scope: !178, file: !179, line: 726, baseType: !99, size: 8, offset: 136, flags: DIFlagProtected)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "fDoNamespaces", scope: !178, file: !179, line: 727, baseType: !99, size: 8, offset: 144, flags: DIFlagProtected)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "fExitOnFirstFatal", scope: !178, file: !179, line: 728, baseType: !99, size: 8, offset: 152, flags: DIFlagProtected)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "fValidationConstraintFatal", scope: !178, file: !179, line: 729, baseType: !99, size: 8, offset: 160, flags: DIFlagProtected)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "fInException", scope: !178, file: !179, line: 730, baseType: !99, size: 8, offset: 168, flags: DIFlagProtected)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "fStandalone", scope: !178, file: !179, line: 731, baseType: !99, size: 8, offset: 176, flags: DIFlagProtected)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "fHasNoDTD", scope: !178, file: !179, line: 732, baseType: !99, size: 8, offset: 184, flags: DIFlagProtected)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "fValidate", scope: !178, file: !179, line: 733, baseType: !99, size: 8, offset: 192, flags: DIFlagProtected)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "fValidatorFromUser", scope: !178, file: !179, line: 734, baseType: !99, size: 8, offset: 200, flags: DIFlagProtected)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "fDoSchema", scope: !178, file: !179, line: 735, baseType: !99, size: 8, offset: 208, flags: DIFlagProtected)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "fSchemaFullChecking", scope: !178, file: !179, line: 736, baseType: !99, size: 8, offset: 216, flags: DIFlagProtected)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "fIdentityConstraintChecking", scope: !178, file: !179, line: 737, baseType: !99, size: 8, offset: 224, flags: DIFlagProtected)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "fToCacheGrammar", scope: !178, file: !179, line: 738, baseType: !99, size: 8, offset: 232, flags: DIFlagProtected)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "fUseCachedGrammar", scope: !178, file: !179, line: 739, baseType: !99, size: 8, offset: 240, flags: DIFlagProtected)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "fLoadExternalDTD", scope: !178, file: !179, line: 740, baseType: !99, size: 8, offset: 248, flags: DIFlagProtected)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "fNormalizeData", scope: !178, file: !179, line: 741, baseType: !99, size: 8, offset: 256, flags: DIFlagProtected)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "fGenerateSyntheticAnnotations", scope: !178, file: !179, line: 742, baseType: !99, size: 8, offset: 264, flags: DIFlagProtected)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "fValidateAnnotations", scope: !178, file: !179, line: 743, baseType: !99, size: 8, offset: 272, flags: DIFlagProtected)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "fIgnoreCachedDTD", scope: !178, file: !179, line: 744, baseType: !99, size: 8, offset: 280, flags: DIFlagProtected)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "fIgnoreAnnotations", scope: !178, file: !179, line: 745, baseType: !99, size: 8, offset: 288, flags: DIFlagProtected)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "fDisableDefaultEntityResolution", scope: !178, file: !179, line: 746, baseType: !99, size: 8, offset: 296, flags: DIFlagProtected)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "fSkipDTDValidation", scope: !178, file: !179, line: 747, baseType: !99, size: 8, offset: 304, flags: DIFlagProtected)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "fErrorCount", scope: !178, file: !179, line: 748, baseType: !80, size: 32, offset: 320, flags: DIFlagProtected)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "fEntityExpansionLimit", scope: !178, file: !179, line: 749, baseType: !102, size: 32, offset: 352, flags: DIFlagProtected)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "fEntityExpansionCount", scope: !178, file: !179, line: 750, baseType: !102, size: 32, offset: 384, flags: DIFlagProtected)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "fEmptyNamespaceId", scope: !178, file: !179, line: 751, baseType: !102, size: 32, offset: 416, flags: DIFlagProtected)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "fUnknownNamespaceId", scope: !178, file: !179, line: 752, baseType: !102, size: 32, offset: 448, flags: DIFlagProtected)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "fXMLNamespaceId", scope: !178, file: !179, line: 753, baseType: !102, size: 32, offset: 480, flags: DIFlagProtected)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "fXMLNSNamespaceId", scope: !178, file: !179, line: 754, baseType: !102, size: 32, offset: 512, flags: DIFlagProtected)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "fSchemaNamespaceId", scope: !178, file: !179, line: 755, baseType: !102, size: 32, offset: 544, flags: DIFlagProtected)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "fUIntPool", scope: !178, file: !179, line: 756, baseType: !290, size: 64, offset: 576, flags: DIFlagProtected)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "fUIntPoolRow", scope: !178, file: !179, line: 757, baseType: !102, size: 32, offset: 640, flags: DIFlagProtected)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "fUIntPoolCol", scope: !178, file: !179, line: 758, baseType: !102, size: 32, offset: 672, flags: DIFlagProtected)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "fUIntPoolRowTotal", scope: !178, file: !179, line: 759, baseType: !102, size: 32, offset: 704, flags: DIFlagProtected)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "fScannerId", scope: !178, file: !179, line: 760, baseType: !174, size: 32, offset: 736, flags: DIFlagProtected)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "fSequenceId", scope: !178, file: !179, line: 761, baseType: !174, size: 32, offset: 768, flags: DIFlagProtected)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "fAttrList", scope: !178, file: !179, line: 762, baseType: !298, size: 64, offset: 832, flags: DIFlagProtected)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "RefVectorOf<xercesc_2_7::XMLAttr>", scope: !2, file: !300, line: 32, size: 320, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !301, vtableHolder: !303, templateParams: !477, identifier: "_ZTSN11xercesc_2_711RefVectorOfINS_7XMLAttrEEE")
!300 = !DIFile(filename: "./xercesc/util/RefVectorOf.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!301 = !{!302, !479, !483, !486, !491}
!302 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !299, baseType: !303, flags: DIFlagPublic, extraData: i32 0)
!303 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "BaseRefVectorOf<xercesc_2_7::XMLAttr>", scope: !2, file: !304, line: 33, size: 320, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !305, vtableHolder: !303, templateParams: !477, identifier: "_ZTSN11xercesc_2_715BaseRefVectorOfINS_7XMLAttrEEE")
!304 = !DIFile(filename: "./xercesc/util/BaseRefVectorOf.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!305 = !{!306, !307, !308, !309, !310, !311, !424, !425, !429, !432, !436, !439, !440, !443, !444, !447, !448, !453, !454, !455, !460, !463, !464, !465, !468, !469, !473}
!306 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !303, baseType: !43, flags: DIFlagPublic, extraData: i32 0)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$BaseRefVectorOf", scope: !304, file: !304, baseType: !76, size: 64, flags: DIFlagArtificial)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "fAdoptedElems", scope: !303, file: !304, line: 89, baseType: !99, size: 8, offset: 64, flags: DIFlagProtected)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "fCurCount", scope: !303, file: !304, line: 90, baseType: !102, size: 32, offset: 96, flags: DIFlagProtected)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "fMaxCount", scope: !303, file: !304, line: 91, baseType: !102, size: 32, offset: 128, flags: DIFlagProtected)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "fElemList", scope: !303, file: !304, line: 92, baseType: !312, size: 64, offset: 192, flags: DIFlagProtected)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "XMLAttr", scope: !2, file: !315, line: 52, size: 448, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !316, identifier: "_ZTSN11xercesc_2_77XMLAttrE")
!315 = !DIFile(filename: "./xercesc/framework/XMLAttr.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!316 = !{!317, !318, !319, !342, !343, !344, !348, !349, !353, !354, !358, !362, !365, !368, !373, !376, !377, !378, !381, !384, !385, !388, !389, !390, !393, !396, !399, !402, !405, !408, !411, !414, !415, !419, !423}
!317 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !314, baseType: !43, flags: DIFlagPublic, extraData: i32 0)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "fSpecified", scope: !314, file: !315, line: 436, baseType: !99, size: 8)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "fType", scope: !314, file: !315, line: 437, baseType: !320, size: 32, offset: 32)
!320 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AttTypes", scope: !322, file: !321, line: 70, baseType: !80, size: 32, elements: !323, identifier: "_ZTSN11xercesc_2_79XMLAttDef8AttTypesE")
!321 = !DIFile(filename: "./xercesc/framework/XMLAttDef.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!322 = !DICompositeType(tag: DW_TAG_class_type, name: "XMLAttDef", scope: !2, file: !321, line: 51, flags: DIFlagFwdDecl)
!323 = !{!324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341}
!324 = !DIEnumerator(name: "CData", value: 0)
!325 = !DIEnumerator(name: "ID", value: 1)
!326 = !DIEnumerator(name: "IDRef", value: 2)
!327 = !DIEnumerator(name: "IDRefs", value: 3)
!328 = !DIEnumerator(name: "Entity", value: 4)
!329 = !DIEnumerator(name: "Entities", value: 5)
!330 = !DIEnumerator(name: "NmToken", value: 6)
!331 = !DIEnumerator(name: "NmTokens", value: 7)
!332 = !DIEnumerator(name: "Notation", value: 8)
!333 = !DIEnumerator(name: "Enumeration", value: 9)
!334 = !DIEnumerator(name: "Simple", value: 10)
!335 = !DIEnumerator(name: "Any_Any", value: 11)
!336 = !DIEnumerator(name: "Any_Other", value: 12)
!337 = !DIEnumerator(name: "Any_List", value: 13)
!338 = !DIEnumerator(name: "AttTypes_Count", value: 14)
!339 = !DIEnumerator(name: "AttTypes_Min", value: 0)
!340 = !DIEnumerator(name: "AttTypes_Max", value: 13)
!341 = !DIEnumerator(name: "AttTypes_Unknown", value: -1)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "fValueBufSz", scope: !314, file: !315, line: 438, baseType: !102, size: 32, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "fValue", scope: !314, file: !315, line: 439, baseType: !104, size: 64, offset: 128)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "fAttName", scope: !314, file: !315, line: 440, baseType: !345, size: 64, offset: 192)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DICompositeType(tag: DW_TAG_class_type, name: "QName", scope: !2, file: !347, line: 33, flags: DIFlagFwdDecl)
!347 = !DIFile(filename: "./xercesc/util/QName.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!348 = !DIDerivedType(tag: DW_TAG_member, name: "fMemoryManager", scope: !314, file: !315, line: 441, baseType: !56, size: 64, offset: 256)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "fDatatypeValidator", scope: !314, file: !315, line: 442, baseType: !350, size: 64, offset: 320)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DICompositeType(tag: DW_TAG_class_type, name: "DatatypeValidator", scope: !2, file: !352, line: 54, flags: DIFlagFwdDecl)
!352 = !DIFile(filename: "./xercesc/validators/datatype/DatatypeValidator.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!353 = !DIDerivedType(tag: DW_TAG_member, name: "fIsSchemaValidated", scope: !314, file: !315, line: 443, baseType: !99, size: 8, offset: 384)
!354 = !DISubprogram(name: "XMLAttr", scope: !314, file: !315, line: 68, type: !355, scopeLine: 68, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!355 = !DISubroutineType(types: !356)
!356 = !{null, !357, !112}
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!358 = !DISubprogram(name: "XMLAttr", scope: !314, file: !315, line: 102, type: !359, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!359 = !DISubroutineType(types: !360)
!360 = !{null, !357, !105, !109, !109, !109, !361, !246, !112, !350, !246}
!361 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !320)
!362 = !DISubprogram(name: "XMLAttr", scope: !314, file: !315, line: 143, type: !363, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!363 = !DISubroutineType(types: !364)
!364 = !{null, !357, !105, !109, !109, !361, !246, !112, !350, !246}
!365 = !DISubprogram(name: "~XMLAttr", scope: !314, file: !315, line: 159, type: !366, scopeLine: 159, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!366 = !DISubroutineType(types: !367)
!367 = !{null, !357}
!368 = !DISubprogram(name: "getAttName", linkageName: "_ZNK11xercesc_2_77XMLAttr10getAttNameEv", scope: !314, file: !315, line: 173, type: !369, scopeLine: 173, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!369 = !DISubroutineType(types: !370)
!370 = !{!345, !371}
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!372 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !314)
!373 = !DISubprogram(name: "getName", linkageName: "_ZNK11xercesc_2_77XMLAttr7getNameEv", scope: !314, file: !315, line: 179, type: !374, scopeLine: 179, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!374 = !DISubroutineType(types: !375)
!375 = !{!110, !371}
!376 = !DISubprogram(name: "getPrefix", linkageName: "_ZNK11xercesc_2_77XMLAttr9getPrefixEv", scope: !314, file: !315, line: 185, type: !374, scopeLine: 185, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!377 = !DISubprogram(name: "getQName", linkageName: "_ZNK11xercesc_2_77XMLAttr8getQNameEv", scope: !314, file: !315, line: 192, type: !374, scopeLine: 192, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!378 = !DISubprogram(name: "getSpecified", linkageName: "_ZNK11xercesc_2_77XMLAttr12getSpecifiedEv", scope: !314, file: !315, line: 198, type: !379, scopeLine: 198, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!379 = !DISubroutineType(types: !380)
!380 = !{!99, !371}
!381 = !DISubprogram(name: "getType", linkageName: "_ZNK11xercesc_2_77XMLAttr7getTypeEv", scope: !314, file: !315, line: 204, type: !382, scopeLine: 204, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!382 = !DISubroutineType(types: !383)
!383 = !{!320, !371}
!384 = !DISubprogram(name: "getValue", linkageName: "_ZNK11xercesc_2_77XMLAttr8getValueEv", scope: !314, file: !315, line: 211, type: !374, scopeLine: 211, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!385 = !DISubprogram(name: "getURIId", linkageName: "_ZNK11xercesc_2_77XMLAttr8getURIIdEv", scope: !314, file: !315, line: 217, type: !386, scopeLine: 217, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!386 = !DISubroutineType(types: !387)
!387 = !{!102, !371}
!388 = !DISubprogram(name: "getValidatingTypeURI", linkageName: "_ZNK11xercesc_2_77XMLAttr20getValidatingTypeURIEv", scope: !314, file: !315, line: 223, type: !374, scopeLine: 223, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!389 = !DISubprogram(name: "getValidatingTypeName", linkageName: "_ZNK11xercesc_2_77XMLAttr21getValidatingTypeNameEv", scope: !314, file: !315, line: 229, type: !374, scopeLine: 229, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!390 = !DISubprogram(name: "set", linkageName: "_ZN11xercesc_2_77XMLAttr3setEjPKtS2_S2_NS_9XMLAttDef8AttTypesEPNS_17DatatypeValidatorEb", scope: !314, file: !315, line: 269, type: !391, scopeLine: 269, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!391 = !DISubroutineType(types: !392)
!392 = !{null, !357, !105, !109, !109, !109, !361, !350, !246}
!393 = !DISubprogram(name: "set", linkageName: "_ZN11xercesc_2_77XMLAttr3setEjPKtS2_NS_9XMLAttDef8AttTypesEPNS_17DatatypeValidatorEb", scope: !314, file: !315, line: 303, type: !394, scopeLine: 303, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!394 = !DISubroutineType(types: !395)
!395 = !{null, !357, !105, !109, !109, !361, !350, !246}
!396 = !DISubprogram(name: "setName", linkageName: "_ZN11xercesc_2_77XMLAttr7setNameEjPKtS2_", scope: !314, file: !315, line: 327, type: !397, scopeLine: 327, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!397 = !DISubroutineType(types: !398)
!398 = !{null, !357, !105, !109, !109}
!399 = !DISubprogram(name: "setSpecified", linkageName: "_ZN11xercesc_2_77XMLAttr12setSpecifiedEb", scope: !314, file: !315, line: 341, type: !400, scopeLine: 341, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!400 = !DISubroutineType(types: !401)
!401 = !{null, !357, !246}
!402 = !DISubprogram(name: "setType", linkageName: "_ZN11xercesc_2_77XMLAttr7setTypeENS_9XMLAttDef8AttTypesE", scope: !314, file: !315, line: 351, type: !403, scopeLine: 351, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!403 = !DISubroutineType(types: !404)
!404 = !{null, !357, !361}
!405 = !DISubprogram(name: "setValue", linkageName: "_ZN11xercesc_2_77XMLAttr8setValueEPKt", scope: !314, file: !315, line: 360, type: !406, scopeLine: 360, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!406 = !DISubroutineType(types: !407)
!407 = !{null, !357, !109}
!408 = !DISubprogram(name: "setURIId", linkageName: "_ZN11xercesc_2_77XMLAttr8setURIIdEj", scope: !314, file: !315, line: 369, type: !409, scopeLine: 369, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!409 = !DISubroutineType(types: !410)
!410 = !{null, !357, !105}
!411 = !DISubprogram(name: "setDatatypeValidator", linkageName: "_ZN11xercesc_2_77XMLAttr20setDatatypeValidatorEPNS_17DatatypeValidatorE", scope: !314, file: !315, line: 378, type: !412, scopeLine: 378, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!412 = !DISubroutineType(types: !413)
!413 = !{null, !357, !350}
!414 = !DISubprogram(name: "setSchemaValidated", linkageName: "_ZN11xercesc_2_77XMLAttr18setSchemaValidatedEb", scope: !314, file: !315, line: 387, type: !400, scopeLine: 387, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!415 = !DISubprogram(name: "XMLAttr", scope: !314, file: !315, line: 397, type: !416, scopeLine: 397, flags: DIFlagPrototyped, spFlags: 0)
!416 = !DISubroutineType(types: !417)
!417 = !{null, !357, !418}
!418 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !372, size: 64)
!419 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_77XMLAttraSERKS0_", scope: !314, file: !315, line: 398, type: !420, scopeLine: 398, flags: DIFlagPrototyped, spFlags: 0)
!420 = !DISubroutineType(types: !421)
!421 = !{!422, !357, !418}
!422 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !314, size: 64)
!423 = !DISubprogram(name: "cleanUp", linkageName: "_ZN11xercesc_2_77XMLAttr7cleanUpEv", scope: !314, file: !315, line: 404, type: !366, scopeLine: 404, flags: DIFlagPrototyped, spFlags: 0)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "fMemoryManager", scope: !303, file: !304, line: 93, baseType: !56, size: 64, offset: 256, flags: DIFlagProtected)
!425 = !DISubprogram(name: "BaseRefVectorOf", scope: !303, file: !304, line: 39, type: !426, scopeLine: 39, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!426 = !DISubroutineType(types: !427)
!427 = !{null, !428, !105, !246, !112}
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!429 = !DISubprogram(name: "~BaseRefVectorOf", scope: !303, file: !304, line: 45, type: !430, scopeLine: 45, containingType: !303, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!430 = !DISubroutineType(types: !431)
!431 = !{null, !428}
!432 = !DISubprogram(name: "addElement", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfINS_7XMLAttrEE10addElementEPS1_", scope: !303, file: !304, line: 51, type: !433, scopeLine: 51, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!433 = !DISubroutineType(types: !434)
!434 = !{null, !428, !435}
!435 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !313)
!436 = !DISubprogram(name: "setElementAt", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfINS_7XMLAttrEE12setElementAtEPS1_j", scope: !303, file: !304, line: 52, type: !437, scopeLine: 52, containingType: !303, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!437 = !DISubroutineType(types: !438)
!438 = !{null, !428, !435, !105}
!439 = !DISubprogram(name: "insertElementAt", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfINS_7XMLAttrEE15insertElementAtEPS1_j", scope: !303, file: !304, line: 53, type: !437, scopeLine: 53, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!440 = !DISubprogram(name: "orphanElementAt", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfINS_7XMLAttrEE15orphanElementAtEj", scope: !303, file: !304, line: 54, type: !441, scopeLine: 54, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!441 = !DISubroutineType(types: !442)
!442 = !{!313, !428, !105}
!443 = !DISubprogram(name: "removeAllElements", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfINS_7XMLAttrEE17removeAllElementsEv", scope: !303, file: !304, line: 55, type: !430, scopeLine: 55, containingType: !303, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!444 = !DISubprogram(name: "removeElementAt", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfINS_7XMLAttrEE15removeElementAtEj", scope: !303, file: !304, line: 56, type: !445, scopeLine: 56, containingType: !303, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!445 = !DISubroutineType(types: !446)
!446 = !{null, !428, !105}
!447 = !DISubprogram(name: "removeLastElement", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfINS_7XMLAttrEE17removeLastElementEv", scope: !303, file: !304, line: 57, type: !430, scopeLine: 57, containingType: !303, virtualIndex: 5, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!448 = !DISubprogram(name: "containsElement", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfINS_7XMLAttrEE15containsElementEPKS1_", scope: !303, file: !304, line: 58, type: !449, scopeLine: 58, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!449 = !DISubroutineType(types: !450)
!450 = !{!99, !428, !451}
!451 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !452)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!453 = !DISubprogram(name: "cleanup", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfINS_7XMLAttrEE7cleanupEv", scope: !303, file: !304, line: 59, type: !430, scopeLine: 59, containingType: !303, virtualIndex: 6, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!454 = !DISubprogram(name: "reinitialize", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfINS_7XMLAttrEE12reinitializeEv", scope: !303, file: !304, line: 60, type: !430, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!455 = !DISubprogram(name: "curCapacity", linkageName: "_ZNK11xercesc_2_715BaseRefVectorOfINS_7XMLAttrEE11curCapacityEv", scope: !303, file: !304, line: 66, type: !456, scopeLine: 66, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!456 = !DISubroutineType(types: !457)
!457 = !{!102, !458}
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!459 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !303)
!460 = !DISubprogram(name: "elementAt", linkageName: "_ZNK11xercesc_2_715BaseRefVectorOfINS_7XMLAttrEE9elementAtEj", scope: !303, file: !304, line: 67, type: !461, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!461 = !DISubroutineType(types: !462)
!462 = !{!452, !458, !105}
!463 = !DISubprogram(name: "elementAt", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfINS_7XMLAttrEE9elementAtEj", scope: !303, file: !304, line: 68, type: !441, scopeLine: 68, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!464 = !DISubprogram(name: "size", linkageName: "_ZNK11xercesc_2_715BaseRefVectorOfINS_7XMLAttrEE4sizeEv", scope: !303, file: !304, line: 69, type: !456, scopeLine: 69, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!465 = !DISubprogram(name: "getMemoryManager", linkageName: "_ZNK11xercesc_2_715BaseRefVectorOfINS_7XMLAttrEE16getMemoryManagerEv", scope: !303, file: !304, line: 70, type: !466, scopeLine: 70, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!466 = !DISubroutineType(types: !467)
!467 = !{!56, !458}
!468 = !DISubprogram(name: "ensureExtraCapacity", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfINS_7XMLAttrEE19ensureExtraCapacityEj", scope: !303, file: !304, line: 76, type: !445, scopeLine: 76, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!469 = !DISubprogram(name: "BaseRefVectorOf", scope: !303, file: !304, line: 82, type: !470, scopeLine: 82, flags: DIFlagPrototyped, spFlags: 0)
!470 = !DISubroutineType(types: !471)
!471 = !{null, !428, !472}
!472 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !459, size: 64)
!473 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_715BaseRefVectorOfINS_7XMLAttrEEaSERKS2_", scope: !303, file: !304, line: 83, type: !474, scopeLine: 83, flags: DIFlagPrototyped, spFlags: 0)
!474 = !DISubroutineType(types: !475)
!475 = !{!476, !428, !472}
!476 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !303, size: 64)
!477 = !{!478}
!478 = !DITemplateTypeParameter(name: "TElem", type: !314)
!479 = !DISubprogram(name: "RefVectorOf", scope: !299, file: !300, line: 38, type: !480, scopeLine: 38, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!480 = !DISubroutineType(types: !481)
!481 = !{null, !482, !105, !246, !112}
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!483 = !DISubprogram(name: "~RefVectorOf", scope: !299, file: !300, line: 45, type: !484, scopeLine: 45, containingType: !299, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!484 = !DISubroutineType(types: !485)
!485 = !{null, !482}
!486 = !DISubprogram(name: "RefVectorOf", scope: !299, file: !300, line: 51, type: !487, scopeLine: 51, flags: DIFlagPrototyped, spFlags: 0)
!487 = !DISubroutineType(types: !488)
!488 = !{null, !482, !489}
!489 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !299)
!491 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_711RefVectorOfINS_7XMLAttrEEaSERKS2_", scope: !299, file: !300, line: 52, type: !492, scopeLine: 52, flags: DIFlagPrototyped, spFlags: 0)
!492 = !DISubroutineType(types: !493)
!493 = !{!494, !482, !489}
!494 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !299, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "fAttrDupChkRegistry", scope: !178, file: !179, line: 763, baseType: !496, size: 64, offset: 896, flags: DIFlagProtected)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "RefHash2KeysTableOf<xercesc_2_7::XMLAttr>", scope: !2, file: !498, line: 72, size: 320, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !499, templateParams: !528, identifier: "_ZTSN11xercesc_2_719RefHash2KeysTableOfINS_7XMLAttrEEE")
!498 = !DIFile(filename: "./xercesc/util/RefHash2KeysTableOf.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!499 = !{!500, !501, !502, !503, !530, !531, !532, !536, !540, !543, !546, !549, !554, !561, !564, !567, !568, !571, !574, !577, !580, !583, !586, !590, !594, !598, !602, !605}
!500 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !497, baseType: !43, flags: DIFlagPublic, extraData: i32 0)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "fMemoryManager", scope: !497, file: !498, line: 173, baseType: !56, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "fAdoptedElems", scope: !497, file: !498, line: 174, baseType: !99, size: 8, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "fBucketList", scope: !497, file: !498, line: 175, baseType: !504, size: 64, offset: 128)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RefHash2KeysTableBucketElem<xercesc_2_7::XMLAttr>", scope: !2, file: !498, line: 50, size: 256, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !507, templateParams: !528, identifier: "_ZTSN11xercesc_2_727RefHash2KeysTableBucketElemINS_7XMLAttrEEE")
!507 = !{!508, !509, !510, !511, !512, !516, !519, !524}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "fData", scope: !506, file: !498, line: 58, baseType: !313, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "fNext", scope: !506, file: !498, line: 59, baseType: !505, size: 64, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "fKey1", scope: !506, file: !498, line: 60, baseType: !49, size: 64, offset: 128)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "fKey2", scope: !506, file: !498, line: 61, baseType: !80, size: 32, offset: 192)
!512 = !DISubprogram(name: "RefHash2KeysTableBucketElem", scope: !506, file: !498, line: 52, type: !513, scopeLine: 52, flags: DIFlagPrototyped, spFlags: 0)
!513 = !DISubroutineType(types: !514)
!514 = !{null, !515, !49, !80, !435, !505}
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!516 = !DISubprogram(name: "~RefHash2KeysTableBucketElem", scope: !506, file: !498, line: 56, type: !517, scopeLine: 56, flags: DIFlagPrototyped, spFlags: 0)
!517 = !DISubroutineType(types: !518)
!518 = !{null, !515}
!519 = !DISubprogram(name: "RefHash2KeysTableBucketElem", scope: !506, file: !498, line: 67, type: !520, scopeLine: 67, flags: DIFlagPrivate | DIFlagPrototyped, spFlags: 0)
!520 = !DISubroutineType(types: !521)
!521 = !{null, !515, !522}
!522 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !523, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !506)
!524 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_727RefHash2KeysTableBucketElemINS_7XMLAttrEEaSERKS2_", scope: !506, file: !498, line: 68, type: !525, scopeLine: 68, flags: DIFlagPrivate | DIFlagPrototyped, spFlags: 0)
!525 = !DISubroutineType(types: !526)
!526 = !{!527, !515, !522}
!527 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !506, size: 64)
!528 = !{!529}
!529 = !DITemplateTypeParameter(name: "TVal", type: !314)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "fHashModulus", scope: !497, file: !498, line: 176, baseType: !102, size: 32, offset: 192)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "fCount", scope: !497, file: !498, line: 177, baseType: !102, size: 32, offset: 224)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "fHash", scope: !497, file: !498, line: 178, baseType: !533, size: 64, offset: 256)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DICompositeType(tag: DW_TAG_class_type, name: "HashBase", scope: !2, file: !535, line: 32, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_78HashBaseE")
!535 = !DIFile(filename: "./xercesc/util/HashBase.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!536 = !DISubprogram(name: "RefHash2KeysTableOf", scope: !497, file: !498, line: 79, type: !537, scopeLine: 79, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!537 = !DISubroutineType(types: !538)
!538 = !{null, !539, !105, !112}
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!540 = !DISubprogram(name: "RefHash2KeysTableOf", scope: !497, file: !498, line: 85, type: !541, scopeLine: 85, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!541 = !DISubroutineType(types: !542)
!542 = !{null, !539, !105, !246, !112}
!543 = !DISubprogram(name: "RefHash2KeysTableOf", scope: !497, file: !498, line: 94, type: !544, scopeLine: 94, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!544 = !DISubroutineType(types: !545)
!545 = !{null, !539, !105, !246, !533, !112}
!546 = !DISubprogram(name: "~RefHash2KeysTableOf", scope: !497, file: !498, line: 101, type: !547, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!547 = !DISubroutineType(types: !548)
!548 = !{null, !539}
!549 = !DISubprogram(name: "isEmpty", linkageName: "_ZNK11xercesc_2_719RefHash2KeysTableOfINS_7XMLAttrEE7isEmptyEv", scope: !497, file: !498, line: 107, type: !550, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!550 = !DISubroutineType(types: !551)
!551 = !{!99, !552}
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!553 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !497)
!554 = !DISubprogram(name: "containsKey", linkageName: "_ZNK11xercesc_2_719RefHash2KeysTableOfINS_7XMLAttrEE11containsKeyEPKvi", scope: !497, file: !498, line: 108, type: !555, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!555 = !DISubroutineType(types: !556)
!556 = !{!99, !552, !557, !560}
!557 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !558)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!560 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !80)
!561 = !DISubprogram(name: "removeKey", linkageName: "_ZN11xercesc_2_719RefHash2KeysTableOfINS_7XMLAttrEE9removeKeyEPKvi", scope: !497, file: !498, line: 109, type: !562, scopeLine: 109, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!562 = !DISubroutineType(types: !563)
!563 = !{null, !539, !557, !560}
!564 = !DISubprogram(name: "removeKey", linkageName: "_ZN11xercesc_2_719RefHash2KeysTableOfINS_7XMLAttrEE9removeKeyEPKv", scope: !497, file: !498, line: 110, type: !565, scopeLine: 110, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!565 = !DISubroutineType(types: !566)
!566 = !{null, !539, !557}
!567 = !DISubprogram(name: "removeAll", linkageName: "_ZN11xercesc_2_719RefHash2KeysTableOfINS_7XMLAttrEE9removeAllEv", scope: !497, file: !498, line: 111, type: !547, scopeLine: 111, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!568 = !DISubprogram(name: "transferElement", linkageName: "_ZN11xercesc_2_719RefHash2KeysTableOfINS_7XMLAttrEE15transferElementEPKvPv", scope: !497, file: !498, line: 112, type: !569, scopeLine: 112, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!569 = !DISubroutineType(types: !570)
!570 = !{null, !539, !557, !49}
!571 = !DISubprogram(name: "get", linkageName: "_ZN11xercesc_2_719RefHash2KeysTableOfINS_7XMLAttrEE3getEPKvi", scope: !497, file: !498, line: 117, type: !572, scopeLine: 117, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!572 = !DISubroutineType(types: !573)
!573 = !{!313, !539, !557, !560}
!574 = !DISubprogram(name: "get", linkageName: "_ZNK11xercesc_2_719RefHash2KeysTableOfINS_7XMLAttrEE3getEPKvi", scope: !497, file: !498, line: 118, type: !575, scopeLine: 118, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!575 = !DISubroutineType(types: !576)
!576 = !{!452, !552, !557, !560}
!577 = !DISubprogram(name: "getMemoryManager", linkageName: "_ZNK11xercesc_2_719RefHash2KeysTableOfINS_7XMLAttrEE16getMemoryManagerEv", scope: !497, file: !498, line: 120, type: !578, scopeLine: 120, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!578 = !DISubroutineType(types: !579)
!579 = !{!56, !552}
!580 = !DISubprogram(name: "getHashModulus", linkageName: "_ZNK11xercesc_2_719RefHash2KeysTableOfINS_7XMLAttrEE14getHashModulusEv", scope: !497, file: !498, line: 121, type: !581, scopeLine: 121, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!581 = !DISubroutineType(types: !582)
!582 = !{!102, !552}
!583 = !DISubprogram(name: "put", linkageName: "_ZN11xercesc_2_719RefHash2KeysTableOfINS_7XMLAttrEE3putEPviPS1_", scope: !497, file: !498, line: 126, type: !584, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!584 = !DISubroutineType(types: !585)
!585 = !{null, !539, !49, !80, !435}
!586 = !DISubprogram(name: "RefHash2KeysTableOf", scope: !497, file: !498, line: 139, type: !587, scopeLine: 139, flags: DIFlagPrototyped, spFlags: 0)
!587 = !DISubroutineType(types: !588)
!588 = !{null, !539, !589}
!589 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !553, size: 64)
!590 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_719RefHash2KeysTableOfINS_7XMLAttrEEaSERKS2_", scope: !497, file: !498, line: 140, type: !591, scopeLine: 140, flags: DIFlagPrototyped, spFlags: 0)
!591 = !DISubroutineType(types: !592)
!592 = !{!593, !539, !589}
!593 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !497, size: 64)
!594 = !DISubprogram(name: "findBucketElem", linkageName: "_ZN11xercesc_2_719RefHash2KeysTableOfINS_7XMLAttrEE14findBucketElemEPKviRj", scope: !497, file: !498, line: 145, type: !595, scopeLine: 145, flags: DIFlagPrototyped, spFlags: 0)
!595 = !DISubroutineType(types: !596)
!596 = !{!505, !539, !557, !560, !597}
!597 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !102, size: 64)
!598 = !DISubprogram(name: "findBucketElem", linkageName: "_ZNK11xercesc_2_719RefHash2KeysTableOfINS_7XMLAttrEE14findBucketElemEPKviRj", scope: !497, file: !498, line: 146, type: !599, scopeLine: 146, flags: DIFlagPrototyped, spFlags: 0)
!599 = !DISubroutineType(types: !600)
!600 = !{!601, !552, !557, !560, !597}
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!602 = !DISubprogram(name: "initialize", linkageName: "_ZN11xercesc_2_719RefHash2KeysTableOfINS_7XMLAttrEE10initializeEj", scope: !497, file: !498, line: 147, type: !603, scopeLine: 147, flags: DIFlagPrototyped, spFlags: 0)
!603 = !DISubroutineType(types: !604)
!604 = !{null, !539, !105}
!605 = !DISubprogram(name: "rehash", linkageName: "_ZN11xercesc_2_719RefHash2KeysTableOfINS_7XMLAttrEE6rehashEv", scope: !497, file: !498, line: 148, type: !547, scopeLine: 148, flags: DIFlagPrototyped, spFlags: 0)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "fDocHandler", scope: !178, file: !179, line: 764, baseType: !607, size: 64, offset: 960, flags: DIFlagProtected)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DICompositeType(tag: DW_TAG_class_type, name: "XMLDocumentHandler", scope: !2, file: !609, line: 42, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_718XMLDocumentHandlerE")
!609 = !DIFile(filename: "./xercesc/framework/XMLDocumentHandler.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!610 = !DIDerivedType(tag: DW_TAG_member, name: "fDocTypeHandler", scope: !178, file: !179, line: 765, baseType: !611, size: 64, offset: 1024, flags: DIFlagProtected)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DICompositeType(tag: DW_TAG_class_type, name: "DocTypeHandler", scope: !2, file: !613, line: 39, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_714DocTypeHandlerE")
!613 = !DIFile(filename: "./xercesc/validators/DTD/DocTypeHandler.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!614 = !DIDerivedType(tag: DW_TAG_member, name: "fEntityHandler", scope: !178, file: !179, line: 766, baseType: !615, size: 64, offset: 1088, flags: DIFlagProtected)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DICompositeType(tag: DW_TAG_class_type, name: "XMLEntityHandler", scope: !2, file: !617, line: 43, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_716XMLEntityHandlerE")
!617 = !DIFile(filename: "./xercesc/framework/XMLEntityHandler.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!618 = !DIDerivedType(tag: DW_TAG_member, name: "fErrorReporter", scope: !178, file: !179, line: 767, baseType: !619, size: 64, offset: 1152, flags: DIFlagProtected)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DICompositeType(tag: DW_TAG_class_type, name: "XMLErrorReporter", scope: !2, file: !621, line: 42, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_716XMLErrorReporterE")
!621 = !DIFile(filename: "./xercesc/framework/XMLErrorReporter.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!622 = !DIDerivedType(tag: DW_TAG_member, name: "fErrorHandler", scope: !178, file: !179, line: 768, baseType: !623, size: 64, offset: 1216, flags: DIFlagProtected)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DICompositeType(tag: DW_TAG_class_type, name: "ErrorHandler", scope: !2, file: !179, line: 43, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_712ErrorHandlerE")
!625 = !DIDerivedType(tag: DW_TAG_member, name: "fPSVIHandler", scope: !178, file: !179, line: 769, baseType: !626, size: 64, offset: 1280, flags: DIFlagProtected)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DICompositeType(tag: DW_TAG_class_type, name: "PSVIHandler", scope: !2, file: !179, line: 50, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_711PSVIHandlerE")
!628 = !DIDerivedType(tag: DW_TAG_member, name: "fValidationContext", scope: !178, file: !179, line: 770, baseType: !629, size: 64, offset: 1344, flags: DIFlagProtected)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DICompositeType(tag: DW_TAG_class_type, name: "ValidationContext", scope: !2, file: !631, line: 35, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_717ValidationContextE")
!631 = !DIFile(filename: "./xercesc/framework/ValidationContext.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!632 = !DIDerivedType(tag: DW_TAG_member, name: "fEntityDeclPoolRetrieved", scope: !178, file: !179, line: 771, baseType: !99, size: 8, offset: 1408, flags: DIFlagProtected)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "fReaderMgr", scope: !178, file: !179, line: 772, baseType: !634, size: 640, offset: 1472, flags: DIFlagProtected)
!634 = !DICompositeType(tag: DW_TAG_class_type, name: "ReaderMgr", scope: !2, file: !635, line: 47, flags: DIFlagFwdDecl)
!635 = !DIFile(filename: "./xercesc/internal/ReaderMgr.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!636 = !DIDerivedType(tag: DW_TAG_member, name: "fValidator", scope: !178, file: !179, line: 773, baseType: !637, size: 64, offset: 2112, flags: DIFlagProtected)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DICompositeType(tag: DW_TAG_class_type, name: "XMLValidator", scope: !2, file: !639, line: 52, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_712XMLValidatorE")
!639 = !DIFile(filename: "./xercesc/framework/XMLValidator.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!640 = !DIDerivedType(tag: DW_TAG_member, name: "fValScheme", scope: !178, file: !179, line: 774, baseType: !641, size: 32, offset: 2176, flags: DIFlagProtected)
!641 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ValSchemes", scope: !178, file: !179, line: 119, baseType: !102, size: 32, elements: !642, identifier: "_ZTSN11xercesc_2_710XMLScanner10ValSchemesE")
!642 = !{!643, !644, !645}
!643 = !DIEnumerator(name: "Val_Never", value: 0, isUnsigned: true)
!644 = !DIEnumerator(name: "Val_Always", value: 1, isUnsigned: true)
!645 = !DIEnumerator(name: "Val_Auto", value: 2, isUnsigned: true)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "fGrammarResolver", scope: !178, file: !179, line: 775, baseType: !647, size: 64, offset: 2240, flags: DIFlagProtected)
!647 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !648)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "GrammarResolver", scope: !2, file: !650, line: 41, size: 640, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !651, identifier: "_ZTSN11xercesc_2_715GrammarResolverE")
!650 = !DIFile(filename: "./xercesc/validators/common/GrammarResolver.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!651 = !{!652, !653, !654, !655, !656, !660, !664, !665, !668, !669, !673, !839, !840, !844, !849, !852, !855, !864, !867, !873, !874, !875, !878, !881, !884, !887, !890, !891, !895, !896, !897, !898, !899, !902, !905, !909}
!652 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !649, baseType: !43, flags: DIFlagPublic, extraData: i32 0)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "fCacheGrammar", scope: !649, file: !650, line: 216, baseType: !99, size: 8)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "fUseCachedGrammar", scope: !649, file: !650, line: 217, baseType: !99, size: 8, offset: 8)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "fGrammarPoolFromExternalApplication", scope: !649, file: !650, line: 218, baseType: !99, size: 8, offset: 16)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "fStringPool", scope: !649, file: !650, line: 219, baseType: !657, size: 64, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DICompositeType(tag: DW_TAG_class_type, name: "XMLStringPool", scope: !2, file: !659, line: 43, flags: DIFlagFwdDecl)
!659 = !DIFile(filename: "./xercesc/util/StringPool.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!660 = !DIDerivedType(tag: DW_TAG_member, name: "fGrammarBucket", scope: !649, file: !650, line: 220, baseType: !661, size: 64, offset: 128)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DICompositeType(tag: DW_TAG_class_type, name: "RefHashTableOf<xercesc_2_7::Grammar>", scope: !2, file: !663, line: 72, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_714RefHashTableOfINS_7GrammarEEE")
!663 = !DIFile(filename: "./xercesc/util/RefHashTableOf.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!664 = !DIDerivedType(tag: DW_TAG_member, name: "fGrammarFromPool", scope: !649, file: !650, line: 221, baseType: !661, size: 64, offset: 192)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "fDataTypeReg", scope: !649, file: !650, line: 222, baseType: !666, size: 64, offset: 256)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DICompositeType(tag: DW_TAG_class_type, name: "DatatypeValidatorFactory", scope: !2, file: !352, line: 400, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_724DatatypeValidatorFactoryE")
!668 = !DIDerivedType(tag: DW_TAG_member, name: "fMemoryManager", scope: !649, file: !650, line: 223, baseType: !56, size: 64, offset: 320)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "fGrammarPool", scope: !649, file: !650, line: 224, baseType: !670, size: 64, offset: 384)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DICompositeType(tag: DW_TAG_class_type, name: "XMLGrammarPool", scope: !2, file: !672, line: 42, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_714XMLGrammarPoolE")
!672 = !DIFile(filename: "./xercesc/framework/XMLGrammarPool.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!673 = !DIDerivedType(tag: DW_TAG_member, name: "fXSModel", scope: !649, file: !650, line: 225, baseType: !674, size: 64, offset: 448)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "XSModel", scope: !2, file: !676, line: 58, size: 2432, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !677, identifier: "_ZTSN11xercesc_2_77XSModelE")
!676 = !DIFile(filename: "./xercesc/framework/psvi/XSModel.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!677 = !{!678, !679, !680, !686, !690, !696, !701, !702, !706, !709, !713, !715, !716, !717, !718, !722, !725, !728, !731, !734, !759, !762, !765, !770, !775, !781, !786, !791, !796, !802, !805, !810, !813, !816, !823, !827, !830, !835}
!678 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !675, baseType: !43, flags: DIFlagPublic, extraData: i32 0)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "fMemoryManager", scope: !675, file: !676, line: 286, baseType: !112, size: 64, flags: DIFlagProtected)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "fNamespaceStringList", scope: !675, file: !676, line: 288, baseType: !681, size: 64, offset: 64, flags: DIFlagProtected)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "StringList", scope: !2, file: !683, line: 53, baseType: !684)
!683 = !DIFile(filename: "./xercesc/framework/psvi/XSConstants.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!684 = !DICompositeType(tag: DW_TAG_class_type, name: "RefArrayVectorOf<unsigned short>", scope: !2, file: !685, line: 28, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_716RefArrayVectorOfItEE")
!685 = !DIFile(filename: "./xercesc/util/RefArrayVectorOf.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!686 = !DIDerivedType(tag: DW_TAG_member, name: "fXSNamespaceItemList", scope: !675, file: !676, line: 289, baseType: !687, size: 64, offset: 128, flags: DIFlagProtected)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "XSNamespaceItemList", scope: !2, file: !683, line: 50, baseType: !689)
!689 = !DICompositeType(tag: DW_TAG_class_type, name: "RefVectorOf<xercesc_2_7::XSNamespaceItem>", scope: !2, file: !300, line: 32, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_711RefVectorOfINS_15XSNamespaceItemEEE")
!690 = !DIDerivedType(tag: DW_TAG_member, name: "fIdVector", scope: !675, file: !676, line: 291, baseType: !691, size: 896, offset: 192, flags: DIFlagProtected)
!691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !692, size: 896, elements: !694)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DICompositeType(tag: DW_TAG_class_type, name: "RefVectorOf<xercesc_2_7::XSObject>", scope: !2, file: !300, line: 32, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_711RefVectorOfINS_8XSObjectEEE")
!694 = !{!695}
!695 = !DISubrange(count: 14)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "fComponentMap", scope: !675, file: !676, line: 309, baseType: !697, size: 896, offset: 1088, flags: DIFlagProtected)
!697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !698, size: 896, elements: !694)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DICompositeType(tag: DW_TAG_class_type, name: "XSNamedMap<xercesc_2_7::XSObject>", scope: !2, file: !700, line: 40, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_710XSNamedMapINS_8XSObjectEEE")
!700 = !DIFile(filename: "./xercesc/framework/psvi/XSNamedMap.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!701 = !DIDerivedType(tag: DW_TAG_member, name: "fURIStringPool", scope: !675, file: !676, line: 310, baseType: !657, size: 64, offset: 1984, flags: DIFlagProtected)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "fXSAnnotationList", scope: !675, file: !676, line: 311, baseType: !703, size: 64, offset: 2048, flags: DIFlagProtected)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "XSAnnotationList", scope: !2, file: !683, line: 46, baseType: !705)
!705 = !DICompositeType(tag: DW_TAG_class_type, name: "RefVectorOf<xercesc_2_7::XSAnnotation>", scope: !2, file: !300, line: 32, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_711RefVectorOfINS_12XSAnnotationEEE")
!706 = !DIDerivedType(tag: DW_TAG_member, name: "fHashNamespace", scope: !675, file: !676, line: 312, baseType: !707, size: 64, offset: 2112, flags: DIFlagProtected)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DICompositeType(tag: DW_TAG_class_type, name: "RefHashTableOf<xercesc_2_7::XSNamespaceItem>", scope: !2, file: !663, line: 72, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_714RefHashTableOfINS_15XSNamespaceItemEEE")
!709 = !DIDerivedType(tag: DW_TAG_member, name: "fObjFactory", scope: !675, file: !676, line: 313, baseType: !710, size: 64, offset: 2176, flags: DIFlagProtected)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DICompositeType(tag: DW_TAG_class_type, name: "XSObjectFactory", scope: !2, file: !712, line: 368, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_715XSObjectFactoryE")
!712 = !DIFile(filename: "./xercesc/framework/psvi/XSSimpleTypeDefinition.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!713 = !DIDerivedType(tag: DW_TAG_member, name: "fDeleteNamespace", scope: !675, file: !676, line: 314, baseType: !714, size: 64, offset: 2240, flags: DIFlagProtected)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "fParent", scope: !675, file: !676, line: 315, baseType: !674, size: 64, offset: 2304, flags: DIFlagProtected)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "fDeleteParent", scope: !675, file: !676, line: 316, baseType: !99, size: 8, offset: 2368, flags: DIFlagProtected)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "fAddedS4SGrammar", scope: !675, file: !676, line: 317, baseType: !99, size: 8, offset: 2376, flags: DIFlagProtected)
!718 = !DISubprogram(name: "XSModel", scope: !675, file: !676, line: 72, type: !719, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!719 = !DISubroutineType(types: !720)
!720 = !{null, !721, !670, !112}
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!722 = !DISubprogram(name: "XSModel", scope: !675, file: !676, line: 84, type: !723, scopeLine: 84, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!723 = !DISubroutineType(types: !724)
!724 = !{null, !721, !674, !648, !112}
!725 = !DISubprogram(name: "~XSModel", scope: !675, file: !676, line: 92, type: !726, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!726 = !DISubroutineType(types: !727)
!727 = !{null, !721}
!728 = !DISubprogram(name: "getNamespaces", linkageName: "_ZN11xercesc_2_77XSModel13getNamespacesEv", scope: !675, file: !676, line: 106, type: !729, scopeLine: 106, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!729 = !DISubroutineType(types: !730)
!730 = !{!681, !721}
!731 = !DISubprogram(name: "getNamespaceItems", linkageName: "_ZN11xercesc_2_77XSModel17getNamespaceItemsEv", scope: !675, file: !676, line: 116, type: !732, scopeLine: 116, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!732 = !DISubroutineType(types: !733)
!733 = !{!687, !721}
!734 = !DISubprogram(name: "getComponents", linkageName: "_ZN11xercesc_2_77XSModel13getComponentsENS_11XSConstants14COMPONENT_TYPEE", scope: !675, file: !676, line: 128, type: !735, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!735 = !DISubroutineType(types: !736)
!736 = !{!698, !721, !737}
!737 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "COMPONENT_TYPE", scope: !738, file: !683, line: 60, baseType: !102, size: 32, elements: !744, identifier: "_ZTSN11xercesc_2_711XSConstants14COMPONENT_TYPEE")
!738 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "XSConstants", scope: !2, file: !683, line: 55, size: 8, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !739, identifier: "_ZTSN11xercesc_2_711XSConstantsE")
!739 = !{!740}
!740 = !DISubprogram(name: "XSConstants", scope: !738, file: !683, line: 190, type: !741, scopeLine: 190, flags: DIFlagPrototyped, spFlags: 0)
!741 = !DISubroutineType(types: !742)
!742 = !{null, !743}
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!744 = !{!745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758}
!745 = !DIEnumerator(name: "ATTRIBUTE_DECLARATION", value: 1, isUnsigned: true)
!746 = !DIEnumerator(name: "ELEMENT_DECLARATION", value: 2, isUnsigned: true)
!747 = !DIEnumerator(name: "TYPE_DEFINITION", value: 3, isUnsigned: true)
!748 = !DIEnumerator(name: "ATTRIBUTE_USE", value: 4, isUnsigned: true)
!749 = !DIEnumerator(name: "ATTRIBUTE_GROUP_DEFINITION", value: 5, isUnsigned: true)
!750 = !DIEnumerator(name: "MODEL_GROUP_DEFINITION", value: 6, isUnsigned: true)
!751 = !DIEnumerator(name: "MODEL_GROUP", value: 7, isUnsigned: true)
!752 = !DIEnumerator(name: "PARTICLE", value: 8, isUnsigned: true)
!753 = !DIEnumerator(name: "WILDCARD", value: 9, isUnsigned: true)
!754 = !DIEnumerator(name: "IDENTITY_CONSTRAINT", value: 10, isUnsigned: true)
!755 = !DIEnumerator(name: "NOTATION_DECLARATION", value: 11, isUnsigned: true)
!756 = !DIEnumerator(name: "ANNOTATION", value: 12, isUnsigned: true)
!757 = !DIEnumerator(name: "FACET", value: 13, isUnsigned: true)
!758 = !DIEnumerator(name: "MULTIVALUE_FACET", value: 14, isUnsigned: true)
!759 = !DISubprogram(name: "getComponentsByNamespace", linkageName: "_ZN11xercesc_2_77XSModel24getComponentsByNamespaceENS_11XSConstants14COMPONENT_TYPEEPKt", scope: !675, file: !676, line: 142, type: !760, scopeLine: 142, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!760 = !DISubroutineType(types: !761)
!761 = !{!698, !721, !737, !110}
!762 = !DISubprogram(name: "getAnnotations", linkageName: "_ZN11xercesc_2_77XSModel14getAnnotationsEv", scope: !675, file: !676, line: 148, type: !763, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!763 = !DISubroutineType(types: !764)
!764 = !{!703, !721}
!765 = !DISubprogram(name: "getElementDeclaration", linkageName: "_ZN11xercesc_2_77XSModel21getElementDeclarationEPKtS2_", scope: !675, file: !676, line: 157, type: !766, scopeLine: 157, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!766 = !DISubroutineType(types: !767)
!767 = !{!768, !721, !110, !110}
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DICompositeType(tag: DW_TAG_class_type, name: "XSElementDeclaration", scope: !2, file: !676, line: 51, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_720XSElementDeclarationE")
!770 = !DISubprogram(name: "getAttributeDeclaration", linkageName: "_ZN11xercesc_2_77XSModel23getAttributeDeclarationEPKtS2_", scope: !675, file: !676, line: 167, type: !771, scopeLine: 167, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!771 = !DISubroutineType(types: !772)
!772 = !{!773, !721, !110, !110}
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DICompositeType(tag: DW_TAG_class_type, name: "XSAttributeDeclaration", scope: !2, file: !676, line: 49, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_722XSAttributeDeclarationE")
!775 = !DISubprogram(name: "getTypeDefinition", linkageName: "_ZN11xercesc_2_77XSModel17getTypeDefinitionEPKtS2_", scope: !675, file: !676, line: 178, type: !776, scopeLine: 178, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!776 = !DISubroutineType(types: !777)
!777 = !{!778, !721, !110, !110}
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DICompositeType(tag: DW_TAG_class_type, name: "XSTypeDefinition", scope: !2, file: !780, line: 38, flags: DIFlagFwdDecl)
!780 = !DIFile(filename: "./xercesc/framework/psvi/XSTypeDefinition.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!781 = !DISubprogram(name: "getAttributeGroup", linkageName: "_ZN11xercesc_2_77XSModel17getAttributeGroupEPKtS2_", scope: !675, file: !676, line: 188, type: !782, scopeLine: 188, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!782 = !DISubroutineType(types: !783)
!783 = !{!784, !721, !110, !110}
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DICompositeType(tag: DW_TAG_class_type, name: "XSAttributeGroupDefinition", scope: !2, file: !676, line: 50, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_726XSAttributeGroupDefinitionE")
!786 = !DISubprogram(name: "getModelGroupDefinition", linkageName: "_ZN11xercesc_2_77XSModel23getModelGroupDefinitionEPKtS2_", scope: !675, file: !676, line: 198, type: !787, scopeLine: 198, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!787 = !DISubroutineType(types: !788)
!788 = !{!789, !721, !110, !110}
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DICompositeType(tag: DW_TAG_class_type, name: "XSModelGroupDefinition", scope: !2, file: !676, line: 52, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_722XSModelGroupDefinitionE")
!791 = !DISubprogram(name: "getNotationDeclaration", linkageName: "_ZN11xercesc_2_77XSModel22getNotationDeclarationEPKtS2_", scope: !675, file: !676, line: 208, type: !792, scopeLine: 208, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!792 = !DISubroutineType(types: !793)
!793 = !{!794, !721, !110, !110}
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DICompositeType(tag: DW_TAG_class_type, name: "XSNotationDeclaration", scope: !2, file: !676, line: 54, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_721XSNotationDeclarationE")
!796 = !DISubprogram(name: "getXSObjectById", linkageName: "_ZN11xercesc_2_77XSModel15getXSObjectByIdEjNS_11XSConstants14COMPONENT_TYPEE", scope: !675, file: !676, line: 220, type: !797, scopeLine: 220, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!797 = !DISubroutineType(types: !798)
!798 = !{!799, !721, !102, !737}
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DICompositeType(tag: DW_TAG_class_type, name: "XSObject", scope: !2, file: !801, line: 41, flags: DIFlagFwdDecl)
!801 = !DIFile(filename: "./xercesc/framework/psvi/XSObject.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!802 = !DISubprogram(name: "getURIStringPool", linkageName: "_ZN11xercesc_2_77XSModel16getURIStringPoolEv", scope: !675, file: !676, line: 229, type: !803, scopeLine: 229, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!803 = !DISubroutineType(types: !804)
!804 = !{!657, !721}
!805 = !DISubprogram(name: "getNamespaceItem", linkageName: "_ZN11xercesc_2_77XSModel16getNamespaceItemEPKt", scope: !675, file: !676, line: 231, type: !806, scopeLine: 231, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!806 = !DISubroutineType(types: !807)
!807 = !{!808, !721, !109}
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DICompositeType(tag: DW_TAG_class_type, name: "XSNamespaceItem", scope: !2, file: !683, line: 38, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_715XSNamespaceItemE")
!810 = !DISubprogram(name: "getXSObject", linkageName: "_ZN11xercesc_2_77XSModel11getXSObjectEPv", scope: !675, file: !676, line: 240, type: !811, scopeLine: 240, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!811 = !DISubroutineType(types: !812)
!812 = !{!799, !721, !49}
!813 = !DISubprogram(name: "addGrammarToXSModel", linkageName: "_ZN11xercesc_2_77XSModel19addGrammarToXSModelEPNS_15XSNamespaceItemE", scope: !675, file: !676, line: 248, type: !814, scopeLine: 248, flags: DIFlagPrototyped, spFlags: 0)
!814 = !DISubroutineType(types: !815)
!815 = !{null, !721, !808}
!816 = !DISubprogram(name: "addS4SToXSModel", linkageName: "_ZN11xercesc_2_77XSModel15addS4SToXSModelEPNS_15XSNamespaceItemEPNS_14RefHashTableOfINS_17DatatypeValidatorEEE", scope: !675, file: !676, line: 252, type: !817, scopeLine: 252, flags: DIFlagPrototyped, spFlags: 0)
!817 = !DISubroutineType(types: !818)
!818 = !{null, !721, !819, !820}
!819 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !808)
!820 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !821)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DICompositeType(tag: DW_TAG_class_type, name: "RefHashTableOf<xercesc_2_7::DatatypeValidator>", scope: !2, file: !663, line: 72, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_714RefHashTableOfINS_17DatatypeValidatorEEE")
!823 = !DISubprogram(name: "addComponentToNamespace", linkageName: "_ZN11xercesc_2_77XSModel23addComponentToNamespaceEPNS_15XSNamespaceItemEPNS_8XSObjectEib", scope: !675, file: !676, line: 257, type: !824, scopeLine: 257, flags: DIFlagPrototyped, spFlags: 0)
!824 = !DISubroutineType(types: !825)
!825 = !{null, !721, !819, !826, !80, !99}
!826 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !799)
!827 = !DISubprogram(name: "addComponentToIdVector", linkageName: "_ZN11xercesc_2_77XSModel22addComponentToIdVectorEPNS_8XSObjectEi", scope: !675, file: !676, line: 265, type: !828, scopeLine: 265, flags: DIFlagPrototyped, spFlags: 0)
!828 = !DISubroutineType(types: !829)
!829 = !{null, !721, !826, !80}
!830 = !DISubprogram(name: "XSModel", scope: !675, file: !676, line: 274, type: !831, scopeLine: 274, flags: DIFlagPrototyped, spFlags: 0)
!831 = !DISubroutineType(types: !832)
!832 = !{null, !721, !833}
!833 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !834, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !675)
!835 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_77XSModelaSERKS0_", scope: !675, file: !676, line: 275, type: !836, scopeLine: 275, flags: DIFlagPrototyped, spFlags: 0)
!836 = !DISubroutineType(types: !837)
!837 = !{!838, !721, !833}
!838 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !675, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "fGrammarPoolXSModel", scope: !649, file: !650, line: 226, baseType: !674, size: 64, offset: 512)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "fGrammarsToAddToXSModel", scope: !649, file: !650, line: 227, baseType: !841, size: 64, offset: 576)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DICompositeType(tag: DW_TAG_class_type, name: "ValueVectorOf<xercesc_2_7::SchemaGrammar *>", scope: !2, file: !843, line: 32, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_713ValueVectorOfIPNS_13SchemaGrammarEEE")
!843 = !DIFile(filename: "./xercesc/util/ValueVectorOf.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!844 = !DISubprogram(name: "GrammarResolver", scope: !649, file: !650, line: 51, type: !845, scopeLine: 51, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!845 = !DISubroutineType(types: !846)
!846 = !{null, !847, !848, !112}
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!848 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !670)
!849 = !DISubprogram(name: "~GrammarResolver", scope: !649, file: !650, line: 58, type: !850, scopeLine: 58, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!850 = !DISubroutineType(types: !851)
!851 = !{null, !847}
!852 = !DISubprogram(name: "getDatatypeValidator", linkageName: "_ZN11xercesc_2_715GrammarResolver20getDatatypeValidatorEPKtS2_", scope: !649, file: !650, line: 71, type: !853, scopeLine: 71, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!853 = !DISubroutineType(types: !854)
!854 = !{!350, !847, !109, !109}
!855 = !DISubprogram(name: "getGrammar", linkageName: "_ZN11xercesc_2_715GrammarResolver10getGrammarEPNS_21XMLGrammarDescriptionE", scope: !649, file: !650, line: 80, type: !856, scopeLine: 80, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!856 = !DISubroutineType(types: !857)
!857 = !{!858, !847, !861}
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DICompositeType(tag: DW_TAG_class_type, name: "Grammar", scope: !2, file: !860, line: 42, flags: DIFlagFwdDecl)
!860 = !DIFile(filename: "./xercesc/validators/common/Grammar.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!861 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !862)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
