; ModuleID = 'XMLGrammarPoolImpl.cpp'
source_filename = "XMLGrammarPoolImpl.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"class.xercesc_2_7::XMLGrammarPoolImpl" = type <{ %"class.xercesc_2_7::XMLGrammarPool.base", [7 x i8], %"class.xercesc_2_7::RefHashTableOf.0"*, %"class.xercesc_2_7::XMLStringPool"*, %"class.xercesc_2_7::XMLSynchronizedStringPool"*, %"class.xercesc_2_7::XSModel"*, i8, i8, [6 x i8] }>
%"class.xercesc_2_7::XMLGrammarPool.base" = type <{ i32 (...)**, %"class.xercesc_2_7::MemoryManager"*, i8 }>
%"class.xercesc_2_7::MemoryManager" = type { i32 (...)** }
%"class.xercesc_2_7::RefHashTableOf.0" = type { %"class.xercesc_2_7::MemoryManager"*, i8, %"struct.xercesc_2_7::RefHashTableBucketElem.1"**, i32, i32, i32, %"class.xercesc_2_7::HashBase"* }
%"struct.xercesc_2_7::RefHashTableBucketElem.1" = type { %"class.xercesc_2_7::Grammar"*, %"struct.xercesc_2_7::RefHashTableBucketElem.1"*, i8* }
%"class.xercesc_2_7::Grammar" = type { %"class.xercesc_2_7::XSerializable" }
%"class.xercesc_2_7::XSerializable" = type { i32 (...)** }
%"class.xercesc_2_7::HashBase" = type { i32 (...)** }
%"class.xercesc_2_7::XMLStringPool" = type { %"class.xercesc_2_7::XSerializable", %"class.xercesc_2_7::MemoryManager"*, %"struct.xercesc_2_7::XMLStringPool::PoolElem"**, %"class.xercesc_2_7::RefHashTableOf"*, i32, i32 }
%"struct.xercesc_2_7::XMLStringPool::PoolElem" = type { i32, i16* }

!442 = !DIEnumerator(name: "XSer_GrammarPool_NotEmpty", value: 398, isUnsigned: true)
!443 = !DIEnumerator(name: "XSer_StringPool_NotEmpty", value: 399, isUnsigned: true)
!444 = !DIEnumerator(name: "XSer_Storer_NewerThan_Loader", value: 400, isUnsigned: true)
!445 = !DIEnumerator(name: "F_HighBounds", value: 401, isUnsigned: true)
!446 = !DIEnumerator(name: "E_LowBounds", value: 402, isUnsigned: true)
!447 = !DIEnumerator(name: "E_HighBounds", value: 403, isUnsigned: true)
!448 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "NodeTypes", scope: !450, file: !449, line: 42, baseType: !508, size: 32, elements: !1521, identifier: "_ZTSN11xercesc_2_715ContentSpecNode9NodeTypesE")
!449 = !DIFile(filename: "./xercesc/validators/common/ContentSpecNode.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!450 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "ContentSpecNode", scope: !6, file: !449, line: 36, size: 512, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !451, vtableHolder: !453, identifier: "_ZTSN11xercesc_2_715ContentSpecNodeE")
!451 = !{!452, !455, !488, !491, !492, !496, !500, !502, !503, !504, !506, !507, !509, !510, !515, !519, !523, !527, !532, !537, !540, !543, !549, !552, !557, !560, !564, !565, !566, !569, !570, !571, !574, !575, !578, !579, !582, !585, !586, !589, !592, !593, !596, !597, !672, !675, !676, !677, !681, !682, !686, !1517}
!452 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !450, baseType: !453, flags: DIFlagPublic, extraData: i32 0)
!453 = !DICompositeType(tag: DW_TAG_class_type, name: "XSerializable", scope: !6, file: !454, line: 29, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_713XSerializableE")
!454 = !DIFile(filename: "./xercesc/internal/XSerializable.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!455 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !450, baseType: !456, flags: DIFlagPublic, extraData: i32 0)
!456 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "XMemory", scope: !6, file: !457, line: 40, size: 8, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !458, identifier: "_ZTSN11xercesc_2_77XMemoryE")
!457 = !DIFile(filename: "./xercesc/util/XMemory.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!458 = !{!459, !466, !472, !475, !478, !481, !484}
!459 = !DISubprogram(name: "operator new", linkageName: "_ZN11xercesc_2_77XMemorynwEm", scope: !456, file: !457, line: 54, type: !460, scopeLine: 54, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!460 = !DISubroutineType(types: !461)
!461 = !{!462, !463}
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !464, line: 46, baseType: !465)
!464 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!465 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!466 = !DISubprogram(name: "operator new", linkageName: "_ZN11xercesc_2_77XMemorynwEmPNS_13MemoryManagerE", scope: !456, file: !457, line: 82, type: !467, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!467 = !DISubroutineType(types: !468)
!468 = !{!462, !463, !469}
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DICompositeType(tag: DW_TAG_class_type, name: "MemoryManager", scope: !6, file: !471, line: 38, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_713MemoryManagerE")
!471 = !DIFile(filename: "./xercesc/framework/MemoryManager.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!472 = !DISubprogram(name: "operator new", linkageName: "_ZN11xercesc_2_77XMemorynwEmPv", scope: !456, file: !457, line: 90, type: !473, scopeLine: 90, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!473 = !DISubroutineType(types: !474)
!474 = !{!462, !463, !462}
!475 = !DISubprogram(name: "operator delete", linkageName: "_ZN11xercesc_2_77XMemorydlEPv", scope: !456, file: !457, line: 97, type: !476, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!476 = !DISubroutineType(types: !477)
!477 = !{null, !462}
!478 = !DISubprogram(name: "operator delete", linkageName: "_ZN11xercesc_2_77XMemorydlEPvPNS_13MemoryManagerE", scope: !456, file: !457, line: 107, type: !479, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!479 = !DISubroutineType(types: !480)
!480 = !{null, !462, !469}
!481 = !DISubprogram(name: "operator delete", linkageName: "_ZN11xercesc_2_77XMemorydlEPvS1_", scope: !456, file: !457, line: 115, type: !482, scopeLine: 115, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!482 = !DISubroutineType(types: !483)
!483 = !{null, !462, !462}
!484 = !DISubprogram(name: "XMemory", scope: !456, file: !457, line: 130, type: !485, scopeLine: 130, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!485 = !DISubroutineType(types: !486)
!486 = !{null, !487}
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "classContentSpecNode", scope: !450, file: !449, line: 144, baseType: !489, flags: DIFlagPublic | DIFlagStaticMember)
!489 = !DICompositeType(tag: DW_TAG_class_type, name: "XProtoType", scope: !6, file: !490, line: 32, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_710XProtoTypeE")
!490 = !DIFile(filename: "./xercesc/internal/XProtoType.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!491 = !DIDerivedType(tag: DW_TAG_member, name: "fMemoryManager", scope: !450, file: !449, line: 189, baseType: !469, size: 64, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "fElement", scope: !450, file: !449, line: 190, baseType: !493, size: 64, offset: 128)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DICompositeType(tag: DW_TAG_class_type, name: "QName", scope: !6, file: !495, line: 33, flags: DIFlagFwdDecl)
!495 = !DIFile(filename: "./xercesc/util/QName.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!496 = !DIDerivedType(tag: DW_TAG_member, name: "fElementDecl", scope: !450, file: !449, line: 191, baseType: !497, size: 64, offset: 192)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DICompositeType(tag: DW_TAG_class_type, name: "XMLElementDecl", scope: !6, file: !499, line: 50, flags: DIFlagFwdDecl)
!499 = !DIFile(filename: "./xercesc/framework/XMLElementDecl.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!500 = !DIDerivedType(tag: DW_TAG_member, name: "fFirst", scope: !450, file: !449, line: 192, baseType: !501, size: 64, offset: 256)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "fSecond", scope: !450, file: !449, line: 193, baseType: !501, size: 64, offset: 320)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "fType", scope: !450, file: !449, line: 194, baseType: !448, size: 32, offset: 384)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "fAdoptFirst", scope: !450, file: !449, line: 195, baseType: !505, size: 8, offset: 416)
!505 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "fAdoptSecond", scope: !450, file: !449, line: 196, baseType: !505, size: 8, offset: 424)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "fMinOccurs", scope: !450, file: !449, line: 197, baseType: !508, size: 32, offset: 448)
!508 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "fMaxOccurs", scope: !450, file: !449, line: 198, baseType: !508, size: 32, offset: 480)
!510 = !DISubprogram(name: "ContentSpecNode", scope: !450, file: !449, line: 71, type: !511, scopeLine: 71, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!511 = !DISubroutineType(types: !512)
!512 = !{null, !513, !514}
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!514 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !469)
!515 = !DISubprogram(name: "ContentSpecNode", scope: !450, file: !449, line: 72, type: !516, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!516 = !DISubroutineType(types: !517)
!517 = !{null, !513, !518, !514}
!518 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !493)
!519 = !DISubprogram(name: "ContentSpecNode", scope: !450, file: !449, line: 77, type: !520, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!520 = !DISubroutineType(types: !521)
!521 = !{null, !513, !522, !514}
!522 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !497)
!523 = !DISubprogram(name: "ContentSpecNode", scope: !450, file: !449, line: 82, type: !524, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!524 = !DISubroutineType(types: !525)
!525 = !{null, !513, !518, !526, !514}
!526 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !505)
!527 = !DISubprogram(name: "ContentSpecNode", scope: !450, file: !449, line: 88, type: !528, scopeLine: 88, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!528 = !DISubroutineType(types: !529)
!529 = !{null, !513, !530, !531, !531, !526, !526, !514}
!530 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !448)
!531 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !501)
!532 = !DISubprogram(name: "ContentSpecNode", scope: !450, file: !449, line: 97, type: !533, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!533 = !DISubroutineType(types: !534)
!534 = !{null, !513, !535}
!535 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !450)
!537 = !DISubprogram(name: "~ContentSpecNode", scope: !450, file: !449, line: 98, type: !538, scopeLine: 98, containingType: !450, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!538 = !DISubroutineType(types: !539)
!539 = !{null, !513}
!540 = !DISubprogram(name: "getElement", linkageName: "_ZN11xercesc_2_715ContentSpecNode10getElementEv", scope: !450, file: !449, line: 103, type: !541, scopeLine: 103, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!541 = !DISubroutineType(types: !542)
!542 = !{!493, !513}
!543 = !DISubprogram(name: "getElement", linkageName: "_ZNK11xercesc_2_715ContentSpecNode10getElementEv", scope: !450, file: !449, line: 104, type: !544, scopeLine: 104, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!544 = !DISubroutineType(types: !545)
!545 = !{!546, !548}
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!549 = !DISubprogram(name: "getElementDecl", linkageName: "_ZN11xercesc_2_715ContentSpecNode14getElementDeclEv", scope: !450, file: !449, line: 105, type: !550, scopeLine: 105, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!550 = !DISubroutineType(types: !551)
!551 = !{!497, !513}
!552 = !DISubprogram(name: "getElementDecl", linkageName: "_ZNK11xercesc_2_715ContentSpecNode14getElementDeclEv", scope: !450, file: !449, line: 106, type: !553, scopeLine: 106, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!553 = !DISubroutineType(types: !554)
!554 = !{!555, !548}
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !498)
!557 = !DISubprogram(name: "getFirst", linkageName: "_ZN11xercesc_2_715ContentSpecNode8getFirstEv", scope: !450, file: !449, line: 107, type: !558, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!558 = !DISubroutineType(types: !559)
!559 = !{!501, !513}
!560 = !DISubprogram(name: "getFirst", linkageName: "_ZNK11xercesc_2_715ContentSpecNode8getFirstEv", scope: !450, file: !449, line: 108, type: !561, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!561 = !DISubroutineType(types: !562)
!562 = !{!563, !548}
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!564 = !DISubprogram(name: "getSecond", linkageName: "_ZN11xercesc_2_715ContentSpecNode9getSecondEv", scope: !450, file: !449, line: 109, type: !558, scopeLine: 109, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!565 = !DISubprogram(name: "getSecond", linkageName: "_ZNK11xercesc_2_715ContentSpecNode9getSecondEv", scope: !450, file: !449, line: 110, type: !561, scopeLine: 110, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!566 = !DISubprogram(name: "getType", linkageName: "_ZNK11xercesc_2_715ContentSpecNode7getTypeEv", scope: !450, file: !449, line: 111, type: !567, scopeLine: 111, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!567 = !DISubroutineType(types: !568)
!568 = !{!448, !548}
!569 = !DISubprogram(name: "orphanFirst", linkageName: "_ZN11xercesc_2_715ContentSpecNode11orphanFirstEv", scope: !450, file: !449, line: 112, type: !558, scopeLine: 112, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!570 = !DISubprogram(name: "orphanSecond", linkageName: "_ZN11xercesc_2_715ContentSpecNode12orphanSecondEv", scope: !450, file: !449, line: 113, type: !558, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!571 = !DISubprogram(name: "getMinOccurs", linkageName: "_ZNK11xercesc_2_715ContentSpecNode12getMinOccursEv", scope: !450, file: !449, line: 114, type: !572, scopeLine: 114, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!572 = !DISubroutineType(types: !573)
!573 = !{!508, !548}
!574 = !DISubprogram(name: "getMaxOccurs", linkageName: "_ZNK11xercesc_2_715ContentSpecNode12getMaxOccursEv", scope: !450, file: !449, line: 115, type: !572, scopeLine: 115, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!575 = !DISubprogram(name: "isFirstAdopted", linkageName: "_ZNK11xercesc_2_715ContentSpecNode14isFirstAdoptedEv", scope: !450, file: !449, line: 116, type: !576, scopeLine: 116, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!576 = !DISubroutineType(types: !577)
!577 = !{!505, !548}
!578 = !DISubprogram(name: "isSecondAdopted", linkageName: "_ZNK11xercesc_2_715ContentSpecNode15isSecondAdoptedEv", scope: !450, file: !449, line: 117, type: !576, scopeLine: 117, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!579 = !DISubprogram(name: "setElement", linkageName: "_ZN11xercesc_2_715ContentSpecNode10setElementEPNS_5QNameE", scope: !450, file: !449, line: 123, type: !580, scopeLine: 123, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!580 = !DISubroutineType(types: !581)
!581 = !{null, !513, !518}
!582 = !DISubprogram(name: "setFirst", linkageName: "_ZN11xercesc_2_715ContentSpecNode8setFirstEPS0_", scope: !450, file: !449, line: 124, type: !583, scopeLine: 124, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!583 = !DISubroutineType(types: !584)
!584 = !{null, !513, !531}
!585 = !DISubprogram(name: "setSecond", linkageName: "_ZN11xercesc_2_715ContentSpecNode9setSecondEPS0_", scope: !450, file: !449, line: 125, type: !583, scopeLine: 125, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!586 = !DISubprogram(name: "setType", linkageName: "_ZN11xercesc_2_715ContentSpecNode7setTypeENS0_9NodeTypesE", scope: !450, file: !449, line: 126, type: !587, scopeLine: 126, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!587 = !DISubroutineType(types: !588)
!588 = !{null, !513, !530}
!589 = !DISubprogram(name: "setMinOccurs", linkageName: "_ZN11xercesc_2_715ContentSpecNode12setMinOccursEi", scope: !450, file: !449, line: 127, type: !590, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!590 = !DISubroutineType(types: !591)
!591 = !{null, !513, !508}
!592 = !DISubprogram(name: "setMaxOccurs", linkageName: "_ZN11xercesc_2_715ContentSpecNode12setMaxOccursEi", scope: !450, file: !449, line: 128, type: !590, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!593 = !DISubprogram(name: "setAdoptFirst", linkageName: "_ZN11xercesc_2_715ContentSpecNode13setAdoptFirstEb", scope: !450, file: !449, line: 129, type: !594, scopeLine: 129, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!594 = !DISubroutineType(types: !595)
!595 = !{null, !513, !505}
!596 = !DISubprogram(name: "setAdoptSecond", linkageName: "_ZN11xercesc_2_715ContentSpecNode14setAdoptSecondEb", scope: !450, file: !449, line: 130, type: !594, scopeLine: 130, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!597 = !DISubprogram(name: "formatSpec", linkageName: "_ZNK11xercesc_2_715ContentSpecNode10formatSpecERNS_9XMLBufferE", scope: !450, file: !449, line: 136, type: !598, scopeLine: 136, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!598 = !DISubroutineType(types: !599)
!599 = !{null, !548, !600}
!600 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !601, size: 64)
!601 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "XMLBuffer", scope: !6, file: !602, line: 51, size: 320, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !603, identifier: "_ZTSN11xercesc_2_79XMLBufferE")
!602 = !DIFile(filename: "./xercesc/framework/XMLBuffer.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!603 = !{!604, !605, !606, !607, !608, !609, !610, !613, !618, !623, !626, !629, !633, !638, !641, !642, !643, !648, !651, !652, !655, !658, !659, !662, !666, !669}
!604 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !601, baseType: !456, flags: DIFlagPublic, extraData: i32 0)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "fIndex", scope: !601, file: !602, line: 254, baseType: !7, size: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "fCapacity", scope: !601, file: !602, line: 255, baseType: !7, size: 32, offset: 32)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "fFullSize", scope: !601, file: !602, line: 256, baseType: !7, size: 32, offset: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "fUsed", scope: !601, file: !602, line: 257, baseType: !505, size: 8, offset: 96)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "fMemoryManager", scope: !601, file: !602, line: 258, baseType: !514, size: 64, offset: 128)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "fFullHandler", scope: !601, file: !602, line: 259, baseType: !611, size: 64, offset: 192)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DICompositeType(tag: DW_TAG_class_type, name: "XMLBufferFullHandler", scope: !6, file: !602, line: 270, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_720XMLBufferFullHandlerE")
!613 = !DIDerivedType(tag: DW_TAG_member, name: "fBuffer", scope: !601, file: !602, line: 260, baseType: !614, size: 64, offset: 256)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMLCh", file: !616, line: 67, baseType: !617)
!616 = !DIFile(filename: "./xercesc/util/Compilers/GCCDefs.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!617 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!618 = !DISubprogram(name: "XMLBuffer", scope: !601, file: !602, line: 60, type: !619, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!619 = !DISubroutineType(types: !620)
!620 = !{null, !621, !622, !514}
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!622 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!623 = !DISubprogram(name: "~XMLBuffer", scope: !601, file: !602, line: 81, type: !624, scopeLine: 81, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!624 = !DISubroutineType(types: !625)
!625 = !{null, !621}
!626 = !DISubprogram(name: "setFullHandler", linkageName: "_ZN11xercesc_2_79XMLBuffer14setFullHandlerEPNS_20XMLBufferFullHandlerEj", scope: !601, file: !602, line: 90, type: !627, scopeLine: 90, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!627 = !DISubroutineType(types: !628)
!628 = !{null, !621, !611, !622}
!629 = !DISubprogram(name: "append", linkageName: "_ZN11xercesc_2_79XMLBuffer6appendEt", scope: !601, file: !602, line: 119, type: !630, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!630 = !DISubroutineType(types: !631)
!631 = !{null, !621, !632}
!632 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !615)
!633 = !DISubprogram(name: "append", linkageName: "_ZN11xercesc_2_79XMLBuffer6appendEPKtj", scope: !601, file: !602, line: 127, type: !634, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!634 = !DISubroutineType(types: !635)
!635 = !{null, !621, !636, !622}
!636 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !637)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!638 = !DISubprogram(name: "append", linkageName: "_ZN11xercesc_2_79XMLBuffer6appendEPKt", scope: !601, file: !602, line: 141, type: !639, scopeLine: 141, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!639 = !DISubroutineType(types: !640)
!640 = !{null, !621, !636}
!641 = !DISubprogram(name: "set", linkageName: "_ZN11xercesc_2_79XMLBuffer3setEPKtj", scope: !601, file: !602, line: 156, type: !634, scopeLine: 156, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!642 = !DISubprogram(name: "set", linkageName: "_ZN11xercesc_2_79XMLBuffer3setEPKt", scope: !601, file: !602, line: 162, type: !639, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!643 = !DISubprogram(name: "getRawBuffer", linkageName: "_ZNK11xercesc_2_79XMLBuffer12getRawBufferEv", scope: !601, file: !602, line: 168, type: !644, scopeLine: 168, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!644 = !DISubroutineType(types: !645)
!645 = !{!637, !646}
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!647 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !601)
!648 = !DISubprogram(name: "getRawBuffer", linkageName: "_ZN11xercesc_2_79XMLBuffer12getRawBufferEv", scope: !601, file: !602, line: 174, type: !649, scopeLine: 174, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!649 = !DISubroutineType(types: !650)
!650 = !{!614, !621}
!651 = !DISubprogram(name: "reset", linkageName: "_ZN11xercesc_2_79XMLBuffer5resetEv", scope: !601, file: !602, line: 180, type: !624, scopeLine: 180, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!652 = !DISubprogram(name: "getInUse", linkageName: "_ZNK11xercesc_2_79XMLBuffer8getInUseEv", scope: !601, file: !602, line: 189, type: !653, scopeLine: 189, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!653 = !DISubroutineType(types: !654)
!654 = !{!505, !646}
!655 = !DISubprogram(name: "getLen", linkageName: "_ZNK11xercesc_2_79XMLBuffer6getLenEv", scope: !601, file: !602, line: 194, type: !656, scopeLine: 194, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!656 = !DISubroutineType(types: !657)
!657 = !{!7, !646}
!658 = !DISubprogram(name: "isEmpty", linkageName: "_ZNK11xercesc_2_79XMLBuffer7isEmptyEv", scope: !601, file: !602, line: 199, type: !653, scopeLine: 199, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!659 = !DISubprogram(name: "setInUse", linkageName: "_ZN11xercesc_2_79XMLBuffer8setInUseEb", scope: !601, file: !602, line: 207, type: !660, scopeLine: 207, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!660 = !DISubroutineType(types: !661)
!661 = !{null, !621, !526}
!662 = !DISubprogram(name: "XMLBuffer", scope: !601, file: !602, line: 216, type: !663, scopeLine: 216, flags: DIFlagPrototyped, spFlags: 0)
!663 = !DISubroutineType(types: !664)
!664 = !{null, !621, !665}
!665 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !647, size: 64)
!666 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_79XMLBufferaSERKS0_", scope: !601, file: !602, line: 217, type: !667, scopeLine: 217, flags: DIFlagPrototyped, spFlags: 0)
!667 = !DISubroutineType(types: !668)
!668 = !{!600, !621, !665}
!669 = !DISubprogram(name: "insureCapacity", linkageName: "_ZN11xercesc_2_79XMLBuffer14insureCapacityEj", scope: !601, file: !602, line: 227, type: !670, scopeLine: 227, flags: DIFlagPrototyped, spFlags: 0)
!670 = !DISubroutineType(types: !671)
!671 = !{null, !621, !622}
!672 = !DISubprogram(name: "hasAllContent", linkageName: "_ZN11xercesc_2_715ContentSpecNode13hasAllContentEv", scope: !450, file: !449, line: 137, type: !673, scopeLine: 137, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!673 = !DISubroutineType(types: !674)
!674 = !{!505, !513}
!675 = !DISubprogram(name: "getMinTotalRange", linkageName: "_ZNK11xercesc_2_715ContentSpecNode16getMinTotalRangeEv", scope: !450, file: !449, line: 138, type: !572, scopeLine: 138, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!676 = !DISubprogram(name: "getMaxTotalRange", linkageName: "_ZNK11xercesc_2_715ContentSpecNode16getMaxTotalRangeEv", scope: !450, file: !449, line: 139, type: !572, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!677 = !DISubprogram(name: "createObject", linkageName: "_ZN11xercesc_2_715ContentSpecNode12createObjectEPNS_13MemoryManagerE", scope: !450, file: !449, line: 144, type: !678, scopeLine: 144, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!678 = !DISubroutineType(types: !679)
!679 = !{!680, !469}
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!681 = !DISubprogram(name: "isSerializable", linkageName: "_ZNK11xercesc_2_715ContentSpecNode14isSerializableEv", scope: !450, file: !449, line: 144, type: !576, scopeLine: 144, containingType: !450, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!682 = !DISubprogram(name: "getProtoType", linkageName: "_ZNK11xercesc_2_715ContentSpecNode12getProtoTypeEv", scope: !450, file: !449, line: 144, type: !683, scopeLine: 144, containingType: !450, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!683 = !DISubroutineType(types: !684)
!684 = !{!685, !548}
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!686 = !DISubprogram(name: "serialize", linkageName: "_ZN11xercesc_2_715ContentSpecNode9serializeERNS_16XSerializeEngineE", scope: !450, file: !449, line: 144, type: !687, scopeLine: 144, containingType: !450, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!687 = !DISubroutineType(types: !688)
!688 = !{null, !513, !689}
!689 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !690, size: 64)
!690 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "XSerializeEngine", scope: !6, file: !691, line: 42, size: 832, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !692, identifier: "_ZTSN11xercesc_2_716XSerializeEngineE")
!691 = !DIFile(filename: "./xercesc/internal/XSerializeEngine.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!692 = !{!693, !694, !695, !698, !699, !1254, !1255, !1256, !1257, !1259, !1265, !1266, !1267, !1268, !1271, !1275, !1277, !1281, !1284, !1287, !1290, !1293, !1294, !1299, !1300, !1303, !1306, !1309, !1312, !1316, !1320, !1326, !1329, !1333, !1336, !1339, !1343, !1346, !1350, !1355, !1358, !1361, !1365, !1368, !1371, !1375, !1379, !1382, !1385, !1388, !1392, !1395, !1398, !1401, !1405, !1408, !1412, !1416, !1419, !1423, !1427, !1431, !1435, !1438, !1441, !1445, !1449, !1453, !1457, !1460, !1463, !1464, !1465, !1466, !1470, !1471, !1475, !1478, !1481, !1482, !1485, !1486, !1489, !1490, !1491, !1492, !1493, !1494, !1497, !1498, !1499, !1500, !1503, !1506, !1510, !1513, !1514}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "toReadBufferLen", scope: !690, file: !691, line: 51, baseType: !526, flags: DIFlagPublic | DIFlagStaticMember)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "toWriteBufferLen", scope: !690, file: !691, line: 301, baseType: !526, flags: DIFlagPublic | DIFlagStaticMember)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "fStoreLoad", scope: !690, file: !691, line: 695, baseType: !696, size: 16)
!696 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !697)
!697 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "fStorerLevel", scope: !690, file: !691, line: 696, baseType: !697, size: 16, offset: 16)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "fGrammarPool", scope: !690, file: !691, line: 698, baseType: !700, size: 64, offset: 64)
!700 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !701)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "XMLGrammarPool", scope: !6, file: !703, line: 42, size: 192, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !704, vtableHolder: !702, identifier: "_ZTSN11xercesc_2_714XMLGrammarPoolE")
!703 = !DIFile(filename: "./xercesc/framework/XMLGrammarPool.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!704 = !{!705, !706, !711, !712, !713, !717, !722, !729, !732, !922, !925, !926, !927, !933, !939, !945, !951, !1215, !1219, !1222, !1225, !1231, !1237, !1240, !1243, !1246, !1250}
!705 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !702, baseType: !456, flags: DIFlagPublic, extraData: i32 0)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$XMLGrammarPool", scope: !703, file: !703, baseType: !707, size: 64, flags: DIFlagArtificial)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !709, size: 64)
!709 = !DISubroutineType(types: !710)
!710 = !{!508}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "fMemMgr", scope: !702, file: !703, line: 335, baseType: !514, size: 64, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "fIgnoreSerializedAnnotations", scope: !702, file: !703, line: 336, baseType: !505, size: 8, offset: 128)
!713 = !DISubprogram(name: "~XMLGrammarPool", scope: !702, file: !703, line: 54, type: !714, scopeLine: 54, containingType: !702, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!714 = !DISubroutineType(types: !715)
!715 = !{null, !716}
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!717 = !DISubprogram(name: "cacheGrammar", linkageName: "_ZN11xercesc_2_714XMLGrammarPool12cacheGrammarEPNS_7GrammarE", scope: !702, file: !703, line: 75, type: !718, scopeLine: 75, containingType: !702, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!718 = !DISubroutineType(types: !719)
!719 = !{!505, !716, !720}
!720 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !721)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!722 = !DISubprogram(name: "retrieveGrammar", linkageName: "_ZN11xercesc_2_714XMLGrammarPool15retrieveGrammarEPNS_21XMLGrammarDescriptionE", scope: !702, file: !703, line: 84, type: !723, scopeLine: 84, containingType: !702, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!723 = !DISubroutineType(types: !724)
!724 = !{!721, !716, !725}
!725 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !726)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DICompositeType(tag: DW_TAG_class_type, name: "XMLGrammarDescription", scope: !6, file: !728, line: 31, flags: DIFlagFwdDecl)
!728 = !DIFile(filename: "./xercesc/framework/XMLGrammarDescription.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!729 = !DISubprogram(name: "orphanGrammar", linkageName: "_ZN11xercesc_2_714XMLGrammarPool13orphanGrammarEPKt", scope: !702, file: !703, line: 95, type: !730, scopeLine: 95, containingType: !702, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!730 = !DISubroutineType(types: !731)
!731 = !{!721, !716, !636}
!732 = !DISubprogram(name: "getGrammarEnumerator", linkageName: "_ZNK11xercesc_2_714XMLGrammarPool20getGrammarEnumeratorEv", scope: !702, file: !703, line: 103, type: !733, scopeLine: 103, containingType: !702, virtualIndex: 5, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!733 = !DISubroutineType(types: !734)
!734 = !{!735, !920}
!735 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "RefHashTableOfEnumerator<xercesc_2_7::Grammar>", scope: !6, file: !736, line: 193, size: 384, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !737, vtableHolder: !739, templateParams: !794, identifier: "_ZTSN11xercesc_2_724RefHashTableOfEnumeratorINS_7GrammarEEE")
!736 = !DIFile(filename: "./xercesc/util/RefHashTableOf.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!737 = !{!738, !768, !769, !770, !796, !797, !890, !891, !896, !899, !904, !908, !911, !912, !915, !919}
!738 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !735, baseType: !739, flags: DIFlagPublic, extraData: i32 0)
!739 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "XMLEnumerator<xercesc_2_7::Grammar>", scope: !6, file: !740, line: 29, size: 64, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !741, vtableHolder: !739, templateParams: !766, identifier: "_ZTSN11xercesc_2_713XMLEnumeratorINS_7GrammarEEE")
!740 = !DIFile(filename: "./xercesc/util/XMLEnumerator.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!741 = !{!742, !743, !747, !752, !756, !757, !758, !762}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$XMLEnumerator", scope: !740, file: !740, baseType: !707, size: 64, flags: DIFlagArtificial)
!743 = !DISubprogram(name: "~XMLEnumerator", scope: !739, file: !740, line: 35, type: !744, scopeLine: 35, containingType: !739, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!744 = !DISubroutineType(types: !745)
!745 = !{null, !746}
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!747 = !DISubprogram(name: "hasMoreElements", linkageName: "_ZNK11xercesc_2_713XMLEnumeratorINS_7GrammarEE15hasMoreElementsEv", scope: !739, file: !740, line: 40, type: !748, scopeLine: 40, containingType: !739, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!748 = !DISubroutineType(types: !749)
!749 = !{!505, !750}
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!751 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !739)
!752 = !DISubprogram(name: "nextElement", linkageName: "_ZN11xercesc_2_713XMLEnumeratorINS_7GrammarEE11nextElementEv", scope: !739, file: !740, line: 41, type: !753, scopeLine: 41, containingType: !739, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!753 = !DISubroutineType(types: !754)
!754 = !{!755, !746}
!755 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !5, size: 64)
!756 = !DISubprogram(name: "Reset", linkageName: "_ZN11xercesc_2_713XMLEnumeratorINS_7GrammarEE5ResetEv", scope: !739, file: !740, line: 42, type: !744, scopeLine: 42, containingType: !739, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!757 = !DISubprogram(name: "XMLEnumerator", scope: !739, file: !740, line: 44, type: !744, scopeLine: 44, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!758 = !DISubprogram(name: "XMLEnumerator", scope: !739, file: !740, line: 45, type: !759, scopeLine: 45, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!759 = !DISubroutineType(types: !760)
!760 = !{null, !746, !761}
!761 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !751, size: 64)
!762 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_713XMLEnumeratorINS_7GrammarEEaSERKS2_", scope: !739, file: !740, line: 51, type: !763, scopeLine: 51, flags: DIFlagPrototyped, spFlags: 0)
!763 = !DISubroutineType(types: !764)
!764 = !{!765, !746, !761}
!765 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !739, size: 64)
!766 = !{!767}
!767 = !DITemplateTypeParameter(name: "TElem", type: !5)
!768 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !735, baseType: !456, flags: DIFlagPublic, extraData: i32 0)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "fAdopted", scope: !735, file: !736, line: 247, baseType: !505, size: 8, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "fCurElem", scope: !735, file: !736, line: 248, baseType: !771, size: 64, offset: 128)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RefHashTableBucketElem<xercesc_2_7::Grammar>", scope: !6, file: !736, line: 49, size: 192, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !773, templateParams: !794, identifier: "_ZTSN11xercesc_2_722RefHashTableBucketElemINS_7GrammarEEE")
!773 = !{!774, !775, !776, !777, !781, !784, !785, !790}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "fData", scope: !772, file: !736, line: 59, baseType: !721, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "fNext", scope: !772, file: !736, line: 60, baseType: !771, size: 64, offset: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "fKey", scope: !772, file: !736, line: 61, baseType: !462, size: 64, offset: 128)
!777 = !DISubprogram(name: "RefHashTableBucketElem", scope: !772, file: !736, line: 51, type: !778, scopeLine: 51, flags: DIFlagPrototyped, spFlags: 0)
!778 = !DISubroutineType(types: !779)
!779 = !{null, !780, !462, !720, !771}
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!781 = !DISubprogram(name: "RefHashTableBucketElem", scope: !772, file: !736, line: 56, type: !782, scopeLine: 56, flags: DIFlagPrototyped, spFlags: 0)
!782 = !DISubroutineType(types: !783)
!783 = !{null, !780}
!784 = !DISubprogram(name: "~RefHashTableBucketElem", scope: !772, file: !736, line: 57, type: !782, scopeLine: 57, flags: DIFlagPrototyped, spFlags: 0)
!785 = !DISubprogram(name: "RefHashTableBucketElem", scope: !772, file: !736, line: 67, type: !786, scopeLine: 67, flags: DIFlagPrivate | DIFlagPrototyped, spFlags: 0)
!786 = !DISubroutineType(types: !787)
!787 = !{null, !780, !788}
!788 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !789, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !772)
!790 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_722RefHashTableBucketElemINS_7GrammarEEaSERKS2_", scope: !772, file: !736, line: 68, type: !791, scopeLine: 68, flags: DIFlagPrivate | DIFlagPrototyped, spFlags: 0)
!791 = !DISubroutineType(types: !792)
!792 = !{!793, !780, !788}
!793 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !772, size: 64)
!794 = !{!795}
!795 = !DITemplateTypeParameter(name: "TVal", type: !5)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "fCurHash", scope: !735, file: !736, line: 249, baseType: !7, size: 32, offset: 192)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "fToEnum", scope: !735, file: !736, line: 250, baseType: !798, size: 64, offset: 256)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "RefHashTableOf<xercesc_2_7::Grammar>", scope: !6, file: !736, line: 72, size: 384, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !800, templateParams: !794, identifier: "_ZTSN11xercesc_2_714RefHashTableOfINS_7GrammarEEE")
!800 = !{!801, !802, !803, !804, !806, !807, !808, !809, !813, !817, !820, !823, !826, !831, !837, !840, !841, !842, !845, !848, !851, !852, !857, !860, !863, !864, !867, !870, !874, !878, !882, !886, !889}
!801 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !799, baseType: !456, flags: DIFlagPublic, extraData: i32 0)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "fMemoryManager", scope: !799, file: !736, line: 178, baseType: !469, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "fAdoptedElems", scope: !799, file: !736, line: 179, baseType: !505, size: 8, offset: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "fBucketList", scope: !799, file: !736, line: 180, baseType: !805, size: 64, offset: 128)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "fHashModulus", scope: !799, file: !736, line: 181, baseType: !7, size: 32, offset: 192)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "fInitialModulus", scope: !799, file: !736, line: 182, baseType: !7, size: 32, offset: 224)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "fCount", scope: !799, file: !736, line: 183, baseType: !7, size: 32, offset: 256)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "fHash", scope: !799, file: !736, line: 184, baseType: !810, size: 64, offset: 320)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DICompositeType(tag: DW_TAG_class_type, name: "HashBase", scope: !6, file: !812, line: 32, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_78HashBaseE")
!812 = !DIFile(filename: "./xercesc/util/HashBase.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!813 = !DISubprogram(name: "RefHashTableOf", scope: !799, file: !736, line: 79, type: !814, scopeLine: 79, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!814 = !DISubroutineType(types: !815)
!815 = !{null, !816, !622, !514}
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!817 = !DISubprogram(name: "RefHashTableOf", scope: !799, file: !736, line: 85, type: !818, scopeLine: 85, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!818 = !DISubroutineType(types: !819)
!819 = !{null, !816, !622, !526, !514}
!820 = !DISubprogram(name: "RefHashTableOf", scope: !799, file: !736, line: 94, type: !821, scopeLine: 94, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!821 = !DISubroutineType(types: !822)
!822 = !{null, !816, !622, !526, !810, !514}
!823 = !DISubprogram(name: "~RefHashTableOf", scope: !799, file: !736, line: 101, type: !824, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!824 = !DISubroutineType(types: !825)
!825 = !{null, !816}
!826 = !DISubprogram(name: "isEmpty", linkageName: "_ZNK11xercesc_2_714RefHashTableOfINS_7GrammarEE7isEmptyEv", scope: !799, file: !736, line: 107, type: !827, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!827 = !DISubroutineType(types: !828)
!828 = !{!505, !829}
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!830 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !799)
!831 = !DISubprogram(name: "containsKey", linkageName: "_ZNK11xercesc_2_714RefHashTableOfINS_7GrammarEE11containsKeyEPKv", scope: !799, file: !736, line: 108, type: !832, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!832 = !DISubroutineType(types: !833)
!833 = !{!505, !829, !834}
!834 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !835)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!837 = !DISubprogram(name: "removeKey", linkageName: "_ZN11xercesc_2_714RefHashTableOfINS_7GrammarEE9removeKeyEPKv", scope: !799, file: !736, line: 109, type: !838, scopeLine: 109, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!838 = !DISubroutineType(types: !839)
!839 = !{null, !816, !834}
!840 = !DISubprogram(name: "removeAll", linkageName: "_ZN11xercesc_2_714RefHashTableOfINS_7GrammarEE9removeAllEv", scope: !799, file: !736, line: 110, type: !824, scopeLine: 110, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!841 = !DISubprogram(name: "cleanup", linkageName: "_ZN11xercesc_2_714RefHashTableOfINS_7GrammarEE7cleanupEv", scope: !799, file: !736, line: 111, type: !824, scopeLine: 111, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!842 = !DISubprogram(name: "reinitialize", linkageName: "_ZN11xercesc_2_714RefHashTableOfINS_7GrammarEE12reinitializeEPNS_8HashBaseE", scope: !799, file: !736, line: 112, type: !843, scopeLine: 112, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!843 = !DISubroutineType(types: !844)
!844 = !{null, !816, !810}
!845 = !DISubprogram(name: "transferElement", linkageName: "_ZN11xercesc_2_714RefHashTableOfINS_7GrammarEE15transferElementEPKvPv", scope: !799, file: !736, line: 113, type: !846, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!846 = !DISubroutineType(types: !847)
!847 = !{null, !816, !834, !462}
!848 = !DISubprogram(name: "orphanKey", linkageName: "_ZN11xercesc_2_714RefHashTableOfINS_7GrammarEE9orphanKeyEPKv", scope: !799, file: !736, line: 114, type: !849, scopeLine: 114, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!849 = !DISubroutineType(types: !850)
!850 = !{!721, !816, !834}
!851 = !DISubprogram(name: "get", linkageName: "_ZN11xercesc_2_714RefHashTableOfINS_7GrammarEE3getEPKv", scope: !799, file: !736, line: 119, type: !849, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!852 = !DISubprogram(name: "get", linkageName: "_ZNK11xercesc_2_714RefHashTableOfINS_7GrammarEE3getEPKv", scope: !799, file: !736, line: 120, type: !853, scopeLine: 120, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!853 = !DISubroutineType(types: !854)
!854 = !{!855, !829, !834}
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!857 = !DISubprogram(name: "getMemoryManager", linkageName: "_ZNK11xercesc_2_714RefHashTableOfINS_7GrammarEE16getMemoryManagerEv", scope: !799, file: !736, line: 121, type: !858, scopeLine: 121, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!858 = !DISubroutineType(types: !859)
!859 = !{!469, !829}
!860 = !DISubprogram(name: "getHashModulus", linkageName: "_ZNK11xercesc_2_714RefHashTableOfINS_7GrammarEE14getHashModulusEv", scope: !799, file: !736, line: 122, type: !861, scopeLine: 122, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!861 = !DISubroutineType(types: !862)
!862 = !{!7, !829}
!863 = !DISubprogram(name: "getCount", linkageName: "_ZNK11xercesc_2_714RefHashTableOfINS_7GrammarEE8getCountEv", scope: !799, file: !736, line: 123, type: !861, scopeLine: 123, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!864 = !DISubprogram(name: "setAdoptElements", linkageName: "_ZN11xercesc_2_714RefHashTableOfINS_7GrammarEE16setAdoptElementsEb", scope: !799, file: !736, line: 128, type: !865, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!865 = !DISubroutineType(types: !866)
!866 = !{null, !816, !526}
!867 = !DISubprogram(name: "put", linkageName: "_ZN11xercesc_2_714RefHashTableOfINS_7GrammarEE3putEPvPS1_", scope: !799, file: !736, line: 134, type: !868, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!868 = !DISubroutineType(types: !869)
!869 = !{null, !816, !462, !720}
!870 = !DISubprogram(name: "RefHashTableOf", scope: !799, file: !736, line: 147, type: !871, scopeLine: 147, flags: DIFlagPrototyped, spFlags: 0)
!871 = !DISubroutineType(types: !872)
!872 = !{null, !816, !873}
!873 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !830, size: 64)
!874 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_714RefHashTableOfINS_7GrammarEEaSERKS2_", scope: !799, file: !736, line: 148, type: !875, scopeLine: 148, flags: DIFlagPrototyped, spFlags: 0)
!875 = !DISubroutineType(types: !876)
!876 = !{!877, !816, !873}
!877 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !799, size: 64)
!878 = !DISubprogram(name: "findBucketElem", linkageName: "_ZN11xercesc_2_714RefHashTableOfINS_7GrammarEE14findBucketElemEPKvRj", scope: !799, file: !736, line: 153, type: !879, scopeLine: 153, flags: DIFlagPrototyped, spFlags: 0)
!879 = !DISubroutineType(types: !880)
!880 = !{!771, !816, !834, !881}
!881 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !7, size: 64)
!882 = !DISubprogram(name: "findBucketElem", linkageName: "_ZNK11xercesc_2_714RefHashTableOfINS_7GrammarEE14findBucketElemEPKvRj", scope: !799, file: !736, line: 154, type: !883, scopeLine: 154, flags: DIFlagPrototyped, spFlags: 0)
!883 = !DISubroutineType(types: !884)
!884 = !{!885, !829, !834, !881}
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!886 = !DISubprogram(name: "initialize", linkageName: "_ZN11xercesc_2_714RefHashTableOfINS_7GrammarEE10initializeEj", scope: !799, file: !736, line: 155, type: !887, scopeLine: 155, flags: DIFlagPrototyped, spFlags: 0)
!887 = !DISubroutineType(types: !888)
!888 = !{null, !816, !622}
!889 = !DISubprogram(name: "rehash", linkageName: "_ZN11xercesc_2_714RefHashTableOfINS_7GrammarEE6rehashEv", scope: !799, file: !736, line: 156, type: !824, scopeLine: 156, flags: DIFlagPrototyped, spFlags: 0)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "fMemoryManager", scope: !735, file: !736, line: 251, baseType: !514, size: 64, offset: 320)
!891 = !DISubprogram(name: "RefHashTableOfEnumerator", scope: !735, file: !736, line: 199, type: !892, scopeLine: 199, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!892 = !DISubroutineType(types: !893)
!893 = !{null, !894, !895, !526, !514}
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!895 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !798)
!896 = !DISubprogram(name: "~RefHashTableOfEnumerator", scope: !735, file: !736, line: 202, type: !897, scopeLine: 202, containingType: !735, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!897 = !DISubroutineType(types: !898)
!898 = !{null, !894}
!899 = !DISubprogram(name: "RefHashTableOfEnumerator", scope: !735, file: !736, line: 204, type: !900, scopeLine: 204, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!900 = !DISubroutineType(types: !901)
!901 = !{null, !894, !902}
!902 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !903, size: 64)
!903 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !735)
!904 = !DISubprogram(name: "hasMoreElements", linkageName: "_ZNK11xercesc_2_724RefHashTableOfEnumeratorINS_7GrammarEE15hasMoreElementsEv", scope: !735, file: !736, line: 208, type: !905, scopeLine: 208, containingType: !735, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!905 = !DISubroutineType(types: !906)
!906 = !{!505, !907}
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!908 = !DISubprogram(name: "nextElement", linkageName: "_ZN11xercesc_2_724RefHashTableOfEnumeratorINS_7GrammarEE11nextElementEv", scope: !735, file: !736, line: 209, type: !909, scopeLine: 209, containingType: !735, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!909 = !DISubroutineType(types: !910)
!910 = !{!755, !894}
!911 = !DISubprogram(name: "Reset", linkageName: "_ZN11xercesc_2_724RefHashTableOfEnumeratorINS_7GrammarEE5ResetEv", scope: !735, file: !736, line: 210, type: !897, scopeLine: 210, containingType: !735, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!912 = !DISubprogram(name: "nextElementKey", linkageName: "_ZN11xercesc_2_724RefHashTableOfEnumeratorINS_7GrammarEE14nextElementKeyEv", scope: !735, file: !736, line: 215, type: !913, scopeLine: 215, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!913 = !DISubroutineType(types: !914)
!914 = !{!462, !894}
!915 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_724RefHashTableOfEnumeratorINS_7GrammarEEaSERKS2_", scope: !735, file: !736, line: 221, type: !916, scopeLine: 221, flags: DIFlagPrototyped, spFlags: 0)
!916 = !DISubroutineType(types: !917)
!917 = !{!918, !894, !902}
!918 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !735, size: 64)
!919 = !DISubprogram(name: "findNext", linkageName: "_ZN11xercesc_2_724RefHashTableOfEnumeratorINS_7GrammarEE8findNextEv", scope: !735, file: !736, line: 226, type: !897, scopeLine: 226, flags: DIFlagPrototyped, spFlags: 0)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!921 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !702)
!922 = !DISubprogram(name: "clear", linkageName: "_ZN11xercesc_2_714XMLGrammarPool5clearEv", scope: !702, file: !703, line: 111, type: !923, scopeLine: 111, containingType: !702, virtualIndex: 6, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!923 = !DISubroutineType(types: !924)
!924 = !{!505, !716}
!925 = !DISubprogram(name: "lockPool", linkageName: "_ZN11xercesc_2_714XMLGrammarPool8lockPoolEv", scope: !702, file: !703, line: 122, type: !714, scopeLine: 122, containingType: !702, virtualIndex: 7, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!926 = !DISubprogram(name: "unlockPool", linkageName: "_ZN11xercesc_2_714XMLGrammarPool10unlockPoolEv", scope: !702, file: !703, line: 134, type: !714, scopeLine: 134, containingType: !702, virtualIndex: 8, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!927 = !DISubprogram(name: "createDTDGrammar", linkageName: "_ZN11xercesc_2_714XMLGrammarPool16createDTDGrammarEv", scope: !702, file: !703, line: 147, type: !928, scopeLine: 147, containingType: !702, virtualIndex: 9, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!928 = !DISubroutineType(types: !929)
!929 = !{!930, !716}
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DICompositeType(tag: DW_TAG_class_type, name: "DTDGrammar", scope: !6, file: !932, line: 46, flags: DIFlagFwdDecl)
!932 = !DIFile(filename: "./xercesc/validators/DTD/DTDGrammar.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!933 = !DISubprogram(name: "createSchemaGrammar", linkageName: "_ZN11xercesc_2_714XMLGrammarPool19createSchemaGrammarEv", scope: !702, file: !703, line: 153, type: !934, scopeLine: 153, containingType: !702, virtualIndex: 10, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!934 = !DISubroutineType(types: !935)
!935 = !{!936, !716}
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DICompositeType(tag: DW_TAG_class_type, name: "SchemaGrammar", scope: !6, file: !938, line: 64, flags: DIFlagFwdDecl)
!938 = !DIFile(filename: "./xercesc/validators/schema/SchemaGrammar.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!939 = !DISubprogram(name: "createDTDDescription", linkageName: "_ZN11xercesc_2_714XMLGrammarPool20createDTDDescriptionEPKt", scope: !702, file: !703, line: 159, type: !940, scopeLine: 159, containingType: !702, virtualIndex: 11, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!940 = !DISubroutineType(types: !941)
!941 = !{!942, !716, !636}
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DICompositeType(tag: DW_TAG_class_type, name: "XMLDTDDescription", scope: !6, file: !944, line: 28, flags: DIFlagFwdDecl)
!944 = !DIFile(filename: "./xercesc/framework/XMLDTDDescription.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!945 = !DISubprogram(name: "createSchemaDescription", linkageName: "_ZN11xercesc_2_714XMLGrammarPool23createSchemaDescriptionEPKt", scope: !702, file: !703, line: 164, type: !946, scopeLine: 164, containingType: !702, virtualIndex: 12, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!946 = !DISubroutineType(types: !947)
!947 = !{!948, !716, !636}
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DICompositeType(tag: DW_TAG_class_type, name: "XMLSchemaDescription", scope: !6, file: !950, line: 45, flags: DIFlagFwdDecl)
!950 = !DIFile(filename: "./xercesc/framework/XMLSchemaDescription.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!951 = !DISubprogram(name: "getXSModel", linkageName: "_ZN11xercesc_2_714XMLGrammarPool10getXSModelEv", scope: !702, file: !703, line: 186, type: !952, scopeLine: 186, containingType: !702, virtualIndex: 13, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!952 = !DISubroutineType(types: !953)
!953 = !{!954, !716}
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "XSModel", scope: !6, file: !956, line: 58, size: 2432, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !957, identifier: "_ZTSN11xercesc_2_77XSModelE")
!956 = !DIFile(filename: "./xercesc/framework/psvi/XSModel.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!957 = !{!958, !959, !960, !965, !970, !976, !981, !985, !989, !992, !996, !998, !999, !1000, !1001, !1005, !1011, !1014, !1017, !1020, !1023, !1026, !1029, !1034, !1039, !1045, !1050, !1055, !1060, !1066, !1069, !1074, !1077, !1080, !1199, !1203, !1206, !1211}
!958 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !955, baseType: !456, flags: DIFlagPublic, extraData: i32 0)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "fMemoryManager", scope: !955, file: !956, line: 286, baseType: !514, size: 64, flags: DIFlagProtected)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "fNamespaceStringList", scope: !955, file: !956, line: 288, baseType: !961, size: 64, offset: 64, flags: DIFlagProtected)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "StringList", scope: !6, file: !13, line: 53, baseType: !963)
!963 = !DICompositeType(tag: DW_TAG_class_type, name: "RefArrayVectorOf<unsigned short>", scope: !6, file: !964, line: 28, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_716RefArrayVectorOfItEE")
!964 = !DIFile(filename: "./xercesc/util/RefArrayVectorOf.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!965 = !DIDerivedType(tag: DW_TAG_member, name: "fXSNamespaceItemList", scope: !955, file: !956, line: 289, baseType: !966, size: 64, offset: 128, flags: DIFlagProtected)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "XSNamespaceItemList", scope: !6, file: !13, line: 50, baseType: !968)
!968 = !DICompositeType(tag: DW_TAG_class_type, name: "RefVectorOf<xercesc_2_7::XSNamespaceItem>", scope: !6, file: !969, line: 32, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_711RefVectorOfINS_15XSNamespaceItemEEE")
!969 = !DIFile(filename: "./xercesc/util/RefVectorOf.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!970 = !DIDerivedType(tag: DW_TAG_member, name: "fIdVector", scope: !955, file: !956, line: 291, baseType: !971, size: 896, offset: 192, flags: DIFlagProtected)
!971 = !DICompositeType(tag: DW_TAG_array_type, baseType: !972, size: 896, elements: !974)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DICompositeType(tag: DW_TAG_class_type, name: "RefVectorOf<xercesc_2_7::XSObject>", scope: !6, file: !969, line: 32, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_711RefVectorOfINS_8XSObjectEEE")
!974 = !{!975}
!975 = !DISubrange(count: 14)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "fComponentMap", scope: !955, file: !956, line: 309, baseType: !977, size: 896, offset: 1088, flags: DIFlagProtected)
!977 = !DICompositeType(tag: DW_TAG_array_type, baseType: !978, size: 896, elements: !974)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DICompositeType(tag: DW_TAG_class_type, name: "XSNamedMap<xercesc_2_7::XSObject>", scope: !6, file: !980, line: 40, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_710XSNamedMapINS_8XSObjectEEE")
!980 = !DIFile(filename: "./xercesc/framework/psvi/XSNamedMap.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!981 = !DIDerivedType(tag: DW_TAG_member, name: "fURIStringPool", scope: !955, file: !956, line: 310, baseType: !982, size: 64, offset: 1984, flags: DIFlagProtected)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DICompositeType(tag: DW_TAG_class_type, name: "XMLStringPool", scope: !6, file: !984, line: 43, flags: DIFlagFwdDecl)
!984 = !DIFile(filename: "./xercesc/util/StringPool.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!985 = !DIDerivedType(tag: DW_TAG_member, name: "fXSAnnotationList", scope: !955, file: !956, line: 311, baseType: !986, size: 64, offset: 2048, flags: DIFlagProtected)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "XSAnnotationList", scope: !6, file: !13, line: 46, baseType: !988)
!988 = !DICompositeType(tag: DW_TAG_class_type, name: "RefVectorOf<xercesc_2_7::XSAnnotation>", scope: !6, file: !969, line: 32, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_711RefVectorOfINS_12XSAnnotationEEE")
!989 = !DIDerivedType(tag: DW_TAG_member, name: "fHashNamespace", scope: !955, file: !956, line: 312, baseType: !990, size: 64, offset: 2112, flags: DIFlagProtected)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = !DICompositeType(tag: DW_TAG_class_type, name: "RefHashTableOf<xercesc_2_7::XSNamespaceItem>", scope: !6, file: !736, line: 72, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_714RefHashTableOfINS_15XSNamespaceItemEEE")
!992 = !DIDerivedType(tag: DW_TAG_member, name: "fObjFactory", scope: !955, file: !956, line: 313, baseType: !993, size: 64, offset: 2176, flags: DIFlagProtected)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = !DICompositeType(tag: DW_TAG_class_type, name: "XSObjectFactory", scope: !6, file: !995, line: 368, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_715XSObjectFactoryE")
!995 = !DIFile(filename: "./xercesc/framework/psvi/XSSimpleTypeDefinition.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!996 = !DIDerivedType(tag: DW_TAG_member, name: "fDeleteNamespace", scope: !955, file: !956, line: 314, baseType: !997, size: 64, offset: 2240, flags: DIFlagProtected)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "fParent", scope: !955, file: !956, line: 315, baseType: !954, size: 64, offset: 2304, flags: DIFlagProtected)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "fDeleteParent", scope: !955, file: !956, line: 316, baseType: !505, size: 8, offset: 2368, flags: DIFlagProtected)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "fAddedS4SGrammar", scope: !955, file: !956, line: 317, baseType: !505, size: 8, offset: 2376, flags: DIFlagProtected)
!1001 = !DISubprogram(name: "XSModel", scope: !955, file: !956, line: 72, type: !1002, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{null, !1004, !701, !514}
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!1005 = !DISubprogram(name: "XSModel", scope: !955, file: !956, line: 84, type: !1006, scopeLine: 84, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{null, !1004, !954, !1008, !514}
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DICompositeType(tag: DW_TAG_class_type, name: "GrammarResolver", scope: !6, file: !1010, line: 31, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_715GrammarResolverE")
!1010 = !DIFile(filename: "./xercesc/framework/XMLContentModel.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!1011 = !DISubprogram(name: "~XSModel", scope: !955, file: !956, line: 92, type: !1012, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{null, !1004}
!1014 = !DISubprogram(name: "getNamespaces", linkageName: "_ZN11xercesc_2_77XSModel13getNamespacesEv", scope: !955, file: !956, line: 106, type: !1015, scopeLine: 106, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!961, !1004}
!1017 = !DISubprogram(name: "getNamespaceItems", linkageName: "_ZN11xercesc_2_77XSModel17getNamespaceItemsEv", scope: !955, file: !956, line: 116, type: !1018, scopeLine: 116, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!966, !1004}
!1020 = !DISubprogram(name: "getComponents", linkageName: "_ZN11xercesc_2_77XSModel13getComponentsENS_11XSConstants14COMPONENT_TYPEE", scope: !955, file: !956, line: 128, type: !1021, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!978, !1004, !12}
!1023 = !DISubprogram(name: "getComponentsByNamespace", linkageName: "_ZN11xercesc_2_77XSModel24getComponentsByNamespaceENS_11XSConstants14COMPONENT_TYPEEPKt", scope: !955, file: !956, line: 142, type: !1024, scopeLine: 142, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!978, !1004, !12, !637}
!1026 = !DISubprogram(name: "getAnnotations", linkageName: "_ZN11xercesc_2_77XSModel14getAnnotationsEv", scope: !955, file: !956, line: 148, type: !1027, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!986, !1004}
!1029 = !DISubprogram(name: "getElementDeclaration", linkageName: "_ZN11xercesc_2_77XSModel21getElementDeclarationEPKtS2_", scope: !955, file: !956, line: 157, type: !1030, scopeLine: 157, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!1032, !1004, !637, !637}
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = !DICompositeType(tag: DW_TAG_class_type, name: "XSElementDeclaration", scope: !6, file: !956, line: 51, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_720XSElementDeclarationE")
!1034 = !DISubprogram(name: "getAttributeDeclaration", linkageName: "_ZN11xercesc_2_77XSModel23getAttributeDeclarationEPKtS2_", scope: !955, file: !956, line: 167, type: !1035, scopeLine: 167, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!1037, !1004, !637, !637}
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = !DICompositeType(tag: DW_TAG_class_type, name: "XSAttributeDeclaration", scope: !6, file: !956, line: 49, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_722XSAttributeDeclarationE")
!1039 = !DISubprogram(name: "getTypeDefinition", linkageName: "_ZN11xercesc_2_77XSModel17getTypeDefinitionEPKtS2_", scope: !955, file: !956, line: 178, type: !1040, scopeLine: 178, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!1042, !1004, !637, !637}
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = !DICompositeType(tag: DW_TAG_class_type, name: "XSTypeDefinition", scope: !6, file: !1044, line: 38, flags: DIFlagFwdDecl)
!1044 = !DIFile(filename: "./xercesc/framework/psvi/XSTypeDefinition.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!1045 = !DISubprogram(name: "getAttributeGroup", linkageName: "_ZN11xercesc_2_77XSModel17getAttributeGroupEPKtS2_", scope: !955, file: !956, line: 188, type: !1046, scopeLine: 188, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!1048, !1004, !637, !637}
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = !DICompositeType(tag: DW_TAG_class_type, name: "XSAttributeGroupDefinition", scope: !6, file: !956, line: 50, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_726XSAttributeGroupDefinitionE")
!1050 = !DISubprogram(name: "getModelGroupDefinition", linkageName: "_ZN11xercesc_2_77XSModel23getModelGroupDefinitionEPKtS2_", scope: !955, file: !956, line: 198, type: !1051, scopeLine: 198, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!1053, !1004, !637, !637}
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = !DICompositeType(tag: DW_TAG_class_type, name: "XSModelGroupDefinition", scope: !6, file: !956, line: 52, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_722XSModelGroupDefinitionE")
!1055 = !DISubprogram(name: "getNotationDeclaration", linkageName: "_ZN11xercesc_2_77XSModel22getNotationDeclarationEPKtS2_", scope: !955, file: !956, line: 208, type: !1056, scopeLine: 208, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!1058, !1004, !637, !637}
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DICompositeType(tag: DW_TAG_class_type, name: "XSNotationDeclaration", scope: !6, file: !956, line: 54, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_721XSNotationDeclarationE")
!1060 = !DISubprogram(name: "getXSObjectById", linkageName: "_ZN11xercesc_2_77XSModel15getXSObjectByIdEjNS_11XSConstants14COMPONENT_TYPEE", scope: !955, file: !956, line: 220, type: !1061, scopeLine: 220, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!1063, !1004, !7, !12}
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1064 = !DICompositeType(tag: DW_TAG_class_type, name: "XSObject", scope: !6, file: !1065, line: 41, flags: DIFlagFwdDecl)
!1065 = !DIFile(filename: "./xercesc/framework/psvi/XSObject.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!1066 = !DISubprogram(name: "getURIStringPool", linkageName: "_ZN11xercesc_2_77XSModel16getURIStringPoolEv", scope: !955, file: !956, line: 229, type: !1067, scopeLine: 229, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{!982, !1004}
!1069 = !DISubprogram(name: "getNamespaceItem", linkageName: "_ZN11xercesc_2_77XSModel16getNamespaceItemEPKt", scope: !955, file: !956, line: 231, type: !1070, scopeLine: 231, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1070 = !DISubroutineType(types: !1071)
!1071 = !{!1072, !1004, !636}
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = !DICompositeType(tag: DW_TAG_class_type, name: "XSNamespaceItem", scope: !6, file: !13, line: 38, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_715XSNamespaceItemE")
!1074 = !DISubprogram(name: "getXSObject", linkageName: "_ZN11xercesc_2_77XSModel11getXSObjectEPv", scope: !955, file: !956, line: 240, type: !1075, scopeLine: 240, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1075 = !DISubroutineType(types: !1076)
!1076 = !{!1063, !1004, !462}
!1077 = !DISubprogram(name: "addGrammarToXSModel", linkageName: "_ZN11xercesc_2_77XSModel19addGrammarToXSModelEPNS_15XSNamespaceItemE", scope: !955, file: !956, line: 248, type: !1078, scopeLine: 248, flags: DIFlagPrototyped, spFlags: 0)
!1078 = !DISubroutineType(types: !1079)
!1079 = !{null, !1004, !1072}
!1080 = !DISubprogram(name: "addS4SToXSModel", linkageName: "_ZN11xercesc_2_77XSModel15addS4SToXSModelEPNS_15XSNamespaceItemEPNS_14RefHashTableOfINS_17DatatypeValidatorEEE", scope: !955, file: !956, line: 252, type: !1081, scopeLine: 252, flags: DIFlagPrototyped, spFlags: 0)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{null, !1004, !1083, !1084}
!1083 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1072)
!1084 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1085)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64)
!1086 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "RefHashTableOf<xercesc_2_7::DatatypeValidator>", scope: !6, file: !736, line: 72, size: 384, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !1087, templateParams: !1120, identifier: "_ZTSN11xercesc_2_714RefHashTableOfINS_17DatatypeValidatorEEE")
!1087 = !{!1088, !1089, !1090, !1091, !1122, !1123, !1124, !1125, !1126, !1130, !1133, !1136, !1139, !1144, !1147, !1150, !1151, !1152, !1155, !1158, !1161, !1162, !1167, !1170, !1173, !1174, !1177, !1180, !1184, !1188, !1191, !1195, !1198}
!1088 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !1086, baseType: !456, flags: DIFlagPublic, extraData: i32 0)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "fMemoryManager", scope: !1086, file: !736, line: 178, baseType: !469, size: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "fAdoptedElems", scope: !1086, file: !736, line: 179, baseType: !505, size: 8, offset: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "fBucketList", scope: !1086, file: !736, line: 180, baseType: !1092, size: 64, offset: 128)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RefHashTableBucketElem<xercesc_2_7::DatatypeValidator>", scope: !6, file: !736, line: 49, size: 192, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !1095, templateParams: !1120, identifier: "_ZTSN11xercesc_2_722RefHashTableBucketElemINS_17DatatypeValidatorEEE")
!1095 = !{!1096, !1100, !1101, !1102, !1107, !1110, !1111, !1116}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "fData", scope: !1094, file: !736, line: 59, baseType: !1097, size: 64)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = !DICompositeType(tag: DW_TAG_class_type, name: "DatatypeValidator", scope: !6, file: !1099, line: 54, flags: DIFlagFwdDecl)
!1099 = !DIFile(filename: "./xercesc/validators/datatype/DatatypeValidator.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "fNext", scope: !1094, file: !736, line: 60, baseType: !1093, size: 64, offset: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "fKey", scope: !1094, file: !736, line: 61, baseType: !462, size: 64, offset: 128)
!1102 = !DISubprogram(name: "RefHashTableBucketElem", scope: !1094, file: !736, line: 51, type: !1103, scopeLine: 51, flags: DIFlagPrototyped, spFlags: 0)
!1103 = !DISubroutineType(types: !1104)
!1104 = !{null, !1105, !462, !1106, !1093}
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!1106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1097)
!1107 = !DISubprogram(name: "RefHashTableBucketElem", scope: !1094, file: !736, line: 56, type: !1108, scopeLine: 56, flags: DIFlagPrototyped, spFlags: 0)
!1108 = !DISubroutineType(types: !1109)
!1109 = !{null, !1105}
!1110 = !DISubprogram(name: "~RefHashTableBucketElem", scope: !1094, file: !736, line: 57, type: !1108, scopeLine: 57, flags: DIFlagPrototyped, spFlags: 0)
!1111 = !DISubprogram(name: "RefHashTableBucketElem", scope: !1094, file: !736, line: 67, type: !1112, scopeLine: 67, flags: DIFlagPrivate | DIFlagPrototyped, spFlags: 0)
!1112 = !DISubroutineType(types: !1113)
!1113 = !{null, !1105, !1114}
!1114 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1115, size: 64)
!1115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1094)
!1116 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_722RefHashTableBucketElemINS_17DatatypeValidatorEEaSERKS2_", scope: !1094, file: !736, line: 68, type: !1117, scopeLine: 68, flags: DIFlagPrivate | DIFlagPrototyped, spFlags: 0)
!1117 = !DISubroutineType(types: !1118)
!1118 = !{!1119, !1105, !1114}
!1119 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1094, size: 64)
!1120 = !{!1121}
!1121 = !DITemplateTypeParameter(name: "TVal", type: !1098)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "fHashModulus", scope: !1086, file: !736, line: 181, baseType: !7, size: 32, offset: 192)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "fInitialModulus", scope: !1086, file: !736, line: 182, baseType: !7, size: 32, offset: 224)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "fCount", scope: !1086, file: !736, line: 183, baseType: !7, size: 32, offset: 256)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "fHash", scope: !1086, file: !736, line: 184, baseType: !810, size: 64, offset: 320)
!1126 = !DISubprogram(name: "RefHashTableOf", scope: !1086, file: !736, line: 79, type: !1127, scopeLine: 79, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1127 = !DISubroutineType(types: !1128)
!1128 = !{null, !1129, !622, !514}
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!1130 = !DISubprogram(name: "RefHashTableOf", scope: !1086, file: !736, line: 85, type: !1131, scopeLine: 85, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{null, !1129, !622, !526, !514}
!1133 = !DISubprogram(name: "RefHashTableOf", scope: !1086, file: !736, line: 94, type: !1134, scopeLine: 94, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1134 = !DISubroutineType(types: !1135)
!1135 = !{null, !1129, !622, !526, !810, !514}
!1136 = !DISubprogram(name: "~RefHashTableOf", scope: !1086, file: !736, line: 101, type: !1137, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1137 = !DISubroutineType(types: !1138)
!1138 = !{null, !1129}
!1139 = !DISubprogram(name: "isEmpty", linkageName: "_ZNK11xercesc_2_714RefHashTableOfINS_17DatatypeValidatorEE7isEmptyEv", scope: !1086, file: !736, line: 107, type: !1140, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1140 = !DISubroutineType(types: !1141)
!1141 = !{!505, !1142}
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!1143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1086)
!1144 = !DISubprogram(name: "containsKey", linkageName: "_ZNK11xercesc_2_714RefHashTableOfINS_17DatatypeValidatorEE11containsKeyEPKv", scope: !1086, file: !736, line: 108, type: !1145, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1145 = !DISubroutineType(types: !1146)
!1146 = !{!505, !1142, !834}
!1147 = !DISubprogram(name: "removeKey", linkageName: "_ZN11xercesc_2_714RefHashTableOfINS_17DatatypeValidatorEE9removeKeyEPKv", scope: !1086, file: !736, line: 109, type: !1148, scopeLine: 109, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1148 = !DISubroutineType(types: !1149)
!1149 = !{null, !1129, !834}
!1150 = !DISubprogram(name: "removeAll", linkageName: "_ZN11xercesc_2_714RefHashTableOfINS_17DatatypeValidatorEE9removeAllEv", scope: !1086, file: !736, line: 110, type: !1137, scopeLine: 110, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1151 = !DISubprogram(name: "cleanup", linkageName: "_ZN11xercesc_2_714RefHashTableOfINS_17DatatypeValidatorEE7cleanupEv", scope: !1086, file: !736, line: 111, type: !1137, scopeLine: 111, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1152 = !DISubprogram(name: "reinitialize", linkageName: "_ZN11xercesc_2_714RefHashTableOfINS_17DatatypeValidatorEE12reinitializeEPNS_8HashBaseE", scope: !1086, file: !736, line: 112, type: !1153, scopeLine: 112, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1153 = !DISubroutineType(types: !1154)
!1154 = !{null, !1129, !810}
!1155 = !DISubprogram(name: "transferElement", linkageName: "_ZN11xercesc_2_714RefHashTableOfINS_17DatatypeValidatorEE15transferElementEPKvPv", scope: !1086, file: !736, line: 113, type: !1156, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1156 = !DISubroutineType(types: !1157)
!1157 = !{null, !1129, !834, !462}
!1158 = !DISubprogram(name: "orphanKey", linkageName: "_ZN11xercesc_2_714RefHashTableOfINS_17DatatypeValidatorEE9orphanKeyEPKv", scope: !1086, file: !736, line: 114, type: !1159, scopeLine: 114, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1159 = !DISubroutineType(types: !1160)
!1160 = !{!1097, !1129, !834}
!1161 = !DISubprogram(name: "get", linkageName: "_ZN11xercesc_2_714RefHashTableOfINS_17DatatypeValidatorEE3getEPKv", scope: !1086, file: !736, line: 119, type: !1159, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1162 = !DISubprogram(name: "get", linkageName: "_ZNK11xercesc_2_714RefHashTableOfINS_17DatatypeValidatorEE3getEPKv", scope: !1086, file: !736, line: 120, type: !1163, scopeLine: 120, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1163 = !DISubroutineType(types: !1164)
!1164 = !{!1165, !1142, !834}
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64)
!1166 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1098)
!1167 = !DISubprogram(name: "getMemoryManager", linkageName: "_ZNK11xercesc_2_714RefHashTableOfINS_17DatatypeValidatorEE16getMemoryManagerEv", scope: !1086, file: !736, line: 121, type: !1168, scopeLine: 121, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1168 = !DISubroutineType(types: !1169)
!1169 = !{!469, !1142}
!1170 = !DISubprogram(name: "getHashModulus", linkageName: "_ZNK11xercesc_2_714RefHashTableOfINS_17DatatypeValidatorEE14getHashModulusEv", scope: !1086, file: !736, line: 122, type: !1171, scopeLine: 122, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1171 = !DISubroutineType(types: !1172)
!1172 = !{!7, !1142}
!1173 = !DISubprogram(name: "getCount", linkageName: "_ZNK11xercesc_2_714RefHashTableOfINS_17DatatypeValidatorEE8getCountEv", scope: !1086, file: !736, line: 123, type: !1171, scopeLine: 123, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1174 = !DISubprogram(name: "setAdoptElements", linkageName: "_ZN11xercesc_2_714RefHashTableOfINS_17DatatypeValidatorEE16setAdoptElementsEb", scope: !1086, file: !736, line: 128, type: !1175, scopeLine: 128, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1175 = !DISubroutineType(types: !1176)
!1176 = !{null, !1129, !526}
!1177 = !DISubprogram(name: "put", linkageName: "_ZN11xercesc_2_714RefHashTableOfINS_17DatatypeValidatorEE3putEPvPS1_", scope: !1086, file: !736, line: 134, type: !1178, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1178 = !DISubroutineType(types: !1179)
!1179 = !{null, !1129, !462, !1106}
!1180 = !DISubprogram(name: "RefHashTableOf", scope: !1086, file: !736, line: 147, type: !1181, scopeLine: 147, flags: DIFlagPrototyped, spFlags: 0)
!1181 = !DISubroutineType(types: !1182)
!1182 = !{null, !1129, !1183}
!1183 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1143, size: 64)
!1184 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_714RefHashTableOfINS_17DatatypeValidatorEEaSERKS2_", scope: !1086, file: !736, line: 148, type: !1185, scopeLine: 148, flags: DIFlagPrototyped, spFlags: 0)
!1185 = !DISubroutineType(types: !1186)
!1186 = !{!1187, !1129, !1183}
!1187 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1086, size: 64)
!1188 = !DISubprogram(name: "findBucketElem", linkageName: "_ZN11xercesc_2_714RefHashTableOfINS_17DatatypeValidatorEE14findBucketElemEPKvRj", scope: !1086, file: !736, line: 153, type: !1189, scopeLine: 153, flags: DIFlagPrototyped, spFlags: 0)
!1189 = !DISubroutineType(types: !1190)
!1190 = !{!1093, !1129, !834, !881}
!1191 = !DISubprogram(name: "findBucketElem", linkageName: "_ZNK11xercesc_2_714RefHashTableOfINS_17DatatypeValidatorEE14findBucketElemEPKvRj", scope: !1086, file: !736, line: 154, type: !1192, scopeLine: 154, flags: DIFlagPrototyped, spFlags: 0)
!1192 = !DISubroutineType(types: !1193)
!1193 = !{!1194, !1142, !834, !881}
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1195 = !DISubprogram(name: "initialize", linkageName: "_ZN11xercesc_2_714RefHashTableOfINS_17DatatypeValidatorEE10initializeEj", scope: !1086, file: !736, line: 155, type: !1196, scopeLine: 155, flags: DIFlagPrototyped, spFlags: 0)
!1196 = !DISubroutineType(types: !1197)
!1197 = !{null, !1129, !622}
!1198 = !DISubprogram(name: "rehash", linkageName: "_ZN11xercesc_2_714RefHashTableOfINS_17DatatypeValidatorEE6rehashEv", scope: !1086, file: !736, line: 156, type: !1137, scopeLine: 156, flags: DIFlagPrototyped, spFlags: 0)
!1199 = !DISubprogram(name: "addComponentToNamespace", linkageName: "_ZN11xercesc_2_77XSModel23addComponentToNamespaceEPNS_15XSNamespaceItemEPNS_8XSObjectEib", scope: !955, file: !956, line: 257, type: !1200, scopeLine: 257, flags: DIFlagPrototyped, spFlags: 0)
!1200 = !DISubroutineType(types: !1201)
!1201 = !{null, !1004, !1083, !1202, !508, !505}
!1202 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1063)
!1203 = !DISubprogram(name: "addComponentToIdVector", linkageName: "_ZN11xercesc_2_77XSModel22addComponentToIdVectorEPNS_8XSObjectEi", scope: !955, file: !956, line: 265, type: !1204, scopeLine: 265, flags: DIFlagPrototyped, spFlags: 0)
!1204 = !DISubroutineType(types: !1205)
!1205 = !{null, !1004, !1202, !508}
!1206 = !DISubprogram(name: "XSModel", scope: !955, file: !956, line: 274, type: !1207, scopeLine: 274, flags: DIFlagPrototyped, spFlags: 0)
!1207 = !DISubroutineType(types: !1208)
!1208 = !{null, !1004, !1209}
!1209 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1210, size: 64)
!1210 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !955)
!1211 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_77XSModelaSERKS0_", scope: !955, file: !956, line: 275, type: !1212, scopeLine: 275, flags: DIFlagPrototyped, spFlags: 0)
!1212 = !DISubroutineType(types: !1213)
!1213 = !{!1214, !1004, !1209}
!1214 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !955, size: 64)
!1215 = !DISubprogram(name: "getXSModel", linkageName: "_ZN11xercesc_2_714XMLGrammarPool10getXSModelERb", scope: !702, file: !703, line: 203, type: !1216, scopeLine: 203, containingType: !702, virtualIndex: 14, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!1216 = !DISubroutineType(types: !1217)
!1217 = !{!954, !716, !1218}
!1218 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !505, size: 64)
!1219 = !DISubprogram(name: "getMemoryManager", linkageName: "_ZN11xercesc_2_714XMLGrammarPool16getMemoryManagerEv", scope: !702, file: !703, line: 220, type: !1220, scopeLine: 220, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1220 = !DISubroutineType(types: !1221)
!1221 = !{!469, !716}
!1222 = !DISubprogram(name: "getURIStringPool", linkageName: "_ZN11xercesc_2_714XMLGrammarPool16getURIStringPoolEv", scope: !702, file: !703, line: 231, type: !1223, scopeLine: 231, containingType: !702, virtualIndex: 15, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!1223 = !DISubroutineType(types: !1224)
!1224 = !{!982, !716}
!1225 = !DISubprogram(name: "serializeGrammars", linkageName: "_ZN11xercesc_2_714XMLGrammarPool17serializeGrammarsEPNS_15BinOutputStreamE", scope: !702, file: !703, line: 290, type: !1226, scopeLine: 290, containingType: !702, virtualIndex: 16, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!1226 = !DISubroutineType(types: !1227)
!1227 = !{null, !716, !1228}
!1228 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1229)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64)
!1230 = !DICompositeType(tag: DW_TAG_class_type, name: "BinOutputStream", scope: !6, file: !691, line: 36, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_715BinOutputStreamE")
!1231 = !DISubprogram(name: "deserializeGrammars", linkageName: "_ZN11xercesc_2_714XMLGrammarPool19deserializeGrammarsEPNS_14BinInputStreamE", scope: !702, file: !703, line: 291, type: !1232, scopeLine: 291, containingType: !702, virtualIndex: 17, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!1232 = !DISubroutineType(types: !1233)
!1233 = !{null, !716, !1234}
!1234 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1235)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64)
!1236 = !DICompositeType(tag: DW_TAG_class_type, name: "BinInputStream", scope: !6, file: !691, line: 37, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_714BinInputStreamE")
!1237 = !DISubprogram(name: "setIgnoreSerializedAnnotations", linkageName: "_ZN11xercesc_2_714XMLGrammarPool30setIgnoreSerializedAnnotationsEb", scope: !702, file: !703, line: 297, type: !1238, scopeLine: 297, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1238 = !DISubroutineType(types: !1239)
!1239 = !{null, !716, !526}
!1240 = !DISubprogram(name: "getIgnoreSerializedAnnotations", linkageName: "_ZNK11xercesc_2_714XMLGrammarPool30getIgnoreSerializedAnnotationsEv", scope: !702, file: !703, line: 301, type: !1241, scopeLine: 301, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1241 = !DISubroutineType(types: !1242)
!1242 = !{!505, !920}
!1243 = !DISubprogram(name: "XMLGrammarPool", scope: !702, file: !703, line: 311, type: !1244, scopeLine: 311, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!1244 = !DISubroutineType(types: !1245)
!1245 = !{null, !716, !514}
!1246 = !DISubprogram(name: "XMLGrammarPool", scope: !702, file: !703, line: 323, type: !1247, scopeLine: 323, flags: DIFlagPrototyped, spFlags: 0)
!1247 = !DISubroutineType(types: !1248)
!1248 = !{null, !716, !1249}
!1249 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !921, size: 64)
!1250 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_714XMLGrammarPoolaSERKS0_", scope: !702, file: !703, line: 324, type: !1251, scopeLine: 324, flags: DIFlagPrototyped, spFlags: 0)
!1251 = !DISubroutineType(types: !1252)
!1252 = !{!1253, !716, !1249}
!1253 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !702, size: 64)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "fInputStream", scope: !690, file: !691, line: 699, baseType: !1234, size: 64, offset: 128)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "fOutputStream", scope: !690, file: !691, line: 700, baseType: !1228, size: 64, offset: 192)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "fBufCount", scope: !690, file: !691, line: 702, baseType: !465, size: 64, offset: 256)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "fBufSize", scope: !690, file: !691, line: 705, baseType: !1258, size: 64, offset: 320)
!1258 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !465)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "fBufStart", scope: !690, file: !691, line: 706, baseType: !1260, size: 64, offset: 384)
!1260 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1261)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1262, size: 64)
!1262 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMLByte", file: !1263, line: 384, baseType: !1264)
!1263 = !DIFile(filename: "./xercesc/util/XercesDefs.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!1264 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "fBufEnd", scope: !690, file: !691, line: 707, baseType: !1260, size: 64, offset: 448)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "fBufCur", scope: !690, file: !691, line: 708, baseType: !1261, size: 64, offset: 512)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "fBufLoadMax", scope: !690, file: !691, line: 709, baseType: !1261, size: 64, offset: 576)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "fStorePool", scope: !690, file: !691, line: 722, baseType: !1269, size: 64, offset: 640)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64)
!1270 = !DICompositeType(tag: DW_TAG_class_type, name: "RefHashTableOf<xercesc_2_7::XSerializedObjectId>", scope: !6, file: !736, line: 72, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_714RefHashTableOfINS_19XSerializedObjectIdEEE")
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "fLoadPool", scope: !690, file: !691, line: 731, baseType: !1272, size: 64, offset: 704)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64)
!1273 = !DICompositeType(tag: DW_TAG_class_type, name: "ValueVectorOf<void *>", scope: !6, file: !1274, line: 32, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_713ValueVectorOfIPvEE")
!1274 = !DIFile(filename: "./xercesc/util/ValueVectorOf.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "fObjectCount", scope: !690, file: !691, line: 736, baseType: !1276, size: 32, offset: 768)
!1276 = !DIDerivedType(tag: DW_TAG_typedef, name: "XSerializedObjectId_t", scope: !690, file: !691, line: 53, baseType: !7)
!1277 = !DISubprogram(name: "~XSerializeEngine", scope: !690, file: !691, line: 60, type: !1278, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1278 = !DISubroutineType(types: !1279)
!1279 = !{null, !1280}
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!1281 = !DISubprogram(name: "XSerializeEngine", scope: !690, file: !691, line: 76, type: !1282, scopeLine: 76, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1282 = !DISubroutineType(types: !1283)
!1283 = !{null, !1280, !1235, !700, !465}
!1284 = !DISubprogram(name: "XSerializeEngine", scope: !690, file: !691, line: 95, type: !1285, scopeLine: 95, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1285 = !DISubroutineType(types: !1286)
!1286 = !{null, !1280, !1229, !700, !465}
!1287 = !DISubprogram(name: "XSerializeEngine", scope: !690, file: !691, line: 116, type: !1288, scopeLine: 116, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1288 = !DISubroutineType(types: !1289)
!1289 = !{null, !1280, !1235, !514, !465}
!1290 = !DISubprogram(name: "XSerializeEngine", scope: !690, file: !691, line: 137, type: !1291, scopeLine: 137, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1291 = !DISubroutineType(types: !1292)
!1292 = !{null, !1280, !1229, !514, !465}
!1293 = !DISubprogram(name: "flush", linkageName: "_ZN11xercesc_2_716XSerializeEngine5flushEv", scope: !690, file: !691, line: 148, type: !1278, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1294 = !DISubprogram(name: "isStoring", linkageName: "_ZNK11xercesc_2_716XSerializeEngine9isStoringEv", scope: !690, file: !691, line: 158, type: !1295, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1295 = !DISubroutineType(types: !1296)
!1296 = !{!505, !1297}
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!1298 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !690)
!1299 = !DISubprogram(name: "isLoading", linkageName: "_ZNK11xercesc_2_716XSerializeEngine9isLoadingEv", scope: !690, file: !691, line: 168, type: !1295, scopeLine: 168, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1300 = !DISubprogram(name: "getGrammarPool", linkageName: "_ZNK11xercesc_2_716XSerializeEngine14getGrammarPoolEv", scope: !690, file: !691, line: 177, type: !1301, scopeLine: 177, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1301 = !DISubroutineType(types: !1302)
!1302 = !{!701, !1297}
!1303 = !DISubprogram(name: "getStringPool", linkageName: "_ZNK11xercesc_2_716XSerializeEngine13getStringPoolEv", scope: !690, file: !691, line: 186, type: !1304, scopeLine: 186, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1304 = !DISubroutineType(types: !1305)
!1305 = !{!982, !1297}
!1306 = !DISubprogram(name: "getMemoryManager", linkageName: "_ZNK11xercesc_2_716XSerializeEngine16getMemoryManagerEv", scope: !690, file: !691, line: 195, type: !1307, scopeLine: 195, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1307 = !DISubroutineType(types: !1308)
!1308 = !{!469, !1297}
!1309 = !DISubprogram(name: "getStorerLevel", linkageName: "_ZNK11xercesc_2_716XSerializeEngine14getStorerLevelEv", scope: !690, file: !691, line: 209, type: !1310, scopeLine: 209, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1310 = !DISubroutineType(types: !1311)
!1311 = !{!617, !1297}
!1312 = !DISubprogram(name: "write", linkageName: "_ZN11xercesc_2_716XSerializeEngine5writeEPNS_13XSerializableE", scope: !690, file: !691, line: 221, type: !1313, scopeLine: 221, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!1313 = !DISubroutineType(types: !1314)
!1314 = !{null, !1280, !1315}
!1315 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !680)
