; ModuleID = 'GeneralAttributeCheck.cpp'
source_filename = "GeneralAttributeCheck.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"class.xercesc_2_7::XMLRegisterCleanup" = type { void ()*, %"class.xercesc_2_7::XMLRegisterCleanup"*, %"class.xercesc_2_7::XMLRegisterCleanup"* }
%"class.xercesc_2_7::ValueHashTableOf" = type { %"class.xercesc_2_7::MemoryManager"*, %"struct.xercesc_2_7::ValueHashTableBucketElem"**, i32, %"class.xercesc_2_7::HashBase"* }
%"class.xercesc_2_7::MemoryManager" = type { i32 (...)** }
%"struct.xercesc_2_7::ValueHashTableBucketElem" = type { i16, %"struct.xercesc_2_7::ValueHashTableBucketElem"*, i8* }
%"class.xercesc_2_7::HashBase" = type { i32 (...)** }
%"class.xercesc_2_7::DatatypeValidator" = type { %"class.xercesc_2_7::XSerializable", i8, i8, i8, i8, i16, i32, i32, i32, i32, i32, %"class.xercesc_2_7::DatatypeValidator"*, %"class.xercesc_2_7::RefHashTableOf"*, i16*, %"class.xercesc_2_7::RegularExpression"*, i16*, i16*, i16*, %"class.xercesc_2_7::MemoryManager"* }
%"class.xercesc_2_7::XSerializable" = type { i32 (...)** }
%"class.xercesc_2_7::RefHashTableOf" = type opaque

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "sGeneralAttCheckCleanup", linkageName: "_ZN11xercesc_2_7L23sGeneralAttCheckCleanupE", scope: !2, file: !3, line: 208, type: !4, isLocal: true, isDefinition: true)
!2 = !DINamespace(name: "xercesc_2_7", scope: null)
!3 = !DIFile(filename: "GeneralAttributeCheck.cpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!4 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "XMLRegisterCleanup", scope: !2, file: !5, line: 41, size: 192, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !6, identifier: "_ZTSN11xercesc_2_718XMLRegisterCleanupE")
!5 = !DIFile(filename: "./xercesc/util/XMLRegisterCleanup.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!6 = !{!7, !12, !14, !15, !19, !22, !23, !24, !29, !33}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "m_cleanupFn", scope: !4, file: !5, line: 73, baseType: !8, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMLCleanupFn", scope: !4, file: !5, line: 45, baseType: !9)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DISubroutineType(types: !11)
!11 = !{null}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "m_nextCleanup", scope: !4, file: !5, line: 76, baseType: !13, size: 64, offset: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "m_prevCleanup", scope: !4, file: !5, line: 76, baseType: !13, size: 64, offset: 128)
!15 = !DISubprogram(name: "doCleanup", linkageName: "_ZN11xercesc_2_718XMLRegisterCleanup9doCleanupEv", scope: !4, file: !5, line: 47, type: !16, scopeLine: 47, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!16 = !DISubroutineType(types: !17)
!17 = !{null, !18}
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!19 = !DISubprogram(name: "registerCleanup", linkageName: "_ZN11xercesc_2_718XMLRegisterCleanup15registerCleanupEPFvvE", scope: !4, file: !5, line: 53, type: !20, scopeLine: 53, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!20 = !DISubroutineType(types: !21)
!21 = !{null, !18, !8}
!22 = !DISubprogram(name: "unregisterCleanup", linkageName: "_ZN11xercesc_2_718XMLRegisterCleanup17unregisterCleanupEv", scope: !4, file: !5, line: 59, type: !16, scopeLine: 59, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!23 = !DISubprogram(name: "XMLRegisterCleanup", scope: !4, file: !5, line: 63, type: !16, scopeLine: 63, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!24 = !DISubprogram(name: "XMLRegisterCleanup", scope: !4, file: !5, line: 69, type: !25, scopeLine: 69, flags: DIFlagPrototyped, spFlags: 0)
!25 = !DISubroutineType(types: !26)
!26 = !{null, !18, !27}
!27 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!29 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_718XMLRegisterCleanupaSERKS0_", scope: !4, file: !5, line: 70, type: !30, scopeLine: 70, flags: DIFlagPrototyped, spFlags: 0)
!30 = !DISubroutineType(types: !31)
!31 = !{!32, !18, !27}
!32 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !4, size: 64)
!33 = !DISubprogram(name: "resetCleanup", linkageName: "_ZN11xercesc_2_718XMLRegisterCleanup12resetCleanupEv", scope: !4, file: !5, line: 79, type: !16, scopeLine: 79, flags: DIFlagPrototyped, spFlags: 0)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "fAttMap", linkageName: "_ZN11xercesc_2_721GeneralAttributeCheck7fAttMapE", scope: !2, file: !3, line: 214, type: !36, isLocal: false, isDefinition: true, declaration: !170)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "ValueHashTableOf<unsigned short>", scope: !2, file: !38, line: 70, size: 256, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !39, templateParams: !102, identifier: "_ZTSN11xercesc_2_716ValueHashTableOfItEE")
!38 = !DIFile(filename: "./xercesc/util/ValueHashTableOf.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!39 = !{!40, !73, !74, !104, !106, !110, !116, !119, !122, !128, !134, !137, !138, !142, !145, !148, !152, !156, !160, !164, !167}
!40 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !37, baseType: !41, flags: DIFlagPublic, extraData: i32 0)
!41 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "XMemory", scope: !2, file: !42, line: 40, size: 8, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !43, identifier: "_ZTSN11xercesc_2_77XMemoryE")
!42 = !DIFile(filename: "./xercesc/util/XMemory.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!43 = !{!44, !51, !57, !60, !63, !66, !69}
!44 = !DISubprogram(name: "operator new", linkageName: "_ZN11xercesc_2_77XMemorynwEm", scope: !41, file: !42, line: 54, type: !45, scopeLine: 54, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!45 = !DISubroutineType(types: !46)
!46 = !{!47, !48}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !49, line: 46, baseType: !50)
!49 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!50 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!51 = !DISubprogram(name: "operator new", linkageName: "_ZN11xercesc_2_77XMemorynwEmPNS_13MemoryManagerE", scope: !41, file: !42, line: 82, type: !52, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!52 = !DISubroutineType(types: !53)
!53 = !{!47, !48, !54}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DICompositeType(tag: DW_TAG_class_type, name: "MemoryManager", scope: !2, file: !56, line: 38, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_713MemoryManagerE")
!56 = !DIFile(filename: "./xercesc/framework/MemoryManager.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!57 = !DISubprogram(name: "operator new", linkageName: "_ZN11xercesc_2_77XMemorynwEmPv", scope: !41, file: !42, line: 90, type: !58, scopeLine: 90, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!58 = !DISubroutineType(types: !59)
!59 = !{!47, !48, !47}
!60 = !DISubprogram(name: "operator delete", linkageName: "_ZN11xercesc_2_77XMemorydlEPv", scope: !41, file: !42, line: 97, type: !61, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!61 = !DISubroutineType(types: !62)
!62 = !{null, !47}
!63 = !DISubprogram(name: "operator delete", linkageName: "_ZN11xercesc_2_77XMemorydlEPvPNS_13MemoryManagerE", scope: !41, file: !42, line: 107, type: !64, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!64 = !DISubroutineType(types: !65)
!65 = !{null, !47, !54}
!66 = !DISubprogram(name: "operator delete", linkageName: "_ZN11xercesc_2_77XMemorydlEPvS1_", scope: !41, file: !42, line: 115, type: !67, scopeLine: 115, flags: DIFlagPublic | DIFlagPrototyped | DIFlagStaticMember, spFlags: 0)
!67 = !DISubroutineType(types: !68)
!68 = !{null, !47, !47}
!69 = !DISubprogram(name: "XMemory", scope: !41, file: !42, line: 130, type: !70, scopeLine: 130, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!70 = !DISubroutineType(types: !71)
!71 = !{null, !72}
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "fMemoryManager", scope: !37, file: !38, line: 152, baseType: !54, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "fBucketList", scope: !37, file: !38, line: 153, baseType: !75, size: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ValueHashTableBucketElem<unsigned short>", scope: !2, file: !38, line: 48, size: 192, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !78, templateParams: !102, identifier: "_ZTSN11xercesc_2_724ValueHashTableBucketElemItEE")
!78 = !{!79, !81, !82, !83, !89, !92, !93, !98}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "fData", scope: !77, file: !38, line: 57, baseType: !80, size: 16)
!80 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "fNext", scope: !77, file: !38, line: 58, baseType: !76, size: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "fKey", scope: !77, file: !38, line: 59, baseType: !47, size: 64, offset: 128)
!83 = !DISubprogram(name: "ValueHashTableBucketElem", scope: !77, file: !38, line: 50, type: !84, scopeLine: 50, flags: DIFlagPrototyped, spFlags: 0)
!84 = !DISubroutineType(types: !85)
!85 = !{null, !86, !47, !87, !76}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!87 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !80)
!89 = !DISubprogram(name: "ValueHashTableBucketElem", scope: !77, file: !38, line: 54, type: !90, scopeLine: 54, flags: DIFlagPrototyped, spFlags: 0)
!90 = !DISubroutineType(types: !91)
!91 = !{null, !86}
!92 = !DISubprogram(name: "~ValueHashTableBucketElem", scope: !77, file: !38, line: 55, type: !90, scopeLine: 55, flags: DIFlagPrototyped, spFlags: 0)
!93 = !DISubprogram(name: "ValueHashTableBucketElem", scope: !77, file: !38, line: 65, type: !94, scopeLine: 65, flags: DIFlagPrivate | DIFlagPrototyped, spFlags: 0)
!94 = !DISubroutineType(types: !95)
!95 = !{null, !86, !96}
!96 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !77)
!98 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_724ValueHashTableBucketElemItEaSERKS1_", scope: !77, file: !38, line: 66, type: !99, scopeLine: 66, flags: DIFlagPrivate | DIFlagPrototyped, spFlags: 0)
!99 = !DISubroutineType(types: !100)
!100 = !{!101, !86, !96}
!101 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !77, size: 64)
!102 = !{!103}
!103 = !DITemplateTypeParameter(name: "TVal", type: !80)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "fHashModulus", scope: !37, file: !38, line: 154, baseType: !105, size: 32, offset: 128)
!105 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "fHash", scope: !37, file: !38, line: 155, baseType: !107, size: 64, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DICompositeType(tag: DW_TAG_class_type, name: "HashBase", scope: !2, file: !109, line: 32, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_78HashBaseE")
!109 = !DIFile(filename: "./xercesc/util/HashBase.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!110 = !DISubprogram(name: "ValueHashTableOf", scope: !37, file: !38, line: 77, type: !111, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!111 = !DISubroutineType(types: !112)
!112 = !{null, !113, !114, !115}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!114 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!116 = !DISubprogram(name: "ValueHashTableOf", scope: !37, file: !38, line: 85, type: !117, scopeLine: 85, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!117 = !DISubroutineType(types: !118)
!118 = !{null, !113, !114, !107, !115}
!119 = !DISubprogram(name: "~ValueHashTableOf", scope: !37, file: !38, line: 91, type: !120, scopeLine: 91, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!120 = !DISubroutineType(types: !121)
!121 = !{null, !113}
!122 = !DISubprogram(name: "isEmpty", linkageName: "_ZNK11xercesc_2_716ValueHashTableOfItE7isEmptyEv", scope: !37, file: !38, line: 97, type: !123, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!123 = !DISubroutineType(types: !124)
!124 = !{!125, !126}
!125 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!127 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!128 = !DISubprogram(name: "containsKey", linkageName: "_ZNK11xercesc_2_716ValueHashTableOfItE11containsKeyEPKv", scope: !37, file: !38, line: 98, type: !129, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!129 = !DISubroutineType(types: !130)
!130 = !{!125, !126, !131}
!131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!134 = !DISubprogram(name: "removeKey", linkageName: "_ZN11xercesc_2_716ValueHashTableOfItE9removeKeyEPKv", scope: !37, file: !38, line: 99, type: !135, scopeLine: 99, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!135 = !DISubroutineType(types: !136)
!136 = !{null, !113, !131}
!137 = !DISubprogram(name: "removeAll", linkageName: "_ZN11xercesc_2_716ValueHashTableOfItE9removeAllEv", scope: !37, file: !38, line: 100, type: !120, scopeLine: 100, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!138 = !DISubprogram(name: "get", linkageName: "_ZN11xercesc_2_716ValueHashTableOfItE3getEPKvPNS_13MemoryManagerE", scope: !37, file: !38, line: 106, type: !139, scopeLine: 106, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!139 = !DISubroutineType(types: !140)
!140 = !{!141, !113, !131, !115}
!141 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !80, size: 64)
!142 = !DISubprogram(name: "get", linkageName: "_ZNK11xercesc_2_716ValueHashTableOfItE3getEPKv", scope: !37, file: !38, line: 107, type: !143, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!143 = !DISubroutineType(types: !144)
!144 = !{!87, !126, !131}
!145 = !DISubprogram(name: "put", linkageName: "_ZN11xercesc_2_716ValueHashTableOfItE3putEPvRKt", scope: !37, file: !38, line: 113, type: !146, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!146 = !DISubroutineType(types: !147)
!147 = !{null, !113, !47, !87}
!148 = !DISubprogram(name: "ValueHashTableOf", scope: !37, file: !38, line: 126, type: !149, scopeLine: 126, flags: DIFlagPrototyped, spFlags: 0)
!149 = !DISubroutineType(types: !150)
!150 = !{null, !113, !151}
!151 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !127, size: 64)
!152 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_716ValueHashTableOfItEaSERKS1_", scope: !37, file: !38, line: 127, type: !153, scopeLine: 127, flags: DIFlagPrototyped, spFlags: 0)
!153 = !DISubroutineType(types: !154)
!154 = !{!155, !113, !151}
!155 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !37, size: 64)
!156 = !DISubprogram(name: "findBucketElem", linkageName: "_ZN11xercesc_2_716ValueHashTableOfItE14findBucketElemEPKvRj", scope: !37, file: !38, line: 132, type: !157, scopeLine: 132, flags: DIFlagPrototyped, spFlags: 0)
!157 = !DISubroutineType(types: !158)
!158 = !{!76, !113, !131, !159}
!159 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !105, size: 64)
!160 = !DISubprogram(name: "findBucketElem", linkageName: "_ZNK11xercesc_2_716ValueHashTableOfItE14findBucketElemEPKvRj", scope: !37, file: !38, line: 133, type: !161, scopeLine: 133, flags: DIFlagPrototyped, spFlags: 0)
!161 = !DISubroutineType(types: !162)
!162 = !{!163, !126, !131, !159}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!164 = !DISubprogram(name: "removeBucketElem", linkageName: "_ZN11xercesc_2_716ValueHashTableOfItE16removeBucketElemEPKvRj", scope: !37, file: !38, line: 134, type: !165, scopeLine: 134, flags: DIFlagPrototyped, spFlags: 0)
!165 = !DISubroutineType(types: !166)
!166 = !{null, !113, !131, !159}
!167 = !DISubprogram(name: "initialize", linkageName: "_ZN11xercesc_2_716ValueHashTableOfItE10initializeEj", scope: !37, file: !38, line: 135, type: !168, scopeLine: 135, flags: DIFlagPrototyped, spFlags: 0)
!168 = !DISubroutineType(types: !169)
!169 = !{null, !113, !114}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "fAttMap", scope: !172, file: !171, line: 245, baseType: !36, flags: DIFlagStaticMember)
!171 = !DIFile(filename: "./xercesc/validators/schema/GeneralAttributeCheck.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!172 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "GeneralAttributeCheck", scope: !2, file: !171, line: 46, size: 1152, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !173, identifier: "_ZTSN11xercesc_2_721GeneralAttributeCheckE")
!173 = !{!174, !170, !175, !176, !180, !181, !182, !187, !194, !195, !199, !202, !206, !209, !213, !220, !224, !2203, !2204, !2209, !2213, !2214, !2215, !2216}
!174 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !172, baseType: !41, flags: DIFlagPublic, extraData: i32 0)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "fFacetsMap", scope: !172, file: !171, line: 246, baseType: !36, flags: DIFlagStaticMember)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "fNonNegIntDV", scope: !172, file: !171, line: 247, baseType: !177, flags: DIFlagStaticMember)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DICompositeType(tag: DW_TAG_class_type, name: "DatatypeValidator", scope: !2, file: !179, line: 54, flags: DIFlagFwdDecl)
!179 = !DIFile(filename: "./xercesc/validators/datatype/DatatypeValidator.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!180 = !DIDerivedType(tag: DW_TAG_member, name: "fBooleanDV", scope: !172, file: !171, line: 248, baseType: !177, flags: DIFlagStaticMember)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "fAnyURIDV", scope: !172, file: !171, line: 249, baseType: !177, flags: DIFlagStaticMember)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "fgElemAttTable", scope: !172, file: !171, line: 250, baseType: !183, flags: DIFlagStaticMember)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 27200, elements: !184)
!184 = !{!185, !186}
!185 = !DISubrange(count: 50)
!186 = !DISubrange(count: 34)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "fAttNames", scope: !172, file: !171, line: 251, baseType: !188, flags: DIFlagStaticMember)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 2176, elements: !193)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMLCh", file: !192, line: 67, baseType: !80)
!192 = !DIFile(filename: "./xercesc/util/Compilers/GCCDefs.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!193 = !{!186}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "fMemoryManager", scope: !172, file: !171, line: 252, baseType: !54, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "fValidationContext", scope: !172, file: !171, line: 253, baseType: !196, size: 64, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DICompositeType(tag: DW_TAG_class_type, name: "ValidationContext", scope: !2, file: !198, line: 35, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_717ValidationContextE")
!198 = !DIFile(filename: "./xercesc/framework/ValidationContext.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!199 = !DIDerivedType(tag: DW_TAG_member, name: "fIDValidator", scope: !172, file: !171, line: 254, baseType: !200, size: 1024, offset: 128)
!200 = !DICompositeType(tag: DW_TAG_class_type, name: "IDDatatypeValidator", scope: !2, file: !201, line: 29, flags: DIFlagFwdDecl)
!201 = !DIFile(filename: "./xercesc/validators/datatype/IDDatatypeValidator.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!202 = !DISubprogram(name: "GeneralAttributeCheck", scope: !172, file: !171, line: 181, type: !203, scopeLine: 181, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!203 = !DISubroutineType(types: !204)
!204 = !{null, !205, !115}
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!206 = !DISubprogram(name: "~GeneralAttributeCheck", scope: !172, file: !171, line: 182, type: !207, scopeLine: 182, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!207 = !DISubroutineType(types: !208)
!208 = !{null, !205}
!209 = !DISubprogram(name: "getFacetId", linkageName: "_ZN11xercesc_2_721GeneralAttributeCheck10getFacetIdEPKtPNS_13MemoryManagerE", scope: !172, file: !171, line: 187, type: !210, scopeLine: 187, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!210 = !DISubroutineType(types: !211)
!211 = !{!80, !205, !212, !115}
!212 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !189)
!213 = !DISubprogram(name: "setIDRefList", linkageName: "_ZN11xercesc_2_721GeneralAttributeCheck12setIDRefListEPNS_14RefHashTableOfINS_10XMLRefInfoEEE", scope: !172, file: !171, line: 194, type: !214, scopeLine: 194, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!214 = !DISubroutineType(types: !215)
!215 = !{null, !205, !216}
!216 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DICompositeType(tag: DW_TAG_class_type, name: "RefHashTableOf<xercesc_2_7::XMLRefInfo>", scope: !2, file: !219, line: 72, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_714RefHashTableOfINS_10XMLRefInfoEEE")
!219 = !DIFile(filename: "./xercesc/util/RefHashTableOf.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!220 = !DISubprogram(name: "setValidationContext", linkageName: "_ZN11xercesc_2_721GeneralAttributeCheck20setValidationContextEPNS_17ValidationContextE", scope: !172, file: !171, line: 196, type: !221, scopeLine: 196, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!221 = !DISubroutineType(types: !222)
!222 = !{null, !205, !223}
!223 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !196)
!224 = !DISubprogram(name: "checkAttributes", linkageName: "_ZN11xercesc_2_721GeneralAttributeCheck15checkAttributesEPKNS_10DOMElementEtPNS_14TraverseSchemaEbPNS_13ValueVectorOfIPNS_7DOMNodeEEE", scope: !172, file: !171, line: 201, type: !225, scopeLine: 201, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!225 = !DISubroutineType(types: !226)
!226 = !{null, !205, !227, !88, !232, !326, !987}
!227 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !230)
!230 = !DICompositeType(tag: DW_TAG_class_type, name: "DOMElement", scope: !2, file: !231, line: 62, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_710DOMElementE")
!231 = !DIFile(filename: "./xercesc/dom/DOMElement.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!232 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !233)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "TraverseSchema", scope: !2, file: !235, line: 71, size: 4416, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !236, identifier: "_ZTSN11xercesc_2_714TraverseSchemaE")
!235 = !DIFile(filename: "./xercesc/validators/schema/TraverseSchema.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!236 = !{!237, !238, !239, !241, !242, !243, !244, !245, !246, !247, !251, !255, !259, !262, !266, !270, !271, !338, !341, !344, !347, !350, !353, !356, !359, !362, !835, !838, !841, !845, !908, !909, !910, !913, !914, !916, !917, !920, !923, !927, !928, !931, !934, !937, !940, !943, !946, !947, !948, !952, !953, !963, !966, !971, !975, !976, !977, !980, !983, !984, !988, !989, !990, !991, !995, !1002, !1005, !1008, !1011, !1014, !1015, !1018, !1024, !1027, !1030, !1884, !1887, !1888, !1891, !1894, !1897, !1903, !1907, !1908, !1911, !1918, !1924, !1927, !1930, !1933, !1934, !1935, !1936, !1937, !1938, !1939, !1942, !1945, !1948, !1951, !1954, !1957, !1960, !1963, !1966, !1967, !1970, !1974, !1977, !1981, !1984, !1987, !1990, !1993, !1994, !1997, !1998, !2001, !2004, !2005, !2017, !2020, !2025, !2028, !2031, !2034, !2037, !2040, !2041, !2042, !2045, !2048, !2051, !2052, !2055, !2111, !2114, !2115, !2119, !2122, !2125, !2126, !2129, !2132, !2136, !2139, !2143, !2144, !2151, !2152, !2155, !2158, !2164, !2167, !2170, !2171, !2174, !2177, !2180, !2183, !2186, !2189, !2190, !2196, !2199, !2202}
!237 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !234, baseType: !41, flags: DIFlagPublic, extraData: i32 0)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "fFullConstraintChecking", scope: !234, file: !235, line: 725, baseType: !125, size: 8)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "fTargetNSURI", scope: !234, file: !235, line: 726, baseType: !240, size: 32, offset: 32)
!240 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "fEmptyNamespaceURI", scope: !234, file: !235, line: 727, baseType: !240, size: 32, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "fCurrentScope", scope: !234, file: !235, line: 729, baseType: !105, size: 32, offset: 96)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "fScopeCount", scope: !234, file: !235, line: 733, baseType: !240, size: 32, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "fAnonXSTypeCount", scope: !234, file: !235, line: 734, baseType: !105, size: 32, offset: 160)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "fCircularCheckIndex", scope: !234, file: !235, line: 735, baseType: !105, size: 32, offset: 192)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "fTargetNSURIString", scope: !234, file: !235, line: 736, baseType: !189, size: 64, offset: 256)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "fDatatypeRegistry", scope: !234, file: !235, line: 737, baseType: !248, size: 64, offset: 320)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DICompositeType(tag: DW_TAG_class_type, name: "DatatypeValidatorFactory", scope: !2, file: !250, line: 63, flags: DIFlagFwdDecl)
!250 = !DIFile(filename: "./xercesc/validators/datatype/DatatypeValidatorFactory.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!251 = !DIDerivedType(tag: DW_TAG_member, name: "fGrammarResolver", scope: !234, file: !235, line: 738, baseType: !252, size: 64, offset: 384)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DICompositeType(tag: DW_TAG_class_type, name: "GrammarResolver", scope: !2, file: !254, line: 31, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_715GrammarResolverE")
!254 = !DIFile(filename: "./xercesc/framework/XMLContentModel.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!255 = !DIDerivedType(tag: DW_TAG_member, name: "fSchemaGrammar", scope: !234, file: !235, line: 739, baseType: !256, size: 64, offset: 448)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DICompositeType(tag: DW_TAG_class_type, name: "SchemaGrammar", scope: !2, file: !258, line: 64, flags: DIFlagFwdDecl)
!258 = !DIFile(filename: "./xercesc/validators/schema/SchemaGrammar.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!259 = !DIDerivedType(tag: DW_TAG_member, name: "fEntityHandler", scope: !234, file: !235, line: 740, baseType: !260, size: 64, offset: 512)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DICompositeType(tag: DW_TAG_class_type, name: "XMLEntityHandler", scope: !2, file: !235, line: 53, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_716XMLEntityHandlerE")
!262 = !DIDerivedType(tag: DW_TAG_member, name: "fErrorReporter", scope: !234, file: !235, line: 741, baseType: !263, size: 64, offset: 576)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DICompositeType(tag: DW_TAG_class_type, name: "XMLErrorReporter", scope: !2, file: !265, line: 42, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_716XMLErrorReporterE")
!265 = !DIFile(filename: "./xercesc/framework/XMLErrorReporter.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!266 = !DIDerivedType(tag: DW_TAG_member, name: "fURIStringPool", scope: !234, file: !235, line: 742, baseType: !267, size: 64, offset: 640)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DICompositeType(tag: DW_TAG_class_type, name: "XMLStringPool", scope: !2, file: !269, line: 43, flags: DIFlagFwdDecl)
!269 = !DIFile(filename: "./xercesc/util/StringPool.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!270 = !DIDerivedType(tag: DW_TAG_member, name: "fStringPool", scope: !234, file: !235, line: 743, baseType: !267, size: 64, offset: 704)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "fBuffer", scope: !234, file: !235, line: 744, baseType: !272, size: 320, offset: 768)
!272 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "XMLBuffer", scope: !2, file: !273, line: 51, size: 320, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !274, identifier: "_ZTSN11xercesc_2_79XMLBufferE")
!273 = !DIFile(filename: "./xercesc/framework/XMLBuffer.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!274 = !{!275, !276, !277, !278, !279, !280, !281, !284, !286, !290, !293, !296, !299, !302, !305, !306, !307, !312, !315, !316, !319, !322, !323, !327, !331, !335}
!275 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !272, baseType: !41, flags: DIFlagPublic, extraData: i32 0)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "fIndex", scope: !272, file: !273, line: 254, baseType: !105, size: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "fCapacity", scope: !272, file: !273, line: 255, baseType: !105, size: 32, offset: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "fFullSize", scope: !272, file: !273, line: 256, baseType: !105, size: 32, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "fUsed", scope: !272, file: !273, line: 257, baseType: !125, size: 8, offset: 96)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "fMemoryManager", scope: !272, file: !273, line: 258, baseType: !115, size: 64, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "fFullHandler", scope: !272, file: !273, line: 259, baseType: !282, size: 64, offset: 192)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DICompositeType(tag: DW_TAG_class_type, name: "XMLBufferFullHandler", scope: !2, file: !273, line: 270, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_720XMLBufferFullHandlerE")
!284 = !DIDerivedType(tag: DW_TAG_member, name: "fBuffer", scope: !272, file: !273, line: 260, baseType: !285, size: 64, offset: 256)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!286 = !DISubprogram(name: "XMLBuffer", scope: !272, file: !273, line: 60, type: !287, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!287 = !DISubroutineType(types: !288)
!288 = !{null, !289, !114, !115}
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!290 = !DISubprogram(name: "~XMLBuffer", scope: !272, file: !273, line: 81, type: !291, scopeLine: 81, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!291 = !DISubroutineType(types: !292)
!292 = !{null, !289}
!293 = !DISubprogram(name: "setFullHandler", linkageName: "_ZN11xercesc_2_79XMLBuffer14setFullHandlerEPNS_20XMLBufferFullHandlerEj", scope: !272, file: !273, line: 90, type: !294, scopeLine: 90, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!294 = !DISubroutineType(types: !295)
!295 = !{null, !289, !282, !114}
!296 = !DISubprogram(name: "append", linkageName: "_ZN11xercesc_2_79XMLBuffer6appendEt", scope: !272, file: !273, line: 119, type: !297, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!297 = !DISubroutineType(types: !298)
!298 = !{null, !289, !190}
!299 = !DISubprogram(name: "append", linkageName: "_ZN11xercesc_2_79XMLBuffer6appendEPKtj", scope: !272, file: !273, line: 127, type: !300, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!300 = !DISubroutineType(types: !301)
!301 = !{null, !289, !212, !114}
!302 = !DISubprogram(name: "append", linkageName: "_ZN11xercesc_2_79XMLBuffer6appendEPKt", scope: !272, file: !273, line: 141, type: !303, scopeLine: 141, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!303 = !DISubroutineType(types: !304)
!304 = !{null, !289, !212}
!305 = !DISubprogram(name: "set", linkageName: "_ZN11xercesc_2_79XMLBuffer3setEPKtj", scope: !272, file: !273, line: 156, type: !300, scopeLine: 156, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!306 = !DISubprogram(name: "set", linkageName: "_ZN11xercesc_2_79XMLBuffer3setEPKt", scope: !272, file: !273, line: 162, type: !303, scopeLine: 162, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!307 = !DISubprogram(name: "getRawBuffer", linkageName: "_ZNK11xercesc_2_79XMLBuffer12getRawBufferEv", scope: !272, file: !273, line: 168, type: !308, scopeLine: 168, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!308 = !DISubroutineType(types: !309)
!309 = !{!189, !310}
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!311 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !272)
!312 = !DISubprogram(name: "getRawBuffer", linkageName: "_ZN11xercesc_2_79XMLBuffer12getRawBufferEv", scope: !272, file: !273, line: 174, type: !313, scopeLine: 174, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!313 = !DISubroutineType(types: !314)
!314 = !{!285, !289}
!315 = !DISubprogram(name: "reset", linkageName: "_ZN11xercesc_2_79XMLBuffer5resetEv", scope: !272, file: !273, line: 180, type: !291, scopeLine: 180, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!316 = !DISubprogram(name: "getInUse", linkageName: "_ZNK11xercesc_2_79XMLBuffer8getInUseEv", scope: !272, file: !273, line: 189, type: !317, scopeLine: 189, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!317 = !DISubroutineType(types: !318)
!318 = !{!125, !310}
!319 = !DISubprogram(name: "getLen", linkageName: "_ZNK11xercesc_2_79XMLBuffer6getLenEv", scope: !272, file: !273, line: 194, type: !320, scopeLine: 194, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!320 = !DISubroutineType(types: !321)
!321 = !{!105, !310}
!322 = !DISubprogram(name: "isEmpty", linkageName: "_ZNK11xercesc_2_79XMLBuffer7isEmptyEv", scope: !272, file: !273, line: 199, type: !317, scopeLine: 199, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!323 = !DISubprogram(name: "setInUse", linkageName: "_ZN11xercesc_2_79XMLBuffer8setInUseEb", scope: !272, file: !273, line: 207, type: !324, scopeLine: 207, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!324 = !DISubroutineType(types: !325)
!325 = !{null, !289, !326}
!326 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!327 = !DISubprogram(name: "XMLBuffer", scope: !272, file: !273, line: 216, type: !328, scopeLine: 216, flags: DIFlagPrototyped, spFlags: 0)
!328 = !DISubroutineType(types: !329)
!329 = !{null, !289, !330}
!330 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !311, size: 64)
!331 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_79XMLBufferaSERKS0_", scope: !272, file: !273, line: 217, type: !332, scopeLine: 217, flags: DIFlagPrototyped, spFlags: 0)
!332 = !DISubroutineType(types: !333)
!333 = !{!334, !289, !330}
!334 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !272, size: 64)
!335 = !DISubprogram(name: "insureCapacity", linkageName: "_ZN11xercesc_2_79XMLBuffer14insureCapacityEj", scope: !272, file: !273, line: 227, type: !336, scopeLine: 227, flags: DIFlagPrototyped, spFlags: 0)
!336 = !DISubroutineType(types: !337)
!337 = !{null, !289, !114}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "fScanner", scope: !234, file: !235, line: 745, baseType: !339, size: 64, offset: 1088)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DICompositeType(tag: DW_TAG_class_type, name: "XMLScanner", scope: !2, file: !235, line: 54, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_710XMLScannerE")
!341 = !DIDerivedType(tag: DW_TAG_member, name: "fNamespaceScope", scope: !234, file: !235, line: 746, baseType: !342, size: 64, offset: 1152)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DICompositeType(tag: DW_TAG_class_type, name: "NamespaceScope", scope: !2, file: !258, line: 53, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_714NamespaceScopeE")
!344 = !DIDerivedType(tag: DW_TAG_member, name: "fAttributeDeclRegistry", scope: !234, file: !235, line: 747, baseType: !345, size: 64, offset: 1216)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DICompositeType(tag: DW_TAG_class_type, name: "RefHashTableOf<xercesc_2_7::XMLAttDef>", scope: !2, file: !219, line: 72, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_714RefHashTableOfINS_9XMLAttDefEEE")
!347 = !DIDerivedType(tag: DW_TAG_member, name: "fComplexTypeRegistry", scope: !234, file: !235, line: 748, baseType: !348, size: 64, offset: 1280)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DICompositeType(tag: DW_TAG_class_type, name: "RefHashTableOf<xercesc_2_7::ComplexTypeInfo>", scope: !2, file: !219, line: 72, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_714RefHashTableOfINS_15ComplexTypeInfoEEE")
!350 = !DIDerivedType(tag: DW_TAG_member, name: "fGroupRegistry", scope: !234, file: !235, line: 749, baseType: !351, size: 64, offset: 1344)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DICompositeType(tag: DW_TAG_class_type, name: "RefHashTableOf<xercesc_2_7::XercesGroupInfo>", scope: !2, file: !219, line: 72, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_714RefHashTableOfINS_15XercesGroupInfoEEE")
!353 = !DIDerivedType(tag: DW_TAG_member, name: "fAttGroupRegistry", scope: !234, file: !235, line: 750, baseType: !354, size: 64, offset: 1408)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DICompositeType(tag: DW_TAG_class_type, name: "RefHashTableOf<xercesc_2_7::XercesAttGroupInfo>", scope: !2, file: !219, line: 72, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_714RefHashTableOfINS_18XercesAttGroupInfoEEE")
!356 = !DIDerivedType(tag: DW_TAG_member, name: "fIC_ElementsNS", scope: !234, file: !235, line: 751, baseType: !357, size: 64, offset: 1472)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DICompositeType(tag: DW_TAG_class_type, name: "RefHashTableOf<xercesc_2_7::ValueVectorOf<xercesc_2_7::SchemaElementDecl *> >", scope: !2, file: !219, line: 72, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_714RefHashTableOfINS_13ValueVectorOfIPNS_17SchemaElementDeclEEEEE")
!359 = !DIDerivedType(tag: DW_TAG_member, name: "fPreprocessedNodes", scope: !234, file: !235, line: 752, baseType: !360, size: 64, offset: 1536)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DICompositeType(tag: DW_TAG_class_type, name: "RefHashTableOf<xercesc_2_7::SchemaInfo>", scope: !2, file: !219, line: 72, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_714RefHashTableOfINS_10SchemaInfoEEE")
!362 = !DIDerivedType(tag: DW_TAG_member, name: "fSchemaInfo", scope: !234, file: !235, line: 753, baseType: !363, size: 64, offset: 1600)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "SchemaInfo", scope: !2, file: !365, line: 52, size: 1472, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !366, identifier: "_ZTSN11xercesc_2_710SchemaInfoE")
!365 = !DIFile(filename: "./xercesc/validators/schema/SchemaInfo.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!366 = !{!367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !383, !384, !385, !450, !515, !516, !582, !651, !719, !720, !721, !726, !729, !734, !737, !740, !743, !746, !747, !748, !749, !752, !755, !760, !763, !766, !769, !772, !775, !778, !779, !780, !783, !792, !797, !800, !803, !807, !810, !813, !816, !819, !822, !823, !826, !830, !834}
!367 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !364, baseType: !41, flags: DIFlagPublic, extraData: i32 0)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "fAdoptInclude", scope: !364, file: !365, line: 154, baseType: !125, size: 8)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "fProcessed", scope: !364, file: !365, line: 155, baseType: !125, size: 8, offset: 8)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "fElemAttrDefaultQualified", scope: !364, file: !365, line: 156, baseType: !80, size: 16, offset: 16)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "fBlockDefault", scope: !364, file: !365, line: 157, baseType: !240, size: 32, offset: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "fFinalDefault", scope: !364, file: !365, line: 158, baseType: !240, size: 32, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "fTargetNSURI", scope: !364, file: !365, line: 159, baseType: !240, size: 32, offset: 96)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "fScopeCount", scope: !364, file: !365, line: 160, baseType: !240, size: 32, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "fNamespaceScopeLevel", scope: !364, file: !365, line: 161, baseType: !105, size: 32, offset: 160)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "fCurrentSchemaURL", scope: !364, file: !365, line: 162, baseType: !285, size: 64, offset: 192)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "fTargetNSURIString", scope: !364, file: !365, line: 163, baseType: !189, size: 64, offset: 256)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "fSchemaRootElement", scope: !364, file: !365, line: 164, baseType: !228, size: 64, offset: 320)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "fIncludeInfoList", scope: !364, file: !365, line: 165, baseType: !380, size: 64, offset: 384)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DICompositeType(tag: DW_TAG_class_type, name: "RefVectorOf<xercesc_2_7::SchemaInfo>", scope: !2, file: !382, line: 32, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_711RefVectorOfINS_10SchemaInfoEEE")
!382 = !DIFile(filename: "./xercesc/util/RefVectorOf.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!383 = !DIDerivedType(tag: DW_TAG_member, name: "fImportedInfoList", scope: !364, file: !365, line: 166, baseType: !380, size: 64, offset: 448)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "fImportingInfoList", scope: !364, file: !365, line: 167, baseType: !380, size: 64, offset: 512)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "fFailedRedefineList", scope: !364, file: !365, line: 168, baseType: !386, size: 64, offset: 576)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "ValueVectorOf<const xercesc_2_7::DOMElement *>", scope: !2, file: !388, line: 32, size: 256, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !389, templateParams: !448, identifier: "_ZTSN11xercesc_2_713ValueVectorOfIPKNS_10DOMElementEEE")
!388 = !DIFile(filename: "./xercesc/util/ValueVectorOf.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!389 = !{!390, !391, !392, !393, !394, !396, !397, !401, !406, !409, !413, !417, !420, !421, !424, !425, !428, !432, !436, !439, !440, !443, !444}
!390 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !387, baseType: !41, flags: DIFlagPublic, extraData: i32 0)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "fCallDestructor", scope: !387, file: !388, line: 97, baseType: !125, size: 8)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "fCurCount", scope: !387, file: !388, line: 98, baseType: !105, size: 32, offset: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "fMaxCount", scope: !387, file: !388, line: 99, baseType: !105, size: 32, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "fElemList", scope: !387, file: !388, line: 100, baseType: !395, size: 64, offset: 128)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "fMemoryManager", scope: !387, file: !388, line: 101, baseType: !54, size: 64, offset: 192)
!397 = !DISubprogram(name: "ValueVectorOf", scope: !387, file: !388, line: 38, type: !398, scopeLine: 38, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!398 = !DISubroutineType(types: !399)
!399 = !{null, !400, !114, !115, !326}
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!401 = !DISubprogram(name: "ValueVectorOf", scope: !387, file: !388, line: 44, type: !402, scopeLine: 44, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!402 = !DISubroutineType(types: !403)
!403 = !{null, !400, !404}
!404 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !405, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !387)
!406 = !DISubprogram(name: "~ValueVectorOf", scope: !387, file: !388, line: 45, type: !407, scopeLine: 45, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!407 = !DISubroutineType(types: !408)
!408 = !{null, !400}
!409 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPKNS_10DOMElementEEaSERKS4_", scope: !387, file: !388, line: 51, type: !410, scopeLine: 51, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!410 = !DISubroutineType(types: !411)
!411 = !{!412, !400, !404}
!412 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !387, size: 64)
!413 = !DISubprogram(name: "addElement", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPKNS_10DOMElementEE10addElementERKS3_", scope: !387, file: !388, line: 57, type: !414, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!414 = !DISubroutineType(types: !415)
!415 = !{null, !400, !416}
!416 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !227, size: 64)
!417 = !DISubprogram(name: "setElementAt", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPKNS_10DOMElementEE12setElementAtERKS3_j", scope: !387, file: !388, line: 58, type: !418, scopeLine: 58, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!418 = !DISubroutineType(types: !419)
!419 = !{null, !400, !416, !114}
!420 = !DISubprogram(name: "insertElementAt", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPKNS_10DOMElementEE15insertElementAtERKS3_j", scope: !387, file: !388, line: 59, type: !418, scopeLine: 59, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!421 = !DISubprogram(name: "removeElementAt", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPKNS_10DOMElementEE15removeElementAtEj", scope: !387, file: !388, line: 60, type: !422, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!422 = !DISubroutineType(types: !423)
!423 = !{null, !400, !114}
!424 = !DISubprogram(name: "removeAllElements", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPKNS_10DOMElementEE17removeAllElementsEv", scope: !387, file: !388, line: 61, type: !407, scopeLine: 61, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!425 = !DISubprogram(name: "containsElement", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPKNS_10DOMElementEE15containsElementERKS3_j", scope: !387, file: !388, line: 62, type: !426, scopeLine: 62, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!426 = !DISubroutineType(types: !427)
!427 = !{!125, !400, !416, !114}
!428 = !DISubprogram(name: "elementAt", linkageName: "_ZNK11xercesc_2_713ValueVectorOfIPKNS_10DOMElementEE9elementAtEj", scope: !387, file: !388, line: 68, type: !429, scopeLine: 68, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!429 = !DISubroutineType(types: !430)
!430 = !{!416, !431, !114}
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!432 = !DISubprogram(name: "elementAt", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPKNS_10DOMElementEE9elementAtEj", scope: !387, file: !388, line: 69, type: !433, scopeLine: 69, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!433 = !DISubroutineType(types: !434)
!434 = !{!435, !400, !114}
!435 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !228, size: 64)
!436 = !DISubprogram(name: "curCapacity", linkageName: "_ZNK11xercesc_2_713ValueVectorOfIPKNS_10DOMElementEE11curCapacityEv", scope: !387, file: !388, line: 70, type: !437, scopeLine: 70, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!437 = !DISubroutineType(types: !438)
!438 = !{!105, !431}
!439 = !DISubprogram(name: "size", linkageName: "_ZNK11xercesc_2_713ValueVectorOfIPKNS_10DOMElementEE4sizeEv", scope: !387, file: !388, line: 71, type: !437, scopeLine: 71, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!440 = !DISubprogram(name: "getMemoryManager", linkageName: "_ZNK11xercesc_2_713ValueVectorOfIPKNS_10DOMElementEE16getMemoryManagerEv", scope: !387, file: !388, line: 72, type: !441, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!441 = !DISubroutineType(types: !442)
!442 = !{!54, !431}
!443 = !DISubprogram(name: "ensureExtraCapacity", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPKNS_10DOMElementEE19ensureExtraCapacityEj", scope: !387, file: !388, line: 78, type: !422, scopeLine: 78, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!444 = !DISubprogram(name: "rawData", linkageName: "_ZNK11xercesc_2_713ValueVectorOfIPKNS_10DOMElementEE7rawDataEv", scope: !387, file: !388, line: 79, type: !445, scopeLine: 79, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!445 = !DISubroutineType(types: !446)
!446 = !{!447, !431}
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!448 = !{!449}
!449 = !DITemplateTypeParameter(name: "TElem", type: !228)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "fImportedNSList", scope: !364, file: !365, line: 169, baseType: !451, size: 64, offset: 640)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "ValueVectorOf<int>", scope: !2, file: !388, line: 32, size: 256, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !453, templateParams: !513, identifier: "_ZTSN11xercesc_2_713ValueVectorOfIiEE")
!453 = !{!454, !455, !456, !457, !458, !460, !461, !465, !470, !473, !477, !482, !485, !486, !489, !490, !493, !497, !501, !504, !505, !508, !509}
!454 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !452, baseType: !41, flags: DIFlagPublic, extraData: i32 0)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "fCallDestructor", scope: !452, file: !388, line: 97, baseType: !125, size: 8)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "fCurCount", scope: !452, file: !388, line: 98, baseType: !105, size: 32, offset: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "fMaxCount", scope: !452, file: !388, line: 99, baseType: !105, size: 32, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "fElemList", scope: !452, file: !388, line: 100, baseType: !459, size: 64, offset: 128)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "fMemoryManager", scope: !452, file: !388, line: 101, baseType: !54, size: 64, offset: 192)
!461 = !DISubprogram(name: "ValueVectorOf", scope: !452, file: !388, line: 38, type: !462, scopeLine: 38, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!462 = !DISubroutineType(types: !463)
!463 = !{null, !464, !114, !115, !326}
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!465 = !DISubprogram(name: "ValueVectorOf", scope: !452, file: !388, line: 44, type: !466, scopeLine: 44, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!466 = !DISubroutineType(types: !467)
!467 = !{null, !464, !468}
!468 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !469, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !452)
!470 = !DISubprogram(name: "~ValueVectorOf", scope: !452, file: !388, line: 45, type: !471, scopeLine: 45, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!471 = !DISubroutineType(types: !472)
!472 = !{null, !464}
!473 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_713ValueVectorOfIiEaSERKS1_", scope: !452, file: !388, line: 51, type: !474, scopeLine: 51, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!474 = !DISubroutineType(types: !475)
!475 = !{!476, !464, !468}
!476 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !452, size: 64)
!477 = !DISubprogram(name: "addElement", linkageName: "_ZN11xercesc_2_713ValueVectorOfIiE10addElementERKi", scope: !452, file: !388, line: 57, type: !478, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!478 = !DISubroutineType(types: !479)
!479 = !{null, !464, !480}
!480 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !481, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !240)
!482 = !DISubprogram(name: "setElementAt", linkageName: "_ZN11xercesc_2_713ValueVectorOfIiE12setElementAtERKij", scope: !452, file: !388, line: 58, type: !483, scopeLine: 58, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!483 = !DISubroutineType(types: !484)
!484 = !{null, !464, !480, !114}
!485 = !DISubprogram(name: "insertElementAt", linkageName: "_ZN11xercesc_2_713ValueVectorOfIiE15insertElementAtERKij", scope: !452, file: !388, line: 59, type: !483, scopeLine: 59, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!486 = !DISubprogram(name: "removeElementAt", linkageName: "_ZN11xercesc_2_713ValueVectorOfIiE15removeElementAtEj", scope: !452, file: !388, line: 60, type: !487, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!487 = !DISubroutineType(types: !488)
!488 = !{null, !464, !114}
!489 = !DISubprogram(name: "removeAllElements", linkageName: "_ZN11xercesc_2_713ValueVectorOfIiE17removeAllElementsEv", scope: !452, file: !388, line: 61, type: !471, scopeLine: 61, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!490 = !DISubprogram(name: "containsElement", linkageName: "_ZN11xercesc_2_713ValueVectorOfIiE15containsElementERKij", scope: !452, file: !388, line: 62, type: !491, scopeLine: 62, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!491 = !DISubroutineType(types: !492)
!492 = !{!125, !464, !480, !114}
!493 = !DISubprogram(name: "elementAt", linkageName: "_ZNK11xercesc_2_713ValueVectorOfIiE9elementAtEj", scope: !452, file: !388, line: 68, type: !494, scopeLine: 68, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!494 = !DISubroutineType(types: !495)
!495 = !{!480, !496, !114}
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!497 = !DISubprogram(name: "elementAt", linkageName: "_ZN11xercesc_2_713ValueVectorOfIiE9elementAtEj", scope: !452, file: !388, line: 69, type: !498, scopeLine: 69, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!498 = !DISubroutineType(types: !499)
!499 = !{!500, !464, !114}
!500 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !240, size: 64)
!501 = !DISubprogram(name: "curCapacity", linkageName: "_ZNK11xercesc_2_713ValueVectorOfIiE11curCapacityEv", scope: !452, file: !388, line: 70, type: !502, scopeLine: 70, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!502 = !DISubroutineType(types: !503)
!503 = !{!105, !496}
!504 = !DISubprogram(name: "size", linkageName: "_ZNK11xercesc_2_713ValueVectorOfIiE4sizeEv", scope: !452, file: !388, line: 71, type: !502, scopeLine: 71, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!505 = !DISubprogram(name: "getMemoryManager", linkageName: "_ZNK11xercesc_2_713ValueVectorOfIiE16getMemoryManagerEv", scope: !452, file: !388, line: 72, type: !506, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!506 = !DISubroutineType(types: !507)
!507 = !{!54, !496}
!508 = !DISubprogram(name: "ensureExtraCapacity", linkageName: "_ZN11xercesc_2_713ValueVectorOfIiE19ensureExtraCapacityEj", scope: !452, file: !388, line: 78, type: !487, scopeLine: 78, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!509 = !DISubprogram(name: "rawData", linkageName: "_ZNK11xercesc_2_713ValueVectorOfIiE7rawDataEv", scope: !452, file: !388, line: 79, type: !510, scopeLine: 79, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!510 = !DISubroutineType(types: !511)
!511 = !{!512, !496}
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!513 = !{!514}
!514 = !DITemplateTypeParameter(name: "TElem", type: !240)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "fRecursingAnonTypes", scope: !364, file: !365, line: 170, baseType: !386, size: 64, offset: 704)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "fRecursingTypeNames", scope: !364, file: !365, line: 171, baseType: !517, size: 64, offset: 768)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "ValueVectorOf<const unsigned short *>", scope: !2, file: !388, line: 32, size: 256, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !519, templateParams: !580, identifier: "_ZTSN11xercesc_2_713ValueVectorOfIPKtEE")
!519 = !{!520, !521, !522, !523, !524, !527, !528, !532, !537, !540, !544, !549, !552, !553, !556, !557, !560, !564, !568, !571, !572, !575, !576}
!520 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !518, baseType: !41, flags: DIFlagPublic, extraData: i32 0)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "fCallDestructor", scope: !518, file: !388, line: 97, baseType: !125, size: 8)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "fCurCount", scope: !518, file: !388, line: 98, baseType: !105, size: 32, offset: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "fMaxCount", scope: !518, file: !388, line: 99, baseType: !105, size: 32, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "fElemList", scope: !518, file: !388, line: 100, baseType: !525, size: 64, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "fMemoryManager", scope: !518, file: !388, line: 101, baseType: !54, size: 64, offset: 192)
!528 = !DISubprogram(name: "ValueVectorOf", scope: !518, file: !388, line: 38, type: !529, scopeLine: 38, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!529 = !DISubroutineType(types: !530)
!530 = !{null, !531, !114, !115, !326}
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!532 = !DISubprogram(name: "ValueVectorOf", scope: !518, file: !388, line: 44, type: !533, scopeLine: 44, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!533 = !DISubroutineType(types: !534)
!534 = !{null, !531, !535}
!535 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !518)
!537 = !DISubprogram(name: "~ValueVectorOf", scope: !518, file: !388, line: 45, type: !538, scopeLine: 45, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!538 = !DISubroutineType(types: !539)
!539 = !{null, !531}
!540 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPKtEaSERKS3_", scope: !518, file: !388, line: 51, type: !541, scopeLine: 51, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!541 = !DISubroutineType(types: !542)
!542 = !{!543, !531, !535}
!543 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !518, size: 64)
!544 = !DISubprogram(name: "addElement", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPKtE10addElementERKS2_", scope: !518, file: !388, line: 57, type: !545, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!545 = !DISubroutineType(types: !546)
!546 = !{null, !531, !547}
!547 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !526)
!549 = !DISubprogram(name: "setElementAt", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPKtE12setElementAtERKS2_j", scope: !518, file: !388, line: 58, type: !550, scopeLine: 58, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!550 = !DISubroutineType(types: !551)
!551 = !{null, !531, !547, !114}
!552 = !DISubprogram(name: "insertElementAt", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPKtE15insertElementAtERKS2_j", scope: !518, file: !388, line: 59, type: !550, scopeLine: 59, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!553 = !DISubprogram(name: "removeElementAt", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPKtE15removeElementAtEj", scope: !518, file: !388, line: 60, type: !554, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!554 = !DISubroutineType(types: !555)
!555 = !{null, !531, !114}
!556 = !DISubprogram(name: "removeAllElements", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPKtE17removeAllElementsEv", scope: !518, file: !388, line: 61, type: !538, scopeLine: 61, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!557 = !DISubprogram(name: "containsElement", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPKtE15containsElementERKS2_j", scope: !518, file: !388, line: 62, type: !558, scopeLine: 62, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!558 = !DISubroutineType(types: !559)
!559 = !{!125, !531, !547, !114}
!560 = !DISubprogram(name: "elementAt", linkageName: "_ZNK11xercesc_2_713ValueVectorOfIPKtE9elementAtEj", scope: !518, file: !388, line: 68, type: !561, scopeLine: 68, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!561 = !DISubroutineType(types: !562)
!562 = !{!547, !563, !114}
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!564 = !DISubprogram(name: "elementAt", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPKtE9elementAtEj", scope: !518, file: !388, line: 69, type: !565, scopeLine: 69, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!565 = !DISubroutineType(types: !566)
!566 = !{!567, !531, !114}
!567 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !526, size: 64)
!568 = !DISubprogram(name: "curCapacity", linkageName: "_ZNK11xercesc_2_713ValueVectorOfIPKtE11curCapacityEv", scope: !518, file: !388, line: 70, type: !569, scopeLine: 70, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!569 = !DISubroutineType(types: !570)
!570 = !{!105, !563}
!571 = !DISubprogram(name: "size", linkageName: "_ZNK11xercesc_2_713ValueVectorOfIPKtE4sizeEv", scope: !518, file: !388, line: 71, type: !569, scopeLine: 71, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!572 = !DISubprogram(name: "getMemoryManager", linkageName: "_ZNK11xercesc_2_713ValueVectorOfIPKtE16getMemoryManagerEv", scope: !518, file: !388, line: 72, type: !573, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!573 = !DISubroutineType(types: !574)
!574 = !{!54, !563}
!575 = !DISubprogram(name: "ensureExtraCapacity", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPKtE19ensureExtraCapacityEj", scope: !518, file: !388, line: 78, type: !554, scopeLine: 78, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!576 = !DISubprogram(name: "rawData", linkageName: "_ZNK11xercesc_2_713ValueVectorOfIPKtE7rawDataEv", scope: !518, file: !388, line: 79, type: !577, scopeLine: 79, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!577 = !DISubroutineType(types: !578)
!578 = !{!579, !563}
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!580 = !{!581}
!581 = !DITemplateTypeParameter(name: "TElem", type: !526)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "fTopLevelComponents", scope: !364, file: !365, line: 172, baseType: !583, size: 448, offset: 832)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !584, size: 448, elements: !649)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "ValueVectorOf<xercesc_2_7::DOMElement *>", scope: !2, file: !388, line: 32, size: 256, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !586, templateParams: !647, identifier: "_ZTSN11xercesc_2_713ValueVectorOfIPNS_10DOMElementEEE")
!586 = !{!587, !588, !589, !590, !591, !594, !595, !599, !604, !607, !611, !616, !619, !620, !623, !624, !627, !631, !635, !638, !639, !642, !643}
!587 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !585, baseType: !41, flags: DIFlagPublic, extraData: i32 0)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "fCallDestructor", scope: !585, file: !388, line: 97, baseType: !125, size: 8)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "fCurCount", scope: !585, file: !388, line: 98, baseType: !105, size: 32, offset: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "fMaxCount", scope: !585, file: !388, line: 99, baseType: !105, size: 32, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "fElemList", scope: !585, file: !388, line: 100, baseType: !592, size: 64, offset: 128)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "fMemoryManager", scope: !585, file: !388, line: 101, baseType: !54, size: 64, offset: 192)
!595 = !DISubprogram(name: "ValueVectorOf", scope: !585, file: !388, line: 38, type: !596, scopeLine: 38, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!596 = !DISubroutineType(types: !597)
!597 = !{null, !598, !114, !115, !326}
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!599 = !DISubprogram(name: "ValueVectorOf", scope: !585, file: !388, line: 44, type: !600, scopeLine: 44, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!600 = !DISubroutineType(types: !601)
!601 = !{null, !598, !602}
!602 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !603, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !585)
!604 = !DISubprogram(name: "~ValueVectorOf", scope: !585, file: !388, line: 45, type: !605, scopeLine: 45, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!605 = !DISubroutineType(types: !606)
!606 = !{null, !598}
!607 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPNS_10DOMElementEEaSERKS3_", scope: !585, file: !388, line: 51, type: !608, scopeLine: 51, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!608 = !DISubroutineType(types: !609)
!609 = !{!610, !598, !602}
!610 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !585, size: 64)
!611 = !DISubprogram(name: "addElement", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPNS_10DOMElementEE10addElementERKS2_", scope: !585, file: !388, line: 57, type: !612, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!612 = !DISubroutineType(types: !613)
!613 = !{null, !598, !614}
!614 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !615, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !593)
!616 = !DISubprogram(name: "setElementAt", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPNS_10DOMElementEE12setElementAtERKS2_j", scope: !585, file: !388, line: 58, type: !617, scopeLine: 58, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!617 = !DISubroutineType(types: !618)
!618 = !{null, !598, !614, !114}
!619 = !DISubprogram(name: "insertElementAt", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPNS_10DOMElementEE15insertElementAtERKS2_j", scope: !585, file: !388, line: 59, type: !617, scopeLine: 59, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!620 = !DISubprogram(name: "removeElementAt", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPNS_10DOMElementEE15removeElementAtEj", scope: !585, file: !388, line: 60, type: !621, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!621 = !DISubroutineType(types: !622)
!622 = !{null, !598, !114}
!623 = !DISubprogram(name: "removeAllElements", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPNS_10DOMElementEE17removeAllElementsEv", scope: !585, file: !388, line: 61, type: !605, scopeLine: 61, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!624 = !DISubprogram(name: "containsElement", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPNS_10DOMElementEE15containsElementERKS2_j", scope: !585, file: !388, line: 62, type: !625, scopeLine: 62, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!625 = !DISubroutineType(types: !626)
!626 = !{!125, !598, !614, !114}
!627 = !DISubprogram(name: "elementAt", linkageName: "_ZNK11xercesc_2_713ValueVectorOfIPNS_10DOMElementEE9elementAtEj", scope: !585, file: !388, line: 68, type: !628, scopeLine: 68, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!628 = !DISubroutineType(types: !629)
!629 = !{!614, !630, !114}
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!631 = !DISubprogram(name: "elementAt", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPNS_10DOMElementEE9elementAtEj", scope: !585, file: !388, line: 69, type: !632, scopeLine: 69, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!632 = !DISubroutineType(types: !633)
!633 = !{!634, !598, !114}
!634 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !593, size: 64)
!635 = !DISubprogram(name: "curCapacity", linkageName: "_ZNK11xercesc_2_713ValueVectorOfIPNS_10DOMElementEE11curCapacityEv", scope: !585, file: !388, line: 70, type: !636, scopeLine: 70, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!636 = !DISubroutineType(types: !637)
!637 = !{!105, !630}
!638 = !DISubprogram(name: "size", linkageName: "_ZNK11xercesc_2_713ValueVectorOfIPNS_10DOMElementEE4sizeEv", scope: !585, file: !388, line: 71, type: !636, scopeLine: 71, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!639 = !DISubprogram(name: "getMemoryManager", linkageName: "_ZNK11xercesc_2_713ValueVectorOfIPNS_10DOMElementEE16getMemoryManagerEv", scope: !585, file: !388, line: 72, type: !640, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!640 = !DISubroutineType(types: !641)
!641 = !{!54, !630}
!642 = !DISubprogram(name: "ensureExtraCapacity", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPNS_10DOMElementEE19ensureExtraCapacityEj", scope: !585, file: !388, line: 78, type: !621, scopeLine: 78, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!643 = !DISubprogram(name: "rawData", linkageName: "_ZNK11xercesc_2_713ValueVectorOfIPNS_10DOMElementEE7rawDataEv", scope: !585, file: !388, line: 79, type: !644, scopeLine: 79, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!644 = !DISubroutineType(types: !645)
!645 = !{!646, !630}
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!647 = !{!648}
!648 = !DITemplateTypeParameter(name: "TElem", type: !593)
!649 = !{!650}
!650 = !DISubrange(count: 7)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "fNonXSAttList", scope: !364, file: !365, line: 173, baseType: !652, size: 64, offset: 1280)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "ValueVectorOf<xercesc_2_7::DOMNode *>", scope: !2, file: !388, line: 32, size: 256, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !654, templateParams: !717, identifier: "_ZTSN11xercesc_2_713ValueVectorOfIPNS_7DOMNodeEEE")
!654 = !{!655, !656, !657, !658, !659, !664, !665, !669, !674, !677, !681, !686, !689, !690, !693, !694, !697, !701, !705, !708, !709, !712, !713}
!655 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !653, baseType: !41, flags: DIFlagPublic, extraData: i32 0)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "fCallDestructor", scope: !653, file: !388, line: 97, baseType: !125, size: 8)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "fCurCount", scope: !653, file: !388, line: 98, baseType: !105, size: 32, offset: 32)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "fMaxCount", scope: !653, file: !388, line: 99, baseType: !105, size: 32, offset: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "fElemList", scope: !653, file: !388, line: 100, baseType: !660, size: 64, offset: 128)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DICompositeType(tag: DW_TAG_class_type, name: "DOMNode", scope: !2, file: !663, line: 138, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_77DOMNodeE")
!663 = !DIFile(filename: "./xercesc/dom/DOMNode.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!664 = !DIDerivedType(tag: DW_TAG_member, name: "fMemoryManager", scope: !653, file: !388, line: 101, baseType: !54, size: 64, offset: 192)
!665 = !DISubprogram(name: "ValueVectorOf", scope: !653, file: !388, line: 38, type: !666, scopeLine: 38, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!666 = !DISubroutineType(types: !667)
!667 = !{null, !668, !114, !115, !326}
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!669 = !DISubprogram(name: "ValueVectorOf", scope: !653, file: !388, line: 44, type: !670, scopeLine: 44, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!670 = !DISubroutineType(types: !671)
!671 = !{null, !668, !672}
!672 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !673, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !653)
!674 = !DISubprogram(name: "~ValueVectorOf", scope: !653, file: !388, line: 45, type: !675, scopeLine: 45, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!675 = !DISubroutineType(types: !676)
!676 = !{null, !668}
!677 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPNS_7DOMNodeEEaSERKS3_", scope: !653, file: !388, line: 51, type: !678, scopeLine: 51, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!678 = !DISubroutineType(types: !679)
!679 = !{!680, !668, !672}
!680 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !653, size: 64)
!681 = !DISubprogram(name: "addElement", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPNS_7DOMNodeEE10addElementERKS2_", scope: !653, file: !388, line: 57, type: !682, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!682 = !DISubroutineType(types: !683)
!683 = !{null, !668, !684}
!684 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !661)
!686 = !DISubprogram(name: "setElementAt", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPNS_7DOMNodeEE12setElementAtERKS2_j", scope: !653, file: !388, line: 58, type: !687, scopeLine: 58, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!687 = !DISubroutineType(types: !688)
!688 = !{null, !668, !684, !114}
!689 = !DISubprogram(name: "insertElementAt", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPNS_7DOMNodeEE15insertElementAtERKS2_j", scope: !653, file: !388, line: 59, type: !687, scopeLine: 59, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!690 = !DISubprogram(name: "removeElementAt", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPNS_7DOMNodeEE15removeElementAtEj", scope: !653, file: !388, line: 60, type: !691, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!691 = !DISubroutineType(types: !692)
!692 = !{null, !668, !114}
!693 = !DISubprogram(name: "removeAllElements", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPNS_7DOMNodeEE17removeAllElementsEv", scope: !653, file: !388, line: 61, type: !675, scopeLine: 61, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!694 = !DISubprogram(name: "containsElement", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPNS_7DOMNodeEE15containsElementERKS2_j", scope: !653, file: !388, line: 62, type: !695, scopeLine: 62, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!695 = !DISubroutineType(types: !696)
!696 = !{!125, !668, !684, !114}
!697 = !DISubprogram(name: "elementAt", linkageName: "_ZNK11xercesc_2_713ValueVectorOfIPNS_7DOMNodeEE9elementAtEj", scope: !653, file: !388, line: 68, type: !698, scopeLine: 68, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!698 = !DISubroutineType(types: !699)
!699 = !{!684, !700, !114}
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!701 = !DISubprogram(name: "elementAt", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPNS_7DOMNodeEE9elementAtEj", scope: !653, file: !388, line: 69, type: !702, scopeLine: 69, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!702 = !DISubroutineType(types: !703)
!703 = !{!704, !668, !114}
!704 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !661, size: 64)
!705 = !DISubprogram(name: "curCapacity", linkageName: "_ZNK11xercesc_2_713ValueVectorOfIPNS_7DOMNodeEE11curCapacityEv", scope: !653, file: !388, line: 70, type: !706, scopeLine: 70, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!706 = !DISubroutineType(types: !707)
!707 = !{!105, !700}
!708 = !DISubprogram(name: "size", linkageName: "_ZNK11xercesc_2_713ValueVectorOfIPNS_7DOMNodeEE4sizeEv", scope: !653, file: !388, line: 71, type: !706, scopeLine: 71, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!709 = !DISubprogram(name: "getMemoryManager", linkageName: "_ZNK11xercesc_2_713ValueVectorOfIPNS_7DOMNodeEE16getMemoryManagerEv", scope: !653, file: !388, line: 72, type: !710, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!710 = !DISubroutineType(types: !711)
!711 = !{!54, !700}
!712 = !DISubprogram(name: "ensureExtraCapacity", linkageName: "_ZN11xercesc_2_713ValueVectorOfIPNS_7DOMNodeEE19ensureExtraCapacityEj", scope: !653, file: !388, line: 78, type: !691, scopeLine: 78, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!713 = !DISubprogram(name: "rawData", linkageName: "_ZNK11xercesc_2_713ValueVectorOfIPNS_7DOMNodeEE7rawDataEv", scope: !653, file: !388, line: 79, type: !714, scopeLine: 79, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!714 = !DISubroutineType(types: !715)
!715 = !{!716, !700}
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!717 = !{!718}
!718 = !DITemplateTypeParameter(name: "TElem", type: !661)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "fValidationContext", scope: !364, file: !365, line: 174, baseType: !196, size: 64, offset: 1344)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "fMemoryManager", scope: !364, file: !365, line: 175, baseType: !54, size: 64, offset: 1408)
!721 = !DISubprogram(name: "SchemaInfo", scope: !364, file: !365, line: 77, type: !722, scopeLine: 77, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!722 = !DISubroutineType(types: !723)
!723 = !{null, !724, !88, !481, !481, !481, !481, !114, !725, !212, !227, !115}
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!725 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !285)
!726 = !DISubprogram(name: "~SchemaInfo", scope: !364, file: !365, line: 87, type: !727, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!727 = !DISubroutineType(types: !728)
!728 = !{null, !724}
!729 = !DISubprogram(name: "getCurrentSchemaURL", linkageName: "_ZNK11xercesc_2_710SchemaInfo19getCurrentSchemaURLEv", scope: !364, file: !365, line: 93, type: !730, scopeLine: 93, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!730 = !DISubroutineType(types: !731)
!731 = !{!285, !732}
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!733 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !364)
!734 = !DISubprogram(name: "getTargetNSURIString", linkageName: "_ZNK11xercesc_2_710SchemaInfo20getTargetNSURIStringEv", scope: !364, file: !365, line: 94, type: !735, scopeLine: 94, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!735 = !DISubroutineType(types: !736)
!736 = !{!189, !732}
!737 = !DISubprogram(name: "getRoot", linkageName: "_ZNK11xercesc_2_710SchemaInfo7getRootEv", scope: !364, file: !365, line: 95, type: !738, scopeLine: 95, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!738 = !DISubroutineType(types: !739)
!739 = !{!228, !732}
!740 = !DISubprogram(name: "getProcessed", linkageName: "_ZNK11xercesc_2_710SchemaInfo12getProcessedEv", scope: !364, file: !365, line: 96, type: !741, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!741 = !DISubroutineType(types: !742)
!742 = !{!125, !732}
!743 = !DISubprogram(name: "getBlockDefault", linkageName: "_ZNK11xercesc_2_710SchemaInfo15getBlockDefaultEv", scope: !364, file: !365, line: 97, type: !744, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!744 = !DISubroutineType(types: !745)
!745 = !{!240, !732}
!746 = !DISubprogram(name: "getFinalDefault", linkageName: "_ZNK11xercesc_2_710SchemaInfo15getFinalDefaultEv", scope: !364, file: !365, line: 98, type: !744, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!747 = !DISubprogram(name: "getTargetNSURI", linkageName: "_ZNK11xercesc_2_710SchemaInfo14getTargetNSURIEv", scope: !364, file: !365, line: 99, type: !744, scopeLine: 99, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!748 = !DISubprogram(name: "getScopeCount", linkageName: "_ZNK11xercesc_2_710SchemaInfo13getScopeCountEv", scope: !364, file: !365, line: 100, type: !744, scopeLine: 100, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!749 = !DISubprogram(name: "getNamespaceScopeLevel", linkageName: "_ZNK11xercesc_2_710SchemaInfo22getNamespaceScopeLevelEv", scope: !364, file: !365, line: 101, type: !750, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!750 = !DISubroutineType(types: !751)
!751 = !{!105, !732}
!752 = !DISubprogram(name: "getElemAttrDefaultQualified", linkageName: "_ZNK11xercesc_2_710SchemaInfo27getElemAttrDefaultQualifiedEv", scope: !364, file: !365, line: 102, type: !753, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!753 = !DISubroutineType(types: !754)
!754 = !{!80, !732}
!755 = !DISubprogram(name: "getImportingListEnumerator", linkageName: "_ZNK11xercesc_2_710SchemaInfo26getImportingListEnumeratorEv", scope: !364, file: !365, line: 103, type: !756, scopeLine: 103, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!756 = !DISubroutineType(types: !757)
!757 = !{!758, !732}
!758 = !DICompositeType(tag: DW_TAG_class_type, name: "BaseRefVectorEnumerator<xercesc_2_7::SchemaInfo>", scope: !2, file: !759, line: 101, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_723BaseRefVectorEnumeratorINS_10SchemaInfoEEE")
!759 = !DIFile(filename: "./xercesc/util/BaseRefVectorOf.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!760 = !DISubprogram(name: "getRecursingAnonTypes", linkageName: "_ZNK11xercesc_2_710SchemaInfo21getRecursingAnonTypesEv", scope: !364, file: !365, line: 104, type: !761, scopeLine: 104, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!761 = !DISubroutineType(types: !762)
!762 = !{!386, !732}
!763 = !DISubprogram(name: "getRecursingTypeNames", linkageName: "_ZNK11xercesc_2_710SchemaInfo21getRecursingTypeNamesEv", scope: !364, file: !365, line: 105, type: !764, scopeLine: 105, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!764 = !DISubroutineType(types: !765)
!765 = !{!517, !732}
!766 = !DISubprogram(name: "getNonXSAttList", linkageName: "_ZNK11xercesc_2_710SchemaInfo15getNonXSAttListEv", scope: !364, file: !365, line: 106, type: !767, scopeLine: 106, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!767 = !DISubroutineType(types: !768)
!768 = !{!652, !732}
!769 = !DISubprogram(name: "getValidationContext", linkageName: "_ZNK11xercesc_2_710SchemaInfo20getValidationContextEv", scope: !364, file: !365, line: 107, type: !770, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!770 = !DISubroutineType(types: !771)
!771 = !{!196, !732}
!772 = !DISubprogram(name: "setProcessed", linkageName: "_ZN11xercesc_2_710SchemaInfo12setProcessedEb", scope: !364, file: !365, line: 112, type: !773, scopeLine: 112, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!773 = !DISubroutineType(types: !774)
!774 = !{null, !724, !326}
!775 = !DISubprogram(name: "setScopeCount", linkageName: "_ZN11xercesc_2_710SchemaInfo13setScopeCountEi", scope: !364, file: !365, line: 113, type: !776, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!776 = !DISubroutineType(types: !777)
!777 = !{null, !724, !481}
!778 = !DISubprogram(name: "setBlockDefault", linkageName: "_ZN11xercesc_2_710SchemaInfo15setBlockDefaultEi", scope: !364, file: !365, line: 114, type: !776, scopeLine: 114, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!779 = !DISubprogram(name: "setFinalDefault", linkageName: "_ZN11xercesc_2_710SchemaInfo15setFinalDefaultEi", scope: !364, file: !365, line: 115, type: !776, scopeLine: 115, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!780 = !DISubprogram(name: "setElemAttrDefaultQualified", linkageName: "_ZN11xercesc_2_710SchemaInfo27setElemAttrDefaultQualifiedEt", scope: !364, file: !365, line: 116, type: !781, scopeLine: 116, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!781 = !DISubroutineType(types: !782)
!782 = !{null, !724, !88}
!783 = !DISubprogram(name: "addSchemaInfo", linkageName: "_ZN11xercesc_2_710SchemaInfo13addSchemaInfoEPS0_NS0_8ListTypeE", scope: !364, file: !365, line: 121, type: !784, scopeLine: 121, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!784 = !DISubroutineType(types: !785)
!785 = !{null, !724, !786, !787}
!786 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !363)
!787 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !788)
!788 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ListType", scope: !364, file: !365, line: 56, baseType: !105, size: 32, elements: !789, identifier: "_ZTSN11xercesc_2_710SchemaInfo8ListTypeE")
!789 = !{!790, !791}
!790 = !DIEnumerator(name: "IMPORT", value: 1, isUnsigned: true)
!791 = !DIEnumerator(name: "INCLUDE", value: 2, isUnsigned: true)
!792 = !DISubprogram(name: "containsInfo", linkageName: "_ZNK11xercesc_2_710SchemaInfo12containsInfoEPKS0_NS0_8ListTypeE", scope: !364, file: !365, line: 122, type: !793, scopeLine: 122, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!793 = !DISubroutineType(types: !794)
!794 = !{!125, !732, !795, !787}
!795 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !796)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!797 = !DISubprogram(name: "getImportInfo", linkageName: "_ZNK11xercesc_2_710SchemaInfo13getImportInfoEj", scope: !364, file: !365, line: 123, type: !798, scopeLine: 123, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!798 = !DISubroutineType(types: !799)
!799 = !{!363, !732, !114}
!800 = !DISubprogram(name: "getTopLevelComponent", linkageName: "_ZN11xercesc_2_710SchemaInfo20getTopLevelComponentEtPKtS2_", scope: !364, file: !365, line: 124, type: !801, scopeLine: 124, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!801 = !DISubroutineType(types: !802)
!802 = !{!593, !724, !88, !212, !212}
!803 = !DISubprogram(name: "getTopLevelComponent", linkageName: "_ZN11xercesc_2_710SchemaInfo20getTopLevelComponentEtPKtS2_PPS0_", scope: !364, file: !365, line: 127, type: !804, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!804 = !DISubroutineType(types: !805)
!805 = !{!593, !724, !88, !212, !212, !806}
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!807 = !DISubprogram(name: "updateImportingInfo", linkageName: "_ZN11xercesc_2_710SchemaInfo19updateImportingInfoEPS0_", scope: !364, file: !365, line: 131, type: !808, scopeLine: 131, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!808 = !DISubroutineType(types: !809)
!809 = !{null, !724, !786}
!810 = !DISubprogram(name: "circularImportExist", linkageName: "_ZN11xercesc_2_710SchemaInfo19circularImportExistEj", scope: !364, file: !365, line: 132, type: !811, scopeLine: 132, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!811 = !DISubroutineType(types: !812)
!812 = !{!125, !724, !114}
!813 = !DISubprogram(name: "isFailedRedefine", linkageName: "_ZN11xercesc_2_710SchemaInfo16isFailedRedefineEPKNS_10DOMElementE", scope: !364, file: !365, line: 133, type: !814, scopeLine: 133, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!814 = !DISubroutineType(types: !815)
!815 = !{!125, !724, !227}
!816 = !DISubprogram(name: "addFailedRedefine", linkageName: "_ZN11xercesc_2_710SchemaInfo17addFailedRedefineEPKNS_10DOMElementE", scope: !364, file: !365, line: 134, type: !817, scopeLine: 134, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!817 = !DISubroutineType(types: !818)
!818 = !{null, !724, !227}
!819 = !DISubprogram(name: "isImportingNS", linkageName: "_ZN11xercesc_2_710SchemaInfo13isImportingNSEi", scope: !364, file: !365, line: 135, type: !820, scopeLine: 135, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!820 = !DISubroutineType(types: !821)
!821 = !{!125, !724, !481}
!822 = !DISubprogram(name: "addImportedNS", linkageName: "_ZN11xercesc_2_710SchemaInfo13addImportedNSEi", scope: !364, file: !365, line: 136, type: !776, scopeLine: 136, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!823 = !DISubprogram(name: "addRecursingType", linkageName: "_ZN11xercesc_2_710SchemaInfo16addRecursingTypeEPKNS_10DOMElementEPKt", scope: !364, file: !365, line: 137, type: !824, scopeLine: 137, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!824 = !DISubroutineType(types: !825)
!825 = !{null, !724, !227, !212}
!826 = !DISubprogram(name: "SchemaInfo", scope: !364, file: !365, line: 143, type: !827, scopeLine: 143, flags: DIFlagPrototyped, spFlags: 0)
!827 = !DISubroutineType(types: !828)
!828 = !{null, !724, !829}
!829 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !733, size: 64)
!830 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_710SchemaInfoaSERKS0_", scope: !364, file: !365, line: 144, type: !831, scopeLine: 144, flags: DIFlagPrototyped, spFlags: 0)
!831 = !DISubroutineType(types: !832)
!832 = !{!833, !724, !829}
!833 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !364, size: 64)
!834 = !DISubprogram(name: "clearTopLevelComponents", linkageName: "_ZN11xercesc_2_710SchemaInfo23clearTopLevelComponentsEv", scope: !364, file: !365, line: 149, type: !727, scopeLine: 149, flags: DIFlagPrototyped, spFlags: 0)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "fCurrentGroupInfo", scope: !234, file: !235, line: 754, baseType: !836, size: 64, offset: 1664)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DICompositeType(tag: DW_TAG_class_type, name: "XercesGroupInfo", scope: !2, file: !258, line: 54, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_715XercesGroupInfoE")
!838 = !DIDerivedType(tag: DW_TAG_member, name: "fCurrentAttGroupInfo", scope: !234, file: !235, line: 755, baseType: !839, size: 64, offset: 1728)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DICompositeType(tag: DW_TAG_class_type, name: "XercesAttGroupInfo", scope: !2, file: !258, line: 55, flags: DIFlagFwdDecl, identifier: "_ZTSN11xercesc_2_718XercesAttGroupInfoE")
!841 = !DIDerivedType(tag: DW_TAG_member, name: "fCurrentComplexType", scope: !234, file: !235, line: 756, baseType: !842, size: 64, offset: 1792)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DICompositeType(tag: DW_TAG_class_type, name: "ComplexTypeInfo", scope: !2, file: !844, line: 55, flags: DIFlagFwdDecl)
!844 = !DIFile(filename: "./xercesc/validators/schema/ComplexTypeInfo.hpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/523.xalancbmk_r/build/build_base_ld-loop-ext-m64.0000")
!845 = !DIDerivedType(tag: DW_TAG_member, name: "fCurrentTypeNameStack", scope: !234, file: !235, line: 757, baseType: !846, size: 64, offset: 1856)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "ValueVectorOf<unsigned int>", scope: !2, file: !388, line: 32, size: 256, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !848, templateParams: !906, identifier: "_ZTSN11xercesc_2_713ValueVectorOfIjEE")
!848 = !{!849, !850, !851, !852, !853, !855, !856, !860, !865, !868, !872, !876, !879, !880, !883, !884, !887, !891, !894, !897, !898, !901, !902}
!849 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !847, baseType: !41, flags: DIFlagPublic, extraData: i32 0)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "fCallDestructor", scope: !847, file: !388, line: 97, baseType: !125, size: 8)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "fCurCount", scope: !847, file: !388, line: 98, baseType: !105, size: 32, offset: 32)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "fMaxCount", scope: !847, file: !388, line: 99, baseType: !105, size: 32, offset: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "fElemList", scope: !847, file: !388, line: 100, baseType: !854, size: 64, offset: 128)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "fMemoryManager", scope: !847, file: !388, line: 101, baseType: !54, size: 64, offset: 192)
!856 = !DISubprogram(name: "ValueVectorOf", scope: !847, file: !388, line: 38, type: !857, scopeLine: 38, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!857 = !DISubroutineType(types: !858)
!858 = !{null, !859, !114, !115, !326}
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!860 = !DISubprogram(name: "ValueVectorOf", scope: !847, file: !388, line: 44, type: !861, scopeLine: 44, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!861 = !DISubroutineType(types: !862)
!862 = !{null, !859, !863}
!863 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !864, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !847)
!865 = !DISubprogram(name: "~ValueVectorOf", scope: !847, file: !388, line: 45, type: !866, scopeLine: 45, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!866 = !DISubroutineType(types: !867)
!867 = !{null, !859}
!868 = !DISubprogram(name: "operator=", linkageName: "_ZN11xercesc_2_713ValueVectorOfIjEaSERKS1_", scope: !847, file: !388, line: 51, type: !869, scopeLine: 51, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!869 = !DISubroutineType(types: !870)
!870 = !{!871, !859, !863}
!871 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !847, size: 64)
!872 = !DISubprogram(name: "addElement", linkageName: "_ZN11xercesc_2_713ValueVectorOfIjE10addElementERKj", scope: !847, file: !388, line: 57, type: !873, scopeLine: 57, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!873 = !DISubroutineType(types: !874)
!874 = !{null, !859, !875}
!875 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !114, size: 64)
!876 = !DISubprogram(name: "setElementAt", linkageName: "_ZN11xercesc_2_713ValueVectorOfIjE12setElementAtERKjj", scope: !847, file: !388, line: 58, type: !877, scopeLine: 58, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!877 = !DISubroutineType(types: !878)
!878 = !{null, !859, !875, !114}
!879 = !DISubprogram(name: "insertElementAt", linkageName: "_ZN11xercesc_2_713ValueVectorOfIjE15insertElementAtERKjj", scope: !847, file: !388, line: 59, type: !877, scopeLine: 59, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!880 = !DISubprogram(name: "removeElementAt", linkageName: "_ZN11xercesc_2_713ValueVectorOfIjE15removeElementAtEj", scope: !847, file: !388, line: 60, type: !881, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!881 = !DISubroutineType(types: !882)
!882 = !{null, !859, !114}
!883 = !DISubprogram(name: "removeAllElements", linkageName: "_ZN11xercesc_2_713ValueVectorOfIjE17removeAllElementsEv", scope: !847, file: !388, line: 61, type: !866, scopeLine: 61, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!884 = !DISubprogram(name: "containsElement", linkageName: "_ZN11xercesc_2_713ValueVectorOfIjE15containsElementERKjj", scope: !847, file: !388, line: 62, type: !885, scopeLine: 62, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!885 = !DISubroutineType(types: !886)
!886 = !{!125, !859, !875, !114}
