; ModuleID = 'x264_src/output/matroska_ebml.c'
source_filename = "x264_src/output/matroska_ebml.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.mk_writer = type { %struct._IO_FILE*, i32, %struct.mk_context*, %struct.mk_context*, %struct.mk_context*, %struct.mk_context*, %struct.mk_context*, i64, i64, i64, i64, i64, i8, i8, i8, i8 }
%struct.mk_context = type { %struct.mk_context*, %struct.mk_context**, %struct.mk_context*, %struct.mk_writer*, i32, i8*, i32, i32 }
%union.anon = type { float }

@.str = private unnamed_addr constant [2 x i8] c"-\00", align 1
@stdout = external dso_local global %struct._IO_FILE*, align 8
@.str.1 = private unnamed_addr constant [3 x i8] c"wb\00", align 1
@.str.2 = private unnamed_addr constant [9 x i8] c"matroska\00", align 1
@.str.3 = private unnamed_addr constant [25 x i8] c"Haali Matroska Writer b0\00", align 1

; Function Attrs: noinline nounwind uwtable
define dso_local %struct.mk_writer* @mk_create_writer(i8* %filename) #0 !dbg !13 {
entry:

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "x264_src/output/matroska_ebml.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{}
!3 = !{!4, !5, !6, !8}
!4 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!5 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!9 = !{i32 7, !"Dwarf Version", i32 4}
!10 = !{i32 2, !"Debug Info Version", i32 3}
!11 = !{i32 1, !"wchar_size", i32 4}
!12 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!13 = distinct !DISubprogram(name: "mk_create_writer", scope: !1, file: !1, line: 287, type: !14, scopeLine: 288, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!14 = !DISubroutineType(types: !15)
!15 = !{!16, !115}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "mk_writer", file: !18, line: 24, baseType: !19)
!18 = !DIFile(filename: "x264_src/output/matroska_ebml.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mk_writer", file: !1, line: 43, size: 832, elements: !20)
!20 = !{!21, !82, !84, !99, !100, !101, !102, !103, !107, !108, !109, !110, !111, !112, !113, !114}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !19, file: !1, line: 45, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !24, line: 7, baseType: !25)
!24 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !26, line: 49, size: 1728, elements: !27)
!26 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!27 = !{!28, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !44, !46, !47, !48, !52, !54, !56, !60, !63, !65, !68, !71, !72, !73, !77, !78}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !25, file: !26, line: 51, baseType: !29, size: 32)
!29 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !25, file: !26, line: 54, baseType: !6, size: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !25, file: !26, line: 55, baseType: !6, size: 64, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !25, file: !26, line: 56, baseType: !6, size: 64, offset: 192)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !25, file: !26, line: 57, baseType: !6, size: 64, offset: 256)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !25, file: !26, line: 58, baseType: !6, size: 64, offset: 320)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !25, file: !26, line: 59, baseType: !6, size: 64, offset: 384)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !25, file: !26, line: 60, baseType: !6, size: 64, offset: 448)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !25, file: !26, line: 61, baseType: !6, size: 64, offset: 512)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !25, file: !26, line: 64, baseType: !6, size: 64, offset: 576)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !25, file: !26, line: 65, baseType: !6, size: 64, offset: 640)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !25, file: !26, line: 66, baseType: !6, size: 64, offset: 704)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !25, file: !26, line: 68, baseType: !42, size: 64, offset: 768)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !26, line: 36, flags: DIFlagFwdDecl)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !25, file: !26, line: 70, baseType: !45, size: 64, offset: 832)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !25, file: !26, line: 72, baseType: !29, size: 32, offset: 896)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !25, file: !26, line: 73, baseType: !29, size: 32, offset: 928)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !25, file: !26, line: 74, baseType: !49, size: 64, offset: 960)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !50, line: 152, baseType: !51)
!50 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!51 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !25, file: !26, line: 77, baseType: !53, size: 16, offset: 1024)
!53 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !25, file: !26, line: 78, baseType: !55, size: 8, offset: 1040)
!55 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !25, file: !26, line: 79, baseType: !57, size: 8, offset: 1048)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 8, elements: !58)
!58 = !{!59}
!59 = !DISubrange(count: 1)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !25, file: !26, line: 81, baseType: !61, size: 64, offset: 1088)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !26, line: 43, baseType: null)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !25, file: !26, line: 89, baseType: !64, size: 64, offset: 1152)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !50, line: 153, baseType: !51)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !25, file: !26, line: 91, baseType: !66, size: 64, offset: 1216)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !26, line: 37, flags: DIFlagFwdDecl)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !25, file: !26, line: 92, baseType: !69, size: 64, offset: 1280)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !26, line: 38, flags: DIFlagFwdDecl)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !25, file: !26, line: 93, baseType: !45, size: 64, offset: 1344)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !25, file: !26, line: 94, baseType: !8, size: 64, offset: 1408)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !25, file: !26, line: 95, baseType: !74, size: 64, offset: 1472)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !75, line: 46, baseType: !76)
!75 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!76 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !25, file: !26, line: 96, baseType: !29, size: 32, offset: 1536)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !25, file: !26, line: 98, baseType: !79, size: 160, offset: 1568)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 160, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 20)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "duration_ptr", scope: !19, file: !1, line: 47, baseType: !83, size: 32, offset: 64)
!83 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !19, file: !1, line: 49, baseType: !85, size: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "mk_context", file: !1, line: 41, baseType: !87)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mk_context", file: !1, line: 31, size: 448, elements: !88)
!88 = !{!89, !91, !93, !94, !95, !96, !97, !98}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !87, file: !1, line: 33, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !87, file: !1, line: 33, baseType: !92, size: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !87, file: !1, line: 33, baseType: !90, size: 64, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !87, file: !1, line: 34, baseType: !16, size: 64, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !87, file: !1, line: 35, baseType: !83, size: 32, offset: 256)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !87, file: !1, line: 37, baseType: !8, size: 64, offset: 320)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "d_cur", scope: !87, file: !1, line: 38, baseType: !83, size: 32, offset: 384)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "d_max", scope: !87, file: !1, line: 38, baseType: !83, size: 32, offset: 416)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "cluster", scope: !19, file: !1, line: 49, baseType: !85, size: 64, offset: 192)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !19, file: !1, line: 49, baseType: !85, size: 64, offset: 256)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "freelist", scope: !19, file: !1, line: 50, baseType: !85, size: 64, offset: 320)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "actlist", scope: !19, file: !1, line: 51, baseType: !85, size: 64, offset: 384)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "def_duration", scope: !19, file: !1, line: 53, baseType: !104, size: 64, offset: 448)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !105, line: 27, baseType: !106)
!105 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !50, line: 44, baseType: !51)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "timescale", scope: !19, file: !1, line: 54, baseType: !104, size: 64, offset: 512)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "cluster_tc_scaled", scope: !19, file: !1, line: 55, baseType: !104, size: 64, offset: 576)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "frame_tc", scope: !19, file: !1, line: 56, baseType: !104, size: 64, offset: 640)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "max_frame_tc", scope: !19, file: !1, line: 56, baseType: !104, size: 64, offset: 704)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "wrote_header", scope: !19, file: !1, line: 58, baseType: !55, size: 8, offset: 768)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "in_frame", scope: !19, file: !1, line: 58, baseType: !55, size: 8, offset: 776)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe", scope: !19, file: !1, line: 58, baseType: !55, size: 8, offset: 784)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "skippable", scope: !19, file: !1, line: 58, baseType: !55, size: 8, offset: 792)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!117 = !DILocalVariable(name: "filename", arg: 1, scope: !13, file: !1, line: 287, type: !115)
!118 = !DILocation(line: 287, column: 42, scope: !13)
!119 = !DILocalVariable(name: "w", scope: !13, file: !1, line: 289, type: !16)
!120 = !DILocation(line: 289, column: 16, scope: !13)
!121 = !DILocation(line: 289, column: 20, scope: !13)
!122 = !DILocation(line: 290, column: 10, scope: !123)
!123 = distinct !DILexicalBlock(scope: !13, file: !1, line: 290, column: 9)
!124 = !DILocation(line: 290, column: 9, scope: !13)
!125 = !DILocation(line: 291, column: 9, scope: !123)
!126 = !DILocation(line: 293, column: 13, scope: !13)
!127 = !DILocation(line: 293, column: 5, scope: !13)
!128 = !DILocation(line: 295, column: 34, scope: !13)
!129 = !DILocation(line: 295, column: 15, scope: !13)
!130 = !DILocation(line: 295, column: 5, scope: !13)
!131 = !DILocation(line: 295, column: 8, scope: !13)
!132 = !DILocation(line: 295, column: 13, scope: !13)
!133 = !DILocation(line: 296, column: 10, scope: !134)
!134 = distinct !DILexicalBlock(scope: !13, file: !1, line: 296, column: 9)
!135 = !DILocation(line: 296, column: 13, scope: !134)
!136 = !DILocation(line: 296, column: 9, scope: !13)
!137 = !DILocation(line: 298, column: 15, scope: !138)
!138 = distinct !DILexicalBlock(scope: !134, file: !1, line: 297, column: 5)
!139 = !DILocation(line: 298, column: 9, scope: !138)
!140 = !DILocation(line: 299, column: 9, scope: !138)
!141 = !DILocation(line: 302, column: 18, scope: !142)
!142 = distinct !DILexicalBlock(scope: !13, file: !1, line: 302, column: 9)
!143 = !DILocation(line: 302, column: 10, scope: !142)
!144 = !DILocation(line: 302, column: 9, scope: !13)
!145 = !DILocation(line: 303, column: 17, scope: !142)
!146 = !DILocation(line: 303, column: 9, scope: !142)
!147 = !DILocation(line: 303, column: 12, scope: !142)
!148 = !DILocation(line: 303, column: 15, scope: !142)
!149 = !DILocation(line: 305, column: 24, scope: !142)
!150 = !DILocation(line: 305, column: 17, scope: !142)
!151 = !DILocation(line: 305, column: 9, scope: !142)
!152 = !DILocation(line: 305, column: 12, scope: !142)
!153 = !DILocation(line: 305, column: 15, scope: !142)
!154 = !DILocation(line: 306, column: 10, scope: !155)
!155 = distinct !DILexicalBlock(scope: !13, file: !1, line: 306, column: 9)
!156 = !DILocation(line: 306, column: 13, scope: !155)
!157 = !DILocation(line: 306, column: 9, scope: !13)
!158 = !DILocation(line: 308, column: 30, scope: !159)
!159 = distinct !DILexicalBlock(scope: !155, file: !1, line: 307, column: 5)
!160 = !DILocation(line: 308, column: 9, scope: !159)
!161 = !DILocation(line: 309, column: 15, scope: !159)
!162 = !DILocation(line: 309, column: 9, scope: !159)
!163 = !DILocation(line: 310, column: 9, scope: !159)
!164 = !DILocation(line: 313, column: 5, scope: !13)
!165 = !DILocation(line: 313, column: 8, scope: !13)
!166 = !DILocation(line: 313, column: 18, scope: !13)
!167 = !DILocation(line: 315, column: 12, scope: !13)
!168 = !DILocation(line: 315, column: 5, scope: !13)
!169 = !DILocation(line: 316, column: 1, scope: !13)
!170 = distinct !DISubprogram(name: "mk_create_context", scope: !1, file: !1, line: 61, type: !171, scopeLine: 62, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !2)
!171 = !DISubroutineType(types: !172)
!172 = !{!85, !16, !85, !83}
!173 = !DILocalVariable(name: "w", arg: 1, scope: !170, file: !1, line: 61, type: !16)
!174 = !DILocation(line: 61, column: 50, scope: !170)
!175 = !DILocalVariable(name: "parent", arg: 2, scope: !170, file: !1, line: 61, type: !85)
!176 = !DILocation(line: 61, column: 65, scope: !170)
!177 = !DILocalVariable(name: "id", arg: 3, scope: !170, file: !1, line: 61, type: !83)
