; ModuleID = 'x264_src/common/mvpred.c'
source_filename = "x264_src/common/mvpred.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.x264_t = type { %struct.x264_param_t, [129 x %struct.x264_t*], i32, i32, i32, i32, i32, %struct.anon.2, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1 x %struct.x264_sps_t], %struct.x264_sps_t*, [1 x %struct.x264_pps_t], %struct.x264_pps_t*, i32, i32, [4 x [16 x i32]*], [2 x [64 x i32]*], [4 x [16 x i32]*], [2 x [64 x i32]*], [4 x [16 x i16]*], [2 x [64 x i16]*], [4 x [16 x i16]*], [2 x [64 x i16]*], [92 x i16*], [92 x [4 x i16*]], i8*, [8 x i8], %struct.x264_slice_header_t, %struct.x264_cabac_t, %struct.anon.8, %struct.x264_frame*, %struct.x264_frame*, i32, [19 x %struct.x264_frame*], i32, [19 x %struct.x264_frame*], [2 x i32], i32, i32, i64, %struct.anon.9, %struct.anon.10, %struct.x264_ratecontrol_t*, %struct.anon.13, [2 x [64 x i32]], [2 x [64 x i16]], [2 x i32], i8*, [2 x [3 x i8*]], [2 x [2 x [4 x [4 x i8]]]*], [7 x void (i8*)*], [7 x void (i8*)*], [12 x void (i8*, i8*)*], [12 x void (i8*)*], void (i8*, i8*, i32, i32)*, %struct.x264_pixel_function_t, %struct.x264_mc_functions_t, %struct.x264_dct_function_t, %struct.x264_zigzag_function_t, %struct.x264_quant_function_t, %struct.x264_deblock_function_t, %struct.x264_lookahead_t*, [8 x i8] }

!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !72, line: 25, baseType: !78)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !74, line: 40, baseType: !79)
!79 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!80 = !{!81}
!81 = !DISubrange(count: 2)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !68, file: !28, line: 89, baseType: !83, size: 32)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 32, elements: !87)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !72, line: 24, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !74, line: 38, baseType: !86)
!86 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!87 = !{!88}
!88 = !DISubrange(count: 4)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 32, elements: !80)
!92 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !94, line: 25, baseType: !95)
!94 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !74, line: 39, baseType: !96)
!96 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_union16_t", file: !28, line: 88, baseType: !99)
!99 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !28, line: 88, size: 16, elements: !100)
!100 = !{!101, !102}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !99, file: !28, line: 88, baseType: !77, size: 16)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !99, file: !28, line: 88, baseType: !103, size: 16)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 16, elements: !80)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_union64_t", file: !28, line: 90, baseType: !106)
!106 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !28, line: 90, size: 64, elements: !107)
!107 = !{!108, !112, !114, !116}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !106, file: !28, line: 90, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !72, line: 27, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !74, line: 45, baseType: !111)
!111 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !106, file: !28, line: 90, baseType: !113, size: 64)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 64, elements: !80)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !106, file: !28, line: 90, baseType: !115, size: 64)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 64, elements: !87)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !106, file: !28, line: 90, baseType: !117, size: 64)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 64, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 8)
!120 = !{!0}
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 864, elements: !124)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!123 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!124 = !{!125}
!125 = !DISubrange(count: 27)
!126 = !{i32 7, !"Dwarf Version", i32 4}
!127 = !{i32 2, !"Debug Info Version", i32 3}
!128 = !{i32 1, !"wchar_size", i32 4}
!129 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!130 = distinct !DISubprogram(name: "x264_mb_predict_mv", scope: !3, file: !3, line: 27, type: !131, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !1420)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !133, !123, !123, !123, !839}
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_t", file: !135, line: 46, baseType: !136)
!135 = !DIFile(filename: "x264_src/x264.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_t", file: !28, line: 381, size: 266752, elements: !137)
!137 = !{!138, !305, !309, !310, !311, !312, !313, !314, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !450, !452, !480, !482, !483, !484, !488, !492, !493, !494, !498, !502, !503, !504, !509, !512, !513, !586, !603, !764, !765, !766, !767, !771, !772, !773, !774, !775, !776, !777, !792, !985, !989, !1050, !1053, !1055, !1056, !1057, !1060, !1065, !1074, !1075, !1083, !1085, !1090, !1166, !1252, !1296, !1318, !1367, !1396}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !136, file: !28, line: 384, baseType: !139, size: 5632)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !135, line: 376, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !135, line: 176, size: 5632, elements: !141)
!141 = !{!142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !185, !189, !190, !191, !192, !196, !197, !210, !211, !212, !213, !214, !243, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !140, file: !135, line: 179, baseType: !7, size: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !140, file: !135, line: 180, baseType: !123, size: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !140, file: !135, line: 181, baseType: !123, size: 32, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !140, file: !135, line: 182, baseType: !123, size: 32, offset: 96)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !140, file: !135, line: 183, baseType: !123, size: 32, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !140, file: !135, line: 186, baseType: !123, size: 32, offset: 160)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !140, file: !135, line: 187, baseType: !123, size: 32, offset: 192)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !140, file: !135, line: 188, baseType: !123, size: 32, offset: 224)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !140, file: !135, line: 189, baseType: !123, size: 32, offset: 256)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !140, file: !135, line: 190, baseType: !123, size: 32, offset: 288)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !140, file: !135, line: 198, baseType: !123, size: 32, offset: 320)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !140, file: !135, line: 215, baseType: !154, size: 288, offset: 352)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !140, file: !135, line: 200, size: 288, elements: !155)
!155 = !{!156, !157, !158, !159, !160, !161, !162, !163, !164}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !154, file: !135, line: 203, baseType: !123, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !154, file: !135, line: 204, baseType: !123, size: 32, offset: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !154, file: !135, line: 206, baseType: !123, size: 32, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !154, file: !135, line: 209, baseType: !123, size: 32, offset: 96)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !154, file: !135, line: 210, baseType: !123, size: 32, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !154, file: !135, line: 211, baseType: !123, size: 32, offset: 160)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !154, file: !135, line: 212, baseType: !123, size: 32, offset: 192)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !154, file: !135, line: 213, baseType: !123, size: 32, offset: 224)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !154, file: !135, line: 214, baseType: !123, size: 32, offset: 256)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !140, file: !135, line: 218, baseType: !123, size: 32, offset: 640)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !140, file: !135, line: 219, baseType: !123, size: 32, offset: 672)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !140, file: !135, line: 220, baseType: !123, size: 32, offset: 704)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !140, file: !135, line: 221, baseType: !123, size: 32, offset: 736)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !140, file: !135, line: 222, baseType: !123, size: 32, offset: 768)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !140, file: !135, line: 224, baseType: !123, size: 32, offset: 800)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !140, file: !135, line: 225, baseType: !123, size: 32, offset: 832)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !140, file: !135, line: 226, baseType: !123, size: 32, offset: 864)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !140, file: !135, line: 227, baseType: !123, size: 32, offset: 896)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !140, file: !135, line: 229, baseType: !123, size: 32, offset: 928)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !140, file: !135, line: 230, baseType: !123, size: 32, offset: 960)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !140, file: !135, line: 231, baseType: !123, size: 32, offset: 992)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !140, file: !135, line: 233, baseType: !123, size: 32, offset: 1024)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !140, file: !135, line: 234, baseType: !123, size: 32, offset: 1056)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !140, file: !135, line: 236, baseType: !123, size: 32, offset: 1088)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !140, file: !135, line: 237, baseType: !123, size: 32, offset: 1120)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !140, file: !135, line: 239, baseType: !123, size: 32, offset: 1152)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !140, file: !135, line: 240, baseType: !183, size: 64, offset: 1216)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !140, file: !135, line: 241, baseType: !186, size: 128, offset: 1280)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 128, elements: !187)
!187 = !{!188}
!188 = !DISubrange(count: 16)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !140, file: !135, line: 242, baseType: !186, size: 128, offset: 1408)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !140, file: !135, line: 243, baseType: !186, size: 128, offset: 1536)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !140, file: !135, line: 244, baseType: !186, size: 128, offset: 1664)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !140, file: !135, line: 245, baseType: !193, size: 512, offset: 1792)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 512, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !140, file: !135, line: 246, baseType: !193, size: 512, offset: 2304)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !140, file: !135, line: 249, baseType: !198, size: 64, offset: 2816)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{null, !89, !123, !201, !203}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, size: 192, elements: !205)
!205 = !{!206, !207, !208, !209}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !204, file: !3, baseType: !7, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !204, file: !3, baseType: !7, size: 32, offset: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !204, file: !3, baseType: !89, size: 64, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !204, file: !3, baseType: !89, size: 64, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !140, file: !135, line: 250, baseType: !89, size: 64, offset: 2880)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !140, file: !135, line: 251, baseType: !123, size: 32, offset: 2944)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !140, file: !135, line: 252, baseType: !123, size: 32, offset: 2976)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !140, file: !135, line: 253, baseType: !183, size: 64, offset: 3008)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !140, file: !135, line: 287, baseType: !215, size: 800, offset: 3072)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !140, file: !135, line: 256, size: 800, elements: !216)
!216 = !{!217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !237, !238, !239, !241, !242}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !215, file: !135, line: 258, baseType: !7, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !215, file: !135, line: 259, baseType: !7, size: 32, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !215, file: !135, line: 261, baseType: !123, size: 32, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !215, file: !135, line: 262, baseType: !123, size: 32, offset: 96)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !215, file: !135, line: 263, baseType: !123, size: 32, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !215, file: !135, line: 264, baseType: !123, size: 32, offset: 160)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !215, file: !135, line: 265, baseType: !123, size: 32, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !215, file: !135, line: 267, baseType: !123, size: 32, offset: 224)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !215, file: !135, line: 268, baseType: !123, size: 32, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !215, file: !135, line: 269, baseType: !123, size: 32, offset: 288)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !215, file: !135, line: 270, baseType: !123, size: 32, offset: 320)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !215, file: !135, line: 271, baseType: !123, size: 32, offset: 352)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !215, file: !135, line: 272, baseType: !123, size: 32, offset: 384)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !215, file: !135, line: 273, baseType: !123, size: 32, offset: 416)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !215, file: !135, line: 274, baseType: !123, size: 32, offset: 448)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !215, file: !135, line: 275, baseType: !123, size: 32, offset: 480)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !215, file: !135, line: 276, baseType: !123, size: 32, offset: 512)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !215, file: !135, line: 277, baseType: !123, size: 32, offset: 544)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !215, file: !135, line: 278, baseType: !236, size: 32, offset: 576)
!236 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !215, file: !135, line: 279, baseType: !236, size: 32, offset: 608)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !215, file: !135, line: 280, baseType: !123, size: 32, offset: 640)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !215, file: !135, line: 283, baseType: !240, size: 64, offset: 672)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 64, elements: !80)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !215, file: !135, line: 285, baseType: !123, size: 32, offset: 736)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !215, file: !135, line: 286, baseType: !123, size: 32, offset: 768)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !140, file: !135, line: 327, baseType: !244, size: 1152, offset: 3904)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !140, file: !135, line: 290, size: 1152, elements: !245)
!245 = !{!246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !283, !284}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !244, file: !135, line: 292, baseType: !123, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !244, file: !135, line: 294, baseType: !123, size: 32, offset: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !244, file: !135, line: 295, baseType: !123, size: 32, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !244, file: !135, line: 296, baseType: !123, size: 32, offset: 96)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !244, file: !135, line: 297, baseType: !123, size: 32, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !244, file: !135, line: 299, baseType: !123, size: 32, offset: 160)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !244, file: !135, line: 300, baseType: !236, size: 32, offset: 192)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !244, file: !135, line: 301, baseType: !236, size: 32, offset: 224)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !244, file: !135, line: 302, baseType: !236, size: 32, offset: 256)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !244, file: !135, line: 303, baseType: !123, size: 32, offset: 288)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !244, file: !135, line: 304, baseType: !123, size: 32, offset: 320)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !244, file: !135, line: 305, baseType: !236, size: 32, offset: 352)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !244, file: !135, line: 306, baseType: !236, size: 32, offset: 384)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !244, file: !135, line: 307, baseType: !236, size: 32, offset: 416)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !244, file: !135, line: 309, baseType: !123, size: 32, offset: 448)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !244, file: !135, line: 310, baseType: !236, size: 32, offset: 480)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !244, file: !135, line: 311, baseType: !123, size: 32, offset: 512)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !244, file: !135, line: 312, baseType: !123, size: 32, offset: 544)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !244, file: !135, line: 315, baseType: !123, size: 32, offset: 576)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !244, file: !135, line: 316, baseType: !183, size: 64, offset: 640)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !244, file: !135, line: 317, baseType: !123, size: 32, offset: 704)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !244, file: !135, line: 318, baseType: !183, size: 64, offset: 768)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !244, file: !135, line: 321, baseType: !236, size: 32, offset: 832)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !244, file: !135, line: 322, baseType: !236, size: 32, offset: 864)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !244, file: !135, line: 323, baseType: !236, size: 32, offset: 896)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !244, file: !135, line: 324, baseType: !272, size: 64, offset: 960)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !135, line: 174, baseType: !274)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !135, line: 167, size: 256, elements: !275)
!275 = !{!276, !277, !278, !279, !280, !281}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !274, file: !135, line: 169, baseType: !123, size: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !274, file: !135, line: 169, baseType: !123, size: 32, offset: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !274, file: !135, line: 170, baseType: !123, size: 32, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !274, file: !135, line: 171, baseType: !123, size: 32, offset: 96)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !274, file: !135, line: 172, baseType: !236, size: 32, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !274, file: !135, line: 173, baseType: !282, size: 64, offset: 192)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !244, file: !135, line: 325, baseType: !123, size: 32, offset: 1024)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !244, file: !135, line: 326, baseType: !183, size: 64, offset: 1088)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !140, file: !135, line: 330, baseType: !123, size: 32, offset: 5056)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !140, file: !135, line: 331, baseType: !123, size: 32, offset: 5088)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !140, file: !135, line: 332, baseType: !123, size: 32, offset: 5120)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !140, file: !135, line: 334, baseType: !123, size: 32, offset: 5152)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !140, file: !135, line: 335, baseType: !123, size: 32, offset: 5184)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !140, file: !135, line: 336, baseType: !71, size: 32, offset: 5216)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !140, file: !135, line: 337, baseType: !71, size: 32, offset: 5248)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !140, file: !135, line: 338, baseType: !71, size: 32, offset: 5280)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !140, file: !135, line: 339, baseType: !71, size: 32, offset: 5312)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !140, file: !135, line: 340, baseType: !123, size: 32, offset: 5344)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !140, file: !135, line: 344, baseType: !123, size: 32, offset: 5376)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !140, file: !135, line: 356, baseType: !123, size: 32, offset: 5408)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !140, file: !135, line: 364, baseType: !123, size: 32, offset: 5440)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !140, file: !135, line: 367, baseType: !123, size: 32, offset: 5472)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !140, file: !135, line: 368, baseType: !123, size: 32, offset: 5504)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !140, file: !135, line: 369, baseType: !123, size: 32, offset: 5536)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !140, file: !135, line: 375, baseType: !302, size: 64, offset: 5568)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DISubroutineType(types: !304)
!304 = !{null, !89}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !136, file: !28, line: 386, baseType: !306, size: 8256, offset: 5632)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 8256, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: 129)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "thread_handle", scope: !136, file: !28, line: 387, baseType: !123, size: 32, offset: 13888)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "b_thread_active", scope: !136, file: !28, line: 388, baseType: !123, size: 32, offset: 13920)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_phase", scope: !136, file: !28, line: 389, baseType: !123, size: 32, offset: 13952)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_start", scope: !136, file: !28, line: 390, baseType: !123, size: 32, offset: 13984)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_end", scope: !136, file: !28, line: 391, baseType: !123, size: 32, offset: 14016)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !136, file: !28, line: 402, baseType: !315, size: 576, offset: 14080)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !136, file: !28, line: 394, size: 576, elements: !316)
!316 = !{!317, !318, !319, !329, !330, !331}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal", scope: !315, file: !28, line: 396, baseType: !123, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "i_nals_allocated", scope: !315, file: !28, line: 397, baseType: !123, size: 32, offset: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "nal", scope: !315, file: !28, line: 398, baseType: !320, size: 64, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !135, line: 604, baseType: !322)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !135, line: 593, size: 192, elements: !323)
!323 = !{!324, !325, !326, !327}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !322, file: !135, line: 595, baseType: !123, size: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !322, file: !135, line: 596, baseType: !123, size: 32, offset: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !322, file: !135, line: 599, baseType: !123, size: 32, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !322, file: !135, line: 603, baseType: !328, size: 64, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitstream", scope: !315, file: !28, line: 399, baseType: !123, size: 32, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "p_bitstream", scope: !315, file: !28, line: 400, baseType: !328, size: 64, offset: 192)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !315, file: !28, line: 401, baseType: !332, size: 320, offset: 256)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "bs_t", file: !333, line: 56, baseType: !334)
!333 = !DIFile(filename: "x264_src/common/bs.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bs_s", file: !333, line: 47, size: 320, elements: !335)
!335 = !{!336, !337, !338, !339, !343, !344}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !334, file: !333, line: 49, baseType: !328, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !334, file: !333, line: 50, baseType: !328, size: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !334, file: !333, line: 51, baseType: !328, size: 64, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "cur_bits", scope: !334, file: !333, line: 53, baseType: !340, size: 64, offset: 192)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !341, line: 87, baseType: !342)
!341 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!342 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !334, file: !333, line: 54, baseType: !123, size: 32, offset: 256)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "i_bits_encoded", scope: !334, file: !333, line: 55, baseType: !123, size: 32, offset: 288)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer", scope: !136, file: !28, line: 404, baseType: !328, size: 64, offset: 14656)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer_size", scope: !136, file: !28, line: 405, baseType: !123, size: 32, offset: 14720)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !136, file: !28, line: 410, baseType: !123, size: 32, offset: 14752)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !136, file: !28, line: 411, baseType: !123, size: 32, offset: 14784)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_frames", scope: !136, file: !28, line: 413, baseType: !123, size: 32, offset: 14816)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_type", scope: !136, file: !28, line: 415, baseType: !123, size: 32, offset: 14848)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_ref_idc", scope: !136, file: !28, line: 416, baseType: !123, size: 32, offset: 14880)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields", scope: !136, file: !28, line: 418, baseType: !123, size: 32, offset: 14912)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields_last_frame", scope: !136, file: !28, line: 419, baseType: !123, size: 32, offset: 14944)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_duration", scope: !136, file: !28, line: 420, baseType: !123, size: 32, offset: 14976)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields", scope: !136, file: !28, line: 421, baseType: !123, size: 32, offset: 15008)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !136, file: !28, line: 422, baseType: !123, size: 32, offset: 15040)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !136, file: !28, line: 424, baseType: !123, size: 32, offset: 15072)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !136, file: !28, line: 425, baseType: !123, size: 32, offset: 15104)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "b_queued_intra_refresh", scope: !136, file: !28, line: 427, baseType: !123, size: 32, offset: 15136)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "sps_array", scope: !136, file: !28, line: 430, baseType: !361, size: 10400, offset: 15168)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !362, size: 10400, elements: !448)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_sps_t", file: !363, line: 154, baseType: !364)
!363 = !DIFile(filename: "x264_src/common/set.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !363, line: 52, size: 10400, elements: !365)
!365 = !{!366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !383, !384, !385, !386, !387, !388, !389, !390, !391, !398, !399, !447}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !364, file: !363, line: 54, baseType: !123, size: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "i_profile_idc", scope: !364, file: !363, line: 56, baseType: !123, size: 32, offset: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !364, file: !363, line: 57, baseType: !123, size: 32, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set0", scope: !364, file: !363, line: 59, baseType: !123, size: 32, offset: 96)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set1", scope: !364, file: !363, line: 60, baseType: !123, size: 32, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set2", scope: !364, file: !363, line: 61, baseType: !123, size: 32, offset: 160)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_frame_num", scope: !364, file: !363, line: 63, baseType: !123, size: 32, offset: 192)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_type", scope: !364, file: !363, line: 65, baseType: !123, size: 32, offset: 224)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_poc_lsb", scope: !364, file: !363, line: 67, baseType: !123, size: 32, offset: 256)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "b_delta_pic_order_always_zero", scope: !364, file: !363, line: 69, baseType: !123, size: 32, offset: 288)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_non_ref_pic", scope: !364, file: !363, line: 70, baseType: !123, size: 32, offset: 320)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_top_to_bottom_field", scope: !364, file: !363, line: 71, baseType: !123, size: 32, offset: 352)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames_in_poc_cycle", scope: !364, file: !363, line: 72, baseType: !123, size: 32, offset: 384)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_ref_frame", scope: !364, file: !363, line: 73, baseType: !380, size: 8192, offset: 416)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 8192, elements: !381)
!381 = !{!382}
!382 = !DISubrange(count: 256)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames", scope: !364, file: !363, line: 75, baseType: !123, size: 32, offset: 8608)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "b_gaps_in_frame_num_value_allowed", scope: !364, file: !363, line: 76, baseType: !123, size: 32, offset: 8640)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_width", scope: !364, file: !363, line: 77, baseType: !123, size: 32, offset: 8672)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_height", scope: !364, file: !363, line: 78, baseType: !123, size: 32, offset: 8704)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_mbs_only", scope: !364, file: !363, line: 79, baseType: !123, size: 32, offset: 8736)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_adaptive_frame_field", scope: !364, file: !363, line: 80, baseType: !123, size: 32, offset: 8768)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct8x8_inference", scope: !364, file: !363, line: 81, baseType: !123, size: 32, offset: 8800)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "b_crop", scope: !364, file: !363, line: 83, baseType: !123, size: 32, offset: 8832)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !364, file: !363, line: 90, baseType: !392, size: 128, offset: 8864)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !364, file: !363, line: 84, size: 128, elements: !393)
!393 = !{!394, !395, !396, !397}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !392, file: !363, line: 86, baseType: !123, size: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "i_right", scope: !392, file: !363, line: 87, baseType: !123, size: 32, offset: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "i_top", scope: !392, file: !363, line: 88, baseType: !123, size: 32, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "i_bottom", scope: !392, file: !363, line: 89, baseType: !123, size: 32, offset: 96)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "b_vui", scope: !364, file: !363, line: 92, baseType: !123, size: 32, offset: 8992)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !364, file: !363, line: 150, baseType: !400, size: 1344, offset: 9024)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !364, file: !363, line: 93, size: 1344, elements: !401)
!401 = !{!402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !438, !439, !440, !441, !442, !443, !444, !445, !446}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "b_aspect_ratio_info_present", scope: !400, file: !363, line: 95, baseType: !123, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !400, file: !363, line: 96, baseType: !123, size: 32, offset: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !400, file: !363, line: 97, baseType: !123, size: 32, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info_present", scope: !400, file: !363, line: 99, baseType: !123, size: 32, offset: 96)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info", scope: !400, file: !363, line: 100, baseType: !123, size: 32, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "b_signal_type_present", scope: !400, file: !363, line: 102, baseType: !123, size: 32, offset: 160)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !400, file: !363, line: 103, baseType: !123, size: 32, offset: 192)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !400, file: !363, line: 104, baseType: !123, size: 32, offset: 224)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "b_color_description_present", scope: !400, file: !363, line: 105, baseType: !123, size: 32, offset: 256)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !400, file: !363, line: 106, baseType: !123, size: 32, offset: 288)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !400, file: !363, line: 107, baseType: !123, size: 32, offset: 320)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !400, file: !363, line: 108, baseType: !123, size: 32, offset: 352)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_loc_info_present", scope: !400, file: !363, line: 110, baseType: !123, size: 32, offset: 384)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_top", scope: !400, file: !363, line: 111, baseType: !123, size: 32, offset: 416)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_bottom", scope: !400, file: !363, line: 112, baseType: !123, size: 32, offset: 448)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "b_timing_info_present", scope: !400, file: !363, line: 114, baseType: !123, size: 32, offset: 480)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_units_in_tick", scope: !400, file: !363, line: 115, baseType: !71, size: 32, offset: 512)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_scale", scope: !400, file: !363, line: 116, baseType: !71, size: 32, offset: 544)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "b_fixed_frame_rate", scope: !400, file: !363, line: 117, baseType: !123, size: 32, offset: 576)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "b_nal_hrd_parameters_present", scope: !400, file: !363, line: 119, baseType: !123, size: 32, offset: 608)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "b_vcl_hrd_parameters_present", scope: !400, file: !363, line: 120, baseType: !123, size: 32, offset: 640)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "hrd", scope: !400, file: !363, line: 137, baseType: !424, size: 384, offset: 672)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !400, file: !363, line: 122, size: 384, elements: !425)
!425 = !{!426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_cnt", scope: !424, file: !363, line: 124, baseType: !123, size: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_scale", scope: !424, file: !363, line: 125, baseType: !123, size: 32, offset: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_scale", scope: !424, file: !363, line: 126, baseType: !123, size: 32, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_value", scope: !424, file: !363, line: 127, baseType: !123, size: 32, offset: 96)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_value", scope: !424, file: !363, line: 128, baseType: !123, size: 32, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_unscaled", scope: !424, file: !363, line: 129, baseType: !123, size: 32, offset: 160)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_unscaled", scope: !424, file: !363, line: 130, baseType: !123, size: 32, offset: 192)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "b_cbr_hrd", scope: !424, file: !363, line: 131, baseType: !123, size: 32, offset: 224)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "i_initial_cpb_removal_delay_length", scope: !424, file: !363, line: 133, baseType: !123, size: 32, offset: 256)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_removal_delay_length", scope: !424, file: !363, line: 134, baseType: !123, size: 32, offset: 288)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay_length", scope: !424, file: !363, line: 135, baseType: !123, size: 32, offset: 320)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_offset_length", scope: !424, file: !363, line: 136, baseType: !123, size: 32, offset: 352)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct_present", scope: !400, file: !363, line: 139, baseType: !123, size: 32, offset: 1056)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "b_bitstream_restriction", scope: !400, file: !363, line: 140, baseType: !123, size: 32, offset: 1088)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "b_motion_vectors_over_pic_boundaries", scope: !400, file: !363, line: 141, baseType: !123, size: 32, offset: 1120)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bytes_per_pic_denom", scope: !400, file: !363, line: 142, baseType: !123, size: 32, offset: 1152)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bits_per_mb_denom", scope: !400, file: !363, line: 143, baseType: !123, size: 32, offset: 1184)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_horizontal", scope: !400, file: !363, line: 144, baseType: !123, size: 32, offset: 1216)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_vertical", scope: !400, file: !363, line: 145, baseType: !123, size: 32, offset: 1248)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_reorder_frames", scope: !400, file: !363, line: 146, baseType: !123, size: 32, offset: 1280)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dec_frame_buffering", scope: !400, file: !363, line: 147, baseType: !123, size: 32, offset: 1312)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "b_qpprime_y_zero_transform_bypass", scope: !364, file: !363, line: 152, baseType: !123, size: 32, offset: 10368)
!448 = !{!449}
!449 = !DISubrange(count: 1)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !136, file: !28, line: 431, baseType: !451, size: 64, offset: 25600)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "pps_array", scope: !136, file: !28, line: 432, baseType: !453, size: 960, offset: 25664)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !454, size: 960, elements: !448)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pps_t", file: !363, line: 186, baseType: !455)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !363, line: 156, size: 960, elements: !456)
!456 = !{!457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !455, file: !363, line: 158, baseType: !123, size: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !455, file: !363, line: 159, baseType: !123, size: 32, offset: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !455, file: !363, line: 161, baseType: !123, size: 32, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_order", scope: !455, file: !363, line: 163, baseType: !123, size: 32, offset: 96)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_slice_groups", scope: !455, file: !363, line: 164, baseType: !123, size: 32, offset: 128)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_default_active", scope: !455, file: !363, line: 166, baseType: !123, size: 32, offset: 160)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_default_active", scope: !455, file: !363, line: 167, baseType: !123, size: 32, offset: 192)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_pred", scope: !455, file: !363, line: 169, baseType: !123, size: 32, offset: 224)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !455, file: !363, line: 170, baseType: !123, size: 32, offset: 256)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qp", scope: !455, file: !363, line: 172, baseType: !123, size: 32, offset: 288)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qs", scope: !455, file: !363, line: 173, baseType: !123, size: 32, offset: 320)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_index_offset", scope: !455, file: !363, line: 175, baseType: !123, size: 32, offset: 352)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter_control", scope: !455, file: !363, line: 177, baseType: !123, size: 32, offset: 384)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra_pred", scope: !455, file: !363, line: 178, baseType: !123, size: 32, offset: 416)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "b_redundant_pic_cnt", scope: !455, file: !363, line: 179, baseType: !123, size: 32, offset: 448)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8_mode", scope: !455, file: !363, line: 181, baseType: !123, size: 32, offset: 480)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !455, file: !363, line: 183, baseType: !123, size: 32, offset: 512)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !455, file: !363, line: 184, baseType: !475, size: 384, offset: 576)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !476, size: 384, elements: !478)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !84)
!478 = !{!479}
!479 = !DISubrange(count: 6)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !136, file: !28, line: 433, baseType: !481, size: 64, offset: 26624)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !136, file: !28, line: 434, baseType: !123, size: 32, offset: 26688)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts_compress_multiplier", scope: !136, file: !28, line: 437, baseType: !123, size: 32, offset: 26720)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_mf", scope: !136, file: !28, line: 440, baseType: !485, size: 256, offset: 26752)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !486, size: 256, elements: !87)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 512, elements: !187)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_mf", scope: !136, file: !28, line: 441, baseType: !489, size: 128, offset: 27008)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !490, size: 128, elements: !80)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 2048, elements: !194)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "unquant4_mf", scope: !136, file: !28, line: 443, baseType: !485, size: 256, offset: 27136)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "unquant8_mf", scope: !136, file: !28, line: 444, baseType: !489, size: 128, offset: 27392)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_mf", scope: !136, file: !28, line: 446, baseType: !495, size: 256, offset: 27520)
!495 = !DICompositeType(tag: DW_TAG_array_type, baseType: !496, size: 256, elements: !87)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 256, elements: !187)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_mf", scope: !136, file: !28, line: 447, baseType: !499, size: 128, offset: 27776)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !500, size: 128, elements: !80)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 1024, elements: !194)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_bias", scope: !136, file: !28, line: 448, baseType: !495, size: 256, offset: 27904)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_bias", scope: !136, file: !28, line: 449, baseType: !499, size: 128, offset: 28160)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv", scope: !136, file: !28, line: 454, baseType: !505, size: 5888, offset: 28288)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !506, size: 5888, elements: !507)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!507 = !{!508}
!508 = !DISubrange(count: 92)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv_fpel", scope: !136, file: !28, line: 455, baseType: !510, size: 23552, offset: 34176)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !506, size: 23552, elements: !511)
!511 = !{!508, !88}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !136, file: !28, line: 457, baseType: !476, size: 64, offset: 57728)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !136, file: !28, line: 460, baseType: !514, size: 53376, offset: 57856)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_slice_header_t", file: !28, line: 364, baseType: !515)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !28, line: 302, size: 53376, elements: !516)
!516 = !{!517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !545, !570, !571, !572, !578, !579, !580, !581, !582, !583, !584, !585}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !515, file: !28, line: 304, baseType: !451, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !515, file: !28, line: 305, baseType: !481, size: 64, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !515, file: !28, line: 307, baseType: !123, size: 32, offset: 128)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "i_first_mb", scope: !515, file: !28, line: 308, baseType: !123, size: 32, offset: 160)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_mb", scope: !515, file: !28, line: 309, baseType: !123, size: 32, offset: 192)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "i_pps_id", scope: !515, file: !28, line: 311, baseType: !123, size: 32, offset: 224)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !515, file: !28, line: 313, baseType: !123, size: 32, offset: 256)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "b_mbaff", scope: !515, file: !28, line: 315, baseType: !123, size: 32, offset: 288)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "b_field_pic", scope: !515, file: !28, line: 316, baseType: !123, size: 32, offset: 320)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "b_bottom_field", scope: !515, file: !28, line: 317, baseType: !123, size: 32, offset: 352)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !515, file: !28, line: 319, baseType: !123, size: 32, offset: 384)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !515, file: !28, line: 321, baseType: !123, size: 32, offset: 416)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc_bottom", scope: !515, file: !28, line: 322, baseType: !123, size: 32, offset: 448)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc", scope: !515, file: !28, line: 324, baseType: !240, size: 64, offset: 480)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "i_redundant_pic_cnt", scope: !515, file: !28, line: 325, baseType: !123, size: 32, offset: 544)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_spatial_mv_pred", scope: !515, file: !28, line: 327, baseType: !123, size: 32, offset: 576)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "b_num_ref_idx_override", scope: !515, file: !28, line: 329, baseType: !123, size: 32, offset: 608)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !515, file: !28, line: 330, baseType: !123, size: 32, offset: 640)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !515, file: !28, line: 331, baseType: !123, size: 32, offset: 672)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l0", scope: !515, file: !28, line: 333, baseType: !123, size: 32, offset: 704)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l1", scope: !515, file: !28, line: 334, baseType: !123, size: 32, offset: 736)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_order", scope: !515, file: !28, line: 339, baseType: !539, size: 2048, offset: 768)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !540, size: 2048, elements: !544)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !515, file: !28, line: 335, size: 64, elements: !541)
!541 = !{!542, !543}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "idc", scope: !540, file: !28, line: 337, baseType: !123, size: 32)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !540, file: !28, line: 338, baseType: !123, size: 32, offset: 32)
!544 = !{!81, !188}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !515, file: !28, line: 342, baseType: !546, size: 49152, offset: 2816)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !547, size: 49152, elements: !567)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_weight_t", file: !548, line: 36, baseType: !549, align: 128)
!548 = !DIFile(filename: "x264_src/common/mc.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_weight_t", file: !548, line: 26, size: 512, elements: !550)
!550 = !{!551, !553, !554, !557, !558, !559}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "cachea", scope: !549, file: !548, line: 30, baseType: !552, size: 128, align: 128)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 128, elements: !118)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "cacheb", scope: !549, file: !548, line: 31, baseType: !552, size: 128, offset: 128)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "i_denom", scope: !549, file: !548, line: 32, baseType: !555, size: 32, offset: 256)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !94, line: 26, baseType: !556)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !74, line: 41, baseType: !123)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "i_scale", scope: !549, file: !548, line: 33, baseType: !555, size: 32, offset: 288)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset", scope: !549, file: !548, line: 34, baseType: !555, size: 32, offset: 320)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "weightfn", scope: !549, file: !548, line: 35, baseType: !560, size: 64, offset: 384)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "weight_fn_t", file: !548, line: 25, baseType: !562)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{null, !328, !123, !328, !123, !565, !123}
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !549)
!567 = !{!568, !569}
!568 = !DISubrange(count: 32)
!569 = !DISubrange(count: 3)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_remove_from_end", scope: !515, file: !28, line: 344, baseType: !123, size: 32, offset: 51968)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_command_count", scope: !515, file: !28, line: 345, baseType: !123, size: 32, offset: 52000)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "mmco", scope: !515, file: !28, line: 350, baseType: !573, size: 1024, offset: 52032)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !574, size: 1024, elements: !187)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !515, file: !28, line: 346, size: 64, elements: !575)
!575 = !{!576, !577}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "i_difference_of_pic_nums", scope: !574, file: !28, line: 348, baseType: !123, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !574, file: !28, line: 349, baseType: !123, size: 32, offset: 32)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !515, file: !28, line: 352, baseType: !123, size: 32, offset: 53056)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !515, file: !28, line: 354, baseType: !123, size: 32, offset: 53088)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_delta", scope: !515, file: !28, line: 355, baseType: !123, size: 32, offset: 53120)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "b_sp_for_swidth", scope: !515, file: !28, line: 356, baseType: !123, size: 32, offset: 53152)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "i_qs_delta", scope: !515, file: !28, line: 357, baseType: !123, size: 32, offset: 53184)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "i_disable_deblocking_filter_idc", scope: !515, file: !28, line: 360, baseType: !123, size: 32, offset: 53216)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "i_alpha_c0_offset", scope: !515, file: !28, line: 361, baseType: !123, size: 32, offset: 53248)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "i_beta_offset", scope: !515, file: !28, line: 362, baseType: !123, size: 32, offset: 53280)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !136, file: !28, line: 463, baseType: !587, size: 4096, offset: 111232)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_cabac_t", file: !588, line: 46, baseType: !589)
!588 = !DIFile(filename: "x264_src/common/cabac.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !588, line: 27, size: 4096, elements: !590)
!590 = !{!591, !592, !593, !594, !595, !596, !597, !598, !599}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "i_low", scope: !589, file: !588, line: 30, baseType: !123, size: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "i_range", scope: !589, file: !588, line: 31, baseType: !123, size: 32, offset: 32)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "i_queue", scope: !589, file: !588, line: 34, baseType: !123, size: 32, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "i_bytes_outstanding", scope: !589, file: !588, line: 35, baseType: !123, size: 32, offset: 96)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !589, file: !588, line: 37, baseType: !328, size: 64, offset: 128)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !589, file: !588, line: 38, baseType: !328, size: 64, offset: 192)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !589, file: !588, line: 39, baseType: !328, size: 64, offset: 256)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "f8_bits_encoded", scope: !589, file: !588, line: 42, baseType: !123, size: 32, align: 128, offset: 384)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !589, file: !588, line: 45, baseType: !600, size: 3680, offset: 416)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 3680, elements: !601)
!601 = !{!602}
!602 = !DISubrange(count: 460)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !136, file: !28, line: 494, baseType: !604, size: 2112, offset: 115328)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !136, file: !28, line: 465, size: 2112, elements: !605)
!605 = !{!606, !744, !746, !747, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !760, !761, !762, !763}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !604, file: !28, line: 468, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_frame_t", file: !610, line: 146, baseType: !611)
!610 = !DIFile(filename: "x264_src/common/frame.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_frame", file: !610, line: 31, size: 125056, elements: !612)
!612 = !{!613, !614, !615, !616, !619, !620, !621, !622, !623, !624, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !643, !644, !645, !646, !647, !648, !650, !652, !653, !654, !655, !656, !659, !661, !662, !664, !669, !670, !674, !675, !679, !683, !686, !688, !689, !691, !692, !694, !695, !696, !699, !701, !702, !703, !705, !706, !707, !708, !709, !710, !711, !712, !714, !715, !716, !725, !729, !731, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !611, file: !610, line: 34, baseType: !123, size: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !611, file: !610, line: 35, baseType: !123, size: 32, offset: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !611, file: !610, line: 36, baseType: !123, size: 32, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !611, file: !610, line: 37, baseType: !617, size: 64, offset: 128)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !94, line: 27, baseType: !618)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !74, line: 44, baseType: !342)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts", scope: !611, file: !610, line: 38, baseType: !617, size: 64, offset: 192)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "i_duration", scope: !611, file: !610, line: 39, baseType: !123, size: 32, offset: 256)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_duration", scope: !611, file: !610, line: 40, baseType: !123, size: 32, offset: 288)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !611, file: !610, line: 41, baseType: !123, size: 32, offset: 320)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay", scope: !611, file: !610, line: 42, baseType: !123, size: 32, offset: 352)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !611, file: !610, line: 43, baseType: !625, size: 64, offset: 384)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !611, file: !610, line: 45, baseType: !123, size: 32, offset: 448)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded", scope: !611, file: !610, line: 46, baseType: !123, size: 32, offset: 480)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "i_field_cnt", scope: !611, file: !610, line: 47, baseType: !123, size: 32, offset: 512)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !611, file: !610, line: 48, baseType: !123, size: 32, offset: 544)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "b_kept_as_ref", scope: !611, file: !610, line: 49, baseType: !123, size: 32, offset: 576)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_struct", scope: !611, file: !610, line: 50, baseType: !123, size: 32, offset: 608)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "b_keyframe", scope: !611, file: !610, line: 51, baseType: !123, size: 32, offset: 640)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "b_fdec", scope: !611, file: !610, line: 52, baseType: !84, size: 8, offset: 672)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_minigop_bframe", scope: !611, file: !610, line: 53, baseType: !84, size: 8, offset: 680)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframes", scope: !611, file: !610, line: 54, baseType: !84, size: 8, offset: 688)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_rc", scope: !611, file: !610, line: 55, baseType: !236, size: 32, offset: 704)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_aq", scope: !611, file: !610, line: 56, baseType: !236, size: 32, offset: 736)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_l0ref0", scope: !611, file: !610, line: 57, baseType: !123, size: 32, offset: 768)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !611, file: !610, line: 60, baseType: !123, size: 32, offset: 800)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !611, file: !610, line: 61, baseType: !641, size: 96, offset: 832)
!641 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 96, elements: !642)
!642 = !{!569}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !611, file: !610, line: 62, baseType: !641, size: 96, offset: 928)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines", scope: !611, file: !610, line: 63, baseType: !641, size: 96, offset: 1024)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride_lowres", scope: !611, file: !610, line: 64, baseType: !123, size: 32, offset: 1120)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "i_width_lowres", scope: !611, file: !610, line: 65, baseType: !123, size: 32, offset: 1152)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_lowres", scope: !611, file: !610, line: 66, baseType: !123, size: 32, offset: 1184)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !611, file: !610, line: 67, baseType: !649, size: 192, offset: 1216)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 192, elements: !642)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "filtered", scope: !611, file: !610, line: 68, baseType: !651, size: 256, offset: 1408)
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 256, elements: !87)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !611, file: !610, line: 69, baseType: !651, size: 256, offset: 1664)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "integral", scope: !611, file: !610, line: 70, baseType: !506, size: 64, offset: 1920)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !611, file: !610, line: 74, baseType: !651, size: 256, offset: 1984)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_lowres", scope: !611, file: !610, line: 75, baseType: !651, size: 256, offset: 2240)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !611, file: !610, line: 77, baseType: !657, size: 24576, offset: 2560)
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !547, size: 24576, elements: !658)
!658 = !{!188, !569}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "weighted", scope: !611, file: !610, line: 78, baseType: !660, size: 1024, offset: 27136)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 1024, elements: !187)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "b_duplicate", scope: !611, file: !610, line: 79, baseType: !123, size: 32, offset: 28160)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !611, file: !610, line: 80, baseType: !663, size: 64, offset: 28224)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !611, file: !610, line: 83, baseType: !665, size: 64, offset: 28288)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !94, line: 24, baseType: !667)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !74, line: 37, baseType: !668)
!668 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "mb_partition", scope: !611, file: !610, line: 84, baseType: !328, size: 64, offset: 28352)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !611, file: !610, line: 85, baseType: !671, size: 128, offset: 28416)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !672, size: 128, elements: !80)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 32, elements: !80)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "mv16x16", scope: !611, file: !610, line: 86, baseType: !672, size: 64, offset: 28544)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mvs", scope: !611, file: !610, line: 87, baseType: !676, size: 2176, offset: 28608)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !672, size: 2176, elements: !677)
!677 = !{!81, !678}
!678 = !DISubrange(count: 17)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_costs", scope: !611, file: !610, line: 92, baseType: !680, size: 20736, offset: 30784)
!680 = !DICompositeType(tag: DW_TAG_array_type, baseType: !506, size: 20736, elements: !681)
!681 = !{!682, !682}
!682 = !DISubrange(count: 18)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mv_costs", scope: !611, file: !610, line: 96, baseType: !684, size: 2176, offset: 51520)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !685, size: 2176, elements: !677)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !611, file: !610, line: 97, baseType: !687, size: 128, offset: 53696)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !665, size: 128, elements: !80)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref", scope: !611, file: !610, line: 98, baseType: !240, size: 64, offset: 53824)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc", scope: !611, file: !610, line: 99, baseType: !690, size: 1024, offset: 53888)
!690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 1024, elements: !544)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "inv_ref_poc", scope: !611, file: !610, line: 100, baseType: !673, size: 32, offset: 54912)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est", scope: !611, file: !610, line: 105, baseType: !693, size: 10368, offset: 54944)
!693 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 10368, elements: !681)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est_aq", scope: !611, file: !610, line: 106, baseType: !693, size: 10368, offset: 65312)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "i_satd", scope: !611, file: !610, line: 107, baseType: !123, size: 32, offset: 75680)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_mbs", scope: !611, file: !610, line: 108, baseType: !697, size: 576, offset: 75712)
!697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 576, elements: !698)
!698 = !{!682}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satds", scope: !611, file: !610, line: 109, baseType: !700, size: 20736, offset: 76288)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !685, size: 20736, elements: !681)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satd", scope: !611, file: !610, line: 110, baseType: !685, size: 64, offset: 97024)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_bits", scope: !611, file: !610, line: 111, baseType: !685, size: 64, offset: 97088)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "f_row_qp", scope: !611, file: !610, line: 112, baseType: !704, size: 64, offset: 97152)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset", scope: !611, file: !610, line: 113, baseType: !704, size: 64, offset: 97216)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset_aq", scope: !611, file: !610, line: 114, baseType: !704, size: 64, offset: 97280)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_calculated", scope: !611, file: !610, line: 115, baseType: !123, size: 32, offset: 97344)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !611, file: !610, line: 116, baseType: !506, size: 64, offset: 97408)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "i_propagate_cost", scope: !611, file: !610, line: 117, baseType: !506, size: 64, offset: 97472)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "i_inv_qscale_factor", scope: !611, file: !610, line: 118, baseType: !506, size: 64, offset: 97536)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "b_scenecut", scope: !611, file: !610, line: 119, baseType: !123, size: 32, offset: 97600)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "f_weighted_cost_delta", scope: !611, file: !610, line: 120, baseType: !713, size: 576, offset: 97632)
!713 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 576, elements: !698)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_sum", scope: !611, file: !610, line: 121, baseType: !71, size: 32, offset: 98208)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_ssd", scope: !611, file: !610, line: 122, baseType: !109, size: 64, offset: 98240)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "hrd_timing", scope: !611, file: !610, line: 125, baseType: !717, size: 256, offset: 98304)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_hrd_t", file: !135, line: 503, baseType: !718)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !135, line: 496, size: 256, elements: !719)
!719 = !{!720, !722, !723, !724}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_initial_arrival_time", scope: !718, file: !135, line: 498, baseType: !721, size: 64)
!721 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_final_arrival_time", scope: !718, file: !135, line: 499, baseType: !721, size: 64, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_time", scope: !718, file: !135, line: 500, baseType: !721, size: 64, offset: 128)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_time", scope: !718, file: !135, line: 502, baseType: !721, size: 64, offset: 192)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_type", scope: !611, file: !610, line: 128, baseType: !726, size: 2008, offset: 98560)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 2008, elements: !727)
!727 = !{!728}
!728 = !DISubrange(count: 251)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_satd", scope: !611, file: !610, line: 129, baseType: !730, size: 8032, offset: 100576)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 8032, elements: !727)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "f_planned_cpb_duration", scope: !611, file: !610, line: 130, baseType: !732, size: 16064, offset: 108608)
!732 = !DICompositeType(tag: DW_TAG_array_type, baseType: !721, size: 16064, elements: !727)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !611, file: !610, line: 131, baseType: !123, size: 32, offset: 124672)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !611, file: !610, line: 132, baseType: !123, size: 32, offset: 124704)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_completed", scope: !611, file: !610, line: 135, baseType: !123, size: 32, offset: 124736)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_weighted", scope: !611, file: !610, line: 136, baseType: !123, size: 32, offset: 124768)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "i_reference_count", scope: !611, file: !610, line: 137, baseType: !123, size: 32, offset: 124800)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !611, file: !610, line: 138, baseType: !123, size: 32, offset: 124832)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !611, file: !610, line: 139, baseType: !123, size: 32, offset: 124864)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "f_pir_position", scope: !611, file: !610, line: 142, baseType: !236, size: 32, offset: 124896)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_start_col", scope: !611, file: !610, line: 143, baseType: !123, size: 32, offset: 124928)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_end_col", scope: !611, file: !610, line: 144, baseType: !123, size: 32, offset: 124960)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "i_frames_since_pir", scope: !611, file: !610, line: 145, baseType: !123, size: 32, offset: 124992)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !604, file: !28, line: 470, baseType: !745, size: 128, offset: 64)
!745 = !DICompositeType(tag: DW_TAG_array_type, baseType: !607, size: 128, elements: !80)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "blank_unused", scope: !604, file: !28, line: 473, baseType: !607, size: 64, offset: 192)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !604, file: !28, line: 476, baseType: !748, size: 1152, offset: 256)
!748 = !DICompositeType(tag: DW_TAG_array_type, baseType: !608, size: 1152, elements: !698)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_keyframe", scope: !604, file: !28, line: 478, baseType: !123, size: 32, offset: 1408)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "i_input", scope: !604, file: !28, line: 480, baseType: !123, size: 32, offset: 1440)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dpb", scope: !604, file: !28, line: 482, baseType: !123, size: 32, offset: 1472)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref0", scope: !604, file: !28, line: 483, baseType: !123, size: 32, offset: 1504)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref1", scope: !604, file: !28, line: 484, baseType: !123, size: 32, offset: 1536)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "i_delay", scope: !604, file: !28, line: 485, baseType: !123, size: 32, offset: 1568)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay", scope: !604, file: !28, line: 486, baseType: !123, size: 32, offset: 1600)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay_time", scope: !604, file: !28, line: 487, baseType: !617, size: 64, offset: 1664)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "i_init_delta", scope: !604, file: !28, line: 488, baseType: !617, size: 64, offset: 1728)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_reordered_pts", scope: !604, file: !28, line: 489, baseType: !759, size: 128, offset: 1792)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !617, size: 128, elements: !80)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "i_largest_pts", scope: !604, file: !28, line: 490, baseType: !617, size: 64, offset: 1920)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "i_second_largest_pts", scope: !604, file: !28, line: 491, baseType: !617, size: 64, offset: 1984)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_lowres", scope: !604, file: !28, line: 492, baseType: !123, size: 32, offset: 2048)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_sub8x8_esa", scope: !604, file: !28, line: 493, baseType: !123, size: 32, offset: 2080)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "fenc", scope: !136, file: !28, line: 497, baseType: !608, size: 64, offset: 117440)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "fdec", scope: !136, file: !28, line: 500, baseType: !608, size: 64, offset: 117504)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref0", scope: !136, file: !28, line: 503, baseType: !123, size: 32, offset: 117568)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "fref0", scope: !136, file: !28, line: 504, baseType: !768, size: 1216, offset: 117632)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !608, size: 1216, elements: !769)
!769 = !{!770}
!770 = !DISubrange(count: 19)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref1", scope: !136, file: !28, line: 505, baseType: !123, size: 32, offset: 118848)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "fref1", scope: !136, file: !28, line: 506, baseType: !768, size: 1216, offset: 118912)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_reorder", scope: !136, file: !28, line: 507, baseType: !240, size: 64, offset: 120128)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay", scope: !136, file: !28, line: 510, baseType: !123, size: 32, offset: 120192)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_offset", scope: !136, file: !28, line: 511, baseType: !123, size: 32, offset: 120224)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts_delay", scope: !136, file: !28, line: 512, baseType: !617, size: 64, offset: 120256)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "dct", scope: !136, file: !28, line: 522, baseType: !778, size: 10624, offset: 120320)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !136, file: !28, line: 515, size: 10624, elements: !779)
!779 = !{!780, !782, !785, !788}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "luma16x16_dc", scope: !778, file: !28, line: 517, baseType: !781, size: 256, align: 128)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 256, elements: !187)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_dc", scope: !778, file: !28, line: 518, baseType: !783, size: 128, align: 128, offset: 256)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 128, elements: !784)
!784 = !{!81, !88}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "luma8x8", scope: !778, file: !28, line: 520, baseType: !786, size: 4096, align: 128, offset: 384)
!786 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 4096, elements: !787)
!787 = !{!88, !195}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "luma4x4", scope: !778, file: !28, line: 521, baseType: !789, size: 6144, align: 128, offset: 4480)
!789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 6144, elements: !790)
!790 = !{!791, !188}
!791 = !DISubrange(count: 24)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !136, file: !28, line: 732, baseType: !793, size: 82688, offset: 130944)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !136, file: !28, line: 525, size: 82688, elements: !794)
!794 = !{!795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !822, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !840, !843, !847, !848, !849, !854, !855, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !923, !954, !955, !956, !957, !958, !959, !960, !961, !962, !965, !966, !967, !970, !973, !975, !978, !980, !981}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !793, file: !28, line: 527, baseType: !123, size: 32)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_stride", scope: !793, file: !28, line: 530, baseType: !123, size: 32, offset: 32)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_stride", scope: !793, file: !28, line: 531, baseType: !123, size: 32, offset: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_stride", scope: !793, file: !28, line: 532, baseType: !123, size: 32, offset: 96)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_x", scope: !793, file: !28, line: 535, baseType: !123, size: 32, offset: 128)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_y", scope: !793, file: !28, line: 536, baseType: !123, size: 32, offset: 160)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_xy", scope: !793, file: !28, line: 537, baseType: !123, size: 32, offset: 192)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_xy", scope: !793, file: !28, line: 538, baseType: !123, size: 32, offset: 224)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_xy", scope: !793, file: !28, line: 539, baseType: !123, size: 32, offset: 256)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !793, file: !28, line: 542, baseType: !123, size: 32, offset: 288)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !793, file: !28, line: 543, baseType: !123, size: 32, offset: 320)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !793, file: !28, line: 544, baseType: !123, size: 32, offset: 352)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "b_trellis", scope: !793, file: !28, line: 545, baseType: !123, size: 32, offset: 384)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "b_noise_reduction", scope: !793, file: !28, line: 546, baseType: !123, size: 32, offset: 416)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !793, file: !28, line: 547, baseType: !123, size: 32, offset: 448)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_rd", scope: !793, file: !28, line: 548, baseType: !123, size: 32, offset: 480)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_trellis", scope: !793, file: !28, line: 549, baseType: !123, size: 32, offset: 512)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !793, file: !28, line: 551, baseType: !123, size: 32, offset: 544)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min", scope: !793, file: !28, line: 554, baseType: !240, size: 64, offset: 576)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max", scope: !793, file: !28, line: 555, baseType: !240, size: 64, offset: 640)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_spel", scope: !793, file: !28, line: 558, baseType: !240, size: 64, offset: 704)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_spel", scope: !793, file: !28, line: 559, baseType: !240, size: 64, offset: 768)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_fpel", scope: !793, file: !28, line: 561, baseType: !240, size: 64, offset: 832)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_fpel", scope: !793, file: !28, line: 562, baseType: !240, size: 64, offset: 896)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour", scope: !793, file: !28, line: 565, baseType: !7, size: 32, offset: 960)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour8", scope: !793, file: !28, line: 566, baseType: !821, size: 128, offset: 992)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128, elements: !87)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour4", scope: !793, file: !28, line: 567, baseType: !823, size: 512, offset: 1120)
!823 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 512, elements: !187)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_intra", scope: !793, file: !28, line: 568, baseType: !7, size: 32, offset: 1632)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_frame", scope: !793, file: !28, line: 569, baseType: !7, size: 32, offset: 1664)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_top", scope: !793, file: !28, line: 570, baseType: !123, size: 32, offset: 1696)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_left", scope: !793, file: !28, line: 571, baseType: !123, size: 32, offset: 1728)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topleft", scope: !793, file: !28, line: 572, baseType: !123, size: 32, offset: 1760)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topright", scope: !793, file: !28, line: 573, baseType: !123, size: 32, offset: 1792)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_prev_xy", scope: !793, file: !28, line: 574, baseType: !123, size: 32, offset: 1824)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_left_xy", scope: !793, file: !28, line: 575, baseType: !123, size: 32, offset: 1856)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_top_xy", scope: !793, file: !28, line: 576, baseType: !123, size: 32, offset: 1888)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topleft_xy", scope: !793, file: !28, line: 577, baseType: !123, size: 32, offset: 1920)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topright_xy", scope: !793, file: !28, line: 578, baseType: !123, size: 32, offset: 1952)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !793, file: !28, line: 585, baseType: !665, size: 64, offset: 1984)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "partition", scope: !793, file: !28, line: 586, baseType: !328, size: 64, offset: 2048)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !793, file: !28, line: 587, baseType: !665, size: 64, offset: 2112)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !793, file: !28, line: 588, baseType: !839, size: 64, offset: 2176)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !793, file: !28, line: 589, baseType: !841, size: 64, offset: 2240)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DICompositeType(tag: DW_TAG_array_type, baseType: !666, size: 64, elements: !118)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !793, file: !28, line: 591, baseType: !844, size: 64, offset: 2304)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 192, elements: !846)
!846 = !{!791}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_pred_mode", scope: !793, file: !28, line: 592, baseType: !665, size: 64, offset: 2368)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !793, file: !28, line: 593, baseType: !671, size: 128, offset: 2432)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !793, file: !28, line: 594, baseType: !850, size: 128, offset: 2560)
!850 = !DICompositeType(tag: DW_TAG_array_type, baseType: !851, size: 128, elements: !80)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 128, elements: !853)
!853 = !{!119, !81}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !793, file: !28, line: 595, baseType: !687, size: 128, offset: 2688)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "mvr", scope: !793, file: !28, line: 596, baseType: !856, size: 4096, offset: 2816)
!856 = !DICompositeType(tag: DW_TAG_array_type, baseType: !672, size: 4096, elements: !857)
!857 = !{!81, !568}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "skipbp", scope: !793, file: !28, line: 597, baseType: !665, size: 64, offset: 6912)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "mb_transform_size", scope: !793, file: !28, line: 598, baseType: !665, size: 64, offset: 6976)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "slice_table", scope: !793, file: !28, line: 599, baseType: !506, size: 64, offset: 7040)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "p_weight_buf", scope: !793, file: !28, line: 603, baseType: !660, size: 1024, offset: 7104)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !793, file: !28, line: 606, baseType: !123, size: 32, offset: 8128)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "i_partition", scope: !793, file: !28, line: 607, baseType: !123, size: 32, offset: 8160)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "i_sub_partition", scope: !793, file: !28, line: 608, baseType: !83, size: 32, align: 32, offset: 8192)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !793, file: !28, line: 609, baseType: !123, size: 32, offset: 8224)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_luma", scope: !793, file: !28, line: 611, baseType: !123, size: 32, offset: 8256)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_chroma", scope: !793, file: !28, line: 612, baseType: !123, size: 32, offset: 8288)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra16x16_pred_mode", scope: !793, file: !28, line: 614, baseType: !123, size: 32, offset: 8320)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_pred_mode", scope: !793, file: !28, line: 615, baseType: !123, size: 32, offset: 8352)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "i_skip_intra", scope: !793, file: !28, line: 621, baseType: !123, size: 32, offset: 8384)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "b_skip_mc", scope: !793, file: !28, line: 624, baseType: !123, size: 32, offset: 8416)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "b_reencode_mb", scope: !793, file: !28, line: 626, baseType: !123, size: 32, offset: 8448)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "ip_offset", scope: !793, file: !28, line: 627, baseType: !123, size: 32, offset: 8480)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "pic", scope: !793, file: !28, line: 671, baseType: !875, size: 60672, offset: 8576)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !793, file: !28, line: 629, size: 60672, elements: !876)
!876 = !{!877, !881, !885, !887, !888, !891, !895, !897, !898, !899, !900, !901, !904, !908, !911, !912, !913, !914, !915, !918, !920, !922}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_buf", scope: !875, file: !28, line: 634, baseType: !878, size: 3072, align: 128)
!878 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 3072, elements: !879)
!879 = !{!880}
!880 = !DISubrange(count: 384)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "fdec_buf", scope: !875, file: !28, line: 635, baseType: !882, size: 6912, align: 128, offset: 3072)
!882 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 6912, elements: !883)
!883 = !{!884}
!884 = !DISubrange(count: 864)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_fdec_buf", scope: !875, file: !28, line: 638, baseType: !886, size: 2048, align: 128, offset: 9984)
!886 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 2048, elements: !381)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_fdec_buf", scope: !875, file: !28, line: 639, baseType: !886, size: 2048, align: 128, offset: 12032)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_dct_buf", scope: !875, file: !28, line: 640, baseType: !889, size: 3072, align: 128, offset: 14080)
!889 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 3072, elements: !890)
!890 = !{!569, !195}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_dct_buf", scope: !875, file: !28, line: 641, baseType: !892, size: 3840, align: 128, offset: 17152)
!892 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 3840, elements: !893)
!893 = !{!894, !188}
!894 = !DISubrange(count: 15)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_nnz_buf", scope: !875, file: !28, line: 642, baseType: !896, size: 128, offset: 20992)
!896 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 128, elements: !87)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_nnz_buf", scope: !875, file: !28, line: 643, baseType: !896, size: 128, offset: 21120)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_cbp", scope: !875, file: !28, line: 644, baseType: !123, size: 32, offset: 21248)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_cbp", scope: !875, file: !28, line: 645, baseType: !123, size: 32, offset: 21280)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct8", scope: !875, file: !28, line: 648, baseType: !786, size: 4096, align: 128, offset: 21376)
