; ModuleID = 'x264_src/common/deblock.c'
source_filename = "x264_src/common/deblock.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.x264_t = type { %struct.x264_param_t, [129 x %struct.x264_t*], i32, i32, i32, i32, i32, %struct.anon.2, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1 x %struct.x264_sps_t], %struct.x264_sps_t*, [1 x %struct.x264_pps_t], %struct.x264_pps_t*, i32, i32, [4 x [16 x i32]*], [2 x [64 x i32]*], [4 x [16 x i32]*], [2 x [64 x i32]*], [4 x [16 x i16]*], [2 x [64 x i16]*], [4 x [16 x i16]*], [2 x [64 x i16]*], [92 x i16*], [92 x [4 x i16*]], i8*, [8 x i8], %struct.x264_slice_header_t, %struct.x264_cabac_t, %struct.anon.8, %struct.x264_frame*, %struct.x264_frame*, i32, [19 x %struct.x264_frame*], i32, [19 x %struct.x264_frame*], [2 x i32], i32, i32, i64, %struct.anon.9, %struct.anon.10, %struct.x264_ratecontrol_t*, %struct.anon.13, [2 x [64 x i32]], [2 x [64 x i16]], [2 x i32], i8*, [2 x [3 x i8*]], [2 x [2 x [4 x [4 x i8]]]*], [7 x void (i8*)*], [7 x void (i8*)*], [12 x void (i8*, i8*)*], [12 x void (i8*)*], void (i8*, i8*, i32, i32)*, %struct.x264_pixel_function_t, %struct.x264_mc_functions_t, %struct.x264_dct_function_t, %struct.x264_zigzag_function_t, %struct.x264_quant_function_t, %struct.x264_deblock_function_t, %struct.x264_lookahead_t*, [8 x i8] }

!32 = !DIEnumerator(name: "MB_TOP", value: 2, isUnsigned: true)
!33 = !DIEnumerator(name: "MB_TOPRIGHT", value: 4, isUnsigned: true)
!34 = !DIEnumerator(name: "MB_TOPLEFT", value: 8, isUnsigned: true)
!35 = !DIEnumerator(name: "MB_PRIVATE", value: 16, isUnsigned: true)
!36 = !DIEnumerator(name: "ALL_NEIGHBORS", value: 15, isUnsigned: true)
!37 = !{!38, !46, !49}
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 192, elements: !44)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !41, line: 26, baseType: !42)
!41 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !43, line: 42, baseType: !7)
!43 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!44 = !{!45}
!45 = !DISubrange(count: 6)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !41, line: 25, baseType: !47)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !43, line: 40, baseType: !48)
!48 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_union32_t", file: !51, line: 89, baseType: !52)
!51 = !DIFile(filename: "x264_src/common/common.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!52 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !51, line: 89, size: 32, elements: !53)
!53 = !{!54, !55, !59}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !52, file: !51, line: 89, baseType: !40, size: 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !52, file: !51, line: 89, baseType: !56, size: 32)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 32, elements: !57)
!57 = !{!58}
!58 = !DISubrange(count: 2)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !52, file: !51, line: 89, baseType: !60, size: 32)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 32, elements: !64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !41, line: 24, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !43, line: 38, baseType: !63)
!63 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!64 = !{!65}
!65 = !DISubrange(count: 4)
!66 = !{!0, !67, !73}
!67 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression())
!68 = distinct !DIGlobalVariable(name: "i_beta_table", scope: !2, file: !3, line: 79, type: !69, isLocal: true, isDefinition: true)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 608, elements: !71)
!70 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!71 = !{!72}
!72 = !DISubrange(count: 76)
!73 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression())
!74 = distinct !DIGlobalVariable(name: "i_tc0_table", scope: !2, file: !3, line: 90, type: !75, isLocal: true, isDefinition: true)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 2432, elements: !81)
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !77)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !78, line: 24, baseType: !79)
!78 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !43, line: 37, baseType: !80)
!80 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!81 = !{!72, !65}
!82 = !{i32 7, !"Dwarf Version", i32 4}
!83 = !{i32 2, !"Debug Info Version", i32 3}
!84 = !{i32 1, !"wchar_size", i32 4}
!85 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!86 = distinct !DISubprogram(name: "x264_frame_deblock_row", scope: !3, file: !3, line: 339, type: !87, scopeLine: 340, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !1381)
!87 = !DISubroutineType(types: !88)
!88 = !{null, !89, !100}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_t", file: !91, line: 46, baseType: !92)
!91 = !DIFile(filename: "x264_src/x264.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_t", file: !51, line: 381, size: 266752, elements: !93)
!93 = !{!94, !263, !267, !268, !269, !270, !271, !272, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !408, !410, !435, !437, !438, !439, !443, !447, !448, !449, !453, !457, !458, !459, !464, !467, !468, !546, !563, !724, !725, !726, !727, !731, !732, !733, !734, !735, !736, !737, !752, !945, !949, !1010, !1013, !1015, !1017, !1018, !1021, !1026, !1035, !1036, !1044, !1046, !1051, !1127, !1213, !1257, !1279, !1328, !1357}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !92, file: !51, line: 384, baseType: !95, size: 5632)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !91, line: 376, baseType: !96)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !91, line: 176, size: 5632, elements: !97)
!97 = !{!98, !99, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !142, !146, !147, !148, !149, !153, !154, !168, !169, !170, !171, !172, !201, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !96, file: !91, line: 179, baseType: !7, size: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !96, file: !91, line: 180, baseType: !100, size: 32, offset: 32)
!100 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !96, file: !91, line: 181, baseType: !100, size: 32, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !96, file: !91, line: 182, baseType: !100, size: 32, offset: 96)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !96, file: !91, line: 183, baseType: !100, size: 32, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !96, file: !91, line: 186, baseType: !100, size: 32, offset: 160)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !96, file: !91, line: 187, baseType: !100, size: 32, offset: 192)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !96, file: !91, line: 188, baseType: !100, size: 32, offset: 224)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !96, file: !91, line: 189, baseType: !100, size: 32, offset: 256)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !96, file: !91, line: 190, baseType: !100, size: 32, offset: 288)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !96, file: !91, line: 198, baseType: !100, size: 32, offset: 320)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !96, file: !91, line: 215, baseType: !111, size: 288, offset: 352)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !96, file: !91, line: 200, size: 288, elements: !112)
!112 = !{!113, !114, !115, !116, !117, !118, !119, !120, !121}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !111, file: !91, line: 203, baseType: !100, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !111, file: !91, line: 204, baseType: !100, size: 32, offset: 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !111, file: !91, line: 206, baseType: !100, size: 32, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !111, file: !91, line: 209, baseType: !100, size: 32, offset: 96)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !111, file: !91, line: 210, baseType: !100, size: 32, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !111, file: !91, line: 211, baseType: !100, size: 32, offset: 160)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !111, file: !91, line: 212, baseType: !100, size: 32, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !111, file: !91, line: 213, baseType: !100, size: 32, offset: 224)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !111, file: !91, line: 214, baseType: !100, size: 32, offset: 256)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !96, file: !91, line: 218, baseType: !100, size: 32, offset: 640)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !96, file: !91, line: 219, baseType: !100, size: 32, offset: 672)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !96, file: !91, line: 220, baseType: !100, size: 32, offset: 704)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !96, file: !91, line: 221, baseType: !100, size: 32, offset: 736)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !96, file: !91, line: 222, baseType: !100, size: 32, offset: 768)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !96, file: !91, line: 224, baseType: !100, size: 32, offset: 800)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !96, file: !91, line: 225, baseType: !100, size: 32, offset: 832)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !96, file: !91, line: 226, baseType: !100, size: 32, offset: 864)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !96, file: !91, line: 227, baseType: !100, size: 32, offset: 896)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !96, file: !91, line: 229, baseType: !100, size: 32, offset: 928)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !96, file: !91, line: 230, baseType: !100, size: 32, offset: 960)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !96, file: !91, line: 231, baseType: !100, size: 32, offset: 992)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !96, file: !91, line: 233, baseType: !100, size: 32, offset: 1024)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !96, file: !91, line: 234, baseType: !100, size: 32, offset: 1056)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !96, file: !91, line: 236, baseType: !100, size: 32, offset: 1088)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !96, file: !91, line: 237, baseType: !100, size: 32, offset: 1120)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !96, file: !91, line: 239, baseType: !100, size: 32, offset: 1152)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !96, file: !91, line: 240, baseType: !140, size: 64, offset: 1216)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !96, file: !91, line: 241, baseType: !143, size: 128, offset: 1280)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 128, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 16)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !96, file: !91, line: 242, baseType: !143, size: 128, offset: 1408)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !96, file: !91, line: 243, baseType: !143, size: 128, offset: 1536)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !96, file: !91, line: 244, baseType: !143, size: 128, offset: 1664)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !96, file: !91, line: 245, baseType: !150, size: 512, offset: 1792)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 512, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !96, file: !91, line: 246, baseType: !150, size: 512, offset: 2304)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !96, file: !91, line: 249, baseType: !155, size: 64, offset: 2816)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{null, !158, !100, !159, !161}
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, size: 192, elements: !163)
!163 = !{!164, !165, !166, !167}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !162, file: !3, baseType: !7, size: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !162, file: !3, baseType: !7, size: 32, offset: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !162, file: !3, baseType: !158, size: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !162, file: !3, baseType: !158, size: 64, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !96, file: !91, line: 250, baseType: !158, size: 64, offset: 2880)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !96, file: !91, line: 251, baseType: !100, size: 32, offset: 2944)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !96, file: !91, line: 252, baseType: !100, size: 32, offset: 2976)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !96, file: !91, line: 253, baseType: !140, size: 64, offset: 3008)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !96, file: !91, line: 287, baseType: !173, size: 800, offset: 3072)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !96, file: !91, line: 256, size: 800, elements: !174)
!174 = !{!175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !195, !196, !197, !199, !200}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !173, file: !91, line: 258, baseType: !7, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !173, file: !91, line: 259, baseType: !7, size: 32, offset: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !173, file: !91, line: 261, baseType: !100, size: 32, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !173, file: !91, line: 262, baseType: !100, size: 32, offset: 96)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !173, file: !91, line: 263, baseType: !100, size: 32, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !173, file: !91, line: 264, baseType: !100, size: 32, offset: 160)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !173, file: !91, line: 265, baseType: !100, size: 32, offset: 192)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !173, file: !91, line: 267, baseType: !100, size: 32, offset: 224)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !173, file: !91, line: 268, baseType: !100, size: 32, offset: 256)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !173, file: !91, line: 269, baseType: !100, size: 32, offset: 288)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !173, file: !91, line: 270, baseType: !100, size: 32, offset: 320)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !173, file: !91, line: 271, baseType: !100, size: 32, offset: 352)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !173, file: !91, line: 272, baseType: !100, size: 32, offset: 384)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !173, file: !91, line: 273, baseType: !100, size: 32, offset: 416)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !173, file: !91, line: 274, baseType: !100, size: 32, offset: 448)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !173, file: !91, line: 275, baseType: !100, size: 32, offset: 480)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !173, file: !91, line: 276, baseType: !100, size: 32, offset: 512)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !173, file: !91, line: 277, baseType: !100, size: 32, offset: 544)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !173, file: !91, line: 278, baseType: !194, size: 32, offset: 576)
!194 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !173, file: !91, line: 279, baseType: !194, size: 32, offset: 608)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !173, file: !91, line: 280, baseType: !100, size: 32, offset: 640)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !173, file: !91, line: 283, baseType: !198, size: 64, offset: 672)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 64, elements: !57)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !173, file: !91, line: 285, baseType: !100, size: 32, offset: 736)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !173, file: !91, line: 286, baseType: !100, size: 32, offset: 768)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !96, file: !91, line: 327, baseType: !202, size: 1152, offset: 3904)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !96, file: !91, line: 290, size: 1152, elements: !203)
!203 = !{!204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !241, !242}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !202, file: !91, line: 292, baseType: !100, size: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !202, file: !91, line: 294, baseType: !100, size: 32, offset: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !202, file: !91, line: 295, baseType: !100, size: 32, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !202, file: !91, line: 296, baseType: !100, size: 32, offset: 96)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !202, file: !91, line: 297, baseType: !100, size: 32, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !202, file: !91, line: 299, baseType: !100, size: 32, offset: 160)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !202, file: !91, line: 300, baseType: !194, size: 32, offset: 192)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !202, file: !91, line: 301, baseType: !194, size: 32, offset: 224)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !202, file: !91, line: 302, baseType: !194, size: 32, offset: 256)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !202, file: !91, line: 303, baseType: !100, size: 32, offset: 288)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !202, file: !91, line: 304, baseType: !100, size: 32, offset: 320)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !202, file: !91, line: 305, baseType: !194, size: 32, offset: 352)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !202, file: !91, line: 306, baseType: !194, size: 32, offset: 384)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !202, file: !91, line: 307, baseType: !194, size: 32, offset: 416)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !202, file: !91, line: 309, baseType: !100, size: 32, offset: 448)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !202, file: !91, line: 310, baseType: !194, size: 32, offset: 480)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !202, file: !91, line: 311, baseType: !100, size: 32, offset: 512)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !202, file: !91, line: 312, baseType: !100, size: 32, offset: 544)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !202, file: !91, line: 315, baseType: !100, size: 32, offset: 576)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !202, file: !91, line: 316, baseType: !140, size: 64, offset: 640)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !202, file: !91, line: 317, baseType: !100, size: 32, offset: 704)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !202, file: !91, line: 318, baseType: !140, size: 64, offset: 768)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !202, file: !91, line: 321, baseType: !194, size: 32, offset: 832)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !202, file: !91, line: 322, baseType: !194, size: 32, offset: 864)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !202, file: !91, line: 323, baseType: !194, size: 32, offset: 896)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !202, file: !91, line: 324, baseType: !230, size: 64, offset: 960)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !91, line: 174, baseType: !232)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !91, line: 167, size: 256, elements: !233)
!233 = !{!234, !235, !236, !237, !238, !239}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !232, file: !91, line: 169, baseType: !100, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !232, file: !91, line: 169, baseType: !100, size: 32, offset: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !232, file: !91, line: 170, baseType: !100, size: 32, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !232, file: !91, line: 171, baseType: !100, size: 32, offset: 96)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !232, file: !91, line: 172, baseType: !194, size: 32, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !232, file: !91, line: 173, baseType: !240, size: 64, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !202, file: !91, line: 325, baseType: !100, size: 32, offset: 1024)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !202, file: !91, line: 326, baseType: !140, size: 64, offset: 1088)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !96, file: !91, line: 330, baseType: !100, size: 32, offset: 5056)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !96, file: !91, line: 331, baseType: !100, size: 32, offset: 5088)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !96, file: !91, line: 332, baseType: !100, size: 32, offset: 5120)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !96, file: !91, line: 334, baseType: !100, size: 32, offset: 5152)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !96, file: !91, line: 335, baseType: !100, size: 32, offset: 5184)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !96, file: !91, line: 336, baseType: !40, size: 32, offset: 5216)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !96, file: !91, line: 337, baseType: !40, size: 32, offset: 5248)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !96, file: !91, line: 338, baseType: !40, size: 32, offset: 5280)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !96, file: !91, line: 339, baseType: !40, size: 32, offset: 5312)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !96, file: !91, line: 340, baseType: !100, size: 32, offset: 5344)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !96, file: !91, line: 344, baseType: !100, size: 32, offset: 5376)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !96, file: !91, line: 356, baseType: !100, size: 32, offset: 5408)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !96, file: !91, line: 364, baseType: !100, size: 32, offset: 5440)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !96, file: !91, line: 367, baseType: !100, size: 32, offset: 5472)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !96, file: !91, line: 368, baseType: !100, size: 32, offset: 5504)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !96, file: !91, line: 369, baseType: !100, size: 32, offset: 5536)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !96, file: !91, line: 375, baseType: !260, size: 64, offset: 5568)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{null, !158}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !92, file: !51, line: 386, baseType: !264, size: 8256, offset: 5632)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 8256, elements: !265)
!265 = !{!266}
!266 = !DISubrange(count: 129)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "thread_handle", scope: !92, file: !51, line: 387, baseType: !100, size: 32, offset: 13888)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "b_thread_active", scope: !92, file: !51, line: 388, baseType: !100, size: 32, offset: 13920)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_phase", scope: !92, file: !51, line: 389, baseType: !100, size: 32, offset: 13952)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_start", scope: !92, file: !51, line: 390, baseType: !100, size: 32, offset: 13984)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_end", scope: !92, file: !51, line: 391, baseType: !100, size: 32, offset: 14016)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !92, file: !51, line: 402, baseType: !273, size: 576, offset: 14080)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !92, file: !51, line: 394, size: 576, elements: !274)
!274 = !{!275, !276, !277, !287, !288, !289}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal", scope: !273, file: !51, line: 396, baseType: !100, size: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "i_nals_allocated", scope: !273, file: !51, line: 397, baseType: !100, size: 32, offset: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "nal", scope: !273, file: !51, line: 398, baseType: !278, size: 64, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !91, line: 604, baseType: !280)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !91, line: 593, size: 192, elements: !281)
!281 = !{!282, !283, !284, !285}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !280, file: !91, line: 595, baseType: !100, size: 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !280, file: !91, line: 596, baseType: !100, size: 32, offset: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !280, file: !91, line: 599, baseType: !100, size: 32, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !280, file: !91, line: 603, baseType: !286, size: 64, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitstream", scope: !273, file: !51, line: 399, baseType: !100, size: 32, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "p_bitstream", scope: !273, file: !51, line: 400, baseType: !286, size: 64, offset: 192)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !273, file: !51, line: 401, baseType: !290, size: 320, offset: 256)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "bs_t", file: !291, line: 56, baseType: !292)
!291 = !DIFile(filename: "x264_src/common/bs.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bs_s", file: !291, line: 47, size: 320, elements: !293)
!293 = !{!294, !295, !296, !297, !301, !302}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !292, file: !291, line: 49, baseType: !286, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !292, file: !291, line: 50, baseType: !286, size: 64, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !292, file: !291, line: 51, baseType: !286, size: 64, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "cur_bits", scope: !292, file: !291, line: 53, baseType: !298, size: 64, offset: 192)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !299, line: 87, baseType: !300)
!299 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!300 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !292, file: !291, line: 54, baseType: !100, size: 32, offset: 256)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "i_bits_encoded", scope: !292, file: !291, line: 55, baseType: !100, size: 32, offset: 288)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer", scope: !92, file: !51, line: 404, baseType: !286, size: 64, offset: 14656)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer_size", scope: !92, file: !51, line: 405, baseType: !100, size: 32, offset: 14720)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !92, file: !51, line: 410, baseType: !100, size: 32, offset: 14752)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !92, file: !51, line: 411, baseType: !100, size: 32, offset: 14784)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_frames", scope: !92, file: !51, line: 413, baseType: !100, size: 32, offset: 14816)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_type", scope: !92, file: !51, line: 415, baseType: !100, size: 32, offset: 14848)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_ref_idc", scope: !92, file: !51, line: 416, baseType: !100, size: 32, offset: 14880)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields", scope: !92, file: !51, line: 418, baseType: !100, size: 32, offset: 14912)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields_last_frame", scope: !92, file: !51, line: 419, baseType: !100, size: 32, offset: 14944)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_duration", scope: !92, file: !51, line: 420, baseType: !100, size: 32, offset: 14976)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields", scope: !92, file: !51, line: 421, baseType: !100, size: 32, offset: 15008)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !92, file: !51, line: 422, baseType: !100, size: 32, offset: 15040)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !92, file: !51, line: 424, baseType: !100, size: 32, offset: 15072)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !92, file: !51, line: 425, baseType: !100, size: 32, offset: 15104)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "b_queued_intra_refresh", scope: !92, file: !51, line: 427, baseType: !100, size: 32, offset: 15136)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "sps_array", scope: !92, file: !51, line: 430, baseType: !319, size: 10400, offset: 15168)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !320, size: 10400, elements: !406)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_sps_t", file: !321, line: 154, baseType: !322)
!321 = !DIFile(filename: "x264_src/common/set.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !321, line: 52, size: 10400, elements: !323)
!323 = !{!324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !341, !342, !343, !344, !345, !346, !347, !348, !349, !356, !357, !405}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !322, file: !321, line: 54, baseType: !100, size: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "i_profile_idc", scope: !322, file: !321, line: 56, baseType: !100, size: 32, offset: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !322, file: !321, line: 57, baseType: !100, size: 32, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set0", scope: !322, file: !321, line: 59, baseType: !100, size: 32, offset: 96)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set1", scope: !322, file: !321, line: 60, baseType: !100, size: 32, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set2", scope: !322, file: !321, line: 61, baseType: !100, size: 32, offset: 160)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_frame_num", scope: !322, file: !321, line: 63, baseType: !100, size: 32, offset: 192)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_type", scope: !322, file: !321, line: 65, baseType: !100, size: 32, offset: 224)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_poc_lsb", scope: !322, file: !321, line: 67, baseType: !100, size: 32, offset: 256)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "b_delta_pic_order_always_zero", scope: !322, file: !321, line: 69, baseType: !100, size: 32, offset: 288)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_non_ref_pic", scope: !322, file: !321, line: 70, baseType: !100, size: 32, offset: 320)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_top_to_bottom_field", scope: !322, file: !321, line: 71, baseType: !100, size: 32, offset: 352)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames_in_poc_cycle", scope: !322, file: !321, line: 72, baseType: !100, size: 32, offset: 384)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_ref_frame", scope: !322, file: !321, line: 73, baseType: !338, size: 8192, offset: 416)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 8192, elements: !339)
!339 = !{!340}
!340 = !DISubrange(count: 256)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames", scope: !322, file: !321, line: 75, baseType: !100, size: 32, offset: 8608)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "b_gaps_in_frame_num_value_allowed", scope: !322, file: !321, line: 76, baseType: !100, size: 32, offset: 8640)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_width", scope: !322, file: !321, line: 77, baseType: !100, size: 32, offset: 8672)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_height", scope: !322, file: !321, line: 78, baseType: !100, size: 32, offset: 8704)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_mbs_only", scope: !322, file: !321, line: 79, baseType: !100, size: 32, offset: 8736)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_adaptive_frame_field", scope: !322, file: !321, line: 80, baseType: !100, size: 32, offset: 8768)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct8x8_inference", scope: !322, file: !321, line: 81, baseType: !100, size: 32, offset: 8800)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "b_crop", scope: !322, file: !321, line: 83, baseType: !100, size: 32, offset: 8832)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !322, file: !321, line: 90, baseType: !350, size: 128, offset: 8864)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !322, file: !321, line: 84, size: 128, elements: !351)
!351 = !{!352, !353, !354, !355}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !350, file: !321, line: 86, baseType: !100, size: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "i_right", scope: !350, file: !321, line: 87, baseType: !100, size: 32, offset: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "i_top", scope: !350, file: !321, line: 88, baseType: !100, size: 32, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "i_bottom", scope: !350, file: !321, line: 89, baseType: !100, size: 32, offset: 96)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "b_vui", scope: !322, file: !321, line: 92, baseType: !100, size: 32, offset: 8992)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !322, file: !321, line: 150, baseType: !358, size: 1344, offset: 9024)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !322, file: !321, line: 93, size: 1344, elements: !359)
!359 = !{!360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !396, !397, !398, !399, !400, !401, !402, !403, !404}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "b_aspect_ratio_info_present", scope: !358, file: !321, line: 95, baseType: !100, size: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !358, file: !321, line: 96, baseType: !100, size: 32, offset: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !358, file: !321, line: 97, baseType: !100, size: 32, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info_present", scope: !358, file: !321, line: 99, baseType: !100, size: 32, offset: 96)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info", scope: !358, file: !321, line: 100, baseType: !100, size: 32, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "b_signal_type_present", scope: !358, file: !321, line: 102, baseType: !100, size: 32, offset: 160)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !358, file: !321, line: 103, baseType: !100, size: 32, offset: 192)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !358, file: !321, line: 104, baseType: !100, size: 32, offset: 224)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "b_color_description_present", scope: !358, file: !321, line: 105, baseType: !100, size: 32, offset: 256)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !358, file: !321, line: 106, baseType: !100, size: 32, offset: 288)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !358, file: !321, line: 107, baseType: !100, size: 32, offset: 320)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !358, file: !321, line: 108, baseType: !100, size: 32, offset: 352)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_loc_info_present", scope: !358, file: !321, line: 110, baseType: !100, size: 32, offset: 384)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_top", scope: !358, file: !321, line: 111, baseType: !100, size: 32, offset: 416)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_bottom", scope: !358, file: !321, line: 112, baseType: !100, size: 32, offset: 448)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "b_timing_info_present", scope: !358, file: !321, line: 114, baseType: !100, size: 32, offset: 480)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_units_in_tick", scope: !358, file: !321, line: 115, baseType: !40, size: 32, offset: 512)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_scale", scope: !358, file: !321, line: 116, baseType: !40, size: 32, offset: 544)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "b_fixed_frame_rate", scope: !358, file: !321, line: 117, baseType: !100, size: 32, offset: 576)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "b_nal_hrd_parameters_present", scope: !358, file: !321, line: 119, baseType: !100, size: 32, offset: 608)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "b_vcl_hrd_parameters_present", scope: !358, file: !321, line: 120, baseType: !100, size: 32, offset: 640)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "hrd", scope: !358, file: !321, line: 137, baseType: !382, size: 384, offset: 672)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !358, file: !321, line: 122, size: 384, elements: !383)
!383 = !{!384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_cnt", scope: !382, file: !321, line: 124, baseType: !100, size: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_scale", scope: !382, file: !321, line: 125, baseType: !100, size: 32, offset: 32)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_scale", scope: !382, file: !321, line: 126, baseType: !100, size: 32, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_value", scope: !382, file: !321, line: 127, baseType: !100, size: 32, offset: 96)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_value", scope: !382, file: !321, line: 128, baseType: !100, size: 32, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_unscaled", scope: !382, file: !321, line: 129, baseType: !100, size: 32, offset: 160)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_unscaled", scope: !382, file: !321, line: 130, baseType: !100, size: 32, offset: 192)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "b_cbr_hrd", scope: !382, file: !321, line: 131, baseType: !100, size: 32, offset: 224)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "i_initial_cpb_removal_delay_length", scope: !382, file: !321, line: 133, baseType: !100, size: 32, offset: 256)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_removal_delay_length", scope: !382, file: !321, line: 134, baseType: !100, size: 32, offset: 288)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay_length", scope: !382, file: !321, line: 135, baseType: !100, size: 32, offset: 320)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_offset_length", scope: !382, file: !321, line: 136, baseType: !100, size: 32, offset: 352)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct_present", scope: !358, file: !321, line: 139, baseType: !100, size: 32, offset: 1056)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "b_bitstream_restriction", scope: !358, file: !321, line: 140, baseType: !100, size: 32, offset: 1088)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "b_motion_vectors_over_pic_boundaries", scope: !358, file: !321, line: 141, baseType: !100, size: 32, offset: 1120)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bytes_per_pic_denom", scope: !358, file: !321, line: 142, baseType: !100, size: 32, offset: 1152)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bits_per_mb_denom", scope: !358, file: !321, line: 143, baseType: !100, size: 32, offset: 1184)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_horizontal", scope: !358, file: !321, line: 144, baseType: !100, size: 32, offset: 1216)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_vertical", scope: !358, file: !321, line: 145, baseType: !100, size: 32, offset: 1248)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_reorder_frames", scope: !358, file: !321, line: 146, baseType: !100, size: 32, offset: 1280)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dec_frame_buffering", scope: !358, file: !321, line: 147, baseType: !100, size: 32, offset: 1312)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "b_qpprime_y_zero_transform_bypass", scope: !322, file: !321, line: 152, baseType: !100, size: 32, offset: 10368)
!406 = !{!407}
!407 = !DISubrange(count: 1)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !92, file: !51, line: 431, baseType: !409, size: 64, offset: 25600)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "pps_array", scope: !92, file: !51, line: 432, baseType: !411, size: 960, offset: 25664)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !412, size: 960, elements: !406)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pps_t", file: !321, line: 186, baseType: !413)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !321, line: 156, size: 960, elements: !414)
!414 = !{!415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !413, file: !321, line: 158, baseType: !100, size: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !413, file: !321, line: 159, baseType: !100, size: 32, offset: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !413, file: !321, line: 161, baseType: !100, size: 32, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_order", scope: !413, file: !321, line: 163, baseType: !100, size: 32, offset: 96)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_slice_groups", scope: !413, file: !321, line: 164, baseType: !100, size: 32, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_default_active", scope: !413, file: !321, line: 166, baseType: !100, size: 32, offset: 160)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_default_active", scope: !413, file: !321, line: 167, baseType: !100, size: 32, offset: 192)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_pred", scope: !413, file: !321, line: 169, baseType: !100, size: 32, offset: 224)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !413, file: !321, line: 170, baseType: !100, size: 32, offset: 256)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qp", scope: !413, file: !321, line: 172, baseType: !100, size: 32, offset: 288)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qs", scope: !413, file: !321, line: 173, baseType: !100, size: 32, offset: 320)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_index_offset", scope: !413, file: !321, line: 175, baseType: !100, size: 32, offset: 352)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter_control", scope: !413, file: !321, line: 177, baseType: !100, size: 32, offset: 384)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra_pred", scope: !413, file: !321, line: 178, baseType: !100, size: 32, offset: 416)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "b_redundant_pic_cnt", scope: !413, file: !321, line: 179, baseType: !100, size: 32, offset: 448)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8_mode", scope: !413, file: !321, line: 181, baseType: !100, size: 32, offset: 480)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !413, file: !321, line: 183, baseType: !100, size: 32, offset: 512)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !413, file: !321, line: 184, baseType: !433, size: 384, offset: 576)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 384, elements: !44)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !92, file: !51, line: 433, baseType: !436, size: 64, offset: 26624)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !92, file: !51, line: 434, baseType: !100, size: 32, offset: 26688)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts_compress_multiplier", scope: !92, file: !51, line: 437, baseType: !100, size: 32, offset: 26720)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_mf", scope: !92, file: !51, line: 440, baseType: !440, size: 256, offset: 26752)
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !441, size: 256, elements: !64)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 512, elements: !144)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_mf", scope: !92, file: !51, line: 441, baseType: !444, size: 128, offset: 27008)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !445, size: 128, elements: !57)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 2048, elements: !151)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "unquant4_mf", scope: !92, file: !51, line: 443, baseType: !440, size: 256, offset: 27136)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "unquant8_mf", scope: !92, file: !51, line: 444, baseType: !444, size: 128, offset: 27392)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_mf", scope: !92, file: !51, line: 446, baseType: !450, size: 256, offset: 27520)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !451, size: 256, elements: !64)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 256, elements: !144)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_mf", scope: !92, file: !51, line: 447, baseType: !454, size: 128, offset: 27776)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !455, size: 128, elements: !57)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 1024, elements: !151)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_bias", scope: !92, file: !51, line: 448, baseType: !450, size: 256, offset: 27904)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_bias", scope: !92, file: !51, line: 449, baseType: !454, size: 128, offset: 28160)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv", scope: !92, file: !51, line: 454, baseType: !460, size: 5888, offset: 28288)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !461, size: 5888, elements: !462)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!462 = !{!463}
!463 = !DISubrange(count: 92)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv_fpel", scope: !92, file: !51, line: 455, baseType: !465, size: 23552, offset: 34176)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !461, size: 23552, elements: !466)
!466 = !{!463, !65}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !92, file: !51, line: 457, baseType: !434, size: 64, offset: 57728)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !92, file: !51, line: 460, baseType: !469, size: 53376, offset: 57856)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_slice_header_t", file: !51, line: 364, baseType: !470)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !51, line: 302, size: 53376, elements: !471)
!471 = !{!472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !500, !530, !531, !532, !538, !539, !540, !541, !542, !543, !544, !545}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !470, file: !51, line: 304, baseType: !409, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !470, file: !51, line: 305, baseType: !436, size: 64, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !470, file: !51, line: 307, baseType: !100, size: 32, offset: 128)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "i_first_mb", scope: !470, file: !51, line: 308, baseType: !100, size: 32, offset: 160)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_mb", scope: !470, file: !51, line: 309, baseType: !100, size: 32, offset: 192)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "i_pps_id", scope: !470, file: !51, line: 311, baseType: !100, size: 32, offset: 224)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !470, file: !51, line: 313, baseType: !100, size: 32, offset: 256)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "b_mbaff", scope: !470, file: !51, line: 315, baseType: !100, size: 32, offset: 288)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "b_field_pic", scope: !470, file: !51, line: 316, baseType: !100, size: 32, offset: 320)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "b_bottom_field", scope: !470, file: !51, line: 317, baseType: !100, size: 32, offset: 352)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !470, file: !51, line: 319, baseType: !100, size: 32, offset: 384)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !470, file: !51, line: 321, baseType: !100, size: 32, offset: 416)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc_bottom", scope: !470, file: !51, line: 322, baseType: !100, size: 32, offset: 448)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc", scope: !470, file: !51, line: 324, baseType: !198, size: 64, offset: 480)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "i_redundant_pic_cnt", scope: !470, file: !51, line: 325, baseType: !100, size: 32, offset: 544)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_spatial_mv_pred", scope: !470, file: !51, line: 327, baseType: !100, size: 32, offset: 576)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "b_num_ref_idx_override", scope: !470, file: !51, line: 329, baseType: !100, size: 32, offset: 608)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !470, file: !51, line: 330, baseType: !100, size: 32, offset: 640)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !470, file: !51, line: 331, baseType: !100, size: 32, offset: 672)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l0", scope: !470, file: !51, line: 333, baseType: !100, size: 32, offset: 704)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l1", scope: !470, file: !51, line: 334, baseType: !100, size: 32, offset: 736)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_order", scope: !470, file: !51, line: 339, baseType: !494, size: 2048, offset: 768)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, size: 2048, elements: !499)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !470, file: !51, line: 335, size: 64, elements: !496)
!496 = !{!497, !498}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "idc", scope: !495, file: !51, line: 337, baseType: !100, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !495, file: !51, line: 338, baseType: !100, size: 32, offset: 32)
!499 = !{!58, !145}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !470, file: !51, line: 342, baseType: !501, size: 49152, offset: 2816)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !502, size: 49152, elements: !527)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_weight_t", file: !503, line: 36, baseType: !504, align: 128)
!503 = !DIFile(filename: "x264_src/common/mc.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_weight_t", file: !503, line: 26, size: 512, elements: !505)
!505 = !{!506, !513, !514, !517, !518, !519}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "cachea", scope: !504, file: !503, line: 30, baseType: !507, size: 128, align: 128)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !508, size: 128, elements: !511)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !78, line: 25, baseType: !509)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !43, line: 39, baseType: !510)
!510 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!511 = !{!512}
!512 = !DISubrange(count: 8)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "cacheb", scope: !504, file: !503, line: 31, baseType: !507, size: 128, offset: 128)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "i_denom", scope: !504, file: !503, line: 32, baseType: !515, size: 32, offset: 256)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !78, line: 26, baseType: !516)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !43, line: 41, baseType: !100)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "i_scale", scope: !504, file: !503, line: 33, baseType: !515, size: 32, offset: 288)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset", scope: !504, file: !503, line: 34, baseType: !515, size: 32, offset: 320)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "weightfn", scope: !504, file: !503, line: 35, baseType: !520, size: 64, offset: 384)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "weight_fn_t", file: !503, line: 25, baseType: !522)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DISubroutineType(types: !524)
!524 = !{null, !286, !100, !286, !100, !525, !100}
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !504)
!527 = !{!528, !529}
!528 = !DISubrange(count: 32)
!529 = !DISubrange(count: 3)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_remove_from_end", scope: !470, file: !51, line: 344, baseType: !100, size: 32, offset: 51968)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_command_count", scope: !470, file: !51, line: 345, baseType: !100, size: 32, offset: 52000)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "mmco", scope: !470, file: !51, line: 350, baseType: !533, size: 1024, offset: 52032)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !534, size: 1024, elements: !144)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !470, file: !51, line: 346, size: 64, elements: !535)
!535 = !{!536, !537}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "i_difference_of_pic_nums", scope: !534, file: !51, line: 348, baseType: !100, size: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !534, file: !51, line: 349, baseType: !100, size: 32, offset: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !470, file: !51, line: 352, baseType: !100, size: 32, offset: 53056)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !470, file: !51, line: 354, baseType: !100, size: 32, offset: 53088)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_delta", scope: !470, file: !51, line: 355, baseType: !100, size: 32, offset: 53120)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "b_sp_for_swidth", scope: !470, file: !51, line: 356, baseType: !100, size: 32, offset: 53152)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "i_qs_delta", scope: !470, file: !51, line: 357, baseType: !100, size: 32, offset: 53184)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "i_disable_deblocking_filter_idc", scope: !470, file: !51, line: 360, baseType: !100, size: 32, offset: 53216)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "i_alpha_c0_offset", scope: !470, file: !51, line: 361, baseType: !100, size: 32, offset: 53248)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "i_beta_offset", scope: !470, file: !51, line: 362, baseType: !100, size: 32, offset: 53280)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !92, file: !51, line: 463, baseType: !547, size: 4096, offset: 111232)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_cabac_t", file: !548, line: 46, baseType: !549)
!548 = !DIFile(filename: "x264_src/common/cabac.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !548, line: 27, size: 4096, elements: !550)
!550 = !{!551, !552, !553, !554, !555, !556, !557, !558, !559}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "i_low", scope: !549, file: !548, line: 30, baseType: !100, size: 32)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "i_range", scope: !549, file: !548, line: 31, baseType: !100, size: 32, offset: 32)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "i_queue", scope: !549, file: !548, line: 34, baseType: !100, size: 32, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "i_bytes_outstanding", scope: !549, file: !548, line: 35, baseType: !100, size: 32, offset: 96)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !549, file: !548, line: 37, baseType: !286, size: 64, offset: 128)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !549, file: !548, line: 38, baseType: !286, size: 64, offset: 192)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !549, file: !548, line: 39, baseType: !286, size: 64, offset: 256)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "f8_bits_encoded", scope: !549, file: !548, line: 42, baseType: !100, size: 32, align: 128, offset: 384)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !549, file: !548, line: 45, baseType: !560, size: 3680, offset: 416)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 3680, elements: !561)
!561 = !{!562}
!562 = !DISubrange(count: 460)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !92, file: !51, line: 494, baseType: !564, size: 2112, offset: 115328)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !92, file: !51, line: 465, size: 2112, elements: !565)
!565 = !{!566, !704, !706, !707, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !720, !721, !722, !723}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !564, file: !51, line: 468, baseType: !567, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_frame_t", file: !570, line: 146, baseType: !571)
!570 = !DIFile(filename: "x264_src/common/frame.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_frame", file: !570, line: 31, size: 125056, elements: !572)
!572 = !{!573, !574, !575, !576, !579, !580, !581, !582, !583, !584, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !603, !604, !605, !606, !607, !608, !610, !612, !613, !614, !615, !616, !619, !621, !622, !624, !626, !627, !631, !632, !636, !640, !643, !645, !646, !648, !649, !651, !652, !653, !656, !658, !659, !660, !662, !663, !664, !665, !666, !667, !668, !669, !671, !672, !676, !685, !689, !691, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !571, file: !570, line: 34, baseType: !100, size: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !571, file: !570, line: 35, baseType: !100, size: 32, offset: 32)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !571, file: !570, line: 36, baseType: !100, size: 32, offset: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !571, file: !570, line: 37, baseType: !577, size: 64, offset: 128)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !78, line: 27, baseType: !578)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !43, line: 44, baseType: !300)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts", scope: !571, file: !570, line: 38, baseType: !577, size: 64, offset: 192)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "i_duration", scope: !571, file: !570, line: 39, baseType: !100, size: 32, offset: 256)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_duration", scope: !571, file: !570, line: 40, baseType: !100, size: 32, offset: 288)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !571, file: !570, line: 41, baseType: !100, size: 32, offset: 320)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay", scope: !571, file: !570, line: 42, baseType: !100, size: 32, offset: 352)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !571, file: !570, line: 43, baseType: !585, size: 64, offset: 384)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !571, file: !570, line: 45, baseType: !100, size: 32, offset: 448)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded", scope: !571, file: !570, line: 46, baseType: !100, size: 32, offset: 480)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "i_field_cnt", scope: !571, file: !570, line: 47, baseType: !100, size: 32, offset: 512)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !571, file: !570, line: 48, baseType: !100, size: 32, offset: 544)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "b_kept_as_ref", scope: !571, file: !570, line: 49, baseType: !100, size: 32, offset: 576)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_struct", scope: !571, file: !570, line: 50, baseType: !100, size: 32, offset: 608)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "b_keyframe", scope: !571, file: !570, line: 51, baseType: !100, size: 32, offset: 640)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "b_fdec", scope: !571, file: !570, line: 52, baseType: !61, size: 8, offset: 672)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_minigop_bframe", scope: !571, file: !570, line: 53, baseType: !61, size: 8, offset: 680)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframes", scope: !571, file: !570, line: 54, baseType: !61, size: 8, offset: 688)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_rc", scope: !571, file: !570, line: 55, baseType: !194, size: 32, offset: 704)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_aq", scope: !571, file: !570, line: 56, baseType: !194, size: 32, offset: 736)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_l0ref0", scope: !571, file: !570, line: 57, baseType: !100, size: 32, offset: 768)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !571, file: !570, line: 60, baseType: !100, size: 32, offset: 800)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !571, file: !570, line: 61, baseType: !601, size: 96, offset: 832)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 96, elements: !602)
!602 = !{!529}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !571, file: !570, line: 62, baseType: !601, size: 96, offset: 928)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines", scope: !571, file: !570, line: 63, baseType: !601, size: 96, offset: 1024)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride_lowres", scope: !571, file: !570, line: 64, baseType: !100, size: 32, offset: 1120)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "i_width_lowres", scope: !571, file: !570, line: 65, baseType: !100, size: 32, offset: 1152)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_lowres", scope: !571, file: !570, line: 66, baseType: !100, size: 32, offset: 1184)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !571, file: !570, line: 67, baseType: !609, size: 192, offset: 1216)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !286, size: 192, elements: !602)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "filtered", scope: !571, file: !570, line: 68, baseType: !611, size: 256, offset: 1408)
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !286, size: 256, elements: !64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !571, file: !570, line: 69, baseType: !611, size: 256, offset: 1664)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "integral", scope: !571, file: !570, line: 70, baseType: !461, size: 64, offset: 1920)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !571, file: !570, line: 74, baseType: !611, size: 256, offset: 1984)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_lowres", scope: !571, file: !570, line: 75, baseType: !611, size: 256, offset: 2240)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !571, file: !570, line: 77, baseType: !617, size: 24576, offset: 2560)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !502, size: 24576, elements: !618)
!618 = !{!145, !529}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "weighted", scope: !571, file: !570, line: 78, baseType: !620, size: 1024, offset: 27136)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !286, size: 1024, elements: !144)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "b_duplicate", scope: !571, file: !570, line: 79, baseType: !100, size: 32, offset: 28160)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !571, file: !570, line: 80, baseType: !623, size: 64, offset: 28224)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !571, file: !570, line: 83, baseType: !625, size: 64, offset: 28288)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "mb_partition", scope: !571, file: !570, line: 84, baseType: !286, size: 64, offset: 28352)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !571, file: !570, line: 85, baseType: !628, size: 128, offset: 28416)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !629, size: 128, elements: !57)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !508, size: 32, elements: !57)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "mv16x16", scope: !571, file: !570, line: 86, baseType: !629, size: 64, offset: 28544)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mvs", scope: !571, file: !570, line: 87, baseType: !633, size: 2176, offset: 28608)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !629, size: 2176, elements: !634)
!634 = !{!58, !635}
!635 = !DISubrange(count: 17)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_costs", scope: !571, file: !570, line: 92, baseType: !637, size: 20736, offset: 30784)
!637 = !DICompositeType(tag: DW_TAG_array_type, baseType: !461, size: 20736, elements: !638)
!638 = !{!639, !639}
!639 = !DISubrange(count: 18)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mv_costs", scope: !571, file: !570, line: 96, baseType: !641, size: 2176, offset: 51520)
!641 = !DICompositeType(tag: DW_TAG_array_type, baseType: !642, size: 2176, elements: !634)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !571, file: !570, line: 97, baseType: !644, size: 128, offset: 53696)
!644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !625, size: 128, elements: !57)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref", scope: !571, file: !570, line: 98, baseType: !198, size: 64, offset: 53824)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc", scope: !571, file: !570, line: 99, baseType: !647, size: 1024, offset: 53888)
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 1024, elements: !499)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "inv_ref_poc", scope: !571, file: !570, line: 100, baseType: !630, size: 32, offset: 54912)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est", scope: !571, file: !570, line: 105, baseType: !650, size: 10368, offset: 54944)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 10368, elements: !638)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est_aq", scope: !571, file: !570, line: 106, baseType: !650, size: 10368, offset: 65312)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "i_satd", scope: !571, file: !570, line: 107, baseType: !100, size: 32, offset: 75680)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_mbs", scope: !571, file: !570, line: 108, baseType: !654, size: 576, offset: 75712)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 576, elements: !655)
!655 = !{!639}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satds", scope: !571, file: !570, line: 109, baseType: !657, size: 20736, offset: 76288)
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !642, size: 20736, elements: !638)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satd", scope: !571, file: !570, line: 110, baseType: !642, size: 64, offset: 97024)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_bits", scope: !571, file: !570, line: 111, baseType: !642, size: 64, offset: 97088)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "f_row_qp", scope: !571, file: !570, line: 112, baseType: !661, size: 64, offset: 97152)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset", scope: !571, file: !570, line: 113, baseType: !661, size: 64, offset: 97216)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset_aq", scope: !571, file: !570, line: 114, baseType: !661, size: 64, offset: 97280)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_calculated", scope: !571, file: !570, line: 115, baseType: !100, size: 32, offset: 97344)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !571, file: !570, line: 116, baseType: !461, size: 64, offset: 97408)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "i_propagate_cost", scope: !571, file: !570, line: 117, baseType: !461, size: 64, offset: 97472)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "i_inv_qscale_factor", scope: !571, file: !570, line: 118, baseType: !461, size: 64, offset: 97536)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "b_scenecut", scope: !571, file: !570, line: 119, baseType: !100, size: 32, offset: 97600)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "f_weighted_cost_delta", scope: !571, file: !570, line: 120, baseType: !670, size: 576, offset: 97632)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 576, elements: !655)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_sum", scope: !571, file: !570, line: 121, baseType: !40, size: 32, offset: 98208)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_ssd", scope: !571, file: !570, line: 122, baseType: !673, size: 64, offset: 98240)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !41, line: 27, baseType: !674)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !43, line: 45, baseType: !675)
!675 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "hrd_timing", scope: !571, file: !570, line: 125, baseType: !677, size: 256, offset: 98304)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_hrd_t", file: !91, line: 503, baseType: !678)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !91, line: 496, size: 256, elements: !679)
!679 = !{!680, !682, !683, !684}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_initial_arrival_time", scope: !678, file: !91, line: 498, baseType: !681, size: 64)
!681 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_final_arrival_time", scope: !678, file: !91, line: 499, baseType: !681, size: 64, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_time", scope: !678, file: !91, line: 500, baseType: !681, size: 64, offset: 128)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_time", scope: !678, file: !91, line: 502, baseType: !681, size: 64, offset: 192)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_type", scope: !571, file: !570, line: 128, baseType: !686, size: 2008, offset: 98560)
!686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 2008, elements: !687)
!687 = !{!688}
!688 = !DISubrange(count: 251)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_satd", scope: !571, file: !570, line: 129, baseType: !690, size: 8032, offset: 100576)
!690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 8032, elements: !687)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "f_planned_cpb_duration", scope: !571, file: !570, line: 130, baseType: !692, size: 16064, offset: 108608)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !681, size: 16064, elements: !687)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !571, file: !570, line: 131, baseType: !100, size: 32, offset: 124672)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !571, file: !570, line: 132, baseType: !100, size: 32, offset: 124704)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_completed", scope: !571, file: !570, line: 135, baseType: !100, size: 32, offset: 124736)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_weighted", scope: !571, file: !570, line: 136, baseType: !100, size: 32, offset: 124768)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "i_reference_count", scope: !571, file: !570, line: 137, baseType: !100, size: 32, offset: 124800)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !571, file: !570, line: 138, baseType: !100, size: 32, offset: 124832)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !571, file: !570, line: 139, baseType: !100, size: 32, offset: 124864)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "f_pir_position", scope: !571, file: !570, line: 142, baseType: !194, size: 32, offset: 124896)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_start_col", scope: !571, file: !570, line: 143, baseType: !100, size: 32, offset: 124928)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_end_col", scope: !571, file: !570, line: 144, baseType: !100, size: 32, offset: 124960)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "i_frames_since_pir", scope: !571, file: !570, line: 145, baseType: !100, size: 32, offset: 124992)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !564, file: !51, line: 470, baseType: !705, size: 128, offset: 64)
!705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !567, size: 128, elements: !57)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "blank_unused", scope: !564, file: !51, line: 473, baseType: !567, size: 64, offset: 192)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !564, file: !51, line: 476, baseType: !708, size: 1152, offset: 256)
!708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !568, size: 1152, elements: !655)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_keyframe", scope: !564, file: !51, line: 478, baseType: !100, size: 32, offset: 1408)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "i_input", scope: !564, file: !51, line: 480, baseType: !100, size: 32, offset: 1440)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dpb", scope: !564, file: !51, line: 482, baseType: !100, size: 32, offset: 1472)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref0", scope: !564, file: !51, line: 483, baseType: !100, size: 32, offset: 1504)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref1", scope: !564, file: !51, line: 484, baseType: !100, size: 32, offset: 1536)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "i_delay", scope: !564, file: !51, line: 485, baseType: !100, size: 32, offset: 1568)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay", scope: !564, file: !51, line: 486, baseType: !100, size: 32, offset: 1600)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay_time", scope: !564, file: !51, line: 487, baseType: !577, size: 64, offset: 1664)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "i_init_delta", scope: !564, file: !51, line: 488, baseType: !577, size: 64, offset: 1728)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_reordered_pts", scope: !564, file: !51, line: 489, baseType: !719, size: 128, offset: 1792)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !577, size: 128, elements: !57)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "i_largest_pts", scope: !564, file: !51, line: 490, baseType: !577, size: 64, offset: 1920)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "i_second_largest_pts", scope: !564, file: !51, line: 491, baseType: !577, size: 64, offset: 1984)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_lowres", scope: !564, file: !51, line: 492, baseType: !100, size: 32, offset: 2048)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_sub8x8_esa", scope: !564, file: !51, line: 493, baseType: !100, size: 32, offset: 2080)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "fenc", scope: !92, file: !51, line: 497, baseType: !568, size: 64, offset: 117440)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "fdec", scope: !92, file: !51, line: 500, baseType: !568, size: 64, offset: 117504)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref0", scope: !92, file: !51, line: 503, baseType: !100, size: 32, offset: 117568)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "fref0", scope: !92, file: !51, line: 504, baseType: !728, size: 1216, offset: 117632)
!728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !568, size: 1216, elements: !729)
!729 = !{!730}
!730 = !DISubrange(count: 19)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref1", scope: !92, file: !51, line: 505, baseType: !100, size: 32, offset: 118848)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "fref1", scope: !92, file: !51, line: 506, baseType: !728, size: 1216, offset: 118912)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_reorder", scope: !92, file: !51, line: 507, baseType: !198, size: 64, offset: 120128)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay", scope: !92, file: !51, line: 510, baseType: !100, size: 32, offset: 120192)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_offset", scope: !92, file: !51, line: 511, baseType: !100, size: 32, offset: 120224)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts_delay", scope: !92, file: !51, line: 512, baseType: !577, size: 64, offset: 120256)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "dct", scope: !92, file: !51, line: 522, baseType: !738, size: 10624, offset: 120320)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !92, file: !51, line: 515, size: 10624, elements: !739)
!739 = !{!740, !742, !745, !748}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "luma16x16_dc", scope: !738, file: !51, line: 517, baseType: !741, size: 256, align: 128)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !508, size: 256, elements: !144)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_dc", scope: !738, file: !51, line: 518, baseType: !743, size: 128, align: 128, offset: 256)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !508, size: 128, elements: !744)
!744 = !{!58, !65}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "luma8x8", scope: !738, file: !51, line: 520, baseType: !746, size: 4096, align: 128, offset: 384)
!746 = !DICompositeType(tag: DW_TAG_array_type, baseType: !508, size: 4096, elements: !747)
!747 = !{!65, !152}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "luma4x4", scope: !738, file: !51, line: 521, baseType: !749, size: 6144, align: 128, offset: 4480)
!749 = !DICompositeType(tag: DW_TAG_array_type, baseType: !508, size: 6144, elements: !750)
!750 = !{!751, !145}
!751 = !DISubrange(count: 24)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !92, file: !51, line: 732, baseType: !753, size: 82688, offset: 130944)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !92, file: !51, line: 525, size: 82688, elements: !754)
!754 = !{!755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !782, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !800, !803, !807, !808, !809, !814, !815, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !883, !914, !915, !916, !917, !918, !919, !920, !921, !922, !925, !926, !927, !930, !933, !935, !938, !940, !941}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !753, file: !51, line: 527, baseType: !100, size: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_stride", scope: !753, file: !51, line: 530, baseType: !100, size: 32, offset: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_stride", scope: !753, file: !51, line: 531, baseType: !100, size: 32, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_stride", scope: !753, file: !51, line: 532, baseType: !100, size: 32, offset: 96)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_x", scope: !753, file: !51, line: 535, baseType: !100, size: 32, offset: 128)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_y", scope: !753, file: !51, line: 536, baseType: !100, size: 32, offset: 160)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_xy", scope: !753, file: !51, line: 537, baseType: !100, size: 32, offset: 192)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_xy", scope: !753, file: !51, line: 538, baseType: !100, size: 32, offset: 224)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_xy", scope: !753, file: !51, line: 539, baseType: !100, size: 32, offset: 256)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !753, file: !51, line: 542, baseType: !100, size: 32, offset: 288)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !753, file: !51, line: 543, baseType: !100, size: 32, offset: 320)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !753, file: !51, line: 544, baseType: !100, size: 32, offset: 352)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "b_trellis", scope: !753, file: !51, line: 545, baseType: !100, size: 32, offset: 384)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "b_noise_reduction", scope: !753, file: !51, line: 546, baseType: !100, size: 32, offset: 416)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !753, file: !51, line: 547, baseType: !100, size: 32, offset: 448)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_rd", scope: !753, file: !51, line: 548, baseType: !100, size: 32, offset: 480)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_trellis", scope: !753, file: !51, line: 549, baseType: !100, size: 32, offset: 512)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !753, file: !51, line: 551, baseType: !100, size: 32, offset: 544)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min", scope: !753, file: !51, line: 554, baseType: !198, size: 64, offset: 576)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max", scope: !753, file: !51, line: 555, baseType: !198, size: 64, offset: 640)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_spel", scope: !753, file: !51, line: 558, baseType: !198, size: 64, offset: 704)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_spel", scope: !753, file: !51, line: 559, baseType: !198, size: 64, offset: 768)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_fpel", scope: !753, file: !51, line: 561, baseType: !198, size: 64, offset: 832)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_fpel", scope: !753, file: !51, line: 562, baseType: !198, size: 64, offset: 896)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour", scope: !753, file: !51, line: 565, baseType: !7, size: 32, offset: 960)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour8", scope: !753, file: !51, line: 566, baseType: !781, size: 128, offset: 992)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128, elements: !64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour4", scope: !753, file: !51, line: 567, baseType: !783, size: 512, offset: 1120)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 512, elements: !144)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_intra", scope: !753, file: !51, line: 568, baseType: !7, size: 32, offset: 1632)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_frame", scope: !753, file: !51, line: 569, baseType: !7, size: 32, offset: 1664)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_top", scope: !753, file: !51, line: 570, baseType: !100, size: 32, offset: 1696)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_left", scope: !753, file: !51, line: 571, baseType: !100, size: 32, offset: 1728)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topleft", scope: !753, file: !51, line: 572, baseType: !100, size: 32, offset: 1760)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topright", scope: !753, file: !51, line: 573, baseType: !100, size: 32, offset: 1792)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_prev_xy", scope: !753, file: !51, line: 574, baseType: !100, size: 32, offset: 1824)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_left_xy", scope: !753, file: !51, line: 575, baseType: !100, size: 32, offset: 1856)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_top_xy", scope: !753, file: !51, line: 576, baseType: !100, size: 32, offset: 1888)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topleft_xy", scope: !753, file: !51, line: 577, baseType: !100, size: 32, offset: 1920)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topright_xy", scope: !753, file: !51, line: 578, baseType: !100, size: 32, offset: 1952)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !753, file: !51, line: 585, baseType: !625, size: 64, offset: 1984)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "partition", scope: !753, file: !51, line: 586, baseType: !286, size: 64, offset: 2048)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !753, file: !51, line: 587, baseType: !625, size: 64, offset: 2112)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !753, file: !51, line: 588, baseType: !799, size: 64, offset: 2176)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !753, file: !51, line: 589, baseType: !801, size: 64, offset: 2240)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 64, elements: !511)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !753, file: !51, line: 591, baseType: !804, size: 64, offset: 2304)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 192, elements: !806)
!806 = !{!751}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_pred_mode", scope: !753, file: !51, line: 592, baseType: !625, size: 64, offset: 2368)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !753, file: !51, line: 593, baseType: !628, size: 128, offset: 2432)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !753, file: !51, line: 594, baseType: !810, size: 128, offset: 2560)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !811, size: 128, elements: !57)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 128, elements: !813)
!813 = !{!512, !58}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !753, file: !51, line: 595, baseType: !644, size: 128, offset: 2688)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "mvr", scope: !753, file: !51, line: 596, baseType: !816, size: 4096, offset: 2816)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !629, size: 4096, elements: !817)
!817 = !{!58, !528}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "skipbp", scope: !753, file: !51, line: 597, baseType: !625, size: 64, offset: 6912)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "mb_transform_size", scope: !753, file: !51, line: 598, baseType: !625, size: 64, offset: 6976)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "slice_table", scope: !753, file: !51, line: 599, baseType: !461, size: 64, offset: 7040)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "p_weight_buf", scope: !753, file: !51, line: 603, baseType: !620, size: 1024, offset: 7104)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !753, file: !51, line: 606, baseType: !100, size: 32, offset: 8128)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "i_partition", scope: !753, file: !51, line: 607, baseType: !100, size: 32, offset: 8160)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "i_sub_partition", scope: !753, file: !51, line: 608, baseType: !60, size: 32, align: 32, offset: 8192)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !753, file: !51, line: 609, baseType: !100, size: 32, offset: 8224)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_luma", scope: !753, file: !51, line: 611, baseType: !100, size: 32, offset: 8256)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_chroma", scope: !753, file: !51, line: 612, baseType: !100, size: 32, offset: 8288)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra16x16_pred_mode", scope: !753, file: !51, line: 614, baseType: !100, size: 32, offset: 8320)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_pred_mode", scope: !753, file: !51, line: 615, baseType: !100, size: 32, offset: 8352)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "i_skip_intra", scope: !753, file: !51, line: 621, baseType: !100, size: 32, offset: 8384)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "b_skip_mc", scope: !753, file: !51, line: 624, baseType: !100, size: 32, offset: 8416)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "b_reencode_mb", scope: !753, file: !51, line: 626, baseType: !100, size: 32, offset: 8448)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "ip_offset", scope: !753, file: !51, line: 627, baseType: !100, size: 32, offset: 8480)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "pic", scope: !753, file: !51, line: 671, baseType: !835, size: 60672, offset: 8576)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !753, file: !51, line: 629, size: 60672, elements: !836)
!836 = !{!837, !841, !845, !847, !848, !851, !855, !857, !858, !859, !860, !861, !864, !868, !871, !872, !873, !874, !875, !878, !880, !882}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_buf", scope: !835, file: !51, line: 634, baseType: !838, size: 3072, align: 128)
!838 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 3072, elements: !839)
!839 = !{!840}
!840 = !DISubrange(count: 384)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "fdec_buf", scope: !835, file: !51, line: 635, baseType: !842, size: 6912, align: 128, offset: 3072)
!842 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 6912, elements: !843)
!843 = !{!844}
!844 = !DISubrange(count: 864)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_fdec_buf", scope: !835, file: !51, line: 638, baseType: !846, size: 2048, align: 128, offset: 9984)
!846 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 2048, elements: !339)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_fdec_buf", scope: !835, file: !51, line: 639, baseType: !846, size: 2048, align: 128, offset: 12032)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_dct_buf", scope: !835, file: !51, line: 640, baseType: !849, size: 3072, align: 128, offset: 14080)
!849 = !DICompositeType(tag: DW_TAG_array_type, baseType: !508, size: 3072, elements: !850)
!850 = !{!529, !152}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_dct_buf", scope: !835, file: !51, line: 641, baseType: !852, size: 3840, align: 128, offset: 17152)
!852 = !DICompositeType(tag: DW_TAG_array_type, baseType: !508, size: 3840, elements: !853)
!853 = !{!854, !145}
!854 = !DISubrange(count: 15)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_nnz_buf", scope: !835, file: !51, line: 642, baseType: !856, size: 128, offset: 20992)
!856 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 128, elements: !64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_nnz_buf", scope: !835, file: !51, line: 643, baseType: !856, size: 128, offset: 21120)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_cbp", scope: !835, file: !51, line: 644, baseType: !100, size: 32, offset: 21248)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_cbp", scope: !835, file: !51, line: 645, baseType: !100, size: 32, offset: 21280)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct8", scope: !835, file: !51, line: 648, baseType: !746, size: 4096, align: 128, offset: 21376)
