; ModuleID = 'x264_src/output/matroska.c'
source_filename = "x264_src/output/matroska.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.cli_output_t = type { i32 (i8*, i8**)*, i32 (i8*, %struct.x264_param_t*)*, i32 (i8*, %struct.x264_nal_t*)*, i32 (i8*, i8*, i32, %struct.x264_picture_t*)*, i32 (i8*, i64, i64)* }
%struct.x264_param_t = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.anon, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, [16 x i8], [16 x i8], [16 x i8], [16 x i8], [64 x i8], [64 x i8], void (i8*, i32, i8*, %struct.__va_list_tag*)*, i8*, i32, i32, i8*, %struct.anon.0, %struct.anon.1, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, void (i8*)* }
%struct.anon = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.anon.0 = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, float, float, i32, [2 x i32], i32, i32 }
%struct.anon.1 = type { i32, i32, i32, i32, i32, i32, float, float, float, i32, i32, float, float, float, i32, float, i32, i32, i32, i8*, i32, i8*, float, float, float, %struct.x264_zone_t*, i32, i8* }
%struct.x264_zone_t = type { i32, i32, i32, i32, float, %struct.x264_param_t* }
%struct.x264_nal_t = type { i32, i32, i32, i8* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "mkv_output", scope: !2, file: !3, line: 211, type: !14, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !13, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "x264_src/output/matroska.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{}
!5 = !{!6, !7, !12}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !8, line: 27, baseType: !9)
!8 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !10, line: 44, baseType: !11)
!10 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!11 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!12 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!13 = !{!0}
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "cli_output_t", file: !16, line: 34, baseType: !17)
!16 = !DIFile(filename: "x264_src/output/output.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 27, size: 320, elements: !18)
!18 = !{!19, !28, !207, !220, !257}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "open_file", scope: !17, file: !16, line: 29, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DISubroutineType(types: !22)
!22 = !{!12, !23, !25}
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "hnd_t", file: !27, line: 30, baseType: !6)
!27 = !DIFile(filename: "x264_src/muxers.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!28 = !DIDerivedType(tag: DW_TAG_member, name: "set_param", scope: !17, file: !16, line: 30, baseType: !29, size: 64, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DISubroutineType(types: !31)
!31 = !{!12, !26, !32}
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !34, line: 376, baseType: !35)
!34 = !DIFile(filename: "x264_src/x264.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !34, line: 176, size: 5632, elements: !36)
!36 = !{!37, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !87, !88, !89, !90, !94, !95, !108, !109, !110, !111, !112, !143, !185, !186, !187, !188, !189, !190, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !35, file: !34, line: 179, baseType: !38, size: 32)
!38 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !35, file: !34, line: 180, baseType: !12, size: 32, offset: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !35, file: !34, line: 181, baseType: !12, size: 32, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !35, file: !34, line: 182, baseType: !12, size: 32, offset: 96)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !35, file: !34, line: 183, baseType: !12, size: 32, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !35, file: !34, line: 186, baseType: !12, size: 32, offset: 160)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !35, file: !34, line: 187, baseType: !12, size: 32, offset: 192)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !35, file: !34, line: 188, baseType: !12, size: 32, offset: 224)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !35, file: !34, line: 189, baseType: !12, size: 32, offset: 256)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !35, file: !34, line: 190, baseType: !12, size: 32, offset: 288)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !35, file: !34, line: 198, baseType: !12, size: 32, offset: 320)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !35, file: !34, line: 215, baseType: !50, size: 288, offset: 352)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !35, file: !34, line: 200, size: 288, elements: !51)
!51 = !{!52, !53, !54, !55, !56, !57, !58, !59, !60}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !50, file: !34, line: 203, baseType: !12, size: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !50, file: !34, line: 204, baseType: !12, size: 32, offset: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !50, file: !34, line: 206, baseType: !12, size: 32, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !50, file: !34, line: 209, baseType: !12, size: 32, offset: 96)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !50, file: !34, line: 210, baseType: !12, size: 32, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !50, file: !34, line: 211, baseType: !12, size: 32, offset: 160)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !50, file: !34, line: 212, baseType: !12, size: 32, offset: 192)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !50, file: !34, line: 213, baseType: !12, size: 32, offset: 224)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !50, file: !34, line: 214, baseType: !12, size: 32, offset: 256)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !35, file: !34, line: 218, baseType: !12, size: 32, offset: 640)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !35, file: !34, line: 219, baseType: !12, size: 32, offset: 672)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !35, file: !34, line: 220, baseType: !12, size: 32, offset: 704)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !35, file: !34, line: 221, baseType: !12, size: 32, offset: 736)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !35, file: !34, line: 222, baseType: !12, size: 32, offset: 768)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !35, file: !34, line: 224, baseType: !12, size: 32, offset: 800)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !35, file: !34, line: 225, baseType: !12, size: 32, offset: 832)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !35, file: !34, line: 226, baseType: !12, size: 32, offset: 864)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !35, file: !34, line: 227, baseType: !12, size: 32, offset: 896)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !35, file: !34, line: 229, baseType: !12, size: 32, offset: 928)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !35, file: !34, line: 230, baseType: !12, size: 32, offset: 960)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !35, file: !34, line: 231, baseType: !12, size: 32, offset: 992)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !35, file: !34, line: 233, baseType: !12, size: 32, offset: 1024)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !35, file: !34, line: 234, baseType: !12, size: 32, offset: 1056)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !35, file: !34, line: 236, baseType: !12, size: 32, offset: 1088)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !35, file: !34, line: 237, baseType: !12, size: 32, offset: 1120)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !35, file: !34, line: 239, baseType: !12, size: 32, offset: 1152)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !35, file: !34, line: 240, baseType: !23, size: 64, offset: 1216)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !35, file: !34, line: 241, baseType: !80, size: 128, offset: 1280)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 128, elements: !85)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !82, line: 24, baseType: !83)
!82 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !10, line: 38, baseType: !84)
!84 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!85 = !{!86}
!86 = !DISubrange(count: 16)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !35, file: !34, line: 242, baseType: !80, size: 128, offset: 1408)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !35, file: !34, line: 243, baseType: !80, size: 128, offset: 1536)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !35, file: !34, line: 244, baseType: !80, size: 128, offset: 1664)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !35, file: !34, line: 245, baseType: !91, size: 512, offset: 1792)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 512, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !35, file: !34, line: 246, baseType: !91, size: 512, offset: 2304)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !35, file: !34, line: 249, baseType: !96, size: 64, offset: 2816)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{null, !6, !12, !99, !101}
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 211, size: 192, elements: !103)
!103 = !{!104, !105, !106, !107}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !102, file: !3, line: 211, baseType: !38, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !102, file: !3, line: 211, baseType: !38, size: 32, offset: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !102, file: !3, line: 211, baseType: !6, size: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !102, file: !3, line: 211, baseType: !6, size: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !35, file: !34, line: 250, baseType: !6, size: 64, offset: 2880)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !35, file: !34, line: 251, baseType: !12, size: 32, offset: 2944)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !35, file: !34, line: 252, baseType: !12, size: 32, offset: 2976)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !35, file: !34, line: 253, baseType: !23, size: 64, offset: 3008)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !35, file: !34, line: 287, baseType: !113, size: 800, offset: 3072)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !35, file: !34, line: 256, size: 800, elements: !114)
!114 = !{!115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !135, !136, !137, !141, !142}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !113, file: !34, line: 258, baseType: !38, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !113, file: !34, line: 259, baseType: !38, size: 32, offset: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !113, file: !34, line: 261, baseType: !12, size: 32, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !113, file: !34, line: 262, baseType: !12, size: 32, offset: 96)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !113, file: !34, line: 263, baseType: !12, size: 32, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !113, file: !34, line: 264, baseType: !12, size: 32, offset: 160)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !113, file: !34, line: 265, baseType: !12, size: 32, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !113, file: !34, line: 267, baseType: !12, size: 32, offset: 224)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !113, file: !34, line: 268, baseType: !12, size: 32, offset: 256)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !113, file: !34, line: 269, baseType: !12, size: 32, offset: 288)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !113, file: !34, line: 270, baseType: !12, size: 32, offset: 320)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !113, file: !34, line: 271, baseType: !12, size: 32, offset: 352)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !113, file: !34, line: 272, baseType: !12, size: 32, offset: 384)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !113, file: !34, line: 273, baseType: !12, size: 32, offset: 416)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !113, file: !34, line: 274, baseType: !12, size: 32, offset: 448)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !113, file: !34, line: 275, baseType: !12, size: 32, offset: 480)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !113, file: !34, line: 276, baseType: !12, size: 32, offset: 512)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !113, file: !34, line: 277, baseType: !12, size: 32, offset: 544)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !113, file: !34, line: 278, baseType: !134, size: 32, offset: 576)
!134 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !113, file: !34, line: 279, baseType: !134, size: 32, offset: 608)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !113, file: !34, line: 280, baseType: !12, size: 32, offset: 640)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !113, file: !34, line: 283, baseType: !138, size: 64, offset: 672)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 64, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 2)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !113, file: !34, line: 285, baseType: !12, size: 32, offset: 736)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !113, file: !34, line: 286, baseType: !12, size: 32, offset: 768)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !35, file: !34, line: 327, baseType: !144, size: 1152, offset: 3904)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !35, file: !34, line: 290, size: 1152, elements: !145)
!145 = !{!146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !183, !184}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !144, file: !34, line: 292, baseType: !12, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !144, file: !34, line: 294, baseType: !12, size: 32, offset: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !144, file: !34, line: 295, baseType: !12, size: 32, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !144, file: !34, line: 296, baseType: !12, size: 32, offset: 96)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !144, file: !34, line: 297, baseType: !12, size: 32, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !144, file: !34, line: 299, baseType: !12, size: 32, offset: 160)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !144, file: !34, line: 300, baseType: !134, size: 32, offset: 192)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !144, file: !34, line: 301, baseType: !134, size: 32, offset: 224)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !144, file: !34, line: 302, baseType: !134, size: 32, offset: 256)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !144, file: !34, line: 303, baseType: !12, size: 32, offset: 288)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !144, file: !34, line: 304, baseType: !12, size: 32, offset: 320)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !144, file: !34, line: 305, baseType: !134, size: 32, offset: 352)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !144, file: !34, line: 306, baseType: !134, size: 32, offset: 384)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !144, file: !34, line: 307, baseType: !134, size: 32, offset: 416)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !144, file: !34, line: 309, baseType: !12, size: 32, offset: 448)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !144, file: !34, line: 310, baseType: !134, size: 32, offset: 480)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !144, file: !34, line: 311, baseType: !12, size: 32, offset: 512)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !144, file: !34, line: 312, baseType: !12, size: 32, offset: 544)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !144, file: !34, line: 315, baseType: !12, size: 32, offset: 576)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !144, file: !34, line: 316, baseType: !23, size: 64, offset: 640)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !144, file: !34, line: 317, baseType: !12, size: 32, offset: 704)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !144, file: !34, line: 318, baseType: !23, size: 64, offset: 768)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !144, file: !34, line: 321, baseType: !134, size: 32, offset: 832)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !144, file: !34, line: 322, baseType: !134, size: 32, offset: 864)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !144, file: !34, line: 323, baseType: !134, size: 32, offset: 896)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !144, file: !34, line: 324, baseType: !172, size: 64, offset: 960)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !34, line: 174, baseType: !174)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 167, size: 256, elements: !175)
!175 = !{!176, !177, !178, !179, !180, !181}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !174, file: !34, line: 169, baseType: !12, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !174, file: !34, line: 169, baseType: !12, size: 32, offset: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !174, file: !34, line: 170, baseType: !12, size: 32, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !174, file: !34, line: 171, baseType: !12, size: 32, offset: 96)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !174, file: !34, line: 172, baseType: !134, size: 32, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !174, file: !34, line: 173, baseType: !182, size: 64, offset: 192)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !144, file: !34, line: 325, baseType: !12, size: 32, offset: 1024)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !144, file: !34, line: 326, baseType: !23, size: 64, offset: 1088)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !35, file: !34, line: 330, baseType: !12, size: 32, offset: 5056)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !35, file: !34, line: 331, baseType: !12, size: 32, offset: 5088)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !35, file: !34, line: 332, baseType: !12, size: 32, offset: 5120)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !35, file: !34, line: 334, baseType: !12, size: 32, offset: 5152)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !35, file: !34, line: 335, baseType: !12, size: 32, offset: 5184)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !35, file: !34, line: 336, baseType: !191, size: 32, offset: 5216)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !82, line: 26, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !10, line: 42, baseType: !38)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !35, file: !34, line: 337, baseType: !191, size: 32, offset: 5248)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !35, file: !34, line: 338, baseType: !191, size: 32, offset: 5280)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !35, file: !34, line: 339, baseType: !191, size: 32, offset: 5312)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !35, file: !34, line: 340, baseType: !12, size: 32, offset: 5344)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !35, file: !34, line: 344, baseType: !12, size: 32, offset: 5376)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !35, file: !34, line: 356, baseType: !12, size: 32, offset: 5408)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !35, file: !34, line: 364, baseType: !12, size: 32, offset: 5440)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !35, file: !34, line: 367, baseType: !12, size: 32, offset: 5472)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !35, file: !34, line: 368, baseType: !12, size: 32, offset: 5504)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !35, file: !34, line: 369, baseType: !12, size: 32, offset: 5536)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !35, file: !34, line: 375, baseType: !204, size: 64, offset: 5568)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{null, !6}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "write_headers", scope: !17, file: !16, line: 31, baseType: !208, size: 64, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!12, !26, !211}
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !34, line: 604, baseType: !213)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 593, size: 192, elements: !214)
!214 = !{!215, !216, !217, !218}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !213, file: !34, line: 595, baseType: !12, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !213, file: !34, line: 596, baseType: !12, size: 32, offset: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !213, file: !34, line: 599, baseType: !12, size: 32, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !213, file: !34, line: 603, baseType: !219, size: 64, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "write_frame", scope: !17, file: !16, line: 32, baseType: !221, size: 64, offset: 192)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!12, !26, !219, !12, !224}
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_picture_t", file: !34, line: 549, baseType: !226)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 513, size: 1088, elements: !227)
!227 = !{!228, !229, !230, !231, !232, !233, !234, !235, !247, !256}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !226, file: !34, line: 521, baseType: !12, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !226, file: !34, line: 523, baseType: !12, size: 32, offset: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_struct", scope: !226, file: !34, line: 526, baseType: !12, size: 32, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "b_keyframe", scope: !226, file: !34, line: 529, baseType: !12, size: 32, offset: 96)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !226, file: !34, line: 531, baseType: !7, size: 64, offset: 128)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts", scope: !226, file: !34, line: 534, baseType: !7, size: 64, offset: 192)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !226, file: !34, line: 541, baseType: !32, size: 64, offset: 256)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "img", scope: !226, file: !34, line: 543, baseType: !236, size: 448, offset: 320)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_image_t", file: !34, line: 511, baseType: !237)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 505, size: 448, elements: !238)
!238 = !{!239, !240, !241, !245}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !237, file: !34, line: 507, baseType: !12, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !237, file: !34, line: 508, baseType: !12, size: 32, offset: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !237, file: !34, line: 509, baseType: !242, size: 128, offset: 64)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 128, elements: !243)
!243 = !{!244}
!244 = !DISubrange(count: 4)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !237, file: !34, line: 510, baseType: !246, size: 256, offset: 192)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 256, elements: !243)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "hrd_timing", scope: !226, file: !34, line: 545, baseType: !248, size: 256, offset: 768)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_hrd_t", file: !34, line: 503, baseType: !249)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 496, size: 256, elements: !250)
!250 = !{!251, !253, !254, !255}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_initial_arrival_time", scope: !249, file: !34, line: 498, baseType: !252, size: 64)
!252 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_final_arrival_time", scope: !249, file: !34, line: 499, baseType: !252, size: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_time", scope: !249, file: !34, line: 500, baseType: !252, size: 64, offset: 128)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_time", scope: !249, file: !34, line: 502, baseType: !252, size: 64, offset: 192)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !226, file: !34, line: 548, baseType: !6, size: 64, offset: 1024)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "close_file", scope: !17, file: !16, line: 33, baseType: !258, size: 64, offset: 256)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DISubroutineType(types: !260)
!260 = !{!12, !26, !7, !7}
!261 = !{i32 7, !"Dwarf Version", i32 4}
!262 = !{i32 2, !"Debug Info Version", i32 3}
!263 = !{i32 1, !"wchar_size", i32 4}
!264 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!265 = distinct !DISubprogram(name: "open_file", scope: !3, file: !3, line: 38, type: !21, scopeLine: 39, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!266 = !DILocalVariable(name: "psz_filename", arg: 1, scope: !265, file: !3, line: 38, type: !23)
!267 = !DILocation(line: 38, column: 29, scope: !265)
!268 = !DILocalVariable(name: "p_handle", arg: 2, scope: !265, file: !3, line: 38, type: !25)
!269 = !DILocation(line: 38, column: 50, scope: !265)
!270 = !DILocalVariable(name: "p_mkv", scope: !265, file: !3, line: 40, type: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "mkv_hnd_t", file: !3, line: 36, baseType: !273)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 24, size: 384, elements: !274)
!274 = !{!275, !280, !281, !282, !283, !284, !285, !287, !288}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !273, file: !3, line: 26, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "mk_writer", file: !278, line: 24, baseType: !279)
!278 = !DIFile(filename: "x264_src/output/matroska_ebml.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: "mk_writer", file: !278, line: 24, flags: DIFlagFwdDecl)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !273, file: !3, line: 28, baseType: !12, size: 32, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !273, file: !3, line: 28, baseType: !12, size: 32, offset: 96)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "d_width", scope: !273, file: !3, line: 28, baseType: !12, size: 32, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "d_height", scope: !273, file: !3, line: 28, baseType: !12, size: 32, offset: 160)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "frame_duration", scope: !273, file: !3, line: 30, baseType: !7, size: 64, offset: 192)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "b_writing_frame", scope: !273, file: !3, line: 32, baseType: !286, size: 8, offset: 256)
!286 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !273, file: !3, line: 33, baseType: !191, size: 32, offset: 288)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !273, file: !3, line: 34, baseType: !191, size: 32, offset: 320)
!289 = !DILocation(line: 40, column: 16, scope: !265)
!290 = !DILocation(line: 42, column: 6, scope: !265)
!291 = !DILocation(line: 42, column: 15, scope: !265)
!292 = !DILocation(line: 44, column: 14, scope: !265)
!293 = !DILocation(line: 44, column: 12, scope: !265)
!294 = !DILocation(line: 45, column: 10, scope: !295)
!295 = distinct !DILexicalBlock(scope: !265, file: !3, line: 45, column: 9)
!296 = !DILocation(line: 45, column: 9, scope: !265)
!297 = !DILocation(line: 46, column: 9, scope: !295)
!298 = !DILocation(line: 48, column: 13, scope: !265)
!299 = !DILocation(line: 48, column: 5, scope: !265)
!300 = !DILocation(line: 50, column: 34, scope: !265)
!301 = !DILocation(line: 50, column: 16, scope: !265)
!302 = !DILocation(line: 50, column: 5, scope: !265)
!303 = !DILocation(line: 50, column: 12, scope: !265)
!304 = !DILocation(line: 50, column: 14, scope: !265)
!305 = !DILocation(line: 51, column: 10, scope: !306)
!306 = distinct !DILexicalBlock(scope: !265, file: !3, line: 51, column: 9)
!307 = !DILocation(line: 51, column: 17, scope: !306)
!308 = !DILocation(line: 51, column: 9, scope: !265)
!309 = !DILocation(line: 53, column: 15, scope: !310)
!310 = distinct !DILexicalBlock(scope: !306, file: !3, line: 52, column: 5)
!311 = !DILocation(line: 53, column: 9, scope: !310)
!312 = !DILocation(line: 54, column: 9, scope: !310)
!313 = !DILocation(line: 57, column: 17, scope: !265)
!314 = !DILocation(line: 57, column: 6, scope: !265)
!315 = !DILocation(line: 57, column: 15, scope: !265)
!316 = !DILocation(line: 59, column: 5, scope: !265)
!317 = !DILocation(line: 60, column: 1, scope: !265)
!318 = distinct !DISubprogram(name: "set_param", scope: !3, file: !3, line: 62, type: !30, scopeLine: 63, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!319 = !DILocalVariable(name: "handle", arg: 1, scope: !318, file: !3, line: 62, type: !26)
!320 = !DILocation(line: 62, column: 29, scope: !318)
!321 = !DILocalVariable(name: "p_param", arg: 2, scope: !318, file: !3, line: 62, type: !32)
!322 = !DILocation(line: 62, column: 51, scope: !318)
!323 = !DILocalVariable(name: "p_mkv", scope: !318, file: !3, line: 64, type: !271)
!324 = !DILocation(line: 64, column: 18, scope: !318)
!325 = !DILocation(line: 64, column: 26, scope: !318)
!326 = !DILocalVariable(name: "dw", scope: !318, file: !3, line: 65, type: !7)
!327 = !DILocation(line: 65, column: 13, scope: !318)
!328 = !DILocalVariable(name: "dh", scope: !318, file: !3, line: 65, type: !7)
!329 = !DILocation(line: 65, column: 17, scope: !318)
!330 = !DILocation(line: 67, column: 9, scope: !331)
!331 = distinct !DILexicalBlock(scope: !318, file: !3, line: 67, column: 9)
!332 = !DILocation(line: 67, column: 18, scope: !331)
!333 = !DILocation(line: 67, column: 28, scope: !331)
!334 = !DILocation(line: 67, column: 32, scope: !331)
!335 = !DILocation(line: 67, column: 36, scope: !331)
!336 = !DILocation(line: 67, column: 45, scope: !331)
!337 = !DILocation(line: 67, column: 9, scope: !318)
!338 = !DILocation(line: 69, column: 42, scope: !339)
!339 = distinct !DILexicalBlock(scope: !331, file: !3, line: 68, column: 5)
!340 = !DILocation(line: 69, column: 51, scope: !339)
!341 = !DILocation(line: 69, column: 33, scope: !339)
!342 = !DILocation(line: 69, column: 61, scope: !339)
!343 = !DILocation(line: 70, column: 55, scope: !339)
!344 = !DILocation(line: 70, column: 64, scope: !339)
!345 = !DILocation(line: 70, column: 53, scope: !339)
!346 = !DILocation(line: 69, column: 9, scope: !339)
!347 = !DILocation(line: 69, column: 16, scope: !339)
!348 = !DILocation(line: 69, column: 31, scope: !339)
!349 = !DILocation(line: 71, column: 5, scope: !339)
!350 = !DILocation(line: 74, column: 9, scope: !351)
!351 = distinct !DILexicalBlock(scope: !331, file: !3, line: 73, column: 5)
!352 = !DILocation(line: 74, column: 16, scope: !351)
