; ModuleID = 'x264_src/encoder/encoder.c'
source_filename = "x264_src/encoder/encoder.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.x264_cpu_name_t = type { [16 x i8], i32 }
%struct.x264_level_t = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.x264_weight_t = type { [8 x i16], [8 x i16], i32, i32, i32, void (i8*, i32, i8*, i32, %struct.x264_weight_t*, i32)**, [8 x i8] }

!132 = !DIEnumerator(name: "I_PRED_8x8_DC_LEFT", value: 9, isUnsigned: true)
!133 = !DIEnumerator(name: "I_PRED_8x8_DC_TOP", value: 10, isUnsigned: true)
!134 = !DIEnumerator(name: "I_PRED_8x8_DC_128", value: 11, isUnsigned: true)
!135 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "intra_chroma_pred_e", file: !112, line: 31, baseType: !7, size: 32, elements: !136)
!136 = !{!137, !138, !139, !140, !141, !142, !143}
!137 = !DIEnumerator(name: "I_PRED_CHROMA_DC", value: 0, isUnsigned: true)
!138 = !DIEnumerator(name: "I_PRED_CHROMA_H", value: 1, isUnsigned: true)
!139 = !DIEnumerator(name: "I_PRED_CHROMA_V", value: 2, isUnsigned: true)
!140 = !DIEnumerator(name: "I_PRED_CHROMA_P", value: 3, isUnsigned: true)
!141 = !DIEnumerator(name: "I_PRED_CHROMA_DC_LEFT", value: 4, isUnsigned: true)
!142 = !DIEnumerator(name: "I_PRED_CHROMA_DC_TOP", value: 5, isUnsigned: true)
!143 = !DIEnumerator(name: "I_PRED_CHROMA_DC_128", value: 6, isUnsigned: true)
!144 = !{!145, !146, !147, !148, !151, !152, !158, !176, !179}
!145 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!147 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !149, line: 87, baseType: !150)
!149 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!150 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!151 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !154, line: 24, baseType: !155)
!154 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !156, line: 38, baseType: !157)
!156 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!157 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_union32_t", file: !48, line: 89, baseType: !160)
!160 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !48, line: 89, size: 32, elements: !161)
!161 = !{!162, !165, !172}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !160, file: !48, line: 89, baseType: !163, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !154, line: 26, baseType: !164)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !156, line: 42, baseType: !7)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !160, file: !48, line: 89, baseType: !166, size: 32)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 32, elements: !170)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !154, line: 25, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !156, line: 40, baseType: !169)
!169 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!170 = !{!171}
!171 = !DISubrange(count: 2)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !160, file: !48, line: 89, baseType: !173, size: 32)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 32, elements: !174)
!174 = !{!175}
!175 = !DISubrange(count: 4)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !154, line: 27, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !156, line: 45, baseType: !178)
!178 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!180 = !{!181, !1471, !1475, !0, !1477, !1480, !1486, !1489, !1493, !1496, !1501}
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "slice_order", scope: !183, file: !3, line: 2876, type: !1470, isLocal: true, isDefinition: true)
!183 = distinct !DISubprogram(name: "x264_encoder_close", scope: !3, file: !3, line: 2838, type: !184, scopeLine: 2839, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !1469)
!184 = !DISubroutineType(types: !185)
!185 = !{null, !186}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_t", file: !18, line: 46, baseType: !188)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_t", file: !48, line: 381, size: 266752, elements: !189)
!189 = !{!190, !356, !360, !361, !362, !363, !364, !365, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !496, !498, !526, !528, !529, !530, !534, !538, !539, !540, !544, !548, !549, !550, !555, !558, !559, !638, !655, !814, !815, !816, !817, !821, !822, !823, !824, !825, !826, !827, !842, !1035, !1039, !1100, !1103, !1105, !1107, !1108, !1111, !1116, !1124, !1125, !1133, !1135, !1140, !1215, !1301, !1345, !1367, !1416, !1445}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !188, file: !48, line: 384, baseType: !191, size: 5632)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !18, line: 376, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !18, line: 176, size: 5632, elements: !193)
!193 = !{!194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !237, !241, !242, !243, !244, !248, !249, !262, !263, !264, !265, !266, !294, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !192, file: !18, line: 179, baseType: !7, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !192, file: !18, line: 180, baseType: !145, size: 32, offset: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !192, file: !18, line: 181, baseType: !145, size: 32, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !192, file: !18, line: 182, baseType: !145, size: 32, offset: 96)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !192, file: !18, line: 183, baseType: !145, size: 32, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !192, file: !18, line: 186, baseType: !145, size: 32, offset: 160)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !192, file: !18, line: 187, baseType: !145, size: 32, offset: 192)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !192, file: !18, line: 188, baseType: !145, size: 32, offset: 224)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !192, file: !18, line: 189, baseType: !145, size: 32, offset: 256)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !192, file: !18, line: 190, baseType: !145, size: 32, offset: 288)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !192, file: !18, line: 198, baseType: !145, size: 32, offset: 320)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !192, file: !18, line: 215, baseType: !206, size: 288, offset: 352)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !192, file: !18, line: 200, size: 288, elements: !207)
!207 = !{!208, !209, !210, !211, !212, !213, !214, !215, !216}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !206, file: !18, line: 203, baseType: !145, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !206, file: !18, line: 204, baseType: !145, size: 32, offset: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !206, file: !18, line: 206, baseType: !145, size: 32, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !206, file: !18, line: 209, baseType: !145, size: 32, offset: 96)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !206, file: !18, line: 210, baseType: !145, size: 32, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !206, file: !18, line: 211, baseType: !145, size: 32, offset: 160)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !206, file: !18, line: 212, baseType: !145, size: 32, offset: 192)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !206, file: !18, line: 213, baseType: !145, size: 32, offset: 224)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !206, file: !18, line: 214, baseType: !145, size: 32, offset: 256)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !192, file: !18, line: 218, baseType: !145, size: 32, offset: 640)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !192, file: !18, line: 219, baseType: !145, size: 32, offset: 672)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !192, file: !18, line: 220, baseType: !145, size: 32, offset: 704)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !192, file: !18, line: 221, baseType: !145, size: 32, offset: 736)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !192, file: !18, line: 222, baseType: !145, size: 32, offset: 768)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !192, file: !18, line: 224, baseType: !145, size: 32, offset: 800)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !192, file: !18, line: 225, baseType: !145, size: 32, offset: 832)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !192, file: !18, line: 226, baseType: !145, size: 32, offset: 864)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !192, file: !18, line: 227, baseType: !145, size: 32, offset: 896)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !192, file: !18, line: 229, baseType: !145, size: 32, offset: 928)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !192, file: !18, line: 230, baseType: !145, size: 32, offset: 960)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !192, file: !18, line: 231, baseType: !145, size: 32, offset: 992)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !192, file: !18, line: 233, baseType: !145, size: 32, offset: 1024)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !192, file: !18, line: 234, baseType: !145, size: 32, offset: 1056)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !192, file: !18, line: 236, baseType: !145, size: 32, offset: 1088)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !192, file: !18, line: 237, baseType: !145, size: 32, offset: 1120)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !192, file: !18, line: 239, baseType: !145, size: 32, offset: 1152)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !192, file: !18, line: 240, baseType: !235, size: 64, offset: 1216)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !192, file: !18, line: 241, baseType: !238, size: 128, offset: 1280)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 128, elements: !239)
!239 = !{!240}
!240 = !DISubrange(count: 16)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !192, file: !18, line: 242, baseType: !238, size: 128, offset: 1408)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !192, file: !18, line: 243, baseType: !238, size: 128, offset: 1536)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !192, file: !18, line: 244, baseType: !238, size: 128, offset: 1664)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !192, file: !18, line: 245, baseType: !245, size: 512, offset: 1792)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 512, elements: !246)
!246 = !{!247}
!247 = !DISubrange(count: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !192, file: !18, line: 246, baseType: !245, size: 512, offset: 2304)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !192, file: !18, line: 249, baseType: !250, size: 64, offset: 2816)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{null, !146, !145, !253, !255}
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !236)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, size: 192, elements: !257)
!257 = !{!258, !259, !260, !261}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !256, file: !3, baseType: !7, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !256, file: !3, baseType: !7, size: 32, offset: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !256, file: !3, baseType: !146, size: 64, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !256, file: !3, baseType: !146, size: 64, offset: 128)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !192, file: !18, line: 250, baseType: !146, size: 64, offset: 2880)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !192, file: !18, line: 251, baseType: !145, size: 32, offset: 2944)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !192, file: !18, line: 252, baseType: !145, size: 32, offset: 2976)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !192, file: !18, line: 253, baseType: !235, size: 64, offset: 3008)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !192, file: !18, line: 287, baseType: !267, size: 800, offset: 3072)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !192, file: !18, line: 256, size: 800, elements: !268)
!268 = !{!269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !292, !293}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !267, file: !18, line: 258, baseType: !7, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !267, file: !18, line: 259, baseType: !7, size: 32, offset: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !267, file: !18, line: 261, baseType: !145, size: 32, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !267, file: !18, line: 262, baseType: !145, size: 32, offset: 96)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !267, file: !18, line: 263, baseType: !145, size: 32, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !267, file: !18, line: 264, baseType: !145, size: 32, offset: 160)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !267, file: !18, line: 265, baseType: !145, size: 32, offset: 192)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !267, file: !18, line: 267, baseType: !145, size: 32, offset: 224)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !267, file: !18, line: 268, baseType: !145, size: 32, offset: 256)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !267, file: !18, line: 269, baseType: !145, size: 32, offset: 288)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !267, file: !18, line: 270, baseType: !145, size: 32, offset: 320)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !267, file: !18, line: 271, baseType: !145, size: 32, offset: 352)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !267, file: !18, line: 272, baseType: !145, size: 32, offset: 384)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !267, file: !18, line: 273, baseType: !145, size: 32, offset: 416)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !267, file: !18, line: 274, baseType: !145, size: 32, offset: 448)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !267, file: !18, line: 275, baseType: !145, size: 32, offset: 480)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !267, file: !18, line: 276, baseType: !145, size: 32, offset: 512)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !267, file: !18, line: 277, baseType: !145, size: 32, offset: 544)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !267, file: !18, line: 278, baseType: !147, size: 32, offset: 576)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !267, file: !18, line: 279, baseType: !147, size: 32, offset: 608)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !267, file: !18, line: 280, baseType: !145, size: 32, offset: 640)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !267, file: !18, line: 283, baseType: !291, size: 64, offset: 672)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 64, elements: !170)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !267, file: !18, line: 285, baseType: !145, size: 32, offset: 736)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !267, file: !18, line: 286, baseType: !145, size: 32, offset: 768)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !192, file: !18, line: 327, baseType: !295, size: 1152, offset: 3904)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !192, file: !18, line: 290, size: 1152, elements: !296)
!296 = !{!297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !334, !335}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !295, file: !18, line: 292, baseType: !145, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !295, file: !18, line: 294, baseType: !145, size: 32, offset: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !295, file: !18, line: 295, baseType: !145, size: 32, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !295, file: !18, line: 296, baseType: !145, size: 32, offset: 96)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !295, file: !18, line: 297, baseType: !145, size: 32, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !295, file: !18, line: 299, baseType: !145, size: 32, offset: 160)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !295, file: !18, line: 300, baseType: !147, size: 32, offset: 192)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !295, file: !18, line: 301, baseType: !147, size: 32, offset: 224)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !295, file: !18, line: 302, baseType: !147, size: 32, offset: 256)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !295, file: !18, line: 303, baseType: !145, size: 32, offset: 288)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !295, file: !18, line: 304, baseType: !145, size: 32, offset: 320)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !295, file: !18, line: 305, baseType: !147, size: 32, offset: 352)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !295, file: !18, line: 306, baseType: !147, size: 32, offset: 384)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !295, file: !18, line: 307, baseType: !147, size: 32, offset: 416)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !295, file: !18, line: 309, baseType: !145, size: 32, offset: 448)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !295, file: !18, line: 310, baseType: !147, size: 32, offset: 480)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !295, file: !18, line: 311, baseType: !145, size: 32, offset: 512)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !295, file: !18, line: 312, baseType: !145, size: 32, offset: 544)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !295, file: !18, line: 315, baseType: !145, size: 32, offset: 576)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !295, file: !18, line: 316, baseType: !235, size: 64, offset: 640)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !295, file: !18, line: 317, baseType: !145, size: 32, offset: 704)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !295, file: !18, line: 318, baseType: !235, size: 64, offset: 768)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !295, file: !18, line: 321, baseType: !147, size: 32, offset: 832)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !295, file: !18, line: 322, baseType: !147, size: 32, offset: 864)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !295, file: !18, line: 323, baseType: !147, size: 32, offset: 896)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !295, file: !18, line: 324, baseType: !323, size: 64, offset: 960)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !18, line: 174, baseType: !325)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 167, size: 256, elements: !326)
!326 = !{!327, !328, !329, !330, !331, !332}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !325, file: !18, line: 169, baseType: !145, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !325, file: !18, line: 169, baseType: !145, size: 32, offset: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !325, file: !18, line: 170, baseType: !145, size: 32, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !325, file: !18, line: 171, baseType: !145, size: 32, offset: 96)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !325, file: !18, line: 172, baseType: !147, size: 32, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !325, file: !18, line: 173, baseType: !333, size: 64, offset: 192)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !295, file: !18, line: 325, baseType: !145, size: 32, offset: 1024)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !295, file: !18, line: 326, baseType: !235, size: 64, offset: 1088)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !192, file: !18, line: 330, baseType: !145, size: 32, offset: 5056)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !192, file: !18, line: 331, baseType: !145, size: 32, offset: 5088)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !192, file: !18, line: 332, baseType: !145, size: 32, offset: 5120)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !192, file: !18, line: 334, baseType: !145, size: 32, offset: 5152)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !192, file: !18, line: 335, baseType: !145, size: 32, offset: 5184)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !192, file: !18, line: 336, baseType: !163, size: 32, offset: 5216)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !192, file: !18, line: 337, baseType: !163, size: 32, offset: 5248)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !192, file: !18, line: 338, baseType: !163, size: 32, offset: 5280)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !192, file: !18, line: 339, baseType: !163, size: 32, offset: 5312)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !192, file: !18, line: 340, baseType: !145, size: 32, offset: 5344)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !192, file: !18, line: 344, baseType: !145, size: 32, offset: 5376)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !192, file: !18, line: 356, baseType: !145, size: 32, offset: 5408)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !192, file: !18, line: 364, baseType: !145, size: 32, offset: 5440)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !192, file: !18, line: 367, baseType: !145, size: 32, offset: 5472)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !192, file: !18, line: 368, baseType: !145, size: 32, offset: 5504)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !192, file: !18, line: 369, baseType: !145, size: 32, offset: 5536)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !192, file: !18, line: 375, baseType: !353, size: 64, offset: 5568)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{null, !146}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !188, file: !48, line: 386, baseType: !357, size: 8256, offset: 5632)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 8256, elements: !358)
!358 = !{!359}
!359 = !DISubrange(count: 129)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "thread_handle", scope: !188, file: !48, line: 387, baseType: !145, size: 32, offset: 13888)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "b_thread_active", scope: !188, file: !48, line: 388, baseType: !145, size: 32, offset: 13920)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_phase", scope: !188, file: !48, line: 389, baseType: !145, size: 32, offset: 13952)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_start", scope: !188, file: !48, line: 390, baseType: !145, size: 32, offset: 13984)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_end", scope: !188, file: !48, line: 391, baseType: !145, size: 32, offset: 14016)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !188, file: !48, line: 402, baseType: !366, size: 576, offset: 14080)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !188, file: !48, line: 394, size: 576, elements: !367)
!367 = !{!368, !369, !370, !379, !380, !381}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal", scope: !366, file: !48, line: 396, baseType: !145, size: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "i_nals_allocated", scope: !366, file: !48, line: 397, baseType: !145, size: 32, offset: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "nal", scope: !366, file: !48, line: 398, baseType: !371, size: 64, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !18, line: 604, baseType: !373)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 593, size: 192, elements: !374)
!374 = !{!375, !376, !377, !378}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !373, file: !18, line: 595, baseType: !145, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !373, file: !18, line: 596, baseType: !145, size: 32, offset: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !373, file: !18, line: 599, baseType: !145, size: 32, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !373, file: !18, line: 603, baseType: !152, size: 64, offset: 128)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitstream", scope: !366, file: !48, line: 399, baseType: !145, size: 32, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "p_bitstream", scope: !366, file: !48, line: 400, baseType: !152, size: 64, offset: 192)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !366, file: !48, line: 401, baseType: !382, size: 320, offset: 256)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "bs_t", file: !383, line: 56, baseType: !384)
!383 = !DIFile(filename: "x264_src/common/bs.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bs_s", file: !383, line: 47, size: 320, elements: !385)
!385 = !{!386, !387, !388, !389, !390, !391}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !384, file: !383, line: 49, baseType: !152, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !384, file: !383, line: 50, baseType: !152, size: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !384, file: !383, line: 51, baseType: !152, size: 64, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "cur_bits", scope: !384, file: !383, line: 53, baseType: !148, size: 64, offset: 192)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !384, file: !383, line: 54, baseType: !145, size: 32, offset: 256)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "i_bits_encoded", scope: !384, file: !383, line: 55, baseType: !145, size: 32, offset: 288)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer", scope: !188, file: !48, line: 404, baseType: !152, size: 64, offset: 14656)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer_size", scope: !188, file: !48, line: 405, baseType: !145, size: 32, offset: 14720)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !188, file: !48, line: 410, baseType: !145, size: 32, offset: 14752)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !188, file: !48, line: 411, baseType: !145, size: 32, offset: 14784)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_frames", scope: !188, file: !48, line: 413, baseType: !145, size: 32, offset: 14816)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_type", scope: !188, file: !48, line: 415, baseType: !145, size: 32, offset: 14848)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_ref_idc", scope: !188, file: !48, line: 416, baseType: !145, size: 32, offset: 14880)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields", scope: !188, file: !48, line: 418, baseType: !145, size: 32, offset: 14912)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields_last_frame", scope: !188, file: !48, line: 419, baseType: !145, size: 32, offset: 14944)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_duration", scope: !188, file: !48, line: 420, baseType: !145, size: 32, offset: 14976)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields", scope: !188, file: !48, line: 421, baseType: !145, size: 32, offset: 15008)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !188, file: !48, line: 422, baseType: !145, size: 32, offset: 15040)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !188, file: !48, line: 424, baseType: !145, size: 32, offset: 15072)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !188, file: !48, line: 425, baseType: !145, size: 32, offset: 15104)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "b_queued_intra_refresh", scope: !188, file: !48, line: 427, baseType: !145, size: 32, offset: 15136)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "sps_array", scope: !188, file: !48, line: 430, baseType: !408, size: 10400, offset: 15168)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !409, size: 10400, elements: !494)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_sps_t", file: !6, line: 154, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 52, size: 10400, elements: !411)
!411 = !{!412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !429, !430, !431, !432, !433, !434, !435, !436, !437, !444, !445, !493}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !410, file: !6, line: 54, baseType: !145, size: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "i_profile_idc", scope: !410, file: !6, line: 56, baseType: !145, size: 32, offset: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !410, file: !6, line: 57, baseType: !145, size: 32, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set0", scope: !410, file: !6, line: 59, baseType: !145, size: 32, offset: 96)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set1", scope: !410, file: !6, line: 60, baseType: !145, size: 32, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set2", scope: !410, file: !6, line: 61, baseType: !145, size: 32, offset: 160)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_frame_num", scope: !410, file: !6, line: 63, baseType: !145, size: 32, offset: 192)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_type", scope: !410, file: !6, line: 65, baseType: !145, size: 32, offset: 224)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_poc_lsb", scope: !410, file: !6, line: 67, baseType: !145, size: 32, offset: 256)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "b_delta_pic_order_always_zero", scope: !410, file: !6, line: 69, baseType: !145, size: 32, offset: 288)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_non_ref_pic", scope: !410, file: !6, line: 70, baseType: !145, size: 32, offset: 320)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_top_to_bottom_field", scope: !410, file: !6, line: 71, baseType: !145, size: 32, offset: 352)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames_in_poc_cycle", scope: !410, file: !6, line: 72, baseType: !145, size: 32, offset: 384)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_ref_frame", scope: !410, file: !6, line: 73, baseType: !426, size: 8192, offset: 416)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 8192, elements: !427)
!427 = !{!428}
!428 = !DISubrange(count: 256)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames", scope: !410, file: !6, line: 75, baseType: !145, size: 32, offset: 8608)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "b_gaps_in_frame_num_value_allowed", scope: !410, file: !6, line: 76, baseType: !145, size: 32, offset: 8640)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_width", scope: !410, file: !6, line: 77, baseType: !145, size: 32, offset: 8672)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_height", scope: !410, file: !6, line: 78, baseType: !145, size: 32, offset: 8704)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_mbs_only", scope: !410, file: !6, line: 79, baseType: !145, size: 32, offset: 8736)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_adaptive_frame_field", scope: !410, file: !6, line: 80, baseType: !145, size: 32, offset: 8768)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct8x8_inference", scope: !410, file: !6, line: 81, baseType: !145, size: 32, offset: 8800)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "b_crop", scope: !410, file: !6, line: 83, baseType: !145, size: 32, offset: 8832)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !410, file: !6, line: 90, baseType: !438, size: 128, offset: 8864)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !410, file: !6, line: 84, size: 128, elements: !439)
!439 = !{!440, !441, !442, !443}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !438, file: !6, line: 86, baseType: !145, size: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "i_right", scope: !438, file: !6, line: 87, baseType: !145, size: 32, offset: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "i_top", scope: !438, file: !6, line: 88, baseType: !145, size: 32, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "i_bottom", scope: !438, file: !6, line: 89, baseType: !145, size: 32, offset: 96)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "b_vui", scope: !410, file: !6, line: 92, baseType: !145, size: 32, offset: 8992)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !410, file: !6, line: 150, baseType: !446, size: 1344, offset: 9024)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !410, file: !6, line: 93, size: 1344, elements: !447)
!447 = !{!448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !484, !485, !486, !487, !488, !489, !490, !491, !492}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "b_aspect_ratio_info_present", scope: !446, file: !6, line: 95, baseType: !145, size: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !446, file: !6, line: 96, baseType: !145, size: 32, offset: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !446, file: !6, line: 97, baseType: !145, size: 32, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info_present", scope: !446, file: !6, line: 99, baseType: !145, size: 32, offset: 96)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info", scope: !446, file: !6, line: 100, baseType: !145, size: 32, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "b_signal_type_present", scope: !446, file: !6, line: 102, baseType: !145, size: 32, offset: 160)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !446, file: !6, line: 103, baseType: !145, size: 32, offset: 192)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !446, file: !6, line: 104, baseType: !145, size: 32, offset: 224)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "b_color_description_present", scope: !446, file: !6, line: 105, baseType: !145, size: 32, offset: 256)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !446, file: !6, line: 106, baseType: !145, size: 32, offset: 288)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !446, file: !6, line: 107, baseType: !145, size: 32, offset: 320)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !446, file: !6, line: 108, baseType: !145, size: 32, offset: 352)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_loc_info_present", scope: !446, file: !6, line: 110, baseType: !145, size: 32, offset: 384)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_top", scope: !446, file: !6, line: 111, baseType: !145, size: 32, offset: 416)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_bottom", scope: !446, file: !6, line: 112, baseType: !145, size: 32, offset: 448)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "b_timing_info_present", scope: !446, file: !6, line: 114, baseType: !145, size: 32, offset: 480)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_units_in_tick", scope: !446, file: !6, line: 115, baseType: !163, size: 32, offset: 512)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_scale", scope: !446, file: !6, line: 116, baseType: !163, size: 32, offset: 544)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "b_fixed_frame_rate", scope: !446, file: !6, line: 117, baseType: !145, size: 32, offset: 576)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "b_nal_hrd_parameters_present", scope: !446, file: !6, line: 119, baseType: !145, size: 32, offset: 608)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "b_vcl_hrd_parameters_present", scope: !446, file: !6, line: 120, baseType: !145, size: 32, offset: 640)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "hrd", scope: !446, file: !6, line: 137, baseType: !470, size: 384, offset: 672)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !446, file: !6, line: 122, size: 384, elements: !471)
!471 = !{!472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_cnt", scope: !470, file: !6, line: 124, baseType: !145, size: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_scale", scope: !470, file: !6, line: 125, baseType: !145, size: 32, offset: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_scale", scope: !470, file: !6, line: 126, baseType: !145, size: 32, offset: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_value", scope: !470, file: !6, line: 127, baseType: !145, size: 32, offset: 96)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_value", scope: !470, file: !6, line: 128, baseType: !145, size: 32, offset: 128)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_unscaled", scope: !470, file: !6, line: 129, baseType: !145, size: 32, offset: 160)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_unscaled", scope: !470, file: !6, line: 130, baseType: !145, size: 32, offset: 192)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "b_cbr_hrd", scope: !470, file: !6, line: 131, baseType: !145, size: 32, offset: 224)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "i_initial_cpb_removal_delay_length", scope: !470, file: !6, line: 133, baseType: !145, size: 32, offset: 256)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_removal_delay_length", scope: !470, file: !6, line: 134, baseType: !145, size: 32, offset: 288)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay_length", scope: !470, file: !6, line: 135, baseType: !145, size: 32, offset: 320)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_offset_length", scope: !470, file: !6, line: 136, baseType: !145, size: 32, offset: 352)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct_present", scope: !446, file: !6, line: 139, baseType: !145, size: 32, offset: 1056)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "b_bitstream_restriction", scope: !446, file: !6, line: 140, baseType: !145, size: 32, offset: 1088)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "b_motion_vectors_over_pic_boundaries", scope: !446, file: !6, line: 141, baseType: !145, size: 32, offset: 1120)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bytes_per_pic_denom", scope: !446, file: !6, line: 142, baseType: !145, size: 32, offset: 1152)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bits_per_mb_denom", scope: !446, file: !6, line: 143, baseType: !145, size: 32, offset: 1184)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_horizontal", scope: !446, file: !6, line: 144, baseType: !145, size: 32, offset: 1216)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_vertical", scope: !446, file: !6, line: 145, baseType: !145, size: 32, offset: 1248)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_reorder_frames", scope: !446, file: !6, line: 146, baseType: !145, size: 32, offset: 1280)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dec_frame_buffering", scope: !446, file: !6, line: 147, baseType: !145, size: 32, offset: 1312)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "b_qpprime_y_zero_transform_bypass", scope: !410, file: !6, line: 152, baseType: !145, size: 32, offset: 10368)
!494 = !{!495}
!495 = !DISubrange(count: 1)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !188, file: !48, line: 431, baseType: !497, size: 64, offset: 25600)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "pps_array", scope: !188, file: !48, line: 432, baseType: !499, size: 960, offset: 25664)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !500, size: 960, elements: !494)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pps_t", file: !6, line: 186, baseType: !501)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 156, size: 960, elements: !502)
!502 = !{!503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !501, file: !6, line: 158, baseType: !145, size: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !501, file: !6, line: 159, baseType: !145, size: 32, offset: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !501, file: !6, line: 161, baseType: !145, size: 32, offset: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_order", scope: !501, file: !6, line: 163, baseType: !145, size: 32, offset: 96)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_slice_groups", scope: !501, file: !6, line: 164, baseType: !145, size: 32, offset: 128)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_default_active", scope: !501, file: !6, line: 166, baseType: !145, size: 32, offset: 160)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_default_active", scope: !501, file: !6, line: 167, baseType: !145, size: 32, offset: 192)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_pred", scope: !501, file: !6, line: 169, baseType: !145, size: 32, offset: 224)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !501, file: !6, line: 170, baseType: !145, size: 32, offset: 256)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qp", scope: !501, file: !6, line: 172, baseType: !145, size: 32, offset: 288)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qs", scope: !501, file: !6, line: 173, baseType: !145, size: 32, offset: 320)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_index_offset", scope: !501, file: !6, line: 175, baseType: !145, size: 32, offset: 352)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter_control", scope: !501, file: !6, line: 177, baseType: !145, size: 32, offset: 384)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra_pred", scope: !501, file: !6, line: 178, baseType: !145, size: 32, offset: 416)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "b_redundant_pic_cnt", scope: !501, file: !6, line: 179, baseType: !145, size: 32, offset: 448)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8_mode", scope: !501, file: !6, line: 181, baseType: !145, size: 32, offset: 480)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !501, file: !6, line: 183, baseType: !145, size: 32, offset: 512)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !501, file: !6, line: 184, baseType: !521, size: 384, offset: 576)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !522, size: 384, elements: !524)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !153)
!524 = !{!525}
!525 = !DISubrange(count: 6)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !188, file: !48, line: 433, baseType: !527, size: 64, offset: 26624)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !188, file: !48, line: 434, baseType: !145, size: 32, offset: 26688)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts_compress_multiplier", scope: !188, file: !48, line: 437, baseType: !145, size: 32, offset: 26720)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_mf", scope: !188, file: !48, line: 440, baseType: !531, size: 256, offset: 26752)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !532, size: 256, elements: !174)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 512, elements: !239)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_mf", scope: !188, file: !48, line: 441, baseType: !535, size: 128, offset: 27008)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !536, size: 128, elements: !170)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 2048, elements: !246)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "unquant4_mf", scope: !188, file: !48, line: 443, baseType: !531, size: 256, offset: 27136)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "unquant8_mf", scope: !188, file: !48, line: 444, baseType: !535, size: 128, offset: 27392)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_mf", scope: !188, file: !48, line: 446, baseType: !541, size: 256, offset: 27520)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !542, size: 256, elements: !174)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 256, elements: !239)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_mf", scope: !188, file: !48, line: 447, baseType: !545, size: 128, offset: 27776)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 128, elements: !170)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 1024, elements: !246)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_bias", scope: !188, file: !48, line: 448, baseType: !541, size: 256, offset: 27904)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_bias", scope: !188, file: !48, line: 449, baseType: !545, size: 128, offset: 28160)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv", scope: !188, file: !48, line: 454, baseType: !551, size: 5888, offset: 28288)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !552, size: 5888, elements: !553)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!553 = !{!554}
!554 = !DISubrange(count: 92)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv_fpel", scope: !188, file: !48, line: 455, baseType: !556, size: 23552, offset: 34176)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !552, size: 23552, elements: !557)
!557 = !{!554, !175}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !188, file: !48, line: 457, baseType: !522, size: 64, offset: 57728)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !188, file: !48, line: 460, baseType: !560, size: 53376, offset: 57856)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_slice_header_t", file: !48, line: 364, baseType: !561)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !48, line: 302, size: 53376, elements: !562)
!562 = !{!563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !591, !622, !623, !624, !630, !631, !632, !633, !634, !635, !636, !637}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !561, file: !48, line: 304, baseType: !497, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !561, file: !48, line: 305, baseType: !527, size: 64, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !561, file: !48, line: 307, baseType: !145, size: 32, offset: 128)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "i_first_mb", scope: !561, file: !48, line: 308, baseType: !145, size: 32, offset: 160)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_mb", scope: !561, file: !48, line: 309, baseType: !145, size: 32, offset: 192)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "i_pps_id", scope: !561, file: !48, line: 311, baseType: !145, size: 32, offset: 224)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !561, file: !48, line: 313, baseType: !145, size: 32, offset: 256)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "b_mbaff", scope: !561, file: !48, line: 315, baseType: !145, size: 32, offset: 288)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "b_field_pic", scope: !561, file: !48, line: 316, baseType: !145, size: 32, offset: 320)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "b_bottom_field", scope: !561, file: !48, line: 317, baseType: !145, size: 32, offset: 352)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !561, file: !48, line: 319, baseType: !145, size: 32, offset: 384)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !561, file: !48, line: 321, baseType: !145, size: 32, offset: 416)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc_bottom", scope: !561, file: !48, line: 322, baseType: !145, size: 32, offset: 448)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc", scope: !561, file: !48, line: 324, baseType: !291, size: 64, offset: 480)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "i_redundant_pic_cnt", scope: !561, file: !48, line: 325, baseType: !145, size: 32, offset: 544)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_spatial_mv_pred", scope: !561, file: !48, line: 327, baseType: !145, size: 32, offset: 576)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "b_num_ref_idx_override", scope: !561, file: !48, line: 329, baseType: !145, size: 32, offset: 608)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !561, file: !48, line: 330, baseType: !145, size: 32, offset: 640)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !561, file: !48, line: 331, baseType: !145, size: 32, offset: 672)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l0", scope: !561, file: !48, line: 333, baseType: !145, size: 32, offset: 704)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l1", scope: !561, file: !48, line: 334, baseType: !145, size: 32, offset: 736)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_order", scope: !561, file: !48, line: 339, baseType: !585, size: 2048, offset: 768)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !586, size: 2048, elements: !590)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !561, file: !48, line: 335, size: 64, elements: !587)
!587 = !{!588, !589}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "idc", scope: !586, file: !48, line: 337, baseType: !145, size: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !586, file: !48, line: 338, baseType: !145, size: 32, offset: 32)
!590 = !{!171, !240}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !561, file: !48, line: 342, baseType: !592, size: 49152, offset: 2816)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !593, size: 49152, elements: !619)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_weight_t", file: !594, line: 36, baseType: !595, align: 128)
!594 = !DIFile(filename: "x264_src/common/mc.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_weight_t", file: !594, line: 26, size: 512, elements: !596)
!596 = !{!597, !605, !606, !609, !610, !611}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "cachea", scope: !595, file: !594, line: 30, baseType: !598, size: 128, align: 128)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !599, size: 128, elements: !603)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !600, line: 25, baseType: !601)
!600 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !156, line: 39, baseType: !602)
!602 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!603 = !{!604}
!604 = !DISubrange(count: 8)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "cacheb", scope: !595, file: !594, line: 31, baseType: !598, size: 128, offset: 128)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "i_denom", scope: !595, file: !594, line: 32, baseType: !607, size: 32, offset: 256)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !600, line: 26, baseType: !608)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !156, line: 41, baseType: !145)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "i_scale", scope: !595, file: !594, line: 33, baseType: !607, size: 32, offset: 288)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset", scope: !595, file: !594, line: 34, baseType: !607, size: 32, offset: 320)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "weightfn", scope: !595, file: !594, line: 35, baseType: !612, size: 64, offset: 384)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "weight_fn_t", file: !594, line: 25, baseType: !614)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DISubroutineType(types: !616)
!616 = !{null, !152, !145, !152, !145, !617, !145}
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !595)
!619 = !{!620, !621}
!620 = !DISubrange(count: 32)
!621 = !DISubrange(count: 3)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_remove_from_end", scope: !561, file: !48, line: 344, baseType: !145, size: 32, offset: 51968)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_command_count", scope: !561, file: !48, line: 345, baseType: !145, size: 32, offset: 52000)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "mmco", scope: !561, file: !48, line: 350, baseType: !625, size: 1024, offset: 52032)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !626, size: 1024, elements: !239)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !561, file: !48, line: 346, size: 64, elements: !627)
!627 = !{!628, !629}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "i_difference_of_pic_nums", scope: !626, file: !48, line: 348, baseType: !145, size: 32)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !626, file: !48, line: 349, baseType: !145, size: 32, offset: 32)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !561, file: !48, line: 352, baseType: !145, size: 32, offset: 53056)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !561, file: !48, line: 354, baseType: !145, size: 32, offset: 53088)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_delta", scope: !561, file: !48, line: 355, baseType: !145, size: 32, offset: 53120)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "b_sp_for_swidth", scope: !561, file: !48, line: 356, baseType: !145, size: 32, offset: 53152)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "i_qs_delta", scope: !561, file: !48, line: 357, baseType: !145, size: 32, offset: 53184)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "i_disable_deblocking_filter_idc", scope: !561, file: !48, line: 360, baseType: !145, size: 32, offset: 53216)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "i_alpha_c0_offset", scope: !561, file: !48, line: 361, baseType: !145, size: 32, offset: 53248)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "i_beta_offset", scope: !561, file: !48, line: 362, baseType: !145, size: 32, offset: 53280)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !188, file: !48, line: 463, baseType: !639, size: 4096, offset: 111232)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_cabac_t", file: !640, line: 46, baseType: !641)
!640 = !DIFile(filename: "x264_src/common/cabac.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !640, line: 27, size: 4096, elements: !642)
!642 = !{!643, !644, !645, !646, !647, !648, !649, !650, !651}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "i_low", scope: !641, file: !640, line: 30, baseType: !145, size: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "i_range", scope: !641, file: !640, line: 31, baseType: !145, size: 32, offset: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "i_queue", scope: !641, file: !640, line: 34, baseType: !145, size: 32, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "i_bytes_outstanding", scope: !641, file: !640, line: 35, baseType: !145, size: 32, offset: 96)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !641, file: !640, line: 37, baseType: !152, size: 64, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !641, file: !640, line: 38, baseType: !152, size: 64, offset: 192)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !641, file: !640, line: 39, baseType: !152, size: 64, offset: 256)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "f8_bits_encoded", scope: !641, file: !640, line: 42, baseType: !145, size: 32, align: 128, offset: 384)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !641, file: !640, line: 45, baseType: !652, size: 3680, offset: 416)
!652 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 3680, elements: !653)
!653 = !{!654}
!654 = !DISubrange(count: 460)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !188, file: !48, line: 494, baseType: !656, size: 2112, offset: 115328)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !188, file: !48, line: 465, size: 2112, elements: !657)
!657 = !{!658, !794, !796, !797, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !810, !811, !812, !813}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !656, file: !48, line: 468, baseType: !659, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_frame_t", file: !662, line: 146, baseType: !663)
!662 = !DIFile(filename: "x264_src/common/frame.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_frame", file: !662, line: 31, size: 125056, elements: !664)
!664 = !{!665, !666, !667, !668, !671, !672, !673, !674, !675, !676, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !695, !696, !697, !698, !699, !700, !702, !704, !705, !706, !707, !708, !711, !713, !714, !716, !721, !722, !726, !727, !731, !735, !737, !739, !740, !742, !743, !745, !746, !747, !750, !752, !753, !754, !756, !757, !758, !759, !760, !761, !762, !763, !765, !766, !767, !775, !779, !781, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !663, file: !662, line: 34, baseType: !145, size: 32)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !663, file: !662, line: 35, baseType: !145, size: 32, offset: 32)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !663, file: !662, line: 36, baseType: !145, size: 32, offset: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !663, file: !662, line: 37, baseType: !669, size: 64, offset: 128)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !600, line: 27, baseType: !670)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !156, line: 44, baseType: !150)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts", scope: !663, file: !662, line: 38, baseType: !669, size: 64, offset: 192)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "i_duration", scope: !663, file: !662, line: 39, baseType: !145, size: 32, offset: 256)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_duration", scope: !663, file: !662, line: 40, baseType: !145, size: 32, offset: 288)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !663, file: !662, line: 41, baseType: !145, size: 32, offset: 320)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay", scope: !663, file: !662, line: 42, baseType: !145, size: 32, offset: 352)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !663, file: !662, line: 43, baseType: !677, size: 64, offset: 384)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !663, file: !662, line: 45, baseType: !145, size: 32, offset: 448)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded", scope: !663, file: !662, line: 46, baseType: !145, size: 32, offset: 480)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "i_field_cnt", scope: !663, file: !662, line: 47, baseType: !145, size: 32, offset: 512)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !663, file: !662, line: 48, baseType: !145, size: 32, offset: 544)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "b_kept_as_ref", scope: !663, file: !662, line: 49, baseType: !145, size: 32, offset: 576)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_struct", scope: !663, file: !662, line: 50, baseType: !145, size: 32, offset: 608)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "b_keyframe", scope: !663, file: !662, line: 51, baseType: !145, size: 32, offset: 640)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "b_fdec", scope: !663, file: !662, line: 52, baseType: !153, size: 8, offset: 672)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_minigop_bframe", scope: !663, file: !662, line: 53, baseType: !153, size: 8, offset: 680)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframes", scope: !663, file: !662, line: 54, baseType: !153, size: 8, offset: 688)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_rc", scope: !663, file: !662, line: 55, baseType: !147, size: 32, offset: 704)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_aq", scope: !663, file: !662, line: 56, baseType: !147, size: 32, offset: 736)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_l0ref0", scope: !663, file: !662, line: 57, baseType: !145, size: 32, offset: 768)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !663, file: !662, line: 60, baseType: !145, size: 32, offset: 800)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !663, file: !662, line: 61, baseType: !693, size: 96, offset: 832)
!693 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 96, elements: !694)
!694 = !{!621}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !663, file: !662, line: 62, baseType: !693, size: 96, offset: 928)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines", scope: !663, file: !662, line: 63, baseType: !693, size: 96, offset: 1024)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride_lowres", scope: !663, file: !662, line: 64, baseType: !145, size: 32, offset: 1120)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "i_width_lowres", scope: !663, file: !662, line: 65, baseType: !145, size: 32, offset: 1152)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_lowres", scope: !663, file: !662, line: 66, baseType: !145, size: 32, offset: 1184)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !663, file: !662, line: 67, baseType: !701, size: 192, offset: 1216)
!701 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 192, elements: !694)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "filtered", scope: !663, file: !662, line: 68, baseType: !703, size: 256, offset: 1408)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 256, elements: !174)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !663, file: !662, line: 69, baseType: !703, size: 256, offset: 1664)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "integral", scope: !663, file: !662, line: 70, baseType: !552, size: 64, offset: 1920)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !663, file: !662, line: 74, baseType: !703, size: 256, offset: 1984)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_lowres", scope: !663, file: !662, line: 75, baseType: !703, size: 256, offset: 2240)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !663, file: !662, line: 77, baseType: !709, size: 24576, offset: 2560)
!709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !593, size: 24576, elements: !710)
!710 = !{!240, !621}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "weighted", scope: !663, file: !662, line: 78, baseType: !712, size: 1024, offset: 27136)
!712 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 1024, elements: !239)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "b_duplicate", scope: !663, file: !662, line: 79, baseType: !145, size: 32, offset: 28160)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !663, file: !662, line: 80, baseType: !715, size: 64, offset: 28224)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !663, file: !662, line: 83, baseType: !717, size: 64, offset: 28288)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !600, line: 24, baseType: !719)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !156, line: 37, baseType: !720)
!720 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "mb_partition", scope: !663, file: !662, line: 84, baseType: !152, size: 64, offset: 28352)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !663, file: !662, line: 85, baseType: !723, size: 128, offset: 28416)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !724, size: 128, elements: !170)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !599, size: 32, elements: !170)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "mv16x16", scope: !663, file: !662, line: 86, baseType: !724, size: 64, offset: 28544)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mvs", scope: !663, file: !662, line: 87, baseType: !728, size: 2176, offset: 28608)
!728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !724, size: 2176, elements: !729)
!729 = !{!171, !730}
!730 = !DISubrange(count: 17)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_costs", scope: !663, file: !662, line: 92, baseType: !732, size: 20736, offset: 30784)
!732 = !DICompositeType(tag: DW_TAG_array_type, baseType: !552, size: 20736, elements: !733)
!733 = !{!734, !734}
!734 = !DISubrange(count: 18)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mv_costs", scope: !663, file: !662, line: 96, baseType: !736, size: 2176, offset: 51520)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 2176, elements: !729)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !663, file: !662, line: 97, baseType: !738, size: 128, offset: 53696)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !717, size: 128, elements: !170)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref", scope: !663, file: !662, line: 98, baseType: !291, size: 64, offset: 53824)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc", scope: !663, file: !662, line: 99, baseType: !741, size: 1024, offset: 53888)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 1024, elements: !590)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "inv_ref_poc", scope: !663, file: !662, line: 100, baseType: !725, size: 32, offset: 54912)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est", scope: !663, file: !662, line: 105, baseType: !744, size: 10368, offset: 54944)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 10368, elements: !733)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est_aq", scope: !663, file: !662, line: 106, baseType: !744, size: 10368, offset: 65312)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "i_satd", scope: !663, file: !662, line: 107, baseType: !145, size: 32, offset: 75680)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_mbs", scope: !663, file: !662, line: 108, baseType: !748, size: 576, offset: 75712)
!748 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 576, elements: !749)
!749 = !{!734}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satds", scope: !663, file: !662, line: 109, baseType: !751, size: 20736, offset: 76288)
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 20736, elements: !733)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satd", scope: !663, file: !662, line: 110, baseType: !179, size: 64, offset: 97024)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_bits", scope: !663, file: !662, line: 111, baseType: !179, size: 64, offset: 97088)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "f_row_qp", scope: !663, file: !662, line: 112, baseType: !755, size: 64, offset: 97152)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset", scope: !663, file: !662, line: 113, baseType: !755, size: 64, offset: 97216)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset_aq", scope: !663, file: !662, line: 114, baseType: !755, size: 64, offset: 97280)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_calculated", scope: !663, file: !662, line: 115, baseType: !145, size: 32, offset: 97344)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !663, file: !662, line: 116, baseType: !552, size: 64, offset: 97408)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "i_propagate_cost", scope: !663, file: !662, line: 117, baseType: !552, size: 64, offset: 97472)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "i_inv_qscale_factor", scope: !663, file: !662, line: 118, baseType: !552, size: 64, offset: 97536)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "b_scenecut", scope: !663, file: !662, line: 119, baseType: !145, size: 32, offset: 97600)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "f_weighted_cost_delta", scope: !663, file: !662, line: 120, baseType: !764, size: 576, offset: 97632)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 576, elements: !749)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_sum", scope: !663, file: !662, line: 121, baseType: !163, size: 32, offset: 98208)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_ssd", scope: !663, file: !662, line: 122, baseType: !176, size: 64, offset: 98240)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "hrd_timing", scope: !663, file: !662, line: 125, baseType: !768, size: 256, offset: 98304)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_hrd_t", file: !18, line: 503, baseType: !769)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 496, size: 256, elements: !770)
!770 = !{!771, !772, !773, !774}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_initial_arrival_time", scope: !769, file: !18, line: 498, baseType: !151, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_final_arrival_time", scope: !769, file: !18, line: 499, baseType: !151, size: 64, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_time", scope: !769, file: !18, line: 500, baseType: !151, size: 64, offset: 128)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_time", scope: !769, file: !18, line: 502, baseType: !151, size: 64, offset: 192)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_type", scope: !663, file: !662, line: 128, baseType: !776, size: 2008, offset: 98560)
!776 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 2008, elements: !777)
!777 = !{!778}
!778 = !DISubrange(count: 251)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_satd", scope: !663, file: !662, line: 129, baseType: !780, size: 8032, offset: 100576)
!780 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 8032, elements: !777)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "f_planned_cpb_duration", scope: !663, file: !662, line: 130, baseType: !782, size: 16064, offset: 108608)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 16064, elements: !777)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !663, file: !662, line: 131, baseType: !145, size: 32, offset: 124672)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !663, file: !662, line: 132, baseType: !145, size: 32, offset: 124704)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_completed", scope: !663, file: !662, line: 135, baseType: !145, size: 32, offset: 124736)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_weighted", scope: !663, file: !662, line: 136, baseType: !145, size: 32, offset: 124768)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "i_reference_count", scope: !663, file: !662, line: 137, baseType: !145, size: 32, offset: 124800)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !663, file: !662, line: 138, baseType: !145, size: 32, offset: 124832)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !663, file: !662, line: 139, baseType: !145, size: 32, offset: 124864)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "f_pir_position", scope: !663, file: !662, line: 142, baseType: !147, size: 32, offset: 124896)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_start_col", scope: !663, file: !662, line: 143, baseType: !145, size: 32, offset: 124928)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_end_col", scope: !663, file: !662, line: 144, baseType: !145, size: 32, offset: 124960)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "i_frames_since_pir", scope: !663, file: !662, line: 145, baseType: !145, size: 32, offset: 124992)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !656, file: !48, line: 470, baseType: !795, size: 128, offset: 64)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !659, size: 128, elements: !170)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "blank_unused", scope: !656, file: !48, line: 473, baseType: !659, size: 64, offset: 192)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !656, file: !48, line: 476, baseType: !798, size: 1152, offset: 256)
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !660, size: 1152, elements: !749)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_keyframe", scope: !656, file: !48, line: 478, baseType: !145, size: 32, offset: 1408)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "i_input", scope: !656, file: !48, line: 480, baseType: !145, size: 32, offset: 1440)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dpb", scope: !656, file: !48, line: 482, baseType: !145, size: 32, offset: 1472)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref0", scope: !656, file: !48, line: 483, baseType: !145, size: 32, offset: 1504)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref1", scope: !656, file: !48, line: 484, baseType: !145, size: 32, offset: 1536)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "i_delay", scope: !656, file: !48, line: 485, baseType: !145, size: 32, offset: 1568)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay", scope: !656, file: !48, line: 486, baseType: !145, size: 32, offset: 1600)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay_time", scope: !656, file: !48, line: 487, baseType: !669, size: 64, offset: 1664)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "i_init_delta", scope: !656, file: !48, line: 488, baseType: !669, size: 64, offset: 1728)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_reordered_pts", scope: !656, file: !48, line: 489, baseType: !809, size: 128, offset: 1792)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !669, size: 128, elements: !170)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "i_largest_pts", scope: !656, file: !48, line: 490, baseType: !669, size: 64, offset: 1920)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "i_second_largest_pts", scope: !656, file: !48, line: 491, baseType: !669, size: 64, offset: 1984)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_lowres", scope: !656, file: !48, line: 492, baseType: !145, size: 32, offset: 2048)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_sub8x8_esa", scope: !656, file: !48, line: 493, baseType: !145, size: 32, offset: 2080)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "fenc", scope: !188, file: !48, line: 497, baseType: !660, size: 64, offset: 117440)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "fdec", scope: !188, file: !48, line: 500, baseType: !660, size: 64, offset: 117504)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref0", scope: !188, file: !48, line: 503, baseType: !145, size: 32, offset: 117568)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "fref0", scope: !188, file: !48, line: 504, baseType: !818, size: 1216, offset: 117632)
!818 = !DICompositeType(tag: DW_TAG_array_type, baseType: !660, size: 1216, elements: !819)
!819 = !{!820}
!820 = !DISubrange(count: 19)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref1", scope: !188, file: !48, line: 505, baseType: !145, size: 32, offset: 118848)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "fref1", scope: !188, file: !48, line: 506, baseType: !818, size: 1216, offset: 118912)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_reorder", scope: !188, file: !48, line: 507, baseType: !291, size: 64, offset: 120128)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay", scope: !188, file: !48, line: 510, baseType: !145, size: 32, offset: 120192)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_offset", scope: !188, file: !48, line: 511, baseType: !145, size: 32, offset: 120224)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts_delay", scope: !188, file: !48, line: 512, baseType: !669, size: 64, offset: 120256)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "dct", scope: !188, file: !48, line: 522, baseType: !828, size: 10624, offset: 120320)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !188, file: !48, line: 515, size: 10624, elements: !829)
!829 = !{!830, !832, !835, !838}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "luma16x16_dc", scope: !828, file: !48, line: 517, baseType: !831, size: 256, align: 128)
!831 = !DICompositeType(tag: DW_TAG_array_type, baseType: !599, size: 256, elements: !239)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_dc", scope: !828, file: !48, line: 518, baseType: !833, size: 128, align: 128, offset: 256)
!833 = !DICompositeType(tag: DW_TAG_array_type, baseType: !599, size: 128, elements: !834)
!834 = !{!171, !175}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "luma8x8", scope: !828, file: !48, line: 520, baseType: !836, size: 4096, align: 128, offset: 384)
!836 = !DICompositeType(tag: DW_TAG_array_type, baseType: !599, size: 4096, elements: !837)
!837 = !{!175, !247}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "luma4x4", scope: !828, file: !48, line: 521, baseType: !839, size: 6144, align: 128, offset: 4480)
!839 = !DICompositeType(tag: DW_TAG_array_type, baseType: !599, size: 6144, elements: !840)
!840 = !{!841, !240}
!841 = !DISubrange(count: 24)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !188, file: !48, line: 732, baseType: !843, size: 82688, offset: 130944)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !188, file: !48, line: 525, size: 82688, elements: !844)
!844 = !{!845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !872, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !890, !893, !897, !898, !899, !904, !905, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !973, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1015, !1016, !1017, !1020, !1023, !1025, !1028, !1030, !1031}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !843, file: !48, line: 527, baseType: !145, size: 32)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_stride", scope: !843, file: !48, line: 530, baseType: !145, size: 32, offset: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_stride", scope: !843, file: !48, line: 531, baseType: !145, size: 32, offset: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_stride", scope: !843, file: !48, line: 532, baseType: !145, size: 32, offset: 96)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_x", scope: !843, file: !48, line: 535, baseType: !145, size: 32, offset: 128)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_y", scope: !843, file: !48, line: 536, baseType: !145, size: 32, offset: 160)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_xy", scope: !843, file: !48, line: 537, baseType: !145, size: 32, offset: 192)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_xy", scope: !843, file: !48, line: 538, baseType: !145, size: 32, offset: 224)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_xy", scope: !843, file: !48, line: 539, baseType: !145, size: 32, offset: 256)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !843, file: !48, line: 542, baseType: !145, size: 32, offset: 288)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !843, file: !48, line: 543, baseType: !145, size: 32, offset: 320)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !843, file: !48, line: 544, baseType: !145, size: 32, offset: 352)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "b_trellis", scope: !843, file: !48, line: 545, baseType: !145, size: 32, offset: 384)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "b_noise_reduction", scope: !843, file: !48, line: 546, baseType: !145, size: 32, offset: 416)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !843, file: !48, line: 547, baseType: !145, size: 32, offset: 448)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_rd", scope: !843, file: !48, line: 548, baseType: !145, size: 32, offset: 480)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_trellis", scope: !843, file: !48, line: 549, baseType: !145, size: 32, offset: 512)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !843, file: !48, line: 551, baseType: !145, size: 32, offset: 544)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min", scope: !843, file: !48, line: 554, baseType: !291, size: 64, offset: 576)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max", scope: !843, file: !48, line: 555, baseType: !291, size: 64, offset: 640)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_spel", scope: !843, file: !48, line: 558, baseType: !291, size: 64, offset: 704)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_spel", scope: !843, file: !48, line: 559, baseType: !291, size: 64, offset: 768)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_fpel", scope: !843, file: !48, line: 561, baseType: !291, size: 64, offset: 832)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_fpel", scope: !843, file: !48, line: 562, baseType: !291, size: 64, offset: 896)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour", scope: !843, file: !48, line: 565, baseType: !7, size: 32, offset: 960)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour8", scope: !843, file: !48, line: 566, baseType: !871, size: 128, offset: 992)
!871 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128, elements: !174)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour4", scope: !843, file: !48, line: 567, baseType: !873, size: 512, offset: 1120)
!873 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 512, elements: !239)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_intra", scope: !843, file: !48, line: 568, baseType: !7, size: 32, offset: 1632)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_frame", scope: !843, file: !48, line: 569, baseType: !7, size: 32, offset: 1664)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_top", scope: !843, file: !48, line: 570, baseType: !145, size: 32, offset: 1696)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_left", scope: !843, file: !48, line: 571, baseType: !145, size: 32, offset: 1728)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topleft", scope: !843, file: !48, line: 572, baseType: !145, size: 32, offset: 1760)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topright", scope: !843, file: !48, line: 573, baseType: !145, size: 32, offset: 1792)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_prev_xy", scope: !843, file: !48, line: 574, baseType: !145, size: 32, offset: 1824)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_left_xy", scope: !843, file: !48, line: 575, baseType: !145, size: 32, offset: 1856)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_top_xy", scope: !843, file: !48, line: 576, baseType: !145, size: 32, offset: 1888)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topleft_xy", scope: !843, file: !48, line: 577, baseType: !145, size: 32, offset: 1920)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topright_xy", scope: !843, file: !48, line: 578, baseType: !145, size: 32, offset: 1952)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !843, file: !48, line: 585, baseType: !717, size: 64, offset: 1984)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "partition", scope: !843, file: !48, line: 586, baseType: !152, size: 64, offset: 2048)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !843, file: !48, line: 587, baseType: !717, size: 64, offset: 2112)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !843, file: !48, line: 588, baseType: !889, size: 64, offset: 2176)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !843, file: !48, line: 589, baseType: !891, size: 64, offset: 2240)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DICompositeType(tag: DW_TAG_array_type, baseType: !718, size: 64, elements: !603)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !843, file: !48, line: 591, baseType: !894, size: 64, offset: 2304)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 192, elements: !896)
!896 = !{!841}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_pred_mode", scope: !843, file: !48, line: 592, baseType: !717, size: 64, offset: 2368)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !843, file: !48, line: 593, baseType: !723, size: 128, offset: 2432)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !843, file: !48, line: 594, baseType: !900, size: 128, offset: 2560)
!900 = !DICompositeType(tag: DW_TAG_array_type, baseType: !901, size: 128, elements: !170)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 128, elements: !903)
!903 = !{!604, !171}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !843, file: !48, line: 595, baseType: !738, size: 128, offset: 2688)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "mvr", scope: !843, file: !48, line: 596, baseType: !906, size: 4096, offset: 2816)
!906 = !DICompositeType(tag: DW_TAG_array_type, baseType: !724, size: 4096, elements: !907)
!907 = !{!171, !620}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "skipbp", scope: !843, file: !48, line: 597, baseType: !717, size: 64, offset: 6912)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "mb_transform_size", scope: !843, file: !48, line: 598, baseType: !717, size: 64, offset: 6976)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "slice_table", scope: !843, file: !48, line: 599, baseType: !552, size: 64, offset: 7040)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "p_weight_buf", scope: !843, file: !48, line: 603, baseType: !712, size: 1024, offset: 7104)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !843, file: !48, line: 606, baseType: !145, size: 32, offset: 8128)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "i_partition", scope: !843, file: !48, line: 607, baseType: !145, size: 32, offset: 8160)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "i_sub_partition", scope: !843, file: !48, line: 608, baseType: !173, size: 32, align: 32, offset: 8192)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !843, file: !48, line: 609, baseType: !145, size: 32, offset: 8224)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_luma", scope: !843, file: !48, line: 611, baseType: !145, size: 32, offset: 8256)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_chroma", scope: !843, file: !48, line: 612, baseType: !145, size: 32, offset: 8288)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra16x16_pred_mode", scope: !843, file: !48, line: 614, baseType: !145, size: 32, offset: 8320)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_pred_mode", scope: !843, file: !48, line: 615, baseType: !145, size: 32, offset: 8352)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "i_skip_intra", scope: !843, file: !48, line: 621, baseType: !145, size: 32, offset: 8384)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "b_skip_mc", scope: !843, file: !48, line: 624, baseType: !145, size: 32, offset: 8416)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "b_reencode_mb", scope: !843, file: !48, line: 626, baseType: !145, size: 32, offset: 8448)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "ip_offset", scope: !843, file: !48, line: 627, baseType: !145, size: 32, offset: 8480)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "pic", scope: !843, file: !48, line: 671, baseType: !925, size: 60672, offset: 8576)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !843, file: !48, line: 629, size: 60672, elements: !926)
!926 = !{!927, !931, !935, !937, !938, !941, !945, !947, !948, !949, !950, !951, !954, !958, !961, !962, !963, !964, !965, !968, !970, !972}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_buf", scope: !925, file: !48, line: 634, baseType: !928, size: 3072, align: 128)
!928 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 3072, elements: !929)
!929 = !{!930}
!930 = !DISubrange(count: 384)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "fdec_buf", scope: !925, file: !48, line: 635, baseType: !932, size: 6912, align: 128, offset: 3072)
!932 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 6912, elements: !933)
!933 = !{!934}
!934 = !DISubrange(count: 864)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_fdec_buf", scope: !925, file: !48, line: 638, baseType: !936, size: 2048, align: 128, offset: 9984)
!936 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 2048, elements: !427)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_fdec_buf", scope: !925, file: !48, line: 639, baseType: !936, size: 2048, align: 128, offset: 12032)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_dct_buf", scope: !925, file: !48, line: 640, baseType: !939, size: 3072, align: 128, offset: 14080)
!939 = !DICompositeType(tag: DW_TAG_array_type, baseType: !599, size: 3072, elements: !940)
!940 = !{!621, !247}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_dct_buf", scope: !925, file: !48, line: 641, baseType: !942, size: 3840, align: 128, offset: 17152)
!942 = !DICompositeType(tag: DW_TAG_array_type, baseType: !599, size: 3840, elements: !943)
!943 = !{!944, !240}
!944 = !DISubrange(count: 15)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_nnz_buf", scope: !925, file: !48, line: 642, baseType: !946, size: 128, offset: 20992)
!946 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 128, elements: !174)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_nnz_buf", scope: !925, file: !48, line: 643, baseType: !946, size: 128, offset: 21120)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_cbp", scope: !925, file: !48, line: 644, baseType: !145, size: 32, offset: 21248)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_cbp", scope: !925, file: !48, line: 645, baseType: !145, size: 32, offset: 21280)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct8", scope: !925, file: !48, line: 648, baseType: !836, size: 4096, align: 128, offset: 21376)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct4", scope: !925, file: !48, line: 649, baseType: !952, size: 4096, align: 128, offset: 25472)
!952 = !DICompositeType(tag: DW_TAG_array_type, baseType: !599, size: 4096, elements: !953)
!953 = !{!240, !240}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_hadamard_cache", scope: !925, file: !48, line: 652, baseType: !955, size: 576, align: 128, offset: 29568)
!955 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 576, elements: !956)
!956 = !{!957}
!957 = !DISubrange(count: 9)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_satd_cache", scope: !925, file: !48, line: 653, baseType: !959, size: 1024, align: 128, offset: 30208)
!959 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 1024, elements: !960)
!960 = !{!620}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "p_fenc", scope: !925, file: !48, line: 656, baseType: !701, size: 192, offset: 31232)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "p_fenc_plane", scope: !925, file: !48, line: 658, baseType: !701, size: 192, offset: 31424)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "p_fdec", scope: !925, file: !48, line: 661, baseType: !701, size: 192, offset: 31616)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "i_fref", scope: !925, file: !48, line: 664, baseType: !291, size: 64, offset: 31808)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "p_fref", scope: !925, file: !48, line: 665, baseType: !966, size: 24576, offset: 31872)
