; ModuleID = 'x264_src/encoder/lookahead.c'
source_filename = "x264_src/encoder/lookahead.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.x264_t = type { %struct.x264_param_t, [129 x %struct.x264_t*], i32, i32, i32, i32, i32, %struct.anon.2, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1 x %struct.x264_sps_t], %struct.x264_sps_t*, [1 x %struct.x264_pps_t], %struct.x264_pps_t*, i32, i32, [4 x [16 x i32]*], [2 x [64 x i32]*], [4 x [16 x i32]*], [2 x [64 x i32]*], [4 x [16 x i16]*], [2 x [64 x i16]*], [4 x [16 x i16]*], [2 x [64 x i16]*], [92 x i16*], [92 x [4 x i16*]], i8*, [8 x i8], %struct.x264_slice_header_t, %struct.x264_cabac_t, %struct.anon.8, %struct.x264_frame*, %struct.x264_frame*, i32, [19 x %struct.x264_frame*], i32, [19 x %struct.x264_frame*], [2 x i32], i32, i32, i64, %struct.anon.9, %struct.anon.10, %struct.x264_ratecontrol_t*, %struct.anon.13, [2 x [64 x i32]], [2 x [64 x i16]], [2 x i32], i8*, [2 x [3 x i8*]], [2 x [2 x [4 x [4 x i8]]]*], [7 x void (i8*)*], [7 x void (i8*)*], [12 x void (i8*, i8*)*], [12 x void (i8*)*], void (i8*, i8*, i32, i32)*, %struct.x264_pixel_function_t, %struct.x264_mc_functions_t, %struct.x264_dct_function_t, %struct.x264_zigzag_function_t, %struct.x264_quant_function_t, %struct.x264_deblock_function_t, %struct.x264_lookahead_t*, [8 x i8] }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "x264_src/encoder/lookahead.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{}
!3 = !{i32 7, !"Dwarf Version", i32 4}
!4 = !{i32 2, !"Debug Info Version", i32 3}
!5 = !{i32 1, !"wchar_size", i32 4}
!6 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!7 = distinct !DISubprogram(name: "x264_lookahead_init", scope: !1, file: !1, line: 127, type: !8, scopeLine: 128, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!8 = !DISubroutineType(types: !9)
!9 = !{!10, !11, !10}
!10 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_t", file: !13, line: 46, baseType: !14)
!13 = !DIFile(filename: "x264_src/x264.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_t", file: !15, line: 381, size: 266752, elements: !16)
!15 = !DIFile(filename: "x264_src/common/common.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!16 = !{!17, !195, !199, !200, !201, !202, !203, !204, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !340, !342, !370, !372, !373, !374, !380, !384, !385, !386, !393, !397, !398, !399, !404, !407, !408, !487, !504, !668, !669, !670, !671, !675, !676, !677, !678, !679, !680, !681, !696, !890, !894, !955, !958, !960, !962, !963, !966, !971, !980, !981, !989, !991, !996, !1072, !1158, !1202, !1224, !1273, !1302}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !14, file: !15, line: 384, baseType: !18, size: 5632)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !13, line: 376, baseType: !19)
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !13, line: 176, size: 5632, elements: !20)
!20 = !{!21, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !65, !74, !75, !76, !77, !81, !82, !96, !97, !98, !99, !100, !131, !173, !174, !175, !176, !177, !178, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !19, file: !13, line: 179, baseType: !22, size: 32)
!22 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !19, file: !13, line: 180, baseType: !10, size: 32, offset: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !19, file: !13, line: 181, baseType: !10, size: 32, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !19, file: !13, line: 182, baseType: !10, size: 32, offset: 96)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !19, file: !13, line: 183, baseType: !10, size: 32, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !19, file: !13, line: 186, baseType: !10, size: 32, offset: 160)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !19, file: !13, line: 187, baseType: !10, size: 32, offset: 192)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !19, file: !13, line: 188, baseType: !10, size: 32, offset: 224)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !19, file: !13, line: 189, baseType: !10, size: 32, offset: 256)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !19, file: !13, line: 190, baseType: !10, size: 32, offset: 288)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !19, file: !13, line: 198, baseType: !10, size: 32, offset: 320)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !19, file: !13, line: 215, baseType: !34, size: 288, offset: 352)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !19, file: !13, line: 200, size: 288, elements: !35)
!35 = !{!36, !37, !38, !39, !40, !41, !42, !43, !44}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !34, file: !13, line: 203, baseType: !10, size: 32)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !34, file: !13, line: 204, baseType: !10, size: 32, offset: 32)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !34, file: !13, line: 206, baseType: !10, size: 32, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !34, file: !13, line: 209, baseType: !10, size: 32, offset: 96)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !34, file: !13, line: 210, baseType: !10, size: 32, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !34, file: !13, line: 211, baseType: !10, size: 32, offset: 160)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !34, file: !13, line: 212, baseType: !10, size: 32, offset: 192)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !34, file: !13, line: 213, baseType: !10, size: 32, offset: 224)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !34, file: !13, line: 214, baseType: !10, size: 32, offset: 256)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !19, file: !13, line: 218, baseType: !10, size: 32, offset: 640)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !19, file: !13, line: 219, baseType: !10, size: 32, offset: 672)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !19, file: !13, line: 220, baseType: !10, size: 32, offset: 704)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !19, file: !13, line: 221, baseType: !10, size: 32, offset: 736)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !19, file: !13, line: 222, baseType: !10, size: 32, offset: 768)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !19, file: !13, line: 224, baseType: !10, size: 32, offset: 800)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !19, file: !13, line: 225, baseType: !10, size: 32, offset: 832)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !19, file: !13, line: 226, baseType: !10, size: 32, offset: 864)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !19, file: !13, line: 227, baseType: !10, size: 32, offset: 896)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !19, file: !13, line: 229, baseType: !10, size: 32, offset: 928)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !19, file: !13, line: 230, baseType: !10, size: 32, offset: 960)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !19, file: !13, line: 231, baseType: !10, size: 32, offset: 992)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !19, file: !13, line: 233, baseType: !10, size: 32, offset: 1024)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !19, file: !13, line: 234, baseType: !10, size: 32, offset: 1056)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !19, file: !13, line: 236, baseType: !10, size: 32, offset: 1088)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !19, file: !13, line: 237, baseType: !10, size: 32, offset: 1120)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !19, file: !13, line: 239, baseType: !10, size: 32, offset: 1152)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !19, file: !13, line: 240, baseType: !63, size: 64, offset: 1216)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !19, file: !13, line: 241, baseType: !66, size: 128, offset: 1280)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 128, elements: !72)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !68, line: 24, baseType: !69)
!68 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !70, line: 38, baseType: !71)
!70 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!71 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!72 = !{!73}
!73 = !DISubrange(count: 16)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !19, file: !13, line: 242, baseType: !66, size: 128, offset: 1408)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !19, file: !13, line: 243, baseType: !66, size: 128, offset: 1536)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !19, file: !13, line: 244, baseType: !66, size: 128, offset: 1664)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !19, file: !13, line: 245, baseType: !78, size: 512, offset: 1792)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 512, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !19, file: !13, line: 246, baseType: !78, size: 512, offset: 2304)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !19, file: !13, line: 249, baseType: !83, size: 64, offset: 2816)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{null, !86, !10, !87, !89}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, elements: !91)
!91 = !{!92, !93, !94, !95}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !90, file: !1, baseType: !22, size: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !90, file: !1, baseType: !22, size: 32, offset: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !90, file: !1, baseType: !86, size: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !90, file: !1, baseType: !86, size: 64, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !19, file: !13, line: 250, baseType: !86, size: 64, offset: 2880)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !19, file: !13, line: 251, baseType: !10, size: 32, offset: 2944)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !19, file: !13, line: 252, baseType: !10, size: 32, offset: 2976)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !19, file: !13, line: 253, baseType: !63, size: 64, offset: 3008)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !19, file: !13, line: 287, baseType: !101, size: 800, offset: 3072)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !19, file: !13, line: 256, size: 800, elements: !102)
!102 = !{!103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !123, !124, !125, !129, !130}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !101, file: !13, line: 258, baseType: !22, size: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !101, file: !13, line: 259, baseType: !22, size: 32, offset: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !101, file: !13, line: 261, baseType: !10, size: 32, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !101, file: !13, line: 262, baseType: !10, size: 32, offset: 96)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !101, file: !13, line: 263, baseType: !10, size: 32, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !101, file: !13, line: 264, baseType: !10, size: 32, offset: 160)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !101, file: !13, line: 265, baseType: !10, size: 32, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !101, file: !13, line: 267, baseType: !10, size: 32, offset: 224)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !101, file: !13, line: 268, baseType: !10, size: 32, offset: 256)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !101, file: !13, line: 269, baseType: !10, size: 32, offset: 288)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !101, file: !13, line: 270, baseType: !10, size: 32, offset: 320)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !101, file: !13, line: 271, baseType: !10, size: 32, offset: 352)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !101, file: !13, line: 272, baseType: !10, size: 32, offset: 384)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !101, file: !13, line: 273, baseType: !10, size: 32, offset: 416)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !101, file: !13, line: 274, baseType: !10, size: 32, offset: 448)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !101, file: !13, line: 275, baseType: !10, size: 32, offset: 480)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !101, file: !13, line: 276, baseType: !10, size: 32, offset: 512)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !101, file: !13, line: 277, baseType: !10, size: 32, offset: 544)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !101, file: !13, line: 278, baseType: !122, size: 32, offset: 576)
!122 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !101, file: !13, line: 279, baseType: !122, size: 32, offset: 608)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !101, file: !13, line: 280, baseType: !10, size: 32, offset: 640)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !101, file: !13, line: 283, baseType: !126, size: 64, offset: 672)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 64, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 2)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !101, file: !13, line: 285, baseType: !10, size: 32, offset: 736)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !101, file: !13, line: 286, baseType: !10, size: 32, offset: 768)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !19, file: !13, line: 327, baseType: !132, size: 1152, offset: 3904)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !19, file: !13, line: 290, size: 1152, elements: !133)
!133 = !{!134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !171, !172}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !132, file: !13, line: 292, baseType: !10, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !132, file: !13, line: 294, baseType: !10, size: 32, offset: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !132, file: !13, line: 295, baseType: !10, size: 32, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !132, file: !13, line: 296, baseType: !10, size: 32, offset: 96)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !132, file: !13, line: 297, baseType: !10, size: 32, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !132, file: !13, line: 299, baseType: !10, size: 32, offset: 160)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !132, file: !13, line: 300, baseType: !122, size: 32, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !132, file: !13, line: 301, baseType: !122, size: 32, offset: 224)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !132, file: !13, line: 302, baseType: !122, size: 32, offset: 256)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !132, file: !13, line: 303, baseType: !10, size: 32, offset: 288)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !132, file: !13, line: 304, baseType: !10, size: 32, offset: 320)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !132, file: !13, line: 305, baseType: !122, size: 32, offset: 352)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !132, file: !13, line: 306, baseType: !122, size: 32, offset: 384)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !132, file: !13, line: 307, baseType: !122, size: 32, offset: 416)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !132, file: !13, line: 309, baseType: !10, size: 32, offset: 448)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !132, file: !13, line: 310, baseType: !122, size: 32, offset: 480)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !132, file: !13, line: 311, baseType: !10, size: 32, offset: 512)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !132, file: !13, line: 312, baseType: !10, size: 32, offset: 544)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !132, file: !13, line: 315, baseType: !10, size: 32, offset: 576)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !132, file: !13, line: 316, baseType: !63, size: 64, offset: 640)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !132, file: !13, line: 317, baseType: !10, size: 32, offset: 704)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !132, file: !13, line: 318, baseType: !63, size: 64, offset: 768)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !132, file: !13, line: 321, baseType: !122, size: 32, offset: 832)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !132, file: !13, line: 322, baseType: !122, size: 32, offset: 864)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !132, file: !13, line: 323, baseType: !122, size: 32, offset: 896)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !132, file: !13, line: 324, baseType: !160, size: 64, offset: 960)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !13, line: 174, baseType: !162)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 167, size: 256, elements: !163)
!163 = !{!164, !165, !166, !167, !168, !169}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !162, file: !13, line: 169, baseType: !10, size: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !162, file: !13, line: 169, baseType: !10, size: 32, offset: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !162, file: !13, line: 170, baseType: !10, size: 32, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !162, file: !13, line: 171, baseType: !10, size: 32, offset: 96)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !162, file: !13, line: 172, baseType: !122, size: 32, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !162, file: !13, line: 173, baseType: !170, size: 64, offset: 192)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !132, file: !13, line: 325, baseType: !10, size: 32, offset: 1024)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !132, file: !13, line: 326, baseType: !63, size: 64, offset: 1088)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !19, file: !13, line: 330, baseType: !10, size: 32, offset: 5056)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !19, file: !13, line: 331, baseType: !10, size: 32, offset: 5088)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !19, file: !13, line: 332, baseType: !10, size: 32, offset: 5120)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !19, file: !13, line: 334, baseType: !10, size: 32, offset: 5152)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !19, file: !13, line: 335, baseType: !10, size: 32, offset: 5184)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !19, file: !13, line: 336, baseType: !179, size: 32, offset: 5216)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !68, line: 26, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !70, line: 42, baseType: !22)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !19, file: !13, line: 337, baseType: !179, size: 32, offset: 5248)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !19, file: !13, line: 338, baseType: !179, size: 32, offset: 5280)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !19, file: !13, line: 339, baseType: !179, size: 32, offset: 5312)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !19, file: !13, line: 340, baseType: !10, size: 32, offset: 5344)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !19, file: !13, line: 344, baseType: !10, size: 32, offset: 5376)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !19, file: !13, line: 356, baseType: !10, size: 32, offset: 5408)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !19, file: !13, line: 364, baseType: !10, size: 32, offset: 5440)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !19, file: !13, line: 367, baseType: !10, size: 32, offset: 5472)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !19, file: !13, line: 368, baseType: !10, size: 32, offset: 5504)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !19, file: !13, line: 369, baseType: !10, size: 32, offset: 5536)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !19, file: !13, line: 375, baseType: !192, size: 64, offset: 5568)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{null, !86}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !14, file: !15, line: 386, baseType: !196, size: 8256, offset: 5632)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 8256, elements: !197)
!197 = !{!198}
!198 = !DISubrange(count: 129)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "thread_handle", scope: !14, file: !15, line: 387, baseType: !10, size: 32, offset: 13888)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "b_thread_active", scope: !14, file: !15, line: 388, baseType: !10, size: 32, offset: 13920)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_phase", scope: !14, file: !15, line: 389, baseType: !10, size: 32, offset: 13952)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_start", scope: !14, file: !15, line: 390, baseType: !10, size: 32, offset: 13984)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_end", scope: !14, file: !15, line: 391, baseType: !10, size: 32, offset: 14016)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !14, file: !15, line: 402, baseType: !205, size: 576, offset: 14080)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !14, file: !15, line: 394, size: 576, elements: !206)
!206 = !{!207, !208, !209, !219, !220, !221}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal", scope: !205, file: !15, line: 396, baseType: !10, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "i_nals_allocated", scope: !205, file: !15, line: 397, baseType: !10, size: 32, offset: 32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "nal", scope: !205, file: !15, line: 398, baseType: !210, size: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !13, line: 604, baseType: !212)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 593, size: 192, elements: !213)
!213 = !{!214, !215, !216, !217}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !212, file: !13, line: 595, baseType: !10, size: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !212, file: !13, line: 596, baseType: !10, size: 32, offset: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !212, file: !13, line: 599, baseType: !10, size: 32, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !212, file: !13, line: 603, baseType: !218, size: 64, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitstream", scope: !205, file: !15, line: 399, baseType: !10, size: 32, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "p_bitstream", scope: !205, file: !15, line: 400, baseType: !218, size: 64, offset: 192)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !205, file: !15, line: 401, baseType: !222, size: 320, offset: 256)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "bs_t", file: !223, line: 56, baseType: !224)
!223 = !DIFile(filename: "x264_src/common/bs.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bs_s", file: !223, line: 47, size: 320, elements: !225)
!225 = !{!226, !227, !228, !229, !233, !234}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !224, file: !223, line: 49, baseType: !218, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !224, file: !223, line: 50, baseType: !218, size: 64, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !224, file: !223, line: 51, baseType: !218, size: 64, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "cur_bits", scope: !224, file: !223, line: 53, baseType: !230, size: 64, offset: 192)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !231, line: 87, baseType: !232)
!231 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!232 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !224, file: !223, line: 54, baseType: !10, size: 32, offset: 256)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "i_bits_encoded", scope: !224, file: !223, line: 55, baseType: !10, size: 32, offset: 288)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer", scope: !14, file: !15, line: 404, baseType: !218, size: 64, offset: 14656)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer_size", scope: !14, file: !15, line: 405, baseType: !10, size: 32, offset: 14720)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !14, file: !15, line: 410, baseType: !10, size: 32, offset: 14752)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !14, file: !15, line: 411, baseType: !10, size: 32, offset: 14784)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_frames", scope: !14, file: !15, line: 413, baseType: !10, size: 32, offset: 14816)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_type", scope: !14, file: !15, line: 415, baseType: !10, size: 32, offset: 14848)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_ref_idc", scope: !14, file: !15, line: 416, baseType: !10, size: 32, offset: 14880)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields", scope: !14, file: !15, line: 418, baseType: !10, size: 32, offset: 14912)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields_last_frame", scope: !14, file: !15, line: 419, baseType: !10, size: 32, offset: 14944)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_duration", scope: !14, file: !15, line: 420, baseType: !10, size: 32, offset: 14976)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields", scope: !14, file: !15, line: 421, baseType: !10, size: 32, offset: 15008)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !14, file: !15, line: 422, baseType: !10, size: 32, offset: 15040)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !14, file: !15, line: 424, baseType: !10, size: 32, offset: 15072)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !14, file: !15, line: 425, baseType: !10, size: 32, offset: 15104)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "b_queued_intra_refresh", scope: !14, file: !15, line: 427, baseType: !10, size: 32, offset: 15136)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "sps_array", scope: !14, file: !15, line: 430, baseType: !251, size: 10400, offset: 15168)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 10400, elements: !338)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_sps_t", file: !253, line: 154, baseType: !254)
!253 = !DIFile(filename: "x264_src/common/set.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !253, line: 52, size: 10400, elements: !255)
!255 = !{!256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !273, !274, !275, !276, !277, !278, !279, !280, !281, !288, !289, !337}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !254, file: !253, line: 54, baseType: !10, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "i_profile_idc", scope: !254, file: !253, line: 56, baseType: !10, size: 32, offset: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !254, file: !253, line: 57, baseType: !10, size: 32, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set0", scope: !254, file: !253, line: 59, baseType: !10, size: 32, offset: 96)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set1", scope: !254, file: !253, line: 60, baseType: !10, size: 32, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set2", scope: !254, file: !253, line: 61, baseType: !10, size: 32, offset: 160)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_frame_num", scope: !254, file: !253, line: 63, baseType: !10, size: 32, offset: 192)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_type", scope: !254, file: !253, line: 65, baseType: !10, size: 32, offset: 224)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_poc_lsb", scope: !254, file: !253, line: 67, baseType: !10, size: 32, offset: 256)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "b_delta_pic_order_always_zero", scope: !254, file: !253, line: 69, baseType: !10, size: 32, offset: 288)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_non_ref_pic", scope: !254, file: !253, line: 70, baseType: !10, size: 32, offset: 320)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_top_to_bottom_field", scope: !254, file: !253, line: 71, baseType: !10, size: 32, offset: 352)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames_in_poc_cycle", scope: !254, file: !253, line: 72, baseType: !10, size: 32, offset: 384)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_ref_frame", scope: !254, file: !253, line: 73, baseType: !270, size: 8192, offset: 416)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 8192, elements: !271)
!271 = !{!272}
!272 = !DISubrange(count: 256)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames", scope: !254, file: !253, line: 75, baseType: !10, size: 32, offset: 8608)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "b_gaps_in_frame_num_value_allowed", scope: !254, file: !253, line: 76, baseType: !10, size: 32, offset: 8640)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_width", scope: !254, file: !253, line: 77, baseType: !10, size: 32, offset: 8672)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_height", scope: !254, file: !253, line: 78, baseType: !10, size: 32, offset: 8704)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_mbs_only", scope: !254, file: !253, line: 79, baseType: !10, size: 32, offset: 8736)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_adaptive_frame_field", scope: !254, file: !253, line: 80, baseType: !10, size: 32, offset: 8768)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct8x8_inference", scope: !254, file: !253, line: 81, baseType: !10, size: 32, offset: 8800)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "b_crop", scope: !254, file: !253, line: 83, baseType: !10, size: 32, offset: 8832)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !254, file: !253, line: 90, baseType: !282, size: 128, offset: 8864)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !254, file: !253, line: 84, size: 128, elements: !283)
!283 = !{!284, !285, !286, !287}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !282, file: !253, line: 86, baseType: !10, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "i_right", scope: !282, file: !253, line: 87, baseType: !10, size: 32, offset: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "i_top", scope: !282, file: !253, line: 88, baseType: !10, size: 32, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "i_bottom", scope: !282, file: !253, line: 89, baseType: !10, size: 32, offset: 96)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "b_vui", scope: !254, file: !253, line: 92, baseType: !10, size: 32, offset: 8992)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !254, file: !253, line: 150, baseType: !290, size: 1344, offset: 9024)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !254, file: !253, line: 93, size: 1344, elements: !291)
!291 = !{!292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !328, !329, !330, !331, !332, !333, !334, !335, !336}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "b_aspect_ratio_info_present", scope: !290, file: !253, line: 95, baseType: !10, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !290, file: !253, line: 96, baseType: !10, size: 32, offset: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !290, file: !253, line: 97, baseType: !10, size: 32, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info_present", scope: !290, file: !253, line: 99, baseType: !10, size: 32, offset: 96)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info", scope: !290, file: !253, line: 100, baseType: !10, size: 32, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "b_signal_type_present", scope: !290, file: !253, line: 102, baseType: !10, size: 32, offset: 160)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !290, file: !253, line: 103, baseType: !10, size: 32, offset: 192)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !290, file: !253, line: 104, baseType: !10, size: 32, offset: 224)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "b_color_description_present", scope: !290, file: !253, line: 105, baseType: !10, size: 32, offset: 256)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !290, file: !253, line: 106, baseType: !10, size: 32, offset: 288)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !290, file: !253, line: 107, baseType: !10, size: 32, offset: 320)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !290, file: !253, line: 108, baseType: !10, size: 32, offset: 352)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_loc_info_present", scope: !290, file: !253, line: 110, baseType: !10, size: 32, offset: 384)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_top", scope: !290, file: !253, line: 111, baseType: !10, size: 32, offset: 416)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_bottom", scope: !290, file: !253, line: 112, baseType: !10, size: 32, offset: 448)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "b_timing_info_present", scope: !290, file: !253, line: 114, baseType: !10, size: 32, offset: 480)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_units_in_tick", scope: !290, file: !253, line: 115, baseType: !179, size: 32, offset: 512)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_scale", scope: !290, file: !253, line: 116, baseType: !179, size: 32, offset: 544)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "b_fixed_frame_rate", scope: !290, file: !253, line: 117, baseType: !10, size: 32, offset: 576)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "b_nal_hrd_parameters_present", scope: !290, file: !253, line: 119, baseType: !10, size: 32, offset: 608)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "b_vcl_hrd_parameters_present", scope: !290, file: !253, line: 120, baseType: !10, size: 32, offset: 640)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "hrd", scope: !290, file: !253, line: 137, baseType: !314, size: 384, offset: 672)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !290, file: !253, line: 122, size: 384, elements: !315)
!315 = !{!316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_cnt", scope: !314, file: !253, line: 124, baseType: !10, size: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_scale", scope: !314, file: !253, line: 125, baseType: !10, size: 32, offset: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_scale", scope: !314, file: !253, line: 126, baseType: !10, size: 32, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_value", scope: !314, file: !253, line: 127, baseType: !10, size: 32, offset: 96)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_value", scope: !314, file: !253, line: 128, baseType: !10, size: 32, offset: 128)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_unscaled", scope: !314, file: !253, line: 129, baseType: !10, size: 32, offset: 160)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_unscaled", scope: !314, file: !253, line: 130, baseType: !10, size: 32, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "b_cbr_hrd", scope: !314, file: !253, line: 131, baseType: !10, size: 32, offset: 224)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "i_initial_cpb_removal_delay_length", scope: !314, file: !253, line: 133, baseType: !10, size: 32, offset: 256)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_removal_delay_length", scope: !314, file: !253, line: 134, baseType: !10, size: 32, offset: 288)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay_length", scope: !314, file: !253, line: 135, baseType: !10, size: 32, offset: 320)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_offset_length", scope: !314, file: !253, line: 136, baseType: !10, size: 32, offset: 352)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct_present", scope: !290, file: !253, line: 139, baseType: !10, size: 32, offset: 1056)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "b_bitstream_restriction", scope: !290, file: !253, line: 140, baseType: !10, size: 32, offset: 1088)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "b_motion_vectors_over_pic_boundaries", scope: !290, file: !253, line: 141, baseType: !10, size: 32, offset: 1120)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bytes_per_pic_denom", scope: !290, file: !253, line: 142, baseType: !10, size: 32, offset: 1152)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bits_per_mb_denom", scope: !290, file: !253, line: 143, baseType: !10, size: 32, offset: 1184)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_horizontal", scope: !290, file: !253, line: 144, baseType: !10, size: 32, offset: 1216)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_vertical", scope: !290, file: !253, line: 145, baseType: !10, size: 32, offset: 1248)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_reorder_frames", scope: !290, file: !253, line: 146, baseType: !10, size: 32, offset: 1280)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dec_frame_buffering", scope: !290, file: !253, line: 147, baseType: !10, size: 32, offset: 1312)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "b_qpprime_y_zero_transform_bypass", scope: !254, file: !253, line: 152, baseType: !10, size: 32, offset: 10368)
!338 = !{!339}
!339 = !DISubrange(count: 1)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !14, file: !15, line: 431, baseType: !341, size: 64, offset: 25600)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "pps_array", scope: !14, file: !15, line: 432, baseType: !343, size: 960, offset: 25664)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 960, elements: !338)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pps_t", file: !253, line: 186, baseType: !345)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !253, line: 156, size: 960, elements: !346)
!346 = !{!347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !345, file: !253, line: 158, baseType: !10, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !345, file: !253, line: 159, baseType: !10, size: 32, offset: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !345, file: !253, line: 161, baseType: !10, size: 32, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_order", scope: !345, file: !253, line: 163, baseType: !10, size: 32, offset: 96)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_slice_groups", scope: !345, file: !253, line: 164, baseType: !10, size: 32, offset: 128)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_default_active", scope: !345, file: !253, line: 166, baseType: !10, size: 32, offset: 160)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_default_active", scope: !345, file: !253, line: 167, baseType: !10, size: 32, offset: 192)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_pred", scope: !345, file: !253, line: 169, baseType: !10, size: 32, offset: 224)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !345, file: !253, line: 170, baseType: !10, size: 32, offset: 256)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qp", scope: !345, file: !253, line: 172, baseType: !10, size: 32, offset: 288)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qs", scope: !345, file: !253, line: 173, baseType: !10, size: 32, offset: 320)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_index_offset", scope: !345, file: !253, line: 175, baseType: !10, size: 32, offset: 352)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter_control", scope: !345, file: !253, line: 177, baseType: !10, size: 32, offset: 384)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra_pred", scope: !345, file: !253, line: 178, baseType: !10, size: 32, offset: 416)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "b_redundant_pic_cnt", scope: !345, file: !253, line: 179, baseType: !10, size: 32, offset: 448)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8_mode", scope: !345, file: !253, line: 181, baseType: !10, size: 32, offset: 480)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !345, file: !253, line: 183, baseType: !10, size: 32, offset: 512)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !345, file: !253, line: 184, baseType: !365, size: 384, offset: 576)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 384, elements: !368)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !67)
!368 = !{!369}
!369 = !DISubrange(count: 6)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !14, file: !15, line: 433, baseType: !371, size: 64, offset: 26624)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !14, file: !15, line: 434, baseType: !10, size: 32, offset: 26688)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts_compress_multiplier", scope: !14, file: !15, line: 437, baseType: !10, size: 32, offset: 26720)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_mf", scope: !14, file: !15, line: 440, baseType: !375, size: 256, offset: 26752)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !376, size: 256, elements: !378)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 512, elements: !72)
!378 = !{!379}
!379 = !DISubrange(count: 4)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_mf", scope: !14, file: !15, line: 441, baseType: !381, size: 128, offset: 27008)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !382, size: 128, elements: !127)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 2048, elements: !79)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "unquant4_mf", scope: !14, file: !15, line: 443, baseType: !375, size: 256, offset: 27136)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "unquant8_mf", scope: !14, file: !15, line: 444, baseType: !381, size: 128, offset: 27392)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_mf", scope: !14, file: !15, line: 446, baseType: !387, size: 256, offset: 27520)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 256, elements: !378)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 256, elements: !72)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !68, line: 25, baseType: !391)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !70, line: 40, baseType: !392)
!392 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_mf", scope: !14, file: !15, line: 447, baseType: !394, size: 128, offset: 27776)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !395, size: 128, elements: !127)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 1024, elements: !79)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_bias", scope: !14, file: !15, line: 448, baseType: !387, size: 256, offset: 27904)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_bias", scope: !14, file: !15, line: 449, baseType: !394, size: 128, offset: 28160)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv", scope: !14, file: !15, line: 454, baseType: !400, size: 5888, offset: 28288)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !401, size: 5888, elements: !402)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!402 = !{!403}
!403 = !DISubrange(count: 92)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv_fpel", scope: !14, file: !15, line: 455, baseType: !405, size: 23552, offset: 34176)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !401, size: 23552, elements: !406)
!406 = !{!403, !379}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !14, file: !15, line: 457, baseType: !366, size: 64, offset: 57728)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !14, file: !15, line: 460, baseType: !409, size: 53376, offset: 57856)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_slice_header_t", file: !15, line: 364, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 302, size: 53376, elements: !411)
!411 = !{!412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !440, !471, !472, !473, !479, !480, !481, !482, !483, !484, !485, !486}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !410, file: !15, line: 304, baseType: !341, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !410, file: !15, line: 305, baseType: !371, size: 64, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !410, file: !15, line: 307, baseType: !10, size: 32, offset: 128)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "i_first_mb", scope: !410, file: !15, line: 308, baseType: !10, size: 32, offset: 160)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_mb", scope: !410, file: !15, line: 309, baseType: !10, size: 32, offset: 192)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "i_pps_id", scope: !410, file: !15, line: 311, baseType: !10, size: 32, offset: 224)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !410, file: !15, line: 313, baseType: !10, size: 32, offset: 256)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "b_mbaff", scope: !410, file: !15, line: 315, baseType: !10, size: 32, offset: 288)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "b_field_pic", scope: !410, file: !15, line: 316, baseType: !10, size: 32, offset: 320)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "b_bottom_field", scope: !410, file: !15, line: 317, baseType: !10, size: 32, offset: 352)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !410, file: !15, line: 319, baseType: !10, size: 32, offset: 384)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !410, file: !15, line: 321, baseType: !10, size: 32, offset: 416)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc_bottom", scope: !410, file: !15, line: 322, baseType: !10, size: 32, offset: 448)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc", scope: !410, file: !15, line: 324, baseType: !126, size: 64, offset: 480)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "i_redundant_pic_cnt", scope: !410, file: !15, line: 325, baseType: !10, size: 32, offset: 544)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_spatial_mv_pred", scope: !410, file: !15, line: 327, baseType: !10, size: 32, offset: 576)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "b_num_ref_idx_override", scope: !410, file: !15, line: 329, baseType: !10, size: 32, offset: 608)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !410, file: !15, line: 330, baseType: !10, size: 32, offset: 640)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !410, file: !15, line: 331, baseType: !10, size: 32, offset: 672)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l0", scope: !410, file: !15, line: 333, baseType: !10, size: 32, offset: 704)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l1", scope: !410, file: !15, line: 334, baseType: !10, size: 32, offset: 736)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_order", scope: !410, file: !15, line: 339, baseType: !434, size: 2048, offset: 768)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !435, size: 2048, elements: !439)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !410, file: !15, line: 335, size: 64, elements: !436)
!436 = !{!437, !438}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "idc", scope: !435, file: !15, line: 337, baseType: !10, size: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !435, file: !15, line: 338, baseType: !10, size: 32, offset: 32)
!439 = !{!128, !73}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !410, file: !15, line: 342, baseType: !441, size: 49152, offset: 2816)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !442, size: 49152, elements: !468)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_weight_t", file: !443, line: 36, baseType: !444, align: 128)
!443 = !DIFile(filename: "x264_src/common/mc.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_weight_t", file: !443, line: 26, size: 512, elements: !445)
!445 = !{!446, !454, !455, !458, !459, !460}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "cachea", scope: !444, file: !443, line: 30, baseType: !447, size: 128, align: 128)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !448, size: 128, elements: !452)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !449, line: 25, baseType: !450)
!449 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !70, line: 39, baseType: !451)
!451 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!452 = !{!453}
!453 = !DISubrange(count: 8)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "cacheb", scope: !444, file: !443, line: 31, baseType: !447, size: 128, offset: 128)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "i_denom", scope: !444, file: !443, line: 32, baseType: !456, size: 32, offset: 256)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !449, line: 26, baseType: !457)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !70, line: 41, baseType: !10)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "i_scale", scope: !444, file: !443, line: 33, baseType: !456, size: 32, offset: 288)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset", scope: !444, file: !443, line: 34, baseType: !456, size: 32, offset: 320)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "weightfn", scope: !444, file: !443, line: 35, baseType: !461, size: 64, offset: 384)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "weight_fn_t", file: !443, line: 25, baseType: !463)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DISubroutineType(types: !465)
!465 = !{null, !218, !10, !218, !10, !466, !10}
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !444)
!468 = !{!469, !470}
!469 = !DISubrange(count: 32)
!470 = !DISubrange(count: 3)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_remove_from_end", scope: !410, file: !15, line: 344, baseType: !10, size: 32, offset: 51968)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_command_count", scope: !410, file: !15, line: 345, baseType: !10, size: 32, offset: 52000)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "mmco", scope: !410, file: !15, line: 350, baseType: !474, size: 1024, offset: 52032)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !475, size: 1024, elements: !72)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !410, file: !15, line: 346, size: 64, elements: !476)
!476 = !{!477, !478}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "i_difference_of_pic_nums", scope: !475, file: !15, line: 348, baseType: !10, size: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !475, file: !15, line: 349, baseType: !10, size: 32, offset: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !410, file: !15, line: 352, baseType: !10, size: 32, offset: 53056)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !410, file: !15, line: 354, baseType: !10, size: 32, offset: 53088)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_delta", scope: !410, file: !15, line: 355, baseType: !10, size: 32, offset: 53120)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "b_sp_for_swidth", scope: !410, file: !15, line: 356, baseType: !10, size: 32, offset: 53152)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "i_qs_delta", scope: !410, file: !15, line: 357, baseType: !10, size: 32, offset: 53184)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "i_disable_deblocking_filter_idc", scope: !410, file: !15, line: 360, baseType: !10, size: 32, offset: 53216)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "i_alpha_c0_offset", scope: !410, file: !15, line: 361, baseType: !10, size: 32, offset: 53248)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "i_beta_offset", scope: !410, file: !15, line: 362, baseType: !10, size: 32, offset: 53280)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !14, file: !15, line: 463, baseType: !488, size: 4096, offset: 111232)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_cabac_t", file: !489, line: 46, baseType: !490)
!489 = !DIFile(filename: "x264_src/common/cabac.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !489, line: 27, size: 4096, elements: !491)
!491 = !{!492, !493, !494, !495, !496, !497, !498, !499, !500}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "i_low", scope: !490, file: !489, line: 30, baseType: !10, size: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "i_range", scope: !490, file: !489, line: 31, baseType: !10, size: 32, offset: 32)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "i_queue", scope: !490, file: !489, line: 34, baseType: !10, size: 32, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "i_bytes_outstanding", scope: !490, file: !489, line: 35, baseType: !10, size: 32, offset: 96)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !490, file: !489, line: 37, baseType: !218, size: 64, offset: 128)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !490, file: !489, line: 38, baseType: !218, size: 64, offset: 192)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !490, file: !489, line: 39, baseType: !218, size: 64, offset: 256)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "f8_bits_encoded", scope: !490, file: !489, line: 42, baseType: !10, size: 32, align: 128, offset: 384)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !490, file: !489, line: 45, baseType: !501, size: 3680, offset: 416)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 3680, elements: !502)
!502 = !{!503}
!503 = !DISubrange(count: 460)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !14, file: !15, line: 494, baseType: !505, size: 2112, offset: 115328)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !14, file: !15, line: 465, size: 2112, elements: !506)
!506 = !{!507, !648, !650, !651, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !664, !665, !666, !667}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !505, file: !15, line: 468, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_frame_t", file: !511, line: 146, baseType: !512)
!511 = !DIFile(filename: "x264_src/common/frame.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_frame", file: !511, line: 31, size: 125056, elements: !513)
!513 = !{!514, !515, !516, !517, !520, !521, !522, !523, !524, !525, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !544, !545, !546, !547, !548, !549, !551, !553, !554, !555, !556, !557, !560, !562, !563, !565, !570, !571, !575, !576, !580, !584, !587, !589, !590, !592, !593, !595, !596, !597, !600, !602, !603, !604, !606, !607, !608, !609, !610, !611, !612, !613, !615, !616, !620, !629, !633, !635, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !512, file: !511, line: 34, baseType: !10, size: 32)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !512, file: !511, line: 35, baseType: !10, size: 32, offset: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !512, file: !511, line: 36, baseType: !10, size: 32, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !512, file: !511, line: 37, baseType: !518, size: 64, offset: 128)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !449, line: 27, baseType: !519)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !70, line: 44, baseType: !232)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts", scope: !512, file: !511, line: 38, baseType: !518, size: 64, offset: 192)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "i_duration", scope: !512, file: !511, line: 39, baseType: !10, size: 32, offset: 256)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_duration", scope: !512, file: !511, line: 40, baseType: !10, size: 32, offset: 288)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !512, file: !511, line: 41, baseType: !10, size: 32, offset: 320)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay", scope: !512, file: !511, line: 42, baseType: !10, size: 32, offset: 352)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !512, file: !511, line: 43, baseType: !526, size: 64, offset: 384)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !512, file: !511, line: 45, baseType: !10, size: 32, offset: 448)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded", scope: !512, file: !511, line: 46, baseType: !10, size: 32, offset: 480)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "i_field_cnt", scope: !512, file: !511, line: 47, baseType: !10, size: 32, offset: 512)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !512, file: !511, line: 48, baseType: !10, size: 32, offset: 544)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "b_kept_as_ref", scope: !512, file: !511, line: 49, baseType: !10, size: 32, offset: 576)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_struct", scope: !512, file: !511, line: 50, baseType: !10, size: 32, offset: 608)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "b_keyframe", scope: !512, file: !511, line: 51, baseType: !10, size: 32, offset: 640)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "b_fdec", scope: !512, file: !511, line: 52, baseType: !67, size: 8, offset: 672)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_minigop_bframe", scope: !512, file: !511, line: 53, baseType: !67, size: 8, offset: 680)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframes", scope: !512, file: !511, line: 54, baseType: !67, size: 8, offset: 688)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_rc", scope: !512, file: !511, line: 55, baseType: !122, size: 32, offset: 704)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_aq", scope: !512, file: !511, line: 56, baseType: !122, size: 32, offset: 736)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_l0ref0", scope: !512, file: !511, line: 57, baseType: !10, size: 32, offset: 768)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !512, file: !511, line: 60, baseType: !10, size: 32, offset: 800)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !512, file: !511, line: 61, baseType: !542, size: 96, offset: 832)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 96, elements: !543)
!543 = !{!470}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !512, file: !511, line: 62, baseType: !542, size: 96, offset: 928)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines", scope: !512, file: !511, line: 63, baseType: !542, size: 96, offset: 1024)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride_lowres", scope: !512, file: !511, line: 64, baseType: !10, size: 32, offset: 1120)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "i_width_lowres", scope: !512, file: !511, line: 65, baseType: !10, size: 32, offset: 1152)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_lowres", scope: !512, file: !511, line: 66, baseType: !10, size: 32, offset: 1184)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !512, file: !511, line: 67, baseType: !550, size: 192, offset: 1216)
!550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 192, elements: !543)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "filtered", scope: !512, file: !511, line: 68, baseType: !552, size: 256, offset: 1408)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 256, elements: !378)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !512, file: !511, line: 69, baseType: !552, size: 256, offset: 1664)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "integral", scope: !512, file: !511, line: 70, baseType: !401, size: 64, offset: 1920)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !512, file: !511, line: 74, baseType: !552, size: 256, offset: 1984)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_lowres", scope: !512, file: !511, line: 75, baseType: !552, size: 256, offset: 2240)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !512, file: !511, line: 77, baseType: !558, size: 24576, offset: 2560)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !442, size: 24576, elements: !559)
!559 = !{!73, !470}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "weighted", scope: !512, file: !511, line: 78, baseType: !561, size: 1024, offset: 27136)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 1024, elements: !72)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "b_duplicate", scope: !512, file: !511, line: 79, baseType: !10, size: 32, offset: 28160)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !512, file: !511, line: 80, baseType: !564, size: 64, offset: 28224)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !512, file: !511, line: 83, baseType: !566, size: 64, offset: 28288)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !449, line: 24, baseType: !568)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !70, line: 37, baseType: !569)
!569 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "mb_partition", scope: !512, file: !511, line: 84, baseType: !218, size: 64, offset: 28352)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !512, file: !511, line: 85, baseType: !572, size: 128, offset: 28416)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !573, size: 128, elements: !127)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !448, size: 32, elements: !127)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "mv16x16", scope: !512, file: !511, line: 86, baseType: !573, size: 64, offset: 28544)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mvs", scope: !512, file: !511, line: 87, baseType: !577, size: 2176, offset: 28608)
!577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !573, size: 2176, elements: !578)
!578 = !{!128, !579}
!579 = !DISubrange(count: 17)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_costs", scope: !512, file: !511, line: 92, baseType: !581, size: 20736, offset: 30784)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !401, size: 20736, elements: !582)
!582 = !{!583, !583}
!583 = !DISubrange(count: 18)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mv_costs", scope: !512, file: !511, line: 96, baseType: !585, size: 2176, offset: 51520)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !586, size: 2176, elements: !578)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !512, file: !511, line: 97, baseType: !588, size: 128, offset: 53696)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, size: 128, elements: !127)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref", scope: !512, file: !511, line: 98, baseType: !126, size: 64, offset: 53824)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc", scope: !512, file: !511, line: 99, baseType: !591, size: 1024, offset: 53888)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 1024, elements: !439)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "inv_ref_poc", scope: !512, file: !511, line: 100, baseType: !574, size: 32, offset: 54912)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est", scope: !512, file: !511, line: 105, baseType: !594, size: 10368, offset: 54944)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 10368, elements: !582)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est_aq", scope: !512, file: !511, line: 106, baseType: !594, size: 10368, offset: 65312)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "i_satd", scope: !512, file: !511, line: 107, baseType: !10, size: 32, offset: 75680)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_mbs", scope: !512, file: !511, line: 108, baseType: !598, size: 576, offset: 75712)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 576, elements: !599)
!599 = !{!583}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satds", scope: !512, file: !511, line: 109, baseType: !601, size: 20736, offset: 76288)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !586, size: 20736, elements: !582)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satd", scope: !512, file: !511, line: 110, baseType: !586, size: 64, offset: 97024)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_bits", scope: !512, file: !511, line: 111, baseType: !586, size: 64, offset: 97088)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "f_row_qp", scope: !512, file: !511, line: 112, baseType: !605, size: 64, offset: 97152)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset", scope: !512, file: !511, line: 113, baseType: !605, size: 64, offset: 97216)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset_aq", scope: !512, file: !511, line: 114, baseType: !605, size: 64, offset: 97280)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_calculated", scope: !512, file: !511, line: 115, baseType: !10, size: 32, offset: 97344)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !512, file: !511, line: 116, baseType: !401, size: 64, offset: 97408)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "i_propagate_cost", scope: !512, file: !511, line: 117, baseType: !401, size: 64, offset: 97472)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "i_inv_qscale_factor", scope: !512, file: !511, line: 118, baseType: !401, size: 64, offset: 97536)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "b_scenecut", scope: !512, file: !511, line: 119, baseType: !10, size: 32, offset: 97600)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "f_weighted_cost_delta", scope: !512, file: !511, line: 120, baseType: !614, size: 576, offset: 97632)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 576, elements: !599)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_sum", scope: !512, file: !511, line: 121, baseType: !179, size: 32, offset: 98208)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_ssd", scope: !512, file: !511, line: 122, baseType: !617, size: 64, offset: 98240)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !68, line: 27, baseType: !618)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !70, line: 45, baseType: !619)
!619 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "hrd_timing", scope: !512, file: !511, line: 125, baseType: !621, size: 256, offset: 98304)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_hrd_t", file: !13, line: 503, baseType: !622)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 496, size: 256, elements: !623)
!623 = !{!624, !626, !627, !628}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_initial_arrival_time", scope: !622, file: !13, line: 498, baseType: !625, size: 64)
!625 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_final_arrival_time", scope: !622, file: !13, line: 499, baseType: !625, size: 64, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_time", scope: !622, file: !13, line: 500, baseType: !625, size: 64, offset: 128)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_time", scope: !622, file: !13, line: 502, baseType: !625, size: 64, offset: 192)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_type", scope: !512, file: !511, line: 128, baseType: !630, size: 2008, offset: 98560)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 2008, elements: !631)
!631 = !{!632}
!632 = !DISubrange(count: 251)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_satd", scope: !512, file: !511, line: 129, baseType: !634, size: 8032, offset: 100576)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 8032, elements: !631)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "f_planned_cpb_duration", scope: !512, file: !511, line: 130, baseType: !636, size: 16064, offset: 108608)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !625, size: 16064, elements: !631)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !512, file: !511, line: 131, baseType: !10, size: 32, offset: 124672)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !512, file: !511, line: 132, baseType: !10, size: 32, offset: 124704)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_completed", scope: !512, file: !511, line: 135, baseType: !10, size: 32, offset: 124736)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_weighted", scope: !512, file: !511, line: 136, baseType: !10, size: 32, offset: 124768)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "i_reference_count", scope: !512, file: !511, line: 137, baseType: !10, size: 32, offset: 124800)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !512, file: !511, line: 138, baseType: !10, size: 32, offset: 124832)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !512, file: !511, line: 139, baseType: !10, size: 32, offset: 124864)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "f_pir_position", scope: !512, file: !511, line: 142, baseType: !122, size: 32, offset: 124896)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_start_col", scope: !512, file: !511, line: 143, baseType: !10, size: 32, offset: 124928)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_end_col", scope: !512, file: !511, line: 144, baseType: !10, size: 32, offset: 124960)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "i_frames_since_pir", scope: !512, file: !511, line: 145, baseType: !10, size: 32, offset: 124992)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !505, file: !15, line: 470, baseType: !649, size: 128, offset: 64)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !508, size: 128, elements: !127)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "blank_unused", scope: !505, file: !15, line: 473, baseType: !508, size: 64, offset: 192)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !505, file: !15, line: 476, baseType: !652, size: 1152, offset: 256)
!652 = !DICompositeType(tag: DW_TAG_array_type, baseType: !509, size: 1152, elements: !599)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_keyframe", scope: !505, file: !15, line: 478, baseType: !10, size: 32, offset: 1408)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "i_input", scope: !505, file: !15, line: 480, baseType: !10, size: 32, offset: 1440)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dpb", scope: !505, file: !15, line: 482, baseType: !10, size: 32, offset: 1472)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref0", scope: !505, file: !15, line: 483, baseType: !10, size: 32, offset: 1504)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref1", scope: !505, file: !15, line: 484, baseType: !10, size: 32, offset: 1536)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "i_delay", scope: !505, file: !15, line: 485, baseType: !10, size: 32, offset: 1568)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay", scope: !505, file: !15, line: 486, baseType: !10, size: 32, offset: 1600)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay_time", scope: !505, file: !15, line: 487, baseType: !518, size: 64, offset: 1664)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "i_init_delta", scope: !505, file: !15, line: 488, baseType: !518, size: 64, offset: 1728)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_reordered_pts", scope: !505, file: !15, line: 489, baseType: !663, size: 128, offset: 1792)
!663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !518, size: 128, elements: !127)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "i_largest_pts", scope: !505, file: !15, line: 490, baseType: !518, size: 64, offset: 1920)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "i_second_largest_pts", scope: !505, file: !15, line: 491, baseType: !518, size: 64, offset: 1984)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_lowres", scope: !505, file: !15, line: 492, baseType: !10, size: 32, offset: 2048)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_sub8x8_esa", scope: !505, file: !15, line: 493, baseType: !10, size: 32, offset: 2080)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "fenc", scope: !14, file: !15, line: 497, baseType: !509, size: 64, offset: 117440)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "fdec", scope: !14, file: !15, line: 500, baseType: !509, size: 64, offset: 117504)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref0", scope: !14, file: !15, line: 503, baseType: !10, size: 32, offset: 117568)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "fref0", scope: !14, file: !15, line: 504, baseType: !672, size: 1216, offset: 117632)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !509, size: 1216, elements: !673)
!673 = !{!674}
!674 = !DISubrange(count: 19)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref1", scope: !14, file: !15, line: 505, baseType: !10, size: 32, offset: 118848)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "fref1", scope: !14, file: !15, line: 506, baseType: !672, size: 1216, offset: 118912)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_reorder", scope: !14, file: !15, line: 507, baseType: !126, size: 64, offset: 120128)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay", scope: !14, file: !15, line: 510, baseType: !10, size: 32, offset: 120192)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_offset", scope: !14, file: !15, line: 511, baseType: !10, size: 32, offset: 120224)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts_delay", scope: !14, file: !15, line: 512, baseType: !518, size: 64, offset: 120256)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "dct", scope: !14, file: !15, line: 522, baseType: !682, size: 10624, offset: 120320)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !14, file: !15, line: 515, size: 10624, elements: !683)
!683 = !{!684, !686, !689, !692}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "luma16x16_dc", scope: !682, file: !15, line: 517, baseType: !685, size: 256, align: 128)
!685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !448, size: 256, elements: !72)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_dc", scope: !682, file: !15, line: 518, baseType: !687, size: 128, align: 128, offset: 256)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !448, size: 128, elements: !688)
!688 = !{!128, !379}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "luma8x8", scope: !682, file: !15, line: 520, baseType: !690, size: 4096, align: 128, offset: 384)
!690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !448, size: 4096, elements: !691)
!691 = !{!379, !80}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "luma4x4", scope: !682, file: !15, line: 521, baseType: !693, size: 6144, align: 128, offset: 4480)
!693 = !DICompositeType(tag: DW_TAG_array_type, baseType: !448, size: 6144, elements: !694)
!694 = !{!695, !73}
!695 = !DISubrange(count: 24)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !14, file: !15, line: 732, baseType: !697, size: 82688, offset: 130944)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !14, file: !15, line: 525, size: 82688, elements: !698)
!698 = !{!699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !726, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !744, !747, !751, !752, !753, !758, !759, !762, !763, !764, !765, !766, !767, !768, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !828, !859, !860, !861, !862, !863, !864, !865, !866, !867, !870, !871, !872, !875, !878, !880, !883, !885, !886}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !697, file: !15, line: 527, baseType: !10, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_stride", scope: !697, file: !15, line: 530, baseType: !10, size: 32, offset: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_stride", scope: !697, file: !15, line: 531, baseType: !10, size: 32, offset: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_stride", scope: !697, file: !15, line: 532, baseType: !10, size: 32, offset: 96)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_x", scope: !697, file: !15, line: 535, baseType: !10, size: 32, offset: 128)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_y", scope: !697, file: !15, line: 536, baseType: !10, size: 32, offset: 160)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_xy", scope: !697, file: !15, line: 537, baseType: !10, size: 32, offset: 192)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_xy", scope: !697, file: !15, line: 538, baseType: !10, size: 32, offset: 224)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_xy", scope: !697, file: !15, line: 539, baseType: !10, size: 32, offset: 256)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !697, file: !15, line: 542, baseType: !10, size: 32, offset: 288)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !697, file: !15, line: 543, baseType: !10, size: 32, offset: 320)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !697, file: !15, line: 544, baseType: !10, size: 32, offset: 352)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "b_trellis", scope: !697, file: !15, line: 545, baseType: !10, size: 32, offset: 384)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "b_noise_reduction", scope: !697, file: !15, line: 546, baseType: !10, size: 32, offset: 416)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !697, file: !15, line: 547, baseType: !10, size: 32, offset: 448)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_rd", scope: !697, file: !15, line: 548, baseType: !10, size: 32, offset: 480)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_trellis", scope: !697, file: !15, line: 549, baseType: !10, size: 32, offset: 512)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !697, file: !15, line: 551, baseType: !10, size: 32, offset: 544)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min", scope: !697, file: !15, line: 554, baseType: !126, size: 64, offset: 576)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max", scope: !697, file: !15, line: 555, baseType: !126, size: 64, offset: 640)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_spel", scope: !697, file: !15, line: 558, baseType: !126, size: 64, offset: 704)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_spel", scope: !697, file: !15, line: 559, baseType: !126, size: 64, offset: 768)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_fpel", scope: !697, file: !15, line: 561, baseType: !126, size: 64, offset: 832)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_fpel", scope: !697, file: !15, line: 562, baseType: !126, size: 64, offset: 896)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour", scope: !697, file: !15, line: 565, baseType: !22, size: 32, offset: 960)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour8", scope: !697, file: !15, line: 566, baseType: !725, size: 128, offset: 992)
!725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 128, elements: !378)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour4", scope: !697, file: !15, line: 567, baseType: !727, size: 512, offset: 1120)
!727 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 512, elements: !72)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_intra", scope: !697, file: !15, line: 568, baseType: !22, size: 32, offset: 1632)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_frame", scope: !697, file: !15, line: 569, baseType: !22, size: 32, offset: 1664)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_top", scope: !697, file: !15, line: 570, baseType: !10, size: 32, offset: 1696)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_left", scope: !697, file: !15, line: 571, baseType: !10, size: 32, offset: 1728)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topleft", scope: !697, file: !15, line: 572, baseType: !10, size: 32, offset: 1760)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topright", scope: !697, file: !15, line: 573, baseType: !10, size: 32, offset: 1792)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_prev_xy", scope: !697, file: !15, line: 574, baseType: !10, size: 32, offset: 1824)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_left_xy", scope: !697, file: !15, line: 575, baseType: !10, size: 32, offset: 1856)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_top_xy", scope: !697, file: !15, line: 576, baseType: !10, size: 32, offset: 1888)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topleft_xy", scope: !697, file: !15, line: 577, baseType: !10, size: 32, offset: 1920)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topright_xy", scope: !697, file: !15, line: 578, baseType: !10, size: 32, offset: 1952)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !697, file: !15, line: 585, baseType: !566, size: 64, offset: 1984)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "partition", scope: !697, file: !15, line: 586, baseType: !218, size: 64, offset: 2048)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !697, file: !15, line: 587, baseType: !566, size: 64, offset: 2112)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !697, file: !15, line: 588, baseType: !743, size: 64, offset: 2176)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !697, file: !15, line: 589, baseType: !745, size: 64, offset: 2240)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DICompositeType(tag: DW_TAG_array_type, baseType: !567, size: 64, elements: !452)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !697, file: !15, line: 591, baseType: !748, size: 64, offset: 2304)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 192, elements: !750)
!750 = !{!695}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_pred_mode", scope: !697, file: !15, line: 592, baseType: !566, size: 64, offset: 2368)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !697, file: !15, line: 593, baseType: !572, size: 128, offset: 2432)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !697, file: !15, line: 594, baseType: !754, size: 128, offset: 2560)
!754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !755, size: 128, elements: !127)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 128, elements: !757)
!757 = !{!453, !128}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !697, file: !15, line: 595, baseType: !588, size: 128, offset: 2688)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "mvr", scope: !697, file: !15, line: 596, baseType: !760, size: 4096, offset: 2816)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !573, size: 4096, elements: !761)
!761 = !{!128, !469}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "skipbp", scope: !697, file: !15, line: 597, baseType: !566, size: 64, offset: 6912)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "mb_transform_size", scope: !697, file: !15, line: 598, baseType: !566, size: 64, offset: 6976)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "slice_table", scope: !697, file: !15, line: 599, baseType: !401, size: 64, offset: 7040)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "p_weight_buf", scope: !697, file: !15, line: 603, baseType: !561, size: 1024, offset: 7104)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !697, file: !15, line: 606, baseType: !10, size: 32, offset: 8128)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "i_partition", scope: !697, file: !15, line: 607, baseType: !10, size: 32, offset: 8160)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "i_sub_partition", scope: !697, file: !15, line: 608, baseType: !769, size: 32, align: 32, offset: 8192)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 32, elements: !378)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !697, file: !15, line: 609, baseType: !10, size: 32, offset: 8224)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_luma", scope: !697, file: !15, line: 611, baseType: !10, size: 32, offset: 8256)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_chroma", scope: !697, file: !15, line: 612, baseType: !10, size: 32, offset: 8288)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra16x16_pred_mode", scope: !697, file: !15, line: 614, baseType: !10, size: 32, offset: 8320)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_pred_mode", scope: !697, file: !15, line: 615, baseType: !10, size: 32, offset: 8352)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "i_skip_intra", scope: !697, file: !15, line: 621, baseType: !10, size: 32, offset: 8384)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "b_skip_mc", scope: !697, file: !15, line: 624, baseType: !10, size: 32, offset: 8416)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "b_reencode_mb", scope: !697, file: !15, line: 626, baseType: !10, size: 32, offset: 8448)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "ip_offset", scope: !697, file: !15, line: 627, baseType: !10, size: 32, offset: 8480)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "pic", scope: !697, file: !15, line: 671, baseType: !780, size: 60672, offset: 8576)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !697, file: !15, line: 629, size: 60672, elements: !781)
!781 = !{!782, !786, !790, !792, !793, !796, !800, !802, !803, !804, !805, !806, !809, !813, !816, !817, !818, !819, !820, !823, !825, !827}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_buf", scope: !780, file: !15, line: 634, baseType: !783, size: 3072, align: 128)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 3072, elements: !784)
!784 = !{!785}
!785 = !DISubrange(count: 384)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "fdec_buf", scope: !780, file: !15, line: 635, baseType: !787, size: 6912, align: 128, offset: 3072)
!787 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 6912, elements: !788)
!788 = !{!789}
!789 = !DISubrange(count: 864)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_fdec_buf", scope: !780, file: !15, line: 638, baseType: !791, size: 2048, align: 128, offset: 9984)
!791 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 2048, elements: !271)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_fdec_buf", scope: !780, file: !15, line: 639, baseType: !791, size: 2048, align: 128, offset: 12032)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_dct_buf", scope: !780, file: !15, line: 640, baseType: !794, size: 3072, align: 128, offset: 14080)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !448, size: 3072, elements: !795)
!795 = !{!470, !80}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_dct_buf", scope: !780, file: !15, line: 641, baseType: !797, size: 3840, align: 128, offset: 17152)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !448, size: 3840, elements: !798)
!798 = !{!799, !73}
!799 = !DISubrange(count: 15)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_nnz_buf", scope: !780, file: !15, line: 642, baseType: !801, size: 128, offset: 20992)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 128, elements: !378)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_nnz_buf", scope: !780, file: !15, line: 643, baseType: !801, size: 128, offset: 21120)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_cbp", scope: !780, file: !15, line: 644, baseType: !10, size: 32, offset: 21248)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_cbp", scope: !780, file: !15, line: 645, baseType: !10, size: 32, offset: 21280)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct8", scope: !780, file: !15, line: 648, baseType: !690, size: 4096, align: 128, offset: 21376)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct4", scope: !780, file: !15, line: 649, baseType: !807, size: 4096, align: 128, offset: 25472)
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !448, size: 4096, elements: !808)
!808 = !{!73, !73}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_hadamard_cache", scope: !780, file: !15, line: 652, baseType: !810, size: 576, align: 128, offset: 29568)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !617, size: 576, elements: !811)
!811 = !{!812}
!812 = !DISubrange(count: 9)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_satd_cache", scope: !780, file: !15, line: 653, baseType: !814, size: 1024, align: 128, offset: 30208)
!814 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 1024, elements: !815)
!815 = !{!469}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "p_fenc", scope: !780, file: !15, line: 656, baseType: !550, size: 192, offset: 31232)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "p_fenc_plane", scope: !780, file: !15, line: 658, baseType: !550, size: 192, offset: 31424)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "p_fdec", scope: !780, file: !15, line: 661, baseType: !550, size: 192, offset: 31616)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "i_fref", scope: !780, file: !15, line: 664, baseType: !126, size: 64, offset: 31808)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "p_fref", scope: !780, file: !15, line: 665, baseType: !821, size: 24576, offset: 31872)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 24576, elements: !822)
!822 = !{!128, !469, !369}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "p_fref_w", scope: !780, file: !15, line: 666, baseType: !824, size: 2048, offset: 56448)
!824 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 2048, elements: !815)
