; ModuleID = 'x264_src/input/y4m.c'
source_filename = "x264_src/input/y4m.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.cli_input_t = type { i32 (i8*, i8**, %struct.video_info_t*, %struct.cli_input_opt_t*)*, i32 (i8*)*, i32 (%struct.x264_picture_t*, i32, i32, i32)*, i32 (%struct.x264_picture_t*, i8*, i32)*, i32 (%struct.x264_picture_t*, i8*)*, void (%struct.x264_picture_t*)*, i32 (i8*)* }
%struct.video_info_t = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.cli_input_opt_t = type { i8*, i8*, i8*, i32 }
%struct.x264_picture_t = type { i32, i32, i32, i32, i64, i64, %struct.x264_param_t*, %struct.x264_image_t, %struct.x264_hrd_t, i8* }
%struct.x264_param_t = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.anon, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, [16 x i8], [16 x i8], [16 x i8], [16 x i8], [64 x i8], [64 x i8], void (i8*, i32, i8*, %struct.__va_list_tag*)*, i8*, i32, i32, i8*, %struct.anon.0, %struct.anon.1, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, void (i8*)* }
%struct.anon = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.anon.0 = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, float, float, i32, [2 x i32], i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "y4m_input", scope: !2, file: !3, line: 265, type: !37, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !36, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "x264_src/input/y4m.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{}
!5 = !{!6, !7, !8, !13}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !9, line: 27, baseType: !10)
!9 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !11, line: 45, baseType: !12)
!11 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!12 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_union32_t", file: !15, line: 89, baseType: !16)
!15 = !DIFile(filename: "x264_src/common/common.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!16 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !15, line: 89, size: 32, elements: !17)
!17 = !{!18, !22, !29}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !16, file: !15, line: 89, baseType: !19, size: 32)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !9, line: 26, baseType: !20)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !11, line: 42, baseType: !21)
!21 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !16, file: !15, line: 89, baseType: !23, size: 32)
!23 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 32, elements: !27)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !9, line: 25, baseType: !25)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !11, line: 40, baseType: !26)
!26 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!27 = !{!28}
!28 = !DISubrange(count: 2)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !16, file: !15, line: 89, baseType: !30, size: 32)
!30 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 32, elements: !34)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !9, line: 24, baseType: !32)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !11, line: 38, baseType: !33)
!33 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!34 = !{!35}
!35 = !DISubrange(count: 4)
!36 = !{!0}
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "cli_input_t", file: !39, line: 63, baseType: !40)
!39 = !DIFile(filename: "x264_src/input/input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 54, size: 448, elements: !41)
!41 = !{!42, !75, !79, !285, !289, !293, !297}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "open_file", scope: !40, file: !39, line: 56, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{!7, !46, !48, !51, !67}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "hnd_t", file: !50, line: 30, baseType: !6)
!50 = !DIFile(filename: "x264_src/muxers.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "video_info_t", file: !39, line: 52, baseType: !53)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 38, size: 384, elements: !54)
!54 = !{!55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "csp", scope: !53, file: !39, line: 40, baseType: !7, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "fps_num", scope: !53, file: !39, line: 41, baseType: !19, size: 32, offset: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "fps_den", scope: !53, file: !39, line: 42, baseType: !19, size: 32, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !53, file: !39, line: 43, baseType: !7, size: 32, offset: 96)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced", scope: !53, file: !39, line: 44, baseType: !7, size: 32, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !53, file: !39, line: 45, baseType: !19, size: 32, offset: 160)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !53, file: !39, line: 46, baseType: !19, size: 32, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "tff", scope: !53, file: !39, line: 47, baseType: !7, size: 32, offset: 224)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "timebase_num", scope: !53, file: !39, line: 48, baseType: !19, size: 32, offset: 256)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "timebase_den", scope: !53, file: !39, line: 49, baseType: !19, size: 32, offset: 288)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "vfr", scope: !53, file: !39, line: 50, baseType: !7, size: 32, offset: 320)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !53, file: !39, line: 51, baseType: !7, size: 32, offset: 352)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "cli_input_opt_t", file: !39, line: 35, baseType: !69)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 29, size: 256, elements: !70)
!70 = !{!71, !72, !73, !74}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !69, file: !39, line: 31, baseType: !46, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "resolution", scope: !69, file: !39, line: 32, baseType: !46, size: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "timebase", scope: !69, file: !39, line: 33, baseType: !46, size: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !69, file: !39, line: 34, baseType: !7, size: 32, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "get_frame_total", scope: !40, file: !39, line: 57, baseType: !76, size: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{!7, !49}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "picture_alloc", scope: !40, file: !39, line: 58, baseType: !80, size: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{!7, !83, !7, !7, !7}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_picture_t", file: !85, line: 549, baseType: !86)
!85 = !DIFile(filename: "x264_src/x264.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !85, line: 513, size: 1088, elements: !87)
!87 = !{!88, !89, !90, !91, !92, !97, !98, !264, !275, !284}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !86, file: !85, line: 521, baseType: !7, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !86, file: !85, line: 523, baseType: !7, size: 32, offset: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_struct", scope: !86, file: !85, line: 526, baseType: !7, size: 32, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "b_keyframe", scope: !86, file: !85, line: 529, baseType: !7, size: 32, offset: 96)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !86, file: !85, line: 531, baseType: !93, size: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !94, line: 27, baseType: !95)
!94 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !11, line: 44, baseType: !96)
!96 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts", scope: !86, file: !85, line: 534, baseType: !93, size: 64, offset: 192)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !86, file: !85, line: 541, baseType: !99, size: 64, offset: 256)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !85, line: 376, baseType: !101)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !85, line: 176, size: 5632, elements: !102)
!102 = !{!103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !148, !149, !150, !151, !155, !156, !169, !170, !171, !172, !173, !202, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !101, file: !85, line: 179, baseType: !21, size: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !101, file: !85, line: 180, baseType: !7, size: 32, offset: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !101, file: !85, line: 181, baseType: !7, size: 32, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !101, file: !85, line: 182, baseType: !7, size: 32, offset: 96)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !101, file: !85, line: 183, baseType: !7, size: 32, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !101, file: !85, line: 186, baseType: !7, size: 32, offset: 160)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !101, file: !85, line: 187, baseType: !7, size: 32, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !101, file: !85, line: 188, baseType: !7, size: 32, offset: 224)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !101, file: !85, line: 189, baseType: !7, size: 32, offset: 256)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !101, file: !85, line: 190, baseType: !7, size: 32, offset: 288)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !101, file: !85, line: 198, baseType: !7, size: 32, offset: 320)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !101, file: !85, line: 215, baseType: !115, size: 288, offset: 352)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !101, file: !85, line: 200, size: 288, elements: !116)
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124, !125}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !115, file: !85, line: 203, baseType: !7, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !115, file: !85, line: 204, baseType: !7, size: 32, offset: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !115, file: !85, line: 206, baseType: !7, size: 32, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !115, file: !85, line: 209, baseType: !7, size: 32, offset: 96)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !115, file: !85, line: 210, baseType: !7, size: 32, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !115, file: !85, line: 211, baseType: !7, size: 32, offset: 160)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !115, file: !85, line: 212, baseType: !7, size: 32, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !115, file: !85, line: 213, baseType: !7, size: 32, offset: 224)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !115, file: !85, line: 214, baseType: !7, size: 32, offset: 256)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !101, file: !85, line: 218, baseType: !7, size: 32, offset: 640)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !101, file: !85, line: 219, baseType: !7, size: 32, offset: 672)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !101, file: !85, line: 220, baseType: !7, size: 32, offset: 704)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !101, file: !85, line: 221, baseType: !7, size: 32, offset: 736)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !101, file: !85, line: 222, baseType: !7, size: 32, offset: 768)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !101, file: !85, line: 224, baseType: !7, size: 32, offset: 800)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !101, file: !85, line: 225, baseType: !7, size: 32, offset: 832)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !101, file: !85, line: 226, baseType: !7, size: 32, offset: 864)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !101, file: !85, line: 227, baseType: !7, size: 32, offset: 896)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !101, file: !85, line: 229, baseType: !7, size: 32, offset: 928)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !101, file: !85, line: 230, baseType: !7, size: 32, offset: 960)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !101, file: !85, line: 231, baseType: !7, size: 32, offset: 992)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !101, file: !85, line: 233, baseType: !7, size: 32, offset: 1024)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !101, file: !85, line: 234, baseType: !7, size: 32, offset: 1056)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !101, file: !85, line: 236, baseType: !7, size: 32, offset: 1088)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !101, file: !85, line: 237, baseType: !7, size: 32, offset: 1120)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !101, file: !85, line: 239, baseType: !7, size: 32, offset: 1152)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !101, file: !85, line: 240, baseType: !46, size: 64, offset: 1216)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !101, file: !85, line: 241, baseType: !145, size: 128, offset: 1280)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 128, elements: !146)
!146 = !{!147}
!147 = !DISubrange(count: 16)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !101, file: !85, line: 242, baseType: !145, size: 128, offset: 1408)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !101, file: !85, line: 243, baseType: !145, size: 128, offset: 1536)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !101, file: !85, line: 244, baseType: !145, size: 128, offset: 1664)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !101, file: !85, line: 245, baseType: !152, size: 512, offset: 1792)
!152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 512, elements: !153)
!153 = !{!154}
!154 = !DISubrange(count: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !101, file: !85, line: 246, baseType: !152, size: 512, offset: 2304)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !101, file: !85, line: 249, baseType: !157, size: 64, offset: 2816)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{null, !6, !7, !160, !162}
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !47)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 265, size: 192, elements: !164)
!164 = !{!165, !166, !167, !168}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !163, file: !3, line: 265, baseType: !21, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !163, file: !3, line: 265, baseType: !21, size: 32, offset: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !163, file: !3, line: 265, baseType: !6, size: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !163, file: !3, line: 265, baseType: !6, size: 64, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !101, file: !85, line: 250, baseType: !6, size: 64, offset: 2880)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !101, file: !85, line: 251, baseType: !7, size: 32, offset: 2944)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !101, file: !85, line: 252, baseType: !7, size: 32, offset: 2976)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !101, file: !85, line: 253, baseType: !46, size: 64, offset: 3008)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !101, file: !85, line: 287, baseType: !174, size: 800, offset: 3072)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !101, file: !85, line: 256, size: 800, elements: !175)
!175 = !{!176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !196, !197, !198, !200, !201}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !174, file: !85, line: 258, baseType: !21, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !174, file: !85, line: 259, baseType: !21, size: 32, offset: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !174, file: !85, line: 261, baseType: !7, size: 32, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !174, file: !85, line: 262, baseType: !7, size: 32, offset: 96)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !174, file: !85, line: 263, baseType: !7, size: 32, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !174, file: !85, line: 264, baseType: !7, size: 32, offset: 160)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !174, file: !85, line: 265, baseType: !7, size: 32, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !174, file: !85, line: 267, baseType: !7, size: 32, offset: 224)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !174, file: !85, line: 268, baseType: !7, size: 32, offset: 256)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !174, file: !85, line: 269, baseType: !7, size: 32, offset: 288)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !174, file: !85, line: 270, baseType: !7, size: 32, offset: 320)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !174, file: !85, line: 271, baseType: !7, size: 32, offset: 352)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !174, file: !85, line: 272, baseType: !7, size: 32, offset: 384)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !174, file: !85, line: 273, baseType: !7, size: 32, offset: 416)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !174, file: !85, line: 274, baseType: !7, size: 32, offset: 448)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !174, file: !85, line: 275, baseType: !7, size: 32, offset: 480)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !174, file: !85, line: 276, baseType: !7, size: 32, offset: 512)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !174, file: !85, line: 277, baseType: !7, size: 32, offset: 544)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !174, file: !85, line: 278, baseType: !195, size: 32, offset: 576)
!195 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !174, file: !85, line: 279, baseType: !195, size: 32, offset: 608)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !174, file: !85, line: 280, baseType: !7, size: 32, offset: 640)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !174, file: !85, line: 283, baseType: !199, size: 64, offset: 672)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !27)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !174, file: !85, line: 285, baseType: !7, size: 32, offset: 736)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !174, file: !85, line: 286, baseType: !7, size: 32, offset: 768)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !101, file: !85, line: 327, baseType: !203, size: 1152, offset: 3904)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !101, file: !85, line: 290, size: 1152, elements: !204)
!204 = !{!205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !242, !243}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !203, file: !85, line: 292, baseType: !7, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !203, file: !85, line: 294, baseType: !7, size: 32, offset: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !203, file: !85, line: 295, baseType: !7, size: 32, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !203, file: !85, line: 296, baseType: !7, size: 32, offset: 96)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !203, file: !85, line: 297, baseType: !7, size: 32, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !203, file: !85, line: 299, baseType: !7, size: 32, offset: 160)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !203, file: !85, line: 300, baseType: !195, size: 32, offset: 192)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !203, file: !85, line: 301, baseType: !195, size: 32, offset: 224)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !203, file: !85, line: 302, baseType: !195, size: 32, offset: 256)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !203, file: !85, line: 303, baseType: !7, size: 32, offset: 288)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !203, file: !85, line: 304, baseType: !7, size: 32, offset: 320)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !203, file: !85, line: 305, baseType: !195, size: 32, offset: 352)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !203, file: !85, line: 306, baseType: !195, size: 32, offset: 384)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !203, file: !85, line: 307, baseType: !195, size: 32, offset: 416)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !203, file: !85, line: 309, baseType: !7, size: 32, offset: 448)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !203, file: !85, line: 310, baseType: !195, size: 32, offset: 480)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !203, file: !85, line: 311, baseType: !7, size: 32, offset: 512)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !203, file: !85, line: 312, baseType: !7, size: 32, offset: 544)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !203, file: !85, line: 315, baseType: !7, size: 32, offset: 576)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !203, file: !85, line: 316, baseType: !46, size: 64, offset: 640)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !203, file: !85, line: 317, baseType: !7, size: 32, offset: 704)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !203, file: !85, line: 318, baseType: !46, size: 64, offset: 768)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !203, file: !85, line: 321, baseType: !195, size: 32, offset: 832)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !203, file: !85, line: 322, baseType: !195, size: 32, offset: 864)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !203, file: !85, line: 323, baseType: !195, size: 32, offset: 896)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !203, file: !85, line: 324, baseType: !231, size: 64, offset: 960)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !85, line: 174, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !85, line: 167, size: 256, elements: !234)
!234 = !{!235, !236, !237, !238, !239, !240}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !233, file: !85, line: 169, baseType: !7, size: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !233, file: !85, line: 169, baseType: !7, size: 32, offset: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !233, file: !85, line: 170, baseType: !7, size: 32, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !233, file: !85, line: 171, baseType: !7, size: 32, offset: 96)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !233, file: !85, line: 172, baseType: !195, size: 32, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !233, file: !85, line: 173, baseType: !241, size: 64, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !203, file: !85, line: 325, baseType: !7, size: 32, offset: 1024)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !203, file: !85, line: 326, baseType: !46, size: 64, offset: 1088)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !101, file: !85, line: 330, baseType: !7, size: 32, offset: 5056)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !101, file: !85, line: 331, baseType: !7, size: 32, offset: 5088)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !101, file: !85, line: 332, baseType: !7, size: 32, offset: 5120)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !101, file: !85, line: 334, baseType: !7, size: 32, offset: 5152)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !101, file: !85, line: 335, baseType: !7, size: 32, offset: 5184)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !101, file: !85, line: 336, baseType: !19, size: 32, offset: 5216)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !101, file: !85, line: 337, baseType: !19, size: 32, offset: 5248)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !101, file: !85, line: 338, baseType: !19, size: 32, offset: 5280)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !101, file: !85, line: 339, baseType: !19, size: 32, offset: 5312)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !101, file: !85, line: 340, baseType: !7, size: 32, offset: 5344)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !101, file: !85, line: 344, baseType: !7, size: 32, offset: 5376)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !101, file: !85, line: 356, baseType: !7, size: 32, offset: 5408)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !101, file: !85, line: 364, baseType: !7, size: 32, offset: 5440)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !101, file: !85, line: 367, baseType: !7, size: 32, offset: 5472)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !101, file: !85, line: 368, baseType: !7, size: 32, offset: 5504)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !101, file: !85, line: 369, baseType: !7, size: 32, offset: 5536)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !101, file: !85, line: 375, baseType: !261, size: 64, offset: 5568)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{null, !6}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "img", scope: !86, file: !85, line: 543, baseType: !265, size: 448, offset: 320)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_image_t", file: !85, line: 511, baseType: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !85, line: 505, size: 448, elements: !267)
!267 = !{!268, !269, !270, !272}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !266, file: !85, line: 507, baseType: !7, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !266, file: !85, line: 508, baseType: !7, size: 32, offset: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !266, file: !85, line: 509, baseType: !271, size: 128, offset: 64)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128, elements: !34)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !266, file: !85, line: 510, baseType: !273, size: 256, offset: 192)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 256, elements: !34)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "hrd_timing", scope: !86, file: !85, line: 545, baseType: !276, size: 256, offset: 768)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_hrd_t", file: !85, line: 503, baseType: !277)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !85, line: 496, size: 256, elements: !278)
!278 = !{!279, !281, !282, !283}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_initial_arrival_time", scope: !277, file: !85, line: 498, baseType: !280, size: 64)
!280 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_final_arrival_time", scope: !277, file: !85, line: 499, baseType: !280, size: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_time", scope: !277, file: !85, line: 500, baseType: !280, size: 64, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_time", scope: !277, file: !85, line: 502, baseType: !280, size: 64, offset: 192)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !86, file: !85, line: 548, baseType: !6, size: 64, offset: 1024)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "read_frame", scope: !40, file: !39, line: 59, baseType: !286, size: 64, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{!7, !83, !49, !7}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "release_frame", scope: !40, file: !39, line: 60, baseType: !290, size: 64, offset: 256)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DISubroutineType(types: !292)
!292 = !{!7, !83, !49}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "picture_clean", scope: !40, file: !39, line: 61, baseType: !294, size: 64, offset: 320)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DISubroutineType(types: !296)
!296 = !{null, !83}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "close_file", scope: !40, file: !39, line: 62, baseType: !76, size: 64, offset: 384)
!298 = !{i32 7, !"Dwarf Version", i32 4}
!299 = !{i32 2, !"Debug Info Version", i32 3}
!300 = !{i32 1, !"wchar_size", i32 4}
!301 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!302 = distinct !DISubprogram(name: "open_file", scope: !3, file: !3, line: 40, type: !44, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!303 = !DILocalVariable(name: "psz_filename", arg: 1, scope: !302, file: !3, line: 40, type: !46)
!304 = !DILocation(line: 40, column: 29, scope: !302)
!305 = !DILocalVariable(name: "p_handle", arg: 2, scope: !302, file: !3, line: 40, type: !48)
!306 = !DILocation(line: 40, column: 50, scope: !302)
!307 = !DILocalVariable(name: "info", arg: 3, scope: !302, file: !3, line: 40, type: !51)
!308 = !DILocation(line: 40, column: 74, scope: !302)
!309 = !DILocalVariable(name: "opt", arg: 4, scope: !302, file: !3, line: 40, type: !67)
!310 = !DILocation(line: 40, column: 97, scope: !302)
!311 = !DILocalVariable(name: "h", scope: !302, file: !3, line: 42, type: !312)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "y4m_hnd_t", file: !3, line: 33, baseType: !314)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 26, size: 256, elements: !315)
!315 = !{!316, !372, !373, !374, !375, !376, !377}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "fh", scope: !314, file: !3, line: 28, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !319, line: 7, baseType: !320)
!319 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !321, line: 49, size: 1728, elements: !322)
!321 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!322 = !{!323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !338, !340, !341, !342, !344, !345, !347, !351, !354, !356, !359, !362, !363, !364, !367, !368}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !320, file: !321, line: 51, baseType: !7, size: 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !320, file: !321, line: 54, baseType: !46, size: 64, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !320, file: !321, line: 55, baseType: !46, size: 64, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !320, file: !321, line: 56, baseType: !46, size: 64, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !320, file: !321, line: 57, baseType: !46, size: 64, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !320, file: !321, line: 58, baseType: !46, size: 64, offset: 320)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !320, file: !321, line: 59, baseType: !46, size: 64, offset: 384)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !320, file: !321, line: 60, baseType: !46, size: 64, offset: 448)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !320, file: !321, line: 61, baseType: !46, size: 64, offset: 512)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !320, file: !321, line: 64, baseType: !46, size: 64, offset: 576)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !320, file: !321, line: 65, baseType: !46, size: 64, offset: 640)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !320, file: !321, line: 66, baseType: !46, size: 64, offset: 704)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !320, file: !321, line: 68, baseType: !336, size: 64, offset: 768)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !321, line: 36, flags: DIFlagFwdDecl)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !320, file: !321, line: 70, baseType: !339, size: 64, offset: 832)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !320, file: !321, line: 72, baseType: !7, size: 32, offset: 896)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !320, file: !321, line: 73, baseType: !7, size: 32, offset: 928)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !320, file: !321, line: 74, baseType: !343, size: 64, offset: 960)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !11, line: 152, baseType: !96)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !320, file: !321, line: 77, baseType: !26, size: 16, offset: 1024)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !320, file: !321, line: 78, baseType: !346, size: 8, offset: 1040)
!346 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !320, file: !321, line: 79, baseType: !348, size: 8, offset: 1048)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 8, elements: !349)
!349 = !{!350}
!350 = !DISubrange(count: 1)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !320, file: !321, line: 81, baseType: !352, size: 64, offset: 1088)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !321, line: 43, baseType: null)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !320, file: !321, line: 89, baseType: !355, size: 64, offset: 1152)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !11, line: 153, baseType: !96)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !320, file: !321, line: 91, baseType: !357, size: 64, offset: 1216)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !321, line: 37, flags: DIFlagFwdDecl)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !320, file: !321, line: 92, baseType: !360, size: 64, offset: 1280)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !321, line: 38, flags: DIFlagFwdDecl)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !320, file: !321, line: 93, baseType: !339, size: 64, offset: 1344)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !320, file: !321, line: 94, baseType: !6, size: 64, offset: 1408)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !320, file: !321, line: 95, baseType: !365, size: 64, offset: 1472)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !366, line: 46, baseType: !12)
!366 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !320, file: !321, line: 96, baseType: !7, size: 32, offset: 1536)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !320, file: !321, line: 98, baseType: !369, size: 160, offset: 1568)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 160, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 20)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !314, file: !3, line: 29, baseType: !7, size: 32, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !314, file: !3, line: 29, baseType: !7, size: 32, offset: 96)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "next_frame", scope: !314, file: !3, line: 30, baseType: !7, size: 32, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "seq_header_len", scope: !314, file: !3, line: 31, baseType: !7, size: 32, offset: 160)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "frame_header_len", scope: !314, file: !3, line: 31, baseType: !7, size: 32, offset: 192)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !314, file: !3, line: 32, baseType: !7, size: 32, offset: 224)
!378 = !DILocation(line: 42, column: 16, scope: !302)
!379 = !DILocation(line: 42, column: 20, scope: !302)
!380 = !DILocalVariable(name: "i", scope: !302, file: !3, line: 43, type: !7)
!381 = !DILocation(line: 43, column: 9, scope: !302)
!382 = !DILocalVariable(name: "n", scope: !302, file: !3, line: 44, type: !19)
!383 = !DILocation(line: 44, column: 14, scope: !302)
!384 = !DILocalVariable(name: "d", scope: !302, file: !3, line: 44, type: !19)
!385 = !DILocation(line: 44, column: 17, scope: !302)
!386 = !DILocalVariable(name: "header", scope: !302, file: !3, line: 45, type: !387)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 720, elements: !388)
!388 = !{!389}
!389 = !DISubrange(count: 90)
!390 = !DILocation(line: 45, column: 10, scope: !302)
!391 = !DILocalVariable(name: "tokend", scope: !302, file: !3, line: 46, type: !46)
!392 = !DILocation(line: 46, column: 11, scope: !302)
!393 = !DILocalVariable(name: "header_end", scope: !302, file: !3, line: 46, type: !46)
!394 = !DILocation(line: 46, column: 20, scope: !302)
!395 = !DILocalVariable(name: "colorspace", scope: !302, file: !3, line: 47, type: !7)
!396 = !DILocation(line: 47, column: 9, scope: !302)
!397 = !DILocalVariable(name: "alt_colorspace", scope: !302, file: !3, line: 48, type: !7)
!398 = !DILocation(line: 48, column: 9, scope: !302)
!399 = !DILocation(line: 49, column: 10, scope: !400)
!400 = distinct !DILexicalBlock(scope: !302, file: !3, line: 49, column: 9)
!401 = !DILocation(line: 49, column: 9, scope: !302)
!402 = !DILocation(line: 50, column: 9, scope: !400)
!403 = !DILocation(line: 52, column: 5, scope: !302)
!404 = !DILocation(line: 52, column: 8, scope: !302)
!405 = !DILocation(line: 52, column: 19, scope: !302)
!406 = !DILocation(line: 53, column: 5, scope: !302)
!407 = !DILocation(line: 53, column: 11, scope: !302)
!408 = !DILocation(line: 53, column: 15, scope: !302)
!409 = !DILocation(line: 55, column: 18, scope: !410)
!410 = distinct !DILexicalBlock(scope: !302, file: !3, line: 55, column: 9)
!411 = !DILocation(line: 55, column: 10, scope: !410)
!412 = !DILocation(line: 55, column: 9, scope: !302)
!413 = !DILocation(line: 56, column: 17, scope: !410)
!414 = !DILocation(line: 56, column: 9, scope: !410)
!415 = !DILocation(line: 56, column: 12, scope: !410)
!416 = !DILocation(line: 56, column: 15, scope: !410)
!417 = !DILocation(line: 58, column: 23, scope: !410)
!418 = !DILocation(line: 58, column: 17, scope: !410)
!419 = !DILocation(line: 58, column: 9, scope: !410)
!420 = !DILocation(line: 58, column: 12, scope: !410)
!421 = !DILocation(line: 58, column: 15, scope: !410)
!422 = !DILocation(line: 59, column: 9, scope: !423)
!423 = distinct !DILexicalBlock(scope: !302, file: !3, line: 59, column: 9)
!424 = !DILocation(line: 59, column: 12, scope: !423)
!425 = !DILocation(line: 59, column: 15, scope: !423)
!426 = !DILocation(line: 59, column: 9, scope: !302)
!427 = !DILocation(line: 60, column: 9, scope: !423)
!428 = !DILocation(line: 62, column: 5, scope: !302)
!429 = !DILocation(line: 62, column: 8, scope: !302)
!430 = !DILocation(line: 62, column: 25, scope: !302)
!431 = !DILocation(line: 65, column: 12, scope: !432)
!432 = distinct !DILexicalBlock(scope: !302, file: !3, line: 65, column: 5)
!433 = !DILocation(line: 65, column: 10, scope: !432)
!434 = !DILocation(line: 65, column: 17, scope: !435)
!435 = distinct !DILexicalBlock(scope: !432, file: !3, line: 65, column: 5)
!436 = !DILocation(line: 65, column: 19, scope: !435)
!437 = !DILocation(line: 65, column: 5, scope: !432)
!438 = !DILocation(line: 67, column: 28, scope: !439)
!439 = distinct !DILexicalBlock(scope: !435, file: !3, line: 66, column: 5)
!440 = !DILocation(line: 67, column: 31, scope: !439)
!441 = !DILocation(line: 67, column: 21, scope: !439)
!442 = !DILocation(line: 67, column: 16, scope: !439)
!443 = !DILocation(line: 67, column: 9, scope: !439)
