; ModuleID = 'x264_src/common/mc.c'
source_filename = "x264_src/common/mc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.x264_weight_t = type { [8 x i16], [8 x i16], i32, i32, i32, void (i8*, i32, i8*, i32, %struct.x264_weight_t*, i32)**, [8 x i8] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "weight_none", scope: !2, file: !3, line: 171, type: !69, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !19, globals: !25, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "x264_src/common/mc.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 30, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "x264_src/common/pixel.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!9 = !DIEnumerator(name: "PIXEL_16x16", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "PIXEL_16x8", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "PIXEL_8x16", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "PIXEL_8x8", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "PIXEL_8x4", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "PIXEL_4x8", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "PIXEL_4x4", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "PIXEL_4x2", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "PIXEL_2x4", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "PIXEL_2x2", value: 9, isUnsigned: true)
!19 = !{!20}
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !21, line: 27, baseType: !22)
!21 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !23, line: 44, baseType: !24)
!23 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!24 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!25 = !{!0, !26, !36, !38}
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "hpel_ref0", scope: !2, file: !3, line: 206, type: !28, isLocal: true, isDefinition: true)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 128, elements: !34)
!29 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !31, line: 24, baseType: !32)
!31 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !23, line: 38, baseType: !33)
!33 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!34 = !{!35}
!35 = !DISubrange(count: 16)
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(name: "hpel_ref1", scope: !2, file: !3, line: 207, type: !28, isLocal: true, isDefinition: true)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "x264_mc_weight_wtab", scope: !2, file: !3, line: 162, type: !40, isLocal: true, isDefinition: true)
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 384, elements: !67)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "weight_fn_t", file: !42, line: 25, baseType: !43)
!42 = !DIFile(filename: "x264_src/common/mc.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{null, !46, !47, !46, !47, !48, !47}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!47 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_weight_t", file: !42, line: 26, size: 512, elements: !51)
!51 = !{!52, !59, !60, !63, !64, !65}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "cachea", scope: !50, file: !42, line: 30, baseType: !53, size: 128, align: 128)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 128, elements: !57)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !21, line: 25, baseType: !55)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !23, line: 39, baseType: !56)
!56 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!57 = !{!58}
!58 = !DISubrange(count: 8)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "cacheb", scope: !50, file: !42, line: 31, baseType: !53, size: 128, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "i_denom", scope: !50, file: !42, line: 32, baseType: !61, size: 32, offset: 256)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !21, line: 26, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !23, line: 41, baseType: !47)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "i_scale", scope: !50, file: !42, line: 33, baseType: !61, size: 32, offset: 288)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset", scope: !50, file: !42, line: 34, baseType: !61, size: 32, offset: 320)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "weightfn", scope: !50, file: !42, line: 35, baseType: !66, size: 64, offset: 384)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!67 = !{!68}
!68 = !DISubrange(count: 6)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 1536, elements: !72)
!70 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !71)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_weight_t", file: !42, line: 36, baseType: !50, align: 128)
!72 = !{!73}
!73 = !DISubrange(count: 3)
!74 = !{i32 7, !"Dwarf Version", i32 4}
!75 = !{i32 2, !"Debug Info Version", i32 3}
!76 = !{i32 1, !"wchar_size", i32 4}
!77 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!78 = distinct !DISubprogram(name: "x264_plane_copy_c", scope: !3, file: !3, line: 299, type: !79, scopeLine: 301, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !81)
!79 = !DISubroutineType(types: !80)
!80 = !{null, !46, !47, !46, !47, !47, !47}
!81 = !{}
!82 = !DILocalVariable(name: "dst", arg: 1, scope: !78, file: !3, line: 299, type: !46)
!83 = !DILocation(line: 299, column: 34, scope: !78)
!84 = !DILocalVariable(name: "i_dst", arg: 2, scope: !78, file: !3, line: 299, type: !47)
!85 = !DILocation(line: 299, column: 43, scope: !78)
!86 = !DILocalVariable(name: "src", arg: 3, scope: !78, file: !3, line: 300, type: !46)
!87 = !DILocation(line: 300, column: 34, scope: !78)
!88 = !DILocalVariable(name: "i_src", arg: 4, scope: !78, file: !3, line: 300, type: !47)
!89 = !DILocation(line: 300, column: 43, scope: !78)
!90 = !DILocalVariable(name: "w", arg: 5, scope: !78, file: !3, line: 300, type: !47)
!91 = !DILocation(line: 300, column: 54, scope: !78)
!92 = !DILocalVariable(name: "h", arg: 6, scope: !78, file: !3, line: 300, type: !47)
!93 = !DILocation(line: 300, column: 61, scope: !78)
!94 = !DILocation(line: 302, column: 5, scope: !78)
!95 = !DILocation(line: 302, column: 13, scope: !78)
!96 = !DILocation(line: 304, column: 17, scope: !97)
!97 = distinct !DILexicalBlock(scope: !78, file: !3, line: 303, column: 5)
!98 = !DILocation(line: 304, column: 22, scope: !97)
!99 = !DILocation(line: 304, column: 27, scope: !97)
!100 = !DILocation(line: 304, column: 9, scope: !97)
!101 = !DILocation(line: 305, column: 16, scope: !97)
!102 = !DILocation(line: 305, column: 13, scope: !97)
!103 = !DILocation(line: 306, column: 16, scope: !97)
!104 = !DILocation(line: 306, column: 13, scope: !97)
!105 = distinct !{!105, !94, !106}
!106 = !DILocation(line: 307, column: 5, scope: !78)
!107 = !DILocation(line: 308, column: 1, scope: !78)
!108 = distinct !DISubprogram(name: "x264_frame_init_lowres", scope: !3, file: !3, line: 356, type: !109, scopeLine: 357, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !81)
!109 = !DISubroutineType(types: !110)
!110 = !{null, !111, !569}
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_t", file: !113, line: 46, baseType: !114)
!113 = !DIFile(filename: "x264_src/x264.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_t", file: !115, line: 381, size: 266752, elements: !116)
!115 = !DIFile(filename: "x264_src/common/common.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!116 = !{!117, !287, !291, !292, !293, !294, !295, !296, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !430, !432, !457, !459, !460, !461, !467, !471, !472, !473, !480, !484, !485, !486, !491, !494, !495, !547, !564, !725, !726, !727, !728, !732, !733, !734, !735, !736, !737, !738, !753, !947, !951, !1012, !1015, !1017, !1019, !1020, !1023, !1028, !1037, !1038, !1046, !1048, !1053, !1128, !1211, !1255, !1277, !1326, !1355}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !114, file: !115, line: 384, baseType: !118, size: 5632)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !113, line: 376, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !113, line: 176, size: 5632, elements: !120)
!120 = !{!121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !164, !166, !167, !168, !169, !173, !174, !188, !189, !190, !191, !192, !223, !265, !266, !267, !268, !269, !270, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !119, file: !113, line: 179, baseType: !7, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !119, file: !113, line: 180, baseType: !47, size: 32, offset: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !119, file: !113, line: 181, baseType: !47, size: 32, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !119, file: !113, line: 182, baseType: !47, size: 32, offset: 96)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !119, file: !113, line: 183, baseType: !47, size: 32, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !119, file: !113, line: 186, baseType: !47, size: 32, offset: 160)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !119, file: !113, line: 187, baseType: !47, size: 32, offset: 192)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !119, file: !113, line: 188, baseType: !47, size: 32, offset: 224)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !119, file: !113, line: 189, baseType: !47, size: 32, offset: 256)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !119, file: !113, line: 190, baseType: !47, size: 32, offset: 288)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !119, file: !113, line: 198, baseType: !47, size: 32, offset: 320)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !119, file: !113, line: 215, baseType: !133, size: 288, offset: 352)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !119, file: !113, line: 200, size: 288, elements: !134)
!134 = !{!135, !136, !137, !138, !139, !140, !141, !142, !143}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !133, file: !113, line: 203, baseType: !47, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !133, file: !113, line: 204, baseType: !47, size: 32, offset: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !133, file: !113, line: 206, baseType: !47, size: 32, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !133, file: !113, line: 209, baseType: !47, size: 32, offset: 96)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !133, file: !113, line: 210, baseType: !47, size: 32, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !133, file: !113, line: 211, baseType: !47, size: 32, offset: 160)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !133, file: !113, line: 212, baseType: !47, size: 32, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !133, file: !113, line: 213, baseType: !47, size: 32, offset: 224)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !133, file: !113, line: 214, baseType: !47, size: 32, offset: 256)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !119, file: !113, line: 218, baseType: !47, size: 32, offset: 640)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !119, file: !113, line: 219, baseType: !47, size: 32, offset: 672)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !119, file: !113, line: 220, baseType: !47, size: 32, offset: 704)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !119, file: !113, line: 221, baseType: !47, size: 32, offset: 736)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !119, file: !113, line: 222, baseType: !47, size: 32, offset: 768)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !119, file: !113, line: 224, baseType: !47, size: 32, offset: 800)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !119, file: !113, line: 225, baseType: !47, size: 32, offset: 832)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !119, file: !113, line: 226, baseType: !47, size: 32, offset: 864)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !119, file: !113, line: 227, baseType: !47, size: 32, offset: 896)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !119, file: !113, line: 229, baseType: !47, size: 32, offset: 928)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !119, file: !113, line: 230, baseType: !47, size: 32, offset: 960)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !119, file: !113, line: 231, baseType: !47, size: 32, offset: 992)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !119, file: !113, line: 233, baseType: !47, size: 32, offset: 1024)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !119, file: !113, line: 234, baseType: !47, size: 32, offset: 1056)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !119, file: !113, line: 236, baseType: !47, size: 32, offset: 1088)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !119, file: !113, line: 237, baseType: !47, size: 32, offset: 1120)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !119, file: !113, line: 239, baseType: !47, size: 32, offset: 1152)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !119, file: !113, line: 240, baseType: !162, size: 64, offset: 1216)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !119, file: !113, line: 241, baseType: !165, size: 128, offset: 1280)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 128, elements: !34)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !119, file: !113, line: 242, baseType: !165, size: 128, offset: 1408)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !119, file: !113, line: 243, baseType: !165, size: 128, offset: 1536)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !119, file: !113, line: 244, baseType: !165, size: 128, offset: 1664)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !119, file: !113, line: 245, baseType: !170, size: 512, offset: 1792)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 512, elements: !171)
!171 = !{!172}
!172 = !DISubrange(count: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !119, file: !113, line: 246, baseType: !170, size: 512, offset: 2304)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !119, file: !113, line: 249, baseType: !175, size: 64, offset: 2816)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{null, !178, !47, !179, !181}
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !163)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 308, size: 192, elements: !183)
!183 = !{!184, !185, !186, !187}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !182, file: !3, line: 308, baseType: !7, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !182, file: !3, line: 308, baseType: !7, size: 32, offset: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !182, file: !3, line: 308, baseType: !178, size: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !182, file: !3, line: 308, baseType: !178, size: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !119, file: !113, line: 250, baseType: !178, size: 64, offset: 2880)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !119, file: !113, line: 251, baseType: !47, size: 32, offset: 2944)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !119, file: !113, line: 252, baseType: !47, size: 32, offset: 2976)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !119, file: !113, line: 253, baseType: !162, size: 64, offset: 3008)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !119, file: !113, line: 287, baseType: !193, size: 800, offset: 3072)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !119, file: !113, line: 256, size: 800, elements: !194)
!194 = !{!195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !215, !216, !217, !221, !222}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !193, file: !113, line: 258, baseType: !7, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !193, file: !113, line: 259, baseType: !7, size: 32, offset: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !193, file: !113, line: 261, baseType: !47, size: 32, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !193, file: !113, line: 262, baseType: !47, size: 32, offset: 96)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !193, file: !113, line: 263, baseType: !47, size: 32, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !193, file: !113, line: 264, baseType: !47, size: 32, offset: 160)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !193, file: !113, line: 265, baseType: !47, size: 32, offset: 192)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !193, file: !113, line: 267, baseType: !47, size: 32, offset: 224)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !193, file: !113, line: 268, baseType: !47, size: 32, offset: 256)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !193, file: !113, line: 269, baseType: !47, size: 32, offset: 288)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !193, file: !113, line: 270, baseType: !47, size: 32, offset: 320)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !193, file: !113, line: 271, baseType: !47, size: 32, offset: 352)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !193, file: !113, line: 272, baseType: !47, size: 32, offset: 384)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !193, file: !113, line: 273, baseType: !47, size: 32, offset: 416)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !193, file: !113, line: 274, baseType: !47, size: 32, offset: 448)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !193, file: !113, line: 275, baseType: !47, size: 32, offset: 480)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !193, file: !113, line: 276, baseType: !47, size: 32, offset: 512)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !193, file: !113, line: 277, baseType: !47, size: 32, offset: 544)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !193, file: !113, line: 278, baseType: !214, size: 32, offset: 576)
!214 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !193, file: !113, line: 279, baseType: !214, size: 32, offset: 608)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !193, file: !113, line: 280, baseType: !47, size: 32, offset: 640)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !193, file: !113, line: 283, baseType: !218, size: 64, offset: 672)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 64, elements: !219)
!219 = !{!220}
!220 = !DISubrange(count: 2)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !193, file: !113, line: 285, baseType: !47, size: 32, offset: 736)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !193, file: !113, line: 286, baseType: !47, size: 32, offset: 768)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !119, file: !113, line: 327, baseType: !224, size: 1152, offset: 3904)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !119, file: !113, line: 290, size: 1152, elements: !225)
!225 = !{!226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !263, !264}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !224, file: !113, line: 292, baseType: !47, size: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !224, file: !113, line: 294, baseType: !47, size: 32, offset: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !224, file: !113, line: 295, baseType: !47, size: 32, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !224, file: !113, line: 296, baseType: !47, size: 32, offset: 96)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !224, file: !113, line: 297, baseType: !47, size: 32, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !224, file: !113, line: 299, baseType: !47, size: 32, offset: 160)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !224, file: !113, line: 300, baseType: !214, size: 32, offset: 192)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !224, file: !113, line: 301, baseType: !214, size: 32, offset: 224)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !224, file: !113, line: 302, baseType: !214, size: 32, offset: 256)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !224, file: !113, line: 303, baseType: !47, size: 32, offset: 288)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !224, file: !113, line: 304, baseType: !47, size: 32, offset: 320)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !224, file: !113, line: 305, baseType: !214, size: 32, offset: 352)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !224, file: !113, line: 306, baseType: !214, size: 32, offset: 384)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !224, file: !113, line: 307, baseType: !214, size: 32, offset: 416)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !224, file: !113, line: 309, baseType: !47, size: 32, offset: 448)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !224, file: !113, line: 310, baseType: !214, size: 32, offset: 480)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !224, file: !113, line: 311, baseType: !47, size: 32, offset: 512)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !224, file: !113, line: 312, baseType: !47, size: 32, offset: 544)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !224, file: !113, line: 315, baseType: !47, size: 32, offset: 576)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !224, file: !113, line: 316, baseType: !162, size: 64, offset: 640)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !224, file: !113, line: 317, baseType: !47, size: 32, offset: 704)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !224, file: !113, line: 318, baseType: !162, size: 64, offset: 768)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !224, file: !113, line: 321, baseType: !214, size: 32, offset: 832)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !224, file: !113, line: 322, baseType: !214, size: 32, offset: 864)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !224, file: !113, line: 323, baseType: !214, size: 32, offset: 896)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !224, file: !113, line: 324, baseType: !252, size: 64, offset: 960)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !113, line: 174, baseType: !254)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !113, line: 167, size: 256, elements: !255)
!255 = !{!256, !257, !258, !259, !260, !261}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !254, file: !113, line: 169, baseType: !47, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !254, file: !113, line: 169, baseType: !47, size: 32, offset: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !254, file: !113, line: 170, baseType: !47, size: 32, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !254, file: !113, line: 171, baseType: !47, size: 32, offset: 96)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !254, file: !113, line: 172, baseType: !214, size: 32, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !254, file: !113, line: 173, baseType: !262, size: 64, offset: 192)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !224, file: !113, line: 325, baseType: !47, size: 32, offset: 1024)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !224, file: !113, line: 326, baseType: !162, size: 64, offset: 1088)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !119, file: !113, line: 330, baseType: !47, size: 32, offset: 5056)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !119, file: !113, line: 331, baseType: !47, size: 32, offset: 5088)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !119, file: !113, line: 332, baseType: !47, size: 32, offset: 5120)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !119, file: !113, line: 334, baseType: !47, size: 32, offset: 5152)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !119, file: !113, line: 335, baseType: !47, size: 32, offset: 5184)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !119, file: !113, line: 336, baseType: !271, size: 32, offset: 5216)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !31, line: 26, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !23, line: 42, baseType: !7)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !119, file: !113, line: 337, baseType: !271, size: 32, offset: 5248)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !119, file: !113, line: 338, baseType: !271, size: 32, offset: 5280)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !119, file: !113, line: 339, baseType: !271, size: 32, offset: 5312)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !119, file: !113, line: 340, baseType: !47, size: 32, offset: 5344)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !119, file: !113, line: 344, baseType: !47, size: 32, offset: 5376)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !119, file: !113, line: 356, baseType: !47, size: 32, offset: 5408)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !119, file: !113, line: 364, baseType: !47, size: 32, offset: 5440)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !119, file: !113, line: 367, baseType: !47, size: 32, offset: 5472)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !119, file: !113, line: 368, baseType: !47, size: 32, offset: 5504)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !119, file: !113, line: 369, baseType: !47, size: 32, offset: 5536)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !119, file: !113, line: 375, baseType: !284, size: 64, offset: 5568)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{null, !178}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !114, file: !115, line: 386, baseType: !288, size: 8256, offset: 5632)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 8256, elements: !289)
!289 = !{!290}
!290 = !DISubrange(count: 129)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "thread_handle", scope: !114, file: !115, line: 387, baseType: !47, size: 32, offset: 13888)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "b_thread_active", scope: !114, file: !115, line: 388, baseType: !47, size: 32, offset: 13920)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_phase", scope: !114, file: !115, line: 389, baseType: !47, size: 32, offset: 13952)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_start", scope: !114, file: !115, line: 390, baseType: !47, size: 32, offset: 13984)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_end", scope: !114, file: !115, line: 391, baseType: !47, size: 32, offset: 14016)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !114, file: !115, line: 402, baseType: !297, size: 576, offset: 14080)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !114, file: !115, line: 394, size: 576, elements: !298)
!298 = !{!299, !300, !301, !310, !311, !312}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal", scope: !297, file: !115, line: 396, baseType: !47, size: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "i_nals_allocated", scope: !297, file: !115, line: 397, baseType: !47, size: 32, offset: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "nal", scope: !297, file: !115, line: 398, baseType: !302, size: 64, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !113, line: 604, baseType: !304)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !113, line: 593, size: 192, elements: !305)
!305 = !{!306, !307, !308, !309}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !304, file: !113, line: 595, baseType: !47, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !304, file: !113, line: 596, baseType: !47, size: 32, offset: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !304, file: !113, line: 599, baseType: !47, size: 32, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !304, file: !113, line: 603, baseType: !46, size: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitstream", scope: !297, file: !115, line: 399, baseType: !47, size: 32, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "p_bitstream", scope: !297, file: !115, line: 400, baseType: !46, size: 64, offset: 192)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !297, file: !115, line: 401, baseType: !313, size: 320, offset: 256)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "bs_t", file: !314, line: 56, baseType: !315)
!314 = !DIFile(filename: "x264_src/common/bs.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bs_s", file: !314, line: 47, size: 320, elements: !316)
!316 = !{!317, !318, !319, !320, !323, !324}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !315, file: !314, line: 49, baseType: !46, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !315, file: !314, line: 50, baseType: !46, size: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !315, file: !314, line: 51, baseType: !46, size: 64, offset: 128)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "cur_bits", scope: !315, file: !314, line: 53, baseType: !321, size: 64, offset: 192)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !322, line: 87, baseType: !24)
!322 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!323 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !315, file: !314, line: 54, baseType: !47, size: 32, offset: 256)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "i_bits_encoded", scope: !315, file: !314, line: 55, baseType: !47, size: 32, offset: 288)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer", scope: !114, file: !115, line: 404, baseType: !46, size: 64, offset: 14656)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer_size", scope: !114, file: !115, line: 405, baseType: !47, size: 32, offset: 14720)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !114, file: !115, line: 410, baseType: !47, size: 32, offset: 14752)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !114, file: !115, line: 411, baseType: !47, size: 32, offset: 14784)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_frames", scope: !114, file: !115, line: 413, baseType: !47, size: 32, offset: 14816)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_type", scope: !114, file: !115, line: 415, baseType: !47, size: 32, offset: 14848)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_ref_idc", scope: !114, file: !115, line: 416, baseType: !47, size: 32, offset: 14880)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields", scope: !114, file: !115, line: 418, baseType: !47, size: 32, offset: 14912)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields_last_frame", scope: !114, file: !115, line: 419, baseType: !47, size: 32, offset: 14944)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_duration", scope: !114, file: !115, line: 420, baseType: !47, size: 32, offset: 14976)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields", scope: !114, file: !115, line: 421, baseType: !47, size: 32, offset: 15008)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !114, file: !115, line: 422, baseType: !47, size: 32, offset: 15040)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !114, file: !115, line: 424, baseType: !47, size: 32, offset: 15072)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !114, file: !115, line: 425, baseType: !47, size: 32, offset: 15104)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "b_queued_intra_refresh", scope: !114, file: !115, line: 427, baseType: !47, size: 32, offset: 15136)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "sps_array", scope: !114, file: !115, line: 430, baseType: !341, size: 10400, offset: 15168)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 10400, elements: !428)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_sps_t", file: !343, line: 154, baseType: !344)
!343 = !DIFile(filename: "x264_src/common/set.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !343, line: 52, size: 10400, elements: !345)
!345 = !{!346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !363, !364, !365, !366, !367, !368, !369, !370, !371, !378, !379, !427}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !344, file: !343, line: 54, baseType: !47, size: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "i_profile_idc", scope: !344, file: !343, line: 56, baseType: !47, size: 32, offset: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !344, file: !343, line: 57, baseType: !47, size: 32, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set0", scope: !344, file: !343, line: 59, baseType: !47, size: 32, offset: 96)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set1", scope: !344, file: !343, line: 60, baseType: !47, size: 32, offset: 128)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set2", scope: !344, file: !343, line: 61, baseType: !47, size: 32, offset: 160)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_frame_num", scope: !344, file: !343, line: 63, baseType: !47, size: 32, offset: 192)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_type", scope: !344, file: !343, line: 65, baseType: !47, size: 32, offset: 224)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_poc_lsb", scope: !344, file: !343, line: 67, baseType: !47, size: 32, offset: 256)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "b_delta_pic_order_always_zero", scope: !344, file: !343, line: 69, baseType: !47, size: 32, offset: 288)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_non_ref_pic", scope: !344, file: !343, line: 70, baseType: !47, size: 32, offset: 320)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_top_to_bottom_field", scope: !344, file: !343, line: 71, baseType: !47, size: 32, offset: 352)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames_in_poc_cycle", scope: !344, file: !343, line: 72, baseType: !47, size: 32, offset: 384)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_ref_frame", scope: !344, file: !343, line: 73, baseType: !360, size: 8192, offset: 416)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 8192, elements: !361)
!361 = !{!362}
!362 = !DISubrange(count: 256)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames", scope: !344, file: !343, line: 75, baseType: !47, size: 32, offset: 8608)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "b_gaps_in_frame_num_value_allowed", scope: !344, file: !343, line: 76, baseType: !47, size: 32, offset: 8640)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_width", scope: !344, file: !343, line: 77, baseType: !47, size: 32, offset: 8672)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_height", scope: !344, file: !343, line: 78, baseType: !47, size: 32, offset: 8704)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_mbs_only", scope: !344, file: !343, line: 79, baseType: !47, size: 32, offset: 8736)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_adaptive_frame_field", scope: !344, file: !343, line: 80, baseType: !47, size: 32, offset: 8768)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct8x8_inference", scope: !344, file: !343, line: 81, baseType: !47, size: 32, offset: 8800)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "b_crop", scope: !344, file: !343, line: 83, baseType: !47, size: 32, offset: 8832)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !344, file: !343, line: 90, baseType: !372, size: 128, offset: 8864)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !344, file: !343, line: 84, size: 128, elements: !373)
!373 = !{!374, !375, !376, !377}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !372, file: !343, line: 86, baseType: !47, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "i_right", scope: !372, file: !343, line: 87, baseType: !47, size: 32, offset: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "i_top", scope: !372, file: !343, line: 88, baseType: !47, size: 32, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "i_bottom", scope: !372, file: !343, line: 89, baseType: !47, size: 32, offset: 96)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "b_vui", scope: !344, file: !343, line: 92, baseType: !47, size: 32, offset: 8992)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !344, file: !343, line: 150, baseType: !380, size: 1344, offset: 9024)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !344, file: !343, line: 93, size: 1344, elements: !381)
!381 = !{!382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !418, !419, !420, !421, !422, !423, !424, !425, !426}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "b_aspect_ratio_info_present", scope: !380, file: !343, line: 95, baseType: !47, size: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !380, file: !343, line: 96, baseType: !47, size: 32, offset: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !380, file: !343, line: 97, baseType: !47, size: 32, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info_present", scope: !380, file: !343, line: 99, baseType: !47, size: 32, offset: 96)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info", scope: !380, file: !343, line: 100, baseType: !47, size: 32, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "b_signal_type_present", scope: !380, file: !343, line: 102, baseType: !47, size: 32, offset: 160)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !380, file: !343, line: 103, baseType: !47, size: 32, offset: 192)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !380, file: !343, line: 104, baseType: !47, size: 32, offset: 224)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "b_color_description_present", scope: !380, file: !343, line: 105, baseType: !47, size: 32, offset: 256)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !380, file: !343, line: 106, baseType: !47, size: 32, offset: 288)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !380, file: !343, line: 107, baseType: !47, size: 32, offset: 320)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !380, file: !343, line: 108, baseType: !47, size: 32, offset: 352)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_loc_info_present", scope: !380, file: !343, line: 110, baseType: !47, size: 32, offset: 384)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_top", scope: !380, file: !343, line: 111, baseType: !47, size: 32, offset: 416)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_bottom", scope: !380, file: !343, line: 112, baseType: !47, size: 32, offset: 448)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "b_timing_info_present", scope: !380, file: !343, line: 114, baseType: !47, size: 32, offset: 480)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_units_in_tick", scope: !380, file: !343, line: 115, baseType: !271, size: 32, offset: 512)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_scale", scope: !380, file: !343, line: 116, baseType: !271, size: 32, offset: 544)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "b_fixed_frame_rate", scope: !380, file: !343, line: 117, baseType: !47, size: 32, offset: 576)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "b_nal_hrd_parameters_present", scope: !380, file: !343, line: 119, baseType: !47, size: 32, offset: 608)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "b_vcl_hrd_parameters_present", scope: !380, file: !343, line: 120, baseType: !47, size: 32, offset: 640)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "hrd", scope: !380, file: !343, line: 137, baseType: !404, size: 384, offset: 672)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !380, file: !343, line: 122, size: 384, elements: !405)
!405 = !{!406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_cnt", scope: !404, file: !343, line: 124, baseType: !47, size: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_scale", scope: !404, file: !343, line: 125, baseType: !47, size: 32, offset: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_scale", scope: !404, file: !343, line: 126, baseType: !47, size: 32, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_value", scope: !404, file: !343, line: 127, baseType: !47, size: 32, offset: 96)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_value", scope: !404, file: !343, line: 128, baseType: !47, size: 32, offset: 128)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_unscaled", scope: !404, file: !343, line: 129, baseType: !47, size: 32, offset: 160)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_unscaled", scope: !404, file: !343, line: 130, baseType: !47, size: 32, offset: 192)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "b_cbr_hrd", scope: !404, file: !343, line: 131, baseType: !47, size: 32, offset: 224)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "i_initial_cpb_removal_delay_length", scope: !404, file: !343, line: 133, baseType: !47, size: 32, offset: 256)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_removal_delay_length", scope: !404, file: !343, line: 134, baseType: !47, size: 32, offset: 288)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay_length", scope: !404, file: !343, line: 135, baseType: !47, size: 32, offset: 320)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_offset_length", scope: !404, file: !343, line: 136, baseType: !47, size: 32, offset: 352)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct_present", scope: !380, file: !343, line: 139, baseType: !47, size: 32, offset: 1056)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "b_bitstream_restriction", scope: !380, file: !343, line: 140, baseType: !47, size: 32, offset: 1088)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "b_motion_vectors_over_pic_boundaries", scope: !380, file: !343, line: 141, baseType: !47, size: 32, offset: 1120)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bytes_per_pic_denom", scope: !380, file: !343, line: 142, baseType: !47, size: 32, offset: 1152)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bits_per_mb_denom", scope: !380, file: !343, line: 143, baseType: !47, size: 32, offset: 1184)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_horizontal", scope: !380, file: !343, line: 144, baseType: !47, size: 32, offset: 1216)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_vertical", scope: !380, file: !343, line: 145, baseType: !47, size: 32, offset: 1248)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_reorder_frames", scope: !380, file: !343, line: 146, baseType: !47, size: 32, offset: 1280)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dec_frame_buffering", scope: !380, file: !343, line: 147, baseType: !47, size: 32, offset: 1312)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "b_qpprime_y_zero_transform_bypass", scope: !344, file: !343, line: 152, baseType: !47, size: 32, offset: 10368)
!428 = !{!429}
!429 = !DISubrange(count: 1)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !114, file: !115, line: 431, baseType: !431, size: 64, offset: 25600)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "pps_array", scope: !114, file: !115, line: 432, baseType: !433, size: 960, offset: 25664)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 960, elements: !428)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pps_t", file: !343, line: 186, baseType: !435)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !343, line: 156, size: 960, elements: !436)
!436 = !{!437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !435, file: !343, line: 158, baseType: !47, size: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !435, file: !343, line: 159, baseType: !47, size: 32, offset: 32)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !435, file: !343, line: 161, baseType: !47, size: 32, offset: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_order", scope: !435, file: !343, line: 163, baseType: !47, size: 32, offset: 96)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_slice_groups", scope: !435, file: !343, line: 164, baseType: !47, size: 32, offset: 128)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_default_active", scope: !435, file: !343, line: 166, baseType: !47, size: 32, offset: 160)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_default_active", scope: !435, file: !343, line: 167, baseType: !47, size: 32, offset: 192)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_pred", scope: !435, file: !343, line: 169, baseType: !47, size: 32, offset: 224)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !435, file: !343, line: 170, baseType: !47, size: 32, offset: 256)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qp", scope: !435, file: !343, line: 172, baseType: !47, size: 32, offset: 288)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qs", scope: !435, file: !343, line: 173, baseType: !47, size: 32, offset: 320)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_index_offset", scope: !435, file: !343, line: 175, baseType: !47, size: 32, offset: 352)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter_control", scope: !435, file: !343, line: 177, baseType: !47, size: 32, offset: 384)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra_pred", scope: !435, file: !343, line: 178, baseType: !47, size: 32, offset: 416)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "b_redundant_pic_cnt", scope: !435, file: !343, line: 179, baseType: !47, size: 32, offset: 448)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8_mode", scope: !435, file: !343, line: 181, baseType: !47, size: 32, offset: 480)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !435, file: !343, line: 183, baseType: !47, size: 32, offset: 512)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !435, file: !343, line: 184, baseType: !455, size: 384, offset: 576)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !456, size: 384, elements: !67)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !114, file: !115, line: 433, baseType: !458, size: 64, offset: 26624)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !114, file: !115, line: 434, baseType: !47, size: 32, offset: 26688)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts_compress_multiplier", scope: !114, file: !115, line: 437, baseType: !47, size: 32, offset: 26720)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_mf", scope: !114, file: !115, line: 440, baseType: !462, size: 256, offset: 26752)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 256, elements: !465)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 512, elements: !34)
!465 = !{!466}
!466 = !DISubrange(count: 4)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_mf", scope: !114, file: !115, line: 441, baseType: !468, size: 128, offset: 27008)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 128, elements: !219)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 2048, elements: !171)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "unquant4_mf", scope: !114, file: !115, line: 443, baseType: !462, size: 256, offset: 27136)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "unquant8_mf", scope: !114, file: !115, line: 444, baseType: !468, size: 128, offset: 27392)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_mf", scope: !114, file: !115, line: 446, baseType: !474, size: 256, offset: 27520)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !475, size: 256, elements: !465)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 256, elements: !34)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !31, line: 25, baseType: !478)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !23, line: 40, baseType: !479)
!479 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_mf", scope: !114, file: !115, line: 447, baseType: !481, size: 128, offset: 27776)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !482, size: 128, elements: !219)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 1024, elements: !171)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_bias", scope: !114, file: !115, line: 448, baseType: !474, size: 256, offset: 27904)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_bias", scope: !114, file: !115, line: 449, baseType: !481, size: 128, offset: 28160)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv", scope: !114, file: !115, line: 454, baseType: !487, size: 5888, offset: 28288)
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !488, size: 5888, elements: !489)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!489 = !{!490}
!490 = !DISubrange(count: 92)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv_fpel", scope: !114, file: !115, line: 455, baseType: !492, size: 23552, offset: 34176)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !488, size: 23552, elements: !493)
!493 = !{!490, !466}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !114, file: !115, line: 457, baseType: !456, size: 64, offset: 57728)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !114, file: !115, line: 460, baseType: !496, size: 53376, offset: 57856)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_slice_header_t", file: !115, line: 364, baseType: !497)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !115, line: 302, size: 53376, elements: !498)
!498 = !{!499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !527, !531, !532, !533, !539, !540, !541, !542, !543, !544, !545, !546}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !497, file: !115, line: 304, baseType: !431, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !497, file: !115, line: 305, baseType: !458, size: 64, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !497, file: !115, line: 307, baseType: !47, size: 32, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "i_first_mb", scope: !497, file: !115, line: 308, baseType: !47, size: 32, offset: 160)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_mb", scope: !497, file: !115, line: 309, baseType: !47, size: 32, offset: 192)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "i_pps_id", scope: !497, file: !115, line: 311, baseType: !47, size: 32, offset: 224)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !497, file: !115, line: 313, baseType: !47, size: 32, offset: 256)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "b_mbaff", scope: !497, file: !115, line: 315, baseType: !47, size: 32, offset: 288)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "b_field_pic", scope: !497, file: !115, line: 316, baseType: !47, size: 32, offset: 320)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "b_bottom_field", scope: !497, file: !115, line: 317, baseType: !47, size: 32, offset: 352)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !497, file: !115, line: 319, baseType: !47, size: 32, offset: 384)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !497, file: !115, line: 321, baseType: !47, size: 32, offset: 416)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc_bottom", scope: !497, file: !115, line: 322, baseType: !47, size: 32, offset: 448)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc", scope: !497, file: !115, line: 324, baseType: !218, size: 64, offset: 480)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "i_redundant_pic_cnt", scope: !497, file: !115, line: 325, baseType: !47, size: 32, offset: 544)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_spatial_mv_pred", scope: !497, file: !115, line: 327, baseType: !47, size: 32, offset: 576)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "b_num_ref_idx_override", scope: !497, file: !115, line: 329, baseType: !47, size: 32, offset: 608)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !497, file: !115, line: 330, baseType: !47, size: 32, offset: 640)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !497, file: !115, line: 331, baseType: !47, size: 32, offset: 672)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l0", scope: !497, file: !115, line: 333, baseType: !47, size: 32, offset: 704)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l1", scope: !497, file: !115, line: 334, baseType: !47, size: 32, offset: 736)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_order", scope: !497, file: !115, line: 339, baseType: !521, size: 2048, offset: 768)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !522, size: 2048, elements: !526)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !497, file: !115, line: 335, size: 64, elements: !523)
!523 = !{!524, !525}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "idc", scope: !522, file: !115, line: 337, baseType: !47, size: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !522, file: !115, line: 338, baseType: !47, size: 32, offset: 32)
!526 = !{!220, !35}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !497, file: !115, line: 342, baseType: !528, size: 49152, offset: 2816)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 49152, elements: !529)
!529 = !{!530, !73}
!530 = !DISubrange(count: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_remove_from_end", scope: !497, file: !115, line: 344, baseType: !47, size: 32, offset: 51968)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_command_count", scope: !497, file: !115, line: 345, baseType: !47, size: 32, offset: 52000)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "mmco", scope: !497, file: !115, line: 350, baseType: !534, size: 1024, offset: 52032)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !535, size: 1024, elements: !34)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !497, file: !115, line: 346, size: 64, elements: !536)
!536 = !{!537, !538}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "i_difference_of_pic_nums", scope: !535, file: !115, line: 348, baseType: !47, size: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !535, file: !115, line: 349, baseType: !47, size: 32, offset: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !497, file: !115, line: 352, baseType: !47, size: 32, offset: 53056)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !497, file: !115, line: 354, baseType: !47, size: 32, offset: 53088)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_delta", scope: !497, file: !115, line: 355, baseType: !47, size: 32, offset: 53120)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "b_sp_for_swidth", scope: !497, file: !115, line: 356, baseType: !47, size: 32, offset: 53152)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "i_qs_delta", scope: !497, file: !115, line: 357, baseType: !47, size: 32, offset: 53184)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "i_disable_deblocking_filter_idc", scope: !497, file: !115, line: 360, baseType: !47, size: 32, offset: 53216)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "i_alpha_c0_offset", scope: !497, file: !115, line: 361, baseType: !47, size: 32, offset: 53248)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "i_beta_offset", scope: !497, file: !115, line: 362, baseType: !47, size: 32, offset: 53280)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !114, file: !115, line: 463, baseType: !548, size: 4096, offset: 111232)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_cabac_t", file: !549, line: 46, baseType: !550)
!549 = !DIFile(filename: "x264_src/common/cabac.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !549, line: 27, size: 4096, elements: !551)
!551 = !{!552, !553, !554, !555, !556, !557, !558, !559, !560}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "i_low", scope: !550, file: !549, line: 30, baseType: !47, size: 32)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "i_range", scope: !550, file: !549, line: 31, baseType: !47, size: 32, offset: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "i_queue", scope: !550, file: !549, line: 34, baseType: !47, size: 32, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "i_bytes_outstanding", scope: !550, file: !549, line: 35, baseType: !47, size: 32, offset: 96)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !550, file: !549, line: 37, baseType: !46, size: 64, offset: 128)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !550, file: !549, line: 38, baseType: !46, size: 64, offset: 192)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !550, file: !549, line: 39, baseType: !46, size: 64, offset: 256)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "f8_bits_encoded", scope: !550, file: !549, line: 42, baseType: !47, size: 32, align: 128, offset: 384)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !550, file: !549, line: 45, baseType: !561, size: 3680, offset: 416)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 3680, elements: !562)
!562 = !{!563}
!563 = !DISubrange(count: 460)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !114, file: !115, line: 494, baseType: !565, size: 2112, offset: 115328)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !114, file: !115, line: 465, size: 2112, elements: !566)
!566 = !{!567, !705, !707, !708, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !721, !722, !723, !724}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !565, file: !115, line: 468, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_frame_t", file: !571, line: 146, baseType: !572)
!571 = !DIFile(filename: "x264_src/common/frame.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_frame", file: !571, line: 31, size: 125056, elements: !573)
!573 = !{!574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !601, !602, !603, !604, !605, !606, !608, !610, !611, !612, !613, !614, !617, !619, !620, !622, !627, !628, !632, !633, !637, !641, !644, !646, !647, !649, !650, !652, !653, !654, !657, !659, !660, !661, !663, !664, !665, !666, !667, !668, !669, !670, !672, !673, !677, !686, !690, !692, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !572, file: !571, line: 34, baseType: !47, size: 32)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !572, file: !571, line: 35, baseType: !47, size: 32, offset: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !572, file: !571, line: 36, baseType: !47, size: 32, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !572, file: !571, line: 37, baseType: !20, size: 64, offset: 128)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts", scope: !572, file: !571, line: 38, baseType: !20, size: 64, offset: 192)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "i_duration", scope: !572, file: !571, line: 39, baseType: !47, size: 32, offset: 256)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_duration", scope: !572, file: !571, line: 40, baseType: !47, size: 32, offset: 288)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !572, file: !571, line: 41, baseType: !47, size: 32, offset: 320)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay", scope: !572, file: !571, line: 42, baseType: !47, size: 32, offset: 352)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !572, file: !571, line: 43, baseType: !584, size: 64, offset: 384)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !572, file: !571, line: 45, baseType: !47, size: 32, offset: 448)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded", scope: !572, file: !571, line: 46, baseType: !47, size: 32, offset: 480)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "i_field_cnt", scope: !572, file: !571, line: 47, baseType: !47, size: 32, offset: 512)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !572, file: !571, line: 48, baseType: !47, size: 32, offset: 544)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "b_kept_as_ref", scope: !572, file: !571, line: 49, baseType: !47, size: 32, offset: 576)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_struct", scope: !572, file: !571, line: 50, baseType: !47, size: 32, offset: 608)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "b_keyframe", scope: !572, file: !571, line: 51, baseType: !47, size: 32, offset: 640)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "b_fdec", scope: !572, file: !571, line: 52, baseType: !30, size: 8, offset: 672)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_minigop_bframe", scope: !572, file: !571, line: 53, baseType: !30, size: 8, offset: 680)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframes", scope: !572, file: !571, line: 54, baseType: !30, size: 8, offset: 688)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_rc", scope: !572, file: !571, line: 55, baseType: !214, size: 32, offset: 704)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_aq", scope: !572, file: !571, line: 56, baseType: !214, size: 32, offset: 736)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_l0ref0", scope: !572, file: !571, line: 57, baseType: !47, size: 32, offset: 768)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !572, file: !571, line: 60, baseType: !47, size: 32, offset: 800)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !572, file: !571, line: 61, baseType: !600, size: 96, offset: 832)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 96, elements: !72)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !572, file: !571, line: 62, baseType: !600, size: 96, offset: 928)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines", scope: !572, file: !571, line: 63, baseType: !600, size: 96, offset: 1024)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride_lowres", scope: !572, file: !571, line: 64, baseType: !47, size: 32, offset: 1120)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "i_width_lowres", scope: !572, file: !571, line: 65, baseType: !47, size: 32, offset: 1152)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_lowres", scope: !572, file: !571, line: 66, baseType: !47, size: 32, offset: 1184)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !572, file: !571, line: 67, baseType: !607, size: 192, offset: 1216)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 192, elements: !72)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "filtered", scope: !572, file: !571, line: 68, baseType: !609, size: 256, offset: 1408)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 256, elements: !465)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !572, file: !571, line: 69, baseType: !609, size: 256, offset: 1664)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "integral", scope: !572, file: !571, line: 70, baseType: !488, size: 64, offset: 1920)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !572, file: !571, line: 74, baseType: !609, size: 256, offset: 1984)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_lowres", scope: !572, file: !571, line: 75, baseType: !609, size: 256, offset: 2240)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !572, file: !571, line: 77, baseType: !615, size: 24576, offset: 2560)
!615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 24576, elements: !616)
!616 = !{!35, !73}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "weighted", scope: !572, file: !571, line: 78, baseType: !618, size: 1024, offset: 27136)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 1024, elements: !34)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "b_duplicate", scope: !572, file: !571, line: 79, baseType: !47, size: 32, offset: 28160)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !572, file: !571, line: 80, baseType: !621, size: 64, offset: 28224)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !572, file: !571, line: 83, baseType: !623, size: 64, offset: 28288)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !21, line: 24, baseType: !625)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !23, line: 37, baseType: !626)
!626 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "mb_partition", scope: !572, file: !571, line: 84, baseType: !46, size: 64, offset: 28352)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !572, file: !571, line: 85, baseType: !629, size: 128, offset: 28416)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !630, size: 128, elements: !219)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 32, elements: !219)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "mv16x16", scope: !572, file: !571, line: 86, baseType: !630, size: 64, offset: 28544)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mvs", scope: !572, file: !571, line: 87, baseType: !634, size: 2176, offset: 28608)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !630, size: 2176, elements: !635)
!635 = !{!220, !636}
!636 = !DISubrange(count: 17)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_costs", scope: !572, file: !571, line: 92, baseType: !638, size: 20736, offset: 30784)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !488, size: 20736, elements: !639)
!639 = !{!640, !640}
!640 = !DISubrange(count: 18)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mv_costs", scope: !572, file: !571, line: 96, baseType: !642, size: 2176, offset: 51520)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !643, size: 2176, elements: !635)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !572, file: !571, line: 97, baseType: !645, size: 128, offset: 53696)
!645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !623, size: 128, elements: !219)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref", scope: !572, file: !571, line: 98, baseType: !218, size: 64, offset: 53824)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc", scope: !572, file: !571, line: 99, baseType: !648, size: 1024, offset: 53888)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 1024, elements: !526)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "inv_ref_poc", scope: !572, file: !571, line: 100, baseType: !631, size: 32, offset: 54912)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est", scope: !572, file: !571, line: 105, baseType: !651, size: 10368, offset: 54944)
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 10368, elements: !639)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est_aq", scope: !572, file: !571, line: 106, baseType: !651, size: 10368, offset: 65312)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "i_satd", scope: !572, file: !571, line: 107, baseType: !47, size: 32, offset: 75680)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_mbs", scope: !572, file: !571, line: 108, baseType: !655, size: 576, offset: 75712)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 576, elements: !656)
!656 = !{!640}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satds", scope: !572, file: !571, line: 109, baseType: !658, size: 20736, offset: 76288)
!658 = !DICompositeType(tag: DW_TAG_array_type, baseType: !643, size: 20736, elements: !639)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satd", scope: !572, file: !571, line: 110, baseType: !643, size: 64, offset: 97024)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_bits", scope: !572, file: !571, line: 111, baseType: !643, size: 64, offset: 97088)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "f_row_qp", scope: !572, file: !571, line: 112, baseType: !662, size: 64, offset: 97152)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset", scope: !572, file: !571, line: 113, baseType: !662, size: 64, offset: 97216)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset_aq", scope: !572, file: !571, line: 114, baseType: !662, size: 64, offset: 97280)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_calculated", scope: !572, file: !571, line: 115, baseType: !47, size: 32, offset: 97344)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !572, file: !571, line: 116, baseType: !488, size: 64, offset: 97408)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "i_propagate_cost", scope: !572, file: !571, line: 117, baseType: !488, size: 64, offset: 97472)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "i_inv_qscale_factor", scope: !572, file: !571, line: 118, baseType: !488, size: 64, offset: 97536)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "b_scenecut", scope: !572, file: !571, line: 119, baseType: !47, size: 32, offset: 97600)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "f_weighted_cost_delta", scope: !572, file: !571, line: 120, baseType: !671, size: 576, offset: 97632)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 576, elements: !656)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_sum", scope: !572, file: !571, line: 121, baseType: !271, size: 32, offset: 98208)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_ssd", scope: !572, file: !571, line: 122, baseType: !674, size: 64, offset: 98240)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !31, line: 27, baseType: !675)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !23, line: 45, baseType: !676)
!676 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "hrd_timing", scope: !572, file: !571, line: 125, baseType: !678, size: 256, offset: 98304)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_hrd_t", file: !113, line: 503, baseType: !679)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !113, line: 496, size: 256, elements: !680)
!680 = !{!681, !683, !684, !685}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_initial_arrival_time", scope: !679, file: !113, line: 498, baseType: !682, size: 64)
!682 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_final_arrival_time", scope: !679, file: !113, line: 499, baseType: !682, size: 64, offset: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_time", scope: !679, file: !113, line: 500, baseType: !682, size: 64, offset: 128)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_time", scope: !679, file: !113, line: 502, baseType: !682, size: 64, offset: 192)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_type", scope: !572, file: !571, line: 128, baseType: !687, size: 2008, offset: 98560)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 2008, elements: !688)
!688 = !{!689}
!689 = !DISubrange(count: 251)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_satd", scope: !572, file: !571, line: 129, baseType: !691, size: 8032, offset: 100576)
!691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 8032, elements: !688)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "f_planned_cpb_duration", scope: !572, file: !571, line: 130, baseType: !693, size: 16064, offset: 108608)
!693 = !DICompositeType(tag: DW_TAG_array_type, baseType: !682, size: 16064, elements: !688)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !572, file: !571, line: 131, baseType: !47, size: 32, offset: 124672)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !572, file: !571, line: 132, baseType: !47, size: 32, offset: 124704)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_completed", scope: !572, file: !571, line: 135, baseType: !47, size: 32, offset: 124736)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_weighted", scope: !572, file: !571, line: 136, baseType: !47, size: 32, offset: 124768)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "i_reference_count", scope: !572, file: !571, line: 137, baseType: !47, size: 32, offset: 124800)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !572, file: !571, line: 138, baseType: !47, size: 32, offset: 124832)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !572, file: !571, line: 139, baseType: !47, size: 32, offset: 124864)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "f_pir_position", scope: !572, file: !571, line: 142, baseType: !214, size: 32, offset: 124896)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_start_col", scope: !572, file: !571, line: 143, baseType: !47, size: 32, offset: 124928)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_end_col", scope: !572, file: !571, line: 144, baseType: !47, size: 32, offset: 124960)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "i_frames_since_pir", scope: !572, file: !571, line: 145, baseType: !47, size: 32, offset: 124992)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !565, file: !115, line: 470, baseType: !706, size: 128, offset: 64)
!706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !568, size: 128, elements: !219)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "blank_unused", scope: !565, file: !115, line: 473, baseType: !568, size: 64, offset: 192)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !565, file: !115, line: 476, baseType: !709, size: 1152, offset: 256)
!709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !569, size: 1152, elements: !656)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_keyframe", scope: !565, file: !115, line: 478, baseType: !47, size: 32, offset: 1408)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "i_input", scope: !565, file: !115, line: 480, baseType: !47, size: 32, offset: 1440)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dpb", scope: !565, file: !115, line: 482, baseType: !47, size: 32, offset: 1472)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref0", scope: !565, file: !115, line: 483, baseType: !47, size: 32, offset: 1504)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref1", scope: !565, file: !115, line: 484, baseType: !47, size: 32, offset: 1536)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "i_delay", scope: !565, file: !115, line: 485, baseType: !47, size: 32, offset: 1568)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay", scope: !565, file: !115, line: 486, baseType: !47, size: 32, offset: 1600)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay_time", scope: !565, file: !115, line: 487, baseType: !20, size: 64, offset: 1664)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "i_init_delta", scope: !565, file: !115, line: 488, baseType: !20, size: 64, offset: 1728)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_reordered_pts", scope: !565, file: !115, line: 489, baseType: !720, size: 128, offset: 1792)
!720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 128, elements: !219)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "i_largest_pts", scope: !565, file: !115, line: 490, baseType: !20, size: 64, offset: 1920)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "i_second_largest_pts", scope: !565, file: !115, line: 491, baseType: !20, size: 64, offset: 1984)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_lowres", scope: !565, file: !115, line: 492, baseType: !47, size: 32, offset: 2048)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_sub8x8_esa", scope: !565, file: !115, line: 493, baseType: !47, size: 32, offset: 2080)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "fenc", scope: !114, file: !115, line: 497, baseType: !569, size: 64, offset: 117440)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "fdec", scope: !114, file: !115, line: 500, baseType: !569, size: 64, offset: 117504)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref0", scope: !114, file: !115, line: 503, baseType: !47, size: 32, offset: 117568)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "fref0", scope: !114, file: !115, line: 504, baseType: !729, size: 1216, offset: 117632)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !569, size: 1216, elements: !730)
!730 = !{!731}
!731 = !DISubrange(count: 19)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref1", scope: !114, file: !115, line: 505, baseType: !47, size: 32, offset: 118848)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "fref1", scope: !114, file: !115, line: 506, baseType: !729, size: 1216, offset: 118912)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_reorder", scope: !114, file: !115, line: 507, baseType: !218, size: 64, offset: 120128)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay", scope: !114, file: !115, line: 510, baseType: !47, size: 32, offset: 120192)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_offset", scope: !114, file: !115, line: 511, baseType: !47, size: 32, offset: 120224)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts_delay", scope: !114, file: !115, line: 512, baseType: !20, size: 64, offset: 120256)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "dct", scope: !114, file: !115, line: 522, baseType: !739, size: 10624, offset: 120320)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !114, file: !115, line: 515, size: 10624, elements: !740)
!740 = !{!741, !743, !746, !749}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "luma16x16_dc", scope: !739, file: !115, line: 517, baseType: !742, size: 256, align: 128)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 256, elements: !34)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_dc", scope: !739, file: !115, line: 518, baseType: !744, size: 128, align: 128, offset: 256)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 128, elements: !745)
!745 = !{!220, !466}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "luma8x8", scope: !739, file: !115, line: 520, baseType: !747, size: 4096, align: 128, offset: 384)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 4096, elements: !748)
!748 = !{!466, !172}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "luma4x4", scope: !739, file: !115, line: 521, baseType: !750, size: 6144, align: 128, offset: 4480)
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 6144, elements: !751)
!751 = !{!752, !35}
!752 = !DISubrange(count: 24)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !114, file: !115, line: 732, baseType: !754, size: 82688, offset: 130944)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !114, file: !115, line: 525, size: 82688, elements: !755)
!755 = !{!756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !783, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !801, !804, !808, !809, !810, !815, !816, !819, !820, !821, !822, !823, !824, !825, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !885, !916, !917, !918, !919, !920, !921, !922, !923, !924, !927, !928, !929, !932, !935, !937, !940, !942, !943}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !754, file: !115, line: 527, baseType: !47, size: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_stride", scope: !754, file: !115, line: 530, baseType: !47, size: 32, offset: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_stride", scope: !754, file: !115, line: 531, baseType: !47, size: 32, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_stride", scope: !754, file: !115, line: 532, baseType: !47, size: 32, offset: 96)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_x", scope: !754, file: !115, line: 535, baseType: !47, size: 32, offset: 128)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_y", scope: !754, file: !115, line: 536, baseType: !47, size: 32, offset: 160)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_xy", scope: !754, file: !115, line: 537, baseType: !47, size: 32, offset: 192)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_xy", scope: !754, file: !115, line: 538, baseType: !47, size: 32, offset: 224)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_xy", scope: !754, file: !115, line: 539, baseType: !47, size: 32, offset: 256)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !754, file: !115, line: 542, baseType: !47, size: 32, offset: 288)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !754, file: !115, line: 543, baseType: !47, size: 32, offset: 320)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !754, file: !115, line: 544, baseType: !47, size: 32, offset: 352)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "b_trellis", scope: !754, file: !115, line: 545, baseType: !47, size: 32, offset: 384)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "b_noise_reduction", scope: !754, file: !115, line: 546, baseType: !47, size: 32, offset: 416)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !754, file: !115, line: 547, baseType: !47, size: 32, offset: 448)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_rd", scope: !754, file: !115, line: 548, baseType: !47, size: 32, offset: 480)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_trellis", scope: !754, file: !115, line: 549, baseType: !47, size: 32, offset: 512)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !754, file: !115, line: 551, baseType: !47, size: 32, offset: 544)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min", scope: !754, file: !115, line: 554, baseType: !218, size: 64, offset: 576)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max", scope: !754, file: !115, line: 555, baseType: !218, size: 64, offset: 640)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_spel", scope: !754, file: !115, line: 558, baseType: !218, size: 64, offset: 704)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_spel", scope: !754, file: !115, line: 559, baseType: !218, size: 64, offset: 768)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_fpel", scope: !754, file: !115, line: 561, baseType: !218, size: 64, offset: 832)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_fpel", scope: !754, file: !115, line: 562, baseType: !218, size: 64, offset: 896)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour", scope: !754, file: !115, line: 565, baseType: !7, size: 32, offset: 960)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour8", scope: !754, file: !115, line: 566, baseType: !782, size: 128, offset: 992)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128, elements: !465)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour4", scope: !754, file: !115, line: 567, baseType: !784, size: 512, offset: 1120)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 512, elements: !34)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_intra", scope: !754, file: !115, line: 568, baseType: !7, size: 32, offset: 1632)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_frame", scope: !754, file: !115, line: 569, baseType: !7, size: 32, offset: 1664)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_top", scope: !754, file: !115, line: 570, baseType: !47, size: 32, offset: 1696)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_left", scope: !754, file: !115, line: 571, baseType: !47, size: 32, offset: 1728)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topleft", scope: !754, file: !115, line: 572, baseType: !47, size: 32, offset: 1760)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topright", scope: !754, file: !115, line: 573, baseType: !47, size: 32, offset: 1792)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_prev_xy", scope: !754, file: !115, line: 574, baseType: !47, size: 32, offset: 1824)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_left_xy", scope: !754, file: !115, line: 575, baseType: !47, size: 32, offset: 1856)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_top_xy", scope: !754, file: !115, line: 576, baseType: !47, size: 32, offset: 1888)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topleft_xy", scope: !754, file: !115, line: 577, baseType: !47, size: 32, offset: 1920)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topright_xy", scope: !754, file: !115, line: 578, baseType: !47, size: 32, offset: 1952)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !754, file: !115, line: 585, baseType: !623, size: 64, offset: 1984)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "partition", scope: !754, file: !115, line: 586, baseType: !46, size: 64, offset: 2048)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !754, file: !115, line: 587, baseType: !623, size: 64, offset: 2112)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !754, file: !115, line: 588, baseType: !800, size: 64, offset: 2176)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !754, file: !115, line: 589, baseType: !802, size: 64, offset: 2240)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DICompositeType(tag: DW_TAG_array_type, baseType: !624, size: 64, elements: !57)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !754, file: !115, line: 591, baseType: !805, size: 64, offset: 2304)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 192, elements: !807)
!807 = !{!752}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_pred_mode", scope: !754, file: !115, line: 592, baseType: !623, size: 64, offset: 2368)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !754, file: !115, line: 593, baseType: !629, size: 128, offset: 2432)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !754, file: !115, line: 594, baseType: !811, size: 128, offset: 2560)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !812, size: 128, elements: !219)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 128, elements: !814)
!814 = !{!58, !220}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !754, file: !115, line: 595, baseType: !645, size: 128, offset: 2688)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "mvr", scope: !754, file: !115, line: 596, baseType: !817, size: 4096, offset: 2816)
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !630, size: 4096, elements: !818)
!818 = !{!220, !530}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "skipbp", scope: !754, file: !115, line: 597, baseType: !623, size: 64, offset: 6912)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "mb_transform_size", scope: !754, file: !115, line: 598, baseType: !623, size: 64, offset: 6976)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "slice_table", scope: !754, file: !115, line: 599, baseType: !488, size: 64, offset: 7040)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "p_weight_buf", scope: !754, file: !115, line: 603, baseType: !618, size: 1024, offset: 7104)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !754, file: !115, line: 606, baseType: !47, size: 32, offset: 8128)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "i_partition", scope: !754, file: !115, line: 607, baseType: !47, size: 32, offset: 8160)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "i_sub_partition", scope: !754, file: !115, line: 608, baseType: !826, size: 32, align: 32, offset: 8192)
!826 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 32, elements: !465)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !754, file: !115, line: 609, baseType: !47, size: 32, offset: 8224)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_luma", scope: !754, file: !115, line: 611, baseType: !47, size: 32, offset: 8256)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_chroma", scope: !754, file: !115, line: 612, baseType: !47, size: 32, offset: 8288)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra16x16_pred_mode", scope: !754, file: !115, line: 614, baseType: !47, size: 32, offset: 8320)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_pred_mode", scope: !754, file: !115, line: 615, baseType: !47, size: 32, offset: 8352)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "i_skip_intra", scope: !754, file: !115, line: 621, baseType: !47, size: 32, offset: 8384)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "b_skip_mc", scope: !754, file: !115, line: 624, baseType: !47, size: 32, offset: 8416)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "b_reencode_mb", scope: !754, file: !115, line: 626, baseType: !47, size: 32, offset: 8448)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "ip_offset", scope: !754, file: !115, line: 627, baseType: !47, size: 32, offset: 8480)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "pic", scope: !754, file: !115, line: 671, baseType: !837, size: 60672, offset: 8576)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !754, file: !115, line: 629, size: 60672, elements: !838)
!838 = !{!839, !843, !847, !849, !850, !853, !857, !859, !860, !861, !862, !863, !866, !870, !873, !874, !875, !876, !877, !880, !882, !884}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_buf", scope: !837, file: !115, line: 634, baseType: !840, size: 3072, align: 128)
!840 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 3072, elements: !841)
!841 = !{!842}
!842 = !DISubrange(count: 384)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "fdec_buf", scope: !837, file: !115, line: 635, baseType: !844, size: 6912, align: 128, offset: 3072)
!844 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 6912, elements: !845)
!845 = !{!846}
!846 = !DISubrange(count: 864)
