; ModuleID = 'x264_src/common/pixel.c'
source_filename = "x264_src/common/pixel.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.x264_pixel_function_t = type { [7 x i32 (i8*, i32, i8*, i32)*], [7 x i32 (i8*, i32, i8*, i32)*], [7 x i32 (i8*, i32, i8*, i32)*], [7 x i32 (i8*, i32, i8*, i32)*], [4 x i32 (i8*, i32, i8*, i32)*], [7 x i32 (i8*, i32, i8*, i32)*], [7 x i32 (i8*, i32, i8*, i32)*], [7 x i32 (i8*, i32, i8*, i32)*], [7 x void (i8*, i8*, i8*, i8*, i32, i32*)*], [7 x void (i8*, i8*, i8*, i8*, i8*, i32, i32*)*], [7 x i32 (i8*, i32, i8*, i32)*], i32 (i8*, i32, i8*, i32, i32*)*, [4 x i64 (i8*, i32)*], [4 x i64 (i8*, i32)*], void (i8*, i32, i8*, i32, [4 x i32]*)*, float ([4 x i32]*, [4 x i32]*, i32)*, [7 x void (i8*, i8*, i8*, i8*, i32, i32*)*], [7 x void (i8*, i8*, i8*, i8*, i8*, i32, i32*)*], [7 x void (i8*, i8*, i8*, i8*, i32, i32*)*], [7 x void (i8*, i8*, i8*, i8*, i8*, i32, i32*)*], [7 x i32 (i32*, i16*, i32, i16*, i16*, i32, i32)*], void (i8*, i8*, i32*)*, void (i8*, i8*, i32*)*, void (i8*, i8*, i32*)*, void (i8*, i8*, i32*)*, void (i8*, i8*, i32*)*, void (i8*, i8*, i32*)*, void (i8*, i8*, i32*)*, void (i8*, i8*, i32*)*, void (i8*, i8*, i32*)*, void (i8*, i8*, i32*)*, void (i8*, i8*, i32*)*, void (i8*, i8*, i32*)* }

@ssim_end1.ssim_c1 = internal constant i32 416, align 4, !dbg !0
@ssim_end1.ssim_c2 = internal constant i32 235963, align 4, !dbg !39


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "ssim_c1", scope: !2, file: !3, line: 490, type: !41, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "ssim_end1", scope: !3, file: !3, line: 488, type: !4, scopeLine: 489, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !8, retainedNodes: !42)
!3 = !DIFile(filename: "x264_src/common/pixel.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !7, !7, !7, !7}
!6 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !9, retainedTypes: !24, globals: !38, splitDebugInlining: false, nameTableKind: None)
!9 = !{!10}
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !11, line: 30, baseType: !12, size: 32, elements: !13)
!11 = !DIFile(filename: "x264_src/common/pixel.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!12 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!14 = !DIEnumerator(name: "PIXEL_16x16", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "PIXEL_16x8", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "PIXEL_8x16", value: 2, isUnsigned: true)
!17 = !DIEnumerator(name: "PIXEL_8x8", value: 3, isUnsigned: true)
!18 = !DIEnumerator(name: "PIXEL_8x4", value: 4, isUnsigned: true)
!19 = !DIEnumerator(name: "PIXEL_4x8", value: 5, isUnsigned: true)
!20 = !DIEnumerator(name: "PIXEL_4x4", value: 6, isUnsigned: true)
!21 = !DIEnumerator(name: "PIXEL_4x2", value: 7, isUnsigned: true)
!22 = !DIEnumerator(name: "PIXEL_2x4", value: 8, isUnsigned: true)
!23 = !DIEnumerator(name: "PIXEL_2x2", value: 9, isUnsigned: true)
!24 = !{!25, !28, !33, !35, !6}
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !26, line: 87, baseType: !27)
!26 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!27 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !29, line: 25, baseType: !30)
!29 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !31, line: 40, baseType: !32)
!31 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!32 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !29, line: 26, baseType: !34)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !31, line: 42, baseType: !12)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !29, line: 27, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !31, line: 45, baseType: !37)
!37 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!38 = !{!0, !39}
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "ssim_c2", scope: !2, file: !3, line: 491, type: !41, isLocal: true, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!42 = !{}
!43 = !{i32 7, !"Dwarf Version", i32 4}
!44 = !{i32 2, !"Debug Info Version", i32 3}
!45 = !{i32 1, !"wchar_size", i32 4}
!46 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!47 = distinct !DISubprogram(name: "x264_pixel_ssd_wxh", scope: !3, file: !3, line: 99, type: !48, scopeLine: 100, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !8, retainedNodes: !42)
!48 = !DISubroutineType(types: !49)
!49 = !{!50, !53, !63, !7, !63, !7, !7, !7}
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !51, line: 27, baseType: !52)
!51 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !31, line: 44, baseType: !27)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pixel_function_t", file: !11, line: 110, baseType: !55)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !11, line: 63, size: 8448, elements: !56)
!56 = !{!57, !69, !70, !71, !72, !76, !77, !78, !79, !86, !92, !93, !97, !102, !103, !111, !115, !116, !117, !118, !119, !129, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "sad", scope: !55, file: !11, line: 65, baseType: !58, size: 448)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 448, elements: !67)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pixel_cmp_t", file: !11, line: 26, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{!7, !63, !7, !63, !7}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !29, line: 24, baseType: !65)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !31, line: 38, baseType: !66)
!66 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!67 = !{!68}
!68 = !DISubrange(count: 7)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "ssd", scope: !55, file: !11, line: 66, baseType: !58, size: 448, offset: 448)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "satd", scope: !55, file: !11, line: 67, baseType: !58, size: 448, offset: 896)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "ssim", scope: !55, file: !11, line: 68, baseType: !58, size: 448, offset: 1344)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "sa8d", scope: !55, file: !11, line: 69, baseType: !73, size: 256, offset: 1792)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 256, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 4)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "mbcmp", scope: !55, file: !11, line: 70, baseType: !58, size: 448, offset: 2048)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "mbcmp_unaligned", scope: !55, file: !11, line: 71, baseType: !58, size: 448, offset: 2496)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "fpelcmp", scope: !55, file: !11, line: 72, baseType: !58, size: 448, offset: 2944)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "fpelcmp_x3", scope: !55, file: !11, line: 73, baseType: !80, size: 448, offset: 3392)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 448, elements: !67)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pixel_cmp_x3_t", file: !11, line: 27, baseType: !82)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{null, !63, !63, !63, !63, !7, !85}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "fpelcmp_x4", scope: !55, file: !11, line: 74, baseType: !87, size: 448, offset: 3840)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 448, elements: !67)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pixel_cmp_x4_t", file: !11, line: 28, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{null, !63, !63, !63, !63, !63, !7, !85}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "sad_aligned", scope: !55, file: !11, line: 75, baseType: !58, size: 448, offset: 4288)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "var2_8x8", scope: !55, file: !11, line: 76, baseType: !94, size: 64, offset: 4736)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{!7, !63, !7, !63, !7, !85}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !55, file: !11, line: 78, baseType: !98, size: 256, offset: 4800)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 256, elements: !74)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{!35, !63, !7}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "hadamard_ac", scope: !55, file: !11, line: 79, baseType: !98, size: 256, offset: 5056)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "ssim_4x4x2_core", scope: !55, file: !11, line: 81, baseType: !104, size: 64, offset: 5312)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{null, !107, !7, !107, !7, !109}
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128, elements: !74)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "ssim_end4", scope: !55, file: !11, line: 83, baseType: !112, size: 64, offset: 5376)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!6, !109, !109, !7}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "sad_x3", scope: !55, file: !11, line: 86, baseType: !80, size: 448, offset: 5440)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "sad_x4", scope: !55, file: !11, line: 87, baseType: !87, size: 448, offset: 5888)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "satd_x3", scope: !55, file: !11, line: 88, baseType: !80, size: 448, offset: 6336)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "satd_x4", scope: !55, file: !11, line: 89, baseType: !87, size: 448, offset: 6784)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "ads", scope: !55, file: !11, line: 93, baseType: !120, size: 448, offset: 7232)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 448, elements: !67)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!7, !85, !124, !7, !124, !125, !7, !7}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !51, line: 25, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !31, line: 39, baseType: !128)
!128 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "intra_mbcmp_x3_16x16", scope: !55, file: !11, line: 98, baseType: !130, size: 64, offset: 7680)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !63, !63, !85}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "intra_satd_x3_16x16", scope: !55, file: !11, line: 99, baseType: !130, size: 64, offset: 7744)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "intra_sad_x3_16x16", scope: !55, file: !11, line: 100, baseType: !130, size: 64, offset: 7808)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "intra_mbcmp_x3_8x8c", scope: !55, file: !11, line: 101, baseType: !130, size: 64, offset: 7872)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "intra_satd_x3_8x8c", scope: !55, file: !11, line: 102, baseType: !130, size: 64, offset: 7936)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "intra_sad_x3_8x8c", scope: !55, file: !11, line: 103, baseType: !130, size: 64, offset: 8000)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "intra_mbcmp_x3_4x4", scope: !55, file: !11, line: 104, baseType: !130, size: 64, offset: 8064)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "intra_satd_x3_4x4", scope: !55, file: !11, line: 105, baseType: !130, size: 64, offset: 8128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "intra_sad_x3_4x4", scope: !55, file: !11, line: 106, baseType: !130, size: 64, offset: 8192)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "intra_mbcmp_x3_8x8", scope: !55, file: !11, line: 107, baseType: !130, size: 64, offset: 8256)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "intra_sa8d_x3_8x8", scope: !55, file: !11, line: 108, baseType: !130, size: 64, offset: 8320)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "intra_sad_x3_8x8", scope: !55, file: !11, line: 109, baseType: !130, size: 64, offset: 8384)
!144 = !DILocalVariable(name: "pf", arg: 1, scope: !47, file: !3, line: 99, type: !53)
!145 = !DILocation(line: 99, column: 52, scope: !47)
!146 = !DILocalVariable(name: "pix1", arg: 2, scope: !47, file: !3, line: 99, type: !63)
!147 = !DILocation(line: 99, column: 65, scope: !47)
!148 = !DILocalVariable(name: "i_pix1", arg: 3, scope: !47, file: !3, line: 99, type: !7)
!149 = !DILocation(line: 99, column: 75, scope: !47)
!150 = !DILocalVariable(name: "pix2", arg: 4, scope: !47, file: !3, line: 99, type: !63)
!151 = !DILocation(line: 99, column: 92, scope: !47)
!152 = !DILocalVariable(name: "i_pix2", arg: 5, scope: !47, file: !3, line: 99, type: !7)
!153 = !DILocation(line: 99, column: 102, scope: !47)
!154 = !DILocalVariable(name: "i_width", arg: 6, scope: !47, file: !3, line: 99, type: !7)
!155 = !DILocation(line: 99, column: 114, scope: !47)
!156 = !DILocalVariable(name: "i_height", arg: 7, scope: !47, file: !3, line: 99, type: !7)
!157 = !DILocation(line: 99, column: 127, scope: !47)
!158 = !DILocalVariable(name: "i_ssd", scope: !47, file: !3, line: 101, type: !50)
!159 = !DILocation(line: 101, column: 13, scope: !47)
!160 = !DILocalVariable(name: "y", scope: !47, file: !3, line: 102, type: !7)
!161 = !DILocation(line: 102, column: 9, scope: !47)
!162 = !DILocalVariable(name: "align", scope: !47, file: !3, line: 103, type: !7)
!163 = !DILocation(line: 103, column: 9, scope: !47)
!164 = !DILocation(line: 103, column: 30, scope: !47)
!165 = !DILocation(line: 103, column: 20, scope: !47)
!166 = !DILocation(line: 103, column: 47, scope: !47)
!167 = !DILocation(line: 103, column: 37, scope: !47)
!168 = !DILocation(line: 103, column: 35, scope: !47)
!169 = !DILocation(line: 103, column: 54, scope: !47)
!170 = !DILocation(line: 103, column: 52, scope: !47)
!171 = !DILocation(line: 103, column: 63, scope: !47)
!172 = !DILocation(line: 103, column: 61, scope: !47)
!173 = !DILocation(line: 103, column: 71, scope: !47)
!174 = !DILocation(line: 103, column: 17, scope: !47)
!175 = !DILocation(line: 107, column: 12, scope: !176)
!176 = distinct !DILexicalBlock(scope: !47, file: !3, line: 107, column: 5)
!177 = !DILocation(line: 107, column: 10, scope: !176)
!178 = !DILocation(line: 107, column: 17, scope: !179)
!179 = distinct !DILexicalBlock(scope: !176, file: !3, line: 107, column: 5)
!180 = !DILocation(line: 107, column: 21, scope: !179)
!181 = !DILocation(line: 107, column: 29, scope: !179)
!182 = !DILocation(line: 107, column: 19, scope: !179)
!183 = !DILocation(line: 107, column: 5, scope: !176)
!184 = !DILocalVariable(name: "x", scope: !185, file: !3, line: 109, type: !7)
!185 = distinct !DILexicalBlock(scope: !179, file: !3, line: 108, column: 5)
!186 = !DILocation(line: 109, column: 13, scope: !185)
!187 = !DILocation(line: 110, column: 13, scope: !188)
!188 = distinct !DILexicalBlock(scope: !185, file: !3, line: 110, column: 13)
!189 = !DILocation(line: 110, column: 13, scope: !185)
!190 = !DILocation(line: 111, column: 13, scope: !188)
!191 = !DILocation(line: 111, column: 20, scope: !192)
!192 = distinct !DILexicalBlock(scope: !193, file: !3, line: 111, column: 13)
!193 = distinct !DILexicalBlock(scope: !188, file: !3, line: 111, column: 13)
!194 = !DILocation(line: 111, column: 24, scope: !192)
!195 = !DILocation(line: 111, column: 31, scope: !192)
!196 = !DILocation(line: 111, column: 22, scope: !192)
!197 = !DILocation(line: 111, column: 13, scope: !193)
!198 = !DILocation(line: 112, column: 17, scope: !192)
!199 = !DILocation(line: 111, column: 38, scope: !192)
!200 = !DILocation(line: 111, column: 13, scope: !192)
!201 = distinct !{!201, !197, !202}
!202 = !DILocation(line: 112, column: 17, scope: !193)
!203 = !DILocation(line: 113, column: 9, scope: !185)
!204 = !DILocation(line: 113, column: 16, scope: !205)
!205 = distinct !DILexicalBlock(scope: !206, file: !3, line: 113, column: 9)
