; ModuleID = 'x264_src/input/timecode.c'
source_filename = "x264_src/input/timecode.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.cli_input_t = type { i32 (i8*, i8**, %struct.video_info_t*, %struct.cli_input_opt_t*)*, i32 (i8*)*, i32 (%struct.x264_picture_t*, i32, i32, i32)*, i32 (%struct.x264_picture_t*, i8*, i32)*, i32 (%struct.x264_picture_t*, i8*)*, void (%struct.x264_picture_t*)*, i32 (i8*)* }
%struct.video_info_t = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.cli_input_opt_t = type { i8*, i8*, i8*, i32 }
%struct.x264_picture_t = type { i32, i32, i32, i32, i64, i64, %struct.x264_param_t*, %struct.x264_image_t, %struct.x264_hrd_t, i8* }
%struct.x264_param_t = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.anon, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, [16 x i8], [16 x i8], [16 x i8], [16 x i8], [64 x i8], [64 x i8], void (i8*, i32, i8*, %struct.__va_list_tag*)*, i8*, i32, i32, i8*, %struct.anon.0, %struct.anon.1, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, void (i8*)* }
%struct.anon = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "timecode_input", scope: !2, file: !3, line: 499, type: !15, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !14, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "x264_src/input/timecode.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{}
!5 = !{!6, !7, !8, !9}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !10, line: 27, baseType: !11)
!10 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !12, line: 44, baseType: !13)
!12 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!13 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!14 = !{!0}
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "cli_input_t", file: !16, line: 63, baseType: !17)
!16 = !DIFile(filename: "x264_src/input/input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 54, size: 448, elements: !18)
!18 = !{!19, !56, !60, !268, !272, !276, !280}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "open_file", scope: !17, file: !16, line: 56, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DISubroutineType(types: !22)
!22 = !{!7, !23, !25, !28, !48}
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "hnd_t", file: !27, line: 30, baseType: !6)
!27 = !DIFile(filename: "x264_src/muxers.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "video_info_t", file: !16, line: 52, baseType: !30)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 38, size: 384, elements: !31)
!31 = !{!32, !33, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "csp", scope: !30, file: !16, line: 40, baseType: !7, size: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "fps_num", scope: !30, file: !16, line: 41, baseType: !34, size: 32, offset: 32)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !35, line: 26, baseType: !36)
!35 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !12, line: 42, baseType: !37)
!37 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "fps_den", scope: !30, file: !16, line: 42, baseType: !34, size: 32, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !30, file: !16, line: 43, baseType: !7, size: 32, offset: 96)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced", scope: !30, file: !16, line: 44, baseType: !7, size: 32, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !30, file: !16, line: 45, baseType: !34, size: 32, offset: 160)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !30, file: !16, line: 46, baseType: !34, size: 32, offset: 192)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "tff", scope: !30, file: !16, line: 47, baseType: !7, size: 32, offset: 224)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "timebase_num", scope: !30, file: !16, line: 48, baseType: !34, size: 32, offset: 256)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "timebase_den", scope: !30, file: !16, line: 49, baseType: !34, size: 32, offset: 288)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "vfr", scope: !30, file: !16, line: 50, baseType: !7, size: 32, offset: 320)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !30, file: !16, line: 51, baseType: !7, size: 32, offset: 352)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "cli_input_opt_t", file: !16, line: 35, baseType: !50)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 29, size: 256, elements: !51)
!51 = !{!52, !53, !54, !55}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !50, file: !16, line: 31, baseType: !23, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "resolution", scope: !50, file: !16, line: 32, baseType: !23, size: 64, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "timebase", scope: !50, file: !16, line: 33, baseType: !23, size: 64, offset: 128)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !50, file: !16, line: 34, baseType: !7, size: 32, offset: 192)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "get_frame_total", scope: !17, file: !16, line: 57, baseType: !57, size: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DISubroutineType(types: !59)
!59 = !{!7, !26}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "picture_alloc", scope: !17, file: !16, line: 58, baseType: !61, size: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{!7, !64, !7, !7, !7}
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_picture_t", file: !66, line: 549, baseType: !67)
!66 = !DIFile(filename: "x264_src/x264.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !66, line: 513, size: 1088, elements: !68)
!68 = !{!69, !70, !71, !72, !73, !74, !75, !246, !259, !267}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !67, file: !66, line: 521, baseType: !7, size: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !67, file: !66, line: 523, baseType: !7, size: 32, offset: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_struct", scope: !67, file: !66, line: 526, baseType: !7, size: 32, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "b_keyframe", scope: !67, file: !66, line: 529, baseType: !7, size: 32, offset: 96)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !67, file: !66, line: 531, baseType: !9, size: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts", scope: !67, file: !66, line: 534, baseType: !9, size: 64, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !67, file: !66, line: 541, baseType: !76, size: 64, offset: 256)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !66, line: 376, baseType: !78)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !66, line: 176, size: 5632, elements: !79)
!79 = !{!80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !128, !129, !130, !131, !135, !136, !149, !150, !151, !152, !153, !184, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !78, file: !66, line: 179, baseType: !37, size: 32)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !78, file: !66, line: 180, baseType: !7, size: 32, offset: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !78, file: !66, line: 181, baseType: !7, size: 32, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !78, file: !66, line: 182, baseType: !7, size: 32, offset: 96)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !78, file: !66, line: 183, baseType: !7, size: 32, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !78, file: !66, line: 186, baseType: !7, size: 32, offset: 160)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !78, file: !66, line: 187, baseType: !7, size: 32, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !78, file: !66, line: 188, baseType: !7, size: 32, offset: 224)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !78, file: !66, line: 189, baseType: !7, size: 32, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !78, file: !66, line: 190, baseType: !7, size: 32, offset: 288)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !78, file: !66, line: 198, baseType: !7, size: 32, offset: 320)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !78, file: !66, line: 215, baseType: !92, size: 288, offset: 352)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !78, file: !66, line: 200, size: 288, elements: !93)
!93 = !{!94, !95, !96, !97, !98, !99, !100, !101, !102}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !92, file: !66, line: 203, baseType: !7, size: 32)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !92, file: !66, line: 204, baseType: !7, size: 32, offset: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !92, file: !66, line: 206, baseType: !7, size: 32, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !92, file: !66, line: 209, baseType: !7, size: 32, offset: 96)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !92, file: !66, line: 210, baseType: !7, size: 32, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !92, file: !66, line: 211, baseType: !7, size: 32, offset: 160)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !92, file: !66, line: 212, baseType: !7, size: 32, offset: 192)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !92, file: !66, line: 213, baseType: !7, size: 32, offset: 224)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !92, file: !66, line: 214, baseType: !7, size: 32, offset: 256)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !78, file: !66, line: 218, baseType: !7, size: 32, offset: 640)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !78, file: !66, line: 219, baseType: !7, size: 32, offset: 672)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !78, file: !66, line: 220, baseType: !7, size: 32, offset: 704)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !78, file: !66, line: 221, baseType: !7, size: 32, offset: 736)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !78, file: !66, line: 222, baseType: !7, size: 32, offset: 768)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !78, file: !66, line: 224, baseType: !7, size: 32, offset: 800)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !78, file: !66, line: 225, baseType: !7, size: 32, offset: 832)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !78, file: !66, line: 226, baseType: !7, size: 32, offset: 864)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !78, file: !66, line: 227, baseType: !7, size: 32, offset: 896)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !78, file: !66, line: 229, baseType: !7, size: 32, offset: 928)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !78, file: !66, line: 230, baseType: !7, size: 32, offset: 960)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !78, file: !66, line: 231, baseType: !7, size: 32, offset: 992)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !78, file: !66, line: 233, baseType: !7, size: 32, offset: 1024)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !78, file: !66, line: 234, baseType: !7, size: 32, offset: 1056)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !78, file: !66, line: 236, baseType: !7, size: 32, offset: 1088)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !78, file: !66, line: 237, baseType: !7, size: 32, offset: 1120)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !78, file: !66, line: 239, baseType: !7, size: 32, offset: 1152)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !78, file: !66, line: 240, baseType: !23, size: 64, offset: 1216)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !78, file: !66, line: 241, baseType: !122, size: 128, offset: 1280)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 128, elements: !126)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !35, line: 24, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !12, line: 38, baseType: !125)
!125 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!126 = !{!127}
!127 = !DISubrange(count: 16)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !78, file: !66, line: 242, baseType: !122, size: 128, offset: 1408)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !78, file: !66, line: 243, baseType: !122, size: 128, offset: 1536)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !78, file: !66, line: 244, baseType: !122, size: 128, offset: 1664)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !78, file: !66, line: 245, baseType: !132, size: 512, offset: 1792)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 512, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !78, file: !66, line: 246, baseType: !132, size: 512, offset: 2304)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !78, file: !66, line: 249, baseType: !137, size: 64, offset: 2816)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{null, !6, !7, !140, !142}
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 499, size: 192, elements: !144)
!144 = !{!145, !146, !147, !148}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !143, file: !3, line: 499, baseType: !37, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !143, file: !3, line: 499, baseType: !37, size: 32, offset: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !143, file: !3, line: 499, baseType: !6, size: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !143, file: !3, line: 499, baseType: !6, size: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !78, file: !66, line: 250, baseType: !6, size: 64, offset: 2880)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !78, file: !66, line: 251, baseType: !7, size: 32, offset: 2944)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !78, file: !66, line: 252, baseType: !7, size: 32, offset: 2976)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !78, file: !66, line: 253, baseType: !23, size: 64, offset: 3008)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !78, file: !66, line: 287, baseType: !154, size: 800, offset: 3072)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !78, file: !66, line: 256, size: 800, elements: !155)
!155 = !{!156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !176, !177, !178, !182, !183}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !154, file: !66, line: 258, baseType: !37, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !154, file: !66, line: 259, baseType: !37, size: 32, offset: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !154, file: !66, line: 261, baseType: !7, size: 32, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !154, file: !66, line: 262, baseType: !7, size: 32, offset: 96)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !154, file: !66, line: 263, baseType: !7, size: 32, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !154, file: !66, line: 264, baseType: !7, size: 32, offset: 160)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !154, file: !66, line: 265, baseType: !7, size: 32, offset: 192)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !154, file: !66, line: 267, baseType: !7, size: 32, offset: 224)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !154, file: !66, line: 268, baseType: !7, size: 32, offset: 256)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !154, file: !66, line: 269, baseType: !7, size: 32, offset: 288)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !154, file: !66, line: 270, baseType: !7, size: 32, offset: 320)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !154, file: !66, line: 271, baseType: !7, size: 32, offset: 352)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !154, file: !66, line: 272, baseType: !7, size: 32, offset: 384)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !154, file: !66, line: 273, baseType: !7, size: 32, offset: 416)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !154, file: !66, line: 274, baseType: !7, size: 32, offset: 448)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !154, file: !66, line: 275, baseType: !7, size: 32, offset: 480)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !154, file: !66, line: 276, baseType: !7, size: 32, offset: 512)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !154, file: !66, line: 277, baseType: !7, size: 32, offset: 544)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !154, file: !66, line: 278, baseType: !175, size: 32, offset: 576)
!175 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !154, file: !66, line: 279, baseType: !175, size: 32, offset: 608)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !154, file: !66, line: 280, baseType: !7, size: 32, offset: 640)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !154, file: !66, line: 283, baseType: !179, size: 64, offset: 672)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !180)
!180 = !{!181}
!181 = !DISubrange(count: 2)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !154, file: !66, line: 285, baseType: !7, size: 32, offset: 736)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !154, file: !66, line: 286, baseType: !7, size: 32, offset: 768)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !78, file: !66, line: 327, baseType: !185, size: 1152, offset: 3904)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !78, file: !66, line: 290, size: 1152, elements: !186)
!186 = !{!187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !224, !225}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !185, file: !66, line: 292, baseType: !7, size: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !185, file: !66, line: 294, baseType: !7, size: 32, offset: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !185, file: !66, line: 295, baseType: !7, size: 32, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !185, file: !66, line: 296, baseType: !7, size: 32, offset: 96)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !185, file: !66, line: 297, baseType: !7, size: 32, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !185, file: !66, line: 299, baseType: !7, size: 32, offset: 160)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !185, file: !66, line: 300, baseType: !175, size: 32, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !185, file: !66, line: 301, baseType: !175, size: 32, offset: 224)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !185, file: !66, line: 302, baseType: !175, size: 32, offset: 256)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !185, file: !66, line: 303, baseType: !7, size: 32, offset: 288)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !185, file: !66, line: 304, baseType: !7, size: 32, offset: 320)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !185, file: !66, line: 305, baseType: !175, size: 32, offset: 352)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !185, file: !66, line: 306, baseType: !175, size: 32, offset: 384)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !185, file: !66, line: 307, baseType: !175, size: 32, offset: 416)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !185, file: !66, line: 309, baseType: !7, size: 32, offset: 448)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !185, file: !66, line: 310, baseType: !175, size: 32, offset: 480)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !185, file: !66, line: 311, baseType: !7, size: 32, offset: 512)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !185, file: !66, line: 312, baseType: !7, size: 32, offset: 544)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !185, file: !66, line: 315, baseType: !7, size: 32, offset: 576)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !185, file: !66, line: 316, baseType: !23, size: 64, offset: 640)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !185, file: !66, line: 317, baseType: !7, size: 32, offset: 704)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !185, file: !66, line: 318, baseType: !23, size: 64, offset: 768)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !185, file: !66, line: 321, baseType: !175, size: 32, offset: 832)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !185, file: !66, line: 322, baseType: !175, size: 32, offset: 864)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !185, file: !66, line: 323, baseType: !175, size: 32, offset: 896)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !185, file: !66, line: 324, baseType: !213, size: 64, offset: 960)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !66, line: 174, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !66, line: 167, size: 256, elements: !216)
!216 = !{!217, !218, !219, !220, !221, !222}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !215, file: !66, line: 169, baseType: !7, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !215, file: !66, line: 169, baseType: !7, size: 32, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !215, file: !66, line: 170, baseType: !7, size: 32, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !215, file: !66, line: 171, baseType: !7, size: 32, offset: 96)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !215, file: !66, line: 172, baseType: !175, size: 32, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !215, file: !66, line: 173, baseType: !223, size: 64, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !185, file: !66, line: 325, baseType: !7, size: 32, offset: 1024)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !185, file: !66, line: 326, baseType: !23, size: 64, offset: 1088)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !78, file: !66, line: 330, baseType: !7, size: 32, offset: 5056)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !78, file: !66, line: 331, baseType: !7, size: 32, offset: 5088)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !78, file: !66, line: 332, baseType: !7, size: 32, offset: 5120)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !78, file: !66, line: 334, baseType: !7, size: 32, offset: 5152)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !78, file: !66, line: 335, baseType: !7, size: 32, offset: 5184)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !78, file: !66, line: 336, baseType: !34, size: 32, offset: 5216)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !78, file: !66, line: 337, baseType: !34, size: 32, offset: 5248)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !78, file: !66, line: 338, baseType: !34, size: 32, offset: 5280)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !78, file: !66, line: 339, baseType: !34, size: 32, offset: 5312)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !78, file: !66, line: 340, baseType: !7, size: 32, offset: 5344)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !78, file: !66, line: 344, baseType: !7, size: 32, offset: 5376)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !78, file: !66, line: 356, baseType: !7, size: 32, offset: 5408)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !78, file: !66, line: 364, baseType: !7, size: 32, offset: 5440)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !78, file: !66, line: 367, baseType: !7, size: 32, offset: 5472)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !78, file: !66, line: 368, baseType: !7, size: 32, offset: 5504)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !78, file: !66, line: 369, baseType: !7, size: 32, offset: 5536)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !78, file: !66, line: 375, baseType: !243, size: 64, offset: 5568)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{null, !6}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "img", scope: !67, file: !66, line: 543, baseType: !247, size: 448, offset: 320)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_image_t", file: !66, line: 511, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !66, line: 505, size: 448, elements: !249)
!249 = !{!250, !251, !252, !256}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !248, file: !66, line: 507, baseType: !7, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !248, file: !66, line: 508, baseType: !7, size: 32, offset: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !248, file: !66, line: 509, baseType: !253, size: 128, offset: 64)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128, elements: !254)
!254 = !{!255}
!255 = !DISubrange(count: 4)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !248, file: !66, line: 510, baseType: !257, size: 256, offset: 192)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !258, size: 256, elements: !254)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "hrd_timing", scope: !67, file: !66, line: 545, baseType: !260, size: 256, offset: 768)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_hrd_t", file: !66, line: 503, baseType: !261)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !66, line: 496, size: 256, elements: !262)
!262 = !{!263, !264, !265, !266}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_initial_arrival_time", scope: !261, file: !66, line: 498, baseType: !8, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_final_arrival_time", scope: !261, file: !66, line: 499, baseType: !8, size: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_time", scope: !261, file: !66, line: 500, baseType: !8, size: 64, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_time", scope: !261, file: !66, line: 502, baseType: !8, size: 64, offset: 192)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !67, file: !66, line: 548, baseType: !6, size: 64, offset: 1024)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "read_frame", scope: !17, file: !16, line: 59, baseType: !269, size: 64, offset: 192)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{!7, !64, !26, !7}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "release_frame", scope: !17, file: !16, line: 60, baseType: !273, size: 64, offset: 256)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{!7, !64, !26}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "picture_clean", scope: !17, file: !16, line: 61, baseType: !277, size: 64, offset: 320)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{null, !64}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "close_file", scope: !17, file: !16, line: 62, baseType: !57, size: 64, offset: 384)
!281 = !{i32 7, !"Dwarf Version", i32 4}
!282 = !{i32 2, !"Debug Info Version", i32 3}
!283 = !{i32 1, !"wchar_size", i32 4}
!284 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!285 = distinct !DISubprogram(name: "open_file", scope: !3, file: !3, line: 384, type: !21, scopeLine: 385, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!286 = !DILocalVariable(name: "psz_filename", arg: 1, scope: !285, file: !3, line: 384, type: !23)
!287 = !DILocation(line: 384, column: 29, scope: !285)
!288 = !DILocalVariable(name: "p_handle", arg: 2, scope: !285, file: !3, line: 384, type: !25)
!289 = !DILocation(line: 384, column: 50, scope: !285)
!290 = !DILocalVariable(name: "info", arg: 3, scope: !285, file: !3, line: 384, type: !28)
!291 = !DILocation(line: 384, column: 74, scope: !285)
!292 = !DILocalVariable(name: "opt", arg: 4, scope: !285, file: !3, line: 384, type: !48)
!293 = !DILocation(line: 384, column: 97, scope: !285)
!294 = !DILocalVariable(name: "ret", scope: !285, file: !3, line: 386, type: !7)
!295 = !DILocation(line: 386, column: 9, scope: !285)
!296 = !DILocalVariable(name: "tcfile_in", scope: !285, file: !3, line: 387, type: !297)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !299, line: 7, baseType: !300)
!299 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !301, line: 49, size: 1728, elements: !302)
!301 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!302 = !{!303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !318, !320, !321, !322, !324, !326, !328, !332, !335, !337, !340, !343, !344, !345, !349, !350}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !300, file: !301, line: 51, baseType: !7, size: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !300, file: !301, line: 54, baseType: !23, size: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !300, file: !301, line: 55, baseType: !23, size: 64, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !300, file: !301, line: 56, baseType: !23, size: 64, offset: 192)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !300, file: !301, line: 57, baseType: !23, size: 64, offset: 256)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !300, file: !301, line: 58, baseType: !23, size: 64, offset: 320)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !300, file: !301, line: 59, baseType: !23, size: 64, offset: 384)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !300, file: !301, line: 60, baseType: !23, size: 64, offset: 448)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !300, file: !301, line: 61, baseType: !23, size: 64, offset: 512)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !300, file: !301, line: 64, baseType: !23, size: 64, offset: 576)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !300, file: !301, line: 65, baseType: !23, size: 64, offset: 640)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !300, file: !301, line: 66, baseType: !23, size: 64, offset: 704)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !300, file: !301, line: 68, baseType: !316, size: 64, offset: 768)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !301, line: 36, flags: DIFlagFwdDecl)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !300, file: !301, line: 70, baseType: !319, size: 64, offset: 832)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !300, file: !301, line: 72, baseType: !7, size: 32, offset: 896)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !300, file: !301, line: 73, baseType: !7, size: 32, offset: 928)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !300, file: !301, line: 74, baseType: !323, size: 64, offset: 960)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !12, line: 152, baseType: !13)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !300, file: !301, line: 77, baseType: !325, size: 16, offset: 1024)
!325 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !300, file: !301, line: 78, baseType: !327, size: 8, offset: 1040)
!327 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !300, file: !301, line: 79, baseType: !329, size: 8, offset: 1048)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 8, elements: !330)
!330 = !{!331}
!331 = !DISubrange(count: 1)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !300, file: !301, line: 81, baseType: !333, size: 64, offset: 1088)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !301, line: 43, baseType: null)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !300, file: !301, line: 89, baseType: !336, size: 64, offset: 1152)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !12, line: 153, baseType: !13)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !300, file: !301, line: 91, baseType: !338, size: 64, offset: 1216)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !301, line: 37, flags: DIFlagFwdDecl)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !300, file: !301, line: 92, baseType: !341, size: 64, offset: 1280)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !301, line: 38, flags: DIFlagFwdDecl)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !300, file: !301, line: 93, baseType: !319, size: 64, offset: 1344)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !300, file: !301, line: 94, baseType: !6, size: 64, offset: 1408)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !300, file: !301, line: 95, baseType: !346, size: 64, offset: 1472)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !347, line: 46, baseType: !348)
!347 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!348 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !300, file: !301, line: 96, baseType: !7, size: 32, offset: 1536)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !300, file: !301, line: 98, baseType: !351, size: 160, offset: 1568)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 160, elements: !352)
!352 = !{!353}
!353 = !DISubrange(count: 20)
!354 = !DILocation(line: 387, column: 11, scope: !285)
!355 = !DILocalVariable(name: "h", scope: !285, file: !3, line: 388, type: !356)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "timecode_hnd_t", file: !3, line: 42, baseType: !358)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 28, size: 1024, elements: !359)
!359 = !{!360, !361, !362, !363, !364, !365, !368, !369, !370, !371, !373, !374}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !358, file: !3, line: 30, baseType: !15, size: 448)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "p_handle", scope: !358, file: !3, line: 31, baseType: !26, size: 64, offset: 448)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "frame_total", scope: !358, file: !3, line: 32, baseType: !7, size: 32, offset: 512)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "auto_timebase_num", scope: !358, file: !3, line: 33, baseType: !7, size: 32, offset: 544)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "auto_timebase_den", scope: !358, file: !3, line: 34, baseType: !7, size: 32, offset: 576)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "timebase_num", scope: !358, file: !3, line: 35, baseType: !366, size: 64, offset: 640)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !35, line: 27, baseType: !367)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !12, line: 45, baseType: !348)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "timebase_den", scope: !358, file: !3, line: 36, baseType: !366, size: 64, offset: 704)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !358, file: !3, line: 37, baseType: !7, size: 32, offset: 768)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "stored_pts_num", scope: !358, file: !3, line: 38, baseType: !7, size: 32, offset: 800)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !358, file: !3, line: 39, baseType: !372, size: 64, offset: 832)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "assume_fps", scope: !358, file: !3, line: 40, baseType: !8, size: 64, offset: 896)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "last_timecode", scope: !358, file: !3, line: 41, baseType: !8, size: 64, offset: 960)
!375 = !DILocation(line: 388, column: 21, scope: !285)
!376 = !DILocation(line: 388, column: 25, scope: !285)
!377 = !DILocation(line: 389, column: 10, scope: !378)
!378 = distinct !DILexicalBlock(scope: !285, file: !3, line: 389, column: 9)
!379 = !DILocation(line: 389, column: 9, scope: !285)
!380 = !DILocation(line: 391, column: 18, scope: !381)
!381 = distinct !DILexicalBlock(scope: !378, file: !3, line: 390, column: 5)
!382 = !DILocation(line: 391, column: 9, scope: !381)
!383 = !DILocation(line: 392, column: 9, scope: !381)
!384 = !DILocation(line: 394, column: 5, scope: !285)
!385 = !DILocation(line: 394, column: 8, scope: !285)
!386 = !DILocation(line: 394, column: 16, scope: !285)
!387 = !DILocation(line: 395, column: 20, scope: !285)
!388 = !DILocation(line: 395, column: 19, scope: !285)
!389 = !DILocation(line: 395, column: 5, scope: !285)
!390 = !DILocation(line: 395, column: 8, scope: !285)
!391 = !DILocation(line: 395, column: 17, scope: !285)
!392 = !DILocation(line: 396, column: 28, scope: !285)
!393 = !DILocation(line: 396, column: 45, scope: !285)
!394 = !DILocation(line: 396, column: 48, scope: !285)
!395 = !DILocation(line: 396, column: 22, scope: !285)
!396 = !DILocation(line: 396, column: 5, scope: !285)
!397 = !DILocation(line: 396, column: 8, scope: !285)
!398 = !DILocation(line: 396, column: 20, scope: !285)
!399 = !DILocation(line: 397, column: 15, scope: !285)
!400 = !DILocation(line: 397, column: 20, scope: !285)
!401 = !DILocation(line: 397, column: 5, scope: !285)
!402 = !DILocation(line: 397, column: 8, scope: !285)
!403 = !DILocation(line: 397, column: 13, scope: !285)
!404 = !DILocation(line: 398, column: 9, scope: !405)
!405 = distinct !DILexicalBlock(scope: !285, file: !3, line: 398, column: 9)
!406 = !DILocation(line: 398, column: 14, scope: !405)
!407 = !DILocation(line: 398, column: 9, scope: !285)
!408 = !DILocation(line: 400, column: 23, scope: !409)
!409 = distinct !DILexicalBlock(scope: !405, file: !3, line: 399, column: 5)
!410 = !DILocation(line: 400, column: 28, scope: !409)
!411 = !DILocation(line: 400, column: 60, scope: !409)
!412 = !DILocation(line: 400, column: 63, scope: !409)
!413 = !DILocation(line: 400, column: 78, scope: !409)
!414 = !DILocation(line: 400, column: 81, scope: !409)
!415 = !DILocation(line: 400, column: 15, scope: !409)
!416 = !DILocation(line: 400, column: 13, scope: !409)
!417 = !DILocation(line: 401, column: 13, scope: !418)
!418 = distinct !DILexicalBlock(scope: !409, file: !3, line: 401, column: 13)
!419 = !DILocation(line: 401, column: 17, scope: !418)
!420 = !DILocation(line: 401, column: 13, scope: !409)
!421 = !DILocation(line: 402, column: 40, scope: !418)
!422 = !DILocation(line: 402, column: 45, scope: !418)
!423 = !DILocation(line: 402, column: 31, scope: !418)
!424 = !DILocation(line: 402, column: 13, scope: !418)
!425 = !DILocation(line: 402, column: 16, scope: !418)
!426 = !DILocation(line: 402, column: 29, scope: !418)
!427 = !DILocation(line: 403, column: 13, scope: !428)
!428 = distinct !DILexicalBlock(scope: !409, file: !3, line: 403, column: 13)
!429 = !DILocation(line: 403, column: 16, scope: !428)
!430 = !DILocation(line: 403, column: 29, scope: !428)
!431 = !DILocation(line: 403, column: 42, scope: !428)
!432 = !DILocation(line: 403, column: 45, scope: !428)
!433 = !DILocation(line: 403, column: 48, scope: !428)
!434 = !DILocation(line: 403, column: 61, scope: !428)
!435 = !DILocation(line: 403, column: 13, scope: !409)
!436 = !DILocation(line: 405, column: 22, scope: !437)
!437 = distinct !DILexicalBlock(scope: !428, file: !3, line: 404, column: 9)
!438 = !DILocation(line: 405, column: 13, scope: !437)
!439 = !DILocation(line: 406, column: 13, scope: !437)
!440 = !DILocation(line: 408, column: 5, scope: !409)
!441 = !DILocation(line: 409, column: 29, scope: !285)
!442 = !DILocation(line: 409, column: 28, scope: !285)
