; ModuleID = 'x264_src/common/set.c'
source_filename = "x264_src/common/set.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.x264_t = type { %struct.x264_param_t, [129 x %struct.x264_t*], i32, i32, i32, i32, i32, %struct.anon.2, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1 x %struct.x264_sps_t], %struct.x264_sps_t*, [1 x %struct.x264_pps_t], %struct.x264_pps_t*, i32, i32, [4 x [16 x i32]*], [2 x [64 x i32]*], [4 x [16 x i32]*], [2 x [64 x i32]*], [4 x [16 x i16]*], [2 x [64 x i16]*], [4 x [16 x i16]*], [2 x [64 x i16]*], [92 x i16*], [92 x [4 x i16*]], i8*, [8 x i8], %struct.x264_slice_header_t, %struct.x264_cabac_t, %struct.anon.8, %struct.x264_frame*, %struct.x264_frame*, i32, [19 x %struct.x264_frame*], i32, [19 x %struct.x264_frame*], [2 x i32], i32, i32, i64, %struct.anon.9, %struct.anon.10, %struct.x264_ratecontrol_t*, %struct.anon.13, [2 x [64 x i32]], [2 x [64 x i16]], [2 x i32], i8*, [2 x [3 x i8*]], [2 x [2 x [4 x [4 x i8]]]*], [7 x void (i8*)*], [7 x void (i8*)*], [12 x void (i8*, i8*)*], [12 x void (i8*)*], void (i8*, i8*, i32, i32)*, %struct.x264_pixel_function_t, %struct.x264_mc_functions_t, %struct.x264_dct_function_t, %struct.x264_zigzag_function_t, %struct.x264_quant_function_t, %struct.x264_deblock_function_t, %struct.x264_lookahead_t*, [8 x i8] }

!10 = !DIEnumerator(name: "CQM_4PY", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "CQM_4IC", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "CQM_4PC", value: 3, isUnsigned: true)
!13 = !{!14}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!15 = !{!0, !16, !28, !37, !41, !44, !46, !48, !53}
!16 = !DIGlobalVariableExpression(var: !17, expr: !DIExpression())
!17 = distinct !DIGlobalVariable(name: "quant4_scale", scope: !2, file: !3, line: 35, type: !18, isLocal: true, isDefinition: true)
!18 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 288, elements: !25)
!19 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !21, line: 25, baseType: !22)
!21 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !23, line: 40, baseType: !24)
!23 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!24 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!25 = !{!26, !27}
!26 = !DISubrange(count: 6)
!27 = !DISubrange(count: 3)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(name: "quant8_scan", scope: !2, file: !3, line: 45, type: !30, isLocal: true, isDefinition: true)
!30 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 128, elements: !35)
!31 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !21, line: 24, baseType: !33)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !23, line: 38, baseType: !34)
!34 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!35 = !{!36}
!36 = !DISubrange(count: 16)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "dequant8_scale", scope: !2, file: !3, line: 49, type: !39, isLocal: true, isDefinition: true)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 288, elements: !40)
!40 = !{!26, !26}
!41 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression())
!42 = distinct !DIGlobalVariable(name: "quant8_scale", scope: !2, file: !3, line: 58, type: !43, isLocal: true, isDefinition: true)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 576, elements: !40)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "x264_cqm_jvt4i", scope: !2, file: !6, line: 189, type: !30, isLocal: true, isDefinition: true)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "x264_cqm_jvt4p", scope: !2, file: !6, line: 196, type: !30, isLocal: true, isDefinition: true)
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(name: "x264_cqm_jvt8i", scope: !2, file: !6, line: 203, type: !50, isLocal: true, isDefinition: true)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 512, elements: !51)
!51 = !{!52}
!52 = !DISubrange(count: 64)
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression())
!54 = distinct !DIGlobalVariable(name: "x264_cqm_jvt8p", scope: !2, file: !6, line: 214, type: !50, isLocal: true, isDefinition: true)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 144, elements: !25)
!56 = !{i32 7, !"Dwarf Version", i32 4}
!57 = !{i32 2, !"Debug Info Version", i32 3}
!58 = !{i32 1, !"wchar_size", i32 4}
!59 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!60 = distinct !DISubprogram(name: "x264_cqm_init", scope: !3, file: !3, line: 68, type: !61, scopeLine: 69, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !1361)
!61 = !DISubroutineType(types: !62)
!62 = !{!63, !64}
!63 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_t", file: !66, line: 46, baseType: !67)
!66 = !DIFile(filename: "x264_src/x264.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_t", file: !68, line: 381, size: 266752, elements: !69)
!68 = !DIFile(filename: "x264_src/common/common.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!69 = !{!70, !237, !241, !242, !243, !244, !245, !246, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !381, !383, !409, !411, !412, !413, !419, !423, !424, !425, !429, !433, !434, !435, !440, !443, !444, !522, !539, !703, !704, !705, !706, !710, !711, !712, !713, !714, !715, !716, !731, !925, !929, !990, !993, !995, !997, !998, !1001, !1006, !1015, !1016, !1024, !1026, !1031, !1107, !1193, !1237, !1259, !1308, !1337}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !67, file: !68, line: 384, baseType: !71, size: 5632)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !66, line: 376, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !66, line: 176, size: 5632, elements: !73)
!73 = !{!74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !117, !119, !120, !121, !122, !124, !125, !138, !139, !140, !141, !142, !173, !215, !216, !217, !218, !219, !220, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !72, file: !66, line: 179, baseType: !7, size: 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !72, file: !66, line: 180, baseType: !63, size: 32, offset: 32)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !72, file: !66, line: 181, baseType: !63, size: 32, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !72, file: !66, line: 182, baseType: !63, size: 32, offset: 96)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !72, file: !66, line: 183, baseType: !63, size: 32, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !72, file: !66, line: 186, baseType: !63, size: 32, offset: 160)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !72, file: !66, line: 187, baseType: !63, size: 32, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !72, file: !66, line: 188, baseType: !63, size: 32, offset: 224)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !72, file: !66, line: 189, baseType: !63, size: 32, offset: 256)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !72, file: !66, line: 190, baseType: !63, size: 32, offset: 288)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !72, file: !66, line: 198, baseType: !63, size: 32, offset: 320)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !72, file: !66, line: 215, baseType: !86, size: 288, offset: 352)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !72, file: !66, line: 200, size: 288, elements: !87)
!87 = !{!88, !89, !90, !91, !92, !93, !94, !95, !96}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !86, file: !66, line: 203, baseType: !63, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !86, file: !66, line: 204, baseType: !63, size: 32, offset: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !86, file: !66, line: 206, baseType: !63, size: 32, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !86, file: !66, line: 209, baseType: !63, size: 32, offset: 96)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !86, file: !66, line: 210, baseType: !63, size: 32, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !86, file: !66, line: 211, baseType: !63, size: 32, offset: 160)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !86, file: !66, line: 212, baseType: !63, size: 32, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !86, file: !66, line: 213, baseType: !63, size: 32, offset: 224)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !86, file: !66, line: 214, baseType: !63, size: 32, offset: 256)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !72, file: !66, line: 218, baseType: !63, size: 32, offset: 640)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !72, file: !66, line: 219, baseType: !63, size: 32, offset: 672)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !72, file: !66, line: 220, baseType: !63, size: 32, offset: 704)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !72, file: !66, line: 221, baseType: !63, size: 32, offset: 736)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !72, file: !66, line: 222, baseType: !63, size: 32, offset: 768)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !72, file: !66, line: 224, baseType: !63, size: 32, offset: 800)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !72, file: !66, line: 225, baseType: !63, size: 32, offset: 832)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !72, file: !66, line: 226, baseType: !63, size: 32, offset: 864)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !72, file: !66, line: 227, baseType: !63, size: 32, offset: 896)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !72, file: !66, line: 229, baseType: !63, size: 32, offset: 928)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !72, file: !66, line: 230, baseType: !63, size: 32, offset: 960)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !72, file: !66, line: 231, baseType: !63, size: 32, offset: 992)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !72, file: !66, line: 233, baseType: !63, size: 32, offset: 1024)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !72, file: !66, line: 234, baseType: !63, size: 32, offset: 1056)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !72, file: !66, line: 236, baseType: !63, size: 32, offset: 1088)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !72, file: !66, line: 237, baseType: !63, size: 32, offset: 1120)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !72, file: !66, line: 239, baseType: !63, size: 32, offset: 1152)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !72, file: !66, line: 240, baseType: !115, size: 64, offset: 1216)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !72, file: !66, line: 241, baseType: !118, size: 128, offset: 1280)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 128, elements: !35)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !72, file: !66, line: 242, baseType: !118, size: 128, offset: 1408)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !72, file: !66, line: 243, baseType: !118, size: 128, offset: 1536)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !72, file: !66, line: 244, baseType: !118, size: 128, offset: 1664)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !72, file: !66, line: 245, baseType: !123, size: 512, offset: 1792)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 512, elements: !51)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !72, file: !66, line: 246, baseType: !123, size: 512, offset: 2304)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !72, file: !66, line: 249, baseType: !126, size: 64, offset: 2816)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{null, !14, !63, !129, !131}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !116)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, size: 192, elements: !133)
!133 = !{!134, !135, !136, !137}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !132, file: !3, baseType: !7, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !132, file: !3, baseType: !7, size: 32, offset: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !132, file: !3, baseType: !14, size: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !132, file: !3, baseType: !14, size: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !72, file: !66, line: 250, baseType: !14, size: 64, offset: 2880)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !72, file: !66, line: 251, baseType: !63, size: 32, offset: 2944)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !72, file: !66, line: 252, baseType: !63, size: 32, offset: 2976)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !72, file: !66, line: 253, baseType: !115, size: 64, offset: 3008)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !72, file: !66, line: 287, baseType: !143, size: 800, offset: 3072)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !72, file: !66, line: 256, size: 800, elements: !144)
!144 = !{!145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !165, !166, !167, !171, !172}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !143, file: !66, line: 258, baseType: !7, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !143, file: !66, line: 259, baseType: !7, size: 32, offset: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !143, file: !66, line: 261, baseType: !63, size: 32, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !143, file: !66, line: 262, baseType: !63, size: 32, offset: 96)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !143, file: !66, line: 263, baseType: !63, size: 32, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !143, file: !66, line: 264, baseType: !63, size: 32, offset: 160)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !143, file: !66, line: 265, baseType: !63, size: 32, offset: 192)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !143, file: !66, line: 267, baseType: !63, size: 32, offset: 224)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !143, file: !66, line: 268, baseType: !63, size: 32, offset: 256)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !143, file: !66, line: 269, baseType: !63, size: 32, offset: 288)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !143, file: !66, line: 270, baseType: !63, size: 32, offset: 320)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !143, file: !66, line: 271, baseType: !63, size: 32, offset: 352)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !143, file: !66, line: 272, baseType: !63, size: 32, offset: 384)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !143, file: !66, line: 273, baseType: !63, size: 32, offset: 416)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !143, file: !66, line: 274, baseType: !63, size: 32, offset: 448)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !143, file: !66, line: 275, baseType: !63, size: 32, offset: 480)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !143, file: !66, line: 276, baseType: !63, size: 32, offset: 512)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !143, file: !66, line: 277, baseType: !63, size: 32, offset: 544)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !143, file: !66, line: 278, baseType: !164, size: 32, offset: 576)
!164 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !143, file: !66, line: 279, baseType: !164, size: 32, offset: 608)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !143, file: !66, line: 280, baseType: !63, size: 32, offset: 640)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !143, file: !66, line: 283, baseType: !168, size: 64, offset: 672)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 64, elements: !169)
!169 = !{!170}
!170 = !DISubrange(count: 2)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !143, file: !66, line: 285, baseType: !63, size: 32, offset: 736)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !143, file: !66, line: 286, baseType: !63, size: 32, offset: 768)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !72, file: !66, line: 327, baseType: !174, size: 1152, offset: 3904)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !72, file: !66, line: 290, size: 1152, elements: !175)
!175 = !{!176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !213, !214}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !174, file: !66, line: 292, baseType: !63, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !174, file: !66, line: 294, baseType: !63, size: 32, offset: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !174, file: !66, line: 295, baseType: !63, size: 32, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !174, file: !66, line: 296, baseType: !63, size: 32, offset: 96)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !174, file: !66, line: 297, baseType: !63, size: 32, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !174, file: !66, line: 299, baseType: !63, size: 32, offset: 160)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !174, file: !66, line: 300, baseType: !164, size: 32, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !174, file: !66, line: 301, baseType: !164, size: 32, offset: 224)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !174, file: !66, line: 302, baseType: !164, size: 32, offset: 256)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !174, file: !66, line: 303, baseType: !63, size: 32, offset: 288)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !174, file: !66, line: 304, baseType: !63, size: 32, offset: 320)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !174, file: !66, line: 305, baseType: !164, size: 32, offset: 352)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !174, file: !66, line: 306, baseType: !164, size: 32, offset: 384)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !174, file: !66, line: 307, baseType: !164, size: 32, offset: 416)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !174, file: !66, line: 309, baseType: !63, size: 32, offset: 448)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !174, file: !66, line: 310, baseType: !164, size: 32, offset: 480)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !174, file: !66, line: 311, baseType: !63, size: 32, offset: 512)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !174, file: !66, line: 312, baseType: !63, size: 32, offset: 544)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !174, file: !66, line: 315, baseType: !63, size: 32, offset: 576)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !174, file: !66, line: 316, baseType: !115, size: 64, offset: 640)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !174, file: !66, line: 317, baseType: !63, size: 32, offset: 704)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !174, file: !66, line: 318, baseType: !115, size: 64, offset: 768)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !174, file: !66, line: 321, baseType: !164, size: 32, offset: 832)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !174, file: !66, line: 322, baseType: !164, size: 32, offset: 864)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !174, file: !66, line: 323, baseType: !164, size: 32, offset: 896)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !174, file: !66, line: 324, baseType: !202, size: 64, offset: 960)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !66, line: 174, baseType: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !66, line: 167, size: 256, elements: !205)
!205 = !{!206, !207, !208, !209, !210, !211}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !204, file: !66, line: 169, baseType: !63, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !204, file: !66, line: 169, baseType: !63, size: 32, offset: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !204, file: !66, line: 170, baseType: !63, size: 32, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !204, file: !66, line: 171, baseType: !63, size: 32, offset: 96)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !204, file: !66, line: 172, baseType: !164, size: 32, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !204, file: !66, line: 173, baseType: !212, size: 64, offset: 192)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !174, file: !66, line: 325, baseType: !63, size: 32, offset: 1024)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !174, file: !66, line: 326, baseType: !115, size: 64, offset: 1088)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !72, file: !66, line: 330, baseType: !63, size: 32, offset: 5056)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !72, file: !66, line: 331, baseType: !63, size: 32, offset: 5088)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !72, file: !66, line: 332, baseType: !63, size: 32, offset: 5120)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !72, file: !66, line: 334, baseType: !63, size: 32, offset: 5152)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !72, file: !66, line: 335, baseType: !63, size: 32, offset: 5184)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !72, file: !66, line: 336, baseType: !221, size: 32, offset: 5216)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !21, line: 26, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !23, line: 42, baseType: !7)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !72, file: !66, line: 337, baseType: !221, size: 32, offset: 5248)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !72, file: !66, line: 338, baseType: !221, size: 32, offset: 5280)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !72, file: !66, line: 339, baseType: !221, size: 32, offset: 5312)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !72, file: !66, line: 340, baseType: !63, size: 32, offset: 5344)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !72, file: !66, line: 344, baseType: !63, size: 32, offset: 5376)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !72, file: !66, line: 356, baseType: !63, size: 32, offset: 5408)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !72, file: !66, line: 364, baseType: !63, size: 32, offset: 5440)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !72, file: !66, line: 367, baseType: !63, size: 32, offset: 5472)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !72, file: !66, line: 368, baseType: !63, size: 32, offset: 5504)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !72, file: !66, line: 369, baseType: !63, size: 32, offset: 5536)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !72, file: !66, line: 375, baseType: !234, size: 64, offset: 5568)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{null, !14}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !67, file: !68, line: 386, baseType: !238, size: 8256, offset: 5632)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 8256, elements: !239)
!239 = !{!240}
!240 = !DISubrange(count: 129)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "thread_handle", scope: !67, file: !68, line: 387, baseType: !63, size: 32, offset: 13888)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "b_thread_active", scope: !67, file: !68, line: 388, baseType: !63, size: 32, offset: 13920)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_phase", scope: !67, file: !68, line: 389, baseType: !63, size: 32, offset: 13952)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_start", scope: !67, file: !68, line: 390, baseType: !63, size: 32, offset: 13984)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_end", scope: !67, file: !68, line: 391, baseType: !63, size: 32, offset: 14016)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !67, file: !68, line: 402, baseType: !247, size: 576, offset: 14080)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !67, file: !68, line: 394, size: 576, elements: !248)
!248 = !{!249, !250, !251, !261, !262, !263}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal", scope: !247, file: !68, line: 396, baseType: !63, size: 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "i_nals_allocated", scope: !247, file: !68, line: 397, baseType: !63, size: 32, offset: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "nal", scope: !247, file: !68, line: 398, baseType: !252, size: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !66, line: 604, baseType: !254)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !66, line: 593, size: 192, elements: !255)
!255 = !{!256, !257, !258, !259}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !254, file: !66, line: 595, baseType: !63, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !254, file: !66, line: 596, baseType: !63, size: 32, offset: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !254, file: !66, line: 599, baseType: !63, size: 32, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !254, file: !66, line: 603, baseType: !260, size: 64, offset: 128)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitstream", scope: !247, file: !68, line: 399, baseType: !63, size: 32, offset: 128)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "p_bitstream", scope: !247, file: !68, line: 400, baseType: !260, size: 64, offset: 192)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !247, file: !68, line: 401, baseType: !264, size: 320, offset: 256)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "bs_t", file: !265, line: 56, baseType: !266)
!265 = !DIFile(filename: "x264_src/common/bs.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bs_s", file: !265, line: 47, size: 320, elements: !267)
!267 = !{!268, !269, !270, !271, !275, !276}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !266, file: !265, line: 49, baseType: !260, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !266, file: !265, line: 50, baseType: !260, size: 64, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !266, file: !265, line: 51, baseType: !260, size: 64, offset: 128)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "cur_bits", scope: !266, file: !265, line: 53, baseType: !272, size: 64, offset: 192)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !273, line: 87, baseType: !274)
!273 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!274 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !266, file: !265, line: 54, baseType: !63, size: 32, offset: 256)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "i_bits_encoded", scope: !266, file: !265, line: 55, baseType: !63, size: 32, offset: 288)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer", scope: !67, file: !68, line: 404, baseType: !260, size: 64, offset: 14656)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer_size", scope: !67, file: !68, line: 405, baseType: !63, size: 32, offset: 14720)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !67, file: !68, line: 410, baseType: !63, size: 32, offset: 14752)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !67, file: !68, line: 411, baseType: !63, size: 32, offset: 14784)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_frames", scope: !67, file: !68, line: 413, baseType: !63, size: 32, offset: 14816)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_type", scope: !67, file: !68, line: 415, baseType: !63, size: 32, offset: 14848)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_ref_idc", scope: !67, file: !68, line: 416, baseType: !63, size: 32, offset: 14880)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields", scope: !67, file: !68, line: 418, baseType: !63, size: 32, offset: 14912)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields_last_frame", scope: !67, file: !68, line: 419, baseType: !63, size: 32, offset: 14944)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_duration", scope: !67, file: !68, line: 420, baseType: !63, size: 32, offset: 14976)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields", scope: !67, file: !68, line: 421, baseType: !63, size: 32, offset: 15008)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !67, file: !68, line: 422, baseType: !63, size: 32, offset: 15040)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !67, file: !68, line: 424, baseType: !63, size: 32, offset: 15072)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !67, file: !68, line: 425, baseType: !63, size: 32, offset: 15104)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "b_queued_intra_refresh", scope: !67, file: !68, line: 427, baseType: !63, size: 32, offset: 15136)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "sps_array", scope: !67, file: !68, line: 430, baseType: !293, size: 10400, offset: 15168)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 10400, elements: !379)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_sps_t", file: !6, line: 154, baseType: !295)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 52, size: 10400, elements: !296)
!296 = !{!297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !314, !315, !316, !317, !318, !319, !320, !321, !322, !329, !330, !378}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !295, file: !6, line: 54, baseType: !63, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "i_profile_idc", scope: !295, file: !6, line: 56, baseType: !63, size: 32, offset: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !295, file: !6, line: 57, baseType: !63, size: 32, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set0", scope: !295, file: !6, line: 59, baseType: !63, size: 32, offset: 96)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set1", scope: !295, file: !6, line: 60, baseType: !63, size: 32, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set2", scope: !295, file: !6, line: 61, baseType: !63, size: 32, offset: 160)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_frame_num", scope: !295, file: !6, line: 63, baseType: !63, size: 32, offset: 192)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_type", scope: !295, file: !6, line: 65, baseType: !63, size: 32, offset: 224)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_poc_lsb", scope: !295, file: !6, line: 67, baseType: !63, size: 32, offset: 256)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "b_delta_pic_order_always_zero", scope: !295, file: !6, line: 69, baseType: !63, size: 32, offset: 288)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_non_ref_pic", scope: !295, file: !6, line: 70, baseType: !63, size: 32, offset: 320)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_top_to_bottom_field", scope: !295, file: !6, line: 71, baseType: !63, size: 32, offset: 352)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames_in_poc_cycle", scope: !295, file: !6, line: 72, baseType: !63, size: 32, offset: 384)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_ref_frame", scope: !295, file: !6, line: 73, baseType: !311, size: 8192, offset: 416)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 8192, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 256)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames", scope: !295, file: !6, line: 75, baseType: !63, size: 32, offset: 8608)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "b_gaps_in_frame_num_value_allowed", scope: !295, file: !6, line: 76, baseType: !63, size: 32, offset: 8640)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_width", scope: !295, file: !6, line: 77, baseType: !63, size: 32, offset: 8672)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_height", scope: !295, file: !6, line: 78, baseType: !63, size: 32, offset: 8704)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_mbs_only", scope: !295, file: !6, line: 79, baseType: !63, size: 32, offset: 8736)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_adaptive_frame_field", scope: !295, file: !6, line: 80, baseType: !63, size: 32, offset: 8768)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct8x8_inference", scope: !295, file: !6, line: 81, baseType: !63, size: 32, offset: 8800)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "b_crop", scope: !295, file: !6, line: 83, baseType: !63, size: 32, offset: 8832)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !295, file: !6, line: 90, baseType: !323, size: 128, offset: 8864)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !295, file: !6, line: 84, size: 128, elements: !324)
!324 = !{!325, !326, !327, !328}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !323, file: !6, line: 86, baseType: !63, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "i_right", scope: !323, file: !6, line: 87, baseType: !63, size: 32, offset: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "i_top", scope: !323, file: !6, line: 88, baseType: !63, size: 32, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "i_bottom", scope: !323, file: !6, line: 89, baseType: !63, size: 32, offset: 96)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "b_vui", scope: !295, file: !6, line: 92, baseType: !63, size: 32, offset: 8992)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !295, file: !6, line: 150, baseType: !331, size: 1344, offset: 9024)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !295, file: !6, line: 93, size: 1344, elements: !332)
!332 = !{!333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !369, !370, !371, !372, !373, !374, !375, !376, !377}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "b_aspect_ratio_info_present", scope: !331, file: !6, line: 95, baseType: !63, size: 32)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !331, file: !6, line: 96, baseType: !63, size: 32, offset: 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !331, file: !6, line: 97, baseType: !63, size: 32, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info_present", scope: !331, file: !6, line: 99, baseType: !63, size: 32, offset: 96)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info", scope: !331, file: !6, line: 100, baseType: !63, size: 32, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "b_signal_type_present", scope: !331, file: !6, line: 102, baseType: !63, size: 32, offset: 160)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !331, file: !6, line: 103, baseType: !63, size: 32, offset: 192)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !331, file: !6, line: 104, baseType: !63, size: 32, offset: 224)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "b_color_description_present", scope: !331, file: !6, line: 105, baseType: !63, size: 32, offset: 256)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !331, file: !6, line: 106, baseType: !63, size: 32, offset: 288)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !331, file: !6, line: 107, baseType: !63, size: 32, offset: 320)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !331, file: !6, line: 108, baseType: !63, size: 32, offset: 352)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_loc_info_present", scope: !331, file: !6, line: 110, baseType: !63, size: 32, offset: 384)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_top", scope: !331, file: !6, line: 111, baseType: !63, size: 32, offset: 416)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_bottom", scope: !331, file: !6, line: 112, baseType: !63, size: 32, offset: 448)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "b_timing_info_present", scope: !331, file: !6, line: 114, baseType: !63, size: 32, offset: 480)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_units_in_tick", scope: !331, file: !6, line: 115, baseType: !221, size: 32, offset: 512)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_scale", scope: !331, file: !6, line: 116, baseType: !221, size: 32, offset: 544)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "b_fixed_frame_rate", scope: !331, file: !6, line: 117, baseType: !63, size: 32, offset: 576)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "b_nal_hrd_parameters_present", scope: !331, file: !6, line: 119, baseType: !63, size: 32, offset: 608)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "b_vcl_hrd_parameters_present", scope: !331, file: !6, line: 120, baseType: !63, size: 32, offset: 640)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "hrd", scope: !331, file: !6, line: 137, baseType: !355, size: 384, offset: 672)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !331, file: !6, line: 122, size: 384, elements: !356)
!356 = !{!357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_cnt", scope: !355, file: !6, line: 124, baseType: !63, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_scale", scope: !355, file: !6, line: 125, baseType: !63, size: 32, offset: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_scale", scope: !355, file: !6, line: 126, baseType: !63, size: 32, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_value", scope: !355, file: !6, line: 127, baseType: !63, size: 32, offset: 96)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_value", scope: !355, file: !6, line: 128, baseType: !63, size: 32, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_unscaled", scope: !355, file: !6, line: 129, baseType: !63, size: 32, offset: 160)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_unscaled", scope: !355, file: !6, line: 130, baseType: !63, size: 32, offset: 192)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "b_cbr_hrd", scope: !355, file: !6, line: 131, baseType: !63, size: 32, offset: 224)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "i_initial_cpb_removal_delay_length", scope: !355, file: !6, line: 133, baseType: !63, size: 32, offset: 256)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_removal_delay_length", scope: !355, file: !6, line: 134, baseType: !63, size: 32, offset: 288)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay_length", scope: !355, file: !6, line: 135, baseType: !63, size: 32, offset: 320)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_offset_length", scope: !355, file: !6, line: 136, baseType: !63, size: 32, offset: 352)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct_present", scope: !331, file: !6, line: 139, baseType: !63, size: 32, offset: 1056)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "b_bitstream_restriction", scope: !331, file: !6, line: 140, baseType: !63, size: 32, offset: 1088)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "b_motion_vectors_over_pic_boundaries", scope: !331, file: !6, line: 141, baseType: !63, size: 32, offset: 1120)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bytes_per_pic_denom", scope: !331, file: !6, line: 142, baseType: !63, size: 32, offset: 1152)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bits_per_mb_denom", scope: !331, file: !6, line: 143, baseType: !63, size: 32, offset: 1184)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_horizontal", scope: !331, file: !6, line: 144, baseType: !63, size: 32, offset: 1216)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_vertical", scope: !331, file: !6, line: 145, baseType: !63, size: 32, offset: 1248)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_reorder_frames", scope: !331, file: !6, line: 146, baseType: !63, size: 32, offset: 1280)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dec_frame_buffering", scope: !331, file: !6, line: 147, baseType: !63, size: 32, offset: 1312)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "b_qpprime_y_zero_transform_bypass", scope: !295, file: !6, line: 152, baseType: !63, size: 32, offset: 10368)
!379 = !{!380}
!380 = !DISubrange(count: 1)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !67, file: !68, line: 431, baseType: !382, size: 64, offset: 25600)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "pps_array", scope: !67, file: !68, line: 432, baseType: !384, size: 960, offset: 25664)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !385, size: 960, elements: !379)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pps_t", file: !6, line: 186, baseType: !386)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 156, size: 960, elements: !387)
!387 = !{!388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !386, file: !6, line: 158, baseType: !63, size: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !386, file: !6, line: 159, baseType: !63, size: 32, offset: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !386, file: !6, line: 161, baseType: !63, size: 32, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_order", scope: !386, file: !6, line: 163, baseType: !63, size: 32, offset: 96)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_slice_groups", scope: !386, file: !6, line: 164, baseType: !63, size: 32, offset: 128)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_default_active", scope: !386, file: !6, line: 166, baseType: !63, size: 32, offset: 160)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_default_active", scope: !386, file: !6, line: 167, baseType: !63, size: 32, offset: 192)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_pred", scope: !386, file: !6, line: 169, baseType: !63, size: 32, offset: 224)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !386, file: !6, line: 170, baseType: !63, size: 32, offset: 256)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qp", scope: !386, file: !6, line: 172, baseType: !63, size: 32, offset: 288)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qs", scope: !386, file: !6, line: 173, baseType: !63, size: 32, offset: 320)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_index_offset", scope: !386, file: !6, line: 175, baseType: !63, size: 32, offset: 352)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter_control", scope: !386, file: !6, line: 177, baseType: !63, size: 32, offset: 384)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra_pred", scope: !386, file: !6, line: 178, baseType: !63, size: 32, offset: 416)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "b_redundant_pic_cnt", scope: !386, file: !6, line: 179, baseType: !63, size: 32, offset: 448)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8_mode", scope: !386, file: !6, line: 181, baseType: !63, size: 32, offset: 480)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !386, file: !6, line: 183, baseType: !63, size: 32, offset: 512)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !386, file: !6, line: 184, baseType: !406, size: 384, offset: 576)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !407, size: 384, elements: !408)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!408 = !{!26}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !67, file: !68, line: 433, baseType: !410, size: 64, offset: 26624)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !67, file: !68, line: 434, baseType: !63, size: 32, offset: 26688)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts_compress_multiplier", scope: !67, file: !68, line: 437, baseType: !63, size: 32, offset: 26720)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_mf", scope: !67, file: !68, line: 440, baseType: !414, size: 256, offset: 26752)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !415, size: 256, elements: !417)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 512, elements: !35)
!417 = !{!418}
!418 = !DISubrange(count: 4)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_mf", scope: !67, file: !68, line: 441, baseType: !420, size: 128, offset: 27008)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !421, size: 128, elements: !169)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 2048, elements: !51)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "unquant4_mf", scope: !67, file: !68, line: 443, baseType: !414, size: 256, offset: 27136)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "unquant8_mf", scope: !67, file: !68, line: 444, baseType: !420, size: 128, offset: 27392)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_mf", scope: !67, file: !68, line: 446, baseType: !426, size: 256, offset: 27520)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !427, size: 256, elements: !417)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 256, elements: !35)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_mf", scope: !67, file: !68, line: 447, baseType: !430, size: 128, offset: 27776)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 128, elements: !169)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 1024, elements: !51)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_bias", scope: !67, file: !68, line: 448, baseType: !426, size: 256, offset: 27904)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_bias", scope: !67, file: !68, line: 449, baseType: !430, size: 128, offset: 28160)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv", scope: !67, file: !68, line: 454, baseType: !436, size: 5888, offset: 28288)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !437, size: 5888, elements: !438)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!438 = !{!439}
!439 = !DISubrange(count: 92)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv_fpel", scope: !67, file: !68, line: 455, baseType: !441, size: 23552, offset: 34176)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !437, size: 23552, elements: !442)
!442 = !{!439, !418}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !67, file: !68, line: 457, baseType: !407, size: 64, offset: 57728)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !67, file: !68, line: 460, baseType: !445, size: 53376, offset: 57856)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_slice_header_t", file: !68, line: 364, baseType: !446)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !68, line: 302, size: 53376, elements: !447)
!447 = !{!448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !476, !506, !507, !508, !514, !515, !516, !517, !518, !519, !520, !521}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !446, file: !68, line: 304, baseType: !382, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !446, file: !68, line: 305, baseType: !410, size: 64, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !446, file: !68, line: 307, baseType: !63, size: 32, offset: 128)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "i_first_mb", scope: !446, file: !68, line: 308, baseType: !63, size: 32, offset: 160)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_mb", scope: !446, file: !68, line: 309, baseType: !63, size: 32, offset: 192)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "i_pps_id", scope: !446, file: !68, line: 311, baseType: !63, size: 32, offset: 224)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !446, file: !68, line: 313, baseType: !63, size: 32, offset: 256)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "b_mbaff", scope: !446, file: !68, line: 315, baseType: !63, size: 32, offset: 288)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "b_field_pic", scope: !446, file: !68, line: 316, baseType: !63, size: 32, offset: 320)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "b_bottom_field", scope: !446, file: !68, line: 317, baseType: !63, size: 32, offset: 352)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !446, file: !68, line: 319, baseType: !63, size: 32, offset: 384)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !446, file: !68, line: 321, baseType: !63, size: 32, offset: 416)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc_bottom", scope: !446, file: !68, line: 322, baseType: !63, size: 32, offset: 448)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc", scope: !446, file: !68, line: 324, baseType: !168, size: 64, offset: 480)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "i_redundant_pic_cnt", scope: !446, file: !68, line: 325, baseType: !63, size: 32, offset: 544)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_spatial_mv_pred", scope: !446, file: !68, line: 327, baseType: !63, size: 32, offset: 576)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "b_num_ref_idx_override", scope: !446, file: !68, line: 329, baseType: !63, size: 32, offset: 608)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !446, file: !68, line: 330, baseType: !63, size: 32, offset: 640)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !446, file: !68, line: 331, baseType: !63, size: 32, offset: 672)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l0", scope: !446, file: !68, line: 333, baseType: !63, size: 32, offset: 704)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l1", scope: !446, file: !68, line: 334, baseType: !63, size: 32, offset: 736)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_order", scope: !446, file: !68, line: 339, baseType: !470, size: 2048, offset: 768)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !471, size: 2048, elements: !475)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !446, file: !68, line: 335, size: 64, elements: !472)
!472 = !{!473, !474}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "idc", scope: !471, file: !68, line: 337, baseType: !63, size: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !471, file: !68, line: 338, baseType: !63, size: 32, offset: 32)
!475 = !{!170, !36}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !446, file: !68, line: 342, baseType: !477, size: 49152, offset: 2816)
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !478, size: 49152, elements: !504)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_weight_t", file: !479, line: 36, baseType: !480, align: 128)
!479 = !DIFile(filename: "x264_src/common/mc.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_weight_t", file: !479, line: 26, size: 512, elements: !481)
!481 = !{!482, !490, !491, !494, !495, !496}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "cachea", scope: !480, file: !479, line: 30, baseType: !483, size: 128, align: 128)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !484, size: 128, elements: !488)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !485, line: 25, baseType: !486)
!485 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !23, line: 39, baseType: !487)
!487 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!488 = !{!489}
!489 = !DISubrange(count: 8)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "cacheb", scope: !480, file: !479, line: 31, baseType: !483, size: 128, offset: 128)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "i_denom", scope: !480, file: !479, line: 32, baseType: !492, size: 32, offset: 256)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !485, line: 26, baseType: !493)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !23, line: 41, baseType: !63)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "i_scale", scope: !480, file: !479, line: 33, baseType: !492, size: 32, offset: 288)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset", scope: !480, file: !479, line: 34, baseType: !492, size: 32, offset: 320)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "weightfn", scope: !480, file: !479, line: 35, baseType: !497, size: 64, offset: 384)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "weight_fn_t", file: !479, line: 25, baseType: !499)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DISubroutineType(types: !501)
!501 = !{null, !260, !63, !260, !63, !502, !63}
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !480)
!504 = !{!505, !27}
!505 = !DISubrange(count: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_remove_from_end", scope: !446, file: !68, line: 344, baseType: !63, size: 32, offset: 51968)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_command_count", scope: !446, file: !68, line: 345, baseType: !63, size: 32, offset: 52000)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "mmco", scope: !446, file: !68, line: 350, baseType: !509, size: 1024, offset: 52032)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !510, size: 1024, elements: !35)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !446, file: !68, line: 346, size: 64, elements: !511)
!511 = !{!512, !513}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "i_difference_of_pic_nums", scope: !510, file: !68, line: 348, baseType: !63, size: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !510, file: !68, line: 349, baseType: !63, size: 32, offset: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !446, file: !68, line: 352, baseType: !63, size: 32, offset: 53056)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !446, file: !68, line: 354, baseType: !63, size: 32, offset: 53088)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_delta", scope: !446, file: !68, line: 355, baseType: !63, size: 32, offset: 53120)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "b_sp_for_swidth", scope: !446, file: !68, line: 356, baseType: !63, size: 32, offset: 53152)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "i_qs_delta", scope: !446, file: !68, line: 357, baseType: !63, size: 32, offset: 53184)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "i_disable_deblocking_filter_idc", scope: !446, file: !68, line: 360, baseType: !63, size: 32, offset: 53216)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "i_alpha_c0_offset", scope: !446, file: !68, line: 361, baseType: !63, size: 32, offset: 53248)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "i_beta_offset", scope: !446, file: !68, line: 362, baseType: !63, size: 32, offset: 53280)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !67, file: !68, line: 463, baseType: !523, size: 4096, offset: 111232)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_cabac_t", file: !524, line: 46, baseType: !525)
!524 = !DIFile(filename: "x264_src/common/cabac.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !524, line: 27, size: 4096, elements: !526)
!526 = !{!527, !528, !529, !530, !531, !532, !533, !534, !535}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "i_low", scope: !525, file: !524, line: 30, baseType: !63, size: 32)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "i_range", scope: !525, file: !524, line: 31, baseType: !63, size: 32, offset: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "i_queue", scope: !525, file: !524, line: 34, baseType: !63, size: 32, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "i_bytes_outstanding", scope: !525, file: !524, line: 35, baseType: !63, size: 32, offset: 96)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !525, file: !524, line: 37, baseType: !260, size: 64, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !525, file: !524, line: 38, baseType: !260, size: 64, offset: 192)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !525, file: !524, line: 39, baseType: !260, size: 64, offset: 256)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "f8_bits_encoded", scope: !525, file: !524, line: 42, baseType: !63, size: 32, align: 128, offset: 384)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !525, file: !524, line: 45, baseType: !536, size: 3680, offset: 416)
!536 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 3680, elements: !537)
!537 = !{!538}
!538 = !DISubrange(count: 460)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !67, file: !68, line: 494, baseType: !540, size: 2112, offset: 115328)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !67, file: !68, line: 465, size: 2112, elements: !541)
!541 = !{!542, !683, !685, !686, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !699, !700, !701, !702}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !540, file: !68, line: 468, baseType: !543, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_frame_t", file: !546, line: 146, baseType: !547)
!546 = !DIFile(filename: "x264_src/common/frame.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_frame", file: !546, line: 31, size: 125056, elements: !548)
!548 = !{!549, !550, !551, !552, !555, !556, !557, !558, !559, !560, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !579, !580, !581, !582, !583, !584, !586, !588, !589, !590, !591, !592, !595, !597, !598, !600, !605, !606, !610, !611, !615, !619, !622, !624, !625, !627, !628, !630, !631, !632, !635, !637, !638, !639, !641, !642, !643, !644, !645, !646, !647, !648, !650, !651, !655, !664, !668, !670, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !547, file: !546, line: 34, baseType: !63, size: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !547, file: !546, line: 35, baseType: !63, size: 32, offset: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !547, file: !546, line: 36, baseType: !63, size: 32, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !547, file: !546, line: 37, baseType: !553, size: 64, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !485, line: 27, baseType: !554)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !23, line: 44, baseType: !274)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts", scope: !547, file: !546, line: 38, baseType: !553, size: 64, offset: 192)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "i_duration", scope: !547, file: !546, line: 39, baseType: !63, size: 32, offset: 256)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_duration", scope: !547, file: !546, line: 40, baseType: !63, size: 32, offset: 288)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !547, file: !546, line: 41, baseType: !63, size: 32, offset: 320)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay", scope: !547, file: !546, line: 42, baseType: !63, size: 32, offset: 352)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !547, file: !546, line: 43, baseType: !561, size: 64, offset: 384)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !547, file: !546, line: 45, baseType: !63, size: 32, offset: 448)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded", scope: !547, file: !546, line: 46, baseType: !63, size: 32, offset: 480)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "i_field_cnt", scope: !547, file: !546, line: 47, baseType: !63, size: 32, offset: 512)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !547, file: !546, line: 48, baseType: !63, size: 32, offset: 544)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "b_kept_as_ref", scope: !547, file: !546, line: 49, baseType: !63, size: 32, offset: 576)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_struct", scope: !547, file: !546, line: 50, baseType: !63, size: 32, offset: 608)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "b_keyframe", scope: !547, file: !546, line: 51, baseType: !63, size: 32, offset: 640)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "b_fdec", scope: !547, file: !546, line: 52, baseType: !32, size: 8, offset: 672)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_minigop_bframe", scope: !547, file: !546, line: 53, baseType: !32, size: 8, offset: 680)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframes", scope: !547, file: !546, line: 54, baseType: !32, size: 8, offset: 688)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_rc", scope: !547, file: !546, line: 55, baseType: !164, size: 32, offset: 704)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_aq", scope: !547, file: !546, line: 56, baseType: !164, size: 32, offset: 736)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_l0ref0", scope: !547, file: !546, line: 57, baseType: !63, size: 32, offset: 768)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !547, file: !546, line: 60, baseType: !63, size: 32, offset: 800)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !547, file: !546, line: 61, baseType: !577, size: 96, offset: 832)
!577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 96, elements: !578)
!578 = !{!27}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !547, file: !546, line: 62, baseType: !577, size: 96, offset: 928)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines", scope: !547, file: !546, line: 63, baseType: !577, size: 96, offset: 1024)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride_lowres", scope: !547, file: !546, line: 64, baseType: !63, size: 32, offset: 1120)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "i_width_lowres", scope: !547, file: !546, line: 65, baseType: !63, size: 32, offset: 1152)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_lowres", scope: !547, file: !546, line: 66, baseType: !63, size: 32, offset: 1184)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !547, file: !546, line: 67, baseType: !585, size: 192, offset: 1216)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 192, elements: !578)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "filtered", scope: !547, file: !546, line: 68, baseType: !587, size: 256, offset: 1408)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 256, elements: !417)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !547, file: !546, line: 69, baseType: !587, size: 256, offset: 1664)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "integral", scope: !547, file: !546, line: 70, baseType: !437, size: 64, offset: 1920)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !547, file: !546, line: 74, baseType: !587, size: 256, offset: 1984)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_lowres", scope: !547, file: !546, line: 75, baseType: !587, size: 256, offset: 2240)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !547, file: !546, line: 77, baseType: !593, size: 24576, offset: 2560)
!593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !478, size: 24576, elements: !594)
!594 = !{!36, !27}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "weighted", scope: !547, file: !546, line: 78, baseType: !596, size: 1024, offset: 27136)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 1024, elements: !35)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "b_duplicate", scope: !547, file: !546, line: 79, baseType: !63, size: 32, offset: 28160)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !547, file: !546, line: 80, baseType: !599, size: 64, offset: 28224)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !547, file: !546, line: 83, baseType: !601, size: 64, offset: 28288)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !485, line: 24, baseType: !603)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !23, line: 37, baseType: !604)
!604 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "mb_partition", scope: !547, file: !546, line: 84, baseType: !260, size: 64, offset: 28352)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !547, file: !546, line: 85, baseType: !607, size: 128, offset: 28416)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !608, size: 128, elements: !169)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !484, size: 32, elements: !169)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "mv16x16", scope: !547, file: !546, line: 86, baseType: !608, size: 64, offset: 28544)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mvs", scope: !547, file: !546, line: 87, baseType: !612, size: 2176, offset: 28608)
!612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !608, size: 2176, elements: !613)
!613 = !{!170, !614}
!614 = !DISubrange(count: 17)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_costs", scope: !547, file: !546, line: 92, baseType: !616, size: 20736, offset: 30784)
!616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !437, size: 20736, elements: !617)
!617 = !{!618, !618}
!618 = !DISubrange(count: 18)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mv_costs", scope: !547, file: !546, line: 96, baseType: !620, size: 2176, offset: 51520)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !621, size: 2176, elements: !613)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !547, file: !546, line: 97, baseType: !623, size: 128, offset: 53696)
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !601, size: 128, elements: !169)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref", scope: !547, file: !546, line: 98, baseType: !168, size: 64, offset: 53824)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc", scope: !547, file: !546, line: 99, baseType: !626, size: 1024, offset: 53888)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 1024, elements: !475)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "inv_ref_poc", scope: !547, file: !546, line: 100, baseType: !609, size: 32, offset: 54912)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est", scope: !547, file: !546, line: 105, baseType: !629, size: 10368, offset: 54944)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 10368, elements: !617)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est_aq", scope: !547, file: !546, line: 106, baseType: !629, size: 10368, offset: 65312)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "i_satd", scope: !547, file: !546, line: 107, baseType: !63, size: 32, offset: 75680)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_mbs", scope: !547, file: !546, line: 108, baseType: !633, size: 576, offset: 75712)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 576, elements: !634)
!634 = !{!618}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satds", scope: !547, file: !546, line: 109, baseType: !636, size: 20736, offset: 76288)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !621, size: 20736, elements: !617)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satd", scope: !547, file: !546, line: 110, baseType: !621, size: 64, offset: 97024)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_bits", scope: !547, file: !546, line: 111, baseType: !621, size: 64, offset: 97088)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "f_row_qp", scope: !547, file: !546, line: 112, baseType: !640, size: 64, offset: 97152)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset", scope: !547, file: !546, line: 113, baseType: !640, size: 64, offset: 97216)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset_aq", scope: !547, file: !546, line: 114, baseType: !640, size: 64, offset: 97280)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_calculated", scope: !547, file: !546, line: 115, baseType: !63, size: 32, offset: 97344)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !547, file: !546, line: 116, baseType: !437, size: 64, offset: 97408)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "i_propagate_cost", scope: !547, file: !546, line: 117, baseType: !437, size: 64, offset: 97472)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "i_inv_qscale_factor", scope: !547, file: !546, line: 118, baseType: !437, size: 64, offset: 97536)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "b_scenecut", scope: !547, file: !546, line: 119, baseType: !63, size: 32, offset: 97600)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "f_weighted_cost_delta", scope: !547, file: !546, line: 120, baseType: !649, size: 576, offset: 97632)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 576, elements: !634)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_sum", scope: !547, file: !546, line: 121, baseType: !221, size: 32, offset: 98208)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_ssd", scope: !547, file: !546, line: 122, baseType: !652, size: 64, offset: 98240)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !21, line: 27, baseType: !653)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !23, line: 45, baseType: !654)
!654 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "hrd_timing", scope: !547, file: !546, line: 125, baseType: !656, size: 256, offset: 98304)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_hrd_t", file: !66, line: 503, baseType: !657)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !66, line: 496, size: 256, elements: !658)
!658 = !{!659, !661, !662, !663}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_initial_arrival_time", scope: !657, file: !66, line: 498, baseType: !660, size: 64)
!660 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_final_arrival_time", scope: !657, file: !66, line: 499, baseType: !660, size: 64, offset: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_time", scope: !657, file: !66, line: 500, baseType: !660, size: 64, offset: 128)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_time", scope: !657, file: !66, line: 502, baseType: !660, size: 64, offset: 192)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_type", scope: !547, file: !546, line: 128, baseType: !665, size: 2008, offset: 98560)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 2008, elements: !666)
!666 = !{!667}
!667 = !DISubrange(count: 251)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_satd", scope: !547, file: !546, line: 129, baseType: !669, size: 8032, offset: 100576)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 8032, elements: !666)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "f_planned_cpb_duration", scope: !547, file: !546, line: 130, baseType: !671, size: 16064, offset: 108608)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !660, size: 16064, elements: !666)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !547, file: !546, line: 131, baseType: !63, size: 32, offset: 124672)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !547, file: !546, line: 132, baseType: !63, size: 32, offset: 124704)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_completed", scope: !547, file: !546, line: 135, baseType: !63, size: 32, offset: 124736)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_weighted", scope: !547, file: !546, line: 136, baseType: !63, size: 32, offset: 124768)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "i_reference_count", scope: !547, file: !546, line: 137, baseType: !63, size: 32, offset: 124800)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !547, file: !546, line: 138, baseType: !63, size: 32, offset: 124832)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !547, file: !546, line: 139, baseType: !63, size: 32, offset: 124864)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "f_pir_position", scope: !547, file: !546, line: 142, baseType: !164, size: 32, offset: 124896)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_start_col", scope: !547, file: !546, line: 143, baseType: !63, size: 32, offset: 124928)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_end_col", scope: !547, file: !546, line: 144, baseType: !63, size: 32, offset: 124960)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "i_frames_since_pir", scope: !547, file: !546, line: 145, baseType: !63, size: 32, offset: 124992)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !540, file: !68, line: 470, baseType: !684, size: 128, offset: 64)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 128, elements: !169)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "blank_unused", scope: !540, file: !68, line: 473, baseType: !543, size: 64, offset: 192)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !540, file: !68, line: 476, baseType: !687, size: 1152, offset: 256)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !544, size: 1152, elements: !634)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_keyframe", scope: !540, file: !68, line: 478, baseType: !63, size: 32, offset: 1408)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "i_input", scope: !540, file: !68, line: 480, baseType: !63, size: 32, offset: 1440)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dpb", scope: !540, file: !68, line: 482, baseType: !63, size: 32, offset: 1472)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref0", scope: !540, file: !68, line: 483, baseType: !63, size: 32, offset: 1504)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref1", scope: !540, file: !68, line: 484, baseType: !63, size: 32, offset: 1536)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "i_delay", scope: !540, file: !68, line: 485, baseType: !63, size: 32, offset: 1568)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay", scope: !540, file: !68, line: 486, baseType: !63, size: 32, offset: 1600)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay_time", scope: !540, file: !68, line: 487, baseType: !553, size: 64, offset: 1664)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "i_init_delta", scope: !540, file: !68, line: 488, baseType: !553, size: 64, offset: 1728)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_reordered_pts", scope: !540, file: !68, line: 489, baseType: !698, size: 128, offset: 1792)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !553, size: 128, elements: !169)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "i_largest_pts", scope: !540, file: !68, line: 490, baseType: !553, size: 64, offset: 1920)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "i_second_largest_pts", scope: !540, file: !68, line: 491, baseType: !553, size: 64, offset: 1984)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_lowres", scope: !540, file: !68, line: 492, baseType: !63, size: 32, offset: 2048)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_sub8x8_esa", scope: !540, file: !68, line: 493, baseType: !63, size: 32, offset: 2080)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "fenc", scope: !67, file: !68, line: 497, baseType: !544, size: 64, offset: 117440)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "fdec", scope: !67, file: !68, line: 500, baseType: !544, size: 64, offset: 117504)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref0", scope: !67, file: !68, line: 503, baseType: !63, size: 32, offset: 117568)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "fref0", scope: !67, file: !68, line: 504, baseType: !707, size: 1216, offset: 117632)
!707 = !DICompositeType(tag: DW_TAG_array_type, baseType: !544, size: 1216, elements: !708)
!708 = !{!709}
!709 = !DISubrange(count: 19)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref1", scope: !67, file: !68, line: 505, baseType: !63, size: 32, offset: 118848)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "fref1", scope: !67, file: !68, line: 506, baseType: !707, size: 1216, offset: 118912)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_reorder", scope: !67, file: !68, line: 507, baseType: !168, size: 64, offset: 120128)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay", scope: !67, file: !68, line: 510, baseType: !63, size: 32, offset: 120192)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_offset", scope: !67, file: !68, line: 511, baseType: !63, size: 32, offset: 120224)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts_delay", scope: !67, file: !68, line: 512, baseType: !553, size: 64, offset: 120256)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "dct", scope: !67, file: !68, line: 522, baseType: !717, size: 10624, offset: 120320)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !67, file: !68, line: 515, size: 10624, elements: !718)
!718 = !{!719, !721, !724, !727}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "luma16x16_dc", scope: !717, file: !68, line: 517, baseType: !720, size: 256, align: 128)
!720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !484, size: 256, elements: !35)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_dc", scope: !717, file: !68, line: 518, baseType: !722, size: 128, align: 128, offset: 256)
!722 = !DICompositeType(tag: DW_TAG_array_type, baseType: !484, size: 128, elements: !723)
!723 = !{!170, !418}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "luma8x8", scope: !717, file: !68, line: 520, baseType: !725, size: 4096, align: 128, offset: 384)
!725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !484, size: 4096, elements: !726)
!726 = !{!418, !52}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "luma4x4", scope: !717, file: !68, line: 521, baseType: !728, size: 6144, align: 128, offset: 4480)
!728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !484, size: 6144, elements: !729)
!729 = !{!730, !36}
!730 = !DISubrange(count: 24)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !67, file: !68, line: 732, baseType: !732, size: 82688, offset: 130944)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !67, file: !68, line: 525, size: 82688, elements: !733)
!733 = !{!734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !761, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !779, !782, !786, !787, !788, !793, !794, !797, !798, !799, !800, !801, !802, !803, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !863, !894, !895, !896, !897, !898, !899, !900, !901, !902, !905, !906, !907, !910, !913, !915, !918, !920, !921}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !732, file: !68, line: 527, baseType: !63, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_stride", scope: !732, file: !68, line: 530, baseType: !63, size: 32, offset: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_stride", scope: !732, file: !68, line: 531, baseType: !63, size: 32, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_stride", scope: !732, file: !68, line: 532, baseType: !63, size: 32, offset: 96)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_x", scope: !732, file: !68, line: 535, baseType: !63, size: 32, offset: 128)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_y", scope: !732, file: !68, line: 536, baseType: !63, size: 32, offset: 160)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_xy", scope: !732, file: !68, line: 537, baseType: !63, size: 32, offset: 192)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_xy", scope: !732, file: !68, line: 538, baseType: !63, size: 32, offset: 224)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_xy", scope: !732, file: !68, line: 539, baseType: !63, size: 32, offset: 256)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !732, file: !68, line: 542, baseType: !63, size: 32, offset: 288)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !732, file: !68, line: 543, baseType: !63, size: 32, offset: 320)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !732, file: !68, line: 544, baseType: !63, size: 32, offset: 352)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "b_trellis", scope: !732, file: !68, line: 545, baseType: !63, size: 32, offset: 384)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "b_noise_reduction", scope: !732, file: !68, line: 546, baseType: !63, size: 32, offset: 416)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !732, file: !68, line: 547, baseType: !63, size: 32, offset: 448)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_rd", scope: !732, file: !68, line: 548, baseType: !63, size: 32, offset: 480)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_trellis", scope: !732, file: !68, line: 549, baseType: !63, size: 32, offset: 512)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !732, file: !68, line: 551, baseType: !63, size: 32, offset: 544)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min", scope: !732, file: !68, line: 554, baseType: !168, size: 64, offset: 576)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max", scope: !732, file: !68, line: 555, baseType: !168, size: 64, offset: 640)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_spel", scope: !732, file: !68, line: 558, baseType: !168, size: 64, offset: 704)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_spel", scope: !732, file: !68, line: 559, baseType: !168, size: 64, offset: 768)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_fpel", scope: !732, file: !68, line: 561, baseType: !168, size: 64, offset: 832)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_fpel", scope: !732, file: !68, line: 562, baseType: !168, size: 64, offset: 896)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour", scope: !732, file: !68, line: 565, baseType: !7, size: 32, offset: 960)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour8", scope: !732, file: !68, line: 566, baseType: !760, size: 128, offset: 992)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128, elements: !417)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour4", scope: !732, file: !68, line: 567, baseType: !762, size: 512, offset: 1120)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 512, elements: !35)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_intra", scope: !732, file: !68, line: 568, baseType: !7, size: 32, offset: 1632)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_frame", scope: !732, file: !68, line: 569, baseType: !7, size: 32, offset: 1664)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_top", scope: !732, file: !68, line: 570, baseType: !63, size: 32, offset: 1696)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_left", scope: !732, file: !68, line: 571, baseType: !63, size: 32, offset: 1728)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topleft", scope: !732, file: !68, line: 572, baseType: !63, size: 32, offset: 1760)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topright", scope: !732, file: !68, line: 573, baseType: !63, size: 32, offset: 1792)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_prev_xy", scope: !732, file: !68, line: 574, baseType: !63, size: 32, offset: 1824)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_left_xy", scope: !732, file: !68, line: 575, baseType: !63, size: 32, offset: 1856)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_top_xy", scope: !732, file: !68, line: 576, baseType: !63, size: 32, offset: 1888)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topleft_xy", scope: !732, file: !68, line: 577, baseType: !63, size: 32, offset: 1920)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topright_xy", scope: !732, file: !68, line: 578, baseType: !63, size: 32, offset: 1952)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !732, file: !68, line: 585, baseType: !601, size: 64, offset: 1984)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "partition", scope: !732, file: !68, line: 586, baseType: !260, size: 64, offset: 2048)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !732, file: !68, line: 587, baseType: !601, size: 64, offset: 2112)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !732, file: !68, line: 588, baseType: !778, size: 64, offset: 2176)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !732, file: !68, line: 589, baseType: !780, size: 64, offset: 2240)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 64, elements: !488)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !732, file: !68, line: 591, baseType: !783, size: 64, offset: 2304)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 192, elements: !785)
!785 = !{!730}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_pred_mode", scope: !732, file: !68, line: 592, baseType: !601, size: 64, offset: 2368)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !732, file: !68, line: 593, baseType: !607, size: 128, offset: 2432)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !732, file: !68, line: 594, baseType: !789, size: 128, offset: 2560)
!789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !790, size: 128, elements: !169)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 128, elements: !792)
!792 = !{!489, !170}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !732, file: !68, line: 595, baseType: !623, size: 128, offset: 2688)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "mvr", scope: !732, file: !68, line: 596, baseType: !795, size: 4096, offset: 2816)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !608, size: 4096, elements: !796)
!796 = !{!170, !505}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "skipbp", scope: !732, file: !68, line: 597, baseType: !601, size: 64, offset: 6912)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "mb_transform_size", scope: !732, file: !68, line: 598, baseType: !601, size: 64, offset: 6976)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "slice_table", scope: !732, file: !68, line: 599, baseType: !437, size: 64, offset: 7040)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "p_weight_buf", scope: !732, file: !68, line: 603, baseType: !596, size: 1024, offset: 7104)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !732, file: !68, line: 606, baseType: !63, size: 32, offset: 8128)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "i_partition", scope: !732, file: !68, line: 607, baseType: !63, size: 32, offset: 8160)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "i_sub_partition", scope: !732, file: !68, line: 608, baseType: !804, size: 32, align: 32, offset: 8192)
!804 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 32, elements: !417)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !732, file: !68, line: 609, baseType: !63, size: 32, offset: 8224)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_luma", scope: !732, file: !68, line: 611, baseType: !63, size: 32, offset: 8256)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_chroma", scope: !732, file: !68, line: 612, baseType: !63, size: 32, offset: 8288)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra16x16_pred_mode", scope: !732, file: !68, line: 614, baseType: !63, size: 32, offset: 8320)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_pred_mode", scope: !732, file: !68, line: 615, baseType: !63, size: 32, offset: 8352)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "i_skip_intra", scope: !732, file: !68, line: 621, baseType: !63, size: 32, offset: 8384)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "b_skip_mc", scope: !732, file: !68, line: 624, baseType: !63, size: 32, offset: 8416)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "b_reencode_mb", scope: !732, file: !68, line: 626, baseType: !63, size: 32, offset: 8448)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "ip_offset", scope: !732, file: !68, line: 627, baseType: !63, size: 32, offset: 8480)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "pic", scope: !732, file: !68, line: 671, baseType: !815, size: 60672, offset: 8576)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !732, file: !68, line: 629, size: 60672, elements: !816)
!816 = !{!817, !821, !825, !827, !828, !831, !835, !837, !838, !839, !840, !841, !844, !848, !851, !852, !853, !854, !855, !858, !860, !862}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_buf", scope: !815, file: !68, line: 634, baseType: !818, size: 3072, align: 128)
!818 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 3072, elements: !819)
!819 = !{!820}
!820 = !DISubrange(count: 384)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "fdec_buf", scope: !815, file: !68, line: 635, baseType: !822, size: 6912, align: 128, offset: 3072)
!822 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 6912, elements: !823)
!823 = !{!824}
!824 = !DISubrange(count: 864)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_fdec_buf", scope: !815, file: !68, line: 638, baseType: !826, size: 2048, align: 128, offset: 9984)
!826 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 2048, elements: !312)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_fdec_buf", scope: !815, file: !68, line: 639, baseType: !826, size: 2048, align: 128, offset: 12032)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_dct_buf", scope: !815, file: !68, line: 640, baseType: !829, size: 3072, align: 128, offset: 14080)
!829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !484, size: 3072, elements: !830)
!830 = !{!27, !52}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_dct_buf", scope: !815, file: !68, line: 641, baseType: !832, size: 3840, align: 128, offset: 17152)
!832 = !DICompositeType(tag: DW_TAG_array_type, baseType: !484, size: 3840, elements: !833)
!833 = !{!834, !36}
!834 = !DISubrange(count: 15)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_nnz_buf", scope: !815, file: !68, line: 642, baseType: !836, size: 128, offset: 20992)
!836 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 128, elements: !417)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_nnz_buf", scope: !815, file: !68, line: 643, baseType: !836, size: 128, offset: 21120)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_cbp", scope: !815, file: !68, line: 644, baseType: !63, size: 32, offset: 21248)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_cbp", scope: !815, file: !68, line: 645, baseType: !63, size: 32, offset: 21280)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct8", scope: !815, file: !68, line: 648, baseType: !725, size: 4096, align: 128, offset: 21376)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct4", scope: !815, file: !68, line: 649, baseType: !842, size: 4096, align: 128, offset: 25472)
!842 = !DICompositeType(tag: DW_TAG_array_type, baseType: !484, size: 4096, elements: !843)
!843 = !{!36, !36}
