; ModuleID = 'x264_src/common/common.c'
source_filename = "x264_src/common/common.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.x264_cpu_name_t = type { [16 x i8], i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.x264_param_t = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.anon, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, [16 x i8], [16 x i8], [16 x i8], [16 x i8], [64 x i8], [64 x i8], void (i8*, i32, i8*, %struct.__va_list_tag*)*, i8*, i32, i32, i8*, %struct.anon.0, %struct.anon.1, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, void (i8*)* }
%struct.anon = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.anon.0 = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, float, float, i32, [2 x i32], i32, i32 }

!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 192, elements: !55)
!55 = !{!56}
!56 = !DISubrange(count: 3)
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(name: "x264_colorprim_names", scope: !2, file: !22, line: 118, type: !59, isLocal: true, isDefinition: true)
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 640, elements: !60)
!60 = !{!61}
!61 = !DISubrange(count: 10)
!62 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression())
!63 = distinct !DIGlobalVariable(name: "x264_transfer_names", scope: !2, file: !22, line: 119, type: !64, isLocal: true, isDefinition: true)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 768, elements: !65)
!65 = !{!66}
!66 = !DISubrange(count: 12)
!67 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression())
!68 = distinct !DIGlobalVariable(name: "x264_colmatrix_names", scope: !2, file: !22, line: 120, type: !59, isLocal: true, isDefinition: true)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "x264_b_pyramid_names", scope: !2, file: !22, line: 114, type: !71, isLocal: true, isDefinition: true)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 256, elements: !72)
!72 = !{!73}
!73 = !DISubrange(count: 4)
!74 = !DIGlobalVariableExpression(var: !75, expr: !DIExpression())
!75 = distinct !DIGlobalVariable(name: "x264_direct_pred_names", scope: !2, file: !22, line: 112, type: !76, isLocal: true, isDefinition: true)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 320, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: 5)
!79 = !DIGlobalVariableExpression(var: !80, expr: !DIExpression())
!80 = distinct !DIGlobalVariable(name: "x264_motion_est_names", scope: !2, file: !22, line: 113, type: !81, isLocal: true, isDefinition: true)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 384, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 6)
!84 = !DIGlobalVariableExpression(var: !85, expr: !DIExpression())
!85 = distinct !DIGlobalVariable(name: "x264_nal_hrd_names", scope: !2, file: !22, line: 121, type: !71, isLocal: true, isDefinition: true)
!86 = !{i32 7, !"Dwarf Version", i32 4}
!87 = !{i32 2, !"Debug Info Version", i32 3}
!88 = !{i32 1, !"wchar_size", i32 4}
!89 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!90 = distinct !DISubprogram(name: "spec_strdup", scope: !3, file: !3, line: 35, type: !91, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !93)
!91 = !DISubroutineType(types: !92)
!92 = !{!33, !48}
!93 = !{}
!94 = !DILocalVariable(name: "str", arg: 1, scope: !90, file: !3, line: 35, type: !48)
!95 = !DILocation(line: 35, column: 33, scope: !90)
!96 = !DILocalVariable(name: "len", scope: !90, file: !3, line: 36, type: !36)
!97 = !DILocation(line: 36, column: 9, scope: !90)
!98 = !DILocation(line: 36, column: 20, scope: !90)
!99 = !DILocation(line: 36, column: 13, scope: !90)
!100 = !DILocalVariable(name: "newstr", scope: !90, file: !3, line: 37, type: !33)
!101 = !DILocation(line: 37, column: 12, scope: !90)
!102 = !DILocation(line: 37, column: 39, scope: !90)
!103 = !DILocation(line: 37, column: 38, scope: !90)
!104 = !DILocation(line: 37, column: 36, scope: !90)
!105 = !DILocation(line: 37, column: 43, scope: !90)
!106 = !DILocation(line: 37, column: 29, scope: !90)
!107 = !DILocalVariable(name: "i", scope: !108, file: !3, line: 38, type: !36)
!108 = distinct !DILexicalBlock(scope: !90, file: !3, line: 38, column: 5)
!109 = !DILocation(line: 38, column: 14, scope: !108)
!110 = !DILocation(line: 38, column: 10, scope: !108)
!111 = !DILocation(line: 38, column: 21, scope: !112)
!112 = distinct !DILexicalBlock(scope: !108, file: !3, line: 38, column: 5)
!113 = !DILocation(line: 38, column: 25, scope: !112)
!114 = !DILocation(line: 38, column: 23, scope: !112)
!115 = !DILocation(line: 38, column: 5, scope: !108)
!116 = !DILocation(line: 39, column: 16, scope: !117)
!117 = distinct !DILexicalBlock(scope: !112, file: !3, line: 38, column: 35)
!118 = !DILocation(line: 39, column: 20, scope: !117)
!119 = !DILocation(line: 39, column: 6, scope: !117)
!120 = !DILocation(line: 39, column: 13, scope: !117)
!121 = !DILocation(line: 39, column: 15, scope: !117)
!122 = !DILocation(line: 40, column: 5, scope: !117)
!123 = !DILocation(line: 38, column: 30, scope: !112)
!124 = !DILocation(line: 38, column: 5, scope: !112)
!125 = distinct !{!125, !115, !126}
!126 = !DILocation(line: 40, column: 5, scope: !108)
!127 = !DILocation(line: 41, column: 5, scope: !90)
!128 = !DILocation(line: 41, column: 12, scope: !90)
!129 = !DILocation(line: 41, column: 16, scope: !90)
!130 = !DILocation(line: 42, column: 12, scope: !90)
!131 = !DILocation(line: 42, column: 5, scope: !90)
!132 = distinct !DISubprogram(name: "x264_param_default", scope: !3, file: !3, line: 51, type: !133, scopeLine: 52, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !93)
!133 = !DISubroutineType(types: !134)
!134 = !{null, !135}
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !22, line: 376, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !22, line: 176, size: 5632, elements: !138)
!138 = !{!139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !189, !190, !191, !192, !196, !197, !208, !209, !210, !211, !212, !243, !285, !286, !287, !288, !289, !290, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !137, file: !22, line: 179, baseType: !7, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !137, file: !22, line: 180, baseType: !36, size: 32, offset: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !137, file: !22, line: 181, baseType: !36, size: 32, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !137, file: !22, line: 182, baseType: !36, size: 32, offset: 96)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !137, file: !22, line: 183, baseType: !36, size: 32, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !137, file: !22, line: 186, baseType: !36, size: 32, offset: 160)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !137, file: !22, line: 187, baseType: !36, size: 32, offset: 192)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !137, file: !22, line: 188, baseType: !36, size: 32, offset: 224)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !137, file: !22, line: 189, baseType: !36, size: 32, offset: 256)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !137, file: !22, line: 190, baseType: !36, size: 32, offset: 288)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !137, file: !22, line: 198, baseType: !36, size: 32, offset: 320)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !137, file: !22, line: 215, baseType: !151, size: 288, offset: 352)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !137, file: !22, line: 200, size: 288, elements: !152)
!152 = !{!153, !154, !155, !156, !157, !158, !159, !160, !161}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !151, file: !22, line: 203, baseType: !36, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !151, file: !22, line: 204, baseType: !36, size: 32, offset: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !151, file: !22, line: 206, baseType: !36, size: 32, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !151, file: !22, line: 209, baseType: !36, size: 32, offset: 96)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !151, file: !22, line: 210, baseType: !36, size: 32, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !151, file: !22, line: 211, baseType: !36, size: 32, offset: 160)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !151, file: !22, line: 212, baseType: !36, size: 32, offset: 192)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !151, file: !22, line: 213, baseType: !36, size: 32, offset: 224)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !151, file: !22, line: 214, baseType: !36, size: 32, offset: 256)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !137, file: !22, line: 218, baseType: !36, size: 32, offset: 640)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !137, file: !22, line: 219, baseType: !36, size: 32, offset: 672)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !137, file: !22, line: 220, baseType: !36, size: 32, offset: 704)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !137, file: !22, line: 221, baseType: !36, size: 32, offset: 736)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !137, file: !22, line: 222, baseType: !36, size: 32, offset: 768)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !137, file: !22, line: 224, baseType: !36, size: 32, offset: 800)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !137, file: !22, line: 225, baseType: !36, size: 32, offset: 832)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !137, file: !22, line: 226, baseType: !36, size: 32, offset: 864)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !137, file: !22, line: 227, baseType: !36, size: 32, offset: 896)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !137, file: !22, line: 229, baseType: !36, size: 32, offset: 928)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !137, file: !22, line: 230, baseType: !36, size: 32, offset: 960)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !137, file: !22, line: 231, baseType: !36, size: 32, offset: 992)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !137, file: !22, line: 233, baseType: !36, size: 32, offset: 1024)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !137, file: !22, line: 234, baseType: !36, size: 32, offset: 1056)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !137, file: !22, line: 236, baseType: !36, size: 32, offset: 1088)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !137, file: !22, line: 237, baseType: !36, size: 32, offset: 1120)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !137, file: !22, line: 239, baseType: !36, size: 32, offset: 1152)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !137, file: !22, line: 240, baseType: !33, size: 64, offset: 1216)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !137, file: !22, line: 241, baseType: !181, size: 128, offset: 1280)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 128, elements: !187)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !183, line: 24, baseType: !184)
!183 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !185, line: 38, baseType: !186)
!185 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!186 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!187 = !{!188}
!188 = !DISubrange(count: 16)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !137, file: !22, line: 242, baseType: !181, size: 128, offset: 1408)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !137, file: !22, line: 243, baseType: !181, size: 128, offset: 1536)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !137, file: !22, line: 244, baseType: !181, size: 128, offset: 1664)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !137, file: !22, line: 245, baseType: !193, size: 512, offset: 1792)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 512, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !137, file: !22, line: 246, baseType: !193, size: 512, offset: 2304)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !137, file: !22, line: 249, baseType: !198, size: 64, offset: 2816)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{null, !35, !36, !48, !201}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 43, size: 192, elements: !203)
!203 = !{!204, !205, !206, !207}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !202, file: !3, line: 43, baseType: !7, size: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !202, file: !3, line: 43, baseType: !7, size: 32, offset: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !202, file: !3, line: 43, baseType: !35, size: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !202, file: !3, line: 43, baseType: !35, size: 64, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !137, file: !22, line: 250, baseType: !35, size: 64, offset: 2880)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !137, file: !22, line: 251, baseType: !36, size: 32, offset: 2944)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !137, file: !22, line: 252, baseType: !36, size: 32, offset: 2976)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !137, file: !22, line: 253, baseType: !33, size: 64, offset: 3008)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !137, file: !22, line: 287, baseType: !213, size: 800, offset: 3072)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !137, file: !22, line: 256, size: 800, elements: !214)
!214 = !{!215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !235, !236, !237, !241, !242}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !213, file: !22, line: 258, baseType: !7, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !213, file: !22, line: 259, baseType: !7, size: 32, offset: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !213, file: !22, line: 261, baseType: !36, size: 32, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !213, file: !22, line: 262, baseType: !36, size: 32, offset: 96)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !213, file: !22, line: 263, baseType: !36, size: 32, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !213, file: !22, line: 264, baseType: !36, size: 32, offset: 160)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !213, file: !22, line: 265, baseType: !36, size: 32, offset: 192)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !213, file: !22, line: 267, baseType: !36, size: 32, offset: 224)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !213, file: !22, line: 268, baseType: !36, size: 32, offset: 256)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !213, file: !22, line: 269, baseType: !36, size: 32, offset: 288)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !213, file: !22, line: 270, baseType: !36, size: 32, offset: 320)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !213, file: !22, line: 271, baseType: !36, size: 32, offset: 352)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !213, file: !22, line: 272, baseType: !36, size: 32, offset: 384)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !213, file: !22, line: 273, baseType: !36, size: 32, offset: 416)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !213, file: !22, line: 274, baseType: !36, size: 32, offset: 448)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !213, file: !22, line: 275, baseType: !36, size: 32, offset: 480)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !213, file: !22, line: 276, baseType: !36, size: 32, offset: 512)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !213, file: !22, line: 277, baseType: !36, size: 32, offset: 544)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !213, file: !22, line: 278, baseType: !234, size: 32, offset: 576)
!234 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !213, file: !22, line: 279, baseType: !234, size: 32, offset: 608)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !213, file: !22, line: 280, baseType: !36, size: 32, offset: 640)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !213, file: !22, line: 283, baseType: !238, size: 64, offset: 672)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 64, elements: !239)
!239 = !{!240}
!240 = !DISubrange(count: 2)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !213, file: !22, line: 285, baseType: !36, size: 32, offset: 736)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !213, file: !22, line: 286, baseType: !36, size: 32, offset: 768)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !137, file: !22, line: 327, baseType: !244, size: 1152, offset: 3904)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !137, file: !22, line: 290, size: 1152, elements: !245)
!245 = !{!246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !283, !284}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !244, file: !22, line: 292, baseType: !36, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !244, file: !22, line: 294, baseType: !36, size: 32, offset: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !244, file: !22, line: 295, baseType: !36, size: 32, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !244, file: !22, line: 296, baseType: !36, size: 32, offset: 96)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !244, file: !22, line: 297, baseType: !36, size: 32, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !244, file: !22, line: 299, baseType: !36, size: 32, offset: 160)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !244, file: !22, line: 300, baseType: !234, size: 32, offset: 192)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !244, file: !22, line: 301, baseType: !234, size: 32, offset: 224)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !244, file: !22, line: 302, baseType: !234, size: 32, offset: 256)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !244, file: !22, line: 303, baseType: !36, size: 32, offset: 288)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !244, file: !22, line: 304, baseType: !36, size: 32, offset: 320)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !244, file: !22, line: 305, baseType: !234, size: 32, offset: 352)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !244, file: !22, line: 306, baseType: !234, size: 32, offset: 384)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !244, file: !22, line: 307, baseType: !234, size: 32, offset: 416)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !244, file: !22, line: 309, baseType: !36, size: 32, offset: 448)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !244, file: !22, line: 310, baseType: !234, size: 32, offset: 480)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !244, file: !22, line: 311, baseType: !36, size: 32, offset: 512)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !244, file: !22, line: 312, baseType: !36, size: 32, offset: 544)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !244, file: !22, line: 315, baseType: !36, size: 32, offset: 576)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !244, file: !22, line: 316, baseType: !33, size: 64, offset: 640)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !244, file: !22, line: 317, baseType: !36, size: 32, offset: 704)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !244, file: !22, line: 318, baseType: !33, size: 64, offset: 768)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !244, file: !22, line: 321, baseType: !234, size: 32, offset: 832)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !244, file: !22, line: 322, baseType: !234, size: 32, offset: 864)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !244, file: !22, line: 323, baseType: !234, size: 32, offset: 896)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !244, file: !22, line: 324, baseType: !272, size: 64, offset: 960)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !22, line: 174, baseType: !274)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 167, size: 256, elements: !275)
!275 = !{!276, !277, !278, !279, !280, !281}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !274, file: !22, line: 169, baseType: !36, size: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !274, file: !22, line: 169, baseType: !36, size: 32, offset: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !274, file: !22, line: 170, baseType: !36, size: 32, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !274, file: !22, line: 171, baseType: !36, size: 32, offset: 96)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !274, file: !22, line: 172, baseType: !234, size: 32, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !274, file: !22, line: 173, baseType: !282, size: 64, offset: 192)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !244, file: !22, line: 325, baseType: !36, size: 32, offset: 1024)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !244, file: !22, line: 326, baseType: !33, size: 64, offset: 1088)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !137, file: !22, line: 330, baseType: !36, size: 32, offset: 5056)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !137, file: !22, line: 331, baseType: !36, size: 32, offset: 5088)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !137, file: !22, line: 332, baseType: !36, size: 32, offset: 5120)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !137, file: !22, line: 334, baseType: !36, size: 32, offset: 5152)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !137, file: !22, line: 335, baseType: !36, size: 32, offset: 5184)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !137, file: !22, line: 336, baseType: !291, size: 32, offset: 5216)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !183, line: 26, baseType: !292)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !185, line: 42, baseType: !7)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !137, file: !22, line: 337, baseType: !291, size: 32, offset: 5248)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !137, file: !22, line: 338, baseType: !291, size: 32, offset: 5280)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !137, file: !22, line: 339, baseType: !291, size: 32, offset: 5312)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !137, file: !22, line: 340, baseType: !36, size: 32, offset: 5344)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !137, file: !22, line: 344, baseType: !36, size: 32, offset: 5376)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !137, file: !22, line: 356, baseType: !36, size: 32, offset: 5408)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !137, file: !22, line: 364, baseType: !36, size: 32, offset: 5440)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !137, file: !22, line: 367, baseType: !36, size: 32, offset: 5472)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !137, file: !22, line: 368, baseType: !36, size: 32, offset: 5504)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !137, file: !22, line: 369, baseType: !36, size: 32, offset: 5536)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !137, file: !22, line: 375, baseType: !304, size: 64, offset: 5568)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{null, !35}
!307 = !DILocalVariable(name: "param", arg: 1, scope: !132, file: !3, line: 51, type: !135)
!308 = !DILocation(line: 51, column: 40, scope: !132)
!309 = !DILocation(line: 54, column: 13, scope: !132)
!310 = !DILocation(line: 54, column: 5, scope: !132)
!311 = !DILocation(line: 57, column: 18, scope: !132)
!312 = !DILocation(line: 57, column: 5, scope: !132)
!313 = !DILocation(line: 57, column: 12, scope: !132)
!314 = !DILocation(line: 57, column: 16, scope: !132)
!315 = !DILocation(line: 58, column: 5, scope: !132)
!316 = !DILocation(line: 58, column: 12, scope: !132)
!317 = !DILocation(line: 58, column: 22, scope: !132)
!318 = !DILocation(line: 59, column: 5, scope: !132)
!319 = !DILocation(line: 59, column: 12, scope: !132)
!320 = !DILocation(line: 59, column: 28, scope: !132)
!321 = !DILocation(line: 60, column: 5, scope: !132)
!322 = !DILocation(line: 60, column: 12, scope: !132)
!323 = !DILocation(line: 60, column: 29, scope: !132)
!324 = !DILocation(line: 63, column: 5, scope: !132)
!325 = !DILocation(line: 63, column: 12, scope: !132)
!326 = !DILocation(line: 63, column: 28, scope: !132)
!327 = !DILocation(line: 64, column: 5, scope: !132)
!328 = !DILocation(line: 64, column: 12, scope: !132)
!329 = !DILocation(line: 64, column: 28, scope: !132)
!330 = !DILocation(line: 65, column: 5, scope: !132)
!331 = !DILocation(line: 65, column: 12, scope: !132)
!332 = !DILocation(line: 65, column: 28, scope: !132)
!333 = !DILocation(line: 66, column: 5, scope: !132)
!334 = !DILocation(line: 66, column: 12, scope: !132)
!335 = !DILocation(line: 66, column: 16, scope: !132)
!336 = !DILocation(line: 66, column: 28, scope: !132)
!337 = !DILocation(line: 67, column: 5, scope: !132)
!338 = !DILocation(line: 67, column: 12, scope: !132)
!339 = !DILocation(line: 67, column: 16, scope: !132)
!340 = !DILocation(line: 67, column: 28, scope: !132)
!341 = !DILocation(line: 68, column: 5, scope: !132)
!342 = !DILocation(line: 68, column: 12, scope: !132)
!343 = !DILocation(line: 68, column: 16, scope: !132)
!344 = !DILocation(line: 68, column: 28, scope: !132)
!345 = !DILocation(line: 69, column: 5, scope: !132)
!346 = !DILocation(line: 69, column: 12, scope: !132)
!347 = !DILocation(line: 69, column: 16, scope: !132)
!348 = !DILocation(line: 69, column: 28, scope: !132)
!349 = !DILocation(line: 70, column: 5, scope: !132)
!350 = !DILocation(line: 70, column: 12, scope: !132)
!351 = !DILocation(line: 70, column: 16, scope: !132)
!352 = !DILocation(line: 70, column: 28, scope: !132)
!353 = !DILocation(line: 71, column: 5, scope: !132)
!354 = !DILocation(line: 71, column: 12, scope: !132)
!355 = !DILocation(line: 71, column: 16, scope: !132)
!356 = !DILocation(line: 71, column: 28, scope: !132)
!357 = !DILocation(line: 72, column: 5, scope: !132)
!358 = !DILocation(line: 72, column: 12, scope: !132)
!359 = !DILocation(line: 72, column: 16, scope: !132)
!360 = !DILocation(line: 72, column: 28, scope: !132)
!361 = !DILocation(line: 73, column: 5, scope: !132)
!362 = !DILocation(line: 73, column: 12, scope: !132)
!363 = !DILocation(line: 73, column: 16, scope: !132)
!364 = !DILocation(line: 73, column: 28, scope: !132)
!365 = !DILocation(line: 74, column: 5, scope: !132)
!366 = !DILocation(line: 74, column: 12, scope: !132)
!367 = !DILocation(line: 74, column: 16, scope: !132)
!368 = !DILocation(line: 74, column: 28, scope: !132)
!369 = !DILocation(line: 75, column: 5, scope: !132)
!370 = !DILocation(line: 75, column: 12, scope: !132)
!371 = !DILocation(line: 75, column: 28, scope: !132)
!372 = !DILocation(line: 76, column: 5, scope: !132)
!373 = !DILocation(line: 76, column: 12, scope: !132)
!374 = !DILocation(line: 76, column: 28, scope: !132)
!375 = !DILocation(line: 77, column: 5, scope: !132)
!376 = !DILocation(line: 77, column: 12, scope: !132)
!377 = !DILocation(line: 77, column: 28, scope: !132)
!378 = !DILocation(line: 78, column: 5, scope: !132)
!379 = !DILocation(line: 78, column: 12, scope: !132)
!380 = !DILocation(line: 78, column: 29, scope: !132)
!381 = !DILocation(line: 79, column: 5, scope: !132)
!382 = !DILocation(line: 79, column: 12, scope: !132)
!383 = !DILocation(line: 79, column: 28, scope: !132)
!384 = !DILocation(line: 80, column: 5, scope: !132)
!385 = !DILocation(line: 80, column: 12, scope: !132)
!386 = !DILocation(line: 80, column: 26, scope: !132)
!387 = !DILocation(line: 83, column: 5, scope: !132)
!388 = !DILocation(line: 83, column: 12, scope: !132)
!389 = !DILocation(line: 83, column: 30, scope: !132)
!390 = !DILocation(line: 84, column: 5, scope: !132)
!391 = !DILocation(line: 84, column: 12, scope: !132)
!392 = !DILocation(line: 84, column: 25, scope: !132)
!393 = !DILocation(line: 85, column: 5, scope: !132)
!394 = !DILocation(line: 85, column: 12, scope: !132)
!395 = !DILocation(line: 85, column: 25, scope: !132)
!396 = !DILocation(line: 86, column: 5, scope: !132)
!397 = !DILocation(line: 86, column: 12, scope: !132)
!398 = !DILocation(line: 86, column: 21, scope: !132)
!399 = !DILocation(line: 87, column: 5, scope: !132)
!400 = !DILocation(line: 87, column: 12, scope: !132)
!401 = !DILocation(line: 87, column: 33, scope: !132)
!402 = !DILocation(line: 88, column: 5, scope: !132)
!403 = !DILocation(line: 88, column: 12, scope: !132)
!404 = !DILocation(line: 88, column: 30, scope: !132)
!405 = !DILocation(line: 89, column: 5, scope: !132)
!406 = !DILocation(line: 89, column: 12, scope: !132)
!407 = !DILocation(line: 89, column: 26, scope: !132)
!408 = !DILocation(line: 90, column: 5, scope: !132)
!409 = !DILocation(line: 90, column: 12, scope: !132)
!410 = !DILocation(line: 90, column: 29, scope: !132)
!411 = !DILocation(line: 91, column: 5, scope: !132)
!412 = !DILocation(line: 91, column: 12, scope: !132)
!413 = !DILocation(line: 91, column: 25, scope: !132)
!414 = !DILocation(line: 92, column: 5, scope: !132)
!415 = !DILocation(line: 92, column: 12, scope: !132)
!416 = !DILocation(line: 92, column: 32, scope: !132)
!417 = !DILocation(line: 94, column: 5, scope: !132)
!418 = !DILocation(line: 94, column: 12, scope: !132)
!419 = !DILocation(line: 94, column: 32, scope: !132)
!420 = !DILocation(line: 95, column: 5, scope: !132)
!421 = !DILocation(line: 95, column: 12, scope: !132)
!422 = !DILocation(line: 95, column: 40, scope: !132)
!423 = !DILocation(line: 96, column: 5, scope: !132)
!424 = !DILocation(line: 96, column: 12, scope: !132)
!425 = !DILocation(line: 96, column: 37, scope: !132)
!426 = !DILocation(line: 98, column: 5, scope: !132)
!427 = !DILocation(line: 98, column: 12, scope: !132)
!428 = !DILocation(line: 98, column: 20, scope: !132)
!429 = !DILocation(line: 99, column: 5, scope: !132)
!430 = !DILocation(line: 99, column: 12, scope: !132)
!431 = !DILocation(line: 99, column: 29, scope: !132)
!432 = !DILocation(line: 101, column: 5, scope: !132)
!433 = !DILocation(line: 101, column: 12, scope: !132)
!434 = !DILocation(line: 101, column: 15, scope: !132)
!435 = !DILocation(line: 101, column: 27, scope: !132)
!436 = !DILocation(line: 102, column: 5, scope: !132)
!437 = !DILocation(line: 102, column: 12, scope: !132)
!438 = !DILocation(line: 102, column: 15, scope: !132)
!439 = !DILocation(line: 102, column: 25, scope: !132)
!440 = !DILocation(line: 103, column: 5, scope: !132)
!441 = !DILocation(line: 103, column: 12, scope: !132)
!442 = !DILocation(line: 103, column: 15, scope: !132)
!443 = !DILocation(line: 103, column: 32, scope: !132)
!444 = !DILocation(line: 104, column: 5, scope: !132)
!445 = !DILocation(line: 104, column: 12, scope: !132)
!446 = !DILocation(line: 104, column: 15, scope: !132)
!447 = !DILocation(line: 104, column: 33, scope: !132)
!448 = !DILocation(line: 105, column: 5, scope: !132)
!449 = !DILocation(line: 105, column: 12, scope: !132)
!450 = !DILocation(line: 105, column: 15, scope: !132)
!451 = !DILocation(line: 105, column: 33, scope: !132)
!452 = !DILocation(line: 106, column: 5, scope: !132)
!453 = !DILocation(line: 106, column: 12, scope: !132)
!454 = !DILocation(line: 106, column: 15, scope: !132)
!455 = !DILocation(line: 106, column: 33, scope: !132)
!456 = !DILocation(line: 107, column: 5, scope: !132)
!457 = !DILocation(line: 107, column: 12, scope: !132)
!458 = !DILocation(line: 107, column: 15, scope: !132)
!459 = !DILocation(line: 107, column: 29, scope: !132)
!460 = !DILocation(line: 108, column: 5, scope: !132)
!461 = !DILocation(line: 108, column: 12, scope: !132)
!462 = !DILocation(line: 108, column: 15, scope: !132)
!463 = !DILocation(line: 108, column: 29, scope: !132)
!464 = !DILocation(line: 109, column: 5, scope: !132)
!465 = !DILocation(line: 109, column: 12, scope: !132)
!466 = !DILocation(line: 109, column: 15, scope: !132)
!467 = !DILocation(line: 109, column: 24, scope: !132)
!468 = !DILocation(line: 110, column: 5, scope: !132)
!469 = !DILocation(line: 110, column: 12, scope: !132)
!470 = !DILocation(line: 110, column: 15, scope: !132)
!471 = !DILocation(line: 110, column: 24, scope: !132)
!472 = !DILocation(line: 111, column: 5, scope: !132)
!473 = !DILocation(line: 111, column: 12, scope: !132)
!474 = !DILocation(line: 111, column: 15, scope: !132)
!475 = !DILocation(line: 111, column: 25, scope: !132)
!476 = !DILocation(line: 112, column: 5, scope: !132)
!477 = !DILocation(line: 112, column: 12, scope: !132)
!478 = !DILocation(line: 112, column: 15, scope: !132)
!479 = !DILocation(line: 112, column: 27, scope: !132)
!480 = !DILocation(line: 113, column: 5, scope: !132)
!481 = !DILocation(line: 113, column: 12, scope: !132)
!482 = !DILocation(line: 113, column: 15, scope: !132)
!483 = !DILocation(line: 113, column: 27, scope: !132)
!484 = !DILocation(line: 114, column: 5, scope: !132)
!485 = !DILocation(line: 114, column: 12, scope: !132)
!486 = !DILocation(line: 114, column: 15, scope: !132)
!487 = !DILocation(line: 114, column: 25, scope: !132)
!488 = !DILocation(line: 115, column: 5, scope: !132)
!489 = !DILocation(line: 115, column: 12, scope: !132)
!490 = !DILocation(line: 115, column: 15, scope: !132)
!491 = !DILocation(line: 115, column: 29, scope: !132)
!492 = !DILocation(line: 116, column: 5, scope: !132)
!493 = !DILocation(line: 116, column: 12, scope: !132)
!494 = !DILocation(line: 116, column: 15, scope: !132)
!495 = !DILocation(line: 116, column: 27, scope: !132)
!496 = !DILocation(line: 118, column: 5, scope: !132)
!497 = !DILocation(line: 118, column: 12, scope: !132)
!498 = !DILocation(line: 118, column: 15, scope: !132)
!499 = !DILocation(line: 118, column: 28, scope: !132)
!500 = !DILocation(line: 119, column: 5, scope: !132)
!501 = !DILocation(line: 119, column: 12, scope: !132)
!502 = !DILocation(line: 119, column: 15, scope: !132)
!503 = !DILocation(line: 119, column: 28, scope: !132)
!504 = !DILocation(line: 120, column: 5, scope: !132)
!505 = !DILocation(line: 120, column: 12, scope: !132)
!506 = !DILocation(line: 120, column: 15, scope: !132)
!507 = !DILocation(line: 120, column: 27, scope: !132)
!508 = !DILocation(line: 121, column: 5, scope: !132)
!509 = !DILocation(line: 121, column: 12, scope: !132)
!510 = !DILocation(line: 121, column: 15, scope: !132)
!511 = !DILocation(line: 121, column: 27, scope: !132)
!512 = !DILocation(line: 122, column: 5, scope: !132)
!513 = !DILocation(line: 122, column: 12, scope: !132)
!514 = !DILocation(line: 122, column: 15, scope: !132)
!515 = !DILocation(line: 122, column: 27, scope: !132)
!516 = !DILocation(line: 123, column: 5, scope: !132)
!517 = !DILocation(line: 123, column: 12, scope: !132)
!518 = !DILocation(line: 123, column: 15, scope: !132)
!519 = !DILocation(line: 123, column: 23, scope: !132)
!520 = !DILocation(line: 124, column: 5, scope: !132)
!521 = !DILocation(line: 124, column: 12, scope: !132)
!522 = !DILocation(line: 124, column: 15, scope: !132)
!523 = !DILocation(line: 124, column: 33, scope: !132)
!524 = !DILocation(line: 125, column: 5, scope: !132)
!525 = !DILocation(line: 125, column: 12, scope: !132)
!526 = !DILocation(line: 125, column: 15, scope: !132)
!527 = !DILocation(line: 125, column: 23, scope: !132)
!528 = !DILocation(line: 126, column: 5, scope: !132)
!529 = !DILocation(line: 126, column: 12, scope: !132)
!530 = !DILocation(line: 126, column: 15, scope: !132)
!531 = !DILocation(line: 126, column: 25, scope: !132)
!532 = !DILocation(line: 129, column: 5, scope: !132)
!533 = !DILocation(line: 129, column: 12, scope: !132)
!534 = !DILocation(line: 129, column: 19, scope: !132)
!535 = !DILocation(line: 130, column: 5, scope: !132)
!536 = !DILocation(line: 130, column: 12, scope: !132)
!537 = !DILocation(line: 130, column: 26, scope: !132)
!538 = !DILocation(line: 131, column: 5, scope: !132)
!539 = !DILocation(line: 131, column: 12, scope: !132)
!540 = !DILocation(line: 131, column: 24, scope: !132)
!541 = !DILocation(line: 134, column: 5, scope: !132)
!542 = !DILocation(line: 134, column: 12, scope: !132)
!543 = !DILocation(line: 134, column: 20, scope: !132)
!544 = !DILocation(line: 134, column: 26, scope: !132)
!545 = !DILocation(line: 135, column: 5, scope: !132)
!546 = !DILocation(line: 135, column: 12, scope: !132)
!547 = !DILocation(line: 135, column: 20, scope: !132)
!548 = !DILocation(line: 135, column: 26, scope: !132)
!549 = !DILocation(line: 137, column: 5, scope: !132)
!550 = !DILocation(line: 137, column: 12, scope: !132)
!551 = !DILocation(line: 137, column: 20, scope: !132)
!552 = !DILocation(line: 137, column: 37, scope: !132)
!553 = !DILocation(line: 138, column: 5, scope: !132)
!554 = !DILocation(line: 138, column: 12, scope: !132)
!555 = !DILocation(line: 138, column: 20, scope: !132)
!556 = !DILocation(line: 138, column: 32, scope: !132)
!557 = !DILocation(line: 139, column: 5, scope: !132)
!558 = !DILocation(line: 139, column: 12, scope: !132)
!559 = !DILocation(line: 139, column: 20, scope: !132)
!560 = !DILocation(line: 139, column: 29, scope: !132)
!561 = !DILocation(line: 140, column: 5, scope: !132)
!562 = !DILocation(line: 140, column: 12, scope: !132)
!563 = !DILocation(line: 140, column: 20, scope: !132)
!564 = !DILocation(line: 140, column: 26, scope: !132)
!565 = !DILocation(line: 141, column: 5, scope: !132)
!566 = !DILocation(line: 141, column: 12, scope: !132)
!567 = !DILocation(line: 141, column: 20, scope: !132)
!568 = !DILocation(line: 141, column: 34, scope: !132)
!569 = !DILocation(line: 142, column: 5, scope: !132)
!570 = !DILocation(line: 142, column: 12, scope: !132)
!571 = !DILocation(line: 142, column: 20, scope: !132)
!572 = !DILocation(line: 142, column: 31, scope: !132)
!573 = !DILocation(line: 143, column: 5, scope: !132)
!574 = !DILocation(line: 143, column: 12, scope: !132)
!575 = !DILocation(line: 143, column: 20, scope: !132)
!576 = !DILocation(line: 143, column: 36, scope: !132)
!577 = !DILocation(line: 144, column: 5, scope: !132)
!578 = !DILocation(line: 144, column: 12, scope: !132)
!579 = !DILocation(line: 144, column: 20, scope: !132)
!580 = !DILocation(line: 144, column: 39, scope: !132)
!581 = !DILocation(line: 145, column: 5, scope: !132)
!582 = !DILocation(line: 145, column: 12, scope: !132)
!583 = !DILocation(line: 145, column: 20, scope: !132)
!584 = !DILocation(line: 145, column: 32, scope: !132)
!585 = !DILocation(line: 146, column: 5, scope: !132)
!586 = !DILocation(line: 146, column: 12, scope: !132)
!587 = !DILocation(line: 146, column: 20, scope: !132)
!588 = !DILocation(line: 146, column: 38, scope: !132)
!589 = !DILocation(line: 147, column: 5, scope: !132)
!590 = !DILocation(line: 147, column: 12, scope: !132)
!591 = !DILocation(line: 147, column: 20, scope: !132)
!592 = !DILocation(line: 147, column: 31, scope: !132)
!593 = !DILocation(line: 148, column: 5, scope: !132)
!594 = !DILocation(line: 148, column: 12, scope: !132)
!595 = !DILocation(line: 148, column: 20, scope: !132)
!596 = !DILocation(line: 148, column: 39, scope: !132)
!597 = !DILocation(line: 149, column: 5, scope: !132)
!598 = !DILocation(line: 149, column: 12, scope: !132)
!599 = !DILocation(line: 149, column: 20, scope: !132)
!600 = !DILocation(line: 149, column: 33, scope: !132)
!601 = !DILocation(line: 150, column: 5, scope: !132)
!602 = !DILocation(line: 150, column: 12, scope: !132)
!603 = !DILocation(line: 150, column: 20, scope: !132)
!604 = !DILocation(line: 150, column: 38, scope: !132)
!605 = !DILocation(line: 151, column: 5, scope: !132)
!606 = !DILocation(line: 151, column: 12, scope: !132)
!607 = !DILocation(line: 151, column: 20, scope: !132)
!608 = !DILocation(line: 151, column: 36, scope: !132)
!609 = !DILocation(line: 152, column: 5, scope: !132)
!610 = !DILocation(line: 152, column: 12, scope: !132)
!611 = !DILocation(line: 152, column: 20, scope: !132)
!612 = !DILocation(line: 152, column: 35, scope: !132)
!613 = !DILocation(line: 153, column: 5, scope: !132)
!614 = !DILocation(line: 153, column: 12, scope: !132)
!615 = !DILocation(line: 153, column: 20, scope: !132)
!616 = !DILocation(line: 153, column: 36, scope: !132)
!617 = !DILocation(line: 154, column: 5, scope: !132)
!618 = !DILocation(line: 154, column: 12, scope: !132)
!619 = !DILocation(line: 154, column: 20, scope: !132)
!620 = !DILocation(line: 154, column: 30, scope: !132)
!621 = !DILocation(line: 155, column: 5, scope: !132)
!622 = !DILocation(line: 155, column: 12, scope: !132)
!623 = !DILocation(line: 155, column: 20, scope: !132)
!624 = !DILocation(line: 155, column: 39, scope: !132)
!625 = !DILocation(line: 156, column: 5, scope: !132)
!626 = !DILocation(line: 156, column: 12, scope: !132)
!627 = !DILocation(line: 156, column: 20, scope: !132)
!628 = !DILocation(line: 156, column: 39, scope: !132)
!629 = !DILocation(line: 157, column: 5, scope: !132)
!630 = !DILocation(line: 157, column: 12, scope: !132)
!631 = !DILocation(line: 157, column: 20, scope: !132)
!632 = !DILocation(line: 157, column: 27, scope: !132)
!633 = !DILocation(line: 158, column: 5, scope: !132)
!634 = !DILocation(line: 158, column: 12, scope: !132)
!635 = !DILocation(line: 158, column: 20, scope: !132)
!636 = !DILocation(line: 158, column: 27, scope: !132)
!637 = !DILocation(line: 160, column: 5, scope: !132)
!638 = !DILocation(line: 160, column: 12, scope: !132)
!639 = !DILocation(line: 160, column: 25, scope: !132)
!640 = !DILocation(line: 161, column: 13, scope: !132)
!641 = !DILocation(line: 161, column: 20, scope: !132)
!642 = !DILocation(line: 161, column: 5, scope: !132)
!643 = !DILocation(line: 162, column: 13, scope: !132)
!644 = !DILocation(line: 162, column: 20, scope: !132)
!645 = !DILocation(line: 162, column: 5, scope: !132)
!646 = !DILocation(line: 163, column: 13, scope: !132)
!647 = !DILocation(line: 163, column: 20, scope: !132)
!648 = !DILocation(line: 163, column: 5, scope: !132)
!649 = !DILocation(line: 164, column: 13, scope: !132)
!650 = !DILocation(line: 164, column: 20, scope: !132)
!651 = !DILocation(line: 164, column: 5, scope: !132)
!652 = !DILocation(line: 165, column: 13, scope: !132)
!653 = !DILocation(line: 165, column: 20, scope: !132)
!654 = !DILocation(line: 165, column: 5, scope: !132)
!655 = !DILocation(line: 166, column: 13, scope: !132)
!656 = !DILocation(line: 166, column: 20, scope: !132)
!657 = !DILocation(line: 166, column: 5, scope: !132)
!658 = !DILocation(line: 168, column: 5, scope: !132)
!659 = !DILocation(line: 168, column: 12, scope: !132)
!660 = !DILocation(line: 168, column: 29, scope: !132)
!661 = !DILocation(line: 169, column: 5, scope: !132)
!662 = !DILocation(line: 169, column: 12, scope: !132)
!663 = !DILocation(line: 169, column: 21, scope: !132)
!664 = !DILocation(line: 170, column: 5, scope: !132)
!665 = !DILocation(line: 170, column: 12, scope: !132)
!666 = !DILocation(line: 170, column: 18, scope: !132)
!667 = !DILocation(line: 171, column: 5, scope: !132)
!668 = !DILocation(line: 171, column: 12, scope: !132)
!669 = !DILocation(line: 171, column: 24, scope: !132)
!670 = !DILocation(line: 172, column: 5, scope: !132)
!671 = !DILocation(line: 172, column: 12, scope: !132)
!672 = !DILocation(line: 172, column: 27, scope: !132)
!673 = !DILocation(line: 173, column: 5, scope: !132)
!674 = !DILocation(line: 173, column: 12, scope: !132)
!675 = !DILocation(line: 173, column: 22, scope: !132)
!676 = !DILocation(line: 174, column: 5, scope: !132)
!677 = !DILocation(line: 174, column: 12, scope: !132)
!678 = !DILocation(line: 174, column: 18, scope: !132)
!679 = !DILocation(line: 175, column: 5, scope: !132)
!680 = !DILocation(line: 175, column: 12, scope: !132)
!681 = !DILocation(line: 175, column: 25, scope: !132)
!682 = !DILocation(line: 176, column: 5, scope: !132)
!683 = !DILocation(line: 176, column: 12, scope: !132)
!684 = !DILocation(line: 176, column: 30, scope: !132)
!685 = !DILocation(line: 177, column: 1, scope: !132)
!686 = distinct !DISubprogram(name: "x264_log_default", scope: !3, file: !3, line: 987, type: !199, scopeLine: 988, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !93)
!687 = !DILocalVariable(name: "p_unused", arg: 1, scope: !686, file: !3, line: 987, type: !35)
!688 = !DILocation(line: 987, column: 37, scope: !686)
!689 = !DILocalVariable(name: "i_level", arg: 2, scope: !686, file: !3, line: 987, type: !36)
!690 = !DILocation(line: 987, column: 51, scope: !686)
!691 = !DILocalVariable(name: "psz_fmt", arg: 3, scope: !686, file: !3, line: 987, type: !48)
!692 = !DILocation(line: 987, column: 72, scope: !686)
!693 = !DILocalVariable(name: "arg", arg: 4, scope: !686, file: !3, line: 987, type: !201)
!694 = !DILocation(line: 987, column: 89, scope: !686)
!695 = !DILocalVariable(name: "psz_prefix", scope: !686, file: !3, line: 989, type: !33)
!696 = !DILocation(line: 989, column: 11, scope: !686)
!697 = !DILocation(line: 990, column: 13, scope: !686)
!698 = !DILocation(line: 990, column: 5, scope: !686)
!699 = !DILocation(line: 993, column: 24, scope: !700)
!700 = distinct !DILexicalBlock(scope: !686, file: !3, line: 991, column: 5)
!701 = !DILocation(line: 994, column: 13, scope: !700)
!702 = !DILocation(line: 996, column: 24, scope: !700)
!703 = !DILocation(line: 997, column: 13, scope: !700)
!704 = !DILocation(line: 999, column: 24, scope: !700)
!705 = !DILocation(line: 1000, column: 13, scope: !700)
!706 = !DILocation(line: 1002, column: 24, scope: !700)
!707 = !DILocation(line: 1003, column: 13, scope: !700)
!708 = !DILocation(line: 1005, column: 24, scope: !700)
!709 = !DILocation(line: 1006, column: 13, scope: !700)
!710 = !DILocation(line: 1008, column: 14, scope: !686)
!711 = !DILocation(line: 1008, column: 37, scope: !686)
!712 = !DILocation(line: 1008, column: 5, scope: !686)
!713 = !DILocation(line: 1009, column: 15, scope: !686)
!714 = !DILocation(line: 1009, column: 23, scope: !686)
!715 = !DILocation(line: 1009, column: 32, scope: !686)
!716 = !DILocation(line: 1009, column: 5, scope: !686)
!717 = !DILocation(line: 1010, column: 1, scope: !686)
!718 = distinct !DISubprogram(name: "x264_param_default_preset", scope: !3, file: !3, line: 399, type: !719, scopeLine: 400, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !93)
!719 = !DISubroutineType(types: !720)
!720 = !{!36, !135, !48, !48}
!721 = !DILocalVariable(name: "param", arg: 1, scope: !718, file: !3, line: 399, type: !135)
!722 = !DILocation(line: 399, column: 46, scope: !718)
!723 = !DILocalVariable(name: "preset", arg: 2, scope: !718, file: !3, line: 399, type: !48)
!724 = !DILocation(line: 399, column: 65, scope: !718)
!725 = !DILocalVariable(name: "tune", arg: 3, scope: !718, file: !3, line: 399, type: !48)
!726 = !DILocation(line: 399, column: 85, scope: !718)
!727 = !DILocation(line: 401, column: 25, scope: !718)
!728 = !DILocation(line: 401, column: 5, scope: !718)
!729 = !DILocation(line: 403, column: 9, scope: !730)
!730 = distinct !DILexicalBlock(scope: !718, file: !3, line: 403, column: 9)
!731 = !DILocation(line: 403, column: 16, scope: !730)
!732 = !DILocation(line: 403, column: 44, scope: !730)
!733 = !DILocation(line: 403, column: 51, scope: !730)
!734 = !DILocation(line: 403, column: 19, scope: !730)
!735 = !DILocation(line: 403, column: 60, scope: !730)
!736 = !DILocation(line: 403, column: 9, scope: !718)
!737 = !DILocation(line: 404, column: 9, scope: !730)
!738 = !DILocation(line: 405, column: 9, scope: !739)
!739 = distinct !DILexicalBlock(scope: !718, file: !3, line: 405, column: 9)
!740 = !DILocation(line: 405, column: 14, scope: !739)
!741 = !DILocation(line: 405, column: 40, scope: !739)
!742 = !DILocation(line: 405, column: 47, scope: !739)
!743 = !DILocation(line: 405, column: 17, scope: !739)
!744 = !DILocation(line: 405, column: 54, scope: !739)
!745 = !DILocation(line: 405, column: 9, scope: !718)
!746 = !DILocation(line: 406, column: 9, scope: !739)
!747 = !DILocation(line: 407, column: 5, scope: !718)
!748 = !DILocation(line: 408, column: 1, scope: !718)
!749 = distinct !DISubprogram(name: "x264_param_apply_preset", scope: !3, file: !3, line: 179, type: !750, scopeLine: 180, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !93)
!750 = !DISubroutineType(types: !751)
!751 = !{!36, !135, !48}
!752 = !DILocalVariable(name: "param", arg: 1, scope: !749, file: !3, line: 179, type: !135)
!753 = !DILocation(line: 179, column: 51, scope: !749)
!754 = !DILocalVariable(name: "preset", arg: 2, scope: !749, file: !3, line: 179, type: !48)
!755 = !DILocation(line: 179, column: 70, scope: !749)
!756 = !DILocation(line: 181, column: 18, scope: !757)
!757 = distinct !DILexicalBlock(scope: !749, file: !3, line: 181, column: 9)
!758 = !DILocation(line: 181, column: 10, scope: !757)
!759 = !DILocation(line: 181, column: 9, scope: !749)
!760 = !DILocation(line: 183, column: 9, scope: !761)
!761 = distinct !DILexicalBlock(scope: !757, file: !3, line: 182, column: 5)
!762 = !DILocation(line: 183, column: 16, scope: !761)
!763 = !DILocation(line: 183, column: 34, scope: !761)
!764 = !DILocation(line: 184, column: 9, scope: !761)
!765 = !DILocation(line: 184, column: 16, scope: !761)
!766 = !DILocation(line: 184, column: 37, scope: !761)
!767 = !DILocation(line: 185, column: 9, scope: !761)
!768 = !DILocation(line: 185, column: 16, scope: !761)
!769 = !DILocation(line: 185, column: 36, scope: !761)
!770 = !DILocation(line: 186, column: 9, scope: !761)
!771 = !DILocation(line: 186, column: 16, scope: !761)
!772 = !DILocation(line: 186, column: 24, scope: !761)
!773 = !DILocation(line: 187, column: 9, scope: !761)
!774 = !DILocation(line: 187, column: 16, scope: !761)
!775 = !DILocation(line: 187, column: 25, scope: !761)
!776 = !DILocation(line: 188, column: 9, scope: !761)
!777 = !DILocation(line: 188, column: 16, scope: !761)
!778 = !DILocation(line: 188, column: 24, scope: !761)
!779 = !DILocation(line: 188, column: 30, scope: !761)
!780 = !DILocation(line: 189, column: 9, scope: !761)
!781 = !DILocation(line: 189, column: 16, scope: !761)
!782 = !DILocation(line: 189, column: 24, scope: !761)
!783 = !DILocation(line: 189, column: 30, scope: !761)
!784 = !DILocation(line: 190, column: 9, scope: !761)
!785 = !DILocation(line: 190, column: 16, scope: !761)
!786 = !DILocation(line: 190, column: 24, scope: !761)
!787 = !DILocation(line: 190, column: 40, scope: !761)
!788 = !DILocation(line: 191, column: 9, scope: !761)
!789 = !DILocation(line: 191, column: 16, scope: !761)
!790 = !DILocation(line: 191, column: 24, scope: !761)
!791 = !DILocation(line: 191, column: 36, scope: !761)
!792 = !DILocation(line: 192, column: 9, scope: !761)
!793 = !DILocation(line: 192, column: 16, scope: !761)
!794 = !DILocation(line: 192, column: 24, scope: !761)
!795 = !DILocation(line: 192, column: 40, scope: !761)
!796 = !DILocation(line: 193, column: 9, scope: !761)
!797 = !DILocation(line: 193, column: 16, scope: !761)
!798 = !DILocation(line: 193, column: 19, scope: !761)
!799 = !DILocation(line: 193, column: 29, scope: !761)
!800 = !DILocation(line: 194, column: 9, scope: !761)
!801 = !DILocation(line: 194, column: 16, scope: !761)
!802 = !DILocation(line: 194, column: 24, scope: !761)
!803 = !DILocation(line: 194, column: 43, scope: !761)
!804 = !DILocation(line: 195, column: 9, scope: !761)
!805 = !DILocation(line: 195, column: 16, scope: !761)
!806 = !DILocation(line: 195, column: 24, scope: !761)
!807 = !DILocation(line: 195, column: 34, scope: !761)
!808 = !DILocation(line: 196, column: 9, scope: !761)
!809 = !DILocation(line: 196, column: 16, scope: !761)
!810 = !DILocation(line: 196, column: 34, scope: !761)
!811 = !DILocation(line: 197, column: 9, scope: !761)
!812 = !DILocation(line: 197, column: 16, scope: !761)
!813 = !DILocation(line: 197, column: 19, scope: !761)
!814 = !DILocation(line: 197, column: 29, scope: !761)
!815 = !DILocation(line: 198, column: 9, scope: !761)
!816 = !DILocation(line: 198, column: 16, scope: !761)
!817 = !DILocation(line: 198, column: 24, scope: !761)
!818 = !DILocation(line: 198, column: 40, scope: !761)
!819 = !DILocation(line: 199, column: 5, scope: !761)
!820 = !DILocation(line: 200, column: 23, scope: !821)
!821 = distinct !DILexicalBlock(scope: !757, file: !3, line: 200, column: 14)
!822 = !DILocation(line: 200, column: 15, scope: !821)
!823 = !DILocation(line: 200, column: 14, scope: !757)
!824 = !DILocation(line: 202, column: 9, scope: !825)
!825 = distinct !DILexicalBlock(scope: !821, file: !3, line: 201, column: 5)
!826 = !DILocation(line: 202, column: 16, scope: !825)
!827 = !DILocation(line: 202, column: 24, scope: !825)
!828 = !DILocation(line: 202, column: 30, scope: !825)
!829 = !DILocation(line: 203, column: 9, scope: !825)
!830 = !DILocation(line: 203, column: 16, scope: !825)
!831 = !DILocation(line: 203, column: 24, scope: !825)
!832 = !DILocation(line: 203, column: 36, scope: !825)
!833 = !DILocation(line: 204, column: 9, scope: !825)
!834 = !DILocation(line: 204, column: 16, scope: !825)
!835 = !DILocation(line: 204, column: 24, scope: !825)
!836 = !DILocation(line: 204, column: 40, scope: !825)
!837 = !DILocation(line: 205, column: 9, scope: !825)
!838 = !DILocation(line: 205, column: 16, scope: !825)
!839 = !DILocation(line: 205, column: 34, scope: !825)
!840 = !DILocation(line: 206, column: 9, scope: !825)
!841 = !DILocation(line: 206, column: 16, scope: !825)
!842 = !DILocation(line: 206, column: 24, scope: !825)
!843 = !DILocation(line: 206, column: 43, scope: !825)
!844 = !DILocation(line: 207, column: 9, scope: !825)
!845 = !DILocation(line: 207, column: 16, scope: !825)
!846 = !DILocation(line: 207, column: 24, scope: !825)
!847 = !DILocation(line: 207, column: 34, scope: !825)
!848 = !DILocation(line: 208, column: 9, scope: !825)
!849 = !DILocation(line: 208, column: 16, scope: !825)
!850 = !DILocation(line: 208, column: 19, scope: !825)
!851 = !DILocation(line: 208, column: 29, scope: !825)
!852 = !DILocation(line: 209, column: 9, scope: !825)
!853 = !DILocation(line: 209, column: 16, scope: !825)
!854 = !DILocation(line: 209, column: 24, scope: !825)
!855 = !DILocation(line: 209, column: 40, scope: !825)
!856 = !DILocation(line: 210, column: 5, scope: !825)
!857 = !DILocation(line: 211, column: 23, scope: !858)
!858 = distinct !DILexicalBlock(scope: !821, file: !3, line: 211, column: 14)
!859 = !DILocation(line: 211, column: 15, scope: !858)
!860 = !DILocation(line: 211, column: 14, scope: !821)
!861 = !DILocation(line: 213, column: 9, scope: !862)
!862 = distinct !DILexicalBlock(scope: !858, file: !3, line: 212, column: 5)
!863 = !DILocation(line: 213, column: 16, scope: !862)
!864 = !DILocation(line: 213, column: 24, scope: !862)
!865 = !DILocation(line: 213, column: 36, scope: !862)
!866 = !DILocation(line: 214, column: 9, scope: !862)
!867 = !DILocation(line: 214, column: 16, scope: !862)
!868 = !DILocation(line: 214, column: 24, scope: !862)
!869 = !DILocation(line: 214, column: 40, scope: !862)
!870 = !DILocation(line: 215, column: 9, scope: !862)
!871 = !DILocation(line: 215, column: 16, scope: !862)
!872 = !DILocation(line: 215, column: 34, scope: !862)
!873 = !DILocation(line: 216, column: 9, scope: !862)
!874 = !DILocation(line: 216, column: 16, scope: !862)
!875 = !DILocation(line: 216, column: 24, scope: !862)
!876 = !DILocation(line: 216, column: 43, scope: !862)
!877 = !DILocation(line: 217, column: 9, scope: !862)
!878 = !DILocation(line: 217, column: 16, scope: !862)
!879 = !DILocation(line: 217, column: 24, scope: !862)
!880 = !DILocation(line: 217, column: 34, scope: !862)
!881 = !DILocation(line: 218, column: 9, scope: !862)
!882 = !DILocation(line: 218, column: 16, scope: !862)
!883 = !DILocation(line: 218, column: 19, scope: !862)
!884 = !DILocation(line: 218, column: 29, scope: !862)
!885 = !DILocation(line: 219, column: 9, scope: !862)
!886 = !DILocation(line: 219, column: 16, scope: !862)
!887 = !DILocation(line: 219, column: 24, scope: !862)
!888 = !DILocation(line: 219, column: 40, scope: !862)
!889 = !DILocation(line: 220, column: 5, scope: !862)
!890 = !DILocation(line: 221, column: 23, scope: !891)
!891 = distinct !DILexicalBlock(scope: !858, file: !3, line: 221, column: 14)
!892 = !DILocation(line: 221, column: 15, scope: !891)
!893 = !DILocation(line: 221, column: 14, scope: !858)
!894 = !DILocation(line: 223, column: 9, scope: !895)
!895 = distinct !DILexicalBlock(scope: !891, file: !3, line: 222, column: 5)
!896 = !DILocation(line: 223, column: 16, scope: !895)
!897 = !DILocation(line: 223, column: 24, scope: !895)
!898 = !DILocation(line: 223, column: 43, scope: !895)
!899 = !DILocation(line: 224, column: 9, scope: !895)
!900 = !DILocation(line: 224, column: 16, scope: !895)
!901 = !DILocation(line: 224, column: 34, scope: !895)
!902 = !DILocation(line: 225, column: 9, scope: !895)
!903 = !DILocation(line: 225, column: 16, scope: !895)
!904 = !DILocation(line: 225, column: 24, scope: !895)
!905 = !DILocation(line: 225, column: 40, scope: !895)
!906 = !DILocation(line: 226, column: 9, scope: !895)
!907 = !DILocation(line: 226, column: 16, scope: !895)
!908 = !DILocation(line: 226, column: 24, scope: !895)
!909 = !DILocation(line: 226, column: 40, scope: !895)
!910 = !DILocation(line: 227, column: 9, scope: !895)
!911 = !DILocation(line: 227, column: 16, scope: !895)
!912 = !DILocation(line: 227, column: 19, scope: !895)
!913 = !DILocation(line: 227, column: 31, scope: !895)
!914 = !DILocation(line: 228, column: 5, scope: !895)
!915 = !DILocation(line: 229, column: 23, scope: !916)
!916 = distinct !DILexicalBlock(scope: !891, file: !3, line: 229, column: 14)
!917 = !DILocation(line: 229, column: 15, scope: !916)
!918 = !DILocation(line: 229, column: 14, scope: !891)
!919 = !DILocation(line: 231, column: 9, scope: !920)
!920 = distinct !DILexicalBlock(scope: !916, file: !3, line: 230, column: 5)
!921 = !DILocation(line: 231, column: 16, scope: !920)
!922 = !DILocation(line: 231, column: 34, scope: !920)
!923 = !DILocation(line: 232, column: 9, scope: !920)
!924 = !DILocation(line: 232, column: 16, scope: !920)
!925 = !DILocation(line: 232, column: 24, scope: !920)
!926 = !DILocation(line: 232, column: 40, scope: !920)
!927 = !DILocation(line: 233, column: 9, scope: !920)
!928 = !DILocation(line: 233, column: 16, scope: !920)
!929 = !DILocation(line: 233, column: 19, scope: !920)
!930 = !DILocation(line: 233, column: 31, scope: !920)
!931 = !DILocation(line: 234, column: 5, scope: !920)
!932 = !DILocation(line: 235, column: 23, scope: !933)
!933 = distinct !DILexicalBlock(scope: !916, file: !3, line: 235, column: 14)
!934 = !DILocation(line: 235, column: 15, scope: !933)
!935 = !DILocation(line: 235, column: 14, scope: !916)
!936 = !DILocation(line: 238, column: 5, scope: !937)
!937 = distinct !DILexicalBlock(scope: !933, file: !3, line: 236, column: 5)
!938 = !DILocation(line: 239, column: 23, scope: !939)
!939 = distinct !DILexicalBlock(scope: !933, file: !3, line: 239, column: 14)
!940 = !DILocation(line: 239, column: 15, scope: !939)
!941 = !DILocation(line: 239, column: 14, scope: !933)
!942 = !DILocation(line: 241, column: 9, scope: !943)
!943 = distinct !DILexicalBlock(scope: !939, file: !3, line: 240, column: 5)
!944 = !DILocation(line: 241, column: 16, scope: !943)
!945 = !DILocation(line: 241, column: 24, scope: !943)
!946 = !DILocation(line: 241, column: 36, scope: !943)
!947 = !DILocation(line: 242, column: 9, scope: !943)
!948 = !DILocation(line: 242, column: 16, scope: !943)
!949 = !DILocation(line: 242, column: 24, scope: !943)
!950 = !DILocation(line: 242, column: 40, scope: !943)
!951 = !DILocation(line: 243, column: 9, scope: !943)
!952 = !DILocation(line: 243, column: 16, scope: !943)
!953 = !DILocation(line: 243, column: 34, scope: !943)
!954 = !DILocation(line: 244, column: 9, scope: !943)
!955 = !DILocation(line: 244, column: 16, scope: !943)
!956 = !DILocation(line: 244, column: 34, scope: !943)
!957 = !DILocation(line: 245, column: 9, scope: !943)
!958 = !DILocation(line: 245, column: 16, scope: !943)
!959 = !DILocation(line: 245, column: 24, scope: !943)
!960 = !DILocation(line: 245, column: 41, scope: !943)
!961 = !DILocation(line: 246, column: 9, scope: !943)
!962 = !DILocation(line: 246, column: 16, scope: !943)
!963 = !DILocation(line: 246, column: 19, scope: !943)
!964 = !DILocation(line: 246, column: 31, scope: !943)
!965 = !DILocation(line: 247, column: 5, scope: !943)
!966 = !DILocation(line: 248, column: 23, scope: !967)
!967 = distinct !DILexicalBlock(scope: !939, file: !3, line: 248, column: 14)
!968 = !DILocation(line: 248, column: 15, scope: !967)
!969 = !DILocation(line: 248, column: 14, scope: !939)
!970 = !DILocation(line: 250, column: 9, scope: !971)
!971 = distinct !DILexicalBlock(scope: !967, file: !3, line: 249, column: 5)
!972 = !DILocation(line: 250, column: 16, scope: !971)
!973 = !DILocation(line: 250, column: 24, scope: !971)
!974 = !DILocation(line: 250, column: 36, scope: !971)
!975 = !DILocation(line: 251, column: 9, scope: !971)
!976 = !DILocation(line: 251, column: 16, scope: !971)
!977 = !DILocation(line: 251, column: 24, scope: !971)
!978 = !DILocation(line: 251, column: 40, scope: !971)
!979 = !DILocation(line: 252, column: 9, scope: !971)
!980 = !DILocation(line: 252, column: 16, scope: !971)
!981 = !DILocation(line: 252, column: 34, scope: !971)
!982 = !DILocation(line: 253, column: 9, scope: !971)
!983 = !DILocation(line: 253, column: 16, scope: !971)
!984 = !DILocation(line: 253, column: 34, scope: !971)
!985 = !DILocation(line: 254, column: 9, scope: !971)
!986 = !DILocation(line: 254, column: 16, scope: !971)
!987 = !DILocation(line: 254, column: 24, scope: !971)
!988 = !DILocation(line: 254, column: 41, scope: !971)
!989 = !DILocation(line: 255, column: 9, scope: !971)
!990 = !DILocation(line: 255, column: 16, scope: !971)
!991 = !DILocation(line: 255, column: 24, scope: !971)
!992 = !DILocation(line: 255, column: 30, scope: !971)
!993 = !DILocation(line: 256, column: 9, scope: !971)
!994 = !DILocation(line: 256, column: 16, scope: !971)
!995 = !DILocation(line: 256, column: 24, scope: !971)
!996 = !DILocation(line: 256, column: 34, scope: !971)
!997 = !DILocation(line: 257, column: 9, scope: !971)
!998 = !DILocation(line: 257, column: 16, scope: !971)
!999 = !DILocation(line: 257, column: 19, scope: !971)
!1000 = !DILocation(line: 257, column: 31, scope: !971)
!1001 = !DILocation(line: 258, column: 5, scope: !971)
!1002 = !DILocation(line: 259, column: 23, scope: !1003)
!1003 = distinct !DILexicalBlock(scope: !967, file: !3, line: 259, column: 14)
!1004 = !DILocation(line: 259, column: 15, scope: !1003)
!1005 = !DILocation(line: 259, column: 14, scope: !967)
!1006 = !DILocation(line: 261, column: 9, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !1003, file: !3, line: 260, column: 5)
!1008 = !DILocation(line: 261, column: 16, scope: !1007)
!1009 = !DILocation(line: 261, column: 24, scope: !1007)
!1010 = !DILocation(line: 261, column: 36, scope: !1007)
!1011 = !DILocation(line: 262, column: 9, scope: !1007)
!1012 = !DILocation(line: 262, column: 16, scope: !1007)
!1013 = !DILocation(line: 262, column: 24, scope: !1007)
!1014 = !DILocation(line: 262, column: 40, scope: !1007)
!1015 = !DILocation(line: 263, column: 9, scope: !1007)
!1016 = !DILocation(line: 263, column: 16, scope: !1007)
!1017 = !DILocation(line: 263, column: 24, scope: !1007)
!1018 = !DILocation(line: 263, column: 35, scope: !1007)
!1019 = !DILocation(line: 264, column: 9, scope: !1007)
!1020 = !DILocation(line: 264, column: 16, scope: !1007)
!1021 = !DILocation(line: 264, column: 34, scope: !1007)
!1022 = !DILocation(line: 265, column: 9, scope: !1007)
!1023 = !DILocation(line: 265, column: 16, scope: !1007)
!1024 = !DILocation(line: 265, column: 34, scope: !1007)
!1025 = !DILocation(line: 266, column: 9, scope: !1007)
!1026 = !DILocation(line: 266, column: 16, scope: !1007)
!1027 = !DILocation(line: 266, column: 24, scope: !1007)
!1028 = !DILocation(line: 266, column: 41, scope: !1007)
!1029 = !DILocation(line: 267, column: 9, scope: !1007)
!1030 = !DILocation(line: 267, column: 16, scope: !1007)
!1031 = !DILocation(line: 267, column: 24, scope: !1007)
!1032 = !DILocation(line: 267, column: 30, scope: !1007)
!1033 = !DILocation(line: 268, column: 9, scope: !1007)
!1034 = !DILocation(line: 268, column: 16, scope: !1007)
!1035 = !DILocation(line: 268, column: 24, scope: !1007)
!1036 = !DILocation(line: 268, column: 34, scope: !1007)
!1037 = !DILocation(line: 269, column: 9, scope: !1007)
!1038 = !DILocation(line: 269, column: 16, scope: !1007)
!1039 = !DILocation(line: 269, column: 25, scope: !1007)
!1040 = !DILocation(line: 270, column: 9, scope: !1007)
!1041 = !DILocation(line: 270, column: 16, scope: !1007)
!1042 = !DILocation(line: 270, column: 19, scope: !1007)
!1043 = !DILocation(line: 270, column: 31, scope: !1007)
!1044 = !DILocation(line: 271, column: 5, scope: !1007)
!1045 = !DILocation(line: 272, column: 23, scope: !1046)
!1046 = distinct !DILexicalBlock(scope: !1003, file: !3, line: 272, column: 14)
!1047 = !DILocation(line: 272, column: 15, scope: !1046)
!1048 = !DILocation(line: 272, column: 14, scope: !1003)
!1049 = !DILocation(line: 274, column: 9, scope: !1050)
!1050 = distinct !DILexicalBlock(scope: !1046, file: !3, line: 273, column: 5)
!1051 = !DILocation(line: 274, column: 16, scope: !1050)
!1052 = !DILocation(line: 274, column: 24, scope: !1050)
!1053 = !DILocation(line: 274, column: 36, scope: !1050)
!1054 = !DILocation(line: 275, column: 9, scope: !1050)
!1055 = !DILocation(line: 275, column: 16, scope: !1050)
!1056 = !DILocation(line: 275, column: 24, scope: !1050)
!1057 = !DILocation(line: 275, column: 40, scope: !1050)
!1058 = !DILocation(line: 276, column: 9, scope: !1050)
!1059 = !DILocation(line: 276, column: 16, scope: !1050)
!1060 = !DILocation(line: 276, column: 24, scope: !1050)
!1061 = !DILocation(line: 276, column: 35, scope: !1050)
!1062 = !DILocation(line: 277, column: 9, scope: !1050)
!1063 = !DILocation(line: 277, column: 16, scope: !1050)
!1064 = !DILocation(line: 277, column: 34, scope: !1050)
!1065 = !DILocation(line: 278, column: 9, scope: !1050)
!1066 = !DILocation(line: 278, column: 16, scope: !1050)
!1067 = !DILocation(line: 278, column: 34, scope: !1050)
!1068 = !DILocation(line: 279, column: 9, scope: !1050)
!1069 = !DILocation(line: 279, column: 16, scope: !1050)
!1070 = !DILocation(line: 279, column: 24, scope: !1050)
!1071 = !DILocation(line: 279, column: 41, scope: !1050)
!1072 = !DILocation(line: 280, column: 9, scope: !1050)
!1073 = !DILocation(line: 280, column: 16, scope: !1050)
!1074 = !DILocation(line: 280, column: 24, scope: !1050)
!1075 = !DILocation(line: 280, column: 30, scope: !1050)
!1076 = !DILocation(line: 281, column: 9, scope: !1050)
!1077 = !DILocation(line: 281, column: 16, scope: !1050)
!1078 = !DILocation(line: 281, column: 24, scope: !1050)
!1079 = !DILocation(line: 281, column: 37, scope: !1050)
!1080 = !DILocation(line: 282, column: 9, scope: !1050)
!1081 = !DILocation(line: 282, column: 16, scope: !1050)
!1082 = !DILocation(line: 282, column: 24, scope: !1050)
!1083 = !DILocation(line: 282, column: 34, scope: !1050)
!1084 = !DILocation(line: 283, column: 9, scope: !1050)
!1085 = !DILocation(line: 283, column: 16, scope: !1050)
!1086 = !DILocation(line: 283, column: 25, scope: !1050)
!1087 = !DILocation(line: 284, column: 9, scope: !1050)
!1088 = !DILocation(line: 284, column: 16, scope: !1050)
!1089 = !DILocation(line: 284, column: 19, scope: !1050)
!1090 = !DILocation(line: 284, column: 31, scope: !1050)
!1091 = !DILocation(line: 285, column: 5, scope: !1050)
!1092 = !DILocation(line: 288, column: 66, scope: !1093)
!1093 = distinct !DILexicalBlock(scope: !1046, file: !3, line: 287, column: 5)
!1094 = !DILocation(line: 288, column: 9, scope: !1093)
!1095 = !DILocation(line: 289, column: 9, scope: !1093)
!1096 = !DILocation(line: 291, column: 5, scope: !749)
!1097 = !DILocation(line: 292, column: 1, scope: !749)
!1098 = distinct !DISubprogram(name: "x264_param_apply_tune", scope: !3, file: !3, line: 294, type: !750, scopeLine: 295, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !93)
!1099 = !DILocalVariable(name: "param", arg: 1, scope: !1098, file: !3, line: 294, type: !135)
!1100 = !DILocation(line: 294, column: 49, scope: !1098)
!1101 = !DILocalVariable(name: "tune", arg: 2, scope: !1098, file: !3, line: 294, type: !48)
!1102 = !DILocation(line: 294, column: 68, scope: !1098)
!1103 = !DILocalVariable(name: "tmp", scope: !1098, file: !3, line: 296, type: !33)
!1104 = !DILocation(line: 296, column: 11, scope: !1098)
!1105 = !DILocation(line: 296, column: 38, scope: !1098)
!1106 = !DILocation(line: 296, column: 30, scope: !1098)
!1107 = !DILocation(line: 296, column: 17, scope: !1098)
!1108 = !DILocation(line: 297, column: 10, scope: !1109)
!1109 = distinct !DILexicalBlock(scope: !1098, file: !3, line: 297, column: 9)
!1110 = !DILocation(line: 297, column: 9, scope: !1098)
!1111 = !DILocation(line: 298, column: 9, scope: !1109)
!1112 = !DILocation(line: 299, column: 19, scope: !1098)
!1113 = !DILocation(line: 299, column: 24, scope: !1098)
!1114 = !DILocation(line: 299, column: 11, scope: !1098)
!1115 = !DILocation(line: 299, column: 9, scope: !1098)
!1116 = !DILocalVariable(name: "s", scope: !1098, file: !3, line: 300, type: !33)
!1117 = !DILocation(line: 300, column: 11, scope: !1098)
!1118 = !DILocation(line: 300, column: 23, scope: !1098)
!1119 = !DILocation(line: 300, column: 15, scope: !1098)
!1120 = !DILocalVariable(name: "psy_tuning_used", scope: !1098, file: !3, line: 301, type: !36)
!1121 = !DILocation(line: 301, column: 9, scope: !1098)
!1122 = !DILocation(line: 302, column: 5, scope: !1098)
!1123 = !DILocation(line: 302, column: 12, scope: !1098)
!1124 = !DILocation(line: 304, column: 23, scope: !1125)
!1125 = distinct !DILexicalBlock(scope: !1126, file: !3, line: 304, column: 13)
!1126 = distinct !DILexicalBlock(scope: !1098, file: !3, line: 303, column: 5)
!1127 = !DILocation(line: 304, column: 14, scope: !1125)
!1128 = !DILocation(line: 304, column: 13, scope: !1126)
!1129 = !DILocation(line: 306, column: 32, scope: !1130)
!1130 = distinct !DILexicalBlock(scope: !1131, file: !3, line: 306, column: 17)
!1131 = distinct !DILexicalBlock(scope: !1125, file: !3, line: 305, column: 9)
!1132 = !DILocation(line: 306, column: 17, scope: !1131)
!1133 = !DILocation(line: 306, column: 37, scope: !1130)
!1134 = !DILocation(line: 307, column: 13, scope: !1131)
!1135 = !DILocation(line: 307, column: 20, scope: !1131)
!1136 = !DILocation(line: 307, column: 48, scope: !1131)
!1137 = !DILocation(line: 308, column: 13, scope: !1131)
!1138 = !DILocation(line: 308, column: 20, scope: !1131)
!1139 = !DILocation(line: 308, column: 45, scope: !1131)
!1140 = !DILocation(line: 309, column: 13, scope: !1131)
!1141 = !DILocation(line: 309, column: 20, scope: !1131)
!1142 = !DILocation(line: 309, column: 28, scope: !1131)
!1143 = !DILocation(line: 309, column: 42, scope: !1131)
!1144 = !DILocation(line: 310, column: 9, scope: !1131)
!1145 = !DILocation(line: 311, column: 28, scope: !1146)
!1146 = distinct !DILexicalBlock(scope: !1125, file: !3, line: 311, column: 18)
!1147 = !DILocation(line: 311, column: 19, scope: !1146)
!1148 = !DILocation(line: 311, column: 18, scope: !1125)
!1149 = !DILocation(line: 313, column: 32, scope: !1150)
!1150 = distinct !DILexicalBlock(scope: !1151, file: !3, line: 313, column: 17)
!1151 = distinct !DILexicalBlock(scope: !1146, file: !3, line: 312, column: 9)
!1152 = !DILocation(line: 313, column: 17, scope: !1151)
!1153 = !DILocation(line: 313, column: 37, scope: !1150)
!1154 = !DILocation(line: 314, column: 40, scope: !1151)
!1155 = !DILocation(line: 314, column: 47, scope: !1151)
!1156 = !DILocation(line: 314, column: 65, scope: !1151)
!1157 = !DILocation(line: 314, column: 71, scope: !1151)
!1158 = !DILocation(line: 314, column: 78, scope: !1151)
!1159 = !DILocation(line: 314, column: 95, scope: !1151)
!1160 = !DILocation(line: 314, column: 13, scope: !1151)
!1161 = !DILocation(line: 314, column: 20, scope: !1151)
!1162 = !DILocation(line: 314, column: 38, scope: !1151)
!1163 = !DILocation(line: 315, column: 13, scope: !1151)
!1164 = !DILocation(line: 315, column: 20, scope: !1151)
!1165 = !DILocation(line: 315, column: 48, scope: !1151)
!1166 = !DILocation(line: 316, column: 13, scope: !1151)
!1167 = !DILocation(line: 316, column: 20, scope: !1151)
!1168 = !DILocation(line: 316, column: 45, scope: !1151)
!1169 = !DILocation(line: 317, column: 13, scope: !1151)
!1170 = !DILocation(line: 317, column: 20, scope: !1151)
!1171 = !DILocation(line: 317, column: 28, scope: !1151)
!1172 = !DILocation(line: 317, column: 37, scope: !1151)
!1173 = !DILocation(line: 318, column: 13, scope: !1151)
!1174 = !DILocation(line: 318, column: 20, scope: !1151)
!1175 = !DILocation(line: 318, column: 23, scope: !1151)
!1176 = !DILocation(line: 318, column: 37, scope: !1151)
!1177 = !DILocation(line: 319, column: 13, scope: !1151)
!1178 = !DILocation(line: 319, column: 20, scope: !1151)
!1179 = !DILocation(line: 319, column: 29, scope: !1151)
!1180 = !DILocation(line: 320, column: 9, scope: !1151)
!1181 = !DILocation(line: 321, column: 28, scope: !1182)
!1182 = distinct !DILexicalBlock(scope: !1146, file: !3, line: 321, column: 18)
!1183 = !DILocation(line: 321, column: 19, scope: !1182)
!1184 = !DILocation(line: 321, column: 18, scope: !1146)
!1185 = !DILocation(line: 323, column: 32, scope: !1186)
!1186 = distinct !DILexicalBlock(scope: !1187, file: !3, line: 323, column: 17)
!1187 = distinct !DILexicalBlock(scope: !1182, file: !3, line: 322, column: 9)
!1188 = !DILocation(line: 323, column: 17, scope: !1187)
!1189 = !DILocation(line: 323, column: 37, scope: !1186)
!1190 = !DILocation(line: 324, column: 13, scope: !1187)
!1191 = !DILocation(line: 324, column: 20, scope: !1187)
!1192 = !DILocation(line: 324, column: 48, scope: !1187)
!1193 = !DILocation(line: 325, column: 13, scope: !1187)
!1194 = !DILocation(line: 325, column: 20, scope: !1187)
!1195 = !DILocation(line: 325, column: 45, scope: !1187)
!1196 = !DILocation(line: 326, column: 13, scope: !1187)
!1197 = !DILocation(line: 326, column: 20, scope: !1187)
!1198 = !DILocation(line: 326, column: 28, scope: !1187)
!1199 = !DILocation(line: 326, column: 42, scope: !1187)
!1200 = !DILocation(line: 327, column: 13, scope: !1187)
!1201 = !DILocation(line: 327, column: 20, scope: !1187)
!1202 = !DILocation(line: 327, column: 28, scope: !1187)
!1203 = !DILocation(line: 327, column: 43, scope: !1187)
!1204 = !DILocation(line: 328, column: 13, scope: !1187)
!1205 = !DILocation(line: 328, column: 20, scope: !1187)
!1206 = !DILocation(line: 328, column: 23, scope: !1187)
!1207 = !DILocation(line: 328, column: 35, scope: !1187)
!1208 = !DILocation(line: 329, column: 13, scope: !1187)
!1209 = !DILocation(line: 329, column: 20, scope: !1187)
!1210 = !DILocation(line: 329, column: 23, scope: !1187)
!1211 = !DILocation(line: 329, column: 35, scope: !1187)
!1212 = !DILocation(line: 330, column: 13, scope: !1187)
!1213 = !DILocation(line: 330, column: 20, scope: !1187)
!1214 = !DILocation(line: 330, column: 23, scope: !1187)
!1215 = !DILocation(line: 330, column: 37, scope: !1187)
!1216 = !DILocation(line: 331, column: 13, scope: !1187)
!1217 = !DILocation(line: 331, column: 20, scope: !1187)
!1218 = !DILocation(line: 331, column: 28, scope: !1187)
!1219 = !DILocation(line: 331, column: 47, scope: !1187)
!1220 = !DILocation(line: 332, column: 13, scope: !1187)
!1221 = !DILocation(line: 332, column: 20, scope: !1187)
!1222 = !DILocation(line: 332, column: 28, scope: !1187)
!1223 = !DILocation(line: 332, column: 47, scope: !1187)
!1224 = !DILocation(line: 333, column: 13, scope: !1187)
!1225 = !DILocation(line: 333, column: 20, scope: !1187)
!1226 = !DILocation(line: 333, column: 23, scope: !1187)
!1227 = !DILocation(line: 333, column: 35, scope: !1187)
!1228 = !DILocation(line: 334, column: 9, scope: !1187)
!1229 = !DILocation(line: 335, column: 28, scope: !1230)
!1230 = distinct !DILexicalBlock(scope: !1182, file: !3, line: 335, column: 18)
!1231 = !DILocation(line: 335, column: 19, scope: !1230)
!1232 = !DILocation(line: 335, column: 18, scope: !1182)
!1233 = !DILocation(line: 337, column: 32, scope: !1234)
!1234 = distinct !DILexicalBlock(scope: !1235, file: !3, line: 337, column: 17)
!1235 = distinct !DILexicalBlock(scope: !1230, file: !3, line: 336, column: 9)
!1236 = !DILocation(line: 337, column: 17, scope: !1235)
!1237 = !DILocation(line: 337, column: 37, scope: !1234)
!1238 = !DILocation(line: 338, column: 13, scope: !1235)
!1239 = !DILocation(line: 338, column: 20, scope: !1235)
!1240 = !DILocation(line: 338, column: 48, scope: !1235)
!1241 = !DILocation(line: 339, column: 13, scope: !1235)
!1242 = !DILocation(line: 339, column: 20, scope: !1235)
!1243 = !DILocation(line: 339, column: 45, scope: !1235)
!1244 = !DILocation(line: 340, column: 13, scope: !1235)
!1245 = !DILocation(line: 340, column: 20, scope: !1235)
!1246 = !DILocation(line: 340, column: 28, scope: !1235)
!1247 = !DILocation(line: 340, column: 37, scope: !1235)
!1248 = !DILocation(line: 341, column: 13, scope: !1235)
!1249 = !DILocation(line: 341, column: 20, scope: !1235)
!1250 = !DILocation(line: 341, column: 28, scope: !1235)
!1251 = !DILocation(line: 341, column: 42, scope: !1235)
!1252 = !DILocation(line: 342, column: 13, scope: !1235)
!1253 = !DILocation(line: 342, column: 20, scope: !1235)
!1254 = !DILocation(line: 342, column: 23, scope: !1235)
!1255 = !DILocation(line: 342, column: 37, scope: !1235)
!1256 = !DILocation(line: 343, column: 9, scope: !1235)
!1257 = !DILocation(line: 344, column: 28, scope: !1258)
!1258 = distinct !DILexicalBlock(scope: !1230, file: !3, line: 344, column: 18)
!1259 = !DILocation(line: 344, column: 19, scope: !1258)
!1260 = !DILocation(line: 344, column: 18, scope: !1230)
!1261 = !DILocation(line: 346, column: 32, scope: !1262)
!1262 = distinct !DILexicalBlock(scope: !1263, file: !3, line: 346, column: 17)
!1263 = distinct !DILexicalBlock(scope: !1258, file: !3, line: 345, column: 9)
!1264 = !DILocation(line: 346, column: 17, scope: !1263)
!1265 = !DILocation(line: 346, column: 37, scope: !1262)
!1266 = !DILocation(line: 347, column: 13, scope: !1263)
!1267 = !DILocation(line: 347, column: 20, scope: !1263)
!1268 = !DILocation(line: 347, column: 23, scope: !1263)
!1269 = !DILocation(line: 347, column: 33, scope: !1263)
!1270 = !DILocation(line: 348, column: 13, scope: !1263)
!1271 = !DILocation(line: 348, column: 20, scope: !1263)
!1272 = !DILocation(line: 348, column: 28, scope: !1263)
!1273 = !DILocation(line: 348, column: 34, scope: !1263)
!1274 = !DILocation(line: 349, column: 9, scope: !1263)
!1275 = !DILocation(line: 350, column: 28, scope: !1276)
!1276 = distinct !DILexicalBlock(scope: !1258, file: !3, line: 350, column: 18)
!1277 = !DILocation(line: 350, column: 19, scope: !1276)
!1278 = !DILocation(line: 350, column: 18, scope: !1258)
!1279 = !DILocation(line: 352, column: 32, scope: !1280)
!1280 = distinct !DILexicalBlock(scope: !1281, file: !3, line: 352, column: 17)
!1281 = distinct !DILexicalBlock(scope: !1276, file: !3, line: 351, column: 9)
!1282 = !DILocation(line: 352, column: 17, scope: !1281)
!1283 = !DILocation(line: 352, column: 37, scope: !1280)
!1284 = !DILocation(line: 353, column: 13, scope: !1281)
!1285 = !DILocation(line: 353, column: 20, scope: !1281)
!1286 = !DILocation(line: 353, column: 23, scope: !1281)
!1287 = !DILocation(line: 353, column: 33, scope: !1281)
!1288 = !DILocation(line: 354, column: 13, scope: !1281)
!1289 = !DILocation(line: 354, column: 20, scope: !1281)
!1290 = !DILocation(line: 354, column: 28, scope: !1281)
!1291 = !DILocation(line: 354, column: 34, scope: !1281)
!1292 = !DILocation(line: 355, column: 9, scope: !1281)
!1293 = !DILocation(line: 356, column: 28, scope: !1294)
!1294 = distinct !DILexicalBlock(scope: !1276, file: !3, line: 356, column: 18)
!1295 = !DILocation(line: 356, column: 19, scope: !1294)
!1296 = !DILocation(line: 356, column: 18, scope: !1276)
!1297 = !DILocation(line: 358, column: 13, scope: !1298)
!1298 = distinct !DILexicalBlock(scope: !1294, file: !3, line: 357, column: 9)
!1299 = !DILocation(line: 358, column: 20, scope: !1298)
!1300 = !DILocation(line: 358, column: 40, scope: !1298)
!1301 = !DILocation(line: 359, column: 13, scope: !1298)
!1302 = !DILocation(line: 359, column: 20, scope: !1298)
!1303 = !DILocation(line: 359, column: 28, scope: !1298)
!1304 = !DILocation(line: 360, column: 13, scope: !1298)
!1305 = !DILocation(line: 360, column: 20, scope: !1298)
!1306 = !DILocation(line: 360, column: 28, scope: !1298)
!1307 = !DILocation(line: 360, column: 46, scope: !1298)
!1308 = !DILocation(line: 361, column: 13, scope: !1298)
!1309 = !DILocation(line: 361, column: 20, scope: !1298)
!1310 = !DILocation(line: 361, column: 28, scope: !1298)
!1311 = !DILocation(line: 361, column: 44, scope: !1298)
!1312 = !DILocation(line: 362, column: 9, scope: !1298)
!1313 = !DILocation(line: 363, column: 28, scope: !1314)
!1314 = distinct !DILexicalBlock(scope: !1294, file: !3, line: 363, column: 18)
!1315 = !DILocation(line: 363, column: 19, scope: !1314)
!1316 = !DILocation(line: 363, column: 18, scope: !1294)
!1317 = !DILocation(line: 365, column: 13, scope: !1318)
!1318 = distinct !DILexicalBlock(scope: !1314, file: !3, line: 364, column: 9)
!1319 = !DILocation(line: 365, column: 20, scope: !1318)
!1320 = !DILocation(line: 365, column: 23, scope: !1318)
!1321 = !DILocation(line: 365, column: 35, scope: !1318)
!1322 = !DILocation(line: 366, column: 13, scope: !1318)
!1323 = !DILocation(line: 366, column: 20, scope: !1318)
!1324 = !DILocation(line: 366, column: 37, scope: !1318)
!1325 = !DILocation(line: 367, column: 13, scope: !1318)
!1326 = !DILocation(line: 367, column: 20, scope: !1318)
!1327 = !DILocation(line: 367, column: 29, scope: !1318)
!1328 = !DILocation(line: 368, column: 13, scope: !1318)
!1329 = !DILocation(line: 368, column: 20, scope: !1318)
!1330 = !DILocation(line: 368, column: 37, scope: !1318)
!1331 = !DILocation(line: 369, column: 13, scope: !1318)
!1332 = !DILocation(line: 369, column: 20, scope: !1318)
!1333 = !DILocation(line: 369, column: 32, scope: !1318)
!1334 = !DILocation(line: 370, column: 9, scope: !1318)
!1335 = !DILocation(line: 371, column: 28, scope: !1336)
!1336 = distinct !DILexicalBlock(scope: !1314, file: !3, line: 371, column: 18)
!1337 = !DILocation(line: 371, column: 19, scope: !1336)
!1338 = !DILocation(line: 371, column: 18, scope: !1314)
!1339 = !DILocation(line: 373, column: 32, scope: !1340)
!1340 = distinct !DILexicalBlock(scope: !1341, file: !3, line: 373, column: 17)
!1341 = distinct !DILexicalBlock(scope: !1336, file: !3, line: 372, column: 9)
!1342 = !DILocation(line: 373, column: 17, scope: !1341)
!1343 = !DILocation(line: 373, column: 37, scope: !1340)
!1344 = !DILocation(line: 374, column: 40, scope: !1341)
!1345 = !DILocation(line: 374, column: 47, scope: !1341)
!1346 = !DILocation(line: 374, column: 65, scope: !1341)
!1347 = !DILocation(line: 374, column: 71, scope: !1341)
!1348 = !DILocation(line: 374, column: 78, scope: !1341)
!1349 = !DILocation(line: 374, column: 95, scope: !1341)
!1350 = !DILocation(line: 374, column: 13, scope: !1341)
!1351 = !DILocation(line: 374, column: 20, scope: !1341)
!1352 = !DILocation(line: 374, column: 38, scope: !1341)
!1353 = !DILocation(line: 375, column: 13, scope: !1341)
!1354 = !DILocation(line: 375, column: 20, scope: !1341)
!1355 = !DILocation(line: 375, column: 48, scope: !1341)
!1356 = !DILocation(line: 376, column: 13, scope: !1341)
!1357 = !DILocation(line: 376, column: 20, scope: !1341)
!1358 = !DILocation(line: 376, column: 45, scope: !1341)
!1359 = !DILocation(line: 377, column: 13, scope: !1341)
!1360 = !DILocation(line: 377, column: 20, scope: !1341)
!1361 = !DILocation(line: 377, column: 28, scope: !1341)
!1362 = !DILocation(line: 377, column: 42, scope: !1341)
!1363 = !DILocation(line: 378, column: 13, scope: !1341)
!1364 = !DILocation(line: 378, column: 20, scope: !1341)
!1365 = !DILocation(line: 378, column: 23, scope: !1341)
!1366 = !DILocation(line: 378, column: 37, scope: !1341)
!1367 = !DILocation(line: 379, column: 17, scope: !1368)
!1368 = distinct !DILexicalBlock(scope: !1341, file: !3, line: 379, column: 17)
!1369 = !DILocation(line: 379, column: 24, scope: !1368)
!1370 = !DILocation(line: 379, column: 32, scope: !1368)
!1371 = !DILocation(line: 379, column: 38, scope: !1368)
!1372 = !DILocation(line: 379, column: 17, scope: !1341)
!1373 = !DILocation(line: 380, column: 17, scope: !1368)
!1374 = !DILocation(line: 380, column: 24, scope: !1368)
!1375 = !DILocation(line: 380, column: 32, scope: !1368)
!1376 = !DILocation(line: 380, column: 38, scope: !1368)
!1377 = !DILocation(line: 381, column: 9, scope: !1341)
!1378 = !DILocation(line: 384, column: 68, scope: !1379)
!1379 = distinct !DILexicalBlock(scope: !1336, file: !3, line: 383, column: 9)
!1380 = !DILocation(line: 384, column: 13, scope: !1379)
!1381 = !DILocation(line: 385, column: 24, scope: !1379)
!1382 = !DILocation(line: 385, column: 13, scope: !1379)
!1383 = !DILocation(line: 386, column: 13, scope: !1379)
!1384 = !DILocation(line: 388, column: 13, scope: !1126)
!1385 = !DILocation(line: 389, column: 9, scope: !1386)
!1386 = distinct !DILexicalBlock(scope: !1126, file: !3, line: 388, column: 13)
!1387 = !DILabel(scope: !1388, name: "psy_failure", file: !3, line: 390)
!1388 = distinct !DILexicalBlock(scope: !1386, file: !3, line: 389, column: 9)
!1389 = !DILocation(line: 390, column: 5, scope: !1388)
!1390 = !DILocation(line: 391, column: 100, scope: !1388)
!1391 = !DILocation(line: 391, column: 13, scope: !1388)
!1392 = !DILocation(line: 392, column: 9, scope: !1388)
!1393 = !DILocation(line: 393, column: 13, scope: !1126)
!1394 = !DILocation(line: 393, column: 11, scope: !1126)
!1395 = distinct !{!1395, !1122, !1396}
!1396 = !DILocation(line: 394, column: 5, scope: !1098)
!1397 = !DILocation(line: 395, column: 16, scope: !1098)
!1398 = !DILocation(line: 395, column: 5, scope: !1098)
!1399 = !DILocation(line: 396, column: 5, scope: !1098)
!1400 = !DILocation(line: 397, column: 1, scope: !1098)
!1401 = distinct !DISubprogram(name: "x264_param_apply_fastfirstpass", scope: !3, file: !3, line: 410, type: !133, scopeLine: 411, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !93)
!1402 = !DILocalVariable(name: "param", arg: 1, scope: !1401, file: !3, line: 410, type: !135)
!1403 = !DILocation(line: 410, column: 52, scope: !1401)
!1404 = !DILocation(line: 413, column: 9, scope: !1405)
!1405 = distinct !DILexicalBlock(scope: !1401, file: !3, line: 413, column: 9)
!1406 = !DILocation(line: 413, column: 16, scope: !1405)
!1407 = !DILocation(line: 413, column: 19, scope: !1405)
!1408 = !DILocation(line: 413, column: 32, scope: !1405)
!1409 = !DILocation(line: 413, column: 36, scope: !1405)
!1410 = !DILocation(line: 413, column: 43, scope: !1405)
!1411 = !DILocation(line: 413, column: 46, scope: !1405)
!1412 = !DILocation(line: 413, column: 9, scope: !1401)
!1413 = !DILocation(line: 415, column: 9, scope: !1414)
!1414 = distinct !DILexicalBlock(scope: !1405, file: !3, line: 414, column: 5)
!1415 = !DILocation(line: 415, column: 16, scope: !1414)
!1416 = !DILocation(line: 415, column: 34, scope: !1414)
!1417 = !DILocation(line: 416, column: 9, scope: !1414)
!1418 = !DILocation(line: 416, column: 16, scope: !1414)
!1419 = !DILocation(line: 416, column: 24, scope: !1414)
!1420 = !DILocation(line: 416, column: 40, scope: !1414)
!1421 = !DILocation(line: 417, column: 9, scope: !1414)
!1422 = !DILocation(line: 417, column: 16, scope: !1414)
!1423 = !DILocation(line: 417, column: 24, scope: !1414)
!1424 = !DILocation(line: 417, column: 30, scope: !1414)
!1425 = !DILocation(line: 418, column: 9, scope: !1414)
!1426 = !DILocation(line: 418, column: 16, scope: !1414)
!1427 = !DILocation(line: 418, column: 24, scope: !1414)
!1428 = !DILocation(line: 418, column: 36, scope: !1414)
!1429 = !DILocation(line: 419, column: 42, scope: !1414)
!1430 = !DILocation(line: 419, column: 9, scope: !1414)
!1431 = !DILocation(line: 419, column: 16, scope: !1414)
!1432 = !DILocation(line: 419, column: 24, scope: !1414)
!1433 = !DILocation(line: 419, column: 40, scope: !1414)
!1434 = !DILocation(line: 420, column: 9, scope: !1414)
!1435 = !DILocation(line: 420, column: 16, scope: !1414)
!1436 = !DILocation(line: 420, column: 24, scope: !1414)
!1437 = !DILocation(line: 420, column: 34, scope: !1414)
!1438 = !DILocation(line: 421, column: 9, scope: !1414)
!1439 = !DILocation(line: 421, column: 16, scope: !1414)
!1440 = !DILocation(line: 421, column: 24, scope: !1414)
!1441 = !DILocation(line: 421, column: 37, scope: !1414)
!1442 = !DILocation(line: 422, column: 5, scope: !1414)
!1443 = !DILocation(line: 423, column: 1, scope: !1401)
!1444 = distinct !DISubprogram(name: "x264_param_apply_profile", scope: !3, file: !3, line: 425, type: !750, scopeLine: 426, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !93)
!1445 = !DILocalVariable(name: "param", arg: 1, scope: !1444, file: !3, line: 425, type: !135)
!1446 = !DILocation(line: 425, column: 45, scope: !1444)
!1447 = !DILocalVariable(name: "profile", arg: 2, scope: !1444, file: !3, line: 425, type: !48)
!1448 = !DILocation(line: 425, column: 64, scope: !1444)
!1449 = !DILocation(line: 427, column: 10, scope: !1450)
!1450 = distinct !DILexicalBlock(scope: !1444, file: !3, line: 427, column: 9)
!1451 = !DILocation(line: 427, column: 9, scope: !1444)
!1452 = !DILocation(line: 428, column: 9, scope: !1450)
!1453 = !DILocation(line: 430, column: 18, scope: !1454)
!1454 = distinct !DILexicalBlock(scope: !1444, file: !3, line: 430, column: 9)
!1455 = !DILocation(line: 430, column: 10, scope: !1454)
!1456 = !DILocation(line: 430, column: 9, scope: !1444)
!1457 = !DILocation(line: 432, column: 9, scope: !1458)
!1458 = distinct !DILexicalBlock(scope: !1454, file: !3, line: 431, column: 5)
!1459 = !DILocation(line: 432, column: 16, scope: !1458)
!1460 = !DILocation(line: 432, column: 24, scope: !1458)
!1461 = !DILocation(line: 432, column: 40, scope: !1458)
!1462 = !DILocation(line: 433, column: 9, scope: !1458)
!1463 = !DILocation(line: 433, column: 16, scope: !1458)
!1464 = !DILocation(line: 433, column: 24, scope: !1458)
!1465 = !DILocation(line: 434, column: 9, scope: !1458)
!1466 = !DILocation(line: 434, column: 16, scope: !1458)
!1467 = !DILocation(line: 434, column: 29, scope: !1458)
!1468 = !DILocation(line: 435, column: 9, scope: !1458)
!1469 = !DILocation(line: 435, column: 16, scope: !1458)
!1470 = !DILocation(line: 435, column: 25, scope: !1458)
!1471 = !DILocation(line: 436, column: 9, scope: !1458)
!1472 = !DILocation(line: 436, column: 16, scope: !1458)
!1473 = !DILocation(line: 436, column: 24, scope: !1458)
!1474 = !DILocation(line: 436, column: 40, scope: !1458)
!1475 = !DILocation(line: 437, column: 13, scope: !1476)
!1476 = distinct !DILexicalBlock(scope: !1458, file: !3, line: 437, column: 13)
!1477 = !DILocation(line: 437, column: 20, scope: !1476)
!1478 = !DILocation(line: 437, column: 13, scope: !1458)
!1479 = !DILocation(line: 439, column: 13, scope: !1480)
!1480 = distinct !DILexicalBlock(scope: !1476, file: !3, line: 438, column: 9)
!1481 = !DILocation(line: 440, column: 13, scope: !1480)
!1482 = !DILocation(line: 442, column: 13, scope: !1483)
!1483 = distinct !DILexicalBlock(scope: !1458, file: !3, line: 442, column: 13)
!1484 = !DILocation(line: 442, column: 20, scope: !1483)
!1485 = !DILocation(line: 442, column: 13, scope: !1458)
!1486 = !DILocation(line: 443, column: 13, scope: !1483)
!1487 = !DILocation(line: 444, column: 5, scope: !1458)
!1488 = !DILocation(line: 445, column: 23, scope: !1489)
!1489 = distinct !DILexicalBlock(scope: !1454, file: !3, line: 445, column: 14)
!1490 = !DILocation(line: 445, column: 15, scope: !1489)
!1491 = !DILocation(line: 445, column: 14, scope: !1454)
!1492 = !DILocation(line: 447, column: 9, scope: !1493)
!1493 = distinct !DILexicalBlock(scope: !1489, file: !3, line: 446, column: 5)
!1494 = !DILocation(line: 447, column: 16, scope: !1493)
!1495 = !DILocation(line: 447, column: 24, scope: !1493)
!1496 = !DILocation(line: 447, column: 40, scope: !1493)
!1497 = !DILocation(line: 448, column: 9, scope: !1493)
!1498 = !DILocation(line: 448, column: 16, scope: !1493)
!1499 = !DILocation(line: 448, column: 29, scope: !1493)
!1500 = !DILocation(line: 449, column: 5, scope: !1493)
!1501 = !DILocation(line: 450, column: 23, scope: !1502)
!1502 = distinct !DILexicalBlock(scope: !1489, file: !3, line: 450, column: 14)
!1503 = !DILocation(line: 450, column: 15, scope: !1502)
!1504 = !DILocation(line: 450, column: 14, scope: !1489)
!1505 = !DILocation(line: 453, column: 5, scope: !1506)
!1506 = distinct !DILexicalBlock(scope: !1502, file: !3, line: 451, column: 5)
!1507 = !DILocation(line: 456, column: 66, scope: !1508)
!1508 = distinct !DILexicalBlock(scope: !1502, file: !3, line: 455, column: 5)
!1509 = !DILocation(line: 456, column: 9, scope: !1508)
!1510 = !DILocation(line: 457, column: 9, scope: !1508)
!1511 = !DILocation(line: 459, column: 10, scope: !1512)
!1512 = distinct !DILexicalBlock(scope: !1444, file: !3, line: 459, column: 9)
!1513 = !DILocation(line: 459, column: 17, scope: !1512)
!1514 = !DILocation(line: 459, column: 20, scope: !1512)
!1515 = !DILocation(line: 459, column: 32, scope: !1512)
!1516 = !DILocation(line: 459, column: 47, scope: !1512)
!1517 = !DILocation(line: 459, column: 50, scope: !1512)
!1518 = !DILocation(line: 459, column: 57, scope: !1512)
!1519 = !DILocation(line: 459, column: 60, scope: !1512)
!1520 = !DILocation(line: 459, column: 74, scope: !1512)
!1521 = !DILocation(line: 459, column: 80, scope: !1512)
!1522 = !DILocation(line: 460, column: 10, scope: !1512)
!1523 = !DILocation(line: 460, column: 17, scope: !1512)
!1524 = !DILocation(line: 460, column: 20, scope: !1512)
!1525 = !DILocation(line: 460, column: 32, scope: !1512)
!1526 = !DILocation(line: 460, column: 47, scope: !1512)
!1527 = !DILocation(line: 460, column: 50, scope: !1512)
!1528 = !DILocation(line: 460, column: 57, scope: !1512)
!1529 = !DILocation(line: 460, column: 60, scope: !1512)
!1530 = !DILocation(line: 460, column: 74, scope: !1512)
!1531 = !DILocation(line: 459, column: 9, scope: !1444)
!1532 = !DILocation(line: 462, column: 82, scope: !1533)
!1533 = distinct !DILexicalBlock(scope: !1512, file: !3, line: 461, column: 5)
!1534 = !DILocation(line: 462, column: 9, scope: !1533)
!1535 = !DILocation(line: 463, column: 9, scope: !1533)
!1536 = !DILocation(line: 465, column: 5, scope: !1444)
!1537 = !DILocation(line: 466, column: 1, scope: !1444)
!1538 = distinct !DISubprogram(name: "x264_log", scope: !3, file: !3, line: 973, type: !1539, scopeLine: 974, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !93)
!1539 = !DISubroutineType(types: !1540)
!1540 = !{null, !1541, !36, !48, null}
!1541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1542, size: 64)
!1542 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_t", file: !22, line: 46, baseType: !1543)
