; ModuleID = 'x264_src/encoder/ratecontrol.c'
source_filename = "x264_src/encoder/ratecontrol.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.x264_level_t = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }

!20 = !DIEnumerator(name: "I_PCM", value: 3, isUnsigned: true)
!21 = !DIEnumerator(name: "P_L0", value: 4, isUnsigned: true)
!22 = !DIEnumerator(name: "P_8x8", value: 5, isUnsigned: true)
!23 = !DIEnumerator(name: "P_SKIP", value: 6, isUnsigned: true)
!24 = !DIEnumerator(name: "B_DIRECT", value: 7, isUnsigned: true)
!25 = !DIEnumerator(name: "B_L0_L0", value: 8, isUnsigned: true)
!26 = !DIEnumerator(name: "B_L0_L1", value: 9, isUnsigned: true)
!27 = !DIEnumerator(name: "B_L0_BI", value: 10, isUnsigned: true)
!28 = !DIEnumerator(name: "B_L1_L0", value: 11, isUnsigned: true)
!29 = !DIEnumerator(name: "B_L1_L1", value: 12, isUnsigned: true)
!30 = !DIEnumerator(name: "B_L1_BI", value: 13, isUnsigned: true)
!31 = !DIEnumerator(name: "B_BI_L0", value: 14, isUnsigned: true)
!32 = !DIEnumerator(name: "B_BI_L1", value: 15, isUnsigned: true)
!33 = !DIEnumerator(name: "B_BI_BI", value: 16, isUnsigned: true)
!34 = !DIEnumerator(name: "B_8x8", value: 17, isUnsigned: true)
!35 = !DIEnumerator(name: "B_SKIP", value: 18, isUnsigned: true)
!36 = !DIEnumerator(name: "X264_MBTYPE_MAX", value: 19, isUnsigned: true)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !38, line: 30, baseType: !7, size: 32, elements: !39)
!38 = !DIFile(filename: "x264_src/common/pixel.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!39 = !{!40, !41, !42, !43, !44, !45, !46, !47, !48, !49}
!40 = !DIEnumerator(name: "PIXEL_16x16", value: 0, isUnsigned: true)
!41 = !DIEnumerator(name: "PIXEL_16x8", value: 1, isUnsigned: true)
!42 = !DIEnumerator(name: "PIXEL_8x16", value: 2, isUnsigned: true)
!43 = !DIEnumerator(name: "PIXEL_8x8", value: 3, isUnsigned: true)
!44 = !DIEnumerator(name: "PIXEL_8x4", value: 4, isUnsigned: true)
!45 = !DIEnumerator(name: "PIXEL_4x8", value: 5, isUnsigned: true)
!46 = !DIEnumerator(name: "PIXEL_4x4", value: 6, isUnsigned: true)
!47 = !DIEnumerator(name: "PIXEL_4x2", value: 7, isUnsigned: true)
!48 = !DIEnumerator(name: "PIXEL_2x4", value: 8, isUnsigned: true)
!49 = !DIEnumerator(name: "PIXEL_2x2", value: 9, isUnsigned: true)
!50 = !{!51, !52, !53, !58, !59, !60, !63}
!51 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!52 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !54, line: 25, baseType: !55)
!54 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !56, line: 39, baseType: !57)
!56 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!57 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!58 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !61, line: 26, baseType: !62)
!61 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !56, line: 42, baseType: !7)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !54, line: 27, baseType: !64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !56, line: 44, baseType: !65)
!65 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!66 = !{!0}
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 40, elements: !70)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!69 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!70 = !{!71}
!71 = !DISubrange(count: 5)
!72 = !{i32 7, !"Dwarf Version", i32 4}
!73 = !{i32 2, !"Debug Info Version", i32 3}
!74 = !{i32 1, !"wchar_size", i32 4}
!75 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!76 = distinct !DISubprogram(name: "x264_adaptive_quant_frame", scope: !3, file: !3, line: 236, type: !77, scopeLine: 237, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !1536)
!77 = !DISubroutineType(types: !78)
!78 = !{null, !79, !564}
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_t", file: !81, line: 46, baseType: !82)
!81 = !DIFile(filename: "x264_src/x264.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_t", file: !6, line: 381, size: 266752, elements: !83)
!83 = !{!84, !255, !259, !260, !261, !262, !263, !264, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !399, !401, !429, !431, !432, !433, !439, !443, !444, !445, !452, !456, !457, !458, !463, !466, !467, !542, !559, !719, !720, !721, !722, !726, !727, !728, !729, !730, !731, !732, !747, !941, !1111, !1168, !1171, !1173, !1175, !1176, !1179, !1184, !1193, !1194, !1202, !1204, !1209, !1284, !1368, !1412, !1434, !1483, !1512}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !82, file: !6, line: 384, baseType: !85, size: 5632)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !81, line: 376, baseType: !86)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !81, line: 176, size: 5632, elements: !87)
!87 = !{!88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !131, !138, !139, !140, !141, !145, !146, !159, !160, !161, !162, !163, !193, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !86, file: !81, line: 179, baseType: !7, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !86, file: !81, line: 180, baseType: !51, size: 32, offset: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !86, file: !81, line: 181, baseType: !51, size: 32, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !86, file: !81, line: 182, baseType: !51, size: 32, offset: 96)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !86, file: !81, line: 183, baseType: !51, size: 32, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !86, file: !81, line: 186, baseType: !51, size: 32, offset: 160)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !86, file: !81, line: 187, baseType: !51, size: 32, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !86, file: !81, line: 188, baseType: !51, size: 32, offset: 224)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !86, file: !81, line: 189, baseType: !51, size: 32, offset: 256)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !86, file: !81, line: 190, baseType: !51, size: 32, offset: 288)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !86, file: !81, line: 198, baseType: !51, size: 32, offset: 320)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !86, file: !81, line: 215, baseType: !100, size: 288, offset: 352)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !86, file: !81, line: 200, size: 288, elements: !101)
!101 = !{!102, !103, !104, !105, !106, !107, !108, !109, !110}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !100, file: !81, line: 203, baseType: !51, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !100, file: !81, line: 204, baseType: !51, size: 32, offset: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !100, file: !81, line: 206, baseType: !51, size: 32, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !100, file: !81, line: 209, baseType: !51, size: 32, offset: 96)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !100, file: !81, line: 210, baseType: !51, size: 32, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !100, file: !81, line: 211, baseType: !51, size: 32, offset: 160)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !100, file: !81, line: 212, baseType: !51, size: 32, offset: 192)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !100, file: !81, line: 213, baseType: !51, size: 32, offset: 224)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !100, file: !81, line: 214, baseType: !51, size: 32, offset: 256)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !86, file: !81, line: 218, baseType: !51, size: 32, offset: 640)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !86, file: !81, line: 219, baseType: !51, size: 32, offset: 672)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !86, file: !81, line: 220, baseType: !51, size: 32, offset: 704)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !86, file: !81, line: 221, baseType: !51, size: 32, offset: 736)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !86, file: !81, line: 222, baseType: !51, size: 32, offset: 768)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !86, file: !81, line: 224, baseType: !51, size: 32, offset: 800)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !86, file: !81, line: 225, baseType: !51, size: 32, offset: 832)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !86, file: !81, line: 226, baseType: !51, size: 32, offset: 864)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !86, file: !81, line: 227, baseType: !51, size: 32, offset: 896)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !86, file: !81, line: 229, baseType: !51, size: 32, offset: 928)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !86, file: !81, line: 230, baseType: !51, size: 32, offset: 960)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !86, file: !81, line: 231, baseType: !51, size: 32, offset: 992)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !86, file: !81, line: 233, baseType: !51, size: 32, offset: 1024)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !86, file: !81, line: 234, baseType: !51, size: 32, offset: 1056)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !86, file: !81, line: 236, baseType: !51, size: 32, offset: 1088)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !86, file: !81, line: 237, baseType: !51, size: 32, offset: 1120)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !86, file: !81, line: 239, baseType: !51, size: 32, offset: 1152)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !86, file: !81, line: 240, baseType: !129, size: 64, offset: 1216)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !86, file: !81, line: 241, baseType: !132, size: 128, offset: 1280)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 128, elements: !136)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !61, line: 24, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !56, line: 38, baseType: !135)
!135 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!136 = !{!137}
!137 = !DISubrange(count: 16)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !86, file: !81, line: 242, baseType: !132, size: 128, offset: 1408)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !86, file: !81, line: 243, baseType: !132, size: 128, offset: 1536)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !86, file: !81, line: 244, baseType: !132, size: 128, offset: 1664)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !86, file: !81, line: 245, baseType: !142, size: 512, offset: 1792)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 512, elements: !143)
!143 = !{!144}
!144 = !DISubrange(count: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !86, file: !81, line: 246, baseType: !142, size: 512, offset: 2304)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !86, file: !81, line: 249, baseType: !147, size: 64, offset: 2816)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{null, !59, !51, !150, !152}
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, size: 192, elements: !154)
!154 = !{!155, !156, !157, !158}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !153, file: !3, baseType: !7, size: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !153, file: !3, baseType: !7, size: 32, offset: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !153, file: !3, baseType: !59, size: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !153, file: !3, baseType: !59, size: 64, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !86, file: !81, line: 250, baseType: !59, size: 64, offset: 2880)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !86, file: !81, line: 251, baseType: !51, size: 32, offset: 2944)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !86, file: !81, line: 252, baseType: !51, size: 32, offset: 2976)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !86, file: !81, line: 253, baseType: !129, size: 64, offset: 3008)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !86, file: !81, line: 287, baseType: !164, size: 800, offset: 3072)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !86, file: !81, line: 256, size: 800, elements: !165)
!165 = !{!166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !191, !192}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !164, file: !81, line: 258, baseType: !7, size: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !164, file: !81, line: 259, baseType: !7, size: 32, offset: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !164, file: !81, line: 261, baseType: !51, size: 32, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !164, file: !81, line: 262, baseType: !51, size: 32, offset: 96)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !164, file: !81, line: 263, baseType: !51, size: 32, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !164, file: !81, line: 264, baseType: !51, size: 32, offset: 160)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !164, file: !81, line: 265, baseType: !51, size: 32, offset: 192)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !164, file: !81, line: 267, baseType: !51, size: 32, offset: 224)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !164, file: !81, line: 268, baseType: !51, size: 32, offset: 256)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !164, file: !81, line: 269, baseType: !51, size: 32, offset: 288)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !164, file: !81, line: 270, baseType: !51, size: 32, offset: 320)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !164, file: !81, line: 271, baseType: !51, size: 32, offset: 352)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !164, file: !81, line: 272, baseType: !51, size: 32, offset: 384)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !164, file: !81, line: 273, baseType: !51, size: 32, offset: 416)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !164, file: !81, line: 274, baseType: !51, size: 32, offset: 448)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !164, file: !81, line: 275, baseType: !51, size: 32, offset: 480)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !164, file: !81, line: 276, baseType: !51, size: 32, offset: 512)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !164, file: !81, line: 277, baseType: !51, size: 32, offset: 544)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !164, file: !81, line: 278, baseType: !52, size: 32, offset: 576)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !164, file: !81, line: 279, baseType: !52, size: 32, offset: 608)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !164, file: !81, line: 280, baseType: !51, size: 32, offset: 640)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !164, file: !81, line: 283, baseType: !188, size: 64, offset: 672)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 64, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 2)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !164, file: !81, line: 285, baseType: !51, size: 32, offset: 736)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !164, file: !81, line: 286, baseType: !51, size: 32, offset: 768)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !86, file: !81, line: 327, baseType: !194, size: 1152, offset: 3904)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !86, file: !81, line: 290, size: 1152, elements: !195)
!195 = !{!196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !233, !234}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !194, file: !81, line: 292, baseType: !51, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !194, file: !81, line: 294, baseType: !51, size: 32, offset: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !194, file: !81, line: 295, baseType: !51, size: 32, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !194, file: !81, line: 296, baseType: !51, size: 32, offset: 96)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !194, file: !81, line: 297, baseType: !51, size: 32, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !194, file: !81, line: 299, baseType: !51, size: 32, offset: 160)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !194, file: !81, line: 300, baseType: !52, size: 32, offset: 192)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !194, file: !81, line: 301, baseType: !52, size: 32, offset: 224)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !194, file: !81, line: 302, baseType: !52, size: 32, offset: 256)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !194, file: !81, line: 303, baseType: !51, size: 32, offset: 288)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !194, file: !81, line: 304, baseType: !51, size: 32, offset: 320)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !194, file: !81, line: 305, baseType: !52, size: 32, offset: 352)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !194, file: !81, line: 306, baseType: !52, size: 32, offset: 384)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !194, file: !81, line: 307, baseType: !52, size: 32, offset: 416)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !194, file: !81, line: 309, baseType: !51, size: 32, offset: 448)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !194, file: !81, line: 310, baseType: !52, size: 32, offset: 480)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !194, file: !81, line: 311, baseType: !51, size: 32, offset: 512)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !194, file: !81, line: 312, baseType: !51, size: 32, offset: 544)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !194, file: !81, line: 315, baseType: !51, size: 32, offset: 576)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !194, file: !81, line: 316, baseType: !129, size: 64, offset: 640)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !194, file: !81, line: 317, baseType: !51, size: 32, offset: 704)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !194, file: !81, line: 318, baseType: !129, size: 64, offset: 768)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !194, file: !81, line: 321, baseType: !52, size: 32, offset: 832)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !194, file: !81, line: 322, baseType: !52, size: 32, offset: 864)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !194, file: !81, line: 323, baseType: !52, size: 32, offset: 896)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !194, file: !81, line: 324, baseType: !222, size: 64, offset: 960)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !81, line: 174, baseType: !224)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !81, line: 167, size: 256, elements: !225)
!225 = !{!226, !227, !228, !229, !230, !231}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !224, file: !81, line: 169, baseType: !51, size: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !224, file: !81, line: 169, baseType: !51, size: 32, offset: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !224, file: !81, line: 170, baseType: !51, size: 32, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !224, file: !81, line: 171, baseType: !51, size: 32, offset: 96)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !224, file: !81, line: 172, baseType: !52, size: 32, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !224, file: !81, line: 173, baseType: !232, size: 64, offset: 192)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !194, file: !81, line: 325, baseType: !51, size: 32, offset: 1024)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !194, file: !81, line: 326, baseType: !129, size: 64, offset: 1088)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !86, file: !81, line: 330, baseType: !51, size: 32, offset: 5056)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !86, file: !81, line: 331, baseType: !51, size: 32, offset: 5088)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !86, file: !81, line: 332, baseType: !51, size: 32, offset: 5120)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !86, file: !81, line: 334, baseType: !51, size: 32, offset: 5152)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !86, file: !81, line: 335, baseType: !51, size: 32, offset: 5184)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !86, file: !81, line: 336, baseType: !60, size: 32, offset: 5216)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !86, file: !81, line: 337, baseType: !60, size: 32, offset: 5248)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !86, file: !81, line: 338, baseType: !60, size: 32, offset: 5280)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !86, file: !81, line: 339, baseType: !60, size: 32, offset: 5312)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !86, file: !81, line: 340, baseType: !51, size: 32, offset: 5344)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !86, file: !81, line: 344, baseType: !51, size: 32, offset: 5376)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !86, file: !81, line: 356, baseType: !51, size: 32, offset: 5408)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !86, file: !81, line: 364, baseType: !51, size: 32, offset: 5440)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !86, file: !81, line: 367, baseType: !51, size: 32, offset: 5472)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !86, file: !81, line: 368, baseType: !51, size: 32, offset: 5504)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !86, file: !81, line: 369, baseType: !51, size: 32, offset: 5536)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !86, file: !81, line: 375, baseType: !252, size: 64, offset: 5568)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DISubroutineType(types: !254)
!254 = !{null, !59}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !82, file: !6, line: 386, baseType: !256, size: 8256, offset: 5632)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 8256, elements: !257)
!257 = !{!258}
!258 = !DISubrange(count: 129)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "thread_handle", scope: !82, file: !6, line: 387, baseType: !51, size: 32, offset: 13888)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "b_thread_active", scope: !82, file: !6, line: 388, baseType: !51, size: 32, offset: 13920)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_phase", scope: !82, file: !6, line: 389, baseType: !51, size: 32, offset: 13952)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_start", scope: !82, file: !6, line: 390, baseType: !51, size: 32, offset: 13984)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_end", scope: !82, file: !6, line: 391, baseType: !51, size: 32, offset: 14016)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !82, file: !6, line: 402, baseType: !265, size: 576, offset: 14080)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !82, file: !6, line: 394, size: 576, elements: !266)
!266 = !{!267, !268, !269, !279, !280, !281}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal", scope: !265, file: !6, line: 396, baseType: !51, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "i_nals_allocated", scope: !265, file: !6, line: 397, baseType: !51, size: 32, offset: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "nal", scope: !265, file: !6, line: 398, baseType: !270, size: 64, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !81, line: 604, baseType: !272)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !81, line: 593, size: 192, elements: !273)
!273 = !{!274, !275, !276, !277}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !272, file: !81, line: 595, baseType: !51, size: 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !272, file: !81, line: 596, baseType: !51, size: 32, offset: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !272, file: !81, line: 599, baseType: !51, size: 32, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !272, file: !81, line: 603, baseType: !278, size: 64, offset: 128)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitstream", scope: !265, file: !6, line: 399, baseType: !51, size: 32, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "p_bitstream", scope: !265, file: !6, line: 400, baseType: !278, size: 64, offset: 192)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !265, file: !6, line: 401, baseType: !282, size: 320, offset: 256)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "bs_t", file: !283, line: 56, baseType: !284)
!283 = !DIFile(filename: "x264_src/common/bs.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bs_s", file: !283, line: 47, size: 320, elements: !285)
!285 = !{!286, !287, !288, !289, !292, !293}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !284, file: !283, line: 49, baseType: !278, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !284, file: !283, line: 50, baseType: !278, size: 64, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !284, file: !283, line: 51, baseType: !278, size: 64, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "cur_bits", scope: !284, file: !283, line: 53, baseType: !290, size: 64, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !291, line: 87, baseType: !65)
!291 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!292 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !284, file: !283, line: 54, baseType: !51, size: 32, offset: 256)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "i_bits_encoded", scope: !284, file: !283, line: 55, baseType: !51, size: 32, offset: 288)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer", scope: !82, file: !6, line: 404, baseType: !278, size: 64, offset: 14656)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer_size", scope: !82, file: !6, line: 405, baseType: !51, size: 32, offset: 14720)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !82, file: !6, line: 410, baseType: !51, size: 32, offset: 14752)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !82, file: !6, line: 411, baseType: !51, size: 32, offset: 14784)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_frames", scope: !82, file: !6, line: 413, baseType: !51, size: 32, offset: 14816)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_type", scope: !82, file: !6, line: 415, baseType: !51, size: 32, offset: 14848)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_ref_idc", scope: !82, file: !6, line: 416, baseType: !51, size: 32, offset: 14880)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields", scope: !82, file: !6, line: 418, baseType: !51, size: 32, offset: 14912)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields_last_frame", scope: !82, file: !6, line: 419, baseType: !51, size: 32, offset: 14944)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_duration", scope: !82, file: !6, line: 420, baseType: !51, size: 32, offset: 14976)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields", scope: !82, file: !6, line: 421, baseType: !51, size: 32, offset: 15008)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !82, file: !6, line: 422, baseType: !51, size: 32, offset: 15040)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !82, file: !6, line: 424, baseType: !51, size: 32, offset: 15072)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !82, file: !6, line: 425, baseType: !51, size: 32, offset: 15104)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "b_queued_intra_refresh", scope: !82, file: !6, line: 427, baseType: !51, size: 32, offset: 15136)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "sps_array", scope: !82, file: !6, line: 430, baseType: !310, size: 10400, offset: 15168)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !311, size: 10400, elements: !397)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_sps_t", file: !312, line: 154, baseType: !313)
!312 = !DIFile(filename: "x264_src/common/set.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !312, line: 52, size: 10400, elements: !314)
!314 = !{!315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !332, !333, !334, !335, !336, !337, !338, !339, !340, !347, !348, !396}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !313, file: !312, line: 54, baseType: !51, size: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "i_profile_idc", scope: !313, file: !312, line: 56, baseType: !51, size: 32, offset: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !313, file: !312, line: 57, baseType: !51, size: 32, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set0", scope: !313, file: !312, line: 59, baseType: !51, size: 32, offset: 96)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set1", scope: !313, file: !312, line: 60, baseType: !51, size: 32, offset: 128)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set2", scope: !313, file: !312, line: 61, baseType: !51, size: 32, offset: 160)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_frame_num", scope: !313, file: !312, line: 63, baseType: !51, size: 32, offset: 192)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_type", scope: !313, file: !312, line: 65, baseType: !51, size: 32, offset: 224)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_poc_lsb", scope: !313, file: !312, line: 67, baseType: !51, size: 32, offset: 256)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "b_delta_pic_order_always_zero", scope: !313, file: !312, line: 69, baseType: !51, size: 32, offset: 288)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_non_ref_pic", scope: !313, file: !312, line: 70, baseType: !51, size: 32, offset: 320)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_top_to_bottom_field", scope: !313, file: !312, line: 71, baseType: !51, size: 32, offset: 352)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames_in_poc_cycle", scope: !313, file: !312, line: 72, baseType: !51, size: 32, offset: 384)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_ref_frame", scope: !313, file: !312, line: 73, baseType: !329, size: 8192, offset: 416)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 8192, elements: !330)
!330 = !{!331}
!331 = !DISubrange(count: 256)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames", scope: !313, file: !312, line: 75, baseType: !51, size: 32, offset: 8608)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "b_gaps_in_frame_num_value_allowed", scope: !313, file: !312, line: 76, baseType: !51, size: 32, offset: 8640)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_width", scope: !313, file: !312, line: 77, baseType: !51, size: 32, offset: 8672)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_height", scope: !313, file: !312, line: 78, baseType: !51, size: 32, offset: 8704)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_mbs_only", scope: !313, file: !312, line: 79, baseType: !51, size: 32, offset: 8736)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_adaptive_frame_field", scope: !313, file: !312, line: 80, baseType: !51, size: 32, offset: 8768)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct8x8_inference", scope: !313, file: !312, line: 81, baseType: !51, size: 32, offset: 8800)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "b_crop", scope: !313, file: !312, line: 83, baseType: !51, size: 32, offset: 8832)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !313, file: !312, line: 90, baseType: !341, size: 128, offset: 8864)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !313, file: !312, line: 84, size: 128, elements: !342)
!342 = !{!343, !344, !345, !346}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !341, file: !312, line: 86, baseType: !51, size: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "i_right", scope: !341, file: !312, line: 87, baseType: !51, size: 32, offset: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "i_top", scope: !341, file: !312, line: 88, baseType: !51, size: 32, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "i_bottom", scope: !341, file: !312, line: 89, baseType: !51, size: 32, offset: 96)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "b_vui", scope: !313, file: !312, line: 92, baseType: !51, size: 32, offset: 8992)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !313, file: !312, line: 150, baseType: !349, size: 1344, offset: 9024)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !313, file: !312, line: 93, size: 1344, elements: !350)
!350 = !{!351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !387, !388, !389, !390, !391, !392, !393, !394, !395}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "b_aspect_ratio_info_present", scope: !349, file: !312, line: 95, baseType: !51, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !349, file: !312, line: 96, baseType: !51, size: 32, offset: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !349, file: !312, line: 97, baseType: !51, size: 32, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info_present", scope: !349, file: !312, line: 99, baseType: !51, size: 32, offset: 96)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info", scope: !349, file: !312, line: 100, baseType: !51, size: 32, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "b_signal_type_present", scope: !349, file: !312, line: 102, baseType: !51, size: 32, offset: 160)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !349, file: !312, line: 103, baseType: !51, size: 32, offset: 192)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !349, file: !312, line: 104, baseType: !51, size: 32, offset: 224)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "b_color_description_present", scope: !349, file: !312, line: 105, baseType: !51, size: 32, offset: 256)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !349, file: !312, line: 106, baseType: !51, size: 32, offset: 288)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !349, file: !312, line: 107, baseType: !51, size: 32, offset: 320)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !349, file: !312, line: 108, baseType: !51, size: 32, offset: 352)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_loc_info_present", scope: !349, file: !312, line: 110, baseType: !51, size: 32, offset: 384)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_top", scope: !349, file: !312, line: 111, baseType: !51, size: 32, offset: 416)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_bottom", scope: !349, file: !312, line: 112, baseType: !51, size: 32, offset: 448)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "b_timing_info_present", scope: !349, file: !312, line: 114, baseType: !51, size: 32, offset: 480)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_units_in_tick", scope: !349, file: !312, line: 115, baseType: !60, size: 32, offset: 512)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_scale", scope: !349, file: !312, line: 116, baseType: !60, size: 32, offset: 544)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "b_fixed_frame_rate", scope: !349, file: !312, line: 117, baseType: !51, size: 32, offset: 576)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "b_nal_hrd_parameters_present", scope: !349, file: !312, line: 119, baseType: !51, size: 32, offset: 608)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "b_vcl_hrd_parameters_present", scope: !349, file: !312, line: 120, baseType: !51, size: 32, offset: 640)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "hrd", scope: !349, file: !312, line: 137, baseType: !373, size: 384, offset: 672)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !349, file: !312, line: 122, size: 384, elements: !374)
!374 = !{!375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_cnt", scope: !373, file: !312, line: 124, baseType: !51, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_scale", scope: !373, file: !312, line: 125, baseType: !51, size: 32, offset: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_scale", scope: !373, file: !312, line: 126, baseType: !51, size: 32, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_value", scope: !373, file: !312, line: 127, baseType: !51, size: 32, offset: 96)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_value", scope: !373, file: !312, line: 128, baseType: !51, size: 32, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_unscaled", scope: !373, file: !312, line: 129, baseType: !51, size: 32, offset: 160)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_unscaled", scope: !373, file: !312, line: 130, baseType: !51, size: 32, offset: 192)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "b_cbr_hrd", scope: !373, file: !312, line: 131, baseType: !51, size: 32, offset: 224)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "i_initial_cpb_removal_delay_length", scope: !373, file: !312, line: 133, baseType: !51, size: 32, offset: 256)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_removal_delay_length", scope: !373, file: !312, line: 134, baseType: !51, size: 32, offset: 288)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay_length", scope: !373, file: !312, line: 135, baseType: !51, size: 32, offset: 320)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_offset_length", scope: !373, file: !312, line: 136, baseType: !51, size: 32, offset: 352)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct_present", scope: !349, file: !312, line: 139, baseType: !51, size: 32, offset: 1056)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "b_bitstream_restriction", scope: !349, file: !312, line: 140, baseType: !51, size: 32, offset: 1088)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "b_motion_vectors_over_pic_boundaries", scope: !349, file: !312, line: 141, baseType: !51, size: 32, offset: 1120)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bytes_per_pic_denom", scope: !349, file: !312, line: 142, baseType: !51, size: 32, offset: 1152)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bits_per_mb_denom", scope: !349, file: !312, line: 143, baseType: !51, size: 32, offset: 1184)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_horizontal", scope: !349, file: !312, line: 144, baseType: !51, size: 32, offset: 1216)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_vertical", scope: !349, file: !312, line: 145, baseType: !51, size: 32, offset: 1248)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_reorder_frames", scope: !349, file: !312, line: 146, baseType: !51, size: 32, offset: 1280)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dec_frame_buffering", scope: !349, file: !312, line: 147, baseType: !51, size: 32, offset: 1312)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "b_qpprime_y_zero_transform_bypass", scope: !313, file: !312, line: 152, baseType: !51, size: 32, offset: 10368)
!397 = !{!398}
!398 = !DISubrange(count: 1)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !82, file: !6, line: 431, baseType: !400, size: 64, offset: 25600)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "pps_array", scope: !82, file: !6, line: 432, baseType: !402, size: 960, offset: 25664)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !403, size: 960, elements: !397)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pps_t", file: !312, line: 186, baseType: !404)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !312, line: 156, size: 960, elements: !405)
!405 = !{!406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !404, file: !312, line: 158, baseType: !51, size: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !404, file: !312, line: 159, baseType: !51, size: 32, offset: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !404, file: !312, line: 161, baseType: !51, size: 32, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_order", scope: !404, file: !312, line: 163, baseType: !51, size: 32, offset: 96)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_slice_groups", scope: !404, file: !312, line: 164, baseType: !51, size: 32, offset: 128)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_default_active", scope: !404, file: !312, line: 166, baseType: !51, size: 32, offset: 160)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_default_active", scope: !404, file: !312, line: 167, baseType: !51, size: 32, offset: 192)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_pred", scope: !404, file: !312, line: 169, baseType: !51, size: 32, offset: 224)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !404, file: !312, line: 170, baseType: !51, size: 32, offset: 256)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qp", scope: !404, file: !312, line: 172, baseType: !51, size: 32, offset: 288)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qs", scope: !404, file: !312, line: 173, baseType: !51, size: 32, offset: 320)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_index_offset", scope: !404, file: !312, line: 175, baseType: !51, size: 32, offset: 352)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter_control", scope: !404, file: !312, line: 177, baseType: !51, size: 32, offset: 384)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra_pred", scope: !404, file: !312, line: 178, baseType: !51, size: 32, offset: 416)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "b_redundant_pic_cnt", scope: !404, file: !312, line: 179, baseType: !51, size: 32, offset: 448)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8_mode", scope: !404, file: !312, line: 181, baseType: !51, size: 32, offset: 480)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !404, file: !312, line: 183, baseType: !51, size: 32, offset: 512)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !404, file: !312, line: 184, baseType: !424, size: 384, offset: 576)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 384, elements: !427)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!427 = !{!428}
!428 = !DISubrange(count: 6)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !82, file: !6, line: 433, baseType: !430, size: 64, offset: 26624)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !82, file: !6, line: 434, baseType: !51, size: 32, offset: 26688)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts_compress_multiplier", scope: !82, file: !6, line: 437, baseType: !51, size: 32, offset: 26720)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_mf", scope: !82, file: !6, line: 440, baseType: !434, size: 256, offset: 26752)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !435, size: 256, elements: !437)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 512, elements: !136)
!437 = !{!438}
!438 = !DISubrange(count: 4)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_mf", scope: !82, file: !6, line: 441, baseType: !440, size: 128, offset: 27008)
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !441, size: 128, elements: !189)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 2048, elements: !143)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "unquant4_mf", scope: !82, file: !6, line: 443, baseType: !434, size: 256, offset: 27136)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "unquant8_mf", scope: !82, file: !6, line: 444, baseType: !440, size: 128, offset: 27392)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_mf", scope: !82, file: !6, line: 446, baseType: !446, size: 256, offset: 27520)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !447, size: 256, elements: !437)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !449, size: 256, elements: !136)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !61, line: 25, baseType: !450)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !56, line: 40, baseType: !451)
!451 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_mf", scope: !82, file: !6, line: 447, baseType: !453, size: 128, offset: 27776)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !454, size: 128, elements: !189)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !449, size: 1024, elements: !143)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_bias", scope: !82, file: !6, line: 448, baseType: !446, size: 256, offset: 27904)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_bias", scope: !82, file: !6, line: 449, baseType: !453, size: 128, offset: 28160)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv", scope: !82, file: !6, line: 454, baseType: !459, size: 5888, offset: 28288)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 5888, elements: !461)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!461 = !{!462}
!462 = !DISubrange(count: 92)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv_fpel", scope: !82, file: !6, line: 455, baseType: !464, size: 23552, offset: 34176)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 23552, elements: !465)
!465 = !{!462, !438}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !82, file: !6, line: 457, baseType: !425, size: 64, offset: 57728)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !82, file: !6, line: 460, baseType: !468, size: 53376, offset: 57856)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_slice_header_t", file: !6, line: 364, baseType: !469)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 302, size: 53376, elements: !470)
!470 = !{!471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !499, !526, !527, !528, !534, !535, !536, !537, !538, !539, !540, !541}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !469, file: !6, line: 304, baseType: !400, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !469, file: !6, line: 305, baseType: !430, size: 64, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !469, file: !6, line: 307, baseType: !51, size: 32, offset: 128)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "i_first_mb", scope: !469, file: !6, line: 308, baseType: !51, size: 32, offset: 160)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_mb", scope: !469, file: !6, line: 309, baseType: !51, size: 32, offset: 192)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "i_pps_id", scope: !469, file: !6, line: 311, baseType: !51, size: 32, offset: 224)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !469, file: !6, line: 313, baseType: !51, size: 32, offset: 256)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "b_mbaff", scope: !469, file: !6, line: 315, baseType: !51, size: 32, offset: 288)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "b_field_pic", scope: !469, file: !6, line: 316, baseType: !51, size: 32, offset: 320)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "b_bottom_field", scope: !469, file: !6, line: 317, baseType: !51, size: 32, offset: 352)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !469, file: !6, line: 319, baseType: !51, size: 32, offset: 384)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !469, file: !6, line: 321, baseType: !51, size: 32, offset: 416)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc_bottom", scope: !469, file: !6, line: 322, baseType: !51, size: 32, offset: 448)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc", scope: !469, file: !6, line: 324, baseType: !188, size: 64, offset: 480)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "i_redundant_pic_cnt", scope: !469, file: !6, line: 325, baseType: !51, size: 32, offset: 544)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_spatial_mv_pred", scope: !469, file: !6, line: 327, baseType: !51, size: 32, offset: 576)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "b_num_ref_idx_override", scope: !469, file: !6, line: 329, baseType: !51, size: 32, offset: 608)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !469, file: !6, line: 330, baseType: !51, size: 32, offset: 640)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !469, file: !6, line: 331, baseType: !51, size: 32, offset: 672)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l0", scope: !469, file: !6, line: 333, baseType: !51, size: 32, offset: 704)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l1", scope: !469, file: !6, line: 334, baseType: !51, size: 32, offset: 736)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_order", scope: !469, file: !6, line: 339, baseType: !493, size: 2048, offset: 768)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 2048, elements: !498)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !469, file: !6, line: 335, size: 64, elements: !495)
!495 = !{!496, !497}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "idc", scope: !494, file: !6, line: 337, baseType: !51, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !494, file: !6, line: 338, baseType: !51, size: 32, offset: 32)
!498 = !{!190, !137}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !469, file: !6, line: 342, baseType: !500, size: 49152, offset: 2816)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 49152, elements: !523)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_weight_t", file: !502, line: 36, baseType: !503, align: 128)
!502 = !DIFile(filename: "x264_src/common/mc.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_weight_t", file: !502, line: 26, size: 512, elements: !504)
!504 = !{!505, !509, !510, !513, !514, !515}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "cachea", scope: !503, file: !502, line: 30, baseType: !506, size: 128, align: 128)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 128, elements: !507)
!507 = !{!508}
!508 = !DISubrange(count: 8)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "cacheb", scope: !503, file: !502, line: 31, baseType: !506, size: 128, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "i_denom", scope: !503, file: !502, line: 32, baseType: !511, size: 32, offset: 256)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !54, line: 26, baseType: !512)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !56, line: 41, baseType: !51)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "i_scale", scope: !503, file: !502, line: 33, baseType: !511, size: 32, offset: 288)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset", scope: !503, file: !502, line: 34, baseType: !511, size: 32, offset: 320)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "weightfn", scope: !503, file: !502, line: 35, baseType: !516, size: 64, offset: 384)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "weight_fn_t", file: !502, line: 25, baseType: !518)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DISubroutineType(types: !520)
!520 = !{null, !278, !51, !278, !51, !521, !51}
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !503)
!523 = !{!524, !525}
!524 = !DISubrange(count: 32)
!525 = !DISubrange(count: 3)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_remove_from_end", scope: !469, file: !6, line: 344, baseType: !51, size: 32, offset: 51968)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_command_count", scope: !469, file: !6, line: 345, baseType: !51, size: 32, offset: 52000)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "mmco", scope: !469, file: !6, line: 350, baseType: !529, size: 1024, offset: 52032)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !530, size: 1024, elements: !136)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !469, file: !6, line: 346, size: 64, elements: !531)
!531 = !{!532, !533}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "i_difference_of_pic_nums", scope: !530, file: !6, line: 348, baseType: !51, size: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !530, file: !6, line: 349, baseType: !51, size: 32, offset: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !469, file: !6, line: 352, baseType: !51, size: 32, offset: 53056)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !469, file: !6, line: 354, baseType: !51, size: 32, offset: 53088)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_delta", scope: !469, file: !6, line: 355, baseType: !51, size: 32, offset: 53120)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "b_sp_for_swidth", scope: !469, file: !6, line: 356, baseType: !51, size: 32, offset: 53152)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "i_qs_delta", scope: !469, file: !6, line: 357, baseType: !51, size: 32, offset: 53184)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "i_disable_deblocking_filter_idc", scope: !469, file: !6, line: 360, baseType: !51, size: 32, offset: 53216)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "i_alpha_c0_offset", scope: !469, file: !6, line: 361, baseType: !51, size: 32, offset: 53248)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "i_beta_offset", scope: !469, file: !6, line: 362, baseType: !51, size: 32, offset: 53280)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !82, file: !6, line: 463, baseType: !543, size: 4096, offset: 111232)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_cabac_t", file: !544, line: 46, baseType: !545)
!544 = !DIFile(filename: "x264_src/common/cabac.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !544, line: 27, size: 4096, elements: !546)
!546 = !{!547, !548, !549, !550, !551, !552, !553, !554, !555}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "i_low", scope: !545, file: !544, line: 30, baseType: !51, size: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "i_range", scope: !545, file: !544, line: 31, baseType: !51, size: 32, offset: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "i_queue", scope: !545, file: !544, line: 34, baseType: !51, size: 32, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "i_bytes_outstanding", scope: !545, file: !544, line: 35, baseType: !51, size: 32, offset: 96)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !545, file: !544, line: 37, baseType: !278, size: 64, offset: 128)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !545, file: !544, line: 38, baseType: !278, size: 64, offset: 192)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !545, file: !544, line: 39, baseType: !278, size: 64, offset: 256)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "f8_bits_encoded", scope: !545, file: !544, line: 42, baseType: !51, size: 32, align: 128, offset: 384)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !545, file: !544, line: 45, baseType: !556, size: 3680, offset: 416)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 3680, elements: !557)
!557 = !{!558}
!558 = !DISubrange(count: 460)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !82, file: !6, line: 494, baseType: !560, size: 2112, offset: 115328)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !82, file: !6, line: 465, size: 2112, elements: !561)
!561 = !{!562, !699, !701, !702, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !715, !716, !717, !718}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !560, file: !6, line: 468, baseType: !563, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_frame_t", file: !566, line: 146, baseType: !567)
!566 = !DIFile(filename: "x264_src/common/frame.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_frame", file: !566, line: 31, size: 125056, elements: !568)
!568 = !{!569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !597, !598, !599, !600, !601, !602, !604, !606, !607, !608, !609, !610, !613, !615, !616, !618, !622, !623, !627, !628, !632, !636, !639, !641, !642, !644, !645, !647, !648, !649, !652, !654, !655, !656, !658, !659, !660, !661, !662, !663, !664, !665, !667, !668, !672, !680, !684, !686, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !567, file: !566, line: 34, baseType: !51, size: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !567, file: !566, line: 35, baseType: !51, size: 32, offset: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !567, file: !566, line: 36, baseType: !51, size: 32, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !567, file: !566, line: 37, baseType: !63, size: 64, offset: 128)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts", scope: !567, file: !566, line: 38, baseType: !63, size: 64, offset: 192)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "i_duration", scope: !567, file: !566, line: 39, baseType: !51, size: 32, offset: 256)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_duration", scope: !567, file: !566, line: 40, baseType: !51, size: 32, offset: 288)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !567, file: !566, line: 41, baseType: !51, size: 32, offset: 320)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay", scope: !567, file: !566, line: 42, baseType: !51, size: 32, offset: 352)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !567, file: !566, line: 43, baseType: !579, size: 64, offset: 384)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !567, file: !566, line: 45, baseType: !51, size: 32, offset: 448)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded", scope: !567, file: !566, line: 46, baseType: !51, size: 32, offset: 480)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "i_field_cnt", scope: !567, file: !566, line: 47, baseType: !51, size: 32, offset: 512)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !567, file: !566, line: 48, baseType: !51, size: 32, offset: 544)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "b_kept_as_ref", scope: !567, file: !566, line: 49, baseType: !51, size: 32, offset: 576)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_struct", scope: !567, file: !566, line: 50, baseType: !51, size: 32, offset: 608)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "b_keyframe", scope: !567, file: !566, line: 51, baseType: !51, size: 32, offset: 640)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "b_fdec", scope: !567, file: !566, line: 52, baseType: !133, size: 8, offset: 672)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_minigop_bframe", scope: !567, file: !566, line: 53, baseType: !133, size: 8, offset: 680)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframes", scope: !567, file: !566, line: 54, baseType: !133, size: 8, offset: 688)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_rc", scope: !567, file: !566, line: 55, baseType: !52, size: 32, offset: 704)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_aq", scope: !567, file: !566, line: 56, baseType: !52, size: 32, offset: 736)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_l0ref0", scope: !567, file: !566, line: 57, baseType: !51, size: 32, offset: 768)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !567, file: !566, line: 60, baseType: !51, size: 32, offset: 800)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !567, file: !566, line: 61, baseType: !595, size: 96, offset: 832)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 96, elements: !596)
!596 = !{!525}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !567, file: !566, line: 62, baseType: !595, size: 96, offset: 928)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines", scope: !567, file: !566, line: 63, baseType: !595, size: 96, offset: 1024)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride_lowres", scope: !567, file: !566, line: 64, baseType: !51, size: 32, offset: 1120)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "i_width_lowres", scope: !567, file: !566, line: 65, baseType: !51, size: 32, offset: 1152)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_lowres", scope: !567, file: !566, line: 66, baseType: !51, size: 32, offset: 1184)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !567, file: !566, line: 67, baseType: !603, size: 192, offset: 1216)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 192, elements: !596)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "filtered", scope: !567, file: !566, line: 68, baseType: !605, size: 256, offset: 1408)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 256, elements: !437)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !567, file: !566, line: 69, baseType: !605, size: 256, offset: 1664)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "integral", scope: !567, file: !566, line: 70, baseType: !460, size: 64, offset: 1920)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !567, file: !566, line: 74, baseType: !605, size: 256, offset: 1984)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_lowres", scope: !567, file: !566, line: 75, baseType: !605, size: 256, offset: 2240)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !567, file: !566, line: 77, baseType: !611, size: 24576, offset: 2560)
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 24576, elements: !612)
!612 = !{!137, !525}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "weighted", scope: !567, file: !566, line: 78, baseType: !614, size: 1024, offset: 27136)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 1024, elements: !136)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "b_duplicate", scope: !567, file: !566, line: 79, baseType: !51, size: 32, offset: 28160)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !567, file: !566, line: 80, baseType: !617, size: 64, offset: 28224)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !567, file: !566, line: 83, baseType: !619, size: 64, offset: 28288)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !54, line: 24, baseType: !621)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !56, line: 37, baseType: !69)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "mb_partition", scope: !567, file: !566, line: 84, baseType: !278, size: 64, offset: 28352)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !567, file: !566, line: 85, baseType: !624, size: 128, offset: 28416)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !625, size: 128, elements: !189)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 32, elements: !189)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "mv16x16", scope: !567, file: !566, line: 86, baseType: !625, size: 64, offset: 28544)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mvs", scope: !567, file: !566, line: 87, baseType: !629, size: 2176, offset: 28608)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !625, size: 2176, elements: !630)
!630 = !{!190, !631}
!631 = !DISubrange(count: 17)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_costs", scope: !567, file: !566, line: 92, baseType: !633, size: 20736, offset: 30784)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 20736, elements: !634)
!634 = !{!635, !635}
!635 = !DISubrange(count: 18)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mv_costs", scope: !567, file: !566, line: 96, baseType: !637, size: 2176, offset: 51520)
!637 = !DICompositeType(tag: DW_TAG_array_type, baseType: !638, size: 2176, elements: !630)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !567, file: !566, line: 97, baseType: !640, size: 128, offset: 53696)
!640 = !DICompositeType(tag: DW_TAG_array_type, baseType: !619, size: 128, elements: !189)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref", scope: !567, file: !566, line: 98, baseType: !188, size: 64, offset: 53824)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc", scope: !567, file: !566, line: 99, baseType: !643, size: 1024, offset: 53888)
!643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 1024, elements: !498)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "inv_ref_poc", scope: !567, file: !566, line: 100, baseType: !626, size: 32, offset: 54912)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est", scope: !567, file: !566, line: 105, baseType: !646, size: 10368, offset: 54944)
!646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 10368, elements: !634)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est_aq", scope: !567, file: !566, line: 106, baseType: !646, size: 10368, offset: 65312)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "i_satd", scope: !567, file: !566, line: 107, baseType: !51, size: 32, offset: 75680)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_mbs", scope: !567, file: !566, line: 108, baseType: !650, size: 576, offset: 75712)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 576, elements: !651)
!651 = !{!635}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satds", scope: !567, file: !566, line: 109, baseType: !653, size: 20736, offset: 76288)
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !638, size: 20736, elements: !634)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satd", scope: !567, file: !566, line: 110, baseType: !638, size: 64, offset: 97024)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_bits", scope: !567, file: !566, line: 111, baseType: !638, size: 64, offset: 97088)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "f_row_qp", scope: !567, file: !566, line: 112, baseType: !657, size: 64, offset: 97152)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset", scope: !567, file: !566, line: 113, baseType: !657, size: 64, offset: 97216)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset_aq", scope: !567, file: !566, line: 114, baseType: !657, size: 64, offset: 97280)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_calculated", scope: !567, file: !566, line: 115, baseType: !51, size: 32, offset: 97344)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !567, file: !566, line: 116, baseType: !460, size: 64, offset: 97408)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "i_propagate_cost", scope: !567, file: !566, line: 117, baseType: !460, size: 64, offset: 97472)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "i_inv_qscale_factor", scope: !567, file: !566, line: 118, baseType: !460, size: 64, offset: 97536)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "b_scenecut", scope: !567, file: !566, line: 119, baseType: !51, size: 32, offset: 97600)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "f_weighted_cost_delta", scope: !567, file: !566, line: 120, baseType: !666, size: 576, offset: 97632)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 576, elements: !651)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_sum", scope: !567, file: !566, line: 121, baseType: !60, size: 32, offset: 98208)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_ssd", scope: !567, file: !566, line: 122, baseType: !669, size: 64, offset: 98240)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !61, line: 27, baseType: !670)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !56, line: 45, baseType: !671)
!671 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "hrd_timing", scope: !567, file: !566, line: 125, baseType: !673, size: 256, offset: 98304)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_hrd_t", file: !81, line: 503, baseType: !674)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !81, line: 496, size: 256, elements: !675)
!675 = !{!676, !677, !678, !679}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_initial_arrival_time", scope: !674, file: !81, line: 498, baseType: !58, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_final_arrival_time", scope: !674, file: !81, line: 499, baseType: !58, size: 64, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_time", scope: !674, file: !81, line: 500, baseType: !58, size: 64, offset: 128)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_time", scope: !674, file: !81, line: 502, baseType: !58, size: 64, offset: 192)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_type", scope: !567, file: !566, line: 128, baseType: !681, size: 2008, offset: 98560)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 2008, elements: !682)
!682 = !{!683}
!683 = !DISubrange(count: 251)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_satd", scope: !567, file: !566, line: 129, baseType: !685, size: 8032, offset: 100576)
!685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 8032, elements: !682)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "f_planned_cpb_duration", scope: !567, file: !566, line: 130, baseType: !687, size: 16064, offset: 108608)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 16064, elements: !682)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !567, file: !566, line: 131, baseType: !51, size: 32, offset: 124672)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !567, file: !566, line: 132, baseType: !51, size: 32, offset: 124704)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_completed", scope: !567, file: !566, line: 135, baseType: !51, size: 32, offset: 124736)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_weighted", scope: !567, file: !566, line: 136, baseType: !51, size: 32, offset: 124768)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "i_reference_count", scope: !567, file: !566, line: 137, baseType: !51, size: 32, offset: 124800)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !567, file: !566, line: 138, baseType: !51, size: 32, offset: 124832)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !567, file: !566, line: 139, baseType: !51, size: 32, offset: 124864)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "f_pir_position", scope: !567, file: !566, line: 142, baseType: !52, size: 32, offset: 124896)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_start_col", scope: !567, file: !566, line: 143, baseType: !51, size: 32, offset: 124928)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_end_col", scope: !567, file: !566, line: 144, baseType: !51, size: 32, offset: 124960)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "i_frames_since_pir", scope: !567, file: !566, line: 145, baseType: !51, size: 32, offset: 124992)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !560, file: !6, line: 470, baseType: !700, size: 128, offset: 64)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !563, size: 128, elements: !189)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "blank_unused", scope: !560, file: !6, line: 473, baseType: !563, size: 64, offset: 192)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !560, file: !6, line: 476, baseType: !703, size: 1152, offset: 256)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !564, size: 1152, elements: !651)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_keyframe", scope: !560, file: !6, line: 478, baseType: !51, size: 32, offset: 1408)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "i_input", scope: !560, file: !6, line: 480, baseType: !51, size: 32, offset: 1440)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dpb", scope: !560, file: !6, line: 482, baseType: !51, size: 32, offset: 1472)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref0", scope: !560, file: !6, line: 483, baseType: !51, size: 32, offset: 1504)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref1", scope: !560, file: !6, line: 484, baseType: !51, size: 32, offset: 1536)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "i_delay", scope: !560, file: !6, line: 485, baseType: !51, size: 32, offset: 1568)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay", scope: !560, file: !6, line: 486, baseType: !51, size: 32, offset: 1600)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay_time", scope: !560, file: !6, line: 487, baseType: !63, size: 64, offset: 1664)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "i_init_delta", scope: !560, file: !6, line: 488, baseType: !63, size: 64, offset: 1728)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_reordered_pts", scope: !560, file: !6, line: 489, baseType: !714, size: 128, offset: 1792)
!714 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 128, elements: !189)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "i_largest_pts", scope: !560, file: !6, line: 490, baseType: !63, size: 64, offset: 1920)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "i_second_largest_pts", scope: !560, file: !6, line: 491, baseType: !63, size: 64, offset: 1984)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_lowres", scope: !560, file: !6, line: 492, baseType: !51, size: 32, offset: 2048)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_sub8x8_esa", scope: !560, file: !6, line: 493, baseType: !51, size: 32, offset: 2080)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "fenc", scope: !82, file: !6, line: 497, baseType: !564, size: 64, offset: 117440)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "fdec", scope: !82, file: !6, line: 500, baseType: !564, size: 64, offset: 117504)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref0", scope: !82, file: !6, line: 503, baseType: !51, size: 32, offset: 117568)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "fref0", scope: !82, file: !6, line: 504, baseType: !723, size: 1216, offset: 117632)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !564, size: 1216, elements: !724)
!724 = !{!725}
!725 = !DISubrange(count: 19)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref1", scope: !82, file: !6, line: 505, baseType: !51, size: 32, offset: 118848)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "fref1", scope: !82, file: !6, line: 506, baseType: !723, size: 1216, offset: 118912)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_reorder", scope: !82, file: !6, line: 507, baseType: !188, size: 64, offset: 120128)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay", scope: !82, file: !6, line: 510, baseType: !51, size: 32, offset: 120192)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_offset", scope: !82, file: !6, line: 511, baseType: !51, size: 32, offset: 120224)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts_delay", scope: !82, file: !6, line: 512, baseType: !63, size: 64, offset: 120256)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "dct", scope: !82, file: !6, line: 522, baseType: !733, size: 10624, offset: 120320)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !82, file: !6, line: 515, size: 10624, elements: !734)
!734 = !{!735, !737, !740, !743}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "luma16x16_dc", scope: !733, file: !6, line: 517, baseType: !736, size: 256, align: 128)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 256, elements: !136)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_dc", scope: !733, file: !6, line: 518, baseType: !738, size: 128, align: 128, offset: 256)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 128, elements: !739)
!739 = !{!190, !438}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "luma8x8", scope: !733, file: !6, line: 520, baseType: !741, size: 4096, align: 128, offset: 384)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 4096, elements: !742)
!742 = !{!438, !144}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "luma4x4", scope: !733, file: !6, line: 521, baseType: !744, size: 6144, align: 128, offset: 4480)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 6144, elements: !745)
!745 = !{!746, !137}
!746 = !DISubrange(count: 24)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !82, file: !6, line: 732, baseType: !748, size: 82688, offset: 130944)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !82, file: !6, line: 525, size: 82688, elements: !749)
!749 = !{!750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !777, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !795, !798, !802, !803, !804, !809, !810, !813, !814, !815, !816, !817, !818, !819, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !879, !910, !911, !912, !913, !914, !915, !916, !917, !918, !921, !922, !923, !926, !929, !931, !934, !936, !937}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !748, file: !6, line: 527, baseType: !51, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_stride", scope: !748, file: !6, line: 530, baseType: !51, size: 32, offset: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_stride", scope: !748, file: !6, line: 531, baseType: !51, size: 32, offset: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_stride", scope: !748, file: !6, line: 532, baseType: !51, size: 32, offset: 96)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_x", scope: !748, file: !6, line: 535, baseType: !51, size: 32, offset: 128)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_y", scope: !748, file: !6, line: 536, baseType: !51, size: 32, offset: 160)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_xy", scope: !748, file: !6, line: 537, baseType: !51, size: 32, offset: 192)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_xy", scope: !748, file: !6, line: 538, baseType: !51, size: 32, offset: 224)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_xy", scope: !748, file: !6, line: 539, baseType: !51, size: 32, offset: 256)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !748, file: !6, line: 542, baseType: !51, size: 32, offset: 288)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !748, file: !6, line: 543, baseType: !51, size: 32, offset: 320)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !748, file: !6, line: 544, baseType: !51, size: 32, offset: 352)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "b_trellis", scope: !748, file: !6, line: 545, baseType: !51, size: 32, offset: 384)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "b_noise_reduction", scope: !748, file: !6, line: 546, baseType: !51, size: 32, offset: 416)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !748, file: !6, line: 547, baseType: !51, size: 32, offset: 448)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_rd", scope: !748, file: !6, line: 548, baseType: !51, size: 32, offset: 480)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_trellis", scope: !748, file: !6, line: 549, baseType: !51, size: 32, offset: 512)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !748, file: !6, line: 551, baseType: !51, size: 32, offset: 544)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min", scope: !748, file: !6, line: 554, baseType: !188, size: 64, offset: 576)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max", scope: !748, file: !6, line: 555, baseType: !188, size: 64, offset: 640)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_spel", scope: !748, file: !6, line: 558, baseType: !188, size: 64, offset: 704)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_spel", scope: !748, file: !6, line: 559, baseType: !188, size: 64, offset: 768)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_fpel", scope: !748, file: !6, line: 561, baseType: !188, size: 64, offset: 832)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_fpel", scope: !748, file: !6, line: 562, baseType: !188, size: 64, offset: 896)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour", scope: !748, file: !6, line: 565, baseType: !7, size: 32, offset: 960)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour8", scope: !748, file: !6, line: 566, baseType: !776, size: 128, offset: 992)
!776 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128, elements: !437)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour4", scope: !748, file: !6, line: 567, baseType: !778, size: 512, offset: 1120)
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 512, elements: !136)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_intra", scope: !748, file: !6, line: 568, baseType: !7, size: 32, offset: 1632)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_frame", scope: !748, file: !6, line: 569, baseType: !7, size: 32, offset: 1664)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_top", scope: !748, file: !6, line: 570, baseType: !51, size: 32, offset: 1696)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_left", scope: !748, file: !6, line: 571, baseType: !51, size: 32, offset: 1728)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topleft", scope: !748, file: !6, line: 572, baseType: !51, size: 32, offset: 1760)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topright", scope: !748, file: !6, line: 573, baseType: !51, size: 32, offset: 1792)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_prev_xy", scope: !748, file: !6, line: 574, baseType: !51, size: 32, offset: 1824)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_left_xy", scope: !748, file: !6, line: 575, baseType: !51, size: 32, offset: 1856)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_top_xy", scope: !748, file: !6, line: 576, baseType: !51, size: 32, offset: 1888)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topleft_xy", scope: !748, file: !6, line: 577, baseType: !51, size: 32, offset: 1920)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topright_xy", scope: !748, file: !6, line: 578, baseType: !51, size: 32, offset: 1952)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !748, file: !6, line: 585, baseType: !619, size: 64, offset: 1984)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "partition", scope: !748, file: !6, line: 586, baseType: !278, size: 64, offset: 2048)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !748, file: !6, line: 587, baseType: !619, size: 64, offset: 2112)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !748, file: !6, line: 588, baseType: !794, size: 64, offset: 2176)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !748, file: !6, line: 589, baseType: !796, size: 64, offset: 2240)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !620, size: 64, elements: !507)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !748, file: !6, line: 591, baseType: !799, size: 64, offset: 2304)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 192, elements: !801)
!801 = !{!746}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_pred_mode", scope: !748, file: !6, line: 592, baseType: !619, size: 64, offset: 2368)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !748, file: !6, line: 593, baseType: !624, size: 128, offset: 2432)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !748, file: !6, line: 594, baseType: !805, size: 128, offset: 2560)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !806, size: 128, elements: !189)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 128, elements: !808)
!808 = !{!508, !190}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !748, file: !6, line: 595, baseType: !640, size: 128, offset: 2688)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "mvr", scope: !748, file: !6, line: 596, baseType: !811, size: 4096, offset: 2816)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !625, size: 4096, elements: !812)
!812 = !{!190, !524}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "skipbp", scope: !748, file: !6, line: 597, baseType: !619, size: 64, offset: 6912)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "mb_transform_size", scope: !748, file: !6, line: 598, baseType: !619, size: 64, offset: 6976)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "slice_table", scope: !748, file: !6, line: 599, baseType: !460, size: 64, offset: 7040)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "p_weight_buf", scope: !748, file: !6, line: 603, baseType: !614, size: 1024, offset: 7104)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !748, file: !6, line: 606, baseType: !51, size: 32, offset: 8128)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "i_partition", scope: !748, file: !6, line: 607, baseType: !51, size: 32, offset: 8160)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "i_sub_partition", scope: !748, file: !6, line: 608, baseType: !820, size: 32, align: 32, offset: 8192)
!820 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 32, elements: !437)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !748, file: !6, line: 609, baseType: !51, size: 32, offset: 8224)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_luma", scope: !748, file: !6, line: 611, baseType: !51, size: 32, offset: 8256)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_chroma", scope: !748, file: !6, line: 612, baseType: !51, size: 32, offset: 8288)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra16x16_pred_mode", scope: !748, file: !6, line: 614, baseType: !51, size: 32, offset: 8320)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_pred_mode", scope: !748, file: !6, line: 615, baseType: !51, size: 32, offset: 8352)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "i_skip_intra", scope: !748, file: !6, line: 621, baseType: !51, size: 32, offset: 8384)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "b_skip_mc", scope: !748, file: !6, line: 624, baseType: !51, size: 32, offset: 8416)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "b_reencode_mb", scope: !748, file: !6, line: 626, baseType: !51, size: 32, offset: 8448)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "ip_offset", scope: !748, file: !6, line: 627, baseType: !51, size: 32, offset: 8480)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "pic", scope: !748, file: !6, line: 671, baseType: !831, size: 60672, offset: 8576)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !748, file: !6, line: 629, size: 60672, elements: !832)
!832 = !{!833, !837, !841, !843, !844, !847, !851, !853, !854, !855, !856, !857, !860, !864, !867, !868, !869, !870, !871, !874, !876, !878}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_buf", scope: !831, file: !6, line: 634, baseType: !834, size: 3072, align: 128)
!834 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 3072, elements: !835)
!835 = !{!836}
!836 = !DISubrange(count: 384)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "fdec_buf", scope: !831, file: !6, line: 635, baseType: !838, size: 6912, align: 128, offset: 3072)
!838 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 6912, elements: !839)
!839 = !{!840}
!840 = !DISubrange(count: 864)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_fdec_buf", scope: !831, file: !6, line: 638, baseType: !842, size: 2048, align: 128, offset: 9984)
!842 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 2048, elements: !330)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_fdec_buf", scope: !831, file: !6, line: 639, baseType: !842, size: 2048, align: 128, offset: 12032)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_dct_buf", scope: !831, file: !6, line: 640, baseType: !845, size: 3072, align: 128, offset: 14080)
!845 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 3072, elements: !846)
!846 = !{!525, !144}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_dct_buf", scope: !831, file: !6, line: 641, baseType: !848, size: 3840, align: 128, offset: 17152)
!848 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 3840, elements: !849)
!849 = !{!850, !137}
!850 = !DISubrange(count: 15)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_nnz_buf", scope: !831, file: !6, line: 642, baseType: !852, size: 128, offset: 20992)
!852 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 128, elements: !437)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_nnz_buf", scope: !831, file: !6, line: 643, baseType: !852, size: 128, offset: 21120)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_cbp", scope: !831, file: !6, line: 644, baseType: !51, size: 32, offset: 21248)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_cbp", scope: !831, file: !6, line: 645, baseType: !51, size: 32, offset: 21280)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct8", scope: !831, file: !6, line: 648, baseType: !741, size: 4096, align: 128, offset: 21376)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct4", scope: !831, file: !6, line: 649, baseType: !858, size: 4096, align: 128, offset: 25472)
!858 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 4096, elements: !859)
!859 = !{!137, !137}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_hadamard_cache", scope: !831, file: !6, line: 652, baseType: !861, size: 576, align: 128, offset: 29568)
!861 = !DICompositeType(tag: DW_TAG_array_type, baseType: !669, size: 576, elements: !862)
!862 = !{!863}
!863 = !DISubrange(count: 9)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_satd_cache", scope: !831, file: !6, line: 653, baseType: !865, size: 1024, align: 128, offset: 30208)
!865 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 1024, elements: !866)
!866 = !{!524}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "p_fenc", scope: !831, file: !6, line: 656, baseType: !603, size: 192, offset: 31232)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "p_fenc_plane", scope: !831, file: !6, line: 658, baseType: !603, size: 192, offset: 31424)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "p_fdec", scope: !831, file: !6, line: 661, baseType: !603, size: 192, offset: 31616)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "i_fref", scope: !831, file: !6, line: 664, baseType: !188, size: 64, offset: 31808)
