; ModuleID = 'x264_src/common/quant.c'
source_filename = "x264_src/common/quant.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.x264_t = type { %struct.x264_param_t, [129 x %struct.x264_t*], i32, i32, i32, i32, i32, %struct.anon.2, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1 x %struct.x264_sps_t], %struct.x264_sps_t*, [1 x %struct.x264_pps_t], %struct.x264_pps_t*, i32, i32, [4 x [16 x i32]*], [2 x [64 x i32]*], [4 x [16 x i32]*], [2 x [64 x i32]*], [4 x [16 x i16]*], [2 x [64 x i16]*], [4 x [16 x i16]*], [2 x [64 x i16]*], [92 x i16*], [92 x [4 x i16*]], i8*, [8 x i8], %struct.x264_slice_header_t, %struct.x264_cabac_t, %struct.anon.8, %struct.x264_frame*, %struct.x264_frame*, i32, [19 x %struct.x264_frame*], i32, [19 x %struct.x264_frame*], [2 x i32], i32, i32, i64, %struct.anon.9, %struct.anon.10, %struct.x264_ratecontrol_t*, %struct.anon.13, [2 x [64 x i32]], [2 x [64 x i16]], [2 x i32], i8*, [2 x [3 x i8*]], [2 x [2 x [4 x [4 x i8]]]*], [7 x void (i8*)*], [7 x void (i8*)*], [12 x void (i8*, i8*)*], [12 x void (i8*)*], void (i8*, i8*, i32, i32)*, %struct.x264_pixel_function_t, %struct.x264_mc_functions_t, %struct.x264_dct_function_t, %struct.x264_zigzag_function_t, %struct.x264_quant_function_t, %struct.x264_deblock_function_t, %struct.x264_lookahead_t*, [8 x i8] }

!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_union32_t", file: !18, line: 89, baseType: !19)
!18 = !DIFile(filename: "x264_src/common/common.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!19 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !18, line: 89, size: 32, elements: !20)
!20 = !{!21, !26, !33}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !19, file: !18, line: 89, baseType: !22, size: 32)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 26, baseType: !24)
!23 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !25, line: 42, baseType: !7)
!25 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!26 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !19, file: !18, line: 89, baseType: !27, size: 32)
!27 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 32, elements: !31)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 25, baseType: !29)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !25, line: 40, baseType: !30)
!30 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!31 = !{!32}
!32 = !DISubrange(count: 2)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !19, file: !18, line: 89, baseType: !34, size: 32)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 32, elements: !38)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 24, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !25, line: 38, baseType: !37)
!37 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!38 = !{!39}
!39 = !DISubrange(count: 4)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_union64_t", file: !18, line: 90, baseType: !42)
!42 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !18, line: 90, size: 64, elements: !43)
!43 = !{!44, !48, !50, !52}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !42, file: !18, line: 90, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 27, baseType: !46)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !25, line: 45, baseType: !47)
!47 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !42, file: !18, line: 90, baseType: !49, size: 64)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 64, elements: !31)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !42, file: !18, line: 90, baseType: !51, size: 64)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 64, elements: !38)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !42, file: !18, line: 90, baseType: !53, size: 64)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 64, elements: !54)
!54 = !{!55}
!55 = !DISubrange(count: 8)
!56 = !{!0, !57}
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(name: "x264_decimate_table8", scope: !2, file: !3, line: 166, type: !59, isLocal: false, isDefinition: true)
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 512, elements: !61)
!60 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!61 = !{!62}
!62 = !DISubrange(count: 64)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 128, elements: !64)
!64 = !{!65}
!65 = !DISubrange(count: 16)
!66 = !{i32 7, !"Dwarf Version", i32 4}
!67 = !{i32 2, !"Debug Info Version", i32 3}
!68 = !{i32 1, !"wchar_size", i32 4}
!69 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!70 = distinct !DISubprogram(name: "x264_quant_init", scope: !3, file: !3, line: 266, type: !71, scopeLine: 267, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !1362)
!71 = !DISubroutineType(types: !72)
!72 = !{null, !73, !84, !1361}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_t", file: !75, line: 46, baseType: !76)
!75 = !DIFile(filename: "x264_src/x264.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_t", file: !18, line: 381, size: 266752, elements: !77)
!77 = !{!78, !243, !247, !248, !249, !250, !251, !252, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !388, !390, !417, !419, !420, !421, !425, !429, !430, !431, !435, !439, !440, !441, !446, !449, !450, !527, !544, !705, !706, !707, !708, !712, !713, !714, !715, !716, !717, !718, !733, !926, !930, !991, !994, !996, !997, !998, !1001, !1006, !1015, !1016, !1024, !1026, !1031, !1107, !1193, !1237, !1259, !1308, !1337}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !76, file: !18, line: 384, baseType: !79, size: 5632)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !75, line: 376, baseType: !80)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !75, line: 176, size: 5632, elements: !81)
!81 = !{!82, !83, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !126, !128, !129, !130, !131, !133, !134, !148, !149, !150, !151, !152, !181, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !80, file: !75, line: 179, baseType: !7, size: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !80, file: !75, line: 180, baseType: !84, size: 32, offset: 32)
!84 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !80, file: !75, line: 181, baseType: !84, size: 32, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !80, file: !75, line: 182, baseType: !84, size: 32, offset: 96)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !80, file: !75, line: 183, baseType: !84, size: 32, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !80, file: !75, line: 186, baseType: !84, size: 32, offset: 160)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !80, file: !75, line: 187, baseType: !84, size: 32, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !80, file: !75, line: 188, baseType: !84, size: 32, offset: 224)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !80, file: !75, line: 189, baseType: !84, size: 32, offset: 256)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !80, file: !75, line: 190, baseType: !84, size: 32, offset: 288)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !80, file: !75, line: 198, baseType: !84, size: 32, offset: 320)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !80, file: !75, line: 215, baseType: !95, size: 288, offset: 352)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !80, file: !75, line: 200, size: 288, elements: !96)
!96 = !{!97, !98, !99, !100, !101, !102, !103, !104, !105}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !95, file: !75, line: 203, baseType: !84, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !95, file: !75, line: 204, baseType: !84, size: 32, offset: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !95, file: !75, line: 206, baseType: !84, size: 32, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !95, file: !75, line: 209, baseType: !84, size: 32, offset: 96)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !95, file: !75, line: 210, baseType: !84, size: 32, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !95, file: !75, line: 211, baseType: !84, size: 32, offset: 160)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !95, file: !75, line: 212, baseType: !84, size: 32, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !95, file: !75, line: 213, baseType: !84, size: 32, offset: 224)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !95, file: !75, line: 214, baseType: !84, size: 32, offset: 256)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !80, file: !75, line: 218, baseType: !84, size: 32, offset: 640)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !80, file: !75, line: 219, baseType: !84, size: 32, offset: 672)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !80, file: !75, line: 220, baseType: !84, size: 32, offset: 704)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !80, file: !75, line: 221, baseType: !84, size: 32, offset: 736)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !80, file: !75, line: 222, baseType: !84, size: 32, offset: 768)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !80, file: !75, line: 224, baseType: !84, size: 32, offset: 800)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !80, file: !75, line: 225, baseType: !84, size: 32, offset: 832)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !80, file: !75, line: 226, baseType: !84, size: 32, offset: 864)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !80, file: !75, line: 227, baseType: !84, size: 32, offset: 896)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !80, file: !75, line: 229, baseType: !84, size: 32, offset: 928)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !80, file: !75, line: 230, baseType: !84, size: 32, offset: 960)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !80, file: !75, line: 231, baseType: !84, size: 32, offset: 992)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !80, file: !75, line: 233, baseType: !84, size: 32, offset: 1024)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !80, file: !75, line: 234, baseType: !84, size: 32, offset: 1056)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !80, file: !75, line: 236, baseType: !84, size: 32, offset: 1088)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !80, file: !75, line: 237, baseType: !84, size: 32, offset: 1120)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !80, file: !75, line: 239, baseType: !84, size: 32, offset: 1152)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !80, file: !75, line: 240, baseType: !124, size: 64, offset: 1216)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !80, file: !75, line: 241, baseType: !127, size: 128, offset: 1280)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 128, elements: !64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !80, file: !75, line: 242, baseType: !127, size: 128, offset: 1408)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !80, file: !75, line: 243, baseType: !127, size: 128, offset: 1536)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !80, file: !75, line: 244, baseType: !127, size: 128, offset: 1664)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !80, file: !75, line: 245, baseType: !132, size: 512, offset: 1792)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 512, elements: !61)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !80, file: !75, line: 246, baseType: !132, size: 512, offset: 2304)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !80, file: !75, line: 249, baseType: !135, size: 64, offset: 2816)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{null, !138, !84, !139, !141}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 166, size: 192, elements: !143)
!143 = !{!144, !145, !146, !147}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !142, file: !3, line: 166, baseType: !7, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !142, file: !3, line: 166, baseType: !7, size: 32, offset: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !142, file: !3, line: 166, baseType: !138, size: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !142, file: !3, line: 166, baseType: !138, size: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !80, file: !75, line: 250, baseType: !138, size: 64, offset: 2880)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !80, file: !75, line: 251, baseType: !84, size: 32, offset: 2944)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !80, file: !75, line: 252, baseType: !84, size: 32, offset: 2976)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !80, file: !75, line: 253, baseType: !124, size: 64, offset: 3008)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !80, file: !75, line: 287, baseType: !153, size: 800, offset: 3072)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !80, file: !75, line: 256, size: 800, elements: !154)
!154 = !{!155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !175, !176, !177, !179, !180}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !153, file: !75, line: 258, baseType: !7, size: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !153, file: !75, line: 259, baseType: !7, size: 32, offset: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !153, file: !75, line: 261, baseType: !84, size: 32, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !153, file: !75, line: 262, baseType: !84, size: 32, offset: 96)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !153, file: !75, line: 263, baseType: !84, size: 32, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !153, file: !75, line: 264, baseType: !84, size: 32, offset: 160)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !153, file: !75, line: 265, baseType: !84, size: 32, offset: 192)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !153, file: !75, line: 267, baseType: !84, size: 32, offset: 224)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !153, file: !75, line: 268, baseType: !84, size: 32, offset: 256)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !153, file: !75, line: 269, baseType: !84, size: 32, offset: 288)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !153, file: !75, line: 270, baseType: !84, size: 32, offset: 320)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !153, file: !75, line: 271, baseType: !84, size: 32, offset: 352)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !153, file: !75, line: 272, baseType: !84, size: 32, offset: 384)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !153, file: !75, line: 273, baseType: !84, size: 32, offset: 416)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !153, file: !75, line: 274, baseType: !84, size: 32, offset: 448)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !153, file: !75, line: 275, baseType: !84, size: 32, offset: 480)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !153, file: !75, line: 276, baseType: !84, size: 32, offset: 512)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !153, file: !75, line: 277, baseType: !84, size: 32, offset: 544)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !153, file: !75, line: 278, baseType: !174, size: 32, offset: 576)
!174 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !153, file: !75, line: 279, baseType: !174, size: 32, offset: 608)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !153, file: !75, line: 280, baseType: !84, size: 32, offset: 640)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !153, file: !75, line: 283, baseType: !178, size: 64, offset: 672)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 64, elements: !31)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !153, file: !75, line: 285, baseType: !84, size: 32, offset: 736)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !153, file: !75, line: 286, baseType: !84, size: 32, offset: 768)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !80, file: !75, line: 327, baseType: !182, size: 1152, offset: 3904)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !80, file: !75, line: 290, size: 1152, elements: !183)
!183 = !{!184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !221, !222}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !182, file: !75, line: 292, baseType: !84, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !182, file: !75, line: 294, baseType: !84, size: 32, offset: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !182, file: !75, line: 295, baseType: !84, size: 32, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !182, file: !75, line: 296, baseType: !84, size: 32, offset: 96)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !182, file: !75, line: 297, baseType: !84, size: 32, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !182, file: !75, line: 299, baseType: !84, size: 32, offset: 160)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !182, file: !75, line: 300, baseType: !174, size: 32, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !182, file: !75, line: 301, baseType: !174, size: 32, offset: 224)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !182, file: !75, line: 302, baseType: !174, size: 32, offset: 256)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !182, file: !75, line: 303, baseType: !84, size: 32, offset: 288)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !182, file: !75, line: 304, baseType: !84, size: 32, offset: 320)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !182, file: !75, line: 305, baseType: !174, size: 32, offset: 352)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !182, file: !75, line: 306, baseType: !174, size: 32, offset: 384)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !182, file: !75, line: 307, baseType: !174, size: 32, offset: 416)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !182, file: !75, line: 309, baseType: !84, size: 32, offset: 448)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !182, file: !75, line: 310, baseType: !174, size: 32, offset: 480)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !182, file: !75, line: 311, baseType: !84, size: 32, offset: 512)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !182, file: !75, line: 312, baseType: !84, size: 32, offset: 544)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !182, file: !75, line: 315, baseType: !84, size: 32, offset: 576)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !182, file: !75, line: 316, baseType: !124, size: 64, offset: 640)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !182, file: !75, line: 317, baseType: !84, size: 32, offset: 704)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !182, file: !75, line: 318, baseType: !124, size: 64, offset: 768)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !182, file: !75, line: 321, baseType: !174, size: 32, offset: 832)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !182, file: !75, line: 322, baseType: !174, size: 32, offset: 864)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !182, file: !75, line: 323, baseType: !174, size: 32, offset: 896)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !182, file: !75, line: 324, baseType: !210, size: 64, offset: 960)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !75, line: 174, baseType: !212)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !75, line: 167, size: 256, elements: !213)
!213 = !{!214, !215, !216, !217, !218, !219}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !212, file: !75, line: 169, baseType: !84, size: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !212, file: !75, line: 169, baseType: !84, size: 32, offset: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !212, file: !75, line: 170, baseType: !84, size: 32, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !212, file: !75, line: 171, baseType: !84, size: 32, offset: 96)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !212, file: !75, line: 172, baseType: !174, size: 32, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !212, file: !75, line: 173, baseType: !220, size: 64, offset: 192)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !182, file: !75, line: 325, baseType: !84, size: 32, offset: 1024)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !182, file: !75, line: 326, baseType: !124, size: 64, offset: 1088)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !80, file: !75, line: 330, baseType: !84, size: 32, offset: 5056)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !80, file: !75, line: 331, baseType: !84, size: 32, offset: 5088)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !80, file: !75, line: 332, baseType: !84, size: 32, offset: 5120)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !80, file: !75, line: 334, baseType: !84, size: 32, offset: 5152)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !80, file: !75, line: 335, baseType: !84, size: 32, offset: 5184)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !80, file: !75, line: 336, baseType: !22, size: 32, offset: 5216)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !80, file: !75, line: 337, baseType: !22, size: 32, offset: 5248)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !80, file: !75, line: 338, baseType: !22, size: 32, offset: 5280)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !80, file: !75, line: 339, baseType: !22, size: 32, offset: 5312)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !80, file: !75, line: 340, baseType: !84, size: 32, offset: 5344)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !80, file: !75, line: 344, baseType: !84, size: 32, offset: 5376)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !80, file: !75, line: 356, baseType: !84, size: 32, offset: 5408)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !80, file: !75, line: 364, baseType: !84, size: 32, offset: 5440)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !80, file: !75, line: 367, baseType: !84, size: 32, offset: 5472)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !80, file: !75, line: 368, baseType: !84, size: 32, offset: 5504)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !80, file: !75, line: 369, baseType: !84, size: 32, offset: 5536)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !80, file: !75, line: 375, baseType: !240, size: 64, offset: 5568)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{null, !138}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !76, file: !18, line: 386, baseType: !244, size: 8256, offset: 5632)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 8256, elements: !245)
!245 = !{!246}
!246 = !DISubrange(count: 129)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "thread_handle", scope: !76, file: !18, line: 387, baseType: !84, size: 32, offset: 13888)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "b_thread_active", scope: !76, file: !18, line: 388, baseType: !84, size: 32, offset: 13920)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_phase", scope: !76, file: !18, line: 389, baseType: !84, size: 32, offset: 13952)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_start", scope: !76, file: !18, line: 390, baseType: !84, size: 32, offset: 13984)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_end", scope: !76, file: !18, line: 391, baseType: !84, size: 32, offset: 14016)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !76, file: !18, line: 402, baseType: !253, size: 576, offset: 14080)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !76, file: !18, line: 394, size: 576, elements: !254)
!254 = !{!255, !256, !257, !267, !268, !269}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal", scope: !253, file: !18, line: 396, baseType: !84, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "i_nals_allocated", scope: !253, file: !18, line: 397, baseType: !84, size: 32, offset: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "nal", scope: !253, file: !18, line: 398, baseType: !258, size: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !75, line: 604, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !75, line: 593, size: 192, elements: !261)
!261 = !{!262, !263, !264, !265}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !260, file: !75, line: 595, baseType: !84, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !260, file: !75, line: 596, baseType: !84, size: 32, offset: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !260, file: !75, line: 599, baseType: !84, size: 32, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !260, file: !75, line: 603, baseType: !266, size: 64, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitstream", scope: !253, file: !18, line: 399, baseType: !84, size: 32, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "p_bitstream", scope: !253, file: !18, line: 400, baseType: !266, size: 64, offset: 192)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !253, file: !18, line: 401, baseType: !270, size: 320, offset: 256)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "bs_t", file: !271, line: 56, baseType: !272)
!271 = !DIFile(filename: "x264_src/common/bs.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bs_s", file: !271, line: 47, size: 320, elements: !273)
!273 = !{!274, !275, !276, !277, !281, !282}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !272, file: !271, line: 49, baseType: !266, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !272, file: !271, line: 50, baseType: !266, size: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !272, file: !271, line: 51, baseType: !266, size: 64, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "cur_bits", scope: !272, file: !271, line: 53, baseType: !278, size: 64, offset: 192)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !279, line: 87, baseType: !280)
!279 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!280 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !272, file: !271, line: 54, baseType: !84, size: 32, offset: 256)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "i_bits_encoded", scope: !272, file: !271, line: 55, baseType: !84, size: 32, offset: 288)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer", scope: !76, file: !18, line: 404, baseType: !266, size: 64, offset: 14656)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer_size", scope: !76, file: !18, line: 405, baseType: !84, size: 32, offset: 14720)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !76, file: !18, line: 410, baseType: !84, size: 32, offset: 14752)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !76, file: !18, line: 411, baseType: !84, size: 32, offset: 14784)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_frames", scope: !76, file: !18, line: 413, baseType: !84, size: 32, offset: 14816)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_type", scope: !76, file: !18, line: 415, baseType: !84, size: 32, offset: 14848)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_ref_idc", scope: !76, file: !18, line: 416, baseType: !84, size: 32, offset: 14880)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields", scope: !76, file: !18, line: 418, baseType: !84, size: 32, offset: 14912)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields_last_frame", scope: !76, file: !18, line: 419, baseType: !84, size: 32, offset: 14944)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_duration", scope: !76, file: !18, line: 420, baseType: !84, size: 32, offset: 14976)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields", scope: !76, file: !18, line: 421, baseType: !84, size: 32, offset: 15008)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !76, file: !18, line: 422, baseType: !84, size: 32, offset: 15040)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !76, file: !18, line: 424, baseType: !84, size: 32, offset: 15072)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !76, file: !18, line: 425, baseType: !84, size: 32, offset: 15104)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "b_queued_intra_refresh", scope: !76, file: !18, line: 427, baseType: !84, size: 32, offset: 15136)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "sps_array", scope: !76, file: !18, line: 430, baseType: !299, size: 10400, offset: 15168)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !300, size: 10400, elements: !386)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_sps_t", file: !301, line: 154, baseType: !302)
!301 = !DIFile(filename: "x264_src/common/set.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !301, line: 52, size: 10400, elements: !303)
!303 = !{!304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !321, !322, !323, !324, !325, !326, !327, !328, !329, !336, !337, !385}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !302, file: !301, line: 54, baseType: !84, size: 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "i_profile_idc", scope: !302, file: !301, line: 56, baseType: !84, size: 32, offset: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !302, file: !301, line: 57, baseType: !84, size: 32, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set0", scope: !302, file: !301, line: 59, baseType: !84, size: 32, offset: 96)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set1", scope: !302, file: !301, line: 60, baseType: !84, size: 32, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set2", scope: !302, file: !301, line: 61, baseType: !84, size: 32, offset: 160)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_frame_num", scope: !302, file: !301, line: 63, baseType: !84, size: 32, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_type", scope: !302, file: !301, line: 65, baseType: !84, size: 32, offset: 224)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_poc_lsb", scope: !302, file: !301, line: 67, baseType: !84, size: 32, offset: 256)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "b_delta_pic_order_always_zero", scope: !302, file: !301, line: 69, baseType: !84, size: 32, offset: 288)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_non_ref_pic", scope: !302, file: !301, line: 70, baseType: !84, size: 32, offset: 320)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_top_to_bottom_field", scope: !302, file: !301, line: 71, baseType: !84, size: 32, offset: 352)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames_in_poc_cycle", scope: !302, file: !301, line: 72, baseType: !84, size: 32, offset: 384)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_ref_frame", scope: !302, file: !301, line: 73, baseType: !318, size: 8192, offset: 416)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 8192, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 256)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames", scope: !302, file: !301, line: 75, baseType: !84, size: 32, offset: 8608)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "b_gaps_in_frame_num_value_allowed", scope: !302, file: !301, line: 76, baseType: !84, size: 32, offset: 8640)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_width", scope: !302, file: !301, line: 77, baseType: !84, size: 32, offset: 8672)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_height", scope: !302, file: !301, line: 78, baseType: !84, size: 32, offset: 8704)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_mbs_only", scope: !302, file: !301, line: 79, baseType: !84, size: 32, offset: 8736)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_adaptive_frame_field", scope: !302, file: !301, line: 80, baseType: !84, size: 32, offset: 8768)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct8x8_inference", scope: !302, file: !301, line: 81, baseType: !84, size: 32, offset: 8800)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "b_crop", scope: !302, file: !301, line: 83, baseType: !84, size: 32, offset: 8832)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !302, file: !301, line: 90, baseType: !330, size: 128, offset: 8864)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !302, file: !301, line: 84, size: 128, elements: !331)
!331 = !{!332, !333, !334, !335}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !330, file: !301, line: 86, baseType: !84, size: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "i_right", scope: !330, file: !301, line: 87, baseType: !84, size: 32, offset: 32)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "i_top", scope: !330, file: !301, line: 88, baseType: !84, size: 32, offset: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "i_bottom", scope: !330, file: !301, line: 89, baseType: !84, size: 32, offset: 96)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "b_vui", scope: !302, file: !301, line: 92, baseType: !84, size: 32, offset: 8992)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !302, file: !301, line: 150, baseType: !338, size: 1344, offset: 9024)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !302, file: !301, line: 93, size: 1344, elements: !339)
!339 = !{!340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !376, !377, !378, !379, !380, !381, !382, !383, !384}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "b_aspect_ratio_info_present", scope: !338, file: !301, line: 95, baseType: !84, size: 32)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !338, file: !301, line: 96, baseType: !84, size: 32, offset: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !338, file: !301, line: 97, baseType: !84, size: 32, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info_present", scope: !338, file: !301, line: 99, baseType: !84, size: 32, offset: 96)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info", scope: !338, file: !301, line: 100, baseType: !84, size: 32, offset: 128)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "b_signal_type_present", scope: !338, file: !301, line: 102, baseType: !84, size: 32, offset: 160)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !338, file: !301, line: 103, baseType: !84, size: 32, offset: 192)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !338, file: !301, line: 104, baseType: !84, size: 32, offset: 224)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "b_color_description_present", scope: !338, file: !301, line: 105, baseType: !84, size: 32, offset: 256)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !338, file: !301, line: 106, baseType: !84, size: 32, offset: 288)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !338, file: !301, line: 107, baseType: !84, size: 32, offset: 320)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !338, file: !301, line: 108, baseType: !84, size: 32, offset: 352)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_loc_info_present", scope: !338, file: !301, line: 110, baseType: !84, size: 32, offset: 384)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_top", scope: !338, file: !301, line: 111, baseType: !84, size: 32, offset: 416)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_bottom", scope: !338, file: !301, line: 112, baseType: !84, size: 32, offset: 448)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "b_timing_info_present", scope: !338, file: !301, line: 114, baseType: !84, size: 32, offset: 480)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_units_in_tick", scope: !338, file: !301, line: 115, baseType: !22, size: 32, offset: 512)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_scale", scope: !338, file: !301, line: 116, baseType: !22, size: 32, offset: 544)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "b_fixed_frame_rate", scope: !338, file: !301, line: 117, baseType: !84, size: 32, offset: 576)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "b_nal_hrd_parameters_present", scope: !338, file: !301, line: 119, baseType: !84, size: 32, offset: 608)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "b_vcl_hrd_parameters_present", scope: !338, file: !301, line: 120, baseType: !84, size: 32, offset: 640)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "hrd", scope: !338, file: !301, line: 137, baseType: !362, size: 384, offset: 672)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !338, file: !301, line: 122, size: 384, elements: !363)
!363 = !{!364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_cnt", scope: !362, file: !301, line: 124, baseType: !84, size: 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_scale", scope: !362, file: !301, line: 125, baseType: !84, size: 32, offset: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_scale", scope: !362, file: !301, line: 126, baseType: !84, size: 32, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_value", scope: !362, file: !301, line: 127, baseType: !84, size: 32, offset: 96)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_value", scope: !362, file: !301, line: 128, baseType: !84, size: 32, offset: 128)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_unscaled", scope: !362, file: !301, line: 129, baseType: !84, size: 32, offset: 160)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_unscaled", scope: !362, file: !301, line: 130, baseType: !84, size: 32, offset: 192)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "b_cbr_hrd", scope: !362, file: !301, line: 131, baseType: !84, size: 32, offset: 224)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "i_initial_cpb_removal_delay_length", scope: !362, file: !301, line: 133, baseType: !84, size: 32, offset: 256)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_removal_delay_length", scope: !362, file: !301, line: 134, baseType: !84, size: 32, offset: 288)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay_length", scope: !362, file: !301, line: 135, baseType: !84, size: 32, offset: 320)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_offset_length", scope: !362, file: !301, line: 136, baseType: !84, size: 32, offset: 352)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct_present", scope: !338, file: !301, line: 139, baseType: !84, size: 32, offset: 1056)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "b_bitstream_restriction", scope: !338, file: !301, line: 140, baseType: !84, size: 32, offset: 1088)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "b_motion_vectors_over_pic_boundaries", scope: !338, file: !301, line: 141, baseType: !84, size: 32, offset: 1120)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bytes_per_pic_denom", scope: !338, file: !301, line: 142, baseType: !84, size: 32, offset: 1152)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bits_per_mb_denom", scope: !338, file: !301, line: 143, baseType: !84, size: 32, offset: 1184)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_horizontal", scope: !338, file: !301, line: 144, baseType: !84, size: 32, offset: 1216)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_vertical", scope: !338, file: !301, line: 145, baseType: !84, size: 32, offset: 1248)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_reorder_frames", scope: !338, file: !301, line: 146, baseType: !84, size: 32, offset: 1280)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dec_frame_buffering", scope: !338, file: !301, line: 147, baseType: !84, size: 32, offset: 1312)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "b_qpprime_y_zero_transform_bypass", scope: !302, file: !301, line: 152, baseType: !84, size: 32, offset: 10368)
!386 = !{!387}
!387 = !DISubrange(count: 1)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !76, file: !18, line: 431, baseType: !389, size: 64, offset: 25600)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "pps_array", scope: !76, file: !18, line: 432, baseType: !391, size: 960, offset: 25664)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !392, size: 960, elements: !386)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pps_t", file: !301, line: 186, baseType: !393)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !301, line: 156, size: 960, elements: !394)
!394 = !{!395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !393, file: !301, line: 158, baseType: !84, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !393, file: !301, line: 159, baseType: !84, size: 32, offset: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !393, file: !301, line: 161, baseType: !84, size: 32, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_order", scope: !393, file: !301, line: 163, baseType: !84, size: 32, offset: 96)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_slice_groups", scope: !393, file: !301, line: 164, baseType: !84, size: 32, offset: 128)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_default_active", scope: !393, file: !301, line: 166, baseType: !84, size: 32, offset: 160)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_default_active", scope: !393, file: !301, line: 167, baseType: !84, size: 32, offset: 192)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_pred", scope: !393, file: !301, line: 169, baseType: !84, size: 32, offset: 224)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !393, file: !301, line: 170, baseType: !84, size: 32, offset: 256)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qp", scope: !393, file: !301, line: 172, baseType: !84, size: 32, offset: 288)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qs", scope: !393, file: !301, line: 173, baseType: !84, size: 32, offset: 320)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_index_offset", scope: !393, file: !301, line: 175, baseType: !84, size: 32, offset: 352)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter_control", scope: !393, file: !301, line: 177, baseType: !84, size: 32, offset: 384)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra_pred", scope: !393, file: !301, line: 178, baseType: !84, size: 32, offset: 416)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "b_redundant_pic_cnt", scope: !393, file: !301, line: 179, baseType: !84, size: 32, offset: 448)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8_mode", scope: !393, file: !301, line: 181, baseType: !84, size: 32, offset: 480)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !393, file: !301, line: 183, baseType: !84, size: 32, offset: 512)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !393, file: !301, line: 184, baseType: !413, size: 384, offset: 576)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !414, size: 384, elements: !415)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!415 = !{!416}
!416 = !DISubrange(count: 6)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !76, file: !18, line: 433, baseType: !418, size: 64, offset: 26624)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !76, file: !18, line: 434, baseType: !84, size: 32, offset: 26688)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts_compress_multiplier", scope: !76, file: !18, line: 437, baseType: !84, size: 32, offset: 26720)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_mf", scope: !76, file: !18, line: 440, baseType: !422, size: 256, offset: 26752)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !423, size: 256, elements: !38)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 512, elements: !64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_mf", scope: !76, file: !18, line: 441, baseType: !426, size: 128, offset: 27008)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !427, size: 128, elements: !31)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 2048, elements: !61)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "unquant4_mf", scope: !76, file: !18, line: 443, baseType: !422, size: 256, offset: 27136)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "unquant8_mf", scope: !76, file: !18, line: 444, baseType: !426, size: 128, offset: 27392)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_mf", scope: !76, file: !18, line: 446, baseType: !432, size: 256, offset: 27520)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 256, elements: !38)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 256, elements: !64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_mf", scope: !76, file: !18, line: 447, baseType: !436, size: 128, offset: 27776)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !437, size: 128, elements: !31)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 1024, elements: !61)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_bias", scope: !76, file: !18, line: 448, baseType: !432, size: 256, offset: 27904)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_bias", scope: !76, file: !18, line: 449, baseType: !436, size: 128, offset: 28160)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv", scope: !76, file: !18, line: 454, baseType: !442, size: 5888, offset: 28288)
!442 = !DICompositeType(tag: DW_TAG_array_type, baseType: !443, size: 5888, elements: !444)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!444 = !{!445}
!445 = !DISubrange(count: 92)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv_fpel", scope: !76, file: !18, line: 455, baseType: !447, size: 23552, offset: 34176)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !443, size: 23552, elements: !448)
!448 = !{!445, !39}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !76, file: !18, line: 457, baseType: !414, size: 64, offset: 57728)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !76, file: !18, line: 460, baseType: !451, size: 53376, offset: 57856)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_slice_header_t", file: !18, line: 364, baseType: !452)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 302, size: 53376, elements: !453)
!453 = !{!454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !482, !511, !512, !513, !519, !520, !521, !522, !523, !524, !525, !526}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !452, file: !18, line: 304, baseType: !389, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !452, file: !18, line: 305, baseType: !418, size: 64, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !452, file: !18, line: 307, baseType: !84, size: 32, offset: 128)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "i_first_mb", scope: !452, file: !18, line: 308, baseType: !84, size: 32, offset: 160)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_mb", scope: !452, file: !18, line: 309, baseType: !84, size: 32, offset: 192)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "i_pps_id", scope: !452, file: !18, line: 311, baseType: !84, size: 32, offset: 224)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !452, file: !18, line: 313, baseType: !84, size: 32, offset: 256)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "b_mbaff", scope: !452, file: !18, line: 315, baseType: !84, size: 32, offset: 288)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "b_field_pic", scope: !452, file: !18, line: 316, baseType: !84, size: 32, offset: 320)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "b_bottom_field", scope: !452, file: !18, line: 317, baseType: !84, size: 32, offset: 352)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !452, file: !18, line: 319, baseType: !84, size: 32, offset: 384)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !452, file: !18, line: 321, baseType: !84, size: 32, offset: 416)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc_bottom", scope: !452, file: !18, line: 322, baseType: !84, size: 32, offset: 448)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc", scope: !452, file: !18, line: 324, baseType: !178, size: 64, offset: 480)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "i_redundant_pic_cnt", scope: !452, file: !18, line: 325, baseType: !84, size: 32, offset: 544)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_spatial_mv_pred", scope: !452, file: !18, line: 327, baseType: !84, size: 32, offset: 576)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "b_num_ref_idx_override", scope: !452, file: !18, line: 329, baseType: !84, size: 32, offset: 608)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !452, file: !18, line: 330, baseType: !84, size: 32, offset: 640)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !452, file: !18, line: 331, baseType: !84, size: 32, offset: 672)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l0", scope: !452, file: !18, line: 333, baseType: !84, size: 32, offset: 704)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l1", scope: !452, file: !18, line: 334, baseType: !84, size: 32, offset: 736)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_order", scope: !452, file: !18, line: 339, baseType: !476, size: 2048, offset: 768)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 2048, elements: !481)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !452, file: !18, line: 335, size: 64, elements: !478)
!478 = !{!479, !480}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "idc", scope: !477, file: !18, line: 337, baseType: !84, size: 32)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !477, file: !18, line: 338, baseType: !84, size: 32, offset: 32)
!481 = !{!32, !65}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !452, file: !18, line: 342, baseType: !483, size: 49152, offset: 2816)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !484, size: 49152, elements: !508)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_weight_t", file: !485, line: 36, baseType: !486, align: 128)
!485 = !DIFile(filename: "x264_src/common/mc.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_weight_t", file: !485, line: 26, size: 512, elements: !487)
!487 = !{!488, !494, !495, !498, !499, !500}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "cachea", scope: !486, file: !485, line: 30, baseType: !489, size: 128, align: 128)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !490, size: 128, elements: !54)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !491, line: 25, baseType: !492)
!491 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !25, line: 39, baseType: !493)
!493 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "cacheb", scope: !486, file: !485, line: 31, baseType: !489, size: 128, offset: 128)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "i_denom", scope: !486, file: !485, line: 32, baseType: !496, size: 32, offset: 256)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !491, line: 26, baseType: !497)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !25, line: 41, baseType: !84)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "i_scale", scope: !486, file: !485, line: 33, baseType: !496, size: 32, offset: 288)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset", scope: !486, file: !485, line: 34, baseType: !496, size: 32, offset: 320)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "weightfn", scope: !486, file: !485, line: 35, baseType: !501, size: 64, offset: 384)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "weight_fn_t", file: !485, line: 25, baseType: !503)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DISubroutineType(types: !505)
!505 = !{null, !266, !84, !266, !84, !506, !84}
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !486)
!508 = !{!509, !510}
!509 = !DISubrange(count: 32)
!510 = !DISubrange(count: 3)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_remove_from_end", scope: !452, file: !18, line: 344, baseType: !84, size: 32, offset: 51968)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_command_count", scope: !452, file: !18, line: 345, baseType: !84, size: 32, offset: 52000)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "mmco", scope: !452, file: !18, line: 350, baseType: !514, size: 1024, offset: 52032)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !515, size: 1024, elements: !64)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !452, file: !18, line: 346, size: 64, elements: !516)
!516 = !{!517, !518}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "i_difference_of_pic_nums", scope: !515, file: !18, line: 348, baseType: !84, size: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !515, file: !18, line: 349, baseType: !84, size: 32, offset: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !452, file: !18, line: 352, baseType: !84, size: 32, offset: 53056)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !452, file: !18, line: 354, baseType: !84, size: 32, offset: 53088)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_delta", scope: !452, file: !18, line: 355, baseType: !84, size: 32, offset: 53120)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "b_sp_for_swidth", scope: !452, file: !18, line: 356, baseType: !84, size: 32, offset: 53152)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "i_qs_delta", scope: !452, file: !18, line: 357, baseType: !84, size: 32, offset: 53184)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "i_disable_deblocking_filter_idc", scope: !452, file: !18, line: 360, baseType: !84, size: 32, offset: 53216)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "i_alpha_c0_offset", scope: !452, file: !18, line: 361, baseType: !84, size: 32, offset: 53248)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "i_beta_offset", scope: !452, file: !18, line: 362, baseType: !84, size: 32, offset: 53280)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !76, file: !18, line: 463, baseType: !528, size: 4096, offset: 111232)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_cabac_t", file: !529, line: 46, baseType: !530)
!529 = !DIFile(filename: "x264_src/common/cabac.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !529, line: 27, size: 4096, elements: !531)
!531 = !{!532, !533, !534, !535, !536, !537, !538, !539, !540}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "i_low", scope: !530, file: !529, line: 30, baseType: !84, size: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "i_range", scope: !530, file: !529, line: 31, baseType: !84, size: 32, offset: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "i_queue", scope: !530, file: !529, line: 34, baseType: !84, size: 32, offset: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "i_bytes_outstanding", scope: !530, file: !529, line: 35, baseType: !84, size: 32, offset: 96)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !530, file: !529, line: 37, baseType: !266, size: 64, offset: 128)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !530, file: !529, line: 38, baseType: !266, size: 64, offset: 192)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !530, file: !529, line: 39, baseType: !266, size: 64, offset: 256)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "f8_bits_encoded", scope: !530, file: !529, line: 42, baseType: !84, size: 32, align: 128, offset: 384)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !530, file: !529, line: 45, baseType: !541, size: 3680, offset: 416)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 3680, elements: !542)
!542 = !{!543}
!543 = !DISubrange(count: 460)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !76, file: !18, line: 494, baseType: !545, size: 2112, offset: 115328)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !76, file: !18, line: 465, size: 2112, elements: !546)
!546 = !{!547, !685, !687, !688, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !701, !702, !703, !704}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !545, file: !18, line: 468, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_frame_t", file: !551, line: 146, baseType: !552)
!551 = !DIFile(filename: "x264_src/common/frame.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_frame", file: !551, line: 31, size: 125056, elements: !553)
!553 = !{!554, !555, !556, !557, !560, !561, !562, !563, !564, !565, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !584, !585, !586, !587, !588, !589, !591, !593, !594, !595, !596, !597, !600, !602, !603, !605, !610, !611, !615, !616, !620, !624, !627, !629, !630, !632, !633, !635, !636, !637, !640, !642, !643, !644, !646, !647, !648, !649, !650, !651, !652, !653, !655, !656, !657, !666, !670, !672, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !552, file: !551, line: 34, baseType: !84, size: 32)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !552, file: !551, line: 35, baseType: !84, size: 32, offset: 32)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !552, file: !551, line: 36, baseType: !84, size: 32, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !552, file: !551, line: 37, baseType: !558, size: 64, offset: 128)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !491, line: 27, baseType: !559)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !25, line: 44, baseType: !280)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts", scope: !552, file: !551, line: 38, baseType: !558, size: 64, offset: 192)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "i_duration", scope: !552, file: !551, line: 39, baseType: !84, size: 32, offset: 256)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_duration", scope: !552, file: !551, line: 40, baseType: !84, size: 32, offset: 288)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !552, file: !551, line: 41, baseType: !84, size: 32, offset: 320)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay", scope: !552, file: !551, line: 42, baseType: !84, size: 32, offset: 352)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !552, file: !551, line: 43, baseType: !566, size: 64, offset: 384)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !552, file: !551, line: 45, baseType: !84, size: 32, offset: 448)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded", scope: !552, file: !551, line: 46, baseType: !84, size: 32, offset: 480)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "i_field_cnt", scope: !552, file: !551, line: 47, baseType: !84, size: 32, offset: 512)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !552, file: !551, line: 48, baseType: !84, size: 32, offset: 544)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "b_kept_as_ref", scope: !552, file: !551, line: 49, baseType: !84, size: 32, offset: 576)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_struct", scope: !552, file: !551, line: 50, baseType: !84, size: 32, offset: 608)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "b_keyframe", scope: !552, file: !551, line: 51, baseType: !84, size: 32, offset: 640)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "b_fdec", scope: !552, file: !551, line: 52, baseType: !35, size: 8, offset: 672)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_minigop_bframe", scope: !552, file: !551, line: 53, baseType: !35, size: 8, offset: 680)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframes", scope: !552, file: !551, line: 54, baseType: !35, size: 8, offset: 688)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_rc", scope: !552, file: !551, line: 55, baseType: !174, size: 32, offset: 704)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_aq", scope: !552, file: !551, line: 56, baseType: !174, size: 32, offset: 736)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_l0ref0", scope: !552, file: !551, line: 57, baseType: !84, size: 32, offset: 768)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !552, file: !551, line: 60, baseType: !84, size: 32, offset: 800)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !552, file: !551, line: 61, baseType: !582, size: 96, offset: 832)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 96, elements: !583)
!583 = !{!510}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !552, file: !551, line: 62, baseType: !582, size: 96, offset: 928)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines", scope: !552, file: !551, line: 63, baseType: !582, size: 96, offset: 1024)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride_lowres", scope: !552, file: !551, line: 64, baseType: !84, size: 32, offset: 1120)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "i_width_lowres", scope: !552, file: !551, line: 65, baseType: !84, size: 32, offset: 1152)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_lowres", scope: !552, file: !551, line: 66, baseType: !84, size: 32, offset: 1184)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !552, file: !551, line: 67, baseType: !590, size: 192, offset: 1216)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 192, elements: !583)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "filtered", scope: !552, file: !551, line: 68, baseType: !592, size: 256, offset: 1408)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 256, elements: !38)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !552, file: !551, line: 69, baseType: !592, size: 256, offset: 1664)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "integral", scope: !552, file: !551, line: 70, baseType: !443, size: 64, offset: 1920)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !552, file: !551, line: 74, baseType: !592, size: 256, offset: 1984)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_lowres", scope: !552, file: !551, line: 75, baseType: !592, size: 256, offset: 2240)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !552, file: !551, line: 77, baseType: !598, size: 24576, offset: 2560)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !484, size: 24576, elements: !599)
!599 = !{!65, !510}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "weighted", scope: !552, file: !551, line: 78, baseType: !601, size: 1024, offset: 27136)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 1024, elements: !64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "b_duplicate", scope: !552, file: !551, line: 79, baseType: !84, size: 32, offset: 28160)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !552, file: !551, line: 80, baseType: !604, size: 64, offset: 28224)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !552, file: !551, line: 83, baseType: !606, size: 64, offset: 28288)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !491, line: 24, baseType: !608)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !25, line: 37, baseType: !609)
!609 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "mb_partition", scope: !552, file: !551, line: 84, baseType: !266, size: 64, offset: 28352)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !552, file: !551, line: 85, baseType: !612, size: 128, offset: 28416)
!612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, size: 128, elements: !31)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !490, size: 32, elements: !31)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "mv16x16", scope: !552, file: !551, line: 86, baseType: !613, size: 64, offset: 28544)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mvs", scope: !552, file: !551, line: 87, baseType: !617, size: 2176, offset: 28608)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, size: 2176, elements: !618)
!618 = !{!32, !619}
!619 = !DISubrange(count: 17)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_costs", scope: !552, file: !551, line: 92, baseType: !621, size: 20736, offset: 30784)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !443, size: 20736, elements: !622)
!622 = !{!623, !623}
!623 = !DISubrange(count: 18)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mv_costs", scope: !552, file: !551, line: 96, baseType: !625, size: 2176, offset: 51520)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !626, size: 2176, elements: !618)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !552, file: !551, line: 97, baseType: !628, size: 128, offset: 53696)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !606, size: 128, elements: !31)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref", scope: !552, file: !551, line: 98, baseType: !178, size: 64, offset: 53824)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc", scope: !552, file: !551, line: 99, baseType: !631, size: 1024, offset: 53888)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 1024, elements: !481)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "inv_ref_poc", scope: !552, file: !551, line: 100, baseType: !614, size: 32, offset: 54912)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est", scope: !552, file: !551, line: 105, baseType: !634, size: 10368, offset: 54944)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 10368, elements: !622)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est_aq", scope: !552, file: !551, line: 106, baseType: !634, size: 10368, offset: 65312)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "i_satd", scope: !552, file: !551, line: 107, baseType: !84, size: 32, offset: 75680)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_mbs", scope: !552, file: !551, line: 108, baseType: !638, size: 576, offset: 75712)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 576, elements: !639)
!639 = !{!623}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satds", scope: !552, file: !551, line: 109, baseType: !641, size: 20736, offset: 76288)
!641 = !DICompositeType(tag: DW_TAG_array_type, baseType: !626, size: 20736, elements: !622)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satd", scope: !552, file: !551, line: 110, baseType: !626, size: 64, offset: 97024)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_bits", scope: !552, file: !551, line: 111, baseType: !626, size: 64, offset: 97088)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "f_row_qp", scope: !552, file: !551, line: 112, baseType: !645, size: 64, offset: 97152)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset", scope: !552, file: !551, line: 113, baseType: !645, size: 64, offset: 97216)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset_aq", scope: !552, file: !551, line: 114, baseType: !645, size: 64, offset: 97280)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_calculated", scope: !552, file: !551, line: 115, baseType: !84, size: 32, offset: 97344)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !552, file: !551, line: 116, baseType: !443, size: 64, offset: 97408)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "i_propagate_cost", scope: !552, file: !551, line: 117, baseType: !443, size: 64, offset: 97472)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "i_inv_qscale_factor", scope: !552, file: !551, line: 118, baseType: !443, size: 64, offset: 97536)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "b_scenecut", scope: !552, file: !551, line: 119, baseType: !84, size: 32, offset: 97600)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "f_weighted_cost_delta", scope: !552, file: !551, line: 120, baseType: !654, size: 576, offset: 97632)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 576, elements: !639)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_sum", scope: !552, file: !551, line: 121, baseType: !22, size: 32, offset: 98208)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_ssd", scope: !552, file: !551, line: 122, baseType: !45, size: 64, offset: 98240)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "hrd_timing", scope: !552, file: !551, line: 125, baseType: !658, size: 256, offset: 98304)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_hrd_t", file: !75, line: 503, baseType: !659)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !75, line: 496, size: 256, elements: !660)
!660 = !{!661, !663, !664, !665}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_initial_arrival_time", scope: !659, file: !75, line: 498, baseType: !662, size: 64)
!662 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_final_arrival_time", scope: !659, file: !75, line: 499, baseType: !662, size: 64, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_time", scope: !659, file: !75, line: 500, baseType: !662, size: 64, offset: 128)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_time", scope: !659, file: !75, line: 502, baseType: !662, size: 64, offset: 192)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_type", scope: !552, file: !551, line: 128, baseType: !667, size: 2008, offset: 98560)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 2008, elements: !668)
!668 = !{!669}
!669 = !DISubrange(count: 251)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_satd", scope: !552, file: !551, line: 129, baseType: !671, size: 8032, offset: 100576)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 8032, elements: !668)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "f_planned_cpb_duration", scope: !552, file: !551, line: 130, baseType: !673, size: 16064, offset: 108608)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !662, size: 16064, elements: !668)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !552, file: !551, line: 131, baseType: !84, size: 32, offset: 124672)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !552, file: !551, line: 132, baseType: !84, size: 32, offset: 124704)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_completed", scope: !552, file: !551, line: 135, baseType: !84, size: 32, offset: 124736)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_weighted", scope: !552, file: !551, line: 136, baseType: !84, size: 32, offset: 124768)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "i_reference_count", scope: !552, file: !551, line: 137, baseType: !84, size: 32, offset: 124800)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !552, file: !551, line: 138, baseType: !84, size: 32, offset: 124832)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !552, file: !551, line: 139, baseType: !84, size: 32, offset: 124864)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "f_pir_position", scope: !552, file: !551, line: 142, baseType: !174, size: 32, offset: 124896)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_start_col", scope: !552, file: !551, line: 143, baseType: !84, size: 32, offset: 124928)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_end_col", scope: !552, file: !551, line: 144, baseType: !84, size: 32, offset: 124960)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "i_frames_since_pir", scope: !552, file: !551, line: 145, baseType: !84, size: 32, offset: 124992)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !545, file: !18, line: 470, baseType: !686, size: 128, offset: 64)
!686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !548, size: 128, elements: !31)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "blank_unused", scope: !545, file: !18, line: 473, baseType: !548, size: 64, offset: 192)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !545, file: !18, line: 476, baseType: !689, size: 1152, offset: 256)
!689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !549, size: 1152, elements: !639)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_keyframe", scope: !545, file: !18, line: 478, baseType: !84, size: 32, offset: 1408)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "i_input", scope: !545, file: !18, line: 480, baseType: !84, size: 32, offset: 1440)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dpb", scope: !545, file: !18, line: 482, baseType: !84, size: 32, offset: 1472)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref0", scope: !545, file: !18, line: 483, baseType: !84, size: 32, offset: 1504)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref1", scope: !545, file: !18, line: 484, baseType: !84, size: 32, offset: 1536)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "i_delay", scope: !545, file: !18, line: 485, baseType: !84, size: 32, offset: 1568)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay", scope: !545, file: !18, line: 486, baseType: !84, size: 32, offset: 1600)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay_time", scope: !545, file: !18, line: 487, baseType: !558, size: 64, offset: 1664)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "i_init_delta", scope: !545, file: !18, line: 488, baseType: !558, size: 64, offset: 1728)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_reordered_pts", scope: !545, file: !18, line: 489, baseType: !700, size: 128, offset: 1792)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !558, size: 128, elements: !31)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "i_largest_pts", scope: !545, file: !18, line: 490, baseType: !558, size: 64, offset: 1920)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "i_second_largest_pts", scope: !545, file: !18, line: 491, baseType: !558, size: 64, offset: 1984)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_lowres", scope: !545, file: !18, line: 492, baseType: !84, size: 32, offset: 2048)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_sub8x8_esa", scope: !545, file: !18, line: 493, baseType: !84, size: 32, offset: 2080)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "fenc", scope: !76, file: !18, line: 497, baseType: !549, size: 64, offset: 117440)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "fdec", scope: !76, file: !18, line: 500, baseType: !549, size: 64, offset: 117504)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref0", scope: !76, file: !18, line: 503, baseType: !84, size: 32, offset: 117568)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "fref0", scope: !76, file: !18, line: 504, baseType: !709, size: 1216, offset: 117632)
!709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !549, size: 1216, elements: !710)
!710 = !{!711}
!711 = !DISubrange(count: 19)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref1", scope: !76, file: !18, line: 505, baseType: !84, size: 32, offset: 118848)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "fref1", scope: !76, file: !18, line: 506, baseType: !709, size: 1216, offset: 118912)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_reorder", scope: !76, file: !18, line: 507, baseType: !178, size: 64, offset: 120128)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay", scope: !76, file: !18, line: 510, baseType: !84, size: 32, offset: 120192)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_offset", scope: !76, file: !18, line: 511, baseType: !84, size: 32, offset: 120224)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts_delay", scope: !76, file: !18, line: 512, baseType: !558, size: 64, offset: 120256)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "dct", scope: !76, file: !18, line: 522, baseType: !719, size: 10624, offset: 120320)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !76, file: !18, line: 515, size: 10624, elements: !720)
!720 = !{!721, !723, !726, !729}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "luma16x16_dc", scope: !719, file: !18, line: 517, baseType: !722, size: 256, align: 128)
!722 = !DICompositeType(tag: DW_TAG_array_type, baseType: !490, size: 256, elements: !64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_dc", scope: !719, file: !18, line: 518, baseType: !724, size: 128, align: 128, offset: 256)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !490, size: 128, elements: !725)
!725 = !{!32, !39}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "luma8x8", scope: !719, file: !18, line: 520, baseType: !727, size: 4096, align: 128, offset: 384)
!727 = !DICompositeType(tag: DW_TAG_array_type, baseType: !490, size: 4096, elements: !728)
!728 = !{!39, !62}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "luma4x4", scope: !719, file: !18, line: 521, baseType: !730, size: 6144, align: 128, offset: 4480)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !490, size: 6144, elements: !731)
!731 = !{!732, !65}
!732 = !DISubrange(count: 24)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !76, file: !18, line: 732, baseType: !734, size: 82688, offset: 130944)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !76, file: !18, line: 525, size: 82688, elements: !735)
!735 = !{!736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !763, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !781, !784, !788, !789, !790, !795, !796, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !864, !895, !896, !897, !898, !899, !900, !901, !902, !903, !906, !907, !908, !911, !914, !916, !919, !921, !922}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !734, file: !18, line: 527, baseType: !84, size: 32)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_stride", scope: !734, file: !18, line: 530, baseType: !84, size: 32, offset: 32)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_stride", scope: !734, file: !18, line: 531, baseType: !84, size: 32, offset: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_stride", scope: !734, file: !18, line: 532, baseType: !84, size: 32, offset: 96)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_x", scope: !734, file: !18, line: 535, baseType: !84, size: 32, offset: 128)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_y", scope: !734, file: !18, line: 536, baseType: !84, size: 32, offset: 160)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_xy", scope: !734, file: !18, line: 537, baseType: !84, size: 32, offset: 192)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_xy", scope: !734, file: !18, line: 538, baseType: !84, size: 32, offset: 224)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_xy", scope: !734, file: !18, line: 539, baseType: !84, size: 32, offset: 256)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !734, file: !18, line: 542, baseType: !84, size: 32, offset: 288)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !734, file: !18, line: 543, baseType: !84, size: 32, offset: 320)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !734, file: !18, line: 544, baseType: !84, size: 32, offset: 352)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "b_trellis", scope: !734, file: !18, line: 545, baseType: !84, size: 32, offset: 384)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "b_noise_reduction", scope: !734, file: !18, line: 546, baseType: !84, size: 32, offset: 416)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !734, file: !18, line: 547, baseType: !84, size: 32, offset: 448)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_rd", scope: !734, file: !18, line: 548, baseType: !84, size: 32, offset: 480)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_trellis", scope: !734, file: !18, line: 549, baseType: !84, size: 32, offset: 512)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !734, file: !18, line: 551, baseType: !84, size: 32, offset: 544)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min", scope: !734, file: !18, line: 554, baseType: !178, size: 64, offset: 576)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max", scope: !734, file: !18, line: 555, baseType: !178, size: 64, offset: 640)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_spel", scope: !734, file: !18, line: 558, baseType: !178, size: 64, offset: 704)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_spel", scope: !734, file: !18, line: 559, baseType: !178, size: 64, offset: 768)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_fpel", scope: !734, file: !18, line: 561, baseType: !178, size: 64, offset: 832)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_fpel", scope: !734, file: !18, line: 562, baseType: !178, size: 64, offset: 896)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour", scope: !734, file: !18, line: 565, baseType: !7, size: 32, offset: 960)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour8", scope: !734, file: !18, line: 566, baseType: !762, size: 128, offset: 992)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128, elements: !38)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour4", scope: !734, file: !18, line: 567, baseType: !764, size: 512, offset: 1120)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 512, elements: !64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_intra", scope: !734, file: !18, line: 568, baseType: !7, size: 32, offset: 1632)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_frame", scope: !734, file: !18, line: 569, baseType: !7, size: 32, offset: 1664)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_top", scope: !734, file: !18, line: 570, baseType: !84, size: 32, offset: 1696)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_left", scope: !734, file: !18, line: 571, baseType: !84, size: 32, offset: 1728)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topleft", scope: !734, file: !18, line: 572, baseType: !84, size: 32, offset: 1760)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topright", scope: !734, file: !18, line: 573, baseType: !84, size: 32, offset: 1792)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_prev_xy", scope: !734, file: !18, line: 574, baseType: !84, size: 32, offset: 1824)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_left_xy", scope: !734, file: !18, line: 575, baseType: !84, size: 32, offset: 1856)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_top_xy", scope: !734, file: !18, line: 576, baseType: !84, size: 32, offset: 1888)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topleft_xy", scope: !734, file: !18, line: 577, baseType: !84, size: 32, offset: 1920)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topright_xy", scope: !734, file: !18, line: 578, baseType: !84, size: 32, offset: 1952)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !734, file: !18, line: 585, baseType: !606, size: 64, offset: 1984)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "partition", scope: !734, file: !18, line: 586, baseType: !266, size: 64, offset: 2048)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !734, file: !18, line: 587, baseType: !606, size: 64, offset: 2112)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !734, file: !18, line: 588, baseType: !780, size: 64, offset: 2176)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !734, file: !18, line: 589, baseType: !782, size: 64, offset: 2240)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !607, size: 64, elements: !54)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !734, file: !18, line: 591, baseType: !785, size: 64, offset: 2304)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 192, elements: !787)
!787 = !{!732}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_pred_mode", scope: !734, file: !18, line: 592, baseType: !606, size: 64, offset: 2368)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !734, file: !18, line: 593, baseType: !612, size: 128, offset: 2432)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !734, file: !18, line: 594, baseType: !791, size: 128, offset: 2560)
!791 = !DICompositeType(tag: DW_TAG_array_type, baseType: !792, size: 128, elements: !31)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 128, elements: !794)
!794 = !{!55, !32}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !734, file: !18, line: 595, baseType: !628, size: 128, offset: 2688)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "mvr", scope: !734, file: !18, line: 596, baseType: !797, size: 4096, offset: 2816)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, size: 4096, elements: !798)
!798 = !{!32, !509}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "skipbp", scope: !734, file: !18, line: 597, baseType: !606, size: 64, offset: 6912)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "mb_transform_size", scope: !734, file: !18, line: 598, baseType: !606, size: 64, offset: 6976)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "slice_table", scope: !734, file: !18, line: 599, baseType: !443, size: 64, offset: 7040)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "p_weight_buf", scope: !734, file: !18, line: 603, baseType: !601, size: 1024, offset: 7104)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !734, file: !18, line: 606, baseType: !84, size: 32, offset: 8128)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "i_partition", scope: !734, file: !18, line: 607, baseType: !84, size: 32, offset: 8160)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "i_sub_partition", scope: !734, file: !18, line: 608, baseType: !34, size: 32, align: 32, offset: 8192)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !734, file: !18, line: 609, baseType: !84, size: 32, offset: 8224)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_luma", scope: !734, file: !18, line: 611, baseType: !84, size: 32, offset: 8256)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_chroma", scope: !734, file: !18, line: 612, baseType: !84, size: 32, offset: 8288)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra16x16_pred_mode", scope: !734, file: !18, line: 614, baseType: !84, size: 32, offset: 8320)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_pred_mode", scope: !734, file: !18, line: 615, baseType: !84, size: 32, offset: 8352)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "i_skip_intra", scope: !734, file: !18, line: 621, baseType: !84, size: 32, offset: 8384)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "b_skip_mc", scope: !734, file: !18, line: 624, baseType: !84, size: 32, offset: 8416)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "b_reencode_mb", scope: !734, file: !18, line: 626, baseType: !84, size: 32, offset: 8448)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "ip_offset", scope: !734, file: !18, line: 627, baseType: !84, size: 32, offset: 8480)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "pic", scope: !734, file: !18, line: 671, baseType: !816, size: 60672, offset: 8576)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !734, file: !18, line: 629, size: 60672, elements: !817)
!817 = !{!818, !822, !826, !828, !829, !832, !836, !838, !839, !840, !841, !842, !845, !849, !852, !853, !854, !855, !856, !859, !861, !863}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_buf", scope: !816, file: !18, line: 634, baseType: !819, size: 3072, align: 128)
!819 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 3072, elements: !820)
!820 = !{!821}
!821 = !DISubrange(count: 384)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "fdec_buf", scope: !816, file: !18, line: 635, baseType: !823, size: 6912, align: 128, offset: 3072)
!823 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 6912, elements: !824)
!824 = !{!825}
!825 = !DISubrange(count: 864)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_fdec_buf", scope: !816, file: !18, line: 638, baseType: !827, size: 2048, align: 128, offset: 9984)
!827 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 2048, elements: !319)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_fdec_buf", scope: !816, file: !18, line: 639, baseType: !827, size: 2048, align: 128, offset: 12032)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_dct_buf", scope: !816, file: !18, line: 640, baseType: !830, size: 3072, align: 128, offset: 14080)
!830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !490, size: 3072, elements: !831)
!831 = !{!510, !62}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_dct_buf", scope: !816, file: !18, line: 641, baseType: !833, size: 3840, align: 128, offset: 17152)
!833 = !DICompositeType(tag: DW_TAG_array_type, baseType: !490, size: 3840, elements: !834)
!834 = !{!835, !65}
!835 = !DISubrange(count: 15)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_nnz_buf", scope: !816, file: !18, line: 642, baseType: !837, size: 128, offset: 20992)
!837 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 128, elements: !38)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_nnz_buf", scope: !816, file: !18, line: 643, baseType: !837, size: 128, offset: 21120)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_cbp", scope: !816, file: !18, line: 644, baseType: !84, size: 32, offset: 21248)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_cbp", scope: !816, file: !18, line: 645, baseType: !84, size: 32, offset: 21280)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct8", scope: !816, file: !18, line: 648, baseType: !727, size: 4096, align: 128, offset: 21376)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct4", scope: !816, file: !18, line: 649, baseType: !843, size: 4096, align: 128, offset: 25472)
!843 = !DICompositeType(tag: DW_TAG_array_type, baseType: !490, size: 4096, elements: !844)
!844 = !{!65, !65}
