; ModuleID = 'x264_src/output/flv.c'
source_filename = "x264_src/output/flv.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.cli_output_t = type { i32 (i8*, i8**)*, i32 (i8*, %struct.x264_param_t*)*, i32 (i8*, %struct.x264_nal_t*)*, i32 (i8*, i8*, i32, %struct.x264_picture_t*)*, i32 (i8*, i64, i64)* }
%struct.x264_param_t = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.anon, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, [16 x i8], [16 x i8], [16 x i8], [16 x i8], [64 x i8], [64 x i8], void (i8*, i32, i8*, %struct.__va_list_tag*)*, i8*, i32, i32, i8*, %struct.anon.0, %struct.anon.1, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, void (i8*)* }
%struct.anon = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.anon.0 = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, float, float, i32, [2 x i32], i32, i32 }
%struct.anon.1 = type { i32, i32, i32, i32, i32, i32, float, float, float, i32, i32, float, float, float, i32, float, i32, i32, i32, i8*, i32, i8*, float, float, float, %struct.x264_zone_t*, i32, i8* }
%struct.x264_zone_t = type { i32, i32, i32, i32, float, %struct.x264_param_t* }
%struct.x264_nal_t = type { i32, i32, i32, i8* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "flv_output", scope: !2, file: !3, line: 308, type: !47, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !34, globals: !46, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "x264_src/output/flv.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{!5, !12, !27, !30}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 48, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "x264_src/output/flv_bytestream.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "FLV_TAG_TYPE_AUDIO", value: 8, isUnsigned: true)
!10 = !DIEnumerator(name: "FLV_TAG_TYPE_VIDEO", value: 9, isUnsigned: true)
!11 = !DIEnumerator(name: "FLV_TAG_TYPE_META", value: 18, isUnsigned: true)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 92, baseType: !7, size: 32, elements: !13)
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26}
!14 = !DIEnumerator(name: "AMF_DATA_TYPE_NUMBER", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "AMF_DATA_TYPE_BOOL", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "AMF_DATA_TYPE_STRING", value: 2, isUnsigned: true)
!17 = !DIEnumerator(name: "AMF_DATA_TYPE_OBJECT", value: 3, isUnsigned: true)
!18 = !DIEnumerator(name: "AMF_DATA_TYPE_NULL", value: 5, isUnsigned: true)
!19 = !DIEnumerator(name: "AMF_DATA_TYPE_UNDEFINED", value: 6, isUnsigned: true)
!20 = !DIEnumerator(name: "AMF_DATA_TYPE_REFERENCE", value: 7, isUnsigned: true)
!21 = !DIEnumerator(name: "AMF_DATA_TYPE_MIXEDARRAY", value: 8, isUnsigned: true)
!22 = !DIEnumerator(name: "AMF_DATA_TYPE_OBJECT_END", value: 9, isUnsigned: true)
!23 = !DIEnumerator(name: "AMF_DATA_TYPE_ARRAY", value: 10, isUnsigned: true)
!24 = !DIEnumerator(name: "AMF_DATA_TYPE_DATE", value: 11, isUnsigned: true)
!25 = !DIEnumerator(name: "AMF_DATA_TYPE_LONG_STRING", value: 12, isUnsigned: true)
!26 = !DIEnumerator(name: "AMF_DATA_TYPE_UNSUPPORTED", value: 13, isUnsigned: true)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 81, baseType: !7, size: 32, elements: !28)
!28 = !{!29}
!29 = !DIEnumerator(name: "FLV_CODECID_H264", value: 7, isUnsigned: true)
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 86, baseType: !7, size: 32, elements: !31)
!31 = !{!32, !33}
!32 = !DIEnumerator(name: "FLV_FRAME_KEY", value: 23, isUnsigned: true)
!33 = !DIEnumerator(name: "FLV_FRAME_INTER", value: 39, isUnsigned: true)
!34 = !{!35, !36, !37, !42}
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!36 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !38, line: 27, baseType: !39)
!38 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !40, line: 44, baseType: !41)
!40 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!41 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !43, line: 27, baseType: !44)
!43 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !40, line: 45, baseType: !45)
!45 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!46 = !{!0}
!47 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "cli_output_t", file: !49, line: 34, baseType: !50)
!49 = !DIFile(filename: "x264_src/output/output.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !49, line: 27, size: 320, elements: !51)
!51 = !{!52, !62, !239, !252, !288}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "open_file", scope: !50, file: !49, line: 29, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DISubroutineType(types: !55)
!55 = !{!56, !57, !59}
!56 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "hnd_t", file: !61, line: 30, baseType: !35)
!61 = !DIFile(filename: "x264_src/muxers.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!62 = !DIDerivedType(tag: DW_TAG_member, name: "set_param", scope: !50, file: !49, line: 30, baseType: !63, size: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DISubroutineType(types: !65)
!65 = !{!56, !60, !66}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !68, line: 376, baseType: !69)
!68 = !DIFile(filename: "x264_src/x264.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !68, line: 176, size: 5632, elements: !70)
!70 = !{!71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !119, !120, !121, !122, !126, !127, !140, !141, !142, !143, !144, !175, !217, !218, !219, !220, !221, !222, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !69, file: !68, line: 179, baseType: !7, size: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !69, file: !68, line: 180, baseType: !56, size: 32, offset: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !69, file: !68, line: 181, baseType: !56, size: 32, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !69, file: !68, line: 182, baseType: !56, size: 32, offset: 96)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !69, file: !68, line: 183, baseType: !56, size: 32, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !69, file: !68, line: 186, baseType: !56, size: 32, offset: 160)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !69, file: !68, line: 187, baseType: !56, size: 32, offset: 192)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !69, file: !68, line: 188, baseType: !56, size: 32, offset: 224)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !69, file: !68, line: 189, baseType: !56, size: 32, offset: 256)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !69, file: !68, line: 190, baseType: !56, size: 32, offset: 288)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !69, file: !68, line: 198, baseType: !56, size: 32, offset: 320)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !69, file: !68, line: 215, baseType: !83, size: 288, offset: 352)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !69, file: !68, line: 200, size: 288, elements: !84)
!84 = !{!85, !86, !87, !88, !89, !90, !91, !92, !93}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !83, file: !68, line: 203, baseType: !56, size: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !83, file: !68, line: 204, baseType: !56, size: 32, offset: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !83, file: !68, line: 206, baseType: !56, size: 32, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !83, file: !68, line: 209, baseType: !56, size: 32, offset: 96)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !83, file: !68, line: 210, baseType: !56, size: 32, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !83, file: !68, line: 211, baseType: !56, size: 32, offset: 160)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !83, file: !68, line: 212, baseType: !56, size: 32, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !83, file: !68, line: 213, baseType: !56, size: 32, offset: 224)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !83, file: !68, line: 214, baseType: !56, size: 32, offset: 256)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !69, file: !68, line: 218, baseType: !56, size: 32, offset: 640)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !69, file: !68, line: 219, baseType: !56, size: 32, offset: 672)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !69, file: !68, line: 220, baseType: !56, size: 32, offset: 704)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !69, file: !68, line: 221, baseType: !56, size: 32, offset: 736)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !69, file: !68, line: 222, baseType: !56, size: 32, offset: 768)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !69, file: !68, line: 224, baseType: !56, size: 32, offset: 800)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !69, file: !68, line: 225, baseType: !56, size: 32, offset: 832)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !69, file: !68, line: 226, baseType: !56, size: 32, offset: 864)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !69, file: !68, line: 227, baseType: !56, size: 32, offset: 896)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !69, file: !68, line: 229, baseType: !56, size: 32, offset: 928)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !69, file: !68, line: 230, baseType: !56, size: 32, offset: 960)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !69, file: !68, line: 231, baseType: !56, size: 32, offset: 992)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !69, file: !68, line: 233, baseType: !56, size: 32, offset: 1024)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !69, file: !68, line: 234, baseType: !56, size: 32, offset: 1056)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !69, file: !68, line: 236, baseType: !56, size: 32, offset: 1088)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !69, file: !68, line: 237, baseType: !56, size: 32, offset: 1120)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !69, file: !68, line: 239, baseType: !56, size: 32, offset: 1152)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !69, file: !68, line: 240, baseType: !57, size: 64, offset: 1216)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !69, file: !68, line: 241, baseType: !113, size: 128, offset: 1280)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 128, elements: !117)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !43, line: 24, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !40, line: 38, baseType: !116)
!116 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!117 = !{!118}
!118 = !DISubrange(count: 16)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !69, file: !68, line: 242, baseType: !113, size: 128, offset: 1408)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !69, file: !68, line: 243, baseType: !113, size: 128, offset: 1536)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !69, file: !68, line: 244, baseType: !113, size: 128, offset: 1664)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !69, file: !68, line: 245, baseType: !123, size: 512, offset: 1792)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 512, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !69, file: !68, line: 246, baseType: !123, size: 512, offset: 2304)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !69, file: !68, line: 249, baseType: !128, size: 64, offset: 2816)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{null, !35, !56, !131, !133}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 308, size: 192, elements: !135)
!135 = !{!136, !137, !138, !139}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !134, file: !3, line: 308, baseType: !7, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !134, file: !3, line: 308, baseType: !7, size: 32, offset: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !134, file: !3, line: 308, baseType: !35, size: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !134, file: !3, line: 308, baseType: !35, size: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !69, file: !68, line: 250, baseType: !35, size: 64, offset: 2880)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !69, file: !68, line: 251, baseType: !56, size: 32, offset: 2944)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !69, file: !68, line: 252, baseType: !56, size: 32, offset: 2976)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !69, file: !68, line: 253, baseType: !57, size: 64, offset: 3008)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !69, file: !68, line: 287, baseType: !145, size: 800, offset: 3072)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !69, file: !68, line: 256, size: 800, elements: !146)
!146 = !{!147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !167, !168, !169, !173, !174}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !145, file: !68, line: 258, baseType: !7, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !145, file: !68, line: 259, baseType: !7, size: 32, offset: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !145, file: !68, line: 261, baseType: !56, size: 32, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !145, file: !68, line: 262, baseType: !56, size: 32, offset: 96)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !145, file: !68, line: 263, baseType: !56, size: 32, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !145, file: !68, line: 264, baseType: !56, size: 32, offset: 160)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !145, file: !68, line: 265, baseType: !56, size: 32, offset: 192)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !145, file: !68, line: 267, baseType: !56, size: 32, offset: 224)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !145, file: !68, line: 268, baseType: !56, size: 32, offset: 256)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !145, file: !68, line: 269, baseType: !56, size: 32, offset: 288)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !145, file: !68, line: 270, baseType: !56, size: 32, offset: 320)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !145, file: !68, line: 271, baseType: !56, size: 32, offset: 352)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !145, file: !68, line: 272, baseType: !56, size: 32, offset: 384)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !145, file: !68, line: 273, baseType: !56, size: 32, offset: 416)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !145, file: !68, line: 274, baseType: !56, size: 32, offset: 448)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !145, file: !68, line: 275, baseType: !56, size: 32, offset: 480)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !145, file: !68, line: 276, baseType: !56, size: 32, offset: 512)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !145, file: !68, line: 277, baseType: !56, size: 32, offset: 544)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !145, file: !68, line: 278, baseType: !166, size: 32, offset: 576)
!166 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !145, file: !68, line: 279, baseType: !166, size: 32, offset: 608)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !145, file: !68, line: 280, baseType: !56, size: 32, offset: 640)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !145, file: !68, line: 283, baseType: !170, size: 64, offset: 672)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 64, elements: !171)
!171 = !{!172}
!172 = !DISubrange(count: 2)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !145, file: !68, line: 285, baseType: !56, size: 32, offset: 736)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !145, file: !68, line: 286, baseType: !56, size: 32, offset: 768)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !69, file: !68, line: 327, baseType: !176, size: 1152, offset: 3904)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !69, file: !68, line: 290, size: 1152, elements: !177)
!177 = !{!178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !215, !216}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !176, file: !68, line: 292, baseType: !56, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !176, file: !68, line: 294, baseType: !56, size: 32, offset: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !176, file: !68, line: 295, baseType: !56, size: 32, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !176, file: !68, line: 296, baseType: !56, size: 32, offset: 96)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !176, file: !68, line: 297, baseType: !56, size: 32, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !176, file: !68, line: 299, baseType: !56, size: 32, offset: 160)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !176, file: !68, line: 300, baseType: !166, size: 32, offset: 192)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !176, file: !68, line: 301, baseType: !166, size: 32, offset: 224)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !176, file: !68, line: 302, baseType: !166, size: 32, offset: 256)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !176, file: !68, line: 303, baseType: !56, size: 32, offset: 288)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !176, file: !68, line: 304, baseType: !56, size: 32, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !176, file: !68, line: 305, baseType: !166, size: 32, offset: 352)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !176, file: !68, line: 306, baseType: !166, size: 32, offset: 384)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !176, file: !68, line: 307, baseType: !166, size: 32, offset: 416)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !176, file: !68, line: 309, baseType: !56, size: 32, offset: 448)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !176, file: !68, line: 310, baseType: !166, size: 32, offset: 480)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !176, file: !68, line: 311, baseType: !56, size: 32, offset: 512)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !176, file: !68, line: 312, baseType: !56, size: 32, offset: 544)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !176, file: !68, line: 315, baseType: !56, size: 32, offset: 576)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !176, file: !68, line: 316, baseType: !57, size: 64, offset: 640)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !176, file: !68, line: 317, baseType: !56, size: 32, offset: 704)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !176, file: !68, line: 318, baseType: !57, size: 64, offset: 768)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !176, file: !68, line: 321, baseType: !166, size: 32, offset: 832)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !176, file: !68, line: 322, baseType: !166, size: 32, offset: 864)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !176, file: !68, line: 323, baseType: !166, size: 32, offset: 896)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !176, file: !68, line: 324, baseType: !204, size: 64, offset: 960)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !68, line: 174, baseType: !206)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !68, line: 167, size: 256, elements: !207)
!207 = !{!208, !209, !210, !211, !212, !213}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !206, file: !68, line: 169, baseType: !56, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !206, file: !68, line: 169, baseType: !56, size: 32, offset: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !206, file: !68, line: 170, baseType: !56, size: 32, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !206, file: !68, line: 171, baseType: !56, size: 32, offset: 96)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !206, file: !68, line: 172, baseType: !166, size: 32, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !206, file: !68, line: 173, baseType: !214, size: 64, offset: 192)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !176, file: !68, line: 325, baseType: !56, size: 32, offset: 1024)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !176, file: !68, line: 326, baseType: !57, size: 64, offset: 1088)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !69, file: !68, line: 330, baseType: !56, size: 32, offset: 5056)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !69, file: !68, line: 331, baseType: !56, size: 32, offset: 5088)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !69, file: !68, line: 332, baseType: !56, size: 32, offset: 5120)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !69, file: !68, line: 334, baseType: !56, size: 32, offset: 5152)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !69, file: !68, line: 335, baseType: !56, size: 32, offset: 5184)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !69, file: !68, line: 336, baseType: !223, size: 32, offset: 5216)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !43, line: 26, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !40, line: 42, baseType: !7)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !69, file: !68, line: 337, baseType: !223, size: 32, offset: 5248)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !69, file: !68, line: 338, baseType: !223, size: 32, offset: 5280)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !69, file: !68, line: 339, baseType: !223, size: 32, offset: 5312)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !69, file: !68, line: 340, baseType: !56, size: 32, offset: 5344)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !69, file: !68, line: 344, baseType: !56, size: 32, offset: 5376)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !69, file: !68, line: 356, baseType: !56, size: 32, offset: 5408)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !69, file: !68, line: 364, baseType: !56, size: 32, offset: 5440)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !69, file: !68, line: 367, baseType: !56, size: 32, offset: 5472)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !69, file: !68, line: 368, baseType: !56, size: 32, offset: 5504)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !69, file: !68, line: 369, baseType: !56, size: 32, offset: 5536)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !69, file: !68, line: 375, baseType: !236, size: 64, offset: 5568)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{null, !35}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "write_headers", scope: !50, file: !49, line: 31, baseType: !240, size: 64, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{!56, !60, !243}
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !68, line: 604, baseType: !245)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !68, line: 593, size: 192, elements: !246)
!246 = !{!247, !248, !249, !250}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !245, file: !68, line: 595, baseType: !56, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !245, file: !68, line: 596, baseType: !56, size: 32, offset: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !245, file: !68, line: 599, baseType: !56, size: 32, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !245, file: !68, line: 603, baseType: !251, size: 64, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "write_frame", scope: !50, file: !49, line: 32, baseType: !253, size: 64, offset: 192)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{!56, !60, !251, !56, !256}
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_picture_t", file: !68, line: 549, baseType: !258)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !68, line: 513, size: 1088, elements: !259)
!259 = !{!260, !261, !262, !263, !264, !265, !266, !267, !279, !287}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !258, file: !68, line: 521, baseType: !56, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !258, file: !68, line: 523, baseType: !56, size: 32, offset: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_struct", scope: !258, file: !68, line: 526, baseType: !56, size: 32, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "b_keyframe", scope: !258, file: !68, line: 529, baseType: !56, size: 32, offset: 96)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !258, file: !68, line: 531, baseType: !37, size: 64, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts", scope: !258, file: !68, line: 534, baseType: !37, size: 64, offset: 192)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !258, file: !68, line: 541, baseType: !66, size: 64, offset: 256)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "img", scope: !258, file: !68, line: 543, baseType: !268, size: 448, offset: 320)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_image_t", file: !68, line: 511, baseType: !269)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !68, line: 505, size: 448, elements: !270)
!270 = !{!271, !272, !273, !277}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !269, file: !68, line: 507, baseType: !56, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !269, file: !68, line: 508, baseType: !56, size: 32, offset: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !269, file: !68, line: 509, baseType: !274, size: 128, offset: 64)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 128, elements: !275)
!275 = !{!276}
!276 = !DISubrange(count: 4)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !269, file: !68, line: 510, baseType: !278, size: 256, offset: 192)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 256, elements: !275)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "hrd_timing", scope: !258, file: !68, line: 545, baseType: !280, size: 256, offset: 768)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_hrd_t", file: !68, line: 503, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !68, line: 496, size: 256, elements: !282)
!282 = !{!283, !284, !285, !286}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_initial_arrival_time", scope: !281, file: !68, line: 498, baseType: !36, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_final_arrival_time", scope: !281, file: !68, line: 499, baseType: !36, size: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_time", scope: !281, file: !68, line: 500, baseType: !36, size: 64, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_time", scope: !281, file: !68, line: 502, baseType: !36, size: 64, offset: 192)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !258, file: !68, line: 548, baseType: !35, size: 64, offset: 1024)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "close_file", scope: !50, file: !49, line: 33, baseType: !289, size: 64, offset: 256)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DISubroutineType(types: !291)
!291 = !{!56, !60, !37, !37}
!292 = !{i32 7, !"Dwarf Version", i32 4}
!293 = !{i32 2, !"Debug Info Version", i32 3}
!294 = !{i32 1, !"wchar_size", i32 4}
!295 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!296 = distinct !DISubprogram(name: "open_file", scope: !3, file: !3, line: 68, type: !54, scopeLine: 69, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !297)
!297 = !{}
!298 = !DILocalVariable(name: "psz_filename", arg: 1, scope: !296, file: !3, line: 68, type: !57)
!299 = !DILocation(line: 68, column: 29, scope: !296)
!300 = !DILocalVariable(name: "p_handle", arg: 2, scope: !296, file: !3, line: 68, type: !59)
!301 = !DILocation(line: 68, column: 50, scope: !296)
!302 = !DILocalVariable(name: "p_flv", scope: !296, file: !3, line: 70, type: !303)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "flv_hnd_t", file: !3, line: 55, baseType: !305)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 30, size: 960, elements: !306)
!306 = !{!307, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !305, file: !3, line: 32, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "flv_buffer", file: !6, line: 116, baseType: !310)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "flv_buffer", file: !6, line: 109, size: 256, elements: !311)
!311 = !{!312, !313, !314, !315, !372}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !310, file: !6, line: 111, baseType: !251, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "d_cur", scope: !310, file: !6, line: 112, baseType: !7, size: 32, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "d_max", scope: !310, file: !6, line: 113, baseType: !7, size: 32, offset: 96)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !310, file: !6, line: 114, baseType: !316, size: 64, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !318, line: 7, baseType: !319)
!318 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !320, line: 49, size: 1728, elements: !321)
!320 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!321 = !{!322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !337, !339, !340, !341, !343, !345, !347, !351, !354, !356, !359, !362, !363, !364, !367, !368}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !319, file: !320, line: 51, baseType: !56, size: 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !319, file: !320, line: 54, baseType: !57, size: 64, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !319, file: !320, line: 55, baseType: !57, size: 64, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !319, file: !320, line: 56, baseType: !57, size: 64, offset: 192)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !319, file: !320, line: 57, baseType: !57, size: 64, offset: 256)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !319, file: !320, line: 58, baseType: !57, size: 64, offset: 320)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !319, file: !320, line: 59, baseType: !57, size: 64, offset: 384)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !319, file: !320, line: 60, baseType: !57, size: 64, offset: 448)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !319, file: !320, line: 61, baseType: !57, size: 64, offset: 512)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !319, file: !320, line: 64, baseType: !57, size: 64, offset: 576)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !319, file: !320, line: 65, baseType: !57, size: 64, offset: 640)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !319, file: !320, line: 66, baseType: !57, size: 64, offset: 704)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !319, file: !320, line: 68, baseType: !335, size: 64, offset: 768)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !320, line: 36, flags: DIFlagFwdDecl)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !319, file: !320, line: 70, baseType: !338, size: 64, offset: 832)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !319, file: !320, line: 72, baseType: !56, size: 32, offset: 896)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !319, file: !320, line: 73, baseType: !56, size: 32, offset: 928)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !319, file: !320, line: 74, baseType: !342, size: 64, offset: 960)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !40, line: 152, baseType: !41)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !319, file: !320, line: 77, baseType: !344, size: 16, offset: 1024)
!344 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !319, file: !320, line: 78, baseType: !346, size: 8, offset: 1040)
!346 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !319, file: !320, line: 79, baseType: !348, size: 8, offset: 1048)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 8, elements: !349)
!349 = !{!350}
!350 = !DISubrange(count: 1)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !319, file: !320, line: 81, baseType: !352, size: 64, offset: 1088)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !320, line: 43, baseType: null)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !319, file: !320, line: 89, baseType: !355, size: 64, offset: 1152)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !40, line: 153, baseType: !41)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !319, file: !320, line: 91, baseType: !357, size: 64, offset: 1216)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !320, line: 37, flags: DIFlagFwdDecl)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !319, file: !320, line: 92, baseType: !360, size: 64, offset: 1280)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !320, line: 38, flags: DIFlagFwdDecl)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !319, file: !320, line: 93, baseType: !338, size: 64, offset: 1344)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !319, file: !320, line: 94, baseType: !35, size: 64, offset: 1408)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !319, file: !320, line: 95, baseType: !365, size: 64, offset: 1472)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !366, line: 46, baseType: !45)
!366 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !319, file: !320, line: 96, baseType: !56, size: 32, offset: 1536)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !319, file: !320, line: 98, baseType: !369, size: 160, offset: 1568)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 160, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 20)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "d_total", scope: !310, file: !6, line: 115, baseType: !42, size: 64, offset: 192)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "sei", scope: !305, file: !3, line: 34, baseType: !251, size: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "sei_len", scope: !305, file: !3, line: 35, baseType: !56, size: 32, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !305, file: !3, line: 37, baseType: !37, size: 64, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !305, file: !3, line: 38, baseType: !37, size: 64, offset: 256)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "i_framenum", scope: !305, file: !3, line: 39, baseType: !37, size: 64, offset: 320)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "i_framerate_pos", scope: !305, file: !3, line: 41, baseType: !42, size: 64, offset: 384)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "i_duration_pos", scope: !305, file: !3, line: 42, baseType: !42, size: 64, offset: 448)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "i_filesize_pos", scope: !305, file: !3, line: 43, baseType: !42, size: 64, offset: 512)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate_pos", scope: !305, file: !3, line: 44, baseType: !42, size: 64, offset: 576)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "b_write_length", scope: !305, file: !3, line: 46, baseType: !114, size: 8, offset: 640)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_dts", scope: !305, file: !3, line: 47, baseType: !37, size: 64, offset: 704)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_pts", scope: !305, file: !3, line: 48, baseType: !37, size: 64, offset: 768)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !305, file: !3, line: 50, baseType: !223, size: 32, offset: 832)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !305, file: !3, line: 51, baseType: !223, size: 32, offset: 864)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !305, file: !3, line: 52, baseType: !56, size: 32, offset: 896)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !305, file: !3, line: 54, baseType: !7, size: 32, offset: 928)
!389 = !DILocation(line: 70, column: 16, scope: !296)
!390 = !DILocation(line: 70, column: 24, scope: !296)
!391 = !DILocation(line: 71, column: 6, scope: !296)
!392 = !DILocation(line: 71, column: 15, scope: !296)
!393 = !DILocation(line: 72, column: 10, scope: !394)
!394 = distinct !DILexicalBlock(scope: !296, file: !3, line: 72, column: 9)
!395 = !DILocation(line: 72, column: 9, scope: !296)
!396 = !DILocation(line: 73, column: 9, scope: !394)
!397 = !DILocation(line: 74, column: 13, scope: !296)
!398 = !DILocation(line: 74, column: 5, scope: !296)
!399 = !DILocation(line: 76, column: 35, scope: !296)
!400 = !DILocation(line: 76, column: 16, scope: !296)
!401 = !DILocation(line: 76, column: 5, scope: !296)
!402 = !DILocation(line: 76, column: 12, scope: !296)
!403 = !DILocation(line: 76, column: 14, scope: !296)
!404 = !DILocation(line: 77, column: 10, scope: !405)
!405 = distinct !DILexicalBlock(scope: !296, file: !3, line: 77, column: 9)
!406 = !DILocation(line: 77, column: 17, scope: !405)
!407 = !DILocation(line: 77, column: 9, scope: !296)
!408 = !DILocation(line: 78, column: 9, scope: !405)
!409 = !DILocation(line: 80, column: 5, scope: !296)
!410 = !DILocation(line: 80, column: 5, scope: !411)
!411 = distinct !DILexicalBlock(scope: !412, file: !3, line: 80, column: 5)
!412 = distinct !DILexicalBlock(scope: !296, file: !3, line: 80, column: 5)
!413 = !DILocation(line: 80, column: 5, scope: !412)
!414 = !DILocation(line: 81, column: 17, scope: !296)
!415 = !DILocation(line: 81, column: 6, scope: !296)
!416 = !DILocation(line: 81, column: 15, scope: !296)
!417 = !DILocation(line: 83, column: 5, scope: !296)
!418 = !DILocation(line: 84, column: 1, scope: !296)
!419 = distinct !DISubprogram(name: "set_param", scope: !3, file: !3, line: 86, type: !64, scopeLine: 87, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !297)
!420 = !DILocalVariable(name: "handle", arg: 1, scope: !419, file: !3, line: 86, type: !60)
!421 = !DILocation(line: 86, column: 29, scope: !419)
!422 = !DILocalVariable(name: "p_param", arg: 2, scope: !419, file: !3, line: 86, type: !66)
!423 = !DILocation(line: 86, column: 51, scope: !419)
!424 = !DILocalVariable(name: "p_flv", scope: !419, file: !3, line: 88, type: !303)
!425 = !DILocation(line: 88, column: 16, scope: !419)
!426 = !DILocation(line: 88, column: 24, scope: !419)
!427 = !DILocalVariable(name: "c", scope: !419, file: !3, line: 89, type: !308)
!428 = !DILocation(line: 89, column: 17, scope: !419)
!429 = !DILocation(line: 89, column: 21, scope: !419)
!430 = !DILocation(line: 89, column: 28, scope: !419)
!431 = !DILocation(line: 91, column: 20, scope: !419)
!432 = !DILocation(line: 91, column: 5, scope: !419)
!433 = !DILocalVariable(name: "start", scope: !419, file: !3, line: 93, type: !56)
!434 = !DILocation(line: 93, column: 9, scope: !419)
!435 = !DILocation(line: 93, column: 17, scope: !419)
!436 = !DILocation(line: 93, column: 20, scope: !419)
!437 = !DILocation(line: 94, column: 20, scope: !419)
!438 = !DILocation(line: 94, column: 5, scope: !419)
!439 = !DILocation(line: 95, column: 20, scope: !419)
!440 = !DILocation(line: 95, column: 5, scope: !419)
!441 = !DILocation(line: 96, column: 20, scope: !419)
!442 = !DILocation(line: 96, column: 5, scope: !419)
!443 = !DILocation(line: 98, column: 20, scope: !419)
!444 = !DILocation(line: 98, column: 5, scope: !419)
!445 = !DILocation(line: 99, column: 26, scope: !419)
!446 = !DILocation(line: 99, column: 5, scope: !419)
!447 = !DILocation(line: 101, column: 20, scope: !419)
!448 = !DILocation(line: 101, column: 5, scope: !419)
!449 = !DILocation(line: 102, column: 20, scope: !419)
!450 = !DILocation(line: 102, column: 5, scope: !419)
!451 = !DILocation(line: 104, column: 26, scope: !419)
!452 = !DILocation(line: 104, column: 5, scope: !419)
