; ModuleID = 'x264_src/encoder/me.c'
source_filename = "x264_src/encoder/me.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.anon.15 = type { i32, i32 }
%struct.x264_weight_t = type { [8 x i16], [8 x i16], i32, i32, i32, void (i8*, i32, i8*, i32, %struct.x264_weight_t*, i32)**, [8 x i8] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "x264_pixel_size", scope: !2, file: !6, line: 47, type: !1447, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !19, globals: !80, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "x264_src/encoder/me.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 30, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "x264_src/common/pixel.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!9 = !DIEnumerator(name: "PIXEL_16x16", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "PIXEL_16x8", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "PIXEL_8x16", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "PIXEL_8x8", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "PIXEL_8x4", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "PIXEL_4x8", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "PIXEL_4x4", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "PIXEL_4x2", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "PIXEL_2x4", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "PIXEL_2x2", value: 9, isUnsigned: true)
!19 = !{!20, !44, !57, !73, !62}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_union32_t", file: !22, line: 89, baseType: !23)
!22 = !DIFile(filename: "x264_src/common/common.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!23 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !22, line: 89, size: 32, elements: !24)
!24 = !{!25, !30, !37}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !23, file: !22, line: 89, baseType: !26, size: 32)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !27, line: 26, baseType: !28)
!27 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !29, line: 42, baseType: !7)
!29 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!30 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !23, file: !22, line: 89, baseType: !31, size: 32)
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 32, elements: !35)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !27, line: 25, baseType: !33)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !29, line: 40, baseType: !34)
!34 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!35 = !{!36}
!36 = !DISubrange(count: 2)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !23, file: !22, line: 89, baseType: !38, size: 32)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 32, elements: !42)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !27, line: 24, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !29, line: 38, baseType: !41)
!41 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!42 = !{!43}
!43 = !DISubrange(count: 4)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "mvsad_t", file: !46, line: 58, baseType: !47)
!46 = !DIFile(filename: "x264_src/encoder/me.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !46, line: 55, size: 64, elements: !48)
!48 = !{!49, !51}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "sad", scope: !47, file: !46, line: 56, baseType: !50, size: 32)
!50 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !47, file: !46, line: 57, baseType: !52, size: 32, offset: 32)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 32, elements: !35)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !54, line: 25, baseType: !55)
!54 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !29, line: 39, baseType: !56)
!56 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_union64_t", file: !22, line: 90, baseType: !59)
!59 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !22, line: 90, size: 64, elements: !60)
!60 = !{!61, !65, !67, !69}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !59, file: !22, line: 90, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !27, line: 27, baseType: !63)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !29, line: 45, baseType: !64)
!64 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !59, file: !22, line: 90, baseType: !66, size: 64)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 64, elements: !35)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !59, file: !22, line: 90, baseType: !68, size: 64)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 64, elements: !42)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !59, file: !22, line: 90, baseType: !70, size: 64)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 64, elements: !71)
!71 = !{!72}
!72 = !DISubrange(count: 8)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_union16_t", file: !22, line: 88, baseType: !75)
!75 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !22, line: 88, size: 16, elements: !76)
!76 = !{!77, !78}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !75, file: !22, line: 88, baseType: !32, size: 16)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !75, file: !22, line: 88, baseType: !79, size: 16)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 16, elements: !35)
!80 = !{!81, !1393, !1396, !1401, !1406, !0, !1408, !1411, !1414, !1418, !1423, !1431, !1437, !1442, !1445}
!81 = !DIGlobalVariableExpression(var: !82, expr: !DIExpression())
!82 = distinct !DIGlobalVariable(name: "x264_pixel_size_shift", scope: !83, file: !3, line: 380, type: !1392, isLocal: true, isDefinition: true)
!83 = distinct !DISubprogram(name: "x264_me_search_ref", scope: !3, file: !3, line: 173, type: !84, scopeLine: 174, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !1391)
!84 = !DISubroutineType(types: !85)
!85 = !{null, !86, !1372, !626, !50, !638}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_t", file: !88, line: 46, baseType: !89)
!88 = !DIFile(filename: "x264_src/x264.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_t", file: !22, line: 381, size: 266752, elements: !90)
!90 = !{!91, !259, !263, !264, !265, !266, !267, !268, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !404, !406, !434, !436, !437, !438, !442, !446, !447, !448, !452, !456, !457, !458, !463, !466, !467, !540, !557, !717, !718, !719, !720, !724, !725, !726, !727, !728, !729, !730, !745, !938, !942, !1003, !1006, !1008, !1009, !1010, !1013, !1018, !1027, !1028, !1036, !1038, !1043, !1118, !1204, !1248, !1270, !1319, !1348}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !89, file: !22, line: 384, baseType: !92, size: 5632)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !88, line: 376, baseType: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !88, line: 176, size: 5632, elements: !94)
!94 = !{!95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !138, !142, !143, !144, !145, !149, !150, !164, !165, !166, !167, !168, !197, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !93, file: !88, line: 179, baseType: !7, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !93, file: !88, line: 180, baseType: !50, size: 32, offset: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !93, file: !88, line: 181, baseType: !50, size: 32, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !93, file: !88, line: 182, baseType: !50, size: 32, offset: 96)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !93, file: !88, line: 183, baseType: !50, size: 32, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !93, file: !88, line: 186, baseType: !50, size: 32, offset: 160)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !93, file: !88, line: 187, baseType: !50, size: 32, offset: 192)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !93, file: !88, line: 188, baseType: !50, size: 32, offset: 224)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !93, file: !88, line: 189, baseType: !50, size: 32, offset: 256)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !93, file: !88, line: 190, baseType: !50, size: 32, offset: 288)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !93, file: !88, line: 198, baseType: !50, size: 32, offset: 320)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !93, file: !88, line: 215, baseType: !107, size: 288, offset: 352)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !93, file: !88, line: 200, size: 288, elements: !108)
!108 = !{!109, !110, !111, !112, !113, !114, !115, !116, !117}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !107, file: !88, line: 203, baseType: !50, size: 32)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !107, file: !88, line: 204, baseType: !50, size: 32, offset: 32)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !107, file: !88, line: 206, baseType: !50, size: 32, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !107, file: !88, line: 209, baseType: !50, size: 32, offset: 96)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !107, file: !88, line: 210, baseType: !50, size: 32, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !107, file: !88, line: 211, baseType: !50, size: 32, offset: 160)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !107, file: !88, line: 212, baseType: !50, size: 32, offset: 192)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !107, file: !88, line: 213, baseType: !50, size: 32, offset: 224)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !107, file: !88, line: 214, baseType: !50, size: 32, offset: 256)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !93, file: !88, line: 218, baseType: !50, size: 32, offset: 640)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !93, file: !88, line: 219, baseType: !50, size: 32, offset: 672)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !93, file: !88, line: 220, baseType: !50, size: 32, offset: 704)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !93, file: !88, line: 221, baseType: !50, size: 32, offset: 736)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !93, file: !88, line: 222, baseType: !50, size: 32, offset: 768)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !93, file: !88, line: 224, baseType: !50, size: 32, offset: 800)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !93, file: !88, line: 225, baseType: !50, size: 32, offset: 832)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !93, file: !88, line: 226, baseType: !50, size: 32, offset: 864)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !93, file: !88, line: 227, baseType: !50, size: 32, offset: 896)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !93, file: !88, line: 229, baseType: !50, size: 32, offset: 928)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !93, file: !88, line: 230, baseType: !50, size: 32, offset: 960)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !93, file: !88, line: 231, baseType: !50, size: 32, offset: 992)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !93, file: !88, line: 233, baseType: !50, size: 32, offset: 1024)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !93, file: !88, line: 234, baseType: !50, size: 32, offset: 1056)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !93, file: !88, line: 236, baseType: !50, size: 32, offset: 1088)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !93, file: !88, line: 237, baseType: !50, size: 32, offset: 1120)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !93, file: !88, line: 239, baseType: !50, size: 32, offset: 1152)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !93, file: !88, line: 240, baseType: !136, size: 64, offset: 1216)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !93, file: !88, line: 241, baseType: !139, size: 128, offset: 1280)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 128, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 16)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !93, file: !88, line: 242, baseType: !139, size: 128, offset: 1408)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !93, file: !88, line: 243, baseType: !139, size: 128, offset: 1536)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !93, file: !88, line: 244, baseType: !139, size: 128, offset: 1664)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !93, file: !88, line: 245, baseType: !146, size: 512, offset: 1792)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 512, elements: !147)
!147 = !{!148}
!148 = !DISubrange(count: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !93, file: !88, line: 246, baseType: !146, size: 512, offset: 2304)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !93, file: !88, line: 249, baseType: !151, size: 64, offset: 2816)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{null, !154, !50, !155, !157}
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !137)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, size: 192, elements: !159)
!159 = !{!160, !161, !162, !163}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !158, file: !3, baseType: !7, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !158, file: !3, baseType: !7, size: 32, offset: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !158, file: !3, baseType: !154, size: 64, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !158, file: !3, baseType: !154, size: 64, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !93, file: !88, line: 250, baseType: !154, size: 64, offset: 2880)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !93, file: !88, line: 251, baseType: !50, size: 32, offset: 2944)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !93, file: !88, line: 252, baseType: !50, size: 32, offset: 2976)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !93, file: !88, line: 253, baseType: !136, size: 64, offset: 3008)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !93, file: !88, line: 287, baseType: !169, size: 800, offset: 3072)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !93, file: !88, line: 256, size: 800, elements: !170)
!170 = !{!171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !191, !192, !193, !195, !196}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !169, file: !88, line: 258, baseType: !7, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !169, file: !88, line: 259, baseType: !7, size: 32, offset: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !169, file: !88, line: 261, baseType: !50, size: 32, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !169, file: !88, line: 262, baseType: !50, size: 32, offset: 96)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !169, file: !88, line: 263, baseType: !50, size: 32, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !169, file: !88, line: 264, baseType: !50, size: 32, offset: 160)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !169, file: !88, line: 265, baseType: !50, size: 32, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !169, file: !88, line: 267, baseType: !50, size: 32, offset: 224)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !169, file: !88, line: 268, baseType: !50, size: 32, offset: 256)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !169, file: !88, line: 269, baseType: !50, size: 32, offset: 288)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !169, file: !88, line: 270, baseType: !50, size: 32, offset: 320)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !169, file: !88, line: 271, baseType: !50, size: 32, offset: 352)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !169, file: !88, line: 272, baseType: !50, size: 32, offset: 384)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !169, file: !88, line: 273, baseType: !50, size: 32, offset: 416)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !169, file: !88, line: 274, baseType: !50, size: 32, offset: 448)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !169, file: !88, line: 275, baseType: !50, size: 32, offset: 480)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !169, file: !88, line: 276, baseType: !50, size: 32, offset: 512)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !169, file: !88, line: 277, baseType: !50, size: 32, offset: 544)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !169, file: !88, line: 278, baseType: !190, size: 32, offset: 576)
!190 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !169, file: !88, line: 279, baseType: !190, size: 32, offset: 608)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !169, file: !88, line: 280, baseType: !50, size: 32, offset: 640)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !169, file: !88, line: 283, baseType: !194, size: 64, offset: 672)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 64, elements: !35)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !169, file: !88, line: 285, baseType: !50, size: 32, offset: 736)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !169, file: !88, line: 286, baseType: !50, size: 32, offset: 768)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !93, file: !88, line: 327, baseType: !198, size: 1152, offset: 3904)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !93, file: !88, line: 290, size: 1152, elements: !199)
!199 = !{!200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !237, !238}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !198, file: !88, line: 292, baseType: !50, size: 32)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !198, file: !88, line: 294, baseType: !50, size: 32, offset: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !198, file: !88, line: 295, baseType: !50, size: 32, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !198, file: !88, line: 296, baseType: !50, size: 32, offset: 96)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !198, file: !88, line: 297, baseType: !50, size: 32, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !198, file: !88, line: 299, baseType: !50, size: 32, offset: 160)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !198, file: !88, line: 300, baseType: !190, size: 32, offset: 192)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !198, file: !88, line: 301, baseType: !190, size: 32, offset: 224)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !198, file: !88, line: 302, baseType: !190, size: 32, offset: 256)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !198, file: !88, line: 303, baseType: !50, size: 32, offset: 288)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !198, file: !88, line: 304, baseType: !50, size: 32, offset: 320)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !198, file: !88, line: 305, baseType: !190, size: 32, offset: 352)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !198, file: !88, line: 306, baseType: !190, size: 32, offset: 384)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !198, file: !88, line: 307, baseType: !190, size: 32, offset: 416)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !198, file: !88, line: 309, baseType: !50, size: 32, offset: 448)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !198, file: !88, line: 310, baseType: !190, size: 32, offset: 480)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !198, file: !88, line: 311, baseType: !50, size: 32, offset: 512)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !198, file: !88, line: 312, baseType: !50, size: 32, offset: 544)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !198, file: !88, line: 315, baseType: !50, size: 32, offset: 576)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !198, file: !88, line: 316, baseType: !136, size: 64, offset: 640)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !198, file: !88, line: 317, baseType: !50, size: 32, offset: 704)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !198, file: !88, line: 318, baseType: !136, size: 64, offset: 768)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !198, file: !88, line: 321, baseType: !190, size: 32, offset: 832)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !198, file: !88, line: 322, baseType: !190, size: 32, offset: 864)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !198, file: !88, line: 323, baseType: !190, size: 32, offset: 896)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !198, file: !88, line: 324, baseType: !226, size: 64, offset: 960)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !88, line: 174, baseType: !228)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !88, line: 167, size: 256, elements: !229)
!229 = !{!230, !231, !232, !233, !234, !235}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !228, file: !88, line: 169, baseType: !50, size: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !228, file: !88, line: 169, baseType: !50, size: 32, offset: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !228, file: !88, line: 170, baseType: !50, size: 32, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !228, file: !88, line: 171, baseType: !50, size: 32, offset: 96)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !228, file: !88, line: 172, baseType: !190, size: 32, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !228, file: !88, line: 173, baseType: !236, size: 64, offset: 192)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !198, file: !88, line: 325, baseType: !50, size: 32, offset: 1024)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !198, file: !88, line: 326, baseType: !136, size: 64, offset: 1088)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !93, file: !88, line: 330, baseType: !50, size: 32, offset: 5056)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !93, file: !88, line: 331, baseType: !50, size: 32, offset: 5088)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !93, file: !88, line: 332, baseType: !50, size: 32, offset: 5120)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !93, file: !88, line: 334, baseType: !50, size: 32, offset: 5152)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !93, file: !88, line: 335, baseType: !50, size: 32, offset: 5184)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !93, file: !88, line: 336, baseType: !26, size: 32, offset: 5216)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !93, file: !88, line: 337, baseType: !26, size: 32, offset: 5248)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !93, file: !88, line: 338, baseType: !26, size: 32, offset: 5280)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !93, file: !88, line: 339, baseType: !26, size: 32, offset: 5312)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !93, file: !88, line: 340, baseType: !50, size: 32, offset: 5344)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !93, file: !88, line: 344, baseType: !50, size: 32, offset: 5376)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !93, file: !88, line: 356, baseType: !50, size: 32, offset: 5408)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !93, file: !88, line: 364, baseType: !50, size: 32, offset: 5440)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !93, file: !88, line: 367, baseType: !50, size: 32, offset: 5472)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !93, file: !88, line: 368, baseType: !50, size: 32, offset: 5504)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !93, file: !88, line: 369, baseType: !50, size: 32, offset: 5536)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !93, file: !88, line: 375, baseType: !256, size: 64, offset: 5568)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DISubroutineType(types: !258)
!258 = !{null, !154}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !89, file: !22, line: 386, baseType: !260, size: 8256, offset: 5632)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 8256, elements: !261)
!261 = !{!262}
!262 = !DISubrange(count: 129)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "thread_handle", scope: !89, file: !22, line: 387, baseType: !50, size: 32, offset: 13888)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "b_thread_active", scope: !89, file: !22, line: 388, baseType: !50, size: 32, offset: 13920)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_phase", scope: !89, file: !22, line: 389, baseType: !50, size: 32, offset: 13952)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_start", scope: !89, file: !22, line: 390, baseType: !50, size: 32, offset: 13984)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_end", scope: !89, file: !22, line: 391, baseType: !50, size: 32, offset: 14016)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !89, file: !22, line: 402, baseType: !269, size: 576, offset: 14080)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !89, file: !22, line: 394, size: 576, elements: !270)
!270 = !{!271, !272, !273, !283, !284, !285}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal", scope: !269, file: !22, line: 396, baseType: !50, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "i_nals_allocated", scope: !269, file: !22, line: 397, baseType: !50, size: 32, offset: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "nal", scope: !269, file: !22, line: 398, baseType: !274, size: 64, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !88, line: 604, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !88, line: 593, size: 192, elements: !277)
!277 = !{!278, !279, !280, !281}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !276, file: !88, line: 595, baseType: !50, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !276, file: !88, line: 596, baseType: !50, size: 32, offset: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !276, file: !88, line: 599, baseType: !50, size: 32, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !276, file: !88, line: 603, baseType: !282, size: 64, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitstream", scope: !269, file: !22, line: 399, baseType: !50, size: 32, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "p_bitstream", scope: !269, file: !22, line: 400, baseType: !282, size: 64, offset: 192)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !269, file: !22, line: 401, baseType: !286, size: 320, offset: 256)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "bs_t", file: !287, line: 56, baseType: !288)
!287 = !DIFile(filename: "x264_src/common/bs.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bs_s", file: !287, line: 47, size: 320, elements: !289)
!289 = !{!290, !291, !292, !293, !297, !298}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !288, file: !287, line: 49, baseType: !282, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !288, file: !287, line: 50, baseType: !282, size: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !288, file: !287, line: 51, baseType: !282, size: 64, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "cur_bits", scope: !288, file: !287, line: 53, baseType: !294, size: 64, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !295, line: 87, baseType: !296)
!295 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!296 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !288, file: !287, line: 54, baseType: !50, size: 32, offset: 256)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "i_bits_encoded", scope: !288, file: !287, line: 55, baseType: !50, size: 32, offset: 288)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer", scope: !89, file: !22, line: 404, baseType: !282, size: 64, offset: 14656)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer_size", scope: !89, file: !22, line: 405, baseType: !50, size: 32, offset: 14720)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !89, file: !22, line: 410, baseType: !50, size: 32, offset: 14752)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !89, file: !22, line: 411, baseType: !50, size: 32, offset: 14784)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_frames", scope: !89, file: !22, line: 413, baseType: !50, size: 32, offset: 14816)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_type", scope: !89, file: !22, line: 415, baseType: !50, size: 32, offset: 14848)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_ref_idc", scope: !89, file: !22, line: 416, baseType: !50, size: 32, offset: 14880)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields", scope: !89, file: !22, line: 418, baseType: !50, size: 32, offset: 14912)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields_last_frame", scope: !89, file: !22, line: 419, baseType: !50, size: 32, offset: 14944)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_duration", scope: !89, file: !22, line: 420, baseType: !50, size: 32, offset: 14976)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields", scope: !89, file: !22, line: 421, baseType: !50, size: 32, offset: 15008)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !89, file: !22, line: 422, baseType: !50, size: 32, offset: 15040)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !89, file: !22, line: 424, baseType: !50, size: 32, offset: 15072)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !89, file: !22, line: 425, baseType: !50, size: 32, offset: 15104)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "b_queued_intra_refresh", scope: !89, file: !22, line: 427, baseType: !50, size: 32, offset: 15136)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "sps_array", scope: !89, file: !22, line: 430, baseType: !315, size: 10400, offset: 15168)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !316, size: 10400, elements: !402)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_sps_t", file: !317, line: 154, baseType: !318)
!317 = !DIFile(filename: "x264_src/common/set.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !317, line: 52, size: 10400, elements: !319)
!319 = !{!320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !337, !338, !339, !340, !341, !342, !343, !344, !345, !352, !353, !401}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !318, file: !317, line: 54, baseType: !50, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "i_profile_idc", scope: !318, file: !317, line: 56, baseType: !50, size: 32, offset: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !318, file: !317, line: 57, baseType: !50, size: 32, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set0", scope: !318, file: !317, line: 59, baseType: !50, size: 32, offset: 96)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set1", scope: !318, file: !317, line: 60, baseType: !50, size: 32, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set2", scope: !318, file: !317, line: 61, baseType: !50, size: 32, offset: 160)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_frame_num", scope: !318, file: !317, line: 63, baseType: !50, size: 32, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_type", scope: !318, file: !317, line: 65, baseType: !50, size: 32, offset: 224)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_poc_lsb", scope: !318, file: !317, line: 67, baseType: !50, size: 32, offset: 256)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "b_delta_pic_order_always_zero", scope: !318, file: !317, line: 69, baseType: !50, size: 32, offset: 288)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_non_ref_pic", scope: !318, file: !317, line: 70, baseType: !50, size: 32, offset: 320)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_top_to_bottom_field", scope: !318, file: !317, line: 71, baseType: !50, size: 32, offset: 352)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames_in_poc_cycle", scope: !318, file: !317, line: 72, baseType: !50, size: 32, offset: 384)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_ref_frame", scope: !318, file: !317, line: 73, baseType: !334, size: 8192, offset: 416)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 8192, elements: !335)
!335 = !{!336}
!336 = !DISubrange(count: 256)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames", scope: !318, file: !317, line: 75, baseType: !50, size: 32, offset: 8608)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "b_gaps_in_frame_num_value_allowed", scope: !318, file: !317, line: 76, baseType: !50, size: 32, offset: 8640)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_width", scope: !318, file: !317, line: 77, baseType: !50, size: 32, offset: 8672)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_height", scope: !318, file: !317, line: 78, baseType: !50, size: 32, offset: 8704)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_mbs_only", scope: !318, file: !317, line: 79, baseType: !50, size: 32, offset: 8736)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_adaptive_frame_field", scope: !318, file: !317, line: 80, baseType: !50, size: 32, offset: 8768)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct8x8_inference", scope: !318, file: !317, line: 81, baseType: !50, size: 32, offset: 8800)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "b_crop", scope: !318, file: !317, line: 83, baseType: !50, size: 32, offset: 8832)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !318, file: !317, line: 90, baseType: !346, size: 128, offset: 8864)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !318, file: !317, line: 84, size: 128, elements: !347)
!347 = !{!348, !349, !350, !351}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !346, file: !317, line: 86, baseType: !50, size: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "i_right", scope: !346, file: !317, line: 87, baseType: !50, size: 32, offset: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "i_top", scope: !346, file: !317, line: 88, baseType: !50, size: 32, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "i_bottom", scope: !346, file: !317, line: 89, baseType: !50, size: 32, offset: 96)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "b_vui", scope: !318, file: !317, line: 92, baseType: !50, size: 32, offset: 8992)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !318, file: !317, line: 150, baseType: !354, size: 1344, offset: 9024)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !318, file: !317, line: 93, size: 1344, elements: !355)
!355 = !{!356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !392, !393, !394, !395, !396, !397, !398, !399, !400}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "b_aspect_ratio_info_present", scope: !354, file: !317, line: 95, baseType: !50, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !354, file: !317, line: 96, baseType: !50, size: 32, offset: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !354, file: !317, line: 97, baseType: !50, size: 32, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info_present", scope: !354, file: !317, line: 99, baseType: !50, size: 32, offset: 96)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info", scope: !354, file: !317, line: 100, baseType: !50, size: 32, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "b_signal_type_present", scope: !354, file: !317, line: 102, baseType: !50, size: 32, offset: 160)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !354, file: !317, line: 103, baseType: !50, size: 32, offset: 192)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !354, file: !317, line: 104, baseType: !50, size: 32, offset: 224)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "b_color_description_present", scope: !354, file: !317, line: 105, baseType: !50, size: 32, offset: 256)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !354, file: !317, line: 106, baseType: !50, size: 32, offset: 288)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !354, file: !317, line: 107, baseType: !50, size: 32, offset: 320)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !354, file: !317, line: 108, baseType: !50, size: 32, offset: 352)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_loc_info_present", scope: !354, file: !317, line: 110, baseType: !50, size: 32, offset: 384)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_top", scope: !354, file: !317, line: 111, baseType: !50, size: 32, offset: 416)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_bottom", scope: !354, file: !317, line: 112, baseType: !50, size: 32, offset: 448)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "b_timing_info_present", scope: !354, file: !317, line: 114, baseType: !50, size: 32, offset: 480)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_units_in_tick", scope: !354, file: !317, line: 115, baseType: !26, size: 32, offset: 512)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_scale", scope: !354, file: !317, line: 116, baseType: !26, size: 32, offset: 544)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "b_fixed_frame_rate", scope: !354, file: !317, line: 117, baseType: !50, size: 32, offset: 576)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "b_nal_hrd_parameters_present", scope: !354, file: !317, line: 119, baseType: !50, size: 32, offset: 608)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "b_vcl_hrd_parameters_present", scope: !354, file: !317, line: 120, baseType: !50, size: 32, offset: 640)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "hrd", scope: !354, file: !317, line: 137, baseType: !378, size: 384, offset: 672)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !354, file: !317, line: 122, size: 384, elements: !379)
!379 = !{!380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_cnt", scope: !378, file: !317, line: 124, baseType: !50, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_scale", scope: !378, file: !317, line: 125, baseType: !50, size: 32, offset: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_scale", scope: !378, file: !317, line: 126, baseType: !50, size: 32, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_value", scope: !378, file: !317, line: 127, baseType: !50, size: 32, offset: 96)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_value", scope: !378, file: !317, line: 128, baseType: !50, size: 32, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_unscaled", scope: !378, file: !317, line: 129, baseType: !50, size: 32, offset: 160)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_unscaled", scope: !378, file: !317, line: 130, baseType: !50, size: 32, offset: 192)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "b_cbr_hrd", scope: !378, file: !317, line: 131, baseType: !50, size: 32, offset: 224)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "i_initial_cpb_removal_delay_length", scope: !378, file: !317, line: 133, baseType: !50, size: 32, offset: 256)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_removal_delay_length", scope: !378, file: !317, line: 134, baseType: !50, size: 32, offset: 288)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay_length", scope: !378, file: !317, line: 135, baseType: !50, size: 32, offset: 320)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_offset_length", scope: !378, file: !317, line: 136, baseType: !50, size: 32, offset: 352)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct_present", scope: !354, file: !317, line: 139, baseType: !50, size: 32, offset: 1056)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "b_bitstream_restriction", scope: !354, file: !317, line: 140, baseType: !50, size: 32, offset: 1088)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "b_motion_vectors_over_pic_boundaries", scope: !354, file: !317, line: 141, baseType: !50, size: 32, offset: 1120)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bytes_per_pic_denom", scope: !354, file: !317, line: 142, baseType: !50, size: 32, offset: 1152)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bits_per_mb_denom", scope: !354, file: !317, line: 143, baseType: !50, size: 32, offset: 1184)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_horizontal", scope: !354, file: !317, line: 144, baseType: !50, size: 32, offset: 1216)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_vertical", scope: !354, file: !317, line: 145, baseType: !50, size: 32, offset: 1248)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_reorder_frames", scope: !354, file: !317, line: 146, baseType: !50, size: 32, offset: 1280)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dec_frame_buffering", scope: !354, file: !317, line: 147, baseType: !50, size: 32, offset: 1312)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "b_qpprime_y_zero_transform_bypass", scope: !318, file: !317, line: 152, baseType: !50, size: 32, offset: 10368)
!402 = !{!403}
!403 = !DISubrange(count: 1)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !89, file: !22, line: 431, baseType: !405, size: 64, offset: 25600)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "pps_array", scope: !89, file: !22, line: 432, baseType: !407, size: 960, offset: 25664)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !408, size: 960, elements: !402)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pps_t", file: !317, line: 186, baseType: !409)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !317, line: 156, size: 960, elements: !410)
!410 = !{!411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !409, file: !317, line: 158, baseType: !50, size: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !409, file: !317, line: 159, baseType: !50, size: 32, offset: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !409, file: !317, line: 161, baseType: !50, size: 32, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_order", scope: !409, file: !317, line: 163, baseType: !50, size: 32, offset: 96)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_slice_groups", scope: !409, file: !317, line: 164, baseType: !50, size: 32, offset: 128)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_default_active", scope: !409, file: !317, line: 166, baseType: !50, size: 32, offset: 160)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_default_active", scope: !409, file: !317, line: 167, baseType: !50, size: 32, offset: 192)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_pred", scope: !409, file: !317, line: 169, baseType: !50, size: 32, offset: 224)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !409, file: !317, line: 170, baseType: !50, size: 32, offset: 256)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qp", scope: !409, file: !317, line: 172, baseType: !50, size: 32, offset: 288)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qs", scope: !409, file: !317, line: 173, baseType: !50, size: 32, offset: 320)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_index_offset", scope: !409, file: !317, line: 175, baseType: !50, size: 32, offset: 352)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter_control", scope: !409, file: !317, line: 177, baseType: !50, size: 32, offset: 384)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra_pred", scope: !409, file: !317, line: 178, baseType: !50, size: 32, offset: 416)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "b_redundant_pic_cnt", scope: !409, file: !317, line: 179, baseType: !50, size: 32, offset: 448)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8_mode", scope: !409, file: !317, line: 181, baseType: !50, size: 32, offset: 480)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !409, file: !317, line: 183, baseType: !50, size: 32, offset: 512)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !409, file: !317, line: 184, baseType: !429, size: 384, offset: 576)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 384, elements: !432)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!432 = !{!433}
!433 = !DISubrange(count: 6)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !89, file: !22, line: 433, baseType: !435, size: 64, offset: 26624)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !89, file: !22, line: 434, baseType: !50, size: 32, offset: 26688)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts_compress_multiplier", scope: !89, file: !22, line: 437, baseType: !50, size: 32, offset: 26720)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_mf", scope: !89, file: !22, line: 440, baseType: !439, size: 256, offset: 26752)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !440, size: 256, elements: !42)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 512, elements: !140)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_mf", scope: !89, file: !22, line: 441, baseType: !443, size: 128, offset: 27008)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !444, size: 128, elements: !35)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 2048, elements: !147)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "unquant4_mf", scope: !89, file: !22, line: 443, baseType: !439, size: 256, offset: 27136)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "unquant8_mf", scope: !89, file: !22, line: 444, baseType: !443, size: 128, offset: 27392)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_mf", scope: !89, file: !22, line: 446, baseType: !449, size: 256, offset: 27520)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !450, size: 256, elements: !42)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 256, elements: !140)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_mf", scope: !89, file: !22, line: 447, baseType: !453, size: 128, offset: 27776)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !454, size: 128, elements: !35)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 1024, elements: !147)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_bias", scope: !89, file: !22, line: 448, baseType: !449, size: 256, offset: 27904)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_bias", scope: !89, file: !22, line: 449, baseType: !453, size: 128, offset: 28160)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv", scope: !89, file: !22, line: 454, baseType: !459, size: 5888, offset: 28288)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 5888, elements: !461)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!461 = !{!462}
!462 = !DISubrange(count: 92)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv_fpel", scope: !89, file: !22, line: 455, baseType: !464, size: 23552, offset: 34176)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 23552, elements: !465)
!465 = !{!462, !43}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !89, file: !22, line: 457, baseType: !430, size: 64, offset: 57728)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !89, file: !22, line: 460, baseType: !468, size: 53376, offset: 57856)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_slice_header_t", file: !22, line: 364, baseType: !469)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 302, size: 53376, elements: !470)
!470 = !{!471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !499, !524, !525, !526, !532, !533, !534, !535, !536, !537, !538, !539}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !469, file: !22, line: 304, baseType: !405, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !469, file: !22, line: 305, baseType: !435, size: 64, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !469, file: !22, line: 307, baseType: !50, size: 32, offset: 128)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "i_first_mb", scope: !469, file: !22, line: 308, baseType: !50, size: 32, offset: 160)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_mb", scope: !469, file: !22, line: 309, baseType: !50, size: 32, offset: 192)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "i_pps_id", scope: !469, file: !22, line: 311, baseType: !50, size: 32, offset: 224)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !469, file: !22, line: 313, baseType: !50, size: 32, offset: 256)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "b_mbaff", scope: !469, file: !22, line: 315, baseType: !50, size: 32, offset: 288)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "b_field_pic", scope: !469, file: !22, line: 316, baseType: !50, size: 32, offset: 320)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "b_bottom_field", scope: !469, file: !22, line: 317, baseType: !50, size: 32, offset: 352)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !469, file: !22, line: 319, baseType: !50, size: 32, offset: 384)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !469, file: !22, line: 321, baseType: !50, size: 32, offset: 416)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc_bottom", scope: !469, file: !22, line: 322, baseType: !50, size: 32, offset: 448)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc", scope: !469, file: !22, line: 324, baseType: !194, size: 64, offset: 480)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "i_redundant_pic_cnt", scope: !469, file: !22, line: 325, baseType: !50, size: 32, offset: 544)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_spatial_mv_pred", scope: !469, file: !22, line: 327, baseType: !50, size: 32, offset: 576)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "b_num_ref_idx_override", scope: !469, file: !22, line: 329, baseType: !50, size: 32, offset: 608)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !469, file: !22, line: 330, baseType: !50, size: 32, offset: 640)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !469, file: !22, line: 331, baseType: !50, size: 32, offset: 672)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l0", scope: !469, file: !22, line: 333, baseType: !50, size: 32, offset: 704)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l1", scope: !469, file: !22, line: 334, baseType: !50, size: 32, offset: 736)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_order", scope: !469, file: !22, line: 339, baseType: !493, size: 2048, offset: 768)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 2048, elements: !498)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !469, file: !22, line: 335, size: 64, elements: !495)
!495 = !{!496, !497}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "idc", scope: !494, file: !22, line: 337, baseType: !50, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !494, file: !22, line: 338, baseType: !50, size: 32, offset: 32)
!498 = !{!36, !141}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !469, file: !22, line: 342, baseType: !500, size: 49152, offset: 2816)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 49152, elements: !521)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_weight_t", file: !502, line: 36, baseType: !503, align: 128)
!502 = !DIFile(filename: "x264_src/common/mc.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_weight_t", file: !502, line: 26, size: 512, elements: !504)
!504 = !{!505, !507, !508, !511, !512, !513}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "cachea", scope: !503, file: !502, line: 30, baseType: !506, size: 128, align: 128)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 128, elements: !71)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "cacheb", scope: !503, file: !502, line: 31, baseType: !506, size: 128, offset: 128)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "i_denom", scope: !503, file: !502, line: 32, baseType: !509, size: 32, offset: 256)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !54, line: 26, baseType: !510)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !29, line: 41, baseType: !50)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "i_scale", scope: !503, file: !502, line: 33, baseType: !509, size: 32, offset: 288)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset", scope: !503, file: !502, line: 34, baseType: !509, size: 32, offset: 320)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "weightfn", scope: !503, file: !502, line: 35, baseType: !514, size: 64, offset: 384)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "weight_fn_t", file: !502, line: 25, baseType: !516)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DISubroutineType(types: !518)
!518 = !{null, !282, !50, !282, !50, !519, !50}
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !503)
!521 = !{!522, !523}
!522 = !DISubrange(count: 32)
!523 = !DISubrange(count: 3)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_remove_from_end", scope: !469, file: !22, line: 344, baseType: !50, size: 32, offset: 51968)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_command_count", scope: !469, file: !22, line: 345, baseType: !50, size: 32, offset: 52000)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "mmco", scope: !469, file: !22, line: 350, baseType: !527, size: 1024, offset: 52032)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 1024, elements: !140)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !469, file: !22, line: 346, size: 64, elements: !529)
!529 = !{!530, !531}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "i_difference_of_pic_nums", scope: !528, file: !22, line: 348, baseType: !50, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !528, file: !22, line: 349, baseType: !50, size: 32, offset: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !469, file: !22, line: 352, baseType: !50, size: 32, offset: 53056)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !469, file: !22, line: 354, baseType: !50, size: 32, offset: 53088)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_delta", scope: !469, file: !22, line: 355, baseType: !50, size: 32, offset: 53120)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "b_sp_for_swidth", scope: !469, file: !22, line: 356, baseType: !50, size: 32, offset: 53152)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "i_qs_delta", scope: !469, file: !22, line: 357, baseType: !50, size: 32, offset: 53184)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "i_disable_deblocking_filter_idc", scope: !469, file: !22, line: 360, baseType: !50, size: 32, offset: 53216)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "i_alpha_c0_offset", scope: !469, file: !22, line: 361, baseType: !50, size: 32, offset: 53248)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "i_beta_offset", scope: !469, file: !22, line: 362, baseType: !50, size: 32, offset: 53280)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !89, file: !22, line: 463, baseType: !541, size: 4096, offset: 111232)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_cabac_t", file: !542, line: 46, baseType: !543)
!542 = !DIFile(filename: "x264_src/common/cabac.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !542, line: 27, size: 4096, elements: !544)
!544 = !{!545, !546, !547, !548, !549, !550, !551, !552, !553}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "i_low", scope: !543, file: !542, line: 30, baseType: !50, size: 32)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "i_range", scope: !543, file: !542, line: 31, baseType: !50, size: 32, offset: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "i_queue", scope: !543, file: !542, line: 34, baseType: !50, size: 32, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "i_bytes_outstanding", scope: !543, file: !542, line: 35, baseType: !50, size: 32, offset: 96)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !543, file: !542, line: 37, baseType: !282, size: 64, offset: 128)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !543, file: !542, line: 38, baseType: !282, size: 64, offset: 192)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !543, file: !542, line: 39, baseType: !282, size: 64, offset: 256)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "f8_bits_encoded", scope: !543, file: !542, line: 42, baseType: !50, size: 32, align: 128, offset: 384)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !543, file: !542, line: 45, baseType: !554, size: 3680, offset: 416)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 3680, elements: !555)
!555 = !{!556}
!556 = !DISubrange(count: 460)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !89, file: !22, line: 494, baseType: !558, size: 2112, offset: 115328)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !89, file: !22, line: 465, size: 2112, elements: !559)
!559 = !{!560, !697, !699, !700, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !713, !714, !715, !716}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !558, file: !22, line: 468, baseType: !561, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_frame_t", file: !564, line: 146, baseType: !565)
!564 = !DIFile(filename: "x264_src/common/frame.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_frame", file: !564, line: 31, size: 125056, elements: !566)
!566 = !{!567, !568, !569, !570, !573, !574, !575, !576, !577, !578, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !597, !598, !599, !600, !601, !602, !604, !606, !607, !608, !609, !610, !613, !615, !616, !618, !623, !624, !627, !628, !632, !636, !639, !641, !642, !644, !645, !647, !648, !649, !652, !654, !655, !656, !658, !659, !660, !661, !662, !663, !664, !665, !667, !668, !669, !678, !682, !684, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !565, file: !564, line: 34, baseType: !50, size: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !565, file: !564, line: 35, baseType: !50, size: 32, offset: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !565, file: !564, line: 36, baseType: !50, size: 32, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !565, file: !564, line: 37, baseType: !571, size: 64, offset: 128)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !54, line: 27, baseType: !572)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !29, line: 44, baseType: !296)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts", scope: !565, file: !564, line: 38, baseType: !571, size: 64, offset: 192)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "i_duration", scope: !565, file: !564, line: 39, baseType: !50, size: 32, offset: 256)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_duration", scope: !565, file: !564, line: 40, baseType: !50, size: 32, offset: 288)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !565, file: !564, line: 41, baseType: !50, size: 32, offset: 320)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay", scope: !565, file: !564, line: 42, baseType: !50, size: 32, offset: 352)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !565, file: !564, line: 43, baseType: !579, size: 64, offset: 384)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !565, file: !564, line: 45, baseType: !50, size: 32, offset: 448)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded", scope: !565, file: !564, line: 46, baseType: !50, size: 32, offset: 480)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "i_field_cnt", scope: !565, file: !564, line: 47, baseType: !50, size: 32, offset: 512)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !565, file: !564, line: 48, baseType: !50, size: 32, offset: 544)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "b_kept_as_ref", scope: !565, file: !564, line: 49, baseType: !50, size: 32, offset: 576)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_struct", scope: !565, file: !564, line: 50, baseType: !50, size: 32, offset: 608)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "b_keyframe", scope: !565, file: !564, line: 51, baseType: !50, size: 32, offset: 640)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "b_fdec", scope: !565, file: !564, line: 52, baseType: !39, size: 8, offset: 672)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_minigop_bframe", scope: !565, file: !564, line: 53, baseType: !39, size: 8, offset: 680)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframes", scope: !565, file: !564, line: 54, baseType: !39, size: 8, offset: 688)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_rc", scope: !565, file: !564, line: 55, baseType: !190, size: 32, offset: 704)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_aq", scope: !565, file: !564, line: 56, baseType: !190, size: 32, offset: 736)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_l0ref0", scope: !565, file: !564, line: 57, baseType: !50, size: 32, offset: 768)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !565, file: !564, line: 60, baseType: !50, size: 32, offset: 800)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !565, file: !564, line: 61, baseType: !595, size: 96, offset: 832)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 96, elements: !596)
!596 = !{!523}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !565, file: !564, line: 62, baseType: !595, size: 96, offset: 928)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines", scope: !565, file: !564, line: 63, baseType: !595, size: 96, offset: 1024)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride_lowres", scope: !565, file: !564, line: 64, baseType: !50, size: 32, offset: 1120)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "i_width_lowres", scope: !565, file: !564, line: 65, baseType: !50, size: 32, offset: 1152)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_lowres", scope: !565, file: !564, line: 66, baseType: !50, size: 32, offset: 1184)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !565, file: !564, line: 67, baseType: !603, size: 192, offset: 1216)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 192, elements: !596)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "filtered", scope: !565, file: !564, line: 68, baseType: !605, size: 256, offset: 1408)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 256, elements: !42)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !565, file: !564, line: 69, baseType: !605, size: 256, offset: 1664)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "integral", scope: !565, file: !564, line: 70, baseType: !460, size: 64, offset: 1920)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !565, file: !564, line: 74, baseType: !605, size: 256, offset: 1984)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_lowres", scope: !565, file: !564, line: 75, baseType: !605, size: 256, offset: 2240)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !565, file: !564, line: 77, baseType: !611, size: 24576, offset: 2560)
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 24576, elements: !612)
!612 = !{!141, !523}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "weighted", scope: !565, file: !564, line: 78, baseType: !614, size: 1024, offset: 27136)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 1024, elements: !140)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "b_duplicate", scope: !565, file: !564, line: 79, baseType: !50, size: 32, offset: 28160)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !565, file: !564, line: 80, baseType: !617, size: 64, offset: 28224)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !565, file: !564, line: 83, baseType: !619, size: 64, offset: 28288)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !54, line: 24, baseType: !621)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !29, line: 37, baseType: !622)
!622 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "mb_partition", scope: !565, file: !564, line: 84, baseType: !282, size: 64, offset: 28352)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !565, file: !564, line: 85, baseType: !625, size: 128, offset: 28416)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !626, size: 128, elements: !35)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "mv16x16", scope: !565, file: !564, line: 86, baseType: !626, size: 64, offset: 28544)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mvs", scope: !565, file: !564, line: 87, baseType: !629, size: 2176, offset: 28608)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !626, size: 2176, elements: !630)
!630 = !{!36, !631}
!631 = !DISubrange(count: 17)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_costs", scope: !565, file: !564, line: 92, baseType: !633, size: 20736, offset: 30784)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 20736, elements: !634)
!634 = !{!635, !635}
!635 = !DISubrange(count: 18)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mv_costs", scope: !565, file: !564, line: 96, baseType: !637, size: 2176, offset: 51520)
!637 = !DICompositeType(tag: DW_TAG_array_type, baseType: !638, size: 2176, elements: !630)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !565, file: !564, line: 97, baseType: !640, size: 128, offset: 53696)
!640 = !DICompositeType(tag: DW_TAG_array_type, baseType: !619, size: 128, elements: !35)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref", scope: !565, file: !564, line: 98, baseType: !194, size: 64, offset: 53824)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc", scope: !565, file: !564, line: 99, baseType: !643, size: 1024, offset: 53888)
!643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 1024, elements: !498)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "inv_ref_poc", scope: !565, file: !564, line: 100, baseType: !52, size: 32, offset: 54912)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est", scope: !565, file: !564, line: 105, baseType: !646, size: 10368, offset: 54944)
!646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 10368, elements: !634)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est_aq", scope: !565, file: !564, line: 106, baseType: !646, size: 10368, offset: 65312)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "i_satd", scope: !565, file: !564, line: 107, baseType: !50, size: 32, offset: 75680)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_mbs", scope: !565, file: !564, line: 108, baseType: !650, size: 576, offset: 75712)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 576, elements: !651)
!651 = !{!635}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satds", scope: !565, file: !564, line: 109, baseType: !653, size: 20736, offset: 76288)
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !638, size: 20736, elements: !634)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satd", scope: !565, file: !564, line: 110, baseType: !638, size: 64, offset: 97024)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_bits", scope: !565, file: !564, line: 111, baseType: !638, size: 64, offset: 97088)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "f_row_qp", scope: !565, file: !564, line: 112, baseType: !657, size: 64, offset: 97152)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset", scope: !565, file: !564, line: 113, baseType: !657, size: 64, offset: 97216)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset_aq", scope: !565, file: !564, line: 114, baseType: !657, size: 64, offset: 97280)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_calculated", scope: !565, file: !564, line: 115, baseType: !50, size: 32, offset: 97344)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !565, file: !564, line: 116, baseType: !460, size: 64, offset: 97408)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "i_propagate_cost", scope: !565, file: !564, line: 117, baseType: !460, size: 64, offset: 97472)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "i_inv_qscale_factor", scope: !565, file: !564, line: 118, baseType: !460, size: 64, offset: 97536)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "b_scenecut", scope: !565, file: !564, line: 119, baseType: !50, size: 32, offset: 97600)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "f_weighted_cost_delta", scope: !565, file: !564, line: 120, baseType: !666, size: 576, offset: 97632)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 576, elements: !651)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_sum", scope: !565, file: !564, line: 121, baseType: !26, size: 32, offset: 98208)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_ssd", scope: !565, file: !564, line: 122, baseType: !62, size: 64, offset: 98240)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "hrd_timing", scope: !565, file: !564, line: 125, baseType: !670, size: 256, offset: 98304)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_hrd_t", file: !88, line: 503, baseType: !671)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !88, line: 496, size: 256, elements: !672)
!672 = !{!673, !675, !676, !677}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_initial_arrival_time", scope: !671, file: !88, line: 498, baseType: !674, size: 64)
!674 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_final_arrival_time", scope: !671, file: !88, line: 499, baseType: !674, size: 64, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_time", scope: !671, file: !88, line: 500, baseType: !674, size: 64, offset: 128)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_time", scope: !671, file: !88, line: 502, baseType: !674, size: 64, offset: 192)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_type", scope: !565, file: !564, line: 128, baseType: !679, size: 2008, offset: 98560)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 2008, elements: !680)
!680 = !{!681}
!681 = !DISubrange(count: 251)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_satd", scope: !565, file: !564, line: 129, baseType: !683, size: 8032, offset: 100576)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 8032, elements: !680)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "f_planned_cpb_duration", scope: !565, file: !564, line: 130, baseType: !685, size: 16064, offset: 108608)
!685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !674, size: 16064, elements: !680)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !565, file: !564, line: 131, baseType: !50, size: 32, offset: 124672)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !565, file: !564, line: 132, baseType: !50, size: 32, offset: 124704)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_completed", scope: !565, file: !564, line: 135, baseType: !50, size: 32, offset: 124736)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_weighted", scope: !565, file: !564, line: 136, baseType: !50, size: 32, offset: 124768)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "i_reference_count", scope: !565, file: !564, line: 137, baseType: !50, size: 32, offset: 124800)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !565, file: !564, line: 138, baseType: !50, size: 32, offset: 124832)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !565, file: !564, line: 139, baseType: !50, size: 32, offset: 124864)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "f_pir_position", scope: !565, file: !564, line: 142, baseType: !190, size: 32, offset: 124896)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_start_col", scope: !565, file: !564, line: 143, baseType: !50, size: 32, offset: 124928)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_end_col", scope: !565, file: !564, line: 144, baseType: !50, size: 32, offset: 124960)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "i_frames_since_pir", scope: !565, file: !564, line: 145, baseType: !50, size: 32, offset: 124992)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !558, file: !22, line: 470, baseType: !698, size: 128, offset: 64)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !561, size: 128, elements: !35)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "blank_unused", scope: !558, file: !22, line: 473, baseType: !561, size: 64, offset: 192)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !558, file: !22, line: 476, baseType: !701, size: 1152, offset: 256)
!701 = !DICompositeType(tag: DW_TAG_array_type, baseType: !562, size: 1152, elements: !651)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_keyframe", scope: !558, file: !22, line: 478, baseType: !50, size: 32, offset: 1408)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "i_input", scope: !558, file: !22, line: 480, baseType: !50, size: 32, offset: 1440)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dpb", scope: !558, file: !22, line: 482, baseType: !50, size: 32, offset: 1472)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref0", scope: !558, file: !22, line: 483, baseType: !50, size: 32, offset: 1504)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref1", scope: !558, file: !22, line: 484, baseType: !50, size: 32, offset: 1536)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "i_delay", scope: !558, file: !22, line: 485, baseType: !50, size: 32, offset: 1568)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay", scope: !558, file: !22, line: 486, baseType: !50, size: 32, offset: 1600)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay_time", scope: !558, file: !22, line: 487, baseType: !571, size: 64, offset: 1664)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "i_init_delta", scope: !558, file: !22, line: 488, baseType: !571, size: 64, offset: 1728)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_reordered_pts", scope: !558, file: !22, line: 489, baseType: !712, size: 128, offset: 1792)
!712 = !DICompositeType(tag: DW_TAG_array_type, baseType: !571, size: 128, elements: !35)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "i_largest_pts", scope: !558, file: !22, line: 490, baseType: !571, size: 64, offset: 1920)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "i_second_largest_pts", scope: !558, file: !22, line: 491, baseType: !571, size: 64, offset: 1984)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_lowres", scope: !558, file: !22, line: 492, baseType: !50, size: 32, offset: 2048)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_sub8x8_esa", scope: !558, file: !22, line: 493, baseType: !50, size: 32, offset: 2080)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "fenc", scope: !89, file: !22, line: 497, baseType: !562, size: 64, offset: 117440)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "fdec", scope: !89, file: !22, line: 500, baseType: !562, size: 64, offset: 117504)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref0", scope: !89, file: !22, line: 503, baseType: !50, size: 32, offset: 117568)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "fref0", scope: !89, file: !22, line: 504, baseType: !721, size: 1216, offset: 117632)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !562, size: 1216, elements: !722)
!722 = !{!723}
!723 = !DISubrange(count: 19)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref1", scope: !89, file: !22, line: 505, baseType: !50, size: 32, offset: 118848)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "fref1", scope: !89, file: !22, line: 506, baseType: !721, size: 1216, offset: 118912)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_reorder", scope: !89, file: !22, line: 507, baseType: !194, size: 64, offset: 120128)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay", scope: !89, file: !22, line: 510, baseType: !50, size: 32, offset: 120192)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_offset", scope: !89, file: !22, line: 511, baseType: !50, size: 32, offset: 120224)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts_delay", scope: !89, file: !22, line: 512, baseType: !571, size: 64, offset: 120256)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "dct", scope: !89, file: !22, line: 522, baseType: !731, size: 10624, offset: 120320)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !89, file: !22, line: 515, size: 10624, elements: !732)
!732 = !{!733, !735, !738, !741}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "luma16x16_dc", scope: !731, file: !22, line: 517, baseType: !734, size: 256, align: 128)
!734 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 256, elements: !140)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_dc", scope: !731, file: !22, line: 518, baseType: !736, size: 128, align: 128, offset: 256)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 128, elements: !737)
!737 = !{!36, !43}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "luma8x8", scope: !731, file: !22, line: 520, baseType: !739, size: 4096, align: 128, offset: 384)
!739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 4096, elements: !740)
!740 = !{!43, !148}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "luma4x4", scope: !731, file: !22, line: 521, baseType: !742, size: 6144, align: 128, offset: 4480)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 6144, elements: !743)
!743 = !{!744, !141}
!744 = !DISubrange(count: 24)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !89, file: !22, line: 732, baseType: !746, size: 82688, offset: 130944)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !89, file: !22, line: 525, size: 82688, elements: !747)
!747 = !{!748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !775, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !793, !796, !800, !801, !802, !807, !808, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !876, !907, !908, !909, !910, !911, !912, !913, !914, !915, !918, !919, !920, !923, !926, !928, !931, !933, !934}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !746, file: !22, line: 527, baseType: !50, size: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_stride", scope: !746, file: !22, line: 530, baseType: !50, size: 32, offset: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_stride", scope: !746, file: !22, line: 531, baseType: !50, size: 32, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_stride", scope: !746, file: !22, line: 532, baseType: !50, size: 32, offset: 96)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_x", scope: !746, file: !22, line: 535, baseType: !50, size: 32, offset: 128)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_y", scope: !746, file: !22, line: 536, baseType: !50, size: 32, offset: 160)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_xy", scope: !746, file: !22, line: 537, baseType: !50, size: 32, offset: 192)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_xy", scope: !746, file: !22, line: 538, baseType: !50, size: 32, offset: 224)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_xy", scope: !746, file: !22, line: 539, baseType: !50, size: 32, offset: 256)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !746, file: !22, line: 542, baseType: !50, size: 32, offset: 288)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !746, file: !22, line: 543, baseType: !50, size: 32, offset: 320)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !746, file: !22, line: 544, baseType: !50, size: 32, offset: 352)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "b_trellis", scope: !746, file: !22, line: 545, baseType: !50, size: 32, offset: 384)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "b_noise_reduction", scope: !746, file: !22, line: 546, baseType: !50, size: 32, offset: 416)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !746, file: !22, line: 547, baseType: !50, size: 32, offset: 448)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_rd", scope: !746, file: !22, line: 548, baseType: !50, size: 32, offset: 480)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_trellis", scope: !746, file: !22, line: 549, baseType: !50, size: 32, offset: 512)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !746, file: !22, line: 551, baseType: !50, size: 32, offset: 544)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min", scope: !746, file: !22, line: 554, baseType: !194, size: 64, offset: 576)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max", scope: !746, file: !22, line: 555, baseType: !194, size: 64, offset: 640)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_spel", scope: !746, file: !22, line: 558, baseType: !194, size: 64, offset: 704)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_spel", scope: !746, file: !22, line: 559, baseType: !194, size: 64, offset: 768)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_fpel", scope: !746, file: !22, line: 561, baseType: !194, size: 64, offset: 832)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_fpel", scope: !746, file: !22, line: 562, baseType: !194, size: 64, offset: 896)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour", scope: !746, file: !22, line: 565, baseType: !7, size: 32, offset: 960)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour8", scope: !746, file: !22, line: 566, baseType: !774, size: 128, offset: 992)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128, elements: !42)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour4", scope: !746, file: !22, line: 567, baseType: !776, size: 512, offset: 1120)
!776 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 512, elements: !140)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_intra", scope: !746, file: !22, line: 568, baseType: !7, size: 32, offset: 1632)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_frame", scope: !746, file: !22, line: 569, baseType: !7, size: 32, offset: 1664)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_top", scope: !746, file: !22, line: 570, baseType: !50, size: 32, offset: 1696)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_left", scope: !746, file: !22, line: 571, baseType: !50, size: 32, offset: 1728)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topleft", scope: !746, file: !22, line: 572, baseType: !50, size: 32, offset: 1760)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topright", scope: !746, file: !22, line: 573, baseType: !50, size: 32, offset: 1792)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_prev_xy", scope: !746, file: !22, line: 574, baseType: !50, size: 32, offset: 1824)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_left_xy", scope: !746, file: !22, line: 575, baseType: !50, size: 32, offset: 1856)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_top_xy", scope: !746, file: !22, line: 576, baseType: !50, size: 32, offset: 1888)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topleft_xy", scope: !746, file: !22, line: 577, baseType: !50, size: 32, offset: 1920)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topright_xy", scope: !746, file: !22, line: 578, baseType: !50, size: 32, offset: 1952)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !746, file: !22, line: 585, baseType: !619, size: 64, offset: 1984)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "partition", scope: !746, file: !22, line: 586, baseType: !282, size: 64, offset: 2048)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !746, file: !22, line: 587, baseType: !619, size: 64, offset: 2112)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !746, file: !22, line: 588, baseType: !792, size: 64, offset: 2176)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !746, file: !22, line: 589, baseType: !794, size: 64, offset: 2240)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !620, size: 64, elements: !71)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !746, file: !22, line: 591, baseType: !797, size: 64, offset: 2304)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 192, elements: !799)
!799 = !{!744}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_pred_mode", scope: !746, file: !22, line: 592, baseType: !619, size: 64, offset: 2368)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !746, file: !22, line: 593, baseType: !625, size: 128, offset: 2432)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !746, file: !22, line: 594, baseType: !803, size: 128, offset: 2560)
!803 = !DICompositeType(tag: DW_TAG_array_type, baseType: !804, size: 128, elements: !35)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 128, elements: !806)
!806 = !{!72, !36}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !746, file: !22, line: 595, baseType: !640, size: 128, offset: 2688)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "mvr", scope: !746, file: !22, line: 596, baseType: !809, size: 4096, offset: 2816)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !626, size: 4096, elements: !810)
!810 = !{!36, !522}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "skipbp", scope: !746, file: !22, line: 597, baseType: !619, size: 64, offset: 6912)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "mb_transform_size", scope: !746, file: !22, line: 598, baseType: !619, size: 64, offset: 6976)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "slice_table", scope: !746, file: !22, line: 599, baseType: !460, size: 64, offset: 7040)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "p_weight_buf", scope: !746, file: !22, line: 603, baseType: !614, size: 1024, offset: 7104)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !746, file: !22, line: 606, baseType: !50, size: 32, offset: 8128)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "i_partition", scope: !746, file: !22, line: 607, baseType: !50, size: 32, offset: 8160)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "i_sub_partition", scope: !746, file: !22, line: 608, baseType: !38, size: 32, align: 32, offset: 8192)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !746, file: !22, line: 609, baseType: !50, size: 32, offset: 8224)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_luma", scope: !746, file: !22, line: 611, baseType: !50, size: 32, offset: 8256)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_chroma", scope: !746, file: !22, line: 612, baseType: !50, size: 32, offset: 8288)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra16x16_pred_mode", scope: !746, file: !22, line: 614, baseType: !50, size: 32, offset: 8320)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_pred_mode", scope: !746, file: !22, line: 615, baseType: !50, size: 32, offset: 8352)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "i_skip_intra", scope: !746, file: !22, line: 621, baseType: !50, size: 32, offset: 8384)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "b_skip_mc", scope: !746, file: !22, line: 624, baseType: !50, size: 32, offset: 8416)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "b_reencode_mb", scope: !746, file: !22, line: 626, baseType: !50, size: 32, offset: 8448)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "ip_offset", scope: !746, file: !22, line: 627, baseType: !50, size: 32, offset: 8480)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "pic", scope: !746, file: !22, line: 671, baseType: !828, size: 60672, offset: 8576)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !746, file: !22, line: 629, size: 60672, elements: !829)
!829 = !{!830, !834, !838, !840, !841, !844, !848, !850, !851, !852, !853, !854, !857, !861, !864, !865, !866, !867, !868, !871, !873, !875}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_buf", scope: !828, file: !22, line: 634, baseType: !831, size: 3072, align: 128)
!831 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 3072, elements: !832)
!832 = !{!833}
!833 = !DISubrange(count: 384)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "fdec_buf", scope: !828, file: !22, line: 635, baseType: !835, size: 6912, align: 128, offset: 3072)
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 6912, elements: !836)
!836 = !{!837}
!837 = !DISubrange(count: 864)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_fdec_buf", scope: !828, file: !22, line: 638, baseType: !839, size: 2048, align: 128, offset: 9984)
