; ModuleID = 'x264_src/input/yuv.c'
source_filename = "x264_src/input/yuv.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.cli_input_t = type { i32 (i8*, i8**, %struct.video_info_t*, %struct.cli_input_opt_t*)*, i32 (i8*)*, i32 (%struct.x264_picture_t*, i32, i32, i32)*, i32 (%struct.x264_picture_t*, i8*, i32)*, i32 (%struct.x264_picture_t*, i8*)*, void (%struct.x264_picture_t*)*, i32 (i8*)* }
%struct.video_info_t = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.cli_input_opt_t = type { i8*, i8*, i8*, i32 }
%struct.x264_picture_t = type { i32, i32, i32, i32, i64, i64, %struct.x264_param_t*, %struct.x264_image_t, %struct.x264_hrd_t, i8* }
%struct.x264_param_t = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.anon, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, [16 x i8], [16 x i8], [16 x i8], [16 x i8], [64 x i8], [64 x i8], void (i8*, i32, i8*, %struct.__va_list_tag*)*, i8*, i32, i32, i8*, %struct.anon.0, %struct.anon.1, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, void (i8*)* }
%struct.anon = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.anon.0 = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, float, float, i32, [2 x i32], i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "yuv_input", scope: !2, file: !3, line: 127, type: !14, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !13, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "x264_src/input/yuv.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{}
!5 = !{!6, !7, !8}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !9, line: 27, baseType: !10)
!9 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !11, line: 45, baseType: !12)
!11 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!12 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!13 = !{!0}
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "cli_input_t", file: !16, line: 63, baseType: !17)
!16 = !DIFile(filename: "x264_src/input/input.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 54, size: 448, elements: !18)
!18 = !{!19, !55, !59, !272, !276, !280, !284}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "open_file", scope: !17, file: !16, line: 56, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DISubroutineType(types: !22)
!22 = !{!7, !23, !25, !28, !47}
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "hnd_t", file: !27, line: 30, baseType: !6)
!27 = !DIFile(filename: "x264_src/muxers.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "video_info_t", file: !16, line: 52, baseType: !30)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 38, size: 384, elements: !31)
!31 = !{!32, !33, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "csp", scope: !30, file: !16, line: 40, baseType: !7, size: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "fps_num", scope: !30, file: !16, line: 41, baseType: !34, size: 32, offset: 32)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !9, line: 26, baseType: !35)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !11, line: 42, baseType: !36)
!36 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "fps_den", scope: !30, file: !16, line: 42, baseType: !34, size: 32, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !30, file: !16, line: 43, baseType: !7, size: 32, offset: 96)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced", scope: !30, file: !16, line: 44, baseType: !7, size: 32, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !30, file: !16, line: 45, baseType: !34, size: 32, offset: 160)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !30, file: !16, line: 46, baseType: !34, size: 32, offset: 192)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "tff", scope: !30, file: !16, line: 47, baseType: !7, size: 32, offset: 224)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "timebase_num", scope: !30, file: !16, line: 48, baseType: !34, size: 32, offset: 256)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "timebase_den", scope: !30, file: !16, line: 49, baseType: !34, size: 32, offset: 288)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "vfr", scope: !30, file: !16, line: 50, baseType: !7, size: 32, offset: 320)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !30, file: !16, line: 51, baseType: !7, size: 32, offset: 352)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "cli_input_opt_t", file: !16, line: 35, baseType: !49)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 29, size: 256, elements: !50)
!50 = !{!51, !52, !53, !54}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !49, file: !16, line: 31, baseType: !23, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "resolution", scope: !49, file: !16, line: 32, baseType: !23, size: 64, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "timebase", scope: !49, file: !16, line: 33, baseType: !23, size: 64, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !49, file: !16, line: 34, baseType: !7, size: 32, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "get_frame_total", scope: !17, file: !16, line: 57, baseType: !56, size: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{!7, !26}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "picture_alloc", scope: !17, file: !16, line: 58, baseType: !60, size: 64, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{!7, !63, !7, !7, !7}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_picture_t", file: !65, line: 549, baseType: !66)
!65 = !DIFile(filename: "x264_src/x264.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !65, line: 513, size: 1088, elements: !67)
!67 = !{!68, !69, !70, !71, !72, !77, !78, !249, !262, !271}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !66, file: !65, line: 521, baseType: !7, size: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !66, file: !65, line: 523, baseType: !7, size: 32, offset: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_struct", scope: !66, file: !65, line: 526, baseType: !7, size: 32, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "b_keyframe", scope: !66, file: !65, line: 529, baseType: !7, size: 32, offset: 96)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !66, file: !65, line: 531, baseType: !73, size: 64, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !74, line: 27, baseType: !75)
!74 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !11, line: 44, baseType: !76)
!76 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts", scope: !66, file: !65, line: 534, baseType: !73, size: 64, offset: 192)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !66, file: !65, line: 541, baseType: !79, size: 64, offset: 256)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !65, line: 376, baseType: !81)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !65, line: 176, size: 5632, elements: !82)
!82 = !{!83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !131, !132, !133, !134, !138, !139, !152, !153, !154, !155, !156, !187, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !81, file: !65, line: 179, baseType: !36, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !81, file: !65, line: 180, baseType: !7, size: 32, offset: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !81, file: !65, line: 181, baseType: !7, size: 32, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !81, file: !65, line: 182, baseType: !7, size: 32, offset: 96)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !81, file: !65, line: 183, baseType: !7, size: 32, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !81, file: !65, line: 186, baseType: !7, size: 32, offset: 160)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !81, file: !65, line: 187, baseType: !7, size: 32, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !81, file: !65, line: 188, baseType: !7, size: 32, offset: 224)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !81, file: !65, line: 189, baseType: !7, size: 32, offset: 256)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !81, file: !65, line: 190, baseType: !7, size: 32, offset: 288)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !81, file: !65, line: 198, baseType: !7, size: 32, offset: 320)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !81, file: !65, line: 215, baseType: !95, size: 288, offset: 352)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !81, file: !65, line: 200, size: 288, elements: !96)
!96 = !{!97, !98, !99, !100, !101, !102, !103, !104, !105}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !95, file: !65, line: 203, baseType: !7, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !95, file: !65, line: 204, baseType: !7, size: 32, offset: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !95, file: !65, line: 206, baseType: !7, size: 32, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !95, file: !65, line: 209, baseType: !7, size: 32, offset: 96)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !95, file: !65, line: 210, baseType: !7, size: 32, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !95, file: !65, line: 211, baseType: !7, size: 32, offset: 160)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !95, file: !65, line: 212, baseType: !7, size: 32, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !95, file: !65, line: 213, baseType: !7, size: 32, offset: 224)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !95, file: !65, line: 214, baseType: !7, size: 32, offset: 256)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !81, file: !65, line: 218, baseType: !7, size: 32, offset: 640)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !81, file: !65, line: 219, baseType: !7, size: 32, offset: 672)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !81, file: !65, line: 220, baseType: !7, size: 32, offset: 704)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !81, file: !65, line: 221, baseType: !7, size: 32, offset: 736)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !81, file: !65, line: 222, baseType: !7, size: 32, offset: 768)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !81, file: !65, line: 224, baseType: !7, size: 32, offset: 800)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !81, file: !65, line: 225, baseType: !7, size: 32, offset: 832)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !81, file: !65, line: 226, baseType: !7, size: 32, offset: 864)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !81, file: !65, line: 227, baseType: !7, size: 32, offset: 896)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !81, file: !65, line: 229, baseType: !7, size: 32, offset: 928)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !81, file: !65, line: 230, baseType: !7, size: 32, offset: 960)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !81, file: !65, line: 231, baseType: !7, size: 32, offset: 992)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !81, file: !65, line: 233, baseType: !7, size: 32, offset: 1024)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !81, file: !65, line: 234, baseType: !7, size: 32, offset: 1056)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !81, file: !65, line: 236, baseType: !7, size: 32, offset: 1088)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !81, file: !65, line: 237, baseType: !7, size: 32, offset: 1120)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !81, file: !65, line: 239, baseType: !7, size: 32, offset: 1152)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !81, file: !65, line: 240, baseType: !23, size: 64, offset: 1216)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !81, file: !65, line: 241, baseType: !125, size: 128, offset: 1280)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 128, elements: !129)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !9, line: 24, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !11, line: 38, baseType: !128)
!128 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!129 = !{!130}
!130 = !DISubrange(count: 16)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !81, file: !65, line: 242, baseType: !125, size: 128, offset: 1408)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !81, file: !65, line: 243, baseType: !125, size: 128, offset: 1536)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !81, file: !65, line: 244, baseType: !125, size: 128, offset: 1664)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !81, file: !65, line: 245, baseType: !135, size: 512, offset: 1792)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 512, elements: !136)
!136 = !{!137}
!137 = !DISubrange(count: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !81, file: !65, line: 246, baseType: !135, size: 512, offset: 2304)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !81, file: !65, line: 249, baseType: !140, size: 64, offset: 2816)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{null, !6, !7, !143, !145}
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 127, size: 192, elements: !147)
!147 = !{!148, !149, !150, !151}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !146, file: !3, line: 127, baseType: !36, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !146, file: !3, line: 127, baseType: !36, size: 32, offset: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !146, file: !3, line: 127, baseType: !6, size: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !146, file: !3, line: 127, baseType: !6, size: 64, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !81, file: !65, line: 250, baseType: !6, size: 64, offset: 2880)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !81, file: !65, line: 251, baseType: !7, size: 32, offset: 2944)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !81, file: !65, line: 252, baseType: !7, size: 32, offset: 2976)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !81, file: !65, line: 253, baseType: !23, size: 64, offset: 3008)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !81, file: !65, line: 287, baseType: !157, size: 800, offset: 3072)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !81, file: !65, line: 256, size: 800, elements: !158)
!158 = !{!159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !179, !180, !181, !185, !186}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !157, file: !65, line: 258, baseType: !36, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !157, file: !65, line: 259, baseType: !36, size: 32, offset: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !157, file: !65, line: 261, baseType: !7, size: 32, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !157, file: !65, line: 262, baseType: !7, size: 32, offset: 96)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !157, file: !65, line: 263, baseType: !7, size: 32, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !157, file: !65, line: 264, baseType: !7, size: 32, offset: 160)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !157, file: !65, line: 265, baseType: !7, size: 32, offset: 192)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !157, file: !65, line: 267, baseType: !7, size: 32, offset: 224)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !157, file: !65, line: 268, baseType: !7, size: 32, offset: 256)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !157, file: !65, line: 269, baseType: !7, size: 32, offset: 288)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !157, file: !65, line: 270, baseType: !7, size: 32, offset: 320)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !157, file: !65, line: 271, baseType: !7, size: 32, offset: 352)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !157, file: !65, line: 272, baseType: !7, size: 32, offset: 384)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !157, file: !65, line: 273, baseType: !7, size: 32, offset: 416)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !157, file: !65, line: 274, baseType: !7, size: 32, offset: 448)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !157, file: !65, line: 275, baseType: !7, size: 32, offset: 480)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !157, file: !65, line: 276, baseType: !7, size: 32, offset: 512)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !157, file: !65, line: 277, baseType: !7, size: 32, offset: 544)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !157, file: !65, line: 278, baseType: !178, size: 32, offset: 576)
!178 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !157, file: !65, line: 279, baseType: !178, size: 32, offset: 608)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !157, file: !65, line: 280, baseType: !7, size: 32, offset: 640)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !157, file: !65, line: 283, baseType: !182, size: 64, offset: 672)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 2)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !157, file: !65, line: 285, baseType: !7, size: 32, offset: 736)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !157, file: !65, line: 286, baseType: !7, size: 32, offset: 768)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !81, file: !65, line: 327, baseType: !188, size: 1152, offset: 3904)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !81, file: !65, line: 290, size: 1152, elements: !189)
!189 = !{!190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !227, !228}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !188, file: !65, line: 292, baseType: !7, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !188, file: !65, line: 294, baseType: !7, size: 32, offset: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !188, file: !65, line: 295, baseType: !7, size: 32, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !188, file: !65, line: 296, baseType: !7, size: 32, offset: 96)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !188, file: !65, line: 297, baseType: !7, size: 32, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !188, file: !65, line: 299, baseType: !7, size: 32, offset: 160)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !188, file: !65, line: 300, baseType: !178, size: 32, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !188, file: !65, line: 301, baseType: !178, size: 32, offset: 224)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !188, file: !65, line: 302, baseType: !178, size: 32, offset: 256)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !188, file: !65, line: 303, baseType: !7, size: 32, offset: 288)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !188, file: !65, line: 304, baseType: !7, size: 32, offset: 320)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !188, file: !65, line: 305, baseType: !178, size: 32, offset: 352)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !188, file: !65, line: 306, baseType: !178, size: 32, offset: 384)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !188, file: !65, line: 307, baseType: !178, size: 32, offset: 416)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !188, file: !65, line: 309, baseType: !7, size: 32, offset: 448)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !188, file: !65, line: 310, baseType: !178, size: 32, offset: 480)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !188, file: !65, line: 311, baseType: !7, size: 32, offset: 512)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !188, file: !65, line: 312, baseType: !7, size: 32, offset: 544)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !188, file: !65, line: 315, baseType: !7, size: 32, offset: 576)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !188, file: !65, line: 316, baseType: !23, size: 64, offset: 640)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !188, file: !65, line: 317, baseType: !7, size: 32, offset: 704)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !188, file: !65, line: 318, baseType: !23, size: 64, offset: 768)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !188, file: !65, line: 321, baseType: !178, size: 32, offset: 832)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !188, file: !65, line: 322, baseType: !178, size: 32, offset: 864)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !188, file: !65, line: 323, baseType: !178, size: 32, offset: 896)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !188, file: !65, line: 324, baseType: !216, size: 64, offset: 960)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !65, line: 174, baseType: !218)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !65, line: 167, size: 256, elements: !219)
!219 = !{!220, !221, !222, !223, !224, !225}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !218, file: !65, line: 169, baseType: !7, size: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !218, file: !65, line: 169, baseType: !7, size: 32, offset: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !218, file: !65, line: 170, baseType: !7, size: 32, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !218, file: !65, line: 171, baseType: !7, size: 32, offset: 96)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !218, file: !65, line: 172, baseType: !178, size: 32, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !218, file: !65, line: 173, baseType: !226, size: 64, offset: 192)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !188, file: !65, line: 325, baseType: !7, size: 32, offset: 1024)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !188, file: !65, line: 326, baseType: !23, size: 64, offset: 1088)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !81, file: !65, line: 330, baseType: !7, size: 32, offset: 5056)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !81, file: !65, line: 331, baseType: !7, size: 32, offset: 5088)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !81, file: !65, line: 332, baseType: !7, size: 32, offset: 5120)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !81, file: !65, line: 334, baseType: !7, size: 32, offset: 5152)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !81, file: !65, line: 335, baseType: !7, size: 32, offset: 5184)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !81, file: !65, line: 336, baseType: !34, size: 32, offset: 5216)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !81, file: !65, line: 337, baseType: !34, size: 32, offset: 5248)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !81, file: !65, line: 338, baseType: !34, size: 32, offset: 5280)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !81, file: !65, line: 339, baseType: !34, size: 32, offset: 5312)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !81, file: !65, line: 340, baseType: !7, size: 32, offset: 5344)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !81, file: !65, line: 344, baseType: !7, size: 32, offset: 5376)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !81, file: !65, line: 356, baseType: !7, size: 32, offset: 5408)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !81, file: !65, line: 364, baseType: !7, size: 32, offset: 5440)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !81, file: !65, line: 367, baseType: !7, size: 32, offset: 5472)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !81, file: !65, line: 368, baseType: !7, size: 32, offset: 5504)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !81, file: !65, line: 369, baseType: !7, size: 32, offset: 5536)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !81, file: !65, line: 375, baseType: !246, size: 64, offset: 5568)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{null, !6}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "img", scope: !66, file: !65, line: 543, baseType: !250, size: 448, offset: 320)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_image_t", file: !65, line: 511, baseType: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !65, line: 505, size: 448, elements: !252)
!252 = !{!253, !254, !255, !259}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !251, file: !65, line: 507, baseType: !7, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !251, file: !65, line: 508, baseType: !7, size: 32, offset: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !251, file: !65, line: 509, baseType: !256, size: 128, offset: 64)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128, elements: !257)
!257 = !{!258}
!258 = !DISubrange(count: 4)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !251, file: !65, line: 510, baseType: !260, size: 256, offset: 192)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 256, elements: !257)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "hrd_timing", scope: !66, file: !65, line: 545, baseType: !263, size: 256, offset: 768)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_hrd_t", file: !65, line: 503, baseType: !264)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !65, line: 496, size: 256, elements: !265)
!265 = !{!266, !268, !269, !270}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_initial_arrival_time", scope: !264, file: !65, line: 498, baseType: !267, size: 64)
!267 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_final_arrival_time", scope: !264, file: !65, line: 499, baseType: !267, size: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_time", scope: !264, file: !65, line: 500, baseType: !267, size: 64, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_time", scope: !264, file: !65, line: 502, baseType: !267, size: 64, offset: 192)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !66, file: !65, line: 548, baseType: !6, size: 64, offset: 1024)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "read_frame", scope: !17, file: !16, line: 59, baseType: !273, size: 64, offset: 192)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{!7, !63, !26, !7}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "release_frame", scope: !17, file: !16, line: 60, baseType: !277, size: 64, offset: 256)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!7, !63, !26}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "picture_clean", scope: !17, file: !16, line: 61, baseType: !281, size: 64, offset: 320)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{null, !63}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "close_file", scope: !17, file: !16, line: 62, baseType: !56, size: 64, offset: 384)
!285 = !{i32 7, !"Dwarf Version", i32 4}
!286 = !{i32 2, !"Debug Info Version", i32 3}
!287 = !{i32 1, !"wchar_size", i32 4}
!288 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!289 = distinct !DISubprogram(name: "open_file", scope: !3, file: !3, line: 33, type: !21, scopeLine: 34, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!290 = !DILocalVariable(name: "psz_filename", arg: 1, scope: !289, file: !3, line: 33, type: !23)
!291 = !DILocation(line: 33, column: 29, scope: !289)
!292 = !DILocalVariable(name: "p_handle", arg: 2, scope: !289, file: !3, line: 33, type: !25)
!293 = !DILocation(line: 33, column: 50, scope: !289)
!294 = !DILocalVariable(name: "info", arg: 3, scope: !289, file: !3, line: 33, type: !28)
!295 = !DILocation(line: 33, column: 74, scope: !289)
!296 = !DILocalVariable(name: "opt", arg: 4, scope: !289, file: !3, line: 33, type: !47)
!297 = !DILocation(line: 33, column: 97, scope: !289)
!298 = !DILocalVariable(name: "h", scope: !289, file: !3, line: 35, type: !299)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv_hnd_t", file: !3, line: 31, baseType: !301)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 26, size: 192, elements: !302)
!302 = !{!303, !360, !361, !362}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "fh", scope: !301, file: !3, line: 28, baseType: !304, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !306, line: 7, baseType: !307)
!306 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !308, line: 49, size: 1728, elements: !309)
!308 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!309 = !{!310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !325, !327, !328, !329, !331, !333, !335, !339, !342, !344, !347, !350, !351, !352, !355, !356}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !307, file: !308, line: 51, baseType: !7, size: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !307, file: !308, line: 54, baseType: !23, size: 64, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !307, file: !308, line: 55, baseType: !23, size: 64, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !307, file: !308, line: 56, baseType: !23, size: 64, offset: 192)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !307, file: !308, line: 57, baseType: !23, size: 64, offset: 256)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !307, file: !308, line: 58, baseType: !23, size: 64, offset: 320)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !307, file: !308, line: 59, baseType: !23, size: 64, offset: 384)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !307, file: !308, line: 60, baseType: !23, size: 64, offset: 448)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !307, file: !308, line: 61, baseType: !23, size: 64, offset: 512)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !307, file: !308, line: 64, baseType: !23, size: 64, offset: 576)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !307, file: !308, line: 65, baseType: !23, size: 64, offset: 640)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !307, file: !308, line: 66, baseType: !23, size: 64, offset: 704)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !307, file: !308, line: 68, baseType: !323, size: 64, offset: 768)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !308, line: 36, flags: DIFlagFwdDecl)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !307, file: !308, line: 70, baseType: !326, size: 64, offset: 832)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !307, file: !308, line: 72, baseType: !7, size: 32, offset: 896)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !307, file: !308, line: 73, baseType: !7, size: 32, offset: 928)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !307, file: !308, line: 74, baseType: !330, size: 64, offset: 960)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !11, line: 152, baseType: !76)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !307, file: !308, line: 77, baseType: !332, size: 16, offset: 1024)
!332 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !307, file: !308, line: 78, baseType: !334, size: 8, offset: 1040)
!334 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !307, file: !308, line: 79, baseType: !336, size: 8, offset: 1048)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 8, elements: !337)
!337 = !{!338}
!338 = !DISubrange(count: 1)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !307, file: !308, line: 81, baseType: !340, size: 64, offset: 1088)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !308, line: 43, baseType: null)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !307, file: !308, line: 89, baseType: !343, size: 64, offset: 1152)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !11, line: 153, baseType: !76)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !307, file: !308, line: 91, baseType: !345, size: 64, offset: 1216)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !308, line: 37, flags: DIFlagFwdDecl)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !307, file: !308, line: 92, baseType: !348, size: 64, offset: 1280)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !308, line: 38, flags: DIFlagFwdDecl)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !307, file: !308, line: 93, baseType: !326, size: 64, offset: 1344)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !307, file: !308, line: 94, baseType: !6, size: 64, offset: 1408)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !307, file: !308, line: 95, baseType: !353, size: 64, offset: 1472)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !354, line: 46, baseType: !12)
!354 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!355 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !307, file: !308, line: 96, baseType: !7, size: 32, offset: 1536)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !307, file: !308, line: 98, baseType: !357, size: 160, offset: 1568)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 160, elements: !358)
!358 = !{!359}
!359 = !DISubrange(count: 20)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !301, file: !3, line: 29, baseType: !7, size: 32, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !301, file: !3, line: 29, baseType: !7, size: 32, offset: 96)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "next_frame", scope: !301, file: !3, line: 30, baseType: !7, size: 32, offset: 128)
!363 = !DILocation(line: 35, column: 16, scope: !289)
!364 = !DILocation(line: 35, column: 20, scope: !289)
!365 = !DILocation(line: 36, column: 10, scope: !366)
!366 = distinct !DILexicalBlock(scope: !289, file: !3, line: 36, column: 9)
!367 = !DILocation(line: 36, column: 9, scope: !289)
!368 = !DILocation(line: 37, column: 9, scope: !366)
!369 = !DILocation(line: 39, column: 10, scope: !370)
!370 = distinct !DILexicalBlock(scope: !289, file: !3, line: 39, column: 9)
!371 = !DILocation(line: 39, column: 15, scope: !370)
!372 = !DILocation(line: 39, column: 9, scope: !289)
!373 = !DILocalVariable(name: "p", scope: !374, file: !3, line: 42, type: !23)
!374 = distinct !DILexicalBlock(scope: !375, file: !3, line: 42, column: 9)
!375 = distinct !DILexicalBlock(scope: !370, file: !3, line: 40, column: 5)
!376 = !DILocation(line: 42, column: 20, scope: !374)
!377 = !DILocation(line: 42, column: 24, scope: !374)
!378 = !DILocation(line: 42, column: 14, scope: !374)
!379 = !DILocation(line: 42, column: 39, scope: !380)
!380 = distinct !DILexicalBlock(scope: !374, file: !3, line: 42, column: 9)
!381 = !DILocation(line: 42, column: 38, scope: !380)
!382 = !DILocation(line: 42, column: 9, scope: !374)
!383 = !DILocation(line: 43, column: 18, scope: !384)
!384 = distinct !DILexicalBlock(scope: !380, file: !3, line: 43, column: 17)
!385 = !DILocation(line: 43, column: 17, scope: !384)
!386 = !DILocation(line: 43, column: 20, scope: !384)
!387 = !DILocation(line: 43, column: 27, scope: !384)
!388 = !DILocation(line: 43, column: 31, scope: !384)
!389 = !DILocation(line: 43, column: 30, scope: !384)
!390 = !DILocation(line: 43, column: 33, scope: !384)
!391 = !DILocation(line: 43, column: 40, scope: !384)
!392 = !DILocation(line: 43, column: 51, scope: !384)
!393 = !DILocation(line: 43, column: 64, scope: !384)
!394 = !DILocation(line: 43, column: 70, scope: !384)
!395 = !DILocation(line: 43, column: 78, scope: !384)
!396 = !DILocation(line: 43, column: 84, scope: !384)
!397 = !DILocation(line: 43, column: 43, scope: !384)
!398 = !DILocation(line: 43, column: 93, scope: !384)
!399 = !DILocation(line: 43, column: 17, scope: !380)
!400 = !DILocation(line: 44, column: 17, scope: !384)
!401 = !DILocation(line: 43, column: 96, scope: !384)
!402 = !DILocation(line: 42, column: 43, scope: !380)
!403 = !DILocation(line: 42, column: 9, scope: !380)
!404 = distinct !{!404, !382, !405}
!405 = !DILocation(line: 44, column: 17, scope: !374)
!406 = !DILocation(line: 45, column: 5, scope: !375)
!407 = !DILocation(line: 47, column: 17, scope: !370)
!408 = !DILocation(line: 47, column: 22, scope: !370)
!409 = !DILocation(line: 47, column: 44, scope: !370)
!410 = !DILocation(line: 47, column: 50, scope: !370)
!411 = !DILocation(line: 47, column: 58, scope: !370)
!412 = !DILocation(line: 47, column: 64, scope: !370)
!413 = !DILocation(line: 47, column: 9, scope: !370)
!414 = !DILocation(line: 48, column: 10, scope: !415)
!415 = distinct !DILexicalBlock(scope: !289, file: !3, line: 48, column: 9)
!416 = !DILocation(line: 48, column: 16, scope: !415)
!417 = !DILocation(line: 48, column: 22, scope: !415)
!418 = !DILocation(line: 48, column: 26, scope: !415)
!419 = !DILocation(line: 48, column: 32, scope: !415)
!420 = !DILocation(line: 48, column: 9, scope: !289)
!421 = !DILocation(line: 50, column: 18, scope: !422)
!422 = distinct !DILexicalBlock(scope: !415, file: !3, line: 49, column: 5)
!423 = !DILocation(line: 50, column: 9, scope: !422)
!424 = !DILocation(line: 51, column: 9, scope: !422)
!425 = !DILocation(line: 54, column: 5, scope: !289)
!426 = !DILocation(line: 54, column: 8, scope: !289)
!427 = !DILocation(line: 54, column: 19, scope: !289)
!428 = !DILocation(line: 55, column: 5, scope: !289)
!429 = !DILocation(line: 55, column: 11, scope: !289)
!430 = !DILocation(line: 55, column: 19, scope: !289)
