; ModuleID = 'x264_src/output/flv_bytestream.c'
source_filename = "x264_src/output/flv_bytestream.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%union.dbl2int_cvrt = type { double }
%struct.flv_buffer = type { i8*, i32, i32, %struct._IO_FILE*, i64 }

@.str = private unnamed_addr constant [2 x i8] c"-\00", align 1
@stdout = external dso_local global %struct._IO_FILE*, align 8
@.str.1 = private unnamed_addr constant [3 x i8] c"wb\00", align 1

; Function Attrs: noinline nounwind uwtable
define dso_local i64 @dbl2int(double %value) #0 !dbg !31 {
entry:
  %value.addr = alloca double, align 8
  %cvrt = alloca %union.dbl2int_cvrt, align 8
  store double %value, double* %value.addr, align 8
  call void @llvm.dbg.declare(metadata double* %value.addr, metadata !39, metadata !DIExpression()), !dbg !40
  call void @llvm.dbg.declare(metadata %union.dbl2int_cvrt* %cvrt, metadata !41, metadata !DIExpression()), !dbg !46
  %0 = load double, double* %value.addr, align 8, !dbg !47

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !20, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "x264_src/output/flv_bytestream.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 92, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "x264_src/output/flv_bytestream.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!7 = !DIEnumerator(name: "AMF_DATA_TYPE_NUMBER", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "AMF_DATA_TYPE_BOOL", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "AMF_DATA_TYPE_STRING", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "AMF_DATA_TYPE_OBJECT", value: 3, isUnsigned: true)
!11 = !DIEnumerator(name: "AMF_DATA_TYPE_NULL", value: 5, isUnsigned: true)
!12 = !DIEnumerator(name: "AMF_DATA_TYPE_UNDEFINED", value: 6, isUnsigned: true)
!13 = !DIEnumerator(name: "AMF_DATA_TYPE_REFERENCE", value: 7, isUnsigned: true)
!14 = !DIEnumerator(name: "AMF_DATA_TYPE_MIXEDARRAY", value: 8, isUnsigned: true)
!15 = !DIEnumerator(name: "AMF_DATA_TYPE_OBJECT_END", value: 9, isUnsigned: true)
!16 = !DIEnumerator(name: "AMF_DATA_TYPE_ARRAY", value: 10, isUnsigned: true)
!17 = !DIEnumerator(name: "AMF_DATA_TYPE_DATE", value: 11, isUnsigned: true)
!18 = !DIEnumerator(name: "AMF_DATA_TYPE_LONG_STRING", value: 12, isUnsigned: true)
!19 = !DIEnumerator(name: "AMF_DATA_TYPE_UNSUPPORTED", value: 13, isUnsigned: true)
!20 = !{!21}
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 24, baseType: !24)
!23 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !25, line: 38, baseType: !26)
!25 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!26 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!27 = !{i32 7, !"Dwarf Version", i32 4}
!28 = !{i32 2, !"Debug Info Version", i32 3}
!29 = !{i32 1, !"wchar_size", i32 4}
!30 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!31 = distinct !DISubprogram(name: "dbl2int", scope: !1, file: !1, line: 24, type: !32, scopeLine: 25, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !38)
!32 = !DISubroutineType(types: !33)
!33 = !{!34, !37}
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 27, baseType: !35)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !25, line: 45, baseType: !36)
!36 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!37 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!38 = !{}
!39 = !DILocalVariable(name: "value", arg: 1, scope: !31, file: !1, line: 24, type: !37)
!40 = !DILocation(line: 24, column: 26, scope: !31)
!41 = !DILocalVariable(name: "cvrt", scope: !31, file: !1, line: 31, type: !42)
!42 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "dbl2int_cvrt", scope: !31, file: !1, line: 28, size: 64, elements: !43)
!43 = !{!44, !45}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !42, file: !1, line: 29, baseType: !37, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !42, file: !1, line: 30, baseType: !34, size: 64)
!46 = !DILocation(line: 31, column: 6, scope: !31)
!47 = !DILocation(line: 32, column: 13, scope: !31)
!48 = !DILocation(line: 32, column: 9, scope: !31)
!49 = !DILocation(line: 32, column: 11, scope: !31)
!50 = !DILocation(line: 33, column: 16, scope: !31)
!51 = !DILocation(line: 33, column: 4, scope: !31)
!52 = distinct !DISubprogram(name: "x264_put_byte", scope: !1, file: !1, line: 41, type: !53, scopeLine: 42, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !38)
!53 = !DISubroutineType(types: !54)
!54 = !{null, !55, !22}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "flv_buffer", file: !4, line: 116, baseType: !57)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "flv_buffer", file: !4, line: 109, size: 256, elements: !58)
!58 = !{!59, !60, !61, !62, !124}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !57, file: !4, line: 111, baseType: !21, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "d_cur", scope: !57, file: !4, line: 112, baseType: !5, size: 32, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "d_max", scope: !57, file: !4, line: 113, baseType: !5, size: 32, offset: 96)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !57, file: !4, line: 114, baseType: !63, size: 64, offset: 128)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !65, line: 7, baseType: !66)
!65 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !67, line: 49, size: 1728, elements: !68)
!67 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!68 = !{!69, !71, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !87, !89, !90, !91, !94, !96, !98, !102, !105, !107, !110, !113, !114, !116, !119, !120}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !66, file: !67, line: 51, baseType: !70, size: 32)
!70 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !66, file: !67, line: 54, baseType: !72, size: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !66, file: !67, line: 55, baseType: !72, size: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !66, file: !67, line: 56, baseType: !72, size: 64, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !66, file: !67, line: 57, baseType: !72, size: 64, offset: 256)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !66, file: !67, line: 58, baseType: !72, size: 64, offset: 320)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !66, file: !67, line: 59, baseType: !72, size: 64, offset: 384)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !66, file: !67, line: 60, baseType: !72, size: 64, offset: 448)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !66, file: !67, line: 61, baseType: !72, size: 64, offset: 512)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !66, file: !67, line: 64, baseType: !72, size: 64, offset: 576)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !66, file: !67, line: 65, baseType: !72, size: 64, offset: 640)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !66, file: !67, line: 66, baseType: !72, size: 64, offset: 704)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !66, file: !67, line: 68, baseType: !85, size: 64, offset: 768)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !67, line: 36, flags: DIFlagFwdDecl)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !66, file: !67, line: 70, baseType: !88, size: 64, offset: 832)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !66, file: !67, line: 72, baseType: !70, size: 32, offset: 896)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !66, file: !67, line: 73, baseType: !70, size: 32, offset: 928)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !66, file: !67, line: 74, baseType: !92, size: 64, offset: 960)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !25, line: 152, baseType: !93)
!93 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !66, file: !67, line: 77, baseType: !95, size: 16, offset: 1024)
!95 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !66, file: !67, line: 78, baseType: !97, size: 8, offset: 1040)
!97 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !66, file: !67, line: 79, baseType: !99, size: 8, offset: 1048)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 8, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 1)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !66, file: !67, line: 81, baseType: !103, size: 64, offset: 1088)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !67, line: 43, baseType: null)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !66, file: !67, line: 89, baseType: !106, size: 64, offset: 1152)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !25, line: 153, baseType: !93)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !66, file: !67, line: 91, baseType: !108, size: 64, offset: 1216)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !67, line: 37, flags: DIFlagFwdDecl)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !66, file: !67, line: 92, baseType: !111, size: 64, offset: 1280)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !67, line: 38, flags: DIFlagFwdDecl)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !66, file: !67, line: 93, baseType: !88, size: 64, offset: 1344)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !66, file: !67, line: 94, baseType: !115, size: 64, offset: 1408)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !66, file: !67, line: 95, baseType: !117, size: 64, offset: 1472)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !118, line: 46, baseType: !36)
!118 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !66, file: !67, line: 96, baseType: !70, size: 32, offset: 1536)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !66, file: !67, line: 98, baseType: !121, size: 160, offset: 1568)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 160, elements: !122)
!122 = !{!123}
!123 = !DISubrange(count: 20)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "d_total", scope: !57, file: !4, line: 115, baseType: !34, size: 64, offset: 192)
!125 = !DILocalVariable(name: "c", arg: 1, scope: !52, file: !1, line: 41, type: !55)
!126 = !DILocation(line: 41, column: 33, scope: !52)
!127 = !DILocalVariable(name: "b", arg: 2, scope: !52, file: !1, line: 41, type: !22)
!128 = !DILocation(line: 41, column: 44, scope: !52)
!129 = !DILocation(line: 43, column: 22, scope: !52)
!130 = !DILocation(line: 43, column: 5, scope: !52)
!131 = !DILocation(line: 44, column: 1, scope: !52)
!132 = distinct !DISubprogram(name: "flv_append_data", scope: !1, file: !1, line: 114, type: !133, scopeLine: 115, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !38)
!133 = !DISubroutineType(types: !134)
!134 = !{!70, !55, !21, !5}
!135 = !DILocalVariable(name: "c", arg: 1, scope: !132, file: !1, line: 114, type: !55)
!136 = !DILocation(line: 114, column: 34, scope: !132)
!137 = !DILocalVariable(name: "data", arg: 2, scope: !132, file: !1, line: 114, type: !21)
!138 = !DILocation(line: 114, column: 46, scope: !132)
!139 = !DILocalVariable(name: "size", arg: 3, scope: !132, file: !1, line: 114, type: !5)
!140 = !DILocation(line: 114, column: 61, scope: !132)
!141 = !DILocalVariable(name: "ns", scope: !132, file: !1, line: 116, type: !5)
!142 = !DILocation(line: 116, column: 14, scope: !132)
!143 = !DILocation(line: 116, column: 19, scope: !132)
!144 = !DILocation(line: 116, column: 22, scope: !132)
!145 = !DILocation(line: 116, column: 30, scope: !132)
!146 = !DILocation(line: 116, column: 28, scope: !132)
!147 = !DILocation(line: 118, column: 9, scope: !148)
!148 = distinct !DILexicalBlock(scope: !132, file: !1, line: 118, column: 9)
!149 = !DILocation(line: 118, column: 14, scope: !148)
!150 = !DILocation(line: 118, column: 17, scope: !148)
!151 = !DILocation(line: 118, column: 12, scope: !148)
!152 = !DILocation(line: 118, column: 9, scope: !132)
!153 = !DILocalVariable(name: "dp", scope: !154, file: !1, line: 120, type: !115)
!154 = distinct !DILexicalBlock(scope: !148, file: !1, line: 119, column: 5)
!155 = !DILocation(line: 120, column: 15, scope: !154)
!156 = !DILocalVariable(name: "dn", scope: !154, file: !1, line: 121, type: !5)
!157 = !DILocation(line: 121, column: 18, scope: !154)
!158 = !DILocation(line: 122, column: 9, scope: !154)
!159 = !DILocation(line: 122, column: 16, scope: !154)
!160 = !DILocation(line: 122, column: 21, scope: !154)
!161 = !DILocation(line: 122, column: 19, scope: !154)
!162 = !DILocation(line: 123, column: 16, scope: !154)
!163 = distinct !{!163, !158, !164}
!164 = !DILocation(line: 123, column: 20, scope: !154)
!165 = !DILocation(line: 125, column: 23, scope: !154)
!166 = !DILocation(line: 125, column: 26, scope: !154)
!167 = !DILocation(line: 125, column: 32, scope: !154)
!168 = !DILocation(line: 125, column: 14, scope: !154)
!169 = !DILocation(line: 125, column: 12, scope: !154)
!170 = !DILocation(line: 126, column: 14, scope: !171)
!171 = distinct !DILexicalBlock(scope: !154, file: !1, line: 126, column: 13)
!172 = !DILocation(line: 126, column: 13, scope: !154)
!173 = !DILocation(line: 127, column: 13, scope: !171)
!174 = !DILocation(line: 129, column: 19, scope: !154)
!175 = !DILocation(line: 129, column: 9, scope: !154)
!176 = !DILocation(line: 129, column: 12, scope: !154)
!177 = !DILocation(line: 129, column: 17, scope: !154)
!178 = !DILocation(line: 130, column: 20, scope: !154)
!179 = !DILocation(line: 130, column: 9, scope: !154)
!180 = !DILocation(line: 130, column: 12, scope: !154)
!181 = !DILocation(line: 130, column: 18, scope: !154)
!182 = !DILocation(line: 131, column: 5, scope: !154)
!183 = !DILocation(line: 133, column: 13, scope: !132)
!184 = !DILocation(line: 133, column: 16, scope: !132)
!185 = !DILocation(line: 133, column: 23, scope: !132)
!186 = !DILocation(line: 133, column: 26, scope: !132)
!187 = !DILocation(line: 133, column: 21, scope: !132)
!188 = !DILocation(line: 133, column: 33, scope: !132)
