; ModuleID = 'x264_src/common/frame.c'
source_filename = "x264_src/common/frame.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.x264_frame = type { i32, i32, i32, i64, i64, i32, i32, i32, i32, %struct.x264_param_t*, i32, i32, i32, i32, i32, i32, i32, i8, i8, i8, float, float, i32, i32, [3 x i32], [3 x i32], [3 x i32], i32, i32, i32, [3 x i8*], [4 x i8*], [4 x i8*], i16*, [4 x i8*], [4 x i8*], [8 x i8], [16 x [3 x %struct.x264_weight_t]], [16 x i8*], i32, %struct.x264_frame*, i8*, i8*, [2 x [2 x i16]*], [2 x i16]*, [2 x [17 x [2 x i16]*]], [18 x [18 x i16*]], [2 x [17 x i32*]], [2 x i8*], [2 x i32], [2 x [16 x i32]], [2 x i16], [18 x [18 x i32]], [18 x [18 x i32]], i32, [18 x i32], [18 x [18 x i32*]], i32*, i32*, float*, float*, float*, i32, i16*, i16*, i16*, i32, [18 x float], i32, i64, %struct.x264_hrd_t, [251 x i8], [251 x i32], [251 x double], i32, i32, i32, i32, i32, i32, i32, float, i32, i32, i32 }
%struct.x264_param_t = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.anon, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, [16 x i8], [16 x i8], [16 x i8], [16 x i8], [64 x i8], [64 x i8], void (i8*, i32, i8*, %struct.__va_list_tag*)*, i8*, i32, i32, i8*, %struct.anon.0, %struct.anon.1, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, void (i8*)* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !15, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "x264_src/common/frame.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pic_struct_e", file: !4, line: 483, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "x264_src/x264.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14}
!7 = !DIEnumerator(name: "PIC_STRUCT_AUTO", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "PIC_STRUCT_PROGRESSIVE", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "PIC_STRUCT_TOP_BOTTOM", value: 4, isUnsigned: true)
!10 = !DIEnumerator(name: "PIC_STRUCT_BOTTOM_TOP", value: 5, isUnsigned: true)
!11 = !DIEnumerator(name: "PIC_STRUCT_TOP_BOTTOM_TOP", value: 6, isUnsigned: true)
!12 = !DIEnumerator(name: "PIC_STRUCT_BOTTOM_TOP_BOTTOM", value: 7, isUnsigned: true)
!13 = !DIEnumerator(name: "PIC_STRUCT_DOUBLE", value: 8, isUnsigned: true)
!14 = !DIEnumerator(name: "PIC_STRUCT_TRIPLE", value: 9, isUnsigned: true)
!15 = !{!16}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !18, line: 25, baseType: !19)
!18 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !20, line: 40, baseType: !21)
!20 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!21 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!22 = !{i32 7, !"Dwarf Version", i32 4}
!23 = !{i32 2, !"Debug Info Version", i32 3}
!24 = !{i32 1, !"wchar_size", i32 4}
!25 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!26 = distinct !DISubprogram(name: "x264_frame_new", scope: !1, file: !1, line: 29, type: !27, scopeLine: 30, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1337)
!27 = !DISubroutineType(types: !28)
!28 = !{!29, !375, !35}
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_frame_t", file: !31, line: 146, baseType: !32)
!31 = !DIFile(filename: "x264_src/common/frame.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_frame", file: !31, line: 31, size: 125056, elements: !33)
!33 = !{!34, !36, !37, !38, !43, !44, !45, !46, !47, !48, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !242, !243, !244, !245, !246, !247, !250, !254, !255, !256, !257, !258, !286, !288, !289, !291, !296, !297, !301, !302, !306, !310, !313, !315, !316, !319, !320, !322, !323, !324, !327, !329, !330, !331, !333, !334, !335, !336, !337, !338, !339, !340, !342, !343, !347, !356, !360, !362, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !32, file: !31, line: 34, baseType: !35, size: 32)
!35 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !32, file: !31, line: 35, baseType: !35, size: 32, offset: 32)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !32, file: !31, line: 36, baseType: !35, size: 32, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !32, file: !31, line: 37, baseType: !39, size: 64, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !40, line: 27, baseType: !41)
!40 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !20, line: 44, baseType: !42)
!42 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts", scope: !32, file: !31, line: 38, baseType: !39, size: 64, offset: 192)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "i_duration", scope: !32, file: !31, line: 39, baseType: !35, size: 32, offset: 256)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_duration", scope: !32, file: !31, line: 40, baseType: !35, size: 32, offset: 288)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !32, file: !31, line: 41, baseType: !35, size: 32, offset: 320)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay", scope: !32, file: !31, line: 42, baseType: !35, size: 32, offset: 352)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !32, file: !31, line: 43, baseType: !49, size: 64, offset: 384)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !4, line: 376, baseType: !51)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !4, line: 176, size: 5632, elements: !52)
!52 = !{!53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !96, !103, !104, !105, !106, !110, !111, !125, !126, !127, !128, !129, !160, !202, !203, !204, !205, !206, !207, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !51, file: !4, line: 179, baseType: !5, size: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !51, file: !4, line: 180, baseType: !35, size: 32, offset: 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !51, file: !4, line: 181, baseType: !35, size: 32, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !51, file: !4, line: 182, baseType: !35, size: 32, offset: 96)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !51, file: !4, line: 183, baseType: !35, size: 32, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !51, file: !4, line: 186, baseType: !35, size: 32, offset: 160)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !51, file: !4, line: 187, baseType: !35, size: 32, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !51, file: !4, line: 188, baseType: !35, size: 32, offset: 224)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !51, file: !4, line: 189, baseType: !35, size: 32, offset: 256)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !51, file: !4, line: 190, baseType: !35, size: 32, offset: 288)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !51, file: !4, line: 198, baseType: !35, size: 32, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !51, file: !4, line: 215, baseType: !65, size: 288, offset: 352)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !51, file: !4, line: 200, size: 288, elements: !66)
!66 = !{!67, !68, !69, !70, !71, !72, !73, !74, !75}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !65, file: !4, line: 203, baseType: !35, size: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !65, file: !4, line: 204, baseType: !35, size: 32, offset: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !65, file: !4, line: 206, baseType: !35, size: 32, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !65, file: !4, line: 209, baseType: !35, size: 32, offset: 96)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !65, file: !4, line: 210, baseType: !35, size: 32, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !65, file: !4, line: 211, baseType: !35, size: 32, offset: 160)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !65, file: !4, line: 212, baseType: !35, size: 32, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !65, file: !4, line: 213, baseType: !35, size: 32, offset: 224)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !65, file: !4, line: 214, baseType: !35, size: 32, offset: 256)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !51, file: !4, line: 218, baseType: !35, size: 32, offset: 640)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !51, file: !4, line: 219, baseType: !35, size: 32, offset: 672)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !51, file: !4, line: 220, baseType: !35, size: 32, offset: 704)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !51, file: !4, line: 221, baseType: !35, size: 32, offset: 736)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !51, file: !4, line: 222, baseType: !35, size: 32, offset: 768)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !51, file: !4, line: 224, baseType: !35, size: 32, offset: 800)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !51, file: !4, line: 225, baseType: !35, size: 32, offset: 832)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !51, file: !4, line: 226, baseType: !35, size: 32, offset: 864)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !51, file: !4, line: 227, baseType: !35, size: 32, offset: 896)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !51, file: !4, line: 229, baseType: !35, size: 32, offset: 928)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !51, file: !4, line: 230, baseType: !35, size: 32, offset: 960)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !51, file: !4, line: 231, baseType: !35, size: 32, offset: 992)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !51, file: !4, line: 233, baseType: !35, size: 32, offset: 1024)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !51, file: !4, line: 234, baseType: !35, size: 32, offset: 1056)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !51, file: !4, line: 236, baseType: !35, size: 32, offset: 1088)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !51, file: !4, line: 237, baseType: !35, size: 32, offset: 1120)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !51, file: !4, line: 239, baseType: !35, size: 32, offset: 1152)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !51, file: !4, line: 240, baseType: !94, size: 64, offset: 1216)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !51, file: !4, line: 241, baseType: !97, size: 128, offset: 1280)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 128, elements: !101)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !18, line: 24, baseType: !99)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !20, line: 38, baseType: !100)
!100 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!101 = !{!102}
!102 = !DISubrange(count: 16)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !51, file: !4, line: 242, baseType: !97, size: 128, offset: 1408)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !51, file: !4, line: 243, baseType: !97, size: 128, offset: 1536)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !51, file: !4, line: 244, baseType: !97, size: 128, offset: 1664)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !51, file: !4, line: 245, baseType: !107, size: 512, offset: 1792)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 512, elements: !108)
!108 = !{!109}
!109 = !DISubrange(count: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !51, file: !4, line: 246, baseType: !107, size: 512, offset: 2304)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !51, file: !4, line: 249, baseType: !112, size: 64, offset: 2816)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{null, !115, !35, !116, !118}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, elements: !120)
!120 = !{!121, !122, !123, !124}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !119, file: !1, baseType: !5, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !119, file: !1, baseType: !5, size: 32, offset: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !119, file: !1, baseType: !115, size: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !119, file: !1, baseType: !115, size: 64, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !51, file: !4, line: 250, baseType: !115, size: 64, offset: 2880)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !51, file: !4, line: 251, baseType: !35, size: 32, offset: 2944)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !51, file: !4, line: 252, baseType: !35, size: 32, offset: 2976)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !51, file: !4, line: 253, baseType: !94, size: 64, offset: 3008)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !51, file: !4, line: 287, baseType: !130, size: 800, offset: 3072)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !51, file: !4, line: 256, size: 800, elements: !131)
!131 = !{!132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !152, !153, !154, !158, !159}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !130, file: !4, line: 258, baseType: !5, size: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !130, file: !4, line: 259, baseType: !5, size: 32, offset: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !130, file: !4, line: 261, baseType: !35, size: 32, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !130, file: !4, line: 262, baseType: !35, size: 32, offset: 96)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !130, file: !4, line: 263, baseType: !35, size: 32, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !130, file: !4, line: 264, baseType: !35, size: 32, offset: 160)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !130, file: !4, line: 265, baseType: !35, size: 32, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !130, file: !4, line: 267, baseType: !35, size: 32, offset: 224)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !130, file: !4, line: 268, baseType: !35, size: 32, offset: 256)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !130, file: !4, line: 269, baseType: !35, size: 32, offset: 288)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !130, file: !4, line: 270, baseType: !35, size: 32, offset: 320)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !130, file: !4, line: 271, baseType: !35, size: 32, offset: 352)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !130, file: !4, line: 272, baseType: !35, size: 32, offset: 384)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !130, file: !4, line: 273, baseType: !35, size: 32, offset: 416)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !130, file: !4, line: 274, baseType: !35, size: 32, offset: 448)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !130, file: !4, line: 275, baseType: !35, size: 32, offset: 480)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !130, file: !4, line: 276, baseType: !35, size: 32, offset: 512)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !130, file: !4, line: 277, baseType: !35, size: 32, offset: 544)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !130, file: !4, line: 278, baseType: !151, size: 32, offset: 576)
!151 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !130, file: !4, line: 279, baseType: !151, size: 32, offset: 608)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !130, file: !4, line: 280, baseType: !35, size: 32, offset: 640)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !130, file: !4, line: 283, baseType: !155, size: 64, offset: 672)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 64, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 2)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !130, file: !4, line: 285, baseType: !35, size: 32, offset: 736)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !130, file: !4, line: 286, baseType: !35, size: 32, offset: 768)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !51, file: !4, line: 327, baseType: !161, size: 1152, offset: 3904)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !51, file: !4, line: 290, size: 1152, elements: !162)
!162 = !{!163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !200, !201}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !161, file: !4, line: 292, baseType: !35, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !161, file: !4, line: 294, baseType: !35, size: 32, offset: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !161, file: !4, line: 295, baseType: !35, size: 32, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !161, file: !4, line: 296, baseType: !35, size: 32, offset: 96)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !161, file: !4, line: 297, baseType: !35, size: 32, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !161, file: !4, line: 299, baseType: !35, size: 32, offset: 160)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !161, file: !4, line: 300, baseType: !151, size: 32, offset: 192)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !161, file: !4, line: 301, baseType: !151, size: 32, offset: 224)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !161, file: !4, line: 302, baseType: !151, size: 32, offset: 256)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !161, file: !4, line: 303, baseType: !35, size: 32, offset: 288)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !161, file: !4, line: 304, baseType: !35, size: 32, offset: 320)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !161, file: !4, line: 305, baseType: !151, size: 32, offset: 352)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !161, file: !4, line: 306, baseType: !151, size: 32, offset: 384)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !161, file: !4, line: 307, baseType: !151, size: 32, offset: 416)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !161, file: !4, line: 309, baseType: !35, size: 32, offset: 448)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !161, file: !4, line: 310, baseType: !151, size: 32, offset: 480)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !161, file: !4, line: 311, baseType: !35, size: 32, offset: 512)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !161, file: !4, line: 312, baseType: !35, size: 32, offset: 544)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !161, file: !4, line: 315, baseType: !35, size: 32, offset: 576)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !161, file: !4, line: 316, baseType: !94, size: 64, offset: 640)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !161, file: !4, line: 317, baseType: !35, size: 32, offset: 704)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !161, file: !4, line: 318, baseType: !94, size: 64, offset: 768)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !161, file: !4, line: 321, baseType: !151, size: 32, offset: 832)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !161, file: !4, line: 322, baseType: !151, size: 32, offset: 864)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !161, file: !4, line: 323, baseType: !151, size: 32, offset: 896)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !161, file: !4, line: 324, baseType: !189, size: 64, offset: 960)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !4, line: 174, baseType: !191)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 167, size: 256, elements: !192)
!192 = !{!193, !194, !195, !196, !197, !198}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !191, file: !4, line: 169, baseType: !35, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !191, file: !4, line: 169, baseType: !35, size: 32, offset: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !191, file: !4, line: 170, baseType: !35, size: 32, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !191, file: !4, line: 171, baseType: !35, size: 32, offset: 96)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !191, file: !4, line: 172, baseType: !151, size: 32, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !191, file: !4, line: 173, baseType: !199, size: 64, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !161, file: !4, line: 325, baseType: !35, size: 32, offset: 1024)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !161, file: !4, line: 326, baseType: !94, size: 64, offset: 1088)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !51, file: !4, line: 330, baseType: !35, size: 32, offset: 5056)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !51, file: !4, line: 331, baseType: !35, size: 32, offset: 5088)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !51, file: !4, line: 332, baseType: !35, size: 32, offset: 5120)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !51, file: !4, line: 334, baseType: !35, size: 32, offset: 5152)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !51, file: !4, line: 335, baseType: !35, size: 32, offset: 5184)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !51, file: !4, line: 336, baseType: !208, size: 32, offset: 5216)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !18, line: 26, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !20, line: 42, baseType: !5)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !51, file: !4, line: 337, baseType: !208, size: 32, offset: 5248)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !51, file: !4, line: 338, baseType: !208, size: 32, offset: 5280)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !51, file: !4, line: 339, baseType: !208, size: 32, offset: 5312)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !51, file: !4, line: 340, baseType: !35, size: 32, offset: 5344)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !51, file: !4, line: 344, baseType: !35, size: 32, offset: 5376)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !51, file: !4, line: 356, baseType: !35, size: 32, offset: 5408)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !51, file: !4, line: 364, baseType: !35, size: 32, offset: 5440)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !51, file: !4, line: 367, baseType: !35, size: 32, offset: 5472)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !51, file: !4, line: 368, baseType: !35, size: 32, offset: 5504)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !51, file: !4, line: 369, baseType: !35, size: 32, offset: 5536)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !51, file: !4, line: 375, baseType: !221, size: 64, offset: 5568)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{null, !115}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !32, file: !31, line: 45, baseType: !35, size: 32, offset: 448)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded", scope: !32, file: !31, line: 46, baseType: !35, size: 32, offset: 480)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "i_field_cnt", scope: !32, file: !31, line: 47, baseType: !35, size: 32, offset: 512)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !32, file: !31, line: 48, baseType: !35, size: 32, offset: 544)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "b_kept_as_ref", scope: !32, file: !31, line: 49, baseType: !35, size: 32, offset: 576)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_struct", scope: !32, file: !31, line: 50, baseType: !35, size: 32, offset: 608)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "b_keyframe", scope: !32, file: !31, line: 51, baseType: !35, size: 32, offset: 640)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "b_fdec", scope: !32, file: !31, line: 52, baseType: !98, size: 8, offset: 672)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_minigop_bframe", scope: !32, file: !31, line: 53, baseType: !98, size: 8, offset: 680)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframes", scope: !32, file: !31, line: 54, baseType: !98, size: 8, offset: 688)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_rc", scope: !32, file: !31, line: 55, baseType: !151, size: 32, offset: 704)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_aq", scope: !32, file: !31, line: 56, baseType: !151, size: 32, offset: 736)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_l0ref0", scope: !32, file: !31, line: 57, baseType: !35, size: 32, offset: 768)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !32, file: !31, line: 60, baseType: !35, size: 32, offset: 800)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !32, file: !31, line: 61, baseType: !239, size: 96, offset: 832)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 96, elements: !240)
!240 = !{!241}
!241 = !DISubrange(count: 3)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !32, file: !31, line: 62, baseType: !239, size: 96, offset: 928)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines", scope: !32, file: !31, line: 63, baseType: !239, size: 96, offset: 1024)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride_lowres", scope: !32, file: !31, line: 64, baseType: !35, size: 32, offset: 1120)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "i_width_lowres", scope: !32, file: !31, line: 65, baseType: !35, size: 32, offset: 1152)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_lowres", scope: !32, file: !31, line: 66, baseType: !35, size: 32, offset: 1184)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !32, file: !31, line: 67, baseType: !248, size: 192, offset: 1216)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 192, elements: !240)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "filtered", scope: !32, file: !31, line: 68, baseType: !251, size: 256, offset: 1408)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 256, elements: !252)
!252 = !{!253}
!253 = !DISubrange(count: 4)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !32, file: !31, line: 69, baseType: !251, size: 256, offset: 1664)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "integral", scope: !32, file: !31, line: 70, baseType: !16, size: 64, offset: 1920)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !32, file: !31, line: 74, baseType: !251, size: 256, offset: 1984)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_lowres", scope: !32, file: !31, line: 75, baseType: !251, size: 256, offset: 2240)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !32, file: !31, line: 77, baseType: !259, size: 24576, offset: 2560)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 24576, elements: !285)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_weight_t", file: !261, line: 36, baseType: !262, align: 128)
!261 = !DIFile(filename: "x264_src/common/mc.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_weight_t", file: !261, line: 26, size: 512, elements: !263)
!263 = !{!264, !271, !272, !275, !276, !277}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "cachea", scope: !262, file: !261, line: 30, baseType: !265, size: 128, align: 128)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 128, elements: !269)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !40, line: 25, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !20, line: 39, baseType: !268)
!268 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!269 = !{!270}
!270 = !DISubrange(count: 8)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "cacheb", scope: !262, file: !261, line: 31, baseType: !265, size: 128, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "i_denom", scope: !262, file: !261, line: 32, baseType: !273, size: 32, offset: 256)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !40, line: 26, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !20, line: 41, baseType: !35)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "i_scale", scope: !262, file: !261, line: 33, baseType: !273, size: 32, offset: 288)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset", scope: !262, file: !261, line: 34, baseType: !273, size: 32, offset: 320)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "weightfn", scope: !262, file: !261, line: 35, baseType: !278, size: 64, offset: 384)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "weight_fn_t", file: !261, line: 25, baseType: !280)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DISubroutineType(types: !282)
!282 = !{null, !249, !35, !249, !35, !283, !35}
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !262)
!285 = !{!102, !241}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "weighted", scope: !32, file: !31, line: 78, baseType: !287, size: 1024, offset: 27136)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 1024, elements: !101)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "b_duplicate", scope: !32, file: !31, line: 79, baseType: !35, size: 32, offset: 28160)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !32, file: !31, line: 80, baseType: !290, size: 64, offset: 28224)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !32, file: !31, line: 83, baseType: !292, size: 64, offset: 28288)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !40, line: 24, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !20, line: 37, baseType: !295)
!295 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "mb_partition", scope: !32, file: !31, line: 84, baseType: !249, size: 64, offset: 28352)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !32, file: !31, line: 85, baseType: !298, size: 128, offset: 28416)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 128, elements: !156)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 32, elements: !156)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "mv16x16", scope: !32, file: !31, line: 86, baseType: !299, size: 64, offset: 28544)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mvs", scope: !32, file: !31, line: 87, baseType: !303, size: 2176, offset: 28608)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 2176, elements: !304)
!304 = !{!157, !305}
!305 = !DISubrange(count: 17)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_costs", scope: !32, file: !31, line: 92, baseType: !307, size: 20736, offset: 30784)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 20736, elements: !308)
!308 = !{!309, !309}
!309 = !DISubrange(count: 18)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mv_costs", scope: !32, file: !31, line: 96, baseType: !311, size: 2176, offset: 51520)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !312, size: 2176, elements: !304)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !32, file: !31, line: 97, baseType: !314, size: 128, offset: 53696)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 128, elements: !156)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref", scope: !32, file: !31, line: 98, baseType: !155, size: 64, offset: 53824)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc", scope: !32, file: !31, line: 99, baseType: !317, size: 1024, offset: 53888)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 1024, elements: !318)
!318 = !{!157, !102}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "inv_ref_poc", scope: !32, file: !31, line: 100, baseType: !300, size: 32, offset: 54912)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est", scope: !32, file: !31, line: 105, baseType: !321, size: 10368, offset: 54944)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 10368, elements: !308)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est_aq", scope: !32, file: !31, line: 106, baseType: !321, size: 10368, offset: 65312)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "i_satd", scope: !32, file: !31, line: 107, baseType: !35, size: 32, offset: 75680)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_mbs", scope: !32, file: !31, line: 108, baseType: !325, size: 576, offset: 75712)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 576, elements: !326)
!326 = !{!309}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satds", scope: !32, file: !31, line: 109, baseType: !328, size: 20736, offset: 76288)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !312, size: 20736, elements: !308)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satd", scope: !32, file: !31, line: 110, baseType: !312, size: 64, offset: 97024)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_bits", scope: !32, file: !31, line: 111, baseType: !312, size: 64, offset: 97088)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "f_row_qp", scope: !32, file: !31, line: 112, baseType: !332, size: 64, offset: 97152)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset", scope: !32, file: !31, line: 113, baseType: !332, size: 64, offset: 97216)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset_aq", scope: !32, file: !31, line: 114, baseType: !332, size: 64, offset: 97280)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_calculated", scope: !32, file: !31, line: 115, baseType: !35, size: 32, offset: 97344)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !32, file: !31, line: 116, baseType: !16, size: 64, offset: 97408)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "i_propagate_cost", scope: !32, file: !31, line: 117, baseType: !16, size: 64, offset: 97472)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "i_inv_qscale_factor", scope: !32, file: !31, line: 118, baseType: !16, size: 64, offset: 97536)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "b_scenecut", scope: !32, file: !31, line: 119, baseType: !35, size: 32, offset: 97600)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "f_weighted_cost_delta", scope: !32, file: !31, line: 120, baseType: !341, size: 576, offset: 97632)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 576, elements: !326)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_sum", scope: !32, file: !31, line: 121, baseType: !208, size: 32, offset: 98208)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_ssd", scope: !32, file: !31, line: 122, baseType: !344, size: 64, offset: 98240)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !18, line: 27, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !20, line: 45, baseType: !346)
!346 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "hrd_timing", scope: !32, file: !31, line: 125, baseType: !348, size: 256, offset: 98304)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_hrd_t", file: !4, line: 503, baseType: !349)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 496, size: 256, elements: !350)
!350 = !{!351, !353, !354, !355}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_initial_arrival_time", scope: !349, file: !4, line: 498, baseType: !352, size: 64)
!352 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_final_arrival_time", scope: !349, file: !4, line: 499, baseType: !352, size: 64, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_time", scope: !349, file: !4, line: 500, baseType: !352, size: 64, offset: 128)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_time", scope: !349, file: !4, line: 502, baseType: !352, size: 64, offset: 192)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_type", scope: !32, file: !31, line: 128, baseType: !357, size: 2008, offset: 98560)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 2008, elements: !358)
!358 = !{!359}
!359 = !DISubrange(count: 251)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_satd", scope: !32, file: !31, line: 129, baseType: !361, size: 8032, offset: 100576)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 8032, elements: !358)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "f_planned_cpb_duration", scope: !32, file: !31, line: 130, baseType: !363, size: 16064, offset: 108608)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, size: 16064, elements: !358)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !32, file: !31, line: 131, baseType: !35, size: 32, offset: 124672)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !32, file: !31, line: 132, baseType: !35, size: 32, offset: 124704)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_completed", scope: !32, file: !31, line: 135, baseType: !35, size: 32, offset: 124736)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_weighted", scope: !32, file: !31, line: 136, baseType: !35, size: 32, offset: 124768)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "i_reference_count", scope: !32, file: !31, line: 137, baseType: !35, size: 32, offset: 124800)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !32, file: !31, line: 138, baseType: !35, size: 32, offset: 124832)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !32, file: !31, line: 139, baseType: !35, size: 32, offset: 124864)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "f_pir_position", scope: !32, file: !31, line: 142, baseType: !151, size: 32, offset: 124896)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_start_col", scope: !32, file: !31, line: 143, baseType: !35, size: 32, offset: 124928)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_end_col", scope: !32, file: !31, line: 144, baseType: !35, size: 32, offset: 124960)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "i_frames_since_pir", scope: !32, file: !31, line: 145, baseType: !35, size: 32, offset: 124992)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_t", file: !4, line: 46, baseType: !377)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_t", file: !378, line: 381, size: 266752, elements: !379)
!378 = !DIFile(filename: "x264_src/common/common.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!379 = !{!380, !381, !385, !386, !387, !388, !389, !390, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !524, !526, !554, !556, !557, !558, !562, !566, !567, !568, !572, !576, !577, !578, !582, !585, !586, !637, !654, !679, !680, !681, !682, !686, !687, !688, !689, !690, !691, !692, !707, !901, !905, !966, !969, !971, !973, !974, !977, !982, !991, !992, !1000, !1002, !1007, !1083, !1169, !1213, !1235, !1284, !1313}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !377, file: !378, line: 384, baseType: !50, size: 5632)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !377, file: !378, line: 386, baseType: !382, size: 8256, offset: 5632)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !375, size: 8256, elements: !383)
!383 = !{!384}
!384 = !DISubrange(count: 129)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "thread_handle", scope: !377, file: !378, line: 387, baseType: !35, size: 32, offset: 13888)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "b_thread_active", scope: !377, file: !378, line: 388, baseType: !35, size: 32, offset: 13920)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_phase", scope: !377, file: !378, line: 389, baseType: !35, size: 32, offset: 13952)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_start", scope: !377, file: !378, line: 390, baseType: !35, size: 32, offset: 13984)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_end", scope: !377, file: !378, line: 391, baseType: !35, size: 32, offset: 14016)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !377, file: !378, line: 402, baseType: !391, size: 576, offset: 14080)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !377, file: !378, line: 394, size: 576, elements: !392)
!392 = !{!393, !394, !395, !404, !405, !406}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal", scope: !391, file: !378, line: 396, baseType: !35, size: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "i_nals_allocated", scope: !391, file: !378, line: 397, baseType: !35, size: 32, offset: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "nal", scope: !391, file: !378, line: 398, baseType: !396, size: 64, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !4, line: 604, baseType: !398)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 593, size: 192, elements: !399)
!399 = !{!400, !401, !402, !403}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !398, file: !4, line: 595, baseType: !35, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !398, file: !4, line: 596, baseType: !35, size: 32, offset: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !398, file: !4, line: 599, baseType: !35, size: 32, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !398, file: !4, line: 603, baseType: !249, size: 64, offset: 128)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitstream", scope: !391, file: !378, line: 399, baseType: !35, size: 32, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "p_bitstream", scope: !391, file: !378, line: 400, baseType: !249, size: 64, offset: 192)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !391, file: !378, line: 401, baseType: !407, size: 320, offset: 256)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "bs_t", file: !408, line: 56, baseType: !409)
!408 = !DIFile(filename: "x264_src/common/bs.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bs_s", file: !408, line: 47, size: 320, elements: !410)
!410 = !{!411, !412, !413, !414, !417, !418}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !409, file: !408, line: 49, baseType: !249, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !409, file: !408, line: 50, baseType: !249, size: 64, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !409, file: !408, line: 51, baseType: !249, size: 64, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "cur_bits", scope: !409, file: !408, line: 53, baseType: !415, size: 64, offset: 192)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !416, line: 87, baseType: !42)
!416 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!417 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !409, file: !408, line: 54, baseType: !35, size: 32, offset: 256)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "i_bits_encoded", scope: !409, file: !408, line: 55, baseType: !35, size: 32, offset: 288)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer", scope: !377, file: !378, line: 404, baseType: !249, size: 64, offset: 14656)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer_size", scope: !377, file: !378, line: 405, baseType: !35, size: 32, offset: 14720)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !377, file: !378, line: 410, baseType: !35, size: 32, offset: 14752)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !377, file: !378, line: 411, baseType: !35, size: 32, offset: 14784)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_frames", scope: !377, file: !378, line: 413, baseType: !35, size: 32, offset: 14816)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_type", scope: !377, file: !378, line: 415, baseType: !35, size: 32, offset: 14848)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_ref_idc", scope: !377, file: !378, line: 416, baseType: !35, size: 32, offset: 14880)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields", scope: !377, file: !378, line: 418, baseType: !35, size: 32, offset: 14912)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields_last_frame", scope: !377, file: !378, line: 419, baseType: !35, size: 32, offset: 14944)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_duration", scope: !377, file: !378, line: 420, baseType: !35, size: 32, offset: 14976)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields", scope: !377, file: !378, line: 421, baseType: !35, size: 32, offset: 15008)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !377, file: !378, line: 422, baseType: !35, size: 32, offset: 15040)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !377, file: !378, line: 424, baseType: !35, size: 32, offset: 15072)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !377, file: !378, line: 425, baseType: !35, size: 32, offset: 15104)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "b_queued_intra_refresh", scope: !377, file: !378, line: 427, baseType: !35, size: 32, offset: 15136)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "sps_array", scope: !377, file: !378, line: 430, baseType: !435, size: 10400, offset: 15168)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !436, size: 10400, elements: !522)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_sps_t", file: !437, line: 154, baseType: !438)
!437 = !DIFile(filename: "x264_src/common/set.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !437, line: 52, size: 10400, elements: !439)
!439 = !{!440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !457, !458, !459, !460, !461, !462, !463, !464, !465, !472, !473, !521}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !438, file: !437, line: 54, baseType: !35, size: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "i_profile_idc", scope: !438, file: !437, line: 56, baseType: !35, size: 32, offset: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !438, file: !437, line: 57, baseType: !35, size: 32, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set0", scope: !438, file: !437, line: 59, baseType: !35, size: 32, offset: 96)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set1", scope: !438, file: !437, line: 60, baseType: !35, size: 32, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set2", scope: !438, file: !437, line: 61, baseType: !35, size: 32, offset: 160)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_frame_num", scope: !438, file: !437, line: 63, baseType: !35, size: 32, offset: 192)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_type", scope: !438, file: !437, line: 65, baseType: !35, size: 32, offset: 224)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_poc_lsb", scope: !438, file: !437, line: 67, baseType: !35, size: 32, offset: 256)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "b_delta_pic_order_always_zero", scope: !438, file: !437, line: 69, baseType: !35, size: 32, offset: 288)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_non_ref_pic", scope: !438, file: !437, line: 70, baseType: !35, size: 32, offset: 320)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_top_to_bottom_field", scope: !438, file: !437, line: 71, baseType: !35, size: 32, offset: 352)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames_in_poc_cycle", scope: !438, file: !437, line: 72, baseType: !35, size: 32, offset: 384)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_ref_frame", scope: !438, file: !437, line: 73, baseType: !454, size: 8192, offset: 416)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 8192, elements: !455)
!455 = !{!456}
!456 = !DISubrange(count: 256)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames", scope: !438, file: !437, line: 75, baseType: !35, size: 32, offset: 8608)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "b_gaps_in_frame_num_value_allowed", scope: !438, file: !437, line: 76, baseType: !35, size: 32, offset: 8640)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_width", scope: !438, file: !437, line: 77, baseType: !35, size: 32, offset: 8672)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_height", scope: !438, file: !437, line: 78, baseType: !35, size: 32, offset: 8704)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_mbs_only", scope: !438, file: !437, line: 79, baseType: !35, size: 32, offset: 8736)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_adaptive_frame_field", scope: !438, file: !437, line: 80, baseType: !35, size: 32, offset: 8768)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct8x8_inference", scope: !438, file: !437, line: 81, baseType: !35, size: 32, offset: 8800)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "b_crop", scope: !438, file: !437, line: 83, baseType: !35, size: 32, offset: 8832)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !438, file: !437, line: 90, baseType: !466, size: 128, offset: 8864)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !438, file: !437, line: 84, size: 128, elements: !467)
!467 = !{!468, !469, !470, !471}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !466, file: !437, line: 86, baseType: !35, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "i_right", scope: !466, file: !437, line: 87, baseType: !35, size: 32, offset: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "i_top", scope: !466, file: !437, line: 88, baseType: !35, size: 32, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "i_bottom", scope: !466, file: !437, line: 89, baseType: !35, size: 32, offset: 96)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "b_vui", scope: !438, file: !437, line: 92, baseType: !35, size: 32, offset: 8992)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !438, file: !437, line: 150, baseType: !474, size: 1344, offset: 9024)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !438, file: !437, line: 93, size: 1344, elements: !475)
!475 = !{!476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !512, !513, !514, !515, !516, !517, !518, !519, !520}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "b_aspect_ratio_info_present", scope: !474, file: !437, line: 95, baseType: !35, size: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !474, file: !437, line: 96, baseType: !35, size: 32, offset: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !474, file: !437, line: 97, baseType: !35, size: 32, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info_present", scope: !474, file: !437, line: 99, baseType: !35, size: 32, offset: 96)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info", scope: !474, file: !437, line: 100, baseType: !35, size: 32, offset: 128)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "b_signal_type_present", scope: !474, file: !437, line: 102, baseType: !35, size: 32, offset: 160)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !474, file: !437, line: 103, baseType: !35, size: 32, offset: 192)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !474, file: !437, line: 104, baseType: !35, size: 32, offset: 224)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "b_color_description_present", scope: !474, file: !437, line: 105, baseType: !35, size: 32, offset: 256)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !474, file: !437, line: 106, baseType: !35, size: 32, offset: 288)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !474, file: !437, line: 107, baseType: !35, size: 32, offset: 320)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !474, file: !437, line: 108, baseType: !35, size: 32, offset: 352)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_loc_info_present", scope: !474, file: !437, line: 110, baseType: !35, size: 32, offset: 384)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_top", scope: !474, file: !437, line: 111, baseType: !35, size: 32, offset: 416)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_bottom", scope: !474, file: !437, line: 112, baseType: !35, size: 32, offset: 448)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "b_timing_info_present", scope: !474, file: !437, line: 114, baseType: !35, size: 32, offset: 480)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_units_in_tick", scope: !474, file: !437, line: 115, baseType: !208, size: 32, offset: 512)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_scale", scope: !474, file: !437, line: 116, baseType: !208, size: 32, offset: 544)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "b_fixed_frame_rate", scope: !474, file: !437, line: 117, baseType: !35, size: 32, offset: 576)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "b_nal_hrd_parameters_present", scope: !474, file: !437, line: 119, baseType: !35, size: 32, offset: 608)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "b_vcl_hrd_parameters_present", scope: !474, file: !437, line: 120, baseType: !35, size: 32, offset: 640)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "hrd", scope: !474, file: !437, line: 137, baseType: !498, size: 384, offset: 672)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !474, file: !437, line: 122, size: 384, elements: !499)
!499 = !{!500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_cnt", scope: !498, file: !437, line: 124, baseType: !35, size: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_scale", scope: !498, file: !437, line: 125, baseType: !35, size: 32, offset: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_scale", scope: !498, file: !437, line: 126, baseType: !35, size: 32, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_value", scope: !498, file: !437, line: 127, baseType: !35, size: 32, offset: 96)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_value", scope: !498, file: !437, line: 128, baseType: !35, size: 32, offset: 128)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_unscaled", scope: !498, file: !437, line: 129, baseType: !35, size: 32, offset: 160)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_unscaled", scope: !498, file: !437, line: 130, baseType: !35, size: 32, offset: 192)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "b_cbr_hrd", scope: !498, file: !437, line: 131, baseType: !35, size: 32, offset: 224)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "i_initial_cpb_removal_delay_length", scope: !498, file: !437, line: 133, baseType: !35, size: 32, offset: 256)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_removal_delay_length", scope: !498, file: !437, line: 134, baseType: !35, size: 32, offset: 288)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay_length", scope: !498, file: !437, line: 135, baseType: !35, size: 32, offset: 320)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_offset_length", scope: !498, file: !437, line: 136, baseType: !35, size: 32, offset: 352)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct_present", scope: !474, file: !437, line: 139, baseType: !35, size: 32, offset: 1056)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "b_bitstream_restriction", scope: !474, file: !437, line: 140, baseType: !35, size: 32, offset: 1088)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "b_motion_vectors_over_pic_boundaries", scope: !474, file: !437, line: 141, baseType: !35, size: 32, offset: 1120)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bytes_per_pic_denom", scope: !474, file: !437, line: 142, baseType: !35, size: 32, offset: 1152)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bits_per_mb_denom", scope: !474, file: !437, line: 143, baseType: !35, size: 32, offset: 1184)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_horizontal", scope: !474, file: !437, line: 144, baseType: !35, size: 32, offset: 1216)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_vertical", scope: !474, file: !437, line: 145, baseType: !35, size: 32, offset: 1248)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_reorder_frames", scope: !474, file: !437, line: 146, baseType: !35, size: 32, offset: 1280)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dec_frame_buffering", scope: !474, file: !437, line: 147, baseType: !35, size: 32, offset: 1312)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "b_qpprime_y_zero_transform_bypass", scope: !438, file: !437, line: 152, baseType: !35, size: 32, offset: 10368)
!522 = !{!523}
!523 = !DISubrange(count: 1)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !377, file: !378, line: 431, baseType: !525, size: 64, offset: 25600)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "pps_array", scope: !377, file: !378, line: 432, baseType: !527, size: 960, offset: 25664)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 960, elements: !522)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pps_t", file: !437, line: 186, baseType: !529)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !437, line: 156, size: 960, elements: !530)
!530 = !{!531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !529, file: !437, line: 158, baseType: !35, size: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !529, file: !437, line: 159, baseType: !35, size: 32, offset: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !529, file: !437, line: 161, baseType: !35, size: 32, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_order", scope: !529, file: !437, line: 163, baseType: !35, size: 32, offset: 96)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_slice_groups", scope: !529, file: !437, line: 164, baseType: !35, size: 32, offset: 128)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_default_active", scope: !529, file: !437, line: 166, baseType: !35, size: 32, offset: 160)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_default_active", scope: !529, file: !437, line: 167, baseType: !35, size: 32, offset: 192)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_pred", scope: !529, file: !437, line: 169, baseType: !35, size: 32, offset: 224)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !529, file: !437, line: 170, baseType: !35, size: 32, offset: 256)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qp", scope: !529, file: !437, line: 172, baseType: !35, size: 32, offset: 288)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qs", scope: !529, file: !437, line: 173, baseType: !35, size: 32, offset: 320)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_index_offset", scope: !529, file: !437, line: 175, baseType: !35, size: 32, offset: 352)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter_control", scope: !529, file: !437, line: 177, baseType: !35, size: 32, offset: 384)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra_pred", scope: !529, file: !437, line: 178, baseType: !35, size: 32, offset: 416)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "b_redundant_pic_cnt", scope: !529, file: !437, line: 179, baseType: !35, size: 32, offset: 448)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8_mode", scope: !529, file: !437, line: 181, baseType: !35, size: 32, offset: 480)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !529, file: !437, line: 183, baseType: !35, size: 32, offset: 512)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !529, file: !437, line: 184, baseType: !549, size: 384, offset: 576)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !550, size: 384, elements: !552)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!552 = !{!553}
!553 = !DISubrange(count: 6)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !377, file: !378, line: 433, baseType: !555, size: 64, offset: 26624)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !377, file: !378, line: 434, baseType: !35, size: 32, offset: 26688)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts_compress_multiplier", scope: !377, file: !378, line: 437, baseType: !35, size: 32, offset: 26720)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_mf", scope: !377, file: !378, line: 440, baseType: !559, size: 256, offset: 26752)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !560, size: 256, elements: !252)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 512, elements: !101)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_mf", scope: !377, file: !378, line: 441, baseType: !563, size: 128, offset: 27008)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !564, size: 128, elements: !156)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 2048, elements: !108)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "unquant4_mf", scope: !377, file: !378, line: 443, baseType: !559, size: 256, offset: 27136)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "unquant8_mf", scope: !377, file: !378, line: 444, baseType: !563, size: 128, offset: 27392)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_mf", scope: !377, file: !378, line: 446, baseType: !569, size: 256, offset: 27520)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !570, size: 256, elements: !252)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 256, elements: !101)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_mf", scope: !377, file: !378, line: 447, baseType: !573, size: 128, offset: 27776)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !574, size: 128, elements: !156)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 1024, elements: !108)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_bias", scope: !377, file: !378, line: 448, baseType: !569, size: 256, offset: 27904)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_bias", scope: !377, file: !378, line: 449, baseType: !573, size: 128, offset: 28160)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv", scope: !377, file: !378, line: 454, baseType: !579, size: 5888, offset: 28288)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 5888, elements: !580)
!580 = !{!581}
!581 = !DISubrange(count: 92)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv_fpel", scope: !377, file: !378, line: 455, baseType: !583, size: 23552, offset: 34176)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 23552, elements: !584)
!584 = !{!581, !253}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !377, file: !378, line: 457, baseType: !550, size: 64, offset: 57728)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !377, file: !378, line: 460, baseType: !587, size: 53376, offset: 57856)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_slice_header_t", file: !378, line: 364, baseType: !588)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !378, line: 302, size: 53376, elements: !589)
!589 = !{!590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !617, !621, !622, !623, !629, !630, !631, !632, !633, !634, !635, !636}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !588, file: !378, line: 304, baseType: !525, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !588, file: !378, line: 305, baseType: !555, size: 64, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !588, file: !378, line: 307, baseType: !35, size: 32, offset: 128)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "i_first_mb", scope: !588, file: !378, line: 308, baseType: !35, size: 32, offset: 160)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_mb", scope: !588, file: !378, line: 309, baseType: !35, size: 32, offset: 192)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "i_pps_id", scope: !588, file: !378, line: 311, baseType: !35, size: 32, offset: 224)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !588, file: !378, line: 313, baseType: !35, size: 32, offset: 256)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "b_mbaff", scope: !588, file: !378, line: 315, baseType: !35, size: 32, offset: 288)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "b_field_pic", scope: !588, file: !378, line: 316, baseType: !35, size: 32, offset: 320)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "b_bottom_field", scope: !588, file: !378, line: 317, baseType: !35, size: 32, offset: 352)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !588, file: !378, line: 319, baseType: !35, size: 32, offset: 384)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !588, file: !378, line: 321, baseType: !35, size: 32, offset: 416)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc_bottom", scope: !588, file: !378, line: 322, baseType: !35, size: 32, offset: 448)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc", scope: !588, file: !378, line: 324, baseType: !155, size: 64, offset: 480)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "i_redundant_pic_cnt", scope: !588, file: !378, line: 325, baseType: !35, size: 32, offset: 544)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_spatial_mv_pred", scope: !588, file: !378, line: 327, baseType: !35, size: 32, offset: 576)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "b_num_ref_idx_override", scope: !588, file: !378, line: 329, baseType: !35, size: 32, offset: 608)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !588, file: !378, line: 330, baseType: !35, size: 32, offset: 640)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !588, file: !378, line: 331, baseType: !35, size: 32, offset: 672)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l0", scope: !588, file: !378, line: 333, baseType: !35, size: 32, offset: 704)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l1", scope: !588, file: !378, line: 334, baseType: !35, size: 32, offset: 736)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_order", scope: !588, file: !378, line: 339, baseType: !612, size: 2048, offset: 768)
!612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, size: 2048, elements: !318)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !588, file: !378, line: 335, size: 64, elements: !614)
!614 = !{!615, !616}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "idc", scope: !613, file: !378, line: 337, baseType: !35, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !613, file: !378, line: 338, baseType: !35, size: 32, offset: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !588, file: !378, line: 342, baseType: !618, size: 49152, offset: 2816)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 49152, elements: !619)
!619 = !{!620, !241}
!620 = !DISubrange(count: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_remove_from_end", scope: !588, file: !378, line: 344, baseType: !35, size: 32, offset: 51968)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_command_count", scope: !588, file: !378, line: 345, baseType: !35, size: 32, offset: 52000)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "mmco", scope: !588, file: !378, line: 350, baseType: !624, size: 1024, offset: 52032)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !625, size: 1024, elements: !101)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !588, file: !378, line: 346, size: 64, elements: !626)
!626 = !{!627, !628}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "i_difference_of_pic_nums", scope: !625, file: !378, line: 348, baseType: !35, size: 32)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !625, file: !378, line: 349, baseType: !35, size: 32, offset: 32)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !588, file: !378, line: 352, baseType: !35, size: 32, offset: 53056)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !588, file: !378, line: 354, baseType: !35, size: 32, offset: 53088)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_delta", scope: !588, file: !378, line: 355, baseType: !35, size: 32, offset: 53120)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "b_sp_for_swidth", scope: !588, file: !378, line: 356, baseType: !35, size: 32, offset: 53152)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "i_qs_delta", scope: !588, file: !378, line: 357, baseType: !35, size: 32, offset: 53184)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "i_disable_deblocking_filter_idc", scope: !588, file: !378, line: 360, baseType: !35, size: 32, offset: 53216)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "i_alpha_c0_offset", scope: !588, file: !378, line: 361, baseType: !35, size: 32, offset: 53248)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "i_beta_offset", scope: !588, file: !378, line: 362, baseType: !35, size: 32, offset: 53280)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !377, file: !378, line: 463, baseType: !638, size: 4096, offset: 111232)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_cabac_t", file: !639, line: 46, baseType: !640)
!639 = !DIFile(filename: "x264_src/common/cabac.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/525.x264_r/build/build_base_ld-loop-ext-m64.0000")
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !639, line: 27, size: 4096, elements: !641)
!641 = !{!642, !643, !644, !645, !646, !647, !648, !649, !650}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "i_low", scope: !640, file: !639, line: 30, baseType: !35, size: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "i_range", scope: !640, file: !639, line: 31, baseType: !35, size: 32, offset: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "i_queue", scope: !640, file: !639, line: 34, baseType: !35, size: 32, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "i_bytes_outstanding", scope: !640, file: !639, line: 35, baseType: !35, size: 32, offset: 96)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !640, file: !639, line: 37, baseType: !249, size: 64, offset: 128)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !640, file: !639, line: 38, baseType: !249, size: 64, offset: 192)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !640, file: !639, line: 39, baseType: !249, size: 64, offset: 256)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "f8_bits_encoded", scope: !640, file: !639, line: 42, baseType: !35, size: 32, align: 128, offset: 384)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !640, file: !639, line: 45, baseType: !651, size: 3680, offset: 416)
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 3680, elements: !652)
!652 = !{!653}
!653 = !DISubrange(count: 460)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !377, file: !378, line: 494, baseType: !655, size: 2112, offset: 115328)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !377, file: !378, line: 465, size: 2112, elements: !656)
!656 = !{!657, !659, !661, !662, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !675, !676, !677, !678}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !655, file: !378, line: 468, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !655, file: !378, line: 470, baseType: !660, size: 128, offset: 64)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !658, size: 128, elements: !156)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "blank_unused", scope: !655, file: !378, line: 473, baseType: !658, size: 64, offset: 192)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !655, file: !378, line: 476, baseType: !663, size: 1152, offset: 256)
!663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 1152, elements: !326)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_keyframe", scope: !655, file: !378, line: 478, baseType: !35, size: 32, offset: 1408)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "i_input", scope: !655, file: !378, line: 480, baseType: !35, size: 32, offset: 1440)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dpb", scope: !655, file: !378, line: 482, baseType: !35, size: 32, offset: 1472)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref0", scope: !655, file: !378, line: 483, baseType: !35, size: 32, offset: 1504)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref1", scope: !655, file: !378, line: 484, baseType: !35, size: 32, offset: 1536)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "i_delay", scope: !655, file: !378, line: 485, baseType: !35, size: 32, offset: 1568)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay", scope: !655, file: !378, line: 486, baseType: !35, size: 32, offset: 1600)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay_time", scope: !655, file: !378, line: 487, baseType: !39, size: 64, offset: 1664)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "i_init_delta", scope: !655, file: !378, line: 488, baseType: !39, size: 64, offset: 1728)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_reordered_pts", scope: !655, file: !378, line: 489, baseType: !674, size: 128, offset: 1792)
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 128, elements: !156)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "i_largest_pts", scope: !655, file: !378, line: 490, baseType: !39, size: 64, offset: 1920)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "i_second_largest_pts", scope: !655, file: !378, line: 491, baseType: !39, size: 64, offset: 1984)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_lowres", scope: !655, file: !378, line: 492, baseType: !35, size: 32, offset: 2048)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_sub8x8_esa", scope: !655, file: !378, line: 493, baseType: !35, size: 32, offset: 2080)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "fenc", scope: !377, file: !378, line: 497, baseType: !29, size: 64, offset: 117440)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "fdec", scope: !377, file: !378, line: 500, baseType: !29, size: 64, offset: 117504)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref0", scope: !377, file: !378, line: 503, baseType: !35, size: 32, offset: 117568)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "fref0", scope: !377, file: !378, line: 504, baseType: !683, size: 1216, offset: 117632)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 1216, elements: !684)
!684 = !{!685}
!685 = !DISubrange(count: 19)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref1", scope: !377, file: !378, line: 505, baseType: !35, size: 32, offset: 118848)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "fref1", scope: !377, file: !378, line: 506, baseType: !683, size: 1216, offset: 118912)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_reorder", scope: !377, file: !378, line: 507, baseType: !155, size: 64, offset: 120128)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay", scope: !377, file: !378, line: 510, baseType: !35, size: 32, offset: 120192)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_offset", scope: !377, file: !378, line: 511, baseType: !35, size: 32, offset: 120224)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts_delay", scope: !377, file: !378, line: 512, baseType: !39, size: 64, offset: 120256)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "dct", scope: !377, file: !378, line: 522, baseType: !693, size: 10624, offset: 120320)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !377, file: !378, line: 515, size: 10624, elements: !694)
!694 = !{!695, !697, !700, !703}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "luma16x16_dc", scope: !693, file: !378, line: 517, baseType: !696, size: 256, align: 128)
!696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 256, elements: !101)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_dc", scope: !693, file: !378, line: 518, baseType: !698, size: 128, align: 128, offset: 256)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 128, elements: !699)
!699 = !{!157, !253}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "luma8x8", scope: !693, file: !378, line: 520, baseType: !701, size: 4096, align: 128, offset: 384)
!701 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 4096, elements: !702)
!702 = !{!253, !109}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "luma4x4", scope: !693, file: !378, line: 521, baseType: !704, size: 6144, align: 128, offset: 4480)
!704 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 6144, elements: !705)
!705 = !{!706, !102}
!706 = !DISubrange(count: 24)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !377, file: !378, line: 732, baseType: !708, size: 82688, offset: 130944)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !377, file: !378, line: 525, size: 82688, elements: !709)
!709 = !{!710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !737, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !755, !758, !762, !763, !764, !769, !770, !773, !774, !775, !776, !777, !778, !779, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !839, !870, !871, !872, !873, !874, !875, !876, !877, !878, !881, !882, !883, !886, !889, !891, !894, !896, !897}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !708, file: !378, line: 527, baseType: !35, size: 32)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_stride", scope: !708, file: !378, line: 530, baseType: !35, size: 32, offset: 32)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_stride", scope: !708, file: !378, line: 531, baseType: !35, size: 32, offset: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_stride", scope: !708, file: !378, line: 532, baseType: !35, size: 32, offset: 96)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_x", scope: !708, file: !378, line: 535, baseType: !35, size: 32, offset: 128)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_y", scope: !708, file: !378, line: 536, baseType: !35, size: 32, offset: 160)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_xy", scope: !708, file: !378, line: 537, baseType: !35, size: 32, offset: 192)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_xy", scope: !708, file: !378, line: 538, baseType: !35, size: 32, offset: 224)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_xy", scope: !708, file: !378, line: 539, baseType: !35, size: 32, offset: 256)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !708, file: !378, line: 542, baseType: !35, size: 32, offset: 288)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !708, file: !378, line: 543, baseType: !35, size: 32, offset: 320)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !708, file: !378, line: 544, baseType: !35, size: 32, offset: 352)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "b_trellis", scope: !708, file: !378, line: 545, baseType: !35, size: 32, offset: 384)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "b_noise_reduction", scope: !708, file: !378, line: 546, baseType: !35, size: 32, offset: 416)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !708, file: !378, line: 547, baseType: !35, size: 32, offset: 448)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_rd", scope: !708, file: !378, line: 548, baseType: !35, size: 32, offset: 480)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_trellis", scope: !708, file: !378, line: 549, baseType: !35, size: 32, offset: 512)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !708, file: !378, line: 551, baseType: !35, size: 32, offset: 544)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min", scope: !708, file: !378, line: 554, baseType: !155, size: 64, offset: 576)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max", scope: !708, file: !378, line: 555, baseType: !155, size: 64, offset: 640)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_spel", scope: !708, file: !378, line: 558, baseType: !155, size: 64, offset: 704)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_spel", scope: !708, file: !378, line: 559, baseType: !155, size: 64, offset: 768)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_fpel", scope: !708, file: !378, line: 561, baseType: !155, size: 64, offset: 832)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_fpel", scope: !708, file: !378, line: 562, baseType: !155, size: 64, offset: 896)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour", scope: !708, file: !378, line: 565, baseType: !5, size: 32, offset: 960)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour8", scope: !708, file: !378, line: 566, baseType: !736, size: 128, offset: 992)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 128, elements: !252)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour4", scope: !708, file: !378, line: 567, baseType: !738, size: 512, offset: 1120)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 512, elements: !101)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_intra", scope: !708, file: !378, line: 568, baseType: !5, size: 32, offset: 1632)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_frame", scope: !708, file: !378, line: 569, baseType: !5, size: 32, offset: 1664)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_top", scope: !708, file: !378, line: 570, baseType: !35, size: 32, offset: 1696)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_left", scope: !708, file: !378, line: 571, baseType: !35, size: 32, offset: 1728)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topleft", scope: !708, file: !378, line: 572, baseType: !35, size: 32, offset: 1760)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topright", scope: !708, file: !378, line: 573, baseType: !35, size: 32, offset: 1792)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_prev_xy", scope: !708, file: !378, line: 574, baseType: !35, size: 32, offset: 1824)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_left_xy", scope: !708, file: !378, line: 575, baseType: !35, size: 32, offset: 1856)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_top_xy", scope: !708, file: !378, line: 576, baseType: !35, size: 32, offset: 1888)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topleft_xy", scope: !708, file: !378, line: 577, baseType: !35, size: 32, offset: 1920)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topright_xy", scope: !708, file: !378, line: 578, baseType: !35, size: 32, offset: 1952)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !708, file: !378, line: 585, baseType: !292, size: 64, offset: 1984)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "partition", scope: !708, file: !378, line: 586, baseType: !249, size: 64, offset: 2048)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !708, file: !378, line: 587, baseType: !292, size: 64, offset: 2112)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !708, file: !378, line: 588, baseType: !754, size: 64, offset: 2176)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !708, file: !378, line: 589, baseType: !756, size: 64, offset: 2240)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 64, elements: !269)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !708, file: !378, line: 591, baseType: !759, size: 64, offset: 2304)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 192, elements: !761)
!761 = !{!706}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_pred_mode", scope: !708, file: !378, line: 592, baseType: !292, size: 64, offset: 2368)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !708, file: !378, line: 593, baseType: !298, size: 128, offset: 2432)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !708, file: !378, line: 594, baseType: !765, size: 128, offset: 2560)
!765 = !DICompositeType(tag: DW_TAG_array_type, baseType: !766, size: 128, elements: !156)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 128, elements: !768)
!768 = !{!270, !157}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !708, file: !378, line: 595, baseType: !314, size: 128, offset: 2688)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "mvr", scope: !708, file: !378, line: 596, baseType: !771, size: 4096, offset: 2816)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 4096, elements: !772)
!772 = !{!157, !620}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "skipbp", scope: !708, file: !378, line: 597, baseType: !292, size: 64, offset: 6912)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "mb_transform_size", scope: !708, file: !378, line: 598, baseType: !292, size: 64, offset: 6976)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "slice_table", scope: !708, file: !378, line: 599, baseType: !16, size: 64, offset: 7040)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "p_weight_buf", scope: !708, file: !378, line: 603, baseType: !287, size: 1024, offset: 7104)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !708, file: !378, line: 606, baseType: !35, size: 32, offset: 8128)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "i_partition", scope: !708, file: !378, line: 607, baseType: !35, size: 32, offset: 8160)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "i_sub_partition", scope: !708, file: !378, line: 608, baseType: !780, size: 32, align: 32, offset: 8192)
!780 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 32, elements: !252)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !708, file: !378, line: 609, baseType: !35, size: 32, offset: 8224)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_luma", scope: !708, file: !378, line: 611, baseType: !35, size: 32, offset: 8256)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_chroma", scope: !708, file: !378, line: 612, baseType: !35, size: 32, offset: 8288)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra16x16_pred_mode", scope: !708, file: !378, line: 614, baseType: !35, size: 32, offset: 8320)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_pred_mode", scope: !708, file: !378, line: 615, baseType: !35, size: 32, offset: 8352)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "i_skip_intra", scope: !708, file: !378, line: 621, baseType: !35, size: 32, offset: 8384)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "b_skip_mc", scope: !708, file: !378, line: 624, baseType: !35, size: 32, offset: 8416)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "b_reencode_mb", scope: !708, file: !378, line: 626, baseType: !35, size: 32, offset: 8448)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "ip_offset", scope: !708, file: !378, line: 627, baseType: !35, size: 32, offset: 8480)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "pic", scope: !708, file: !378, line: 671, baseType: !791, size: 60672, offset: 8576)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !708, file: !378, line: 629, size: 60672, elements: !792)
!792 = !{!793, !797, !801, !803, !804, !807, !811, !813, !814, !815, !816, !817, !820, !824, !827, !828, !829, !830, !831, !834, !836, !838}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_buf", scope: !791, file: !378, line: 634, baseType: !794, size: 3072, align: 128)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 3072, elements: !795)
!795 = !{!796}
!796 = !DISubrange(count: 384)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "fdec_buf", scope: !791, file: !378, line: 635, baseType: !798, size: 6912, align: 128, offset: 3072)
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 6912, elements: !799)
!799 = !{!800}
!800 = !DISubrange(count: 864)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_fdec_buf", scope: !791, file: !378, line: 638, baseType: !802, size: 2048, align: 128, offset: 9984)
!802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 2048, elements: !455)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_fdec_buf", scope: !791, file: !378, line: 639, baseType: !802, size: 2048, align: 128, offset: 12032)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_dct_buf", scope: !791, file: !378, line: 640, baseType: !805, size: 3072, align: 128, offset: 14080)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 3072, elements: !806)
!806 = !{!241, !109}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_dct_buf", scope: !791, file: !378, line: 641, baseType: !808, size: 3840, align: 128, offset: 17152)
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 3840, elements: !809)
!809 = !{!810, !102}
!810 = !DISubrange(count: 15)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_nnz_buf", scope: !791, file: !378, line: 642, baseType: !812, size: 128, offset: 20992)
!812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 128, elements: !252)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_nnz_buf", scope: !791, file: !378, line: 643, baseType: !812, size: 128, offset: 21120)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_cbp", scope: !791, file: !378, line: 644, baseType: !35, size: 32, offset: 21248)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_cbp", scope: !791, file: !378, line: 645, baseType: !35, size: 32, offset: 21280)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct8", scope: !791, file: !378, line: 648, baseType: !701, size: 4096, align: 128, offset: 21376)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct4", scope: !791, file: !378, line: 649, baseType: !818, size: 4096, align: 128, offset: 25472)
!818 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 4096, elements: !819)
!819 = !{!102, !102}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_hadamard_cache", scope: !791, file: !378, line: 652, baseType: !821, size: 576, align: 128, offset: 29568)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 576, elements: !822)
!822 = !{!823}
!823 = !DISubrange(count: 9)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_satd_cache", scope: !791, file: !378, line: 653, baseType: !825, size: 1024, align: 128, offset: 30208)
!825 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 1024, elements: !826)
!826 = !{!620}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "p_fenc", scope: !791, file: !378, line: 656, baseType: !248, size: 192, offset: 31232)
