; ModuleID = 'blender/source/blender/editors/physics/physics_fluid.c'
source_filename = "blender/source/blender/editors/physics/physics_fluid.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.wmOperatorType = type { i8*, i8*, i8*, i8*, i32 (%struct.bContext*, %struct.wmOperator*)*, i8 (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, void (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, i32 (%struct.bContext*)*, void (%struct.bContext*, %struct.wmOperator*)*, %struct.StructRNA*, %struct.IDProperty*, %struct.PropertyRNA*, %struct.ListBase, %struct.wmKeyMap*, i8*, i32 (%struct.bContext*, %struct.wmOperatorType*)*, %struct.ExtensionRNA, i16 }
%struct.bContext = type opaque
%struct.wmOperator = type { %struct.wmOperator*, %struct.wmOperator*, [64 x i8], %struct.IDProperty*, %struct.wmOperatorType*, i8*, i8*, %struct.PointerRNA*, %struct.ReportList*, %struct.ListBase, %struct.wmOperator*, %struct.uiLayout*, i16, [3 x i16] }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }
%struct.ReportList = type { %struct.ListBase, i32, i32, i32, i32, %struct.wmTimer* }
%struct.wmTimer = type { %struct.wmTimer*, %struct.wmTimer*, %struct.wmWindow*, double, i32, i8*, double, double, double, double, double, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/editors/physics/physics_fluid.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !22}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 384, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "blender/source/blender/windowmanager/WM_api.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21}
!7 = !DIEnumerator(name: "WM_JOB_TYPE_ANY", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "WM_JOB_TYPE_COMPOSITE", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "WM_JOB_TYPE_RENDER", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "WM_JOB_TYPE_RENDER_PREVIEW", value: 3, isUnsigned: true)
!11 = !DIEnumerator(name: "WM_JOB_TYPE_SCREENCAST", value: 4, isUnsigned: true)
!12 = !DIEnumerator(name: "WM_JOB_TYPE_OBJECT_SIM_OCEAN", value: 5, isUnsigned: true)
!13 = !DIEnumerator(name: "WM_JOB_TYPE_OBJECT_SIM_FLUID", value: 6, isUnsigned: true)
!14 = !DIEnumerator(name: "WM_JOB_TYPE_OBJECT_BAKE_TEXTURE", value: 7, isUnsigned: true)
!15 = !DIEnumerator(name: "WM_JOB_TYPE_OBJECT_BAKE", value: 8, isUnsigned: true)
!16 = !DIEnumerator(name: "WM_JOB_TYPE_FILESEL_THUMBNAIL", value: 9, isUnsigned: true)
!17 = !DIEnumerator(name: "WM_JOB_TYPE_CLIP_BUILD_PROXY", value: 10, isUnsigned: true)
!18 = !DIEnumerator(name: "WM_JOB_TYPE_CLIP_TRACK_MARKERS", value: 11, isUnsigned: true)
!19 = !DIEnumerator(name: "WM_JOB_TYPE_CLIP_SOLVE_CAMERA", value: 12, isUnsigned: true)
!20 = !DIEnumerator(name: "WM_JOB_TYPE_CLIP_PREFETCH", value: 13, isUnsigned: true)
!21 = !DIEnumerator(name: "WM_JOB_TYPE_SEQ_BUILD_PROXY", value: 14, isUnsigned: true)
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !23, line: 351, baseType: !5, size: 32, elements: !24)
!23 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!24 = !{!25, !26, !27, !28, !29, !30}
!25 = !DIEnumerator(name: "OPERATOR_RUNNING_MODAL", value: 1, isUnsigned: true)
!26 = !DIEnumerator(name: "OPERATOR_CANCELLED", value: 2, isUnsigned: true)
!27 = !DIEnumerator(name: "OPERATOR_FINISHED", value: 4, isUnsigned: true)
!28 = !DIEnumerator(name: "OPERATOR_PASS_THROUGH", value: 8, isUnsigned: true)
!29 = !DIEnumerator(name: "OPERATOR_HANDLED", value: 16, isUnsigned: true)
!30 = !DIEnumerator(name: "OPERATOR_INTERFACE", value: 32, isUnsigned: true)
!31 = !{i32 7, !"Dwarf Version", i32 4}
!32 = !{i32 2, !"Debug Info Version", i32 3}
!33 = !{i32 1, !"wchar_size", i32 4}
!34 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!35 = distinct !DISubprogram(name: "FLUID_OT_bake", scope: !1, file: !1, line: 1121, type: !36, scopeLine: 1122, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1921)
!36 = !DISubroutineType(types: !37)
!37 = !{null, !38}
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorType", file: !40, line: 568, baseType: !41)
!40 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !40, line: 508, size: 1536, elements: !42)
!42 = !{!43, !47, !48, !49, !50, !1847, !1851, !1857, !1861, !1862, !1866, !1867, !1868, !1869, !1873, !1874, !1889, !1890, !1894, !1920}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !41, file: !40, line: 509, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!46 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !41, file: !40, line: 510, baseType: !44, size: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !41, file: !40, line: 511, baseType: !44, size: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !41, file: !40, line: 512, baseType: !44, size: 64, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !41, file: !40, line: 518, baseType: !51, size: 64, offset: 256)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{!54, !55, !58}
!54 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !57, line: 44, flags: DIFlagFwdDecl)
!57 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !23, line: 328, size: 1344, elements: !60)
!60 = !{!61, !62, !63, !67, !99, !101, !102, !103, !115, !1840, !1841, !1842, !1845, !1846}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !59, file: !23, line: 329, baseType: !58, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !59, file: !23, line: 329, baseType: !58, size: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !59, file: !23, line: 332, baseType: !64, size: 512, offset: 128)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 512, elements: !65)
!65 = !{!66}
!66 = !DISubrange(count: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !59, file: !23, line: 333, baseType: !68, size: 64, offset: 640)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !70, line: 75, baseType: !71)
!70 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !70, line: 62, size: 1024, elements: !72)
!72 = !{!73, !75, !76, !77, !78, !80, !81, !82, !97, !98}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !71, file: !70, line: 63, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !71, file: !70, line: 63, baseType: !74, size: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !71, file: !70, line: 64, baseType: !46, size: 8, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !71, file: !70, line: 64, baseType: !46, size: 8, offset: 136)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !71, file: !70, line: 65, baseType: !79, size: 16, offset: 144)
!79 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !71, file: !70, line: 66, baseType: !64, size: 512, offset: 160)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !71, file: !70, line: 67, baseType: !54, size: 32, offset: 672)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !71, file: !70, line: 69, baseType: !83, size: 256, offset: 704)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !70, line: 60, baseType: !84)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !70, line: 48, size: 256, elements: !85)
!85 = !{!86, !88, !95, !96}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !84, file: !70, line: 49, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !84, file: !70, line: 58, baseType: !89, size: 128, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !90, line: 71, baseType: !91)
!90 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !90, line: 69, size: 128, elements: !92)
!92 = !{!93, !94}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !91, file: !90, line: 70, baseType: !87, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !91, file: !90, line: 70, baseType: !87, size: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !84, file: !70, line: 59, baseType: !54, size: 32, offset: 192)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !84, file: !70, line: 59, baseType: !54, size: 32, offset: 224)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !71, file: !70, line: 70, baseType: !54, size: 32, offset: 960)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !71, file: !70, line: 74, baseType: !54, size: 32, offset: 992)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !59, file: !23, line: 336, baseType: !100, size: 64, offset: 704)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !59, file: !23, line: 337, baseType: !87, size: 64, offset: 768)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !59, file: !23, line: 338, baseType: !87, size: 64, offset: 832)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !59, file: !23, line: 340, baseType: !104, size: 64, offset: 896)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !57, line: 55, size: 192, elements: !106)
!106 = !{!107, !111, !114}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !105, file: !57, line: 58, baseType: !108, size: 64)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !105, file: !57, line: 56, size: 64, elements: !109)
!109 = !{!110}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !108, file: !57, line: 57, baseType: !87, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !105, file: !57, line: 60, baseType: !112, size: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !57, line: 41, flags: DIFlagFwdDecl)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !105, file: !57, line: 61, baseType: !87, size: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !59, file: !23, line: 341, baseType: !116, size: 64, offset: 960)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !23, line: 106, size: 320, elements: !118)
!118 = !{!119, !120, !121, !122, !123, !124}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !117, file: !23, line: 107, baseType: !89, size: 128)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !117, file: !23, line: 108, baseType: !54, size: 32, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !117, file: !23, line: 109, baseType: !54, size: 32, offset: 160)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !117, file: !23, line: 110, baseType: !54, size: 32, offset: 192)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !117, file: !23, line: 110, baseType: !54, size: 32, offset: 224)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !117, file: !23, line: 111, baseType: !125, size: 64, offset: 256)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !40, line: 490, size: 768, elements: !127)
!127 = !{!128, !129, !130, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !126, file: !40, line: 491, baseType: !125, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !126, file: !40, line: 491, baseType: !125, size: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !126, file: !40, line: 493, baseType: !131, size: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !23, line: 169, size: 2048, elements: !133)
!133 = !{!134, !135, !136, !137, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1806, !1809, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1830}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !132, file: !23, line: 170, baseType: !131, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !132, file: !23, line: 170, baseType: !131, size: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !132, file: !23, line: 172, baseType: !87, size: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !132, file: !23, line: 174, baseType: !138, size: 64, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !140, line: 49, size: 1984, elements: !141)
!140 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!141 = !{!142, !178, !179, !180, !181, !182, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !139, file: !140, line: 50, baseType: !143, size: 960)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !70, line: 130, baseType: !144)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !70, line: 117, size: 960, elements: !145)
!145 = !{!146, !147, !148, !150, !169, !173, !174, !175, !176, !177}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !144, file: !70, line: 118, baseType: !87, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !144, file: !70, line: 118, baseType: !87, size: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !144, file: !70, line: 119, baseType: !149, size: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !144, file: !70, line: 120, baseType: !151, size: 64, offset: 192)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !70, line: 136, size: 17600, elements: !153)
!153 = !{!154, !155, !157, !160, !164, !165, !166}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !152, file: !70, line: 137, baseType: !143, size: 960)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !152, file: !70, line: 138, baseType: !156, size: 64, offset: 960)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !152, file: !70, line: 139, baseType: !158, size: 64, offset: 1024)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !70, line: 43, flags: DIFlagFwdDecl)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !152, file: !70, line: 140, baseType: !161, size: 8192, offset: 1088)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 8192, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 1024)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !152, file: !70, line: 141, baseType: !161, size: 8192, offset: 9280)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !152, file: !70, line: 148, baseType: !151, size: 64, offset: 17472)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !152, file: !70, line: 150, baseType: !167, size: 64, offset: 17536)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !70, line: 45, flags: DIFlagFwdDecl)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !144, file: !70, line: 121, baseType: !170, size: 528, offset: 256)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 528, elements: !171)
!171 = !{!172}
!172 = !DISubrange(count: 66)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !144, file: !70, line: 126, baseType: !79, size: 16, offset: 784)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !144, file: !70, line: 127, baseType: !54, size: 32, offset: 800)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !144, file: !70, line: 128, baseType: !54, size: 32, offset: 832)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !144, file: !70, line: 128, baseType: !54, size: 32, offset: 864)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !144, file: !70, line: 129, baseType: !68, size: 64, offset: 896)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !139, file: !140, line: 52, baseType: !89, size: 128, offset: 960)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !139, file: !140, line: 53, baseType: !89, size: 128, offset: 1088)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !139, file: !140, line: 54, baseType: !89, size: 128, offset: 1216)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !139, file: !140, line: 55, baseType: !89, size: 128, offset: 1344)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !139, file: !140, line: 57, baseType: !183, size: 64, offset: 1472)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !185, line: 1216, size: 39680, elements: !186)
!185 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!186 = !{!187, !188, !192, !568, !571, !572, !573, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !599, !670, !1098, !1313, !1316, !1604, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1627, !1628, !1629, !1630, !1631, !1639, !1706, !1713, !1714, !1721, !1722, !1723, !1724, !1725, !1726, !1727}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !184, file: !185, line: 1217, baseType: !143, size: 960)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !184, file: !185, line: 1218, baseType: !189, size: 64, offset: 960)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !191, line: 45, flags: DIFlagFwdDecl)
!191 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!192 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !184, file: !185, line: 1220, baseType: !193, size: 64, offset: 1024)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !195, line: 115, size: 11392, elements: !196)
!195 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!196 = !{!197, !198, !199, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !216, !228, !242, !243, !286, !287, !290, !291, !307, !308, !309, !310, !311, !312, !313, !317, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !333, !334, !335, !336, !337, !338, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !398, !399, !400, !401, !402, !403, !404, !405, !406, !409, !412, !415, !416, !417, !418, !419, !506, !509, !512, !513, !519, !520, !521, !522, !523, !524, !526, !529, !532, !536, !556, !557}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !194, file: !195, line: 116, baseType: !143, size: 960)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !194, file: !195, line: 117, baseType: !189, size: 64, offset: 960)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !194, file: !195, line: 119, baseType: !200, size: 64, offset: 1024)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !195, line: 57, flags: DIFlagFwdDecl)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !194, file: !195, line: 121, baseType: !79, size: 16, offset: 1088)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !194, file: !195, line: 121, baseType: !79, size: 16, offset: 1104)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !194, file: !195, line: 122, baseType: !54, size: 32, offset: 1120)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !194, file: !195, line: 122, baseType: !54, size: 32, offset: 1152)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !194, file: !195, line: 122, baseType: !54, size: 32, offset: 1184)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !194, file: !195, line: 123, baseType: !64, size: 512, offset: 1216)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !194, file: !195, line: 124, baseType: !193, size: 64, offset: 1728)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !194, file: !195, line: 124, baseType: !193, size: 64, offset: 1792)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !194, file: !195, line: 127, baseType: !193, size: 64, offset: 1856)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !194, file: !195, line: 127, baseType: !193, size: 64, offset: 1920)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !194, file: !195, line: 127, baseType: !193, size: 64, offset: 1984)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !194, file: !195, line: 128, baseType: !214, size: 64, offset: 2048)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !191, line: 46, flags: DIFlagFwdDecl)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !194, file: !195, line: 130, baseType: !217, size: 64, offset: 2112)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !195, line: 97, size: 832, elements: !219)
!219 = !{!220, !226, !227}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !218, file: !195, line: 98, baseType: !221, size: 768)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 768, elements: !223)
!222 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!223 = !{!224, !225}
!224 = !DISubrange(count: 8)
!225 = !DISubrange(count: 3)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !218, file: !195, line: 99, baseType: !54, size: 32, offset: 768)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !218, file: !195, line: 99, baseType: !54, size: 32, offset: 800)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !194, file: !195, line: 131, baseType: !229, size: 64, offset: 2176)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !231, line: 486, size: 1600, elements: !232)
!231 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!232 = !{!233, !234, !235, !236, !237, !238, !239, !240, !241}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !230, file: !231, line: 487, baseType: !143, size: 960)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !230, file: !231, line: 489, baseType: !89, size: 128, offset: 960)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !230, file: !231, line: 490, baseType: !89, size: 128, offset: 1088)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !230, file: !231, line: 491, baseType: !89, size: 128, offset: 1216)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !230, file: !231, line: 492, baseType: !89, size: 128, offset: 1344)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !230, file: !231, line: 494, baseType: !54, size: 32, offset: 1472)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !230, file: !231, line: 495, baseType: !54, size: 32, offset: 1504)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !230, file: !231, line: 497, baseType: !54, size: 32, offset: 1536)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !230, file: !231, line: 498, baseType: !54, size: 32, offset: 1568)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !194, file: !195, line: 132, baseType: !229, size: 64, offset: 2240)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !194, file: !195, line: 133, baseType: !244, size: 64, offset: 2304)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !231, line: 334, size: 1728, elements: !246)
!246 = !{!247, !248, !251, !252, !253, !254, !255, !256, !259, !260, !261, !262, !263, !264, !265, !285}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !245, file: !231, line: 335, baseType: !89, size: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !245, file: !231, line: 336, baseType: !249, size: 64, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !231, line: 47, flags: DIFlagFwdDecl)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !245, file: !231, line: 338, baseType: !79, size: 16, offset: 192)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !245, file: !231, line: 338, baseType: !79, size: 16, offset: 208)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !245, file: !231, line: 339, baseType: !5, size: 32, offset: 224)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !245, file: !231, line: 340, baseType: !54, size: 32, offset: 256)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !245, file: !231, line: 342, baseType: !222, size: 32, offset: 288)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !245, file: !231, line: 343, baseType: !257, size: 96, offset: 320)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 96, elements: !258)
!258 = !{!225}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !245, file: !231, line: 344, baseType: !257, size: 96, offset: 416)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !245, file: !231, line: 347, baseType: !89, size: 128, offset: 512)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !245, file: !231, line: 349, baseType: !54, size: 32, offset: 640)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !245, file: !231, line: 350, baseType: !54, size: 32, offset: 672)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !245, file: !231, line: 351, baseType: !87, size: 64, offset: 704)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !245, file: !231, line: 352, baseType: !87, size: 64, offset: 768)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !245, file: !231, line: 354, baseType: !266, size: 384, offset: 832)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !231, line: 116, baseType: !267)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !231, line: 94, size: 384, elements: !268)
!268 = !{!269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !267, file: !231, line: 96, baseType: !54, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !267, file: !231, line: 96, baseType: !54, size: 32, offset: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !267, file: !231, line: 97, baseType: !54, size: 32, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !267, file: !231, line: 97, baseType: !54, size: 32, offset: 96)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !267, file: !231, line: 99, baseType: !79, size: 16, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !267, file: !231, line: 100, baseType: !79, size: 16, offset: 144)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !267, file: !231, line: 102, baseType: !79, size: 16, offset: 160)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !267, file: !231, line: 105, baseType: !79, size: 16, offset: 176)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !267, file: !231, line: 108, baseType: !79, size: 16, offset: 192)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !267, file: !231, line: 109, baseType: !79, size: 16, offset: 208)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !267, file: !231, line: 111, baseType: !79, size: 16, offset: 224)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !267, file: !231, line: 112, baseType: !79, size: 16, offset: 240)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !267, file: !231, line: 114, baseType: !54, size: 32, offset: 256)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !267, file: !231, line: 114, baseType: !54, size: 32, offset: 288)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !267, file: !231, line: 115, baseType: !54, size: 32, offset: 320)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !267, file: !231, line: 115, baseType: !54, size: 32, offset: 352)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !245, file: !231, line: 355, baseType: !64, size: 512, offset: 1216)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !194, file: !195, line: 134, baseType: !87, size: 64, offset: 2368)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !194, file: !195, line: 136, baseType: !288, size: 64, offset: 2432)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !195, line: 58, flags: DIFlagFwdDecl)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !194, file: !195, line: 138, baseType: !266, size: 384, offset: 2496)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !194, file: !195, line: 139, baseType: !292, size: 64, offset: 2880)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !231, line: 80, baseType: !294)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !231, line: 72, size: 192, elements: !295)
!295 = !{!296, !303, !304, !305, !306}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !294, file: !231, line: 73, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !231, line: 59, baseType: !299)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !231, line: 56, size: 128, elements: !300)
!300 = !{!301, !302}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !299, file: !231, line: 57, baseType: !257, size: 96)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !299, file: !231, line: 58, baseType: !54, size: 32, offset: 96)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !294, file: !231, line: 74, baseType: !54, size: 32, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !294, file: !231, line: 76, baseType: !54, size: 32, offset: 96)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !294, file: !231, line: 77, baseType: !54, size: 32, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !294, file: !231, line: 79, baseType: !54, size: 32, offset: 160)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !194, file: !195, line: 141, baseType: !89, size: 128, offset: 2944)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !194, file: !195, line: 142, baseType: !89, size: 128, offset: 3072)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !194, file: !195, line: 143, baseType: !89, size: 128, offset: 3200)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !194, file: !195, line: 144, baseType: !89, size: 128, offset: 3328)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !194, file: !195, line: 146, baseType: !54, size: 32, offset: 3456)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !194, file: !195, line: 147, baseType: !54, size: 32, offset: 3488)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !194, file: !195, line: 150, baseType: !314, size: 64, offset: 3520)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !195, line: 50, flags: DIFlagFwdDecl)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !194, file: !195, line: 151, baseType: !318, size: 64, offset: 3584)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !194, file: !195, line: 152, baseType: !54, size: 32, offset: 3648)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !194, file: !195, line: 153, baseType: !54, size: 32, offset: 3680)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !194, file: !195, line: 156, baseType: !257, size: 96, offset: 3712)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !194, file: !195, line: 156, baseType: !257, size: 96, offset: 3808)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !194, file: !195, line: 156, baseType: !257, size: 96, offset: 3904)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !194, file: !195, line: 157, baseType: !257, size: 96, offset: 4000)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !194, file: !195, line: 158, baseType: !257, size: 96, offset: 4096)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !194, file: !195, line: 159, baseType: !257, size: 96, offset: 4192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !194, file: !195, line: 160, baseType: !257, size: 96, offset: 4288)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !194, file: !195, line: 160, baseType: !257, size: 96, offset: 4384)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !194, file: !195, line: 161, baseType: !330, size: 128, offset: 4480)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 128, elements: !331)
!331 = !{!332}
!332 = !DISubrange(count: 4)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !194, file: !195, line: 161, baseType: !330, size: 128, offset: 4608)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !194, file: !195, line: 162, baseType: !257, size: 96, offset: 4736)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !194, file: !195, line: 162, baseType: !257, size: 96, offset: 4832)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !194, file: !195, line: 163, baseType: !222, size: 32, offset: 4928)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !194, file: !195, line: 163, baseType: !222, size: 32, offset: 4960)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !194, file: !195, line: 164, baseType: !339, size: 512, offset: 4992)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 512, elements: !340)
!340 = !{!332, !332}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !194, file: !195, line: 165, baseType: !339, size: 512, offset: 5504)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !194, file: !195, line: 166, baseType: !339, size: 512, offset: 6016)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !194, file: !195, line: 167, baseType: !339, size: 512, offset: 6528)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !194, file: !195, line: 176, baseType: !339, size: 512, offset: 7040)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !194, file: !195, line: 178, baseType: !5, size: 32, offset: 7552)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !194, file: !195, line: 180, baseType: !79, size: 16, offset: 7584)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !194, file: !195, line: 181, baseType: !79, size: 16, offset: 7600)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !194, file: !195, line: 183, baseType: !79, size: 16, offset: 7616)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !194, file: !195, line: 183, baseType: !79, size: 16, offset: 7632)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !194, file: !195, line: 184, baseType: !79, size: 16, offset: 7648)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !194, file: !195, line: 184, baseType: !79, size: 16, offset: 7664)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !194, file: !195, line: 185, baseType: !79, size: 16, offset: 7680)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !194, file: !195, line: 186, baseType: !79, size: 16, offset: 7696)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !194, file: !195, line: 187, baseType: !79, size: 16, offset: 7712)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !194, file: !195, line: 188, baseType: !46, size: 8, offset: 7728)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !194, file: !195, line: 189, baseType: !46, size: 8, offset: 7736)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !194, file: !195, line: 192, baseType: !54, size: 32, offset: 7744)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !194, file: !195, line: 192, baseType: !54, size: 32, offset: 7776)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !194, file: !195, line: 192, baseType: !54, size: 32, offset: 7808)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !194, file: !195, line: 192, baseType: !54, size: 32, offset: 7840)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !194, file: !195, line: 194, baseType: !54, size: 32, offset: 7872)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !194, file: !195, line: 202, baseType: !222, size: 32, offset: 7904)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !194, file: !195, line: 202, baseType: !222, size: 32, offset: 7936)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !194, file: !195, line: 202, baseType: !222, size: 32, offset: 7968)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !194, file: !195, line: 211, baseType: !222, size: 32, offset: 8000)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !194, file: !195, line: 212, baseType: !222, size: 32, offset: 8032)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !194, file: !195, line: 213, baseType: !222, size: 32, offset: 8064)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !194, file: !195, line: 214, baseType: !222, size: 32, offset: 8096)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !194, file: !195, line: 215, baseType: !222, size: 32, offset: 8128)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !194, file: !195, line: 216, baseType: !222, size: 32, offset: 8160)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !194, file: !195, line: 219, baseType: !222, size: 32, offset: 8192)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !194, file: !195, line: 220, baseType: !222, size: 32, offset: 8224)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !194, file: !195, line: 221, baseType: !222, size: 32, offset: 8256)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !194, file: !195, line: 224, baseType: !375, size: 16, offset: 8288)
!375 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !194, file: !195, line: 224, baseType: !375, size: 16, offset: 8304)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !194, file: !195, line: 226, baseType: !79, size: 16, offset: 8320)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !194, file: !195, line: 228, baseType: !46, size: 8, offset: 8336)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !194, file: !195, line: 229, baseType: !46, size: 8, offset: 8344)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !194, file: !195, line: 231, baseType: !79, size: 16, offset: 8352)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !194, file: !195, line: 232, baseType: !46, size: 8, offset: 8368)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !194, file: !195, line: 233, baseType: !46, size: 8, offset: 8376)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !194, file: !195, line: 234, baseType: !222, size: 32, offset: 8384)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !194, file: !195, line: 235, baseType: !222, size: 32, offset: 8416)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !194, file: !195, line: 237, baseType: !89, size: 128, offset: 8448)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !194, file: !195, line: 238, baseType: !89, size: 128, offset: 8576)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !194, file: !195, line: 239, baseType: !89, size: 128, offset: 8704)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !194, file: !195, line: 240, baseType: !89, size: 128, offset: 8832)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !194, file: !195, line: 242, baseType: !222, size: 32, offset: 8960)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !194, file: !195, line: 244, baseType: !79, size: 16, offset: 8992)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !194, file: !195, line: 245, baseType: !375, size: 16, offset: 9008)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !194, file: !195, line: 246, baseType: !330, size: 128, offset: 9024)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !194, file: !195, line: 248, baseType: !54, size: 32, offset: 9152)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !194, file: !195, line: 249, baseType: !54, size: 32, offset: 9184)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !194, file: !195, line: 251, baseType: !396, size: 64, offset: 9216)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !195, line: 251, flags: DIFlagFwdDecl)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !194, file: !195, line: 253, baseType: !46, size: 8, offset: 9280)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !194, file: !195, line: 254, baseType: !46, size: 8, offset: 9288)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !194, file: !195, line: 255, baseType: !79, size: 16, offset: 9296)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !194, file: !195, line: 256, baseType: !257, size: 96, offset: 9312)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !194, file: !195, line: 258, baseType: !89, size: 128, offset: 9408)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !194, file: !195, line: 259, baseType: !89, size: 128, offset: 9536)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !194, file: !195, line: 260, baseType: !89, size: 128, offset: 9664)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !194, file: !195, line: 261, baseType: !89, size: 128, offset: 9792)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !194, file: !195, line: 263, baseType: !407, size: 64, offset: 9920)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !195, line: 52, flags: DIFlagFwdDecl)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !194, file: !195, line: 264, baseType: !410, size: 64, offset: 9984)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !195, line: 53, flags: DIFlagFwdDecl)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !194, file: !195, line: 265, baseType: !413, size: 64, offset: 10048)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !231, line: 46, flags: DIFlagFwdDecl)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !194, file: !195, line: 267, baseType: !46, size: 8, offset: 10112)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !194, file: !195, line: 268, baseType: !46, size: 8, offset: 10120)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !194, file: !195, line: 269, baseType: !79, size: 16, offset: 10128)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !194, file: !195, line: 270, baseType: !222, size: 32, offset: 10144)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !194, file: !195, line: 272, baseType: !420, size: 64, offset: 10176)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !422, line: 49, size: 10048, elements: !423)
!422 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_fluidsim.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!423 = !{!424, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "fmd", scope: !421, file: !422, line: 50, baseType: !425, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimModifierData", file: !427, line: 729, size: 1024, elements: !428)
!427 = !DIFile(filename: "blender/source/blender/makesdna/DNA_modifier_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!428 = !{!429, !443, !444}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !426, file: !427, line: 730, baseType: !430, size: 896)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierData", file: !427, line: 110, baseType: !431)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierData", file: !427, line: 99, size: 896, elements: !432)
!432 = !{!433, !435, !436, !437, !438, !439, !440, !441, !442}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !431, file: !427, line: 100, baseType: !434, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !431, file: !427, line: 100, baseType: !434, size: 64, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !431, file: !427, line: 102, baseType: !54, size: 32, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !431, file: !427, line: 102, baseType: !54, size: 32, offset: 160)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "stackindex", scope: !431, file: !427, line: 103, baseType: !54, size: 32, offset: 192)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !431, file: !427, line: 103, baseType: !54, size: 32, offset: 224)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !431, file: !427, line: 104, baseType: !64, size: 512, offset: 256)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !431, file: !427, line: 107, baseType: !183, size: 64, offset: 768)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !431, file: !427, line: 109, baseType: !318, size: 64, offset: 832)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "fss", scope: !426, file: !427, line: 732, baseType: !420, size: 64, offset: 896)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "point_cache", scope: !426, file: !427, line: 733, baseType: !445, size: 64, offset: 960)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "PointCache", file: !427, line: 564, flags: DIFlagFwdDecl)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "threads", scope: !421, file: !422, line: 52, baseType: !54, size: 32, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !421, file: !422, line: 53, baseType: !54, size: 32, offset: 96)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !421, file: !422, line: 55, baseType: !79, size: 16, offset: 128)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "show_advancedoptions", scope: !421, file: !422, line: 57, baseType: !79, size: 16, offset: 144)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "resolutionxyz", scope: !421, file: !422, line: 61, baseType: !79, size: 16, offset: 160)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "previewresxyz", scope: !421, file: !422, line: 62, baseType: !79, size: 16, offset: 176)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "realsize", scope: !421, file: !422, line: 64, baseType: !222, size: 32, offset: 192)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "guiDisplayMode", scope: !421, file: !422, line: 66, baseType: !79, size: 16, offset: 224)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "renderDisplayMode", scope: !421, file: !422, line: 67, baseType: !79, size: 16, offset: 240)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "viscosityValue", scope: !421, file: !422, line: 70, baseType: !222, size: 32, offset: 256)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "viscosityMode", scope: !421, file: !422, line: 71, baseType: !79, size: 16, offset: 288)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "viscosityExponent", scope: !421, file: !422, line: 72, baseType: !79, size: 16, offset: 304)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "grav", scope: !421, file: !422, line: 74, baseType: !257, size: 96, offset: 320)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "animStart", scope: !421, file: !422, line: 76, baseType: !222, size: 32, offset: 416)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "animEnd", scope: !421, file: !422, line: 76, baseType: !222, size: 32, offset: 448)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "bakeStart", scope: !421, file: !422, line: 78, baseType: !54, size: 32, offset: 480)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "bakeEnd", scope: !421, file: !422, line: 78, baseType: !54, size: 32, offset: 512)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "frameOffset", scope: !421, file: !422, line: 80, baseType: !54, size: 32, offset: 544)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !421, file: !422, line: 81, baseType: !54, size: 32, offset: 576)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "gstar", scope: !421, file: !422, line: 83, baseType: !222, size: 32, offset: 608)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "maxRefine", scope: !421, file: !422, line: 85, baseType: !54, size: 32, offset: 640)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "iniVelx", scope: !421, file: !422, line: 89, baseType: !222, size: 32, offset: 672)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "iniVely", scope: !421, file: !422, line: 89, baseType: !222, size: 32, offset: 704)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "iniVelz", scope: !421, file: !422, line: 89, baseType: !222, size: 32, offset: 736)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "orgMesh", scope: !421, file: !422, line: 92, baseType: !472, size: 64, offset: 768)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mesh", file: !422, line: 42, flags: DIFlagFwdDecl)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "meshBB", scope: !421, file: !422, line: 94, baseType: !472, size: 64, offset: 832)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "surfdataPath", scope: !421, file: !422, line: 98, baseType: !161, size: 8192, offset: 896)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "bbStart", scope: !421, file: !422, line: 102, baseType: !257, size: 96, offset: 9088)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "bbSize", scope: !421, file: !422, line: 102, baseType: !257, size: 96, offset: 9184)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !421, file: !422, line: 105, baseType: !214, size: 64, offset: 9280)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "typeFlags", scope: !421, file: !422, line: 109, baseType: !79, size: 16, offset: 9344)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "domainNovecgen", scope: !421, file: !422, line: 111, baseType: !46, size: 8, offset: 9360)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "volumeInitType", scope: !421, file: !422, line: 111, baseType: !46, size: 8, offset: 9368)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "partSlipValue", scope: !421, file: !422, line: 114, baseType: !222, size: 32, offset: 9376)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "generateTracers", scope: !421, file: !422, line: 117, baseType: !54, size: 32, offset: 9408)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "generateParticles", scope: !421, file: !422, line: 119, baseType: !222, size: 32, offset: 9440)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "surfaceSmoothing", scope: !421, file: !422, line: 121, baseType: !222, size: 32, offset: 9472)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "surfaceSubdivs", scope: !421, file: !422, line: 123, baseType: !54, size: 32, offset: 9504)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !421, file: !422, line: 124, baseType: !54, size: 32, offset: 9536)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "particleInfSize", scope: !421, file: !422, line: 127, baseType: !222, size: 32, offset: 9568)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "particleInfAlpha", scope: !421, file: !422, line: 127, baseType: !222, size: 32, offset: 9600)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "farFieldSize", scope: !421, file: !422, line: 129, baseType: !222, size: 32, offset: 9632)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "meshVelocities", scope: !421, file: !422, line: 132, baseType: !492, size: 64, offset: 9664)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FluidVertexVelocity", file: !422, line: 45, size: 96, elements: !494)
!494 = !{!495}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "vel", scope: !493, file: !422, line: 46, baseType: !257, size: 96)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !421, file: !422, line: 134, baseType: !54, size: 32, offset: 9728)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "cpsTimeStart", scope: !421, file: !422, line: 137, baseType: !222, size: 32, offset: 9760)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "cpsTimeEnd", scope: !421, file: !422, line: 138, baseType: !222, size: 32, offset: 9792)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "cpsQuality", scope: !421, file: !422, line: 139, baseType: !222, size: 32, offset: 9824)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "attractforceStrength", scope: !421, file: !422, line: 141, baseType: !222, size: 32, offset: 9856)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "attractforceRadius", scope: !421, file: !422, line: 142, baseType: !222, size: 32, offset: 9888)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "velocityforceStrength", scope: !421, file: !422, line: 143, baseType: !222, size: 32, offset: 9920)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "velocityforceRadius", scope: !421, file: !422, line: 144, baseType: !222, size: 32, offset: 9952)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "lastgoodframe", scope: !421, file: !422, line: 146, baseType: !54, size: 32, offset: 9984)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "animRate", scope: !421, file: !422, line: 149, baseType: !222, size: 32, offset: 10016)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !194, file: !195, line: 275, baseType: !507, size: 64, offset: 10240)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !195, line: 275, flags: DIFlagFwdDecl)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !194, file: !195, line: 277, baseType: !510, size: 64, offset: 10304)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !195, line: 56, flags: DIFlagFwdDecl)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !194, file: !195, line: 277, baseType: !510, size: 64, offset: 10368)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !194, file: !195, line: 278, baseType: !514, size: 64, offset: 10432)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !515, line: 27, baseType: !516)
!515 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !517, line: 45, baseType: !518)
!517 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!518 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !194, file: !195, line: 279, baseType: !514, size: 64, offset: 10496)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !194, file: !195, line: 280, baseType: !5, size: 32, offset: 10560)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !194, file: !195, line: 281, baseType: !5, size: 32, offset: 10592)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !194, file: !195, line: 283, baseType: !89, size: 128, offset: 10624)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !194, file: !195, line: 284, baseType: !89, size: 128, offset: 10752)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !194, file: !195, line: 285, baseType: !525, size: 64, offset: 10880)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !194, file: !195, line: 287, baseType: !527, size: 64, offset: 10944)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !195, line: 59, flags: DIFlagFwdDecl)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !194, file: !195, line: 288, baseType: !530, size: 64, offset: 11008)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !195, line: 288, flags: DIFlagFwdDecl)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !194, file: !195, line: 290, baseType: !533, size: 64, offset: 11072)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 64, elements: !534)
!534 = !{!535}
!535 = !DISubrange(count: 2)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !194, file: !195, line: 291, baseType: !537, size: 64, offset: 11136)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !539, line: 65, baseType: !540)
!539 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !539, line: 50, size: 320, elements: !541)
!541 = !{!542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !540, file: !539, line: 51, baseType: !183, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !540, file: !539, line: 53, baseType: !54, size: 32, offset: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !540, file: !539, line: 54, baseType: !54, size: 32, offset: 96)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !540, file: !539, line: 55, baseType: !54, size: 32, offset: 128)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !540, file: !539, line: 55, baseType: !54, size: 32, offset: 160)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !540, file: !539, line: 56, baseType: !46, size: 8, offset: 192)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !540, file: !539, line: 56, baseType: !46, size: 8, offset: 200)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !540, file: !539, line: 57, baseType: !46, size: 8, offset: 208)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !540, file: !539, line: 57, baseType: !46, size: 8, offset: 216)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !540, file: !539, line: 59, baseType: !79, size: 16, offset: 224)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !540, file: !539, line: 59, baseType: !79, size: 16, offset: 240)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !540, file: !539, line: 59, baseType: !79, size: 16, offset: 256)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !540, file: !539, line: 61, baseType: !79, size: 16, offset: 272)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !540, file: !539, line: 63, baseType: !54, size: 32, offset: 288)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !194, file: !195, line: 293, baseType: !89, size: 128, offset: 11200)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !194, file: !195, line: 294, baseType: !558, size: 64, offset: 11328)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !195, line: 113, baseType: !560)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !195, line: 108, size: 256, elements: !561)
!561 = !{!562, !564, !565, !566, !567}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !560, file: !195, line: 109, baseType: !563, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !560, file: !195, line: 109, baseType: !563, size: 64, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !560, file: !195, line: 110, baseType: !193, size: 64, offset: 128)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !560, file: !195, line: 111, baseType: !54, size: 32, offset: 192)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !560, file: !195, line: 112, baseType: !222, size: 32, offset: 224)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !184, file: !185, line: 1221, baseType: !569, size: 64, offset: 1088)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !185, line: 52, flags: DIFlagFwdDecl)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !184, file: !185, line: 1223, baseType: !183, size: 64, offset: 1152)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !184, file: !185, line: 1225, baseType: !89, size: 128, offset: 1216)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !184, file: !185, line: 1226, baseType: !574, size: 64, offset: 1344)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !185, line: 69, size: 320, elements: !576)
!576 = !{!577, !578, !579, !580, !581, !582, !583, !584}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !575, file: !185, line: 70, baseType: !574, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !575, file: !185, line: 70, baseType: !574, size: 64, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !575, file: !185, line: 71, baseType: !5, size: 32, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !575, file: !185, line: 71, baseType: !5, size: 32, offset: 160)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !575, file: !185, line: 72, baseType: !54, size: 32, offset: 192)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !575, file: !185, line: 73, baseType: !79, size: 16, offset: 224)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !575, file: !185, line: 73, baseType: !79, size: 16, offset: 240)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !575, file: !185, line: 74, baseType: !193, size: 64, offset: 256)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !184, file: !185, line: 1227, baseType: !193, size: 64, offset: 1408)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !184, file: !185, line: 1229, baseType: !257, size: 96, offset: 1472)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !184, file: !185, line: 1230, baseType: !257, size: 96, offset: 1568)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !184, file: !185, line: 1231, baseType: !257, size: 96, offset: 1664)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !184, file: !185, line: 1231, baseType: !257, size: 96, offset: 1760)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !184, file: !185, line: 1233, baseType: !5, size: 32, offset: 1856)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !184, file: !185, line: 1234, baseType: !54, size: 32, offset: 1888)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !184, file: !185, line: 1235, baseType: !5, size: 32, offset: 1920)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !184, file: !185, line: 1237, baseType: !79, size: 16, offset: 1952)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !184, file: !185, line: 1239, baseType: !46, size: 8, offset: 1968)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !184, file: !185, line: 1240, baseType: !596, size: 8, offset: 1976)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 8, elements: !597)
!597 = !{!598}
!598 = !DISubrange(count: 1)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !184, file: !185, line: 1242, baseType: !600, size: 64, offset: 1984)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !602, line: 328, size: 3456, elements: !603)
!602 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!603 = !{!604, !605, !606, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !636, !637, !638, !641, !646, !647, !650, !654, !658, !662, !666, !667, !668, !669}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !601, file: !602, line: 329, baseType: !143, size: 960)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !601, file: !602, line: 330, baseType: !189, size: 64, offset: 960)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !601, file: !602, line: 332, baseType: !607, size: 64, offset: 1024)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !602, line: 332, flags: DIFlagFwdDecl)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !601, file: !602, line: 333, baseType: !64, size: 512, offset: 1088)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !601, file: !602, line: 335, baseType: !112, size: 64, offset: 1600)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !601, file: !602, line: 337, baseType: !288, size: 64, offset: 1664)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !601, file: !602, line: 338, baseType: !533, size: 64, offset: 1728)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !601, file: !602, line: 340, baseType: !89, size: 128, offset: 1792)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !601, file: !602, line: 340, baseType: !89, size: 128, offset: 1920)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !601, file: !602, line: 342, baseType: !54, size: 32, offset: 2048)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !601, file: !602, line: 342, baseType: !54, size: 32, offset: 2080)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !601, file: !602, line: 343, baseType: !54, size: 32, offset: 2112)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !601, file: !602, line: 345, baseType: !54, size: 32, offset: 2144)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !601, file: !602, line: 346, baseType: !54, size: 32, offset: 2176)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !601, file: !602, line: 347, baseType: !79, size: 16, offset: 2208)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !601, file: !602, line: 348, baseType: !79, size: 16, offset: 2224)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !601, file: !602, line: 349, baseType: !54, size: 32, offset: 2240)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !601, file: !602, line: 351, baseType: !54, size: 32, offset: 2272)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !601, file: !602, line: 353, baseType: !79, size: 16, offset: 2304)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !601, file: !602, line: 354, baseType: !79, size: 16, offset: 2320)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !601, file: !602, line: 355, baseType: !54, size: 32, offset: 2336)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !601, file: !602, line: 357, baseType: !628, size: 128, offset: 2368)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !629, line: 95, baseType: !630)
!629 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !629, line: 92, size: 128, elements: !631)
!631 = !{!632, !633, !634, !635}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !630, file: !629, line: 93, baseType: !222, size: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !630, file: !629, line: 93, baseType: !222, size: 32, offset: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !630, file: !629, line: 94, baseType: !222, size: 32, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !630, file: !629, line: 94, baseType: !222, size: 32, offset: 96)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !601, file: !602, line: 363, baseType: !89, size: 128, offset: 2496)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !601, file: !602, line: 363, baseType: !89, size: 128, offset: 2624)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !601, file: !602, line: 368, baseType: !639, size: 64, offset: 2752)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !602, line: 48, flags: DIFlagFwdDecl)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !601, file: !602, line: 372, baseType: !642, size: 32, offset: 2816)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !602, line: 274, baseType: !643)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !602, line: 271, size: 32, elements: !644)
!644 = !{!645}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !643, file: !602, line: 273, baseType: !5, size: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !601, file: !602, line: 373, baseType: !54, size: 32, offset: 2848)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !601, file: !602, line: 382, baseType: !648, size: 64, offset: 2880)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !602, line: 46, flags: DIFlagFwdDecl)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !601, file: !602, line: 385, baseType: !651, size: 64, offset: 2944)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DISubroutineType(types: !653)
!653 = !{null, !87, !222}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !601, file: !602, line: 386, baseType: !655, size: 64, offset: 3008)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DISubroutineType(types: !657)
!657 = !{null, !87, !318}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !601, file: !602, line: 387, baseType: !659, size: 64, offset: 3072)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DISubroutineType(types: !661)
!661 = !{!54, !87}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !601, file: !602, line: 388, baseType: !663, size: 64, offset: 3136)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{null, !87}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !601, file: !602, line: 389, baseType: !87, size: 64, offset: 3200)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !601, file: !602, line: 389, baseType: !87, size: 64, offset: 3264)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !601, file: !602, line: 389, baseType: !87, size: 64, offset: 3328)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !601, file: !602, line: 389, baseType: !87, size: 64, offset: 3392)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !184, file: !185, line: 1244, baseType: !671, size: 64, offset: 2048)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !673, line: 200, size: 17024, elements: !674)
!673 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!674 = !{!675, !676, !677, !678, !1091, !1092, !1093, !1094, !1095, !1096, !1097}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !672, file: !673, line: 201, baseType: !525, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !672, file: !673, line: 202, baseType: !89, size: 128, offset: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !672, file: !673, line: 203, baseType: !89, size: 128, offset: 192)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !672, file: !673, line: 206, baseType: !679, size: 64, offset: 320)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !673, line: 190, baseType: !681)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !673, line: 126, size: 2816, elements: !682)
!682 = !{!683, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !781, !782, !783, !784, !1062, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1090}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !681, file: !673, line: 127, baseType: !684, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !681, file: !673, line: 127, baseType: !684, size: 64, offset: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !681, file: !673, line: 128, baseType: !87, size: 64, offset: 128)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !681, file: !673, line: 129, baseType: !87, size: 64, offset: 192)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !681, file: !673, line: 130, baseType: !64, size: 512, offset: 256)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !681, file: !673, line: 132, baseType: !54, size: 32, offset: 768)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !681, file: !673, line: 132, baseType: !54, size: 32, offset: 800)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !681, file: !673, line: 133, baseType: !54, size: 32, offset: 832)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !681, file: !673, line: 134, baseType: !54, size: 32, offset: 864)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !681, file: !673, line: 134, baseType: !54, size: 32, offset: 896)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !681, file: !673, line: 134, baseType: !54, size: 32, offset: 928)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !681, file: !673, line: 135, baseType: !54, size: 32, offset: 960)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !681, file: !673, line: 135, baseType: !54, size: 32, offset: 992)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !681, file: !673, line: 136, baseType: !54, size: 32, offset: 1024)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !681, file: !673, line: 136, baseType: !54, size: 32, offset: 1056)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !681, file: !673, line: 137, baseType: !54, size: 32, offset: 1088)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !681, file: !673, line: 137, baseType: !54, size: 32, offset: 1120)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !681, file: !673, line: 138, baseType: !222, size: 32, offset: 1152)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !681, file: !673, line: 139, baseType: !222, size: 32, offset: 1184)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !681, file: !673, line: 139, baseType: !222, size: 32, offset: 1216)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !681, file: !673, line: 141, baseType: !79, size: 16, offset: 1248)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !681, file: !673, line: 142, baseType: !79, size: 16, offset: 1264)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !681, file: !673, line: 143, baseType: !54, size: 32, offset: 1280)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !681, file: !673, line: 144, baseType: !54, size: 32, offset: 1312)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !681, file: !673, line: 146, baseType: !709, size: 64, offset: 1344)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !673, line: 114, baseType: !711)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !673, line: 99, size: 7232, elements: !712)
!712 = !{!713, !715, !716, !717, !718, !719, !720, !731, !735, !749, !758, !765, !775}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !711, file: !673, line: 100, baseType: !714, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !711, file: !673, line: 100, baseType: !714, size: 64, offset: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !711, file: !673, line: 101, baseType: !54, size: 32, offset: 128)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !711, file: !673, line: 101, baseType: !54, size: 32, offset: 160)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !711, file: !673, line: 102, baseType: !54, size: 32, offset: 192)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !711, file: !673, line: 102, baseType: !54, size: 32, offset: 224)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !711, file: !673, line: 103, baseType: !721, size: 64, offset: 256)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !673, line: 59, baseType: !723)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !673, line: 56, size: 2112, elements: !724)
!724 = !{!725, !729, !730}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !723, file: !673, line: 57, baseType: !726, size: 2048)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 2048, elements: !727)
!727 = !{!728}
!728 = !DISubrange(count: 256)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !723, file: !673, line: 58, baseType: !54, size: 32, offset: 2048)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !723, file: !673, line: 58, baseType: !54, size: 32, offset: 2080)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !711, file: !673, line: 106, baseType: !732, size: 6144, offset: 320)
!732 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 6144, elements: !733)
!733 = !{!734}
!734 = !DISubrange(count: 768)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !711, file: !673, line: 107, baseType: !736, size: 64, offset: 6464)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !673, line: 97, baseType: !738)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !673, line: 83, size: 8320, elements: !739)
!739 = !{!740, !741, !742, !745, !746, !747, !748}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !738, file: !673, line: 84, baseType: !732, size: 6144)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !738, file: !673, line: 87, baseType: !726, size: 2048, offset: 6144)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !738, file: !673, line: 88, baseType: !743, size: 64, offset: 8192)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !539, line: 41, flags: DIFlagFwdDecl)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !738, file: !673, line: 90, baseType: !79, size: 16, offset: 8256)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !738, file: !673, line: 92, baseType: !79, size: 16, offset: 8272)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !738, file: !673, line: 93, baseType: !79, size: 16, offset: 8288)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !738, file: !673, line: 95, baseType: !79, size: 16, offset: 8304)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !711, file: !673, line: 108, baseType: !750, size: 64, offset: 6528)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !673, line: 66, baseType: !752)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !673, line: 61, size: 128, elements: !753)
!753 = !{!754, !755, !756, !757}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !752, file: !673, line: 62, baseType: !54, size: 32)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !752, file: !673, line: 63, baseType: !54, size: 32, offset: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !752, file: !673, line: 64, baseType: !54, size: 32, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !752, file: !673, line: 65, baseType: !54, size: 32, offset: 96)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !711, file: !673, line: 109, baseType: !759, size: 64, offset: 6592)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !673, line: 71, baseType: !761)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !673, line: 68, size: 64, elements: !762)
!762 = !{!763, !764}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !761, file: !673, line: 69, baseType: !54, size: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !761, file: !673, line: 70, baseType: !54, size: 32, offset: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !711, file: !673, line: 110, baseType: !766, size: 64, offset: 6656)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !673, line: 81, baseType: !768)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !673, line: 73, size: 352, elements: !769)
!769 = !{!770, !771, !772, !773, !774}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !768, file: !673, line: 74, baseType: !257, size: 96)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !768, file: !673, line: 75, baseType: !257, size: 96, offset: 96)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !768, file: !673, line: 76, baseType: !257, size: 96, offset: 192)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !768, file: !673, line: 77, baseType: !54, size: 32, offset: 288)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !768, file: !673, line: 78, baseType: !54, size: 32, offset: 320)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !711, file: !673, line: 113, baseType: !776, size: 512, offset: 6720)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !777, line: 182, baseType: !778)
!777 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !777, line: 180, size: 512, elements: !779)
!779 = !{!780}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !778, file: !777, line: 181, baseType: !64, size: 512)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !681, file: !673, line: 148, baseType: !214, size: 64, offset: 1408)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !681, file: !673, line: 151, baseType: !183, size: 64, offset: 1472)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !681, file: !673, line: 152, baseType: !193, size: 64, offset: 1536)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !681, file: !673, line: 153, baseType: !785, size: 64, offset: 1600)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !787, line: 64, size: 19136, elements: !788)
!787 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!788 = !{!789, !790, !791, !792, !793, !794, !796, !797, !798, !799, !802, !803, !1048, !1049, !1057, !1058, !1059, !1060, !1061}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !786, file: !787, line: 65, baseType: !143, size: 960)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !786, file: !787, line: 66, baseType: !189, size: 64, offset: 960)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !786, file: !787, line: 68, baseType: !161, size: 8192, offset: 1024)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !786, file: !787, line: 70, baseType: !54, size: 32, offset: 9216)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !786, file: !787, line: 71, baseType: !54, size: 32, offset: 9248)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !786, file: !787, line: 72, baseType: !795, size: 64, offset: 9280)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 64, elements: !534)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !786, file: !787, line: 74, baseType: !222, size: 32, offset: 9344)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !786, file: !787, line: 74, baseType: !222, size: 32, offset: 9376)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !786, file: !787, line: 76, baseType: !743, size: 64, offset: 9408)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !786, file: !787, line: 77, baseType: !800, size: 64, offset: 9472)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !787, line: 77, flags: DIFlagFwdDecl)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !786, file: !787, line: 78, baseType: !288, size: 64, offset: 9536)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !786, file: !787, line: 80, baseType: !804, size: 2624, offset: 9600)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !805, line: 340, size: 2624, elements: !806)
!805 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!806 = !{!807, !835, !853, !854, !855, !870, !928, !929, !1028, !1029, !1030, !1031, !1037}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !804, file: !805, line: 341, baseType: !808, size: 576)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !805, line: 251, baseType: !809)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !805, line: 207, size: 576, elements: !810)
!810 = !{!811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !809, file: !805, line: 208, baseType: !54, size: 32)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !809, file: !805, line: 211, baseType: !79, size: 16, offset: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !809, file: !805, line: 212, baseType: !79, size: 16, offset: 48)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !809, file: !805, line: 213, baseType: !222, size: 32, offset: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !809, file: !805, line: 214, baseType: !79, size: 16, offset: 96)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !809, file: !805, line: 215, baseType: !79, size: 16, offset: 112)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !809, file: !805, line: 216, baseType: !79, size: 16, offset: 128)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !809, file: !805, line: 217, baseType: !79, size: 16, offset: 144)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !809, file: !805, line: 218, baseType: !79, size: 16, offset: 160)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !809, file: !805, line: 219, baseType: !79, size: 16, offset: 176)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !809, file: !805, line: 220, baseType: !222, size: 32, offset: 192)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !809, file: !805, line: 222, baseType: !79, size: 16, offset: 224)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !809, file: !805, line: 225, baseType: !79, size: 16, offset: 240)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !809, file: !805, line: 228, baseType: !54, size: 32, offset: 256)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !809, file: !805, line: 229, baseType: !54, size: 32, offset: 288)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !809, file: !805, line: 233, baseType: !54, size: 32, offset: 320)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !809, file: !805, line: 236, baseType: !79, size: 16, offset: 352)
