; ModuleID = 'blender/source/blender/nodes/shader/nodes/node_shader_output.c'
source_filename = "blender/source/blender/nodes/shader/nodes/node_shader_output.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!9 = !DIFile(filename: "blender/source/blender/gpu/GPU_material.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!10 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21}
!12 = !DIEnumerator(name: "GPU_NONE", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "GPU_FLOAT", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "GPU_VEC2", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "GPU_VEC3", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "GPU_VEC4", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "GPU_MAT3", value: 9, isUnsigned: true)
!18 = !DIEnumerator(name: "GPU_MAT4", value: 16, isUnsigned: true)
!19 = !DIEnumerator(name: "GPU_TEX2D", value: 1002, isUnsigned: true)
!20 = !DIEnumerator(name: "GPU_SHADOW2D", value: 1003, isUnsigned: true)
!21 = !DIEnumerator(name: "GPU_ATTRIB", value: 3001, isUnsigned: true)
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNodeSocketDatatype", file: !23, line: 135, baseType: !24, size: 32, elements: !25)
!23 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!24 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34}
!26 = !DIEnumerator(name: "SOCK_CUSTOM", value: -1)
!27 = !DIEnumerator(name: "SOCK_FLOAT", value: 0)
!28 = !DIEnumerator(name: "SOCK_VECTOR", value: 1)
!29 = !DIEnumerator(name: "SOCK_RGBA", value: 2)
!30 = !DIEnumerator(name: "SOCK_SHADER", value: 3)
!31 = !DIEnumerator(name: "SOCK_BOOLEAN", value: 4)
!32 = !DIEnumerator(name: "__SOCK_MESH", value: 5)
!33 = !DIEnumerator(name: "SOCK_INT", value: 6)
!34 = !DIEnumerator(name: "SOCK_STRING", value: 7)
!35 = !{!36}
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "ShaderCallData", file: !38, line: 92, baseType: !39)
!38 = !DIFile(filename: "blender/source/blender/nodes/shader/node_shader_util.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ShaderCallData", file: !38, line: 89, size: 128, elements: !40)
!40 = !{!41, !2398}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "shi", scope: !39, file: !38, line: 90, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "ShadeInput", file: !44, line: 186, baseType: !45)
!44 = !DIFile(filename: "blender/source/blender/render/extern/include/RE_shader_ext.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ShadeInput", file: !44, line: 98, size: 11776, elements: !46)
!46 = !{!47, !2252, !2255, !2258, !2261, !2264, !2265, !2266, !2267, !2270, !2271, !2272, !2273, !2274, !2275, !2276, !2277, !2278, !2279, !2280, !2281, !2282, !2283, !2284, !2285, !2286, !2287, !2288, !2289, !2290, !2291, !2292, !2293, !2294, !2295, !2296, !2297, !2298, !2299, !2300, !2301, !2302, !2303, !2304, !2305, !2306, !2307, !2308, !2309, !2310, !2311, !2312, !2313, !2314, !2315, !2316, !2317, !2318, !2319, !2320, !2321, !2322, !2323, !2324, !2325, !2326, !2327, !2328, !2329, !2330, !2331, !2332, !2333, !2342, !2349, !2350, !2351, !2352, !2353, !2354, !2355, !2356, !2357, !2358, !2359, !2360, !2361, !2362, !2363, !2364, !2365, !2366, !2367, !2368, !2369, !2370, !2371, !2372, !2373, !2374, !2375, !2376, !2377, !2378, !2379, !2380, !2381, !2382, !2383, !2384, !2385, !2386, !2387, !2388, !2389, !2390, !2391, !2392, !2393, !2394, !2395, !2396, !2397}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !45, file: !44, line: 102, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !50, line: 93, size: 7552, elements: !51)
!50 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!51 = !{!52, !123, !126, !127, !128, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !176, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !245, !246, !247, !248, !249, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !2211, !2212, !2213, !2214, !2215, !2216, !2217, !2218, !2219, !2220, !2221, !2222, !2223, !2224, !2225, !2226, !2227, !2228, !2229, !2230, !2231, !2232, !2233, !2234, !2235, !2236, !2237, !2238, !2239, !2240, !2241, !2242, !2243, !2251}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !49, file: !50, line: 94, baseType: !53, size: 960)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !54, line: 130, baseType: !55)
!54 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !54, line: 117, size: 960, elements: !56)
!56 = !{!57, !59, !60, !62, !82, !86, !88, !89, !90, !91}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !55, file: !54, line: 118, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !55, file: !54, line: 118, baseType: !58, size: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !55, file: !54, line: 119, baseType: !61, size: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !55, file: !54, line: 120, baseType: !63, size: 64, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !54, line: 136, size: 17600, elements: !65)
!65 = !{!66, !67, !69, !72, !77, !78, !79}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !64, file: !54, line: 137, baseType: !53, size: 960)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !64, file: !54, line: 138, baseType: !68, size: 64, offset: 960)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !64, file: !54, line: 139, baseType: !70, size: 64, offset: 1024)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !54, line: 43, flags: DIFlagFwdDecl)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !64, file: !54, line: 140, baseType: !73, size: 8192, offset: 1088)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 8192, elements: !75)
!74 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!75 = !{!76}
!76 = !DISubrange(count: 1024)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !64, file: !54, line: 141, baseType: !73, size: 8192, offset: 9280)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !64, file: !54, line: 148, baseType: !63, size: 64, offset: 17472)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !64, file: !54, line: 150, baseType: !80, size: 64, offset: 17536)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !54, line: 45, flags: DIFlagFwdDecl)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !55, file: !54, line: 121, baseType: !83, size: 528, offset: 256)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 528, elements: !84)
!84 = !{!85}
!85 = !DISubrange(count: 66)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !55, file: !54, line: 126, baseType: !87, size: 16, offset: 784)
!87 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !55, file: !54, line: 127, baseType: !24, size: 32, offset: 800)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !55, file: !54, line: 128, baseType: !24, size: 32, offset: 832)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !55, file: !54, line: 128, baseType: !24, size: 32, offset: 864)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !55, file: !54, line: 129, baseType: !92, size: 64, offset: 896)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !54, line: 75, baseType: !94)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !54, line: 62, size: 1024, elements: !95)
!95 = !{!96, !98, !99, !100, !101, !102, !106, !107, !121, !122}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !94, file: !54, line: 63, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !94, file: !54, line: 63, baseType: !97, size: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !94, file: !54, line: 64, baseType: !74, size: 8, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !94, file: !54, line: 64, baseType: !74, size: 8, offset: 136)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !94, file: !54, line: 65, baseType: !87, size: 16, offset: 144)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !94, file: !54, line: 66, baseType: !103, size: 512, offset: 160)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 512, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !94, file: !54, line: 67, baseType: !24, size: 32, offset: 672)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !94, file: !54, line: 69, baseType: !108, size: 256, offset: 704)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !54, line: 60, baseType: !109)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !54, line: 48, size: 256, elements: !110)
!110 = !{!111, !112, !119, !120}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !109, file: !54, line: 49, baseType: !58, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !109, file: !54, line: 58, baseType: !113, size: 128, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !114, line: 71, baseType: !115)
!114 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !114, line: 69, size: 128, elements: !116)
!116 = !{!117, !118}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !115, file: !114, line: 70, baseType: !58, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !115, file: !114, line: 70, baseType: !58, size: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !109, file: !54, line: 59, baseType: !24, size: 32, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !109, file: !54, line: 59, baseType: !24, size: 32, offset: 224)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !94, file: !54, line: 70, baseType: !24, size: 32, offset: 960)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !94, file: !54, line: 74, baseType: !24, size: 32, offset: 992)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !49, file: !50, line: 95, baseType: !124, size: 64, offset: 960)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !50, line: 48, flags: DIFlagFwdDecl)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !49, file: !50, line: 97, baseType: !87, size: 16, offset: 1024)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !49, file: !50, line: 97, baseType: !87, size: 16, offset: 1040)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !49, file: !50, line: 99, baseType: !129, size: 32, offset: 1056)
!129 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !49, file: !50, line: 99, baseType: !129, size: 32, offset: 1088)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !49, file: !50, line: 99, baseType: !129, size: 32, offset: 1120)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !49, file: !50, line: 100, baseType: !129, size: 32, offset: 1152)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !49, file: !50, line: 100, baseType: !129, size: 32, offset: 1184)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !49, file: !50, line: 100, baseType: !129, size: 32, offset: 1216)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !49, file: !50, line: 101, baseType: !129, size: 32, offset: 1248)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !49, file: !50, line: 101, baseType: !129, size: 32, offset: 1280)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !49, file: !50, line: 101, baseType: !129, size: 32, offset: 1312)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !49, file: !50, line: 102, baseType: !129, size: 32, offset: 1344)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !49, file: !50, line: 102, baseType: !129, size: 32, offset: 1376)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !49, file: !50, line: 102, baseType: !129, size: 32, offset: 1408)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !49, file: !50, line: 103, baseType: !129, size: 32, offset: 1440)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !49, file: !50, line: 103, baseType: !129, size: 32, offset: 1472)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !49, file: !50, line: 103, baseType: !129, size: 32, offset: 1504)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !49, file: !50, line: 103, baseType: !129, size: 32, offset: 1536)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !49, file: !50, line: 103, baseType: !129, size: 32, offset: 1568)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !49, file: !50, line: 104, baseType: !129, size: 32, offset: 1600)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !49, file: !50, line: 104, baseType: !129, size: 32, offset: 1632)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !49, file: !50, line: 104, baseType: !129, size: 32, offset: 1664)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !49, file: !50, line: 104, baseType: !129, size: 32, offset: 1696)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !49, file: !50, line: 104, baseType: !129, size: 32, offset: 1728)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !49, file: !50, line: 105, baseType: !129, size: 32, offset: 1760)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !49, file: !50, line: 108, baseType: !153, size: 704, offset: 1792)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !50, line: 53, size: 704, elements: !154)
!154 = !{!155, !156, !157, !158, !159, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !153, file: !50, line: 54, baseType: !129, size: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !153, file: !50, line: 55, baseType: !129, size: 32, offset: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !153, file: !50, line: 56, baseType: !129, size: 32, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !153, file: !50, line: 57, baseType: !129, size: 32, offset: 96)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !153, file: !50, line: 59, baseType: !160, size: 96, offset: 128)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 96, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 3)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !153, file: !50, line: 60, baseType: !160, size: 96, offset: 224)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !153, file: !50, line: 61, baseType: !160, size: 96, offset: 320)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !153, file: !50, line: 63, baseType: !129, size: 32, offset: 416)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !153, file: !50, line: 64, baseType: !129, size: 32, offset: 448)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !153, file: !50, line: 65, baseType: !129, size: 32, offset: 480)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !153, file: !50, line: 67, baseType: !87, size: 16, offset: 512)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !153, file: !50, line: 68, baseType: !87, size: 16, offset: 528)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !153, file: !50, line: 69, baseType: !87, size: 16, offset: 544)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !153, file: !50, line: 70, baseType: !87, size: 16, offset: 560)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !153, file: !50, line: 72, baseType: !129, size: 32, offset: 576)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !153, file: !50, line: 73, baseType: !129, size: 32, offset: 608)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !153, file: !50, line: 74, baseType: !129, size: 32, offset: 640)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !153, file: !50, line: 75, baseType: !129, size: 32, offset: 672)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !49, file: !50, line: 109, baseType: !177, size: 128, offset: 2496)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !50, line: 79, size: 128, elements: !178)
!178 = !{!179, !180, !181, !182}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !177, file: !50, line: 80, baseType: !24, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !177, file: !50, line: 81, baseType: !24, size: 32, offset: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !177, file: !50, line: 82, baseType: !24, size: 32, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !177, file: !50, line: 83, baseType: !24, size: 32, offset: 96)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !49, file: !50, line: 111, baseType: !129, size: 32, offset: 2624)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !49, file: !50, line: 111, baseType: !129, size: 32, offset: 2656)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !49, file: !50, line: 112, baseType: !129, size: 32, offset: 2688)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !49, file: !50, line: 112, baseType: !129, size: 32, offset: 2720)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !49, file: !50, line: 113, baseType: !129, size: 32, offset: 2752)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !49, file: !50, line: 114, baseType: !129, size: 32, offset: 2784)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !49, file: !50, line: 114, baseType: !129, size: 32, offset: 2816)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !49, file: !50, line: 115, baseType: !87, size: 16, offset: 2848)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !49, file: !50, line: 115, baseType: !87, size: 16, offset: 2864)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !49, file: !50, line: 116, baseType: !87, size: 16, offset: 2880)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !49, file: !50, line: 117, baseType: !74, size: 8, offset: 2896)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !49, file: !50, line: 117, baseType: !74, size: 8, offset: 2904)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !49, file: !50, line: 119, baseType: !129, size: 32, offset: 2912)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !49, file: !50, line: 119, baseType: !129, size: 32, offset: 2944)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !49, file: !50, line: 120, baseType: !87, size: 16, offset: 2976)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !49, file: !50, line: 120, baseType: !87, size: 16, offset: 2992)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !49, file: !50, line: 121, baseType: !129, size: 32, offset: 3008)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !49, file: !50, line: 121, baseType: !129, size: 32, offset: 3040)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !49, file: !50, line: 122, baseType: !129, size: 32, offset: 3072)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !49, file: !50, line: 123, baseType: !129, size: 32, offset: 3104)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !49, file: !50, line: 124, baseType: !87, size: 16, offset: 3136)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !49, file: !50, line: 125, baseType: !87, size: 16, offset: 3152)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !49, file: !50, line: 127, baseType: !24, size: 32, offset: 3168)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !49, file: !50, line: 127, baseType: !24, size: 32, offset: 3200)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !49, file: !50, line: 128, baseType: !24, size: 32, offset: 3232)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !49, file: !50, line: 128, baseType: !24, size: 32, offset: 3264)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !49, file: !50, line: 129, baseType: !87, size: 16, offset: 3296)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !49, file: !50, line: 129, baseType: !87, size: 16, offset: 3312)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !49, file: !50, line: 129, baseType: !87, size: 16, offset: 3328)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !49, file: !50, line: 129, baseType: !87, size: 16, offset: 3344)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !49, file: !50, line: 130, baseType: !129, size: 32, offset: 3360)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !49, file: !50, line: 130, baseType: !129, size: 32, offset: 3392)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !49, file: !50, line: 130, baseType: !129, size: 32, offset: 3424)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !49, file: !50, line: 130, baseType: !129, size: 32, offset: 3456)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !49, file: !50, line: 131, baseType: !129, size: 32, offset: 3488)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !49, file: !50, line: 131, baseType: !129, size: 32, offset: 3520)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !49, file: !50, line: 131, baseType: !129, size: 32, offset: 3552)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !49, file: !50, line: 131, baseType: !129, size: 32, offset: 3584)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !49, file: !50, line: 132, baseType: !129, size: 32, offset: 3616)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !49, file: !50, line: 132, baseType: !129, size: 32, offset: 3648)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !49, file: !50, line: 133, baseType: !103, size: 512, offset: 3680)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !49, file: !50, line: 135, baseType: !129, size: 32, offset: 4192)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !49, file: !50, line: 136, baseType: !129, size: 32, offset: 4224)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !49, file: !50, line: 137, baseType: !129, size: 32, offset: 4256)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !49, file: !50, line: 138, baseType: !24, size: 32, offset: 4288)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !49, file: !50, line: 141, baseType: !74, size: 8, offset: 4320)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !49, file: !50, line: 141, baseType: !74, size: 8, offset: 4328)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !49, file: !50, line: 141, baseType: !74, size: 8, offset: 4336)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !49, file: !50, line: 141, baseType: !74, size: 8, offset: 4344)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !49, file: !50, line: 142, baseType: !87, size: 16, offset: 4352)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !49, file: !50, line: 142, baseType: !87, size: 16, offset: 4368)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !49, file: !50, line: 142, baseType: !87, size: 16, offset: 4384)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !49, file: !50, line: 145, baseType: !74, size: 8, offset: 4400)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !49, file: !50, line: 145, baseType: !74, size: 8, offset: 4408)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !49, file: !50, line: 148, baseType: !87, size: 16, offset: 4416)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !49, file: !50, line: 148, baseType: !87, size: 16, offset: 4432)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !49, file: !50, line: 149, baseType: !129, size: 32, offset: 4448)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !49, file: !50, line: 149, baseType: !129, size: 32, offset: 4480)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !49, file: !50, line: 152, baseType: !242, size: 128, offset: 4512)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 128, elements: !243)
!243 = !{!244}
!244 = !DISubrange(count: 4)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !49, file: !50, line: 153, baseType: !129, size: 32, offset: 4640)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !49, file: !50, line: 154, baseType: !129, size: 32, offset: 4672)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !49, file: !50, line: 157, baseType: !87, size: 16, offset: 4704)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !49, file: !50, line: 157, baseType: !87, size: 16, offset: 4720)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !49, file: !50, line: 160, baseType: !250, size: 64, offset: 4736)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !252, line: 113, size: 6208, elements: !253)
!252 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!253 = !{!254, !255, !256, !257, !258, !259, !263}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !251, file: !252, line: 114, baseType: !87, size: 16)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !251, file: !252, line: 114, baseType: !87, size: 16, offset: 16)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !251, file: !252, line: 115, baseType: !74, size: 8, offset: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !251, file: !252, line: 115, baseType: !74, size: 8, offset: 40)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !251, file: !252, line: 116, baseType: !74, size: 8, offset: 48)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !251, file: !252, line: 117, baseType: !260, size: 8, offset: 56)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 8, elements: !261)
!261 = !{!262}
!262 = !DISubrange(count: 1)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !251, file: !252, line: 119, baseType: !264, size: 6144, offset: 64)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !265, size: 6144, elements: !274)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !252, line: 109, baseType: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !252, line: 106, size: 192, elements: !267)
!267 = !{!268, !269, !270, !271, !272, !273}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !266, file: !252, line: 107, baseType: !129, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !266, file: !252, line: 107, baseType: !129, size: 32, offset: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !266, file: !252, line: 107, baseType: !129, size: 32, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !266, file: !252, line: 107, baseType: !129, size: 32, offset: 96)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !266, file: !252, line: 107, baseType: !129, size: 32, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !266, file: !252, line: 108, baseType: !24, size: 32, offset: 160)
!274 = !{!275}
!275 = !DISubrange(count: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !49, file: !50, line: 161, baseType: !250, size: 64, offset: 4800)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !49, file: !50, line: 162, baseType: !74, size: 8, offset: 4864)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !49, file: !50, line: 162, baseType: !74, size: 8, offset: 4872)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !49, file: !50, line: 163, baseType: !74, size: 8, offset: 4880)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !49, file: !50, line: 163, baseType: !74, size: 8, offset: 4888)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !49, file: !50, line: 164, baseType: !87, size: 16, offset: 4896)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !49, file: !50, line: 164, baseType: !87, size: 16, offset: 4912)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !49, file: !50, line: 165, baseType: !129, size: 32, offset: 4928)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !49, file: !50, line: 165, baseType: !129, size: 32, offset: 4960)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !49, file: !50, line: 167, baseType: !286, size: 1152, offset: 4992)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, size: 1152, elements: !2209)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !252, line: 57, size: 2496, elements: !289)
!289 = !{!290, !291, !292, !293, !294, !2006, !2150, !2151, !2152, !2153, !2154, !2155, !2156, !2157, !2158, !2159, !2160, !2161, !2162, !2163, !2164, !2165, !2166, !2167, !2168, !2169, !2170, !2171, !2172, !2173, !2174, !2175, !2176, !2177, !2178, !2179, !2180, !2181, !2182, !2183, !2184, !2185, !2186, !2187, !2188, !2189, !2190, !2191, !2192, !2193, !2194, !2195, !2196, !2197, !2198, !2199, !2200, !2201, !2202, !2203, !2204, !2205, !2206, !2207, !2208}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !288, file: !252, line: 59, baseType: !87, size: 16)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !288, file: !252, line: 59, baseType: !87, size: 16, offset: 16)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !288, file: !252, line: 59, baseType: !87, size: 16, offset: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !288, file: !252, line: 59, baseType: !87, size: 16, offset: 48)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !288, file: !252, line: 60, baseType: !295, size: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !297, line: 115, size: 11392, elements: !298)
!297 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!298 = !{!299, !300, !301, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !318, !328, !342, !343, !384, !385, !389, !390, !406, !407, !408, !409, !410, !411, !412, !414, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !492, !493, !494, !495, !496, !497, !498, !499, !500, !503, !506, !509, !510, !511, !512, !513, !516, !519, !522, !523, !529, !530, !531, !532, !533, !534, !536, !539, !542, !546, !1994, !1995}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !296, file: !297, line: 116, baseType: !53, size: 960)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !296, file: !297, line: 117, baseType: !124, size: 64, offset: 960)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !296, file: !297, line: 119, baseType: !302, size: 64, offset: 1024)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !297, line: 57, flags: DIFlagFwdDecl)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !296, file: !297, line: 121, baseType: !87, size: 16, offset: 1088)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !296, file: !297, line: 121, baseType: !87, size: 16, offset: 1104)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !296, file: !297, line: 122, baseType: !24, size: 32, offset: 1120)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !296, file: !297, line: 122, baseType: !24, size: 32, offset: 1152)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !296, file: !297, line: 122, baseType: !24, size: 32, offset: 1184)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !296, file: !297, line: 123, baseType: !103, size: 512, offset: 1216)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !296, file: !297, line: 124, baseType: !295, size: 64, offset: 1728)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !296, file: !297, line: 124, baseType: !295, size: 64, offset: 1792)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !296, file: !297, line: 127, baseType: !295, size: 64, offset: 1856)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !296, file: !297, line: 127, baseType: !295, size: 64, offset: 1920)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !296, file: !297, line: 127, baseType: !295, size: 64, offset: 1984)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !296, file: !297, line: 128, baseType: !316, size: 64, offset: 2048)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !50, line: 49, flags: DIFlagFwdDecl)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !296, file: !297, line: 130, baseType: !319, size: 64, offset: 2112)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !297, line: 97, size: 832, elements: !321)
!321 = !{!322, !326, !327}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !320, file: !297, line: 98, baseType: !323, size: 768)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 768, elements: !324)
!324 = !{!325, !162}
!325 = !DISubrange(count: 8)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !320, file: !297, line: 99, baseType: !24, size: 32, offset: 768)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !320, file: !297, line: 99, baseType: !24, size: 32, offset: 800)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !296, file: !297, line: 131, baseType: !329, size: 64, offset: 2176)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !331, line: 486, size: 1600, elements: !332)
!331 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!332 = !{!333, !334, !335, !336, !337, !338, !339, !340, !341}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !330, file: !331, line: 487, baseType: !53, size: 960)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !330, file: !331, line: 489, baseType: !113, size: 128, offset: 960)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !330, file: !331, line: 490, baseType: !113, size: 128, offset: 1088)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !330, file: !331, line: 491, baseType: !113, size: 128, offset: 1216)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !330, file: !331, line: 492, baseType: !113, size: 128, offset: 1344)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !330, file: !331, line: 494, baseType: !24, size: 32, offset: 1472)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !330, file: !331, line: 495, baseType: !24, size: 32, offset: 1504)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !330, file: !331, line: 497, baseType: !24, size: 32, offset: 1536)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !330, file: !331, line: 498, baseType: !24, size: 32, offset: 1568)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !296, file: !297, line: 132, baseType: !329, size: 64, offset: 2240)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !296, file: !297, line: 133, baseType: !344, size: 64, offset: 2304)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !331, line: 334, size: 1728, elements: !346)
!346 = !{!347, !348, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !383}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !345, file: !331, line: 335, baseType: !113, size: 128)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !345, file: !331, line: 336, baseType: !349, size: 64, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !331, line: 47, flags: DIFlagFwdDecl)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !345, file: !331, line: 338, baseType: !87, size: 16, offset: 192)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !345, file: !331, line: 338, baseType: !87, size: 16, offset: 208)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !345, file: !331, line: 339, baseType: !10, size: 32, offset: 224)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !345, file: !331, line: 340, baseType: !24, size: 32, offset: 256)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !345, file: !331, line: 342, baseType: !129, size: 32, offset: 288)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !345, file: !331, line: 343, baseType: !160, size: 96, offset: 320)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !345, file: !331, line: 344, baseType: !160, size: 96, offset: 416)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !345, file: !331, line: 347, baseType: !113, size: 128, offset: 512)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !345, file: !331, line: 349, baseType: !24, size: 32, offset: 640)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !345, file: !331, line: 350, baseType: !24, size: 32, offset: 672)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !345, file: !331, line: 351, baseType: !58, size: 64, offset: 704)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !345, file: !331, line: 352, baseType: !58, size: 64, offset: 768)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !345, file: !331, line: 354, baseType: !364, size: 384, offset: 832)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !331, line: 116, baseType: !365)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !331, line: 94, size: 384, elements: !366)
!366 = !{!367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !365, file: !331, line: 96, baseType: !24, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !365, file: !331, line: 96, baseType: !24, size: 32, offset: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !365, file: !331, line: 97, baseType: !24, size: 32, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !365, file: !331, line: 97, baseType: !24, size: 32, offset: 96)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !365, file: !331, line: 99, baseType: !87, size: 16, offset: 128)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !365, file: !331, line: 100, baseType: !87, size: 16, offset: 144)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !365, file: !331, line: 102, baseType: !87, size: 16, offset: 160)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !365, file: !331, line: 105, baseType: !87, size: 16, offset: 176)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !365, file: !331, line: 108, baseType: !87, size: 16, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !365, file: !331, line: 109, baseType: !87, size: 16, offset: 208)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !365, file: !331, line: 111, baseType: !87, size: 16, offset: 224)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !365, file: !331, line: 112, baseType: !87, size: 16, offset: 240)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !365, file: !331, line: 114, baseType: !24, size: 32, offset: 256)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !365, file: !331, line: 114, baseType: !24, size: 32, offset: 288)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !365, file: !331, line: 115, baseType: !24, size: 32, offset: 320)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !365, file: !331, line: 115, baseType: !24, size: 32, offset: 352)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !345, file: !331, line: 355, baseType: !103, size: 512, offset: 1216)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !296, file: !297, line: 134, baseType: !58, size: 64, offset: 2368)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !296, file: !297, line: 136, baseType: !386, size: 64, offset: 2432)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !388, line: 61, flags: DIFlagFwdDecl)
!388 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!389 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !296, file: !297, line: 138, baseType: !364, size: 384, offset: 2496)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !296, file: !297, line: 139, baseType: !391, size: 64, offset: 2880)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !331, line: 80, baseType: !393)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !331, line: 72, size: 192, elements: !394)
!394 = !{!395, !402, !403, !404, !405}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !393, file: !331, line: 73, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !331, line: 59, baseType: !398)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !331, line: 56, size: 128, elements: !399)
!399 = !{!400, !401}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !398, file: !331, line: 57, baseType: !160, size: 96)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !398, file: !331, line: 58, baseType: !24, size: 32, offset: 96)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !393, file: !331, line: 74, baseType: !24, size: 32, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !393, file: !331, line: 76, baseType: !24, size: 32, offset: 96)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !393, file: !331, line: 77, baseType: !24, size: 32, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !393, file: !331, line: 79, baseType: !24, size: 32, offset: 160)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !296, file: !297, line: 141, baseType: !113, size: 128, offset: 2944)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !296, file: !297, line: 142, baseType: !113, size: 128, offset: 3072)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !296, file: !297, line: 143, baseType: !113, size: 128, offset: 3200)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !296, file: !297, line: 144, baseType: !113, size: 128, offset: 3328)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !296, file: !297, line: 146, baseType: !24, size: 32, offset: 3456)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !296, file: !297, line: 147, baseType: !24, size: 32, offset: 3488)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !296, file: !297, line: 150, baseType: !413, size: 64, offset: 3520)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !296, file: !297, line: 151, baseType: !415, size: 64, offset: 3584)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !296, file: !297, line: 152, baseType: !24, size: 32, offset: 3648)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !296, file: !297, line: 153, baseType: !24, size: 32, offset: 3680)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !296, file: !297, line: 156, baseType: !160, size: 96, offset: 3712)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !296, file: !297, line: 156, baseType: !160, size: 96, offset: 3808)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !296, file: !297, line: 156, baseType: !160, size: 96, offset: 3904)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !296, file: !297, line: 157, baseType: !160, size: 96, offset: 4000)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !296, file: !297, line: 158, baseType: !160, size: 96, offset: 4096)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !296, file: !297, line: 159, baseType: !160, size: 96, offset: 4192)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !296, file: !297, line: 160, baseType: !160, size: 96, offset: 4288)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !296, file: !297, line: 160, baseType: !160, size: 96, offset: 4384)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !296, file: !297, line: 161, baseType: !242, size: 128, offset: 4480)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !296, file: !297, line: 161, baseType: !242, size: 128, offset: 4608)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !296, file: !297, line: 162, baseType: !160, size: 96, offset: 4736)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !296, file: !297, line: 162, baseType: !160, size: 96, offset: 4832)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !296, file: !297, line: 163, baseType: !129, size: 32, offset: 4928)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !296, file: !297, line: 163, baseType: !129, size: 32, offset: 4960)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !296, file: !297, line: 164, baseType: !433, size: 512, offset: 4992)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 512, elements: !434)
!434 = !{!244, !244}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !296, file: !297, line: 165, baseType: !433, size: 512, offset: 5504)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !296, file: !297, line: 166, baseType: !433, size: 512, offset: 6016)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !296, file: !297, line: 167, baseType: !433, size: 512, offset: 6528)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !296, file: !297, line: 176, baseType: !433, size: 512, offset: 7040)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !296, file: !297, line: 178, baseType: !10, size: 32, offset: 7552)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !296, file: !297, line: 180, baseType: !87, size: 16, offset: 7584)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !296, file: !297, line: 181, baseType: !87, size: 16, offset: 7600)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !296, file: !297, line: 183, baseType: !87, size: 16, offset: 7616)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !296, file: !297, line: 183, baseType: !87, size: 16, offset: 7632)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !296, file: !297, line: 184, baseType: !87, size: 16, offset: 7648)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !296, file: !297, line: 184, baseType: !87, size: 16, offset: 7664)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !296, file: !297, line: 185, baseType: !87, size: 16, offset: 7680)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !296, file: !297, line: 186, baseType: !87, size: 16, offset: 7696)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !296, file: !297, line: 187, baseType: !87, size: 16, offset: 7712)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !296, file: !297, line: 188, baseType: !74, size: 8, offset: 7728)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !296, file: !297, line: 189, baseType: !74, size: 8, offset: 7736)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !296, file: !297, line: 192, baseType: !24, size: 32, offset: 7744)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !296, file: !297, line: 192, baseType: !24, size: 32, offset: 7776)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !296, file: !297, line: 192, baseType: !24, size: 32, offset: 7808)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !296, file: !297, line: 192, baseType: !24, size: 32, offset: 7840)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !296, file: !297, line: 194, baseType: !24, size: 32, offset: 7872)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !296, file: !297, line: 202, baseType: !129, size: 32, offset: 7904)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !296, file: !297, line: 202, baseType: !129, size: 32, offset: 7936)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !296, file: !297, line: 202, baseType: !129, size: 32, offset: 7968)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !296, file: !297, line: 211, baseType: !129, size: 32, offset: 8000)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !296, file: !297, line: 212, baseType: !129, size: 32, offset: 8032)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !296, file: !297, line: 213, baseType: !129, size: 32, offset: 8064)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !296, file: !297, line: 214, baseType: !129, size: 32, offset: 8096)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !296, file: !297, line: 215, baseType: !129, size: 32, offset: 8128)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !296, file: !297, line: 216, baseType: !129, size: 32, offset: 8160)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !296, file: !297, line: 219, baseType: !129, size: 32, offset: 8192)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !296, file: !297, line: 220, baseType: !129, size: 32, offset: 8224)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !296, file: !297, line: 221, baseType: !129, size: 32, offset: 8256)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !296, file: !297, line: 224, baseType: !469, size: 16, offset: 8288)
!469 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !296, file: !297, line: 224, baseType: !469, size: 16, offset: 8304)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !296, file: !297, line: 226, baseType: !87, size: 16, offset: 8320)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !296, file: !297, line: 228, baseType: !74, size: 8, offset: 8336)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !296, file: !297, line: 229, baseType: !74, size: 8, offset: 8344)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !296, file: !297, line: 231, baseType: !87, size: 16, offset: 8352)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !296, file: !297, line: 232, baseType: !74, size: 8, offset: 8368)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !296, file: !297, line: 233, baseType: !74, size: 8, offset: 8376)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !296, file: !297, line: 234, baseType: !129, size: 32, offset: 8384)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !296, file: !297, line: 235, baseType: !129, size: 32, offset: 8416)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !296, file: !297, line: 237, baseType: !113, size: 128, offset: 8448)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !296, file: !297, line: 238, baseType: !113, size: 128, offset: 8576)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !296, file: !297, line: 239, baseType: !113, size: 128, offset: 8704)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !296, file: !297, line: 240, baseType: !113, size: 128, offset: 8832)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !296, file: !297, line: 242, baseType: !129, size: 32, offset: 8960)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !296, file: !297, line: 244, baseType: !87, size: 16, offset: 8992)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !296, file: !297, line: 245, baseType: !469, size: 16, offset: 9008)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !296, file: !297, line: 246, baseType: !242, size: 128, offset: 9024)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !296, file: !297, line: 248, baseType: !24, size: 32, offset: 9152)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !296, file: !297, line: 249, baseType: !24, size: 32, offset: 9184)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !296, file: !297, line: 251, baseType: !490, size: 64, offset: 9216)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !297, line: 251, flags: DIFlagFwdDecl)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !296, file: !297, line: 253, baseType: !74, size: 8, offset: 9280)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !296, file: !297, line: 254, baseType: !74, size: 8, offset: 9288)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !296, file: !297, line: 255, baseType: !87, size: 16, offset: 9296)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !296, file: !297, line: 256, baseType: !160, size: 96, offset: 9312)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !296, file: !297, line: 258, baseType: !113, size: 128, offset: 9408)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !296, file: !297, line: 259, baseType: !113, size: 128, offset: 9536)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !296, file: !297, line: 260, baseType: !113, size: 128, offset: 9664)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !296, file: !297, line: 261, baseType: !113, size: 128, offset: 9792)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !296, file: !297, line: 263, baseType: !501, size: 64, offset: 9920)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !297, line: 52, flags: DIFlagFwdDecl)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !296, file: !297, line: 264, baseType: !504, size: 64, offset: 9984)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !297, line: 53, flags: DIFlagFwdDecl)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !296, file: !297, line: 265, baseType: !507, size: 64, offset: 10048)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !50, line: 46, flags: DIFlagFwdDecl)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !296, file: !297, line: 267, baseType: !74, size: 8, offset: 10112)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !296, file: !297, line: 268, baseType: !74, size: 8, offset: 10120)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !296, file: !297, line: 269, baseType: !87, size: 16, offset: 10128)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !296, file: !297, line: 270, baseType: !129, size: 32, offset: 10144)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !296, file: !297, line: 272, baseType: !514, size: 64, offset: 10176)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !297, line: 54, flags: DIFlagFwdDecl)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !296, file: !297, line: 275, baseType: !517, size: 64, offset: 10240)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !297, line: 275, flags: DIFlagFwdDecl)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !296, file: !297, line: 277, baseType: !520, size: 64, offset: 10304)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !297, line: 56, flags: DIFlagFwdDecl)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !296, file: !297, line: 277, baseType: !520, size: 64, offset: 10368)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !296, file: !297, line: 278, baseType: !524, size: 64, offset: 10432)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !525, line: 27, baseType: !526)
!525 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !527, line: 45, baseType: !528)
!527 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!528 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !296, file: !297, line: 279, baseType: !524, size: 64, offset: 10496)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !296, file: !297, line: 280, baseType: !10, size: 32, offset: 10560)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !296, file: !297, line: 281, baseType: !10, size: 32, offset: 10592)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !296, file: !297, line: 283, baseType: !113, size: 128, offset: 10624)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !296, file: !297, line: 284, baseType: !113, size: 128, offset: 10752)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !296, file: !297, line: 285, baseType: !535, size: 64, offset: 10880)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !296, file: !297, line: 287, baseType: !537, size: 64, offset: 10944)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !297, line: 59, flags: DIFlagFwdDecl)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !296, file: !297, line: 288, baseType: !540, size: 64, offset: 11008)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !297, line: 288, flags: DIFlagFwdDecl)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !296, file: !297, line: 290, baseType: !543, size: 64, offset: 11072)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 64, elements: !544)
!544 = !{!545}
!545 = !DISubrange(count: 2)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !296, file: !297, line: 291, baseType: !547, size: 64, offset: 11136)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !549, line: 65, baseType: !550)
!549 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !549, line: 50, size: 320, elements: !551)
!551 = !{!552, !1981, !1982, !1983, !1984, !1985, !1986, !1987, !1988, !1989, !1990, !1991, !1992, !1993}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !550, file: !549, line: 51, baseType: !553, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !388, line: 1216, size: 39680, elements: !555)
!555 = !{!556, !557, !558, !559, !1212, !1213, !1214, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1241, !1568, !1571, !1854, !1866, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1876, !1877, !1878, !1879, !1880, !1888, !1955, !1962, !1963, !1970, !1973, !1974, !1975, !1976, !1977, !1978}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !554, file: !388, line: 1217, baseType: !53, size: 960)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !554, file: !388, line: 1218, baseType: !124, size: 64, offset: 960)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !554, file: !388, line: 1220, baseType: !295, size: 64, offset: 1024)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !554, file: !388, line: 1221, baseType: !560, size: 64, offset: 1088)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !562, line: 52, size: 4224, elements: !563)
!562 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!563 = !{!564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !633, !634, !635, !636, !637, !638, !640, !656}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !561, file: !562, line: 53, baseType: !53, size: 960)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !561, file: !562, line: 54, baseType: !124, size: 64, offset: 960)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !561, file: !562, line: 56, baseType: !87, size: 16, offset: 1024)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !561, file: !562, line: 56, baseType: !87, size: 16, offset: 1040)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !561, file: !562, line: 57, baseType: !87, size: 16, offset: 1056)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !561, file: !562, line: 57, baseType: !87, size: 16, offset: 1072)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !561, file: !562, line: 59, baseType: !129, size: 32, offset: 1088)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !561, file: !562, line: 59, baseType: !129, size: 32, offset: 1120)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !561, file: !562, line: 59, baseType: !129, size: 32, offset: 1152)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !561, file: !562, line: 60, baseType: !129, size: 32, offset: 1184)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !561, file: !562, line: 60, baseType: !129, size: 32, offset: 1216)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !561, file: !562, line: 60, baseType: !129, size: 32, offset: 1248)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !561, file: !562, line: 61, baseType: !129, size: 32, offset: 1280)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !561, file: !562, line: 61, baseType: !129, size: 32, offset: 1312)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !561, file: !562, line: 61, baseType: !129, size: 32, offset: 1344)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !561, file: !562, line: 68, baseType: !129, size: 32, offset: 1376)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !561, file: !562, line: 68, baseType: !129, size: 32, offset: 1408)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !561, file: !562, line: 68, baseType: !129, size: 32, offset: 1440)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !561, file: !562, line: 69, baseType: !129, size: 32, offset: 1472)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !561, file: !562, line: 69, baseType: !129, size: 32, offset: 1504)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !561, file: !562, line: 74, baseType: !129, size: 32, offset: 1536)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !561, file: !562, line: 79, baseType: !129, size: 32, offset: 1568)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !561, file: !562, line: 81, baseType: !87, size: 16, offset: 1600)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !561, file: !562, line: 91, baseType: !87, size: 16, offset: 1616)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !561, file: !562, line: 92, baseType: !87, size: 16, offset: 1632)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !561, file: !562, line: 93, baseType: !87, size: 16, offset: 1648)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !561, file: !562, line: 94, baseType: !87, size: 16, offset: 1664)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !561, file: !562, line: 94, baseType: !87, size: 16, offset: 1680)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !561, file: !562, line: 94, baseType: !87, size: 16, offset: 1696)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !561, file: !562, line: 94, baseType: !87, size: 16, offset: 1712)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !561, file: !562, line: 96, baseType: !129, size: 32, offset: 1728)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !561, file: !562, line: 96, baseType: !129, size: 32, offset: 1760)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !561, file: !562, line: 96, baseType: !129, size: 32, offset: 1792)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !561, file: !562, line: 96, baseType: !129, size: 32, offset: 1824)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !561, file: !562, line: 98, baseType: !129, size: 32, offset: 1856)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !561, file: !562, line: 98, baseType: !129, size: 32, offset: 1888)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !561, file: !562, line: 98, baseType: !129, size: 32, offset: 1920)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !561, file: !562, line: 98, baseType: !129, size: 32, offset: 1952)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !561, file: !562, line: 99, baseType: !129, size: 32, offset: 1984)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !561, file: !562, line: 99, baseType: !129, size: 32, offset: 2016)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !561, file: !562, line: 100, baseType: !129, size: 32, offset: 2048)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !561, file: !562, line: 100, baseType: !129, size: 32, offset: 2080)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !561, file: !562, line: 103, baseType: !87, size: 16, offset: 2112)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !561, file: !562, line: 103, baseType: !87, size: 16, offset: 2128)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !561, file: !562, line: 103, baseType: !87, size: 16, offset: 2144)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !561, file: !562, line: 103, baseType: !87, size: 16, offset: 2160)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !561, file: !562, line: 106, baseType: !129, size: 32, offset: 2176)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !561, file: !562, line: 106, baseType: !129, size: 32, offset: 2208)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !561, file: !562, line: 106, baseType: !129, size: 32, offset: 2240)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !561, file: !562, line: 106, baseType: !129, size: 32, offset: 2272)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !561, file: !562, line: 107, baseType: !87, size: 16, offset: 2304)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !561, file: !562, line: 107, baseType: !87, size: 16, offset: 2320)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !561, file: !562, line: 107, baseType: !87, size: 16, offset: 2336)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !561, file: !562, line: 107, baseType: !87, size: 16, offset: 2352)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !561, file: !562, line: 108, baseType: !129, size: 32, offset: 2368)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !561, file: !562, line: 108, baseType: !129, size: 32, offset: 2400)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !561, file: !562, line: 109, baseType: !129, size: 32, offset: 2432)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !561, file: !562, line: 109, baseType: !129, size: 32, offset: 2464)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !561, file: !562, line: 110, baseType: !129, size: 32, offset: 2496)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !561, file: !562, line: 110, baseType: !129, size: 32, offset: 2528)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !561, file: !562, line: 110, baseType: !129, size: 32, offset: 2560)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !561, file: !562, line: 111, baseType: !87, size: 16, offset: 2592)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !561, file: !562, line: 111, baseType: !87, size: 16, offset: 2608)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !561, file: !562, line: 112, baseType: !87, size: 16, offset: 2624)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !561, file: !562, line: 112, baseType: !87, size: 16, offset: 2640)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !561, file: !562, line: 112, baseType: !87, size: 16, offset: 2656)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !561, file: !562, line: 115, baseType: !87, size: 16, offset: 2672)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !561, file: !562, line: 118, baseType: !632, size: 64, offset: 2688)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !561, file: !562, line: 118, baseType: !632, size: 64, offset: 2752)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !561, file: !562, line: 121, baseType: !316, size: 64, offset: 2816)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !561, file: !562, line: 122, baseType: !286, size: 1152, offset: 2880)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !561, file: !562, line: 123, baseType: !87, size: 16, offset: 4032)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !561, file: !562, line: 123, baseType: !87, size: 16, offset: 4048)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !561, file: !562, line: 123, baseType: !639, size: 32, offset: 4064)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 32, elements: !544)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !561, file: !562, line: 126, baseType: !641, size: 64, offset: 4096)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !54, line: 159, size: 448, elements: !643)
!643 = !{!644, !646, !647, !648, !649, !652}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !642, file: !54, line: 161, baseType: !645, size: 64)
!645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 64, elements: !544)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !642, file: !54, line: 162, baseType: !645, size: 64, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !642, file: !54, line: 163, baseType: !639, size: 32, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !642, file: !54, line: 164, baseType: !639, size: 32, offset: 160)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !642, file: !54, line: 165, baseType: !650, size: 128, offset: 192)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !651, size: 128, elements: !544)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !642, file: !54, line: 166, baseType: !653, size: 128, offset: 320)
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !654, size: 128, elements: !544)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !54, line: 46, flags: DIFlagFwdDecl)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !561, file: !562, line: 129, baseType: !657, size: 64, offset: 4160)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !23, line: 328, size: 3456, elements: !659)
!659 = !{!660, !661, !662, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1195, !1199, !1203, !1207, !1208, !1209, !1210, !1211}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !658, file: !23, line: 329, baseType: !53, size: 960)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !658, file: !23, line: 330, baseType: !124, size: 64, offset: 960)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !658, file: !23, line: 332, baseType: !663, size: 64, offset: 1024)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !665, line: 283, size: 4096, elements: !666)
!665 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!666 = !{!667, !668, !669, !670, !674, !675, !679, !1137, !1145, !1149, !1155, !1159, !1160, !1161, !1162, !1166, !1167}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !664, file: !665, line: 284, baseType: !24, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !664, file: !665, line: 285, baseType: !103, size: 512, offset: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !664, file: !665, line: 287, baseType: !103, size: 512, offset: 544)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !664, file: !665, line: 288, baseType: !671, size: 2048, offset: 1056)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 2048, elements: !672)
!672 = !{!673}
!673 = !DISubrange(count: 256)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !664, file: !665, line: 289, baseType: !24, size: 32, offset: 3104)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !664, file: !665, line: 292, baseType: !676, size: 64, offset: 3136)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DISubroutineType(types: !678)
!678 = !{null, !657}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !664, file: !665, line: 293, baseType: !680, size: 64, offset: 3200)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DISubroutineType(types: !682)
!682 = !{null, !657, !683}
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !23, line: 167, size: 3712, elements: !685)
!685 = !{!686, !687, !688, !689, !690, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1129, !1130, !1131, !1132, !1133, !1134}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !684, file: !23, line: 168, baseType: !683, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !684, file: !23, line: 168, baseType: !683, size: 64, offset: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !684, file: !23, line: 168, baseType: !683, size: 64, offset: 128)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !684, file: !23, line: 170, baseType: !92, size: 64, offset: 192)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !684, file: !23, line: 172, baseType: !691, size: 64, offset: 256)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !665, line: 144, size: 6016, elements: !693)
!693 = !{!694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !870, !871, !872, !886, !890, !894, !895, !975, !979, !983, !984, !985, !986, !990, !991, !995, !999, !1003, !1007, !1011, !1015, !1019, !1020, !1037, !1039, !1065, !1085}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !692, file: !665, line: 145, baseType: !58, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !692, file: !665, line: 145, baseType: !58, size: 64, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !692, file: !665, line: 146, baseType: !87, size: 16, offset: 128)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !692, file: !665, line: 148, baseType: !103, size: 512, offset: 144)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !692, file: !665, line: 149, baseType: !24, size: 32, offset: 672)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !692, file: !665, line: 151, baseType: !103, size: 512, offset: 704)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !692, file: !665, line: 152, baseType: !671, size: 2048, offset: 1216)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !692, file: !665, line: 153, baseType: !24, size: 32, offset: 3264)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !692, file: !665, line: 155, baseType: !129, size: 32, offset: 3296)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !692, file: !665, line: 155, baseType: !129, size: 32, offset: 3328)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !692, file: !665, line: 155, baseType: !129, size: 32, offset: 3360)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !692, file: !665, line: 156, baseType: !129, size: 32, offset: 3392)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !692, file: !665, line: 156, baseType: !129, size: 32, offset: 3424)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !692, file: !665, line: 156, baseType: !129, size: 32, offset: 3456)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !692, file: !665, line: 157, baseType: !87, size: 16, offset: 3488)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !692, file: !665, line: 157, baseType: !87, size: 16, offset: 3504)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !692, file: !665, line: 157, baseType: !87, size: 16, offset: 3520)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !692, file: !665, line: 160, baseType: !712, size: 64, offset: 3584)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !665, line: 109, baseType: !714)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !665, line: 98, size: 1408, elements: !715)
!715 = !{!716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !869}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !714, file: !665, line: 99, baseType: !24, size: 32)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !714, file: !665, line: 99, baseType: !24, size: 32, offset: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !714, file: !665, line: 100, baseType: !103, size: 512, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !714, file: !665, line: 101, baseType: !129, size: 32, offset: 576)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !714, file: !665, line: 101, baseType: !129, size: 32, offset: 608)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !714, file: !665, line: 101, baseType: !129, size: 32, offset: 640)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !714, file: !665, line: 101, baseType: !129, size: 32, offset: 672)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !714, file: !665, line: 102, baseType: !129, size: 32, offset: 704)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !714, file: !665, line: 102, baseType: !129, size: 32, offset: 736)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !714, file: !665, line: 103, baseType: !24, size: 32, offset: 768)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !714, file: !665, line: 104, baseType: !24, size: 32, offset: 800)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !714, file: !665, line: 107, baseType: !728, size: 64, offset: 832)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !23, line: 87, size: 2816, elements: !730)
!730 = !{!731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !854}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !729, file: !23, line: 88, baseType: !728, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !729, file: !23, line: 88, baseType: !728, size: 64, offset: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !729, file: !23, line: 88, baseType: !728, size: 64, offset: 128)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !729, file: !23, line: 90, baseType: !92, size: 64, offset: 192)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !729, file: !23, line: 92, baseType: !103, size: 512, offset: 256)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !729, file: !23, line: 94, baseType: !103, size: 512, offset: 768)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !729, file: !23, line: 99, baseType: !58, size: 64, offset: 1280)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !729, file: !23, line: 101, baseType: !87, size: 16, offset: 1344)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !729, file: !23, line: 101, baseType: !87, size: 16, offset: 1360)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !729, file: !23, line: 102, baseType: !87, size: 16, offset: 1376)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !729, file: !23, line: 103, baseType: !87, size: 16, offset: 1392)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !729, file: !23, line: 104, baseType: !743, size: 64, offset: 1408)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !665, line: 114, size: 1600, elements: !745)
!745 = !{!746, !747, !770, !774, !778, !782, !786, !790, !791, !795, !824, !825, !826}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !744, file: !665, line: 115, baseType: !103, size: 512)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !744, file: !665, line: 117, baseType: !748, size: 64, offset: 512)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DISubroutineType(types: !750)
!750 = !{null, !751, !754, !756, !756, !768}
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !753, line: 60, flags: DIFlagFwdDecl)
!753 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_blender.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !665, line: 73, flags: DIFlagFwdDecl)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !758, line: 55, size: 192, elements: !759)
!758 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!759 = !{!760, !764, !767}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !757, file: !758, line: 58, baseType: !761, size: 64)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !757, file: !758, line: 56, size: 64, elements: !762)
!762 = !{!763}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !761, file: !758, line: 57, baseType: !58, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !757, file: !758, line: 60, baseType: !765, size: 64, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !23, line: 335, flags: DIFlagFwdDecl)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !757, file: !758, line: 61, baseType: !58, size: 64, offset: 128)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "draw_color", scope: !744, file: !665, line: 118, baseType: !771, size: 64, offset: 576)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DISubroutineType(types: !773)
!773 = !{null, !751, !756, !756, !632}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw", scope: !744, file: !665, line: 120, baseType: !775, size: 64, offset: 640)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DISubroutineType(types: !777)
!777 = !{null, !751, !754, !756}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw_color", scope: !744, file: !665, line: 121, baseType: !779, size: 64, offset: 704)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DISubroutineType(types: !781)
!781 = !{null, !751, !756, !632}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "interface_register_properties", scope: !744, file: !665, line: 122, baseType: !783, size: 64, offset: 768)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DISubroutineType(types: !785)
!785 = !{null, !657, !728, !765}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "interface_init_socket", scope: !744, file: !665, line: 123, baseType: !787, size: 64, offset: 832)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DISubroutineType(types: !789)
!789 = !{null, !657, !728, !683, !728, !768}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "interface_verify_socket", scope: !744, file: !665, line: 124, baseType: !787, size: 64, offset: 896)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "interface_from_socket", scope: !744, file: !665, line: 125, baseType: !792, size: 64, offset: 960)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DISubroutineType(types: !794)
!794 = !{null, !657, !728, !683, !728}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "ext_socket", scope: !744, file: !665, line: 128, baseType: !796, size: 256, offset: 1024)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !758, line: 436, baseType: !797)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !758, line: 430, size: 256, elements: !798)
!798 = !{!799, !800, !803, !819}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !797, file: !758, line: 431, baseType: !58, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !797, file: !758, line: 432, baseType: !801, size: 64, offset: 64)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !758, line: 417, baseType: !766)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !797, file: !758, line: 433, baseType: !804, size: 64, offset: 128)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !758, line: 408, baseType: !805)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DISubroutineType(types: !807)
!807 = !{!24, !751, !756, !808, !810}
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !758, line: 38, flags: DIFlagFwdDecl)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !758, line: 348, baseType: !812)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !758, line: 337, size: 256, elements: !813)
!813 = !{!814, !815, !816, !817, !818}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !812, file: !758, line: 339, baseType: !58, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !812, file: !758, line: 342, baseType: !808, size: 64, offset: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !812, file: !758, line: 345, baseType: !24, size: 32, offset: 128)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !812, file: !758, line: 347, baseType: !24, size: 32, offset: 160)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !812, file: !758, line: 347, baseType: !24, size: 32, offset: 192)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !797, file: !758, line: 434, baseType: !820, size: 64, offset: 192)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !758, line: 409, baseType: !821)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DISubroutineType(types: !823)
!823 = !{null, !58}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "ext_interface", scope: !744, file: !665, line: 129, baseType: !796, size: 256, offset: 1280)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !744, file: !665, line: 132, baseType: !24, size: 32, offset: 1536)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !744, file: !665, line: 132, baseType: !24, size: 32, offset: 1568)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !729, file: !23, line: 105, baseType: !103, size: 512, offset: 1472)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !729, file: !23, line: 107, baseType: !129, size: 32, offset: 1984)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !729, file: !23, line: 107, baseType: !129, size: 32, offset: 2016)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "default_value", scope: !729, file: !23, line: 109, baseType: !58, size: 64, offset: 2048)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "stack_index", scope: !729, file: !23, line: 112, baseType: !87, size: 16, offset: 2112)
