; ModuleID = 'blender_bin/source/blender/makesrna/intern/rna_rigidbody_gen.c'
source_filename = "blender_bin/source/blender/makesrna/intern/rna_rigidbody_gen.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.CollectionPropertyRNA = type { %struct.PropertyRNA, void (%struct.CollectionPropertyIterator*, %struct.PointerRNA*)*, void (%struct.CollectionPropertyIterator*)*, void (%struct.CollectionPropertyIterator*)*, void (%struct.PointerRNA*, %struct.CollectionPropertyIterator*)*, i32 (%struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32, %struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i8*, %struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32, %struct.PointerRNA*)*, %struct.StructRNA* }
%struct.PropertyRNA = type { %struct.PropertyRNA*, %struct.PropertyRNA*, i32, i8*, i32, i8*, i8*, i32, i8*, i32, i32, i32 (%struct.PointerRNA*, i32*)*, i32, [3 x i32], i32, void (%struct.Main*, %struct.Scene*, %struct.PointerRNA*)*, i32, i32 (%struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32)*, i32, i32, %struct.StructRNA*, i8* }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }

!26 = !DIEnumerator(name: "PROP_PERCENTAGE", value: 14, isUnsigned: true)
!27 = !DIEnumerator(name: "PROP_FACTOR", value: 15, isUnsigned: true)
!28 = !DIEnumerator(name: "PROP_ANGLE", value: 327696, isUnsigned: true)
!29 = !DIEnumerator(name: "PROP_TIME", value: 393233, isUnsigned: true)
!30 = !DIEnumerator(name: "PROP_DISTANCE", value: 65554, isUnsigned: true)
!31 = !DIEnumerator(name: "PROP_DISTANCE_CAMERA", value: 589843, isUnsigned: true)
!32 = !DIEnumerator(name: "PROP_COLOR", value: 20, isUnsigned: true)
!33 = !DIEnumerator(name: "PROP_TRANSLATION", value: 65557, isUnsigned: true)
!34 = !DIEnumerator(name: "PROP_DIRECTION", value: 22, isUnsigned: true)
!35 = !DIEnumerator(name: "PROP_VELOCITY", value: 458775, isUnsigned: true)
!36 = !DIEnumerator(name: "PROP_ACCELERATION", value: 524312, isUnsigned: true)
!37 = !DIEnumerator(name: "PROP_MATRIX", value: 25, isUnsigned: true)
!38 = !DIEnumerator(name: "PROP_EULER", value: 327706, isUnsigned: true)
!39 = !DIEnumerator(name: "PROP_QUATERNION", value: 27, isUnsigned: true)
!40 = !DIEnumerator(name: "PROP_AXISANGLE", value: 28, isUnsigned: true)
!41 = !DIEnumerator(name: "PROP_XYZ", value: 29, isUnsigned: true)
!42 = !DIEnumerator(name: "PROP_XYZ_LENGTH", value: 65565, isUnsigned: true)
!43 = !DIEnumerator(name: "PROP_COLOR_GAMMA", value: 30, isUnsigned: true)
!44 = !DIEnumerator(name: "PROP_COORDS", value: 31, isUnsigned: true)
!45 = !DIEnumerator(name: "PROP_LAYER", value: 40, isUnsigned: true)
!46 = !DIEnumerator(name: "PROP_LAYER_MEMBER", value: 41, isUnsigned: true)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RawPropertyType", file: !6, line: 286, baseType: !48, size: 32, elements: !49)
!48 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!49 = !{!50, !51, !52, !53, !54, !55}
!50 = !DIEnumerator(name: "PROP_RAW_UNSET", value: -1)
!51 = !DIEnumerator(name: "PROP_RAW_INT", value: 0)
!52 = !DIEnumerator(name: "PROP_RAW_SHORT", value: 1)
!53 = !DIEnumerator(name: "PROP_RAW_CHAR", value: 2)
!54 = !DIEnumerator(name: "PROP_RAW_DOUBLE", value: 3)
!55 = !DIEnumerator(name: "PROP_RAW_FLOAT", value: 4)
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eRigidBodyWorld_Flag", file: !57, line: 77, baseType: !7, size: 32, elements: !58)
!57 = !DIFile(filename: "blender/source/blender/makesdna/DNA_rigidbody_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!58 = !{!59, !60, !61}
!59 = !DIEnumerator(name: "RBW_FLAG_MUTED", value: 1, isUnsigned: true)
!60 = !DIEnumerator(name: "RBW_FLAG_NEEDS_REBUILD", value: 2, isUnsigned: true)
!61 = !DIEnumerator(name: "RBW_FLAG_USE_SPLIT_IMPULSE", value: 4, isUnsigned: true)
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eRigidBodyOb_Flag", file: !57, line: 138, baseType: !7, size: 32, elements: !63)
!63 = !{!64, !65, !66, !67, !68, !69, !70, !71}
!64 = !DIEnumerator(name: "RBO_FLAG_KINEMATIC", value: 1, isUnsigned: true)
!65 = !DIEnumerator(name: "RBO_FLAG_NEEDS_VALIDATE", value: 2, isUnsigned: true)
!66 = !DIEnumerator(name: "RBO_FLAG_NEEDS_RESHAPE", value: 4, isUnsigned: true)
!67 = !DIEnumerator(name: "RBO_FLAG_USE_DEACTIVATION", value: 8, isUnsigned: true)
!68 = !DIEnumerator(name: "RBO_FLAG_START_DEACTIVATED", value: 16, isUnsigned: true)
!69 = !DIEnumerator(name: "RBO_FLAG_DISABLED", value: 32, isUnsigned: true)
!70 = !DIEnumerator(name: "RBO_FLAG_USE_MARGIN", value: 64, isUnsigned: true)
!71 = !DIEnumerator(name: "RBO_FLAG_USE_DEFORM", value: 128, isUnsigned: true)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eRigidBodyCon_Flag", file: !57, line: 274, baseType: !7, size: 32, elements: !73)
!73 = !{!74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89}
!74 = !DIEnumerator(name: "RBC_FLAG_ENABLED", value: 1, isUnsigned: true)
!75 = !DIEnumerator(name: "RBC_FLAG_NEEDS_VALIDATE", value: 2, isUnsigned: true)
!76 = !DIEnumerator(name: "RBC_FLAG_DISABLE_COLLISIONS", value: 4, isUnsigned: true)
!77 = !DIEnumerator(name: "RBC_FLAG_USE_BREAKING", value: 8, isUnsigned: true)
!78 = !DIEnumerator(name: "RBC_FLAG_OVERRIDE_SOLVER_ITERATIONS", value: 16, isUnsigned: true)
!79 = !DIEnumerator(name: "RBC_FLAG_USE_LIMIT_LIN_X", value: 32, isUnsigned: true)
!80 = !DIEnumerator(name: "RBC_FLAG_USE_LIMIT_LIN_Y", value: 64, isUnsigned: true)
!81 = !DIEnumerator(name: "RBC_FLAG_USE_LIMIT_LIN_Z", value: 128, isUnsigned: true)
!82 = !DIEnumerator(name: "RBC_FLAG_USE_LIMIT_ANG_X", value: 256, isUnsigned: true)
!83 = !DIEnumerator(name: "RBC_FLAG_USE_LIMIT_ANG_Y", value: 512, isUnsigned: true)
!84 = !DIEnumerator(name: "RBC_FLAG_USE_LIMIT_ANG_Z", value: 1024, isUnsigned: true)
!85 = !DIEnumerator(name: "RBC_FLAG_USE_SPRING_X", value: 2048, isUnsigned: true)
!86 = !DIEnumerator(name: "RBC_FLAG_USE_SPRING_Y", value: 4096, isUnsigned: true)
!87 = !DIEnumerator(name: "RBC_FLAG_USE_SPRING_Z", value: 8192, isUnsigned: true)
!88 = !DIEnumerator(name: "RBC_FLAG_USE_MOTOR_LIN", value: 16384, isUnsigned: true)
!89 = !DIEnumerator(name: "RBC_FLAG_USE_MOTOR_ANG", value: 32768, isUnsigned: true)
!90 = !{!91, !1641, !249, !391, !48, !1643, !1645, !1603, !168, !1611, !1647, !436}
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyRNA", file: !6, line: 333, baseType: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PropertyRNA", file: !94, line: 157, size: 1344, elements: !95)
!94 = !DIFile(filename: "blender/source/blender/makesrna/intern/rna_internal_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!95 = !{!96, !98, !99, !100, !104, !105, !106, !107, !108, !109, !111, !113, !490, !491, !495, !496, !1625, !1626, !1631, !1636, !1637, !1639, !1640}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !93, file: !94, line: 158, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !93, file: !94, line: 158, baseType: !97, size: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !93, file: !94, line: 161, baseType: !48, size: 32, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !93, file: !94, line: 164, baseType: !101, size: 64, offset: 192)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!103 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !93, file: !94, line: 166, baseType: !48, size: 32, offset: 256)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !93, file: !94, line: 169, baseType: !101, size: 64, offset: 320)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !93, file: !94, line: 171, baseType: !101, size: 64, offset: 384)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !93, file: !94, line: 173, baseType: !48, size: 32, offset: 448)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !93, file: !94, line: 175, baseType: !101, size: 64, offset: 512)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !93, file: !94, line: 178, baseType: !110, size: 32, offset: 576)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyType", file: !6, line: 79, baseType: !5)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !93, file: !94, line: 180, baseType: !112, size: 32, offset: 608)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertySubType", file: !6, line: 147, baseType: !16)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "getlength", scope: !93, file: !94, line: 182, baseType: !114, size: 64, offset: 640)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropArrayLengthGetFunc", file: !94, line: 73, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!48, !118, !436}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !6, line: 55, size: 192, elements: !120)
!120 = !{!121, !126, !489}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !119, file: !6, line: 58, baseType: !122, size: 64)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !119, file: !6, line: 56, size: 64, elements: !123)
!123 = !{!124}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !122, file: !6, line: 57, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !119, file: !6, line: 60, baseType: !127, size: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !94, line: 339, size: 1600, elements: !129)
!129 = !{!130, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !163, !169, !471, !476, !482, !488}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !128, file: !94, line: 341, baseType: !131, size: 320)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "ContainerRNA", file: !94, line: 135, baseType: !132)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ContainerRNA", file: !94, line: 130, size: 320, elements: !133)
!133 = !{!134, !135, !136, !139}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !132, file: !94, line: 131, baseType: !125, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !132, file: !94, line: 131, baseType: !125, size: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "prophash", scope: !132, file: !94, line: 133, baseType: !137, size: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !94, line: 46, flags: DIFlagFwdDecl)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !132, file: !94, line: 134, baseType: !140, size: 128, offset: 192)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !141, line: 71, baseType: !142)
!141 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !141, line: 69, size: 128, elements: !143)
!143 = !{!144, !145}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !142, file: !141, line: 70, baseType: !125, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !142, file: !141, line: 70, baseType: !125, size: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !128, file: !94, line: 344, baseType: !101, size: 64, offset: 320)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "py_type", scope: !128, file: !94, line: 348, baseType: !125, size: 64, offset: 384)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "blender_type", scope: !128, file: !94, line: 349, baseType: !125, size: 64, offset: 448)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !128, file: !94, line: 352, baseType: !48, size: 32, offset: 512)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !128, file: !94, line: 355, baseType: !101, size: 64, offset: 576)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !128, file: !94, line: 357, baseType: !101, size: 64, offset: 640)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !128, file: !94, line: 359, baseType: !101, size: 64, offset: 704)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !128, file: !94, line: 361, baseType: !48, size: 32, offset: 768)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nameproperty", scope: !128, file: !94, line: 364, baseType: !91, size: 64, offset: 832)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "iteratorproperty", scope: !128, file: !94, line: 367, baseType: !91, size: 64, offset: 896)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !128, file: !94, line: 370, baseType: !127, size: 64, offset: 960)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nested", scope: !128, file: !94, line: 376, baseType: !127, size: 64, offset: 1024)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "refine", scope: !128, file: !94, line: 379, baseType: !159, size: 64, offset: 1088)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRefineFunc", file: !94, line: 70, baseType: !160)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{!127, !118}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !128, file: !94, line: 382, baseType: !164, size: 64, offset: 1152)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructPathFunc", file: !94, line: 71, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{!168, !118}
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !128, file: !94, line: 385, baseType: !170, size: 64, offset: 1216)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRegisterFunc", file: !6, line: 410, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{!127, !174, !306, !125, !101, !432, !437, !467}
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Main", file: !176, line: 53, size: 15232, elements: !177)
!176 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_main.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!177 = !{!178, !179, !180, !184, !186, !187, !188, !189, !195, !199, !200, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !297, !303}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !175, file: !176, line: 54, baseType: !174, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !175, file: !176, line: 54, baseType: !174, size: 64, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !175, file: !176, line: 55, baseType: !181, size: 8192, offset: 128)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 8192, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 1024)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "versionfile", scope: !175, file: !176, line: 56, baseType: !185, size: 16, offset: 8320)
!185 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "subversionfile", scope: !175, file: !176, line: 56, baseType: !185, size: 16, offset: 8336)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "minversionfile", scope: !175, file: !176, line: 57, baseType: !185, size: 16, offset: 8352)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "minsubversionfile", scope: !175, file: !176, line: 57, baseType: !185, size: 16, offset: 8368)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "build_commit_timestamp", scope: !175, file: !176, line: 58, baseType: !190, size: 64, offset: 8384)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !191, line: 27, baseType: !192)
!191 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !193, line: 45, baseType: !194)
!193 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!194 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "build_hash", scope: !175, file: !176, line: 59, baseType: !196, size: 128, offset: 8448)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 128, elements: !197)
!197 = !{!198}
!198 = !DISubrange(count: 16)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", scope: !175, file: !176, line: 60, baseType: !185, size: 16, offset: 8576)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "curlib", scope: !175, file: !176, line: 62, baseType: !201, size: 64, offset: 8640)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !203, line: 136, size: 17600, elements: !204)
!203 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!204 = !{!205, !248, !250, !253, !254, !255, !256}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !202, file: !203, line: 137, baseType: !206, size: 960)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !203, line: 130, baseType: !207)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !203, line: 117, size: 960, elements: !208)
!208 = !{!209, !210, !211, !213, !214, !218, !219, !220, !221, !222}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !207, file: !203, line: 118, baseType: !125, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !207, file: !203, line: 118, baseType: !125, size: 64, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !207, file: !203, line: 119, baseType: !212, size: 64, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !207, file: !203, line: 120, baseType: !201, size: 64, offset: 192)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !207, file: !203, line: 121, baseType: !215, size: 528, offset: 256)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 528, elements: !216)
!216 = !{!217}
!217 = !DISubrange(count: 66)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !207, file: !203, line: 126, baseType: !185, size: 16, offset: 784)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !207, file: !203, line: 127, baseType: !48, size: 32, offset: 800)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !207, file: !203, line: 128, baseType: !48, size: 32, offset: 832)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !207, file: !203, line: 128, baseType: !48, size: 32, offset: 864)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !207, file: !203, line: 129, baseType: !223, size: 64, offset: 896)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !203, line: 75, baseType: !225)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !203, line: 62, size: 1024, elements: !226)
!226 = !{!227, !229, !230, !231, !232, !233, !237, !238, !246, !247}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !225, file: !203, line: 63, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !225, file: !203, line: 63, baseType: !228, size: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !225, file: !203, line: 64, baseType: !103, size: 8, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !225, file: !203, line: 64, baseType: !103, size: 8, offset: 136)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !225, file: !203, line: 65, baseType: !185, size: 16, offset: 144)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !225, file: !203, line: 66, baseType: !234, size: 512, offset: 160)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 512, elements: !235)
!235 = !{!236}
!236 = !DISubrange(count: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !225, file: !203, line: 67, baseType: !48, size: 32, offset: 672)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !225, file: !203, line: 69, baseType: !239, size: 256, offset: 704)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !203, line: 60, baseType: !240)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !203, line: 48, size: 256, elements: !241)
!241 = !{!242, !243, !244, !245}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !240, file: !203, line: 49, baseType: !125, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !240, file: !203, line: 58, baseType: !140, size: 128, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !240, file: !203, line: 59, baseType: !48, size: 32, offset: 192)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !240, file: !203, line: 59, baseType: !48, size: 32, offset: 224)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !225, file: !203, line: 70, baseType: !48, size: 32, offset: 960)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !225, file: !203, line: 74, baseType: !48, size: 32, offset: 992)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !202, file: !203, line: 138, baseType: !249, size: 64, offset: 960)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !202, file: !203, line: 139, baseType: !251, size: 64, offset: 1024)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !203, line: 43, flags: DIFlagFwdDecl)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !202, file: !203, line: 140, baseType: !181, size: 8192, offset: 1088)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !202, file: !203, line: 141, baseType: !181, size: 8192, offset: 9280)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !202, file: !203, line: 148, baseType: !201, size: 64, offset: 17472)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !202, file: !203, line: 150, baseType: !257, size: 64, offset: 17536)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !203, line: 45, flags: DIFlagFwdDecl)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !175, file: !176, line: 63, baseType: !140, size: 128, offset: 8704)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "library", scope: !175, file: !176, line: 64, baseType: !140, size: 128, offset: 8832)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !175, file: !176, line: 65, baseType: !140, size: 128, offset: 8960)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "mesh", scope: !175, file: !176, line: 66, baseType: !140, size: 128, offset: 9088)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !175, file: !176, line: 67, baseType: !140, size: 128, offset: 9216)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "mball", scope: !175, file: !176, line: 68, baseType: !140, size: 128, offset: 9344)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !175, file: !176, line: 69, baseType: !140, size: 128, offset: 9472)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !175, file: !176, line: 70, baseType: !140, size: 128, offset: 9600)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !175, file: !176, line: 71, baseType: !140, size: 128, offset: 9728)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "latt", scope: !175, file: !176, line: 72, baseType: !140, size: 128, offset: 9856)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "lamp", scope: !175, file: !176, line: 73, baseType: !140, size: 128, offset: 9984)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !175, file: !176, line: 74, baseType: !140, size: 128, offset: 10112)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !175, file: !176, line: 75, baseType: !140, size: 128, offset: 10240)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !175, file: !176, line: 76, baseType: !140, size: 128, offset: 10368)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !175, file: !176, line: 77, baseType: !140, size: 128, offset: 10496)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !175, file: !176, line: 78, baseType: !140, size: 128, offset: 10624)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !175, file: !176, line: 79, baseType: !140, size: 128, offset: 10752)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "vfont", scope: !175, file: !176, line: 80, baseType: !140, size: 128, offset: 10880)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !175, file: !176, line: 81, baseType: !140, size: 128, offset: 11008)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "speaker", scope: !175, file: !176, line: 82, baseType: !140, size: 128, offset: 11136)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !175, file: !176, line: 83, baseType: !140, size: 128, offset: 11264)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !175, file: !176, line: 84, baseType: !140, size: 128, offset: 11392)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "armature", scope: !175, file: !176, line: 85, baseType: !140, size: 128, offset: 11520)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !175, file: !176, line: 86, baseType: !140, size: 128, offset: 11648)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !175, file: !176, line: 87, baseType: !140, size: 128, offset: 11776)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !175, file: !176, line: 88, baseType: !140, size: 128, offset: 11904)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !175, file: !176, line: 89, baseType: !140, size: 128, offset: 12032)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "palettes", scope: !175, file: !176, line: 90, baseType: !140, size: 128, offset: 12160)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "paintcurves", scope: !175, file: !176, line: 91, baseType: !140, size: 128, offset: 12288)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "wm", scope: !175, file: !176, line: 92, baseType: !140, size: 128, offset: 12416)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil", scope: !175, file: !176, line: 93, baseType: !140, size: 128, offset: 12544)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "movieclip", scope: !175, file: !176, line: 94, baseType: !140, size: 128, offset: 12672)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !175, file: !176, line: 95, baseType: !140, size: 128, offset: 12800)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "linestyle", scope: !175, file: !176, line: 96, baseType: !140, size: 128, offset: 12928)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "id_tag_update", scope: !175, file: !176, line: 98, baseType: !294, size: 2048, offset: 13056)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 2048, elements: !295)
!295 = !{!296}
!296 = !DISubrange(count: 256)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "eval_ctx", scope: !175, file: !176, line: 101, baseType: !298, size: 64, offset: 15104)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EvaluationContext", file: !300, line: 58, size: 32, elements: !301)
!300 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_depsgraph.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!301 = !{!302}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !299, file: !300, line: 59, baseType: !48, size: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !175, file: !176, line: 103, baseType: !304, size: 64, offset: 15168)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "MainLock", file: !176, line: 51, flags: DIFlagFwdDecl)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !308, line: 106, size: 320, elements: !309)
!308 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!309 = !{!310, !311, !312, !313, !314, !315}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !307, file: !308, line: 107, baseType: !140, size: 128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !307, file: !308, line: 108, baseType: !48, size: 32, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !307, file: !308, line: 109, baseType: !48, size: 32, offset: 160)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !307, file: !308, line: 110, baseType: !48, size: 32, offset: 192)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !307, file: !308, line: 110, baseType: !48, size: 32, offset: 224)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !307, file: !308, line: 111, baseType: !316, size: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !318, line: 490, size: 768, elements: !319)
!318 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!319 = !{!320, !321, !322, !423, !424, !425, !426, !427, !428, !429, !430, !431}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !317, file: !318, line: 491, baseType: !316, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !317, file: !318, line: 491, baseType: !316, size: 64, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !317, file: !318, line: 493, baseType: !323, size: 64, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !308, line: 169, size: 2048, elements: !325)
!325 = !{!326, !327, !328, !329, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !398, !401, !415, !416, !417, !418, !419, !420, !421, !422}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !324, file: !308, line: 170, baseType: !323, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !324, file: !308, line: 170, baseType: !323, size: 64, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !324, file: !308, line: 172, baseType: !125, size: 64, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !324, file: !308, line: 174, baseType: !330, size: 64, offset: 192)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !332, line: 41, flags: DIFlagFwdDecl)
!332 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!333 = !DIDerivedType(tag: DW_TAG_member, name: "newscreen", scope: !324, file: !308, line: 175, baseType: !330, size: 64, offset: 256)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "screenname", scope: !324, file: !308, line: 176, baseType: !234, size: 512, offset: 320)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "posx", scope: !324, file: !308, line: 178, baseType: !185, size: 16, offset: 832)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "posy", scope: !324, file: !308, line: 178, baseType: !185, size: 16, offset: 848)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !324, file: !308, line: 178, baseType: !185, size: 16, offset: 864)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !324, file: !308, line: 178, baseType: !185, size: 16, offset: 880)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "windowstate", scope: !324, file: !308, line: 179, baseType: !185, size: 16, offset: 896)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !324, file: !308, line: 180, baseType: !185, size: 16, offset: 912)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !324, file: !308, line: 181, baseType: !185, size: 16, offset: 928)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !324, file: !308, line: 182, baseType: !185, size: 16, offset: 944)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "lastcursor", scope: !324, file: !308, line: 183, baseType: !185, size: 16, offset: 960)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "modalcursor", scope: !324, file: !308, line: 184, baseType: !185, size: 16, offset: 976)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "grabcursor", scope: !324, file: !308, line: 185, baseType: !185, size: 16, offset: 992)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "addmousemove", scope: !324, file: !308, line: 186, baseType: !185, size: 16, offset: 1008)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "winid", scope: !324, file: !308, line: 188, baseType: !48, size: 32, offset: 1024)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "lock_pie_event", scope: !324, file: !308, line: 190, baseType: !185, size: 16, offset: 1056)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "last_pie_event", scope: !324, file: !308, line: 191, baseType: !185, size: 16, offset: 1072)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "eventstate", scope: !324, file: !308, line: 194, baseType: !351, size: 64, offset: 1088)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmEvent", file: !318, line: 421, size: 960, elements: !353)
!353 = !{!354, !355, !356, !357, !358, !359, !360, !364, !368, !369, !370, !371, !372, !373, !374, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !394, !395, !396, !397}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !352, file: !318, line: 422, baseType: !351, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !352, file: !318, line: 422, baseType: !351, size: 64, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !352, file: !318, line: 424, baseType: !185, size: 16, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !352, file: !318, line: 425, baseType: !185, size: 16, offset: 144)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !352, file: !318, line: 426, baseType: !48, size: 32, offset: 160)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !352, file: !318, line: 426, baseType: !48, size: 32, offset: 192)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "mval", scope: !352, file: !318, line: 427, baseType: !361, size: 64, offset: 224)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 64, elements: !362)
!362 = !{!363}
!363 = !DISubrange(count: 2)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_buf", scope: !352, file: !318, line: 428, baseType: !365, size: 48, offset: 288)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 48, elements: !366)
!366 = !{!367}
!367 = !DISubrange(count: 6)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !352, file: !318, line: 431, baseType: !103, size: 8, offset: 336)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !352, file: !318, line: 432, baseType: !103, size: 8, offset: 344)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "prevtype", scope: !352, file: !318, line: 435, baseType: !185, size: 16, offset: 352)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "prevval", scope: !352, file: !318, line: 436, baseType: !185, size: 16, offset: 368)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "prevx", scope: !352, file: !318, line: 437, baseType: !48, size: 32, offset: 384)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "prevy", scope: !352, file: !318, line: 437, baseType: !48, size: 32, offset: 416)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicktime", scope: !352, file: !318, line: 438, baseType: !375, size: 64, offset: 448)
!375 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "prevclickx", scope: !352, file: !318, line: 439, baseType: !48, size: 32, offset: 512)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicky", scope: !352, file: !318, line: 439, baseType: !48, size: 32, offset: 544)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !352, file: !318, line: 442, baseType: !185, size: 16, offset: 576)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !352, file: !318, line: 442, baseType: !185, size: 16, offset: 592)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !352, file: !318, line: 442, baseType: !185, size: 16, offset: 608)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "oskey", scope: !352, file: !318, line: 442, baseType: !185, size: 16, offset: 624)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "keymodifier", scope: !352, file: !318, line: 443, baseType: !185, size: 16, offset: 640)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "check_click", scope: !352, file: !318, line: 446, baseType: !185, size: 16, offset: 656)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "keymap_idname", scope: !352, file: !318, line: 449, baseType: !101, size: 64, offset: 704)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "tablet_data", scope: !352, file: !318, line: 452, baseType: !386, size: 64, offset: 768)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTabletData", file: !318, line: 463, size: 128, elements: !388)
!388 = !{!389, !390, !392, !393}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "Active", scope: !387, file: !318, line: 464, baseType: !48, size: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "Pressure", scope: !387, file: !318, line: 465, baseType: !391, size: 32, offset: 32)
!391 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "Xtilt", scope: !387, file: !318, line: 466, baseType: !391, size: 32, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "Ytilt", scope: !387, file: !318, line: 467, baseType: !391, size: 32, offset: 96)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "custom", scope: !352, file: !318, line: 455, baseType: !185, size: 16, offset: 832)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "customdatafree", scope: !352, file: !318, line: 456, baseType: !185, size: 16, offset: 848)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !352, file: !318, line: 457, baseType: !48, size: 32, offset: 864)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !352, file: !318, line: 458, baseType: !125, size: 64, offset: 896)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "curswin", scope: !324, file: !308, line: 196, baseType: !399, size: 64, offset: 1152)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmSubWindow", file: !308, line: 55, flags: DIFlagFwdDecl)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "tweak", scope: !324, file: !308, line: 198, baseType: !402, size: 64, offset: 1216)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmGesture", file: !318, line: 398, size: 448, elements: !404)
!404 = !{!405, !406, !407, !408, !409, !410, !411, !412, !413, !414}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !403, file: !318, line: 399, baseType: !402, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !403, file: !318, line: 399, baseType: !402, size: 64, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !403, file: !318, line: 400, baseType: !48, size: 32, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !403, file: !318, line: 401, baseType: !48, size: 32, offset: 160)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !403, file: !318, line: 402, baseType: !48, size: 32, offset: 192)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "swinid", scope: !403, file: !318, line: 403, baseType: !48, size: 32, offset: 224)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !403, file: !318, line: 404, baseType: !48, size: 32, offset: 256)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !403, file: !318, line: 405, baseType: !48, size: 32, offset: 288)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !403, file: !318, line: 407, baseType: !125, size: 64, offset: 320)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !403, file: !318, line: 414, baseType: !125, size: 64, offset: 384)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "drawmethod", scope: !324, file: !308, line: 200, baseType: !48, size: 32, offset: 1280)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "drawfail", scope: !324, file: !308, line: 200, baseType: !48, size: 32, offset: 1312)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "drawdata", scope: !324, file: !308, line: 201, baseType: !125, size: 64, offset: 1344)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !324, file: !308, line: 203, baseType: !140, size: 128, offset: 1408)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !324, file: !308, line: 204, baseType: !140, size: 128, offset: 1536)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "modalhandlers", scope: !324, file: !308, line: 205, baseType: !140, size: 128, offset: 1664)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "subwindows", scope: !324, file: !308, line: 207, baseType: !140, size: 128, offset: 1792)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "gesture", scope: !324, file: !308, line: 208, baseType: !140, size: 128, offset: 1920)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "timestep", scope: !317, file: !318, line: 495, baseType: !375, size: 64, offset: 192)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !317, file: !318, line: 496, baseType: !48, size: 32, offset: 256)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !317, file: !318, line: 497, baseType: !125, size: 64, offset: 320)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !317, file: !318, line: 499, baseType: !375, size: 64, offset: 384)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !317, file: !318, line: 500, baseType: !375, size: 64, offset: 448)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "ltime", scope: !317, file: !318, line: 502, baseType: !375, size: 64, offset: 512)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ntime", scope: !317, file: !318, line: 503, baseType: !375, size: 64, offset: 576)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !317, file: !318, line: 504, baseType: !375, size: 64, offset: 640)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "sleep", scope: !317, file: !318, line: 505, baseType: !48, size: 32, offset: 704)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructValidateFunc", file: !6, line: 407, baseType: !433)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!48, !118, !125, !436}
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !6, line: 408, baseType: !438)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{!48, !441, !118, !443, !457}
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !6, line: 44, flags: DIFlagFwdDecl)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !94, line: 137, size: 640, elements: !445)
!445 = !{!446, !447, !448, !449, !450, !466}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !444, file: !94, line: 139, baseType: !131, size: 320)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !444, file: !94, line: 142, baseType: !101, size: 64, offset: 320)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !444, file: !94, line: 144, baseType: !48, size: 32, offset: 384)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !444, file: !94, line: 147, baseType: !101, size: 64, offset: 448)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !444, file: !94, line: 150, baseType: !451, size: 64, offset: 512)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "CallFunc", file: !6, line: 388, baseType: !452)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DISubroutineType(types: !454)
!454 = !{null, !441, !306, !455, !457}
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "PointerRNA", file: !6, line: 62, baseType: !119)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !6, line: 348, baseType: !459)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !6, line: 337, size: 256, elements: !460)
!460 = !{!461, !462, !463, !464, !465}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !459, file: !6, line: 339, baseType: !125, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !459, file: !6, line: 342, baseType: !443, size: 64, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !459, file: !6, line: 345, baseType: !48, size: 32, offset: 128)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !459, file: !6, line: 347, baseType: !48, size: 32, offset: 160)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !459, file: !6, line: 347, baseType: !48, size: 32, offset: 192)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "c_ret", scope: !444, file: !94, line: 154, baseType: !91, size: 64, offset: 576)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !6, line: 409, baseType: !468)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{null, !125}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "unreg", scope: !128, file: !94, line: 386, baseType: !472, size: 64, offset: 1280)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructUnregisterFunc", file: !6, line: 414, baseType: !473)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DISubroutineType(types: !475)
!475 = !{null, !174, !127}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !128, file: !94, line: 387, baseType: !477, size: 64, offset: 1344)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructInstanceFunc", file: !6, line: 415, baseType: !478)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{!481, !455}
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "idproperties", scope: !128, file: !94, line: 390, baseType: !483, size: 64, offset: 1408)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertiesFunc", file: !94, line: 69, baseType: !484)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{!228, !118, !487}
!487 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "functions", scope: !128, file: !94, line: 393, baseType: !140, size: 128, offset: 1472)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !119, file: !6, line: 61, baseType: !125, size: 64, offset: 128)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "arraydimension", scope: !93, file: !94, line: 184, baseType: !7, size: 32, offset: 704)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !93, file: !94, line: 186, baseType: !492, size: 96, offset: 736)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 96, elements: !493)
!493 = !{!494}
!494 = !DISubrange(count: 3)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "totarraylength", scope: !93, file: !94, line: 187, baseType: !7, size: 32, offset: 832)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !93, file: !94, line: 190, baseType: !497, size: 64, offset: 896)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "UpdateFunc", file: !94, line: 64, baseType: !498)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DISubroutineType(types: !500)
!500 = !{null, !174, !501, !118}
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !503, line: 1216, size: 39680, elements: !504)
!503 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!504 = !{!505, !506, !509, !846, !849, !850, !851, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !877, !880, !883, !1178, !1181, !1478, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1500, !1501, !1502, !1503, !1504, !1512, !1579, !1586, !1587, !1594, !1597, !1598, !1599, !1600, !1601, !1602}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !502, file: !503, line: 1217, baseType: !206, size: 960)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !502, file: !503, line: 1218, baseType: !507, size: 64, offset: 960)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !503, line: 58, flags: DIFlagFwdDecl)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !502, file: !503, line: 1220, baseType: !510, size: 64, offset: 1024)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !512, line: 115, size: 11392, elements: !513)
!512 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!513 = !{!514, !515, !516, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !534, !544, !558, !559, !599, !600, !603, !604, !620, !621, !622, !623, !624, !625, !626, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !645, !646, !647, !648, !649, !650, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !710, !711, !712, !713, !714, !715, !716, !717, !718, !721, !724, !733, !734, !735, !736, !737, !740, !743, !746, !747, !748, !749, !750, !751, !752, !753, !755, !778, !812, !814, !834, !835}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !511, file: !512, line: 116, baseType: !206, size: 960)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !511, file: !512, line: 117, baseType: !507, size: 64, offset: 960)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !511, file: !512, line: 119, baseType: !517, size: 64, offset: 1024)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !512, line: 57, flags: DIFlagFwdDecl)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !511, file: !512, line: 121, baseType: !185, size: 16, offset: 1088)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !511, file: !512, line: 121, baseType: !185, size: 16, offset: 1104)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !511, file: !512, line: 122, baseType: !48, size: 32, offset: 1120)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !511, file: !512, line: 122, baseType: !48, size: 32, offset: 1152)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !511, file: !512, line: 122, baseType: !48, size: 32, offset: 1184)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !511, file: !512, line: 123, baseType: !234, size: 512, offset: 1216)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !511, file: !512, line: 124, baseType: !510, size: 64, offset: 1728)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !511, file: !512, line: 124, baseType: !510, size: 64, offset: 1792)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !511, file: !512, line: 127, baseType: !510, size: 64, offset: 1856)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !511, file: !512, line: 127, baseType: !510, size: 64, offset: 1920)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !511, file: !512, line: 127, baseType: !510, size: 64, offset: 1984)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !511, file: !512, line: 128, baseType: !531, size: 64, offset: 2048)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !533, line: 46, flags: DIFlagFwdDecl)
!533 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!534 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !511, file: !512, line: 130, baseType: !535, size: 64, offset: 2112)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !512, line: 97, size: 832, elements: !537)
!537 = !{!538, !542, !543}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !536, file: !512, line: 98, baseType: !539, size: 768)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !391, size: 768, elements: !540)
!540 = !{!541, !494}
!541 = !DISubrange(count: 8)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !536, file: !512, line: 99, baseType: !48, size: 32, offset: 768)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !536, file: !512, line: 99, baseType: !48, size: 32, offset: 800)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !511, file: !512, line: 131, baseType: !545, size: 64, offset: 2176)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !547, line: 486, size: 1600, elements: !548)
!547 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!548 = !{!549, !550, !551, !552, !553, !554, !555, !556, !557}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !546, file: !547, line: 487, baseType: !206, size: 960)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !546, file: !547, line: 489, baseType: !140, size: 128, offset: 960)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !546, file: !547, line: 490, baseType: !140, size: 128, offset: 1088)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !546, file: !547, line: 491, baseType: !140, size: 128, offset: 1216)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !546, file: !547, line: 492, baseType: !140, size: 128, offset: 1344)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !546, file: !547, line: 494, baseType: !48, size: 32, offset: 1472)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !546, file: !547, line: 495, baseType: !48, size: 32, offset: 1504)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !546, file: !547, line: 497, baseType: !48, size: 32, offset: 1536)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !546, file: !547, line: 498, baseType: !48, size: 32, offset: 1568)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !511, file: !512, line: 132, baseType: !545, size: 64, offset: 2240)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !511, file: !512, line: 133, baseType: !560, size: 64, offset: 2304)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !547, line: 334, size: 1728, elements: !562)
!562 = !{!563, !564, !565, !566, !567, !568, !569, !570, !572, !573, !574, !575, !576, !577, !578, !598}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !561, file: !547, line: 335, baseType: !140, size: 128)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !561, file: !547, line: 336, baseType: !137, size: 64, offset: 128)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !561, file: !547, line: 338, baseType: !185, size: 16, offset: 192)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !561, file: !547, line: 338, baseType: !185, size: 16, offset: 208)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !561, file: !547, line: 339, baseType: !7, size: 32, offset: 224)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !561, file: !547, line: 340, baseType: !48, size: 32, offset: 256)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !561, file: !547, line: 342, baseType: !391, size: 32, offset: 288)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !561, file: !547, line: 343, baseType: !571, size: 96, offset: 320)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !391, size: 96, elements: !493)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !561, file: !547, line: 344, baseType: !571, size: 96, offset: 416)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !561, file: !547, line: 347, baseType: !140, size: 128, offset: 512)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !561, file: !547, line: 349, baseType: !48, size: 32, offset: 640)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !561, file: !547, line: 350, baseType: !48, size: 32, offset: 672)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !561, file: !547, line: 351, baseType: !125, size: 64, offset: 704)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !561, file: !547, line: 352, baseType: !125, size: 64, offset: 768)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !561, file: !547, line: 354, baseType: !579, size: 384, offset: 832)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !547, line: 116, baseType: !580)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !547, line: 94, size: 384, elements: !581)
!581 = !{!582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !580, file: !547, line: 96, baseType: !48, size: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !580, file: !547, line: 96, baseType: !48, size: 32, offset: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !580, file: !547, line: 97, baseType: !48, size: 32, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !580, file: !547, line: 97, baseType: !48, size: 32, offset: 96)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !580, file: !547, line: 99, baseType: !185, size: 16, offset: 128)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !580, file: !547, line: 100, baseType: !185, size: 16, offset: 144)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !580, file: !547, line: 102, baseType: !185, size: 16, offset: 160)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !580, file: !547, line: 105, baseType: !185, size: 16, offset: 176)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !580, file: !547, line: 108, baseType: !185, size: 16, offset: 192)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !580, file: !547, line: 109, baseType: !185, size: 16, offset: 208)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !580, file: !547, line: 111, baseType: !185, size: 16, offset: 224)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !580, file: !547, line: 112, baseType: !185, size: 16, offset: 240)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !580, file: !547, line: 114, baseType: !48, size: 32, offset: 256)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !580, file: !547, line: 114, baseType: !48, size: 32, offset: 288)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !580, file: !547, line: 115, baseType: !48, size: 32, offset: 320)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !580, file: !547, line: 115, baseType: !48, size: 32, offset: 352)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !561, file: !547, line: 355, baseType: !234, size: 512, offset: 1216)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !511, file: !512, line: 134, baseType: !125, size: 64, offset: 2368)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !511, file: !512, line: 136, baseType: !601, size: 64, offset: 2432)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !503, line: 61, flags: DIFlagFwdDecl)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !511, file: !512, line: 138, baseType: !579, size: 384, offset: 2496)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !511, file: !512, line: 139, baseType: !605, size: 64, offset: 2880)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !547, line: 80, baseType: !607)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !547, line: 72, size: 192, elements: !608)
!608 = !{!609, !616, !617, !618, !619}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !607, file: !547, line: 73, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !547, line: 59, baseType: !612)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !547, line: 56, size: 128, elements: !613)
!613 = !{!614, !615}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !612, file: !547, line: 57, baseType: !571, size: 96)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !612, file: !547, line: 58, baseType: !48, size: 32, offset: 96)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !607, file: !547, line: 74, baseType: !48, size: 32, offset: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !607, file: !547, line: 76, baseType: !48, size: 32, offset: 96)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !607, file: !547, line: 77, baseType: !48, size: 32, offset: 128)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !607, file: !547, line: 79, baseType: !48, size: 32, offset: 160)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !511, file: !512, line: 141, baseType: !140, size: 128, offset: 2944)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !511, file: !512, line: 142, baseType: !140, size: 128, offset: 3072)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !511, file: !512, line: 143, baseType: !140, size: 128, offset: 3200)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !511, file: !512, line: 144, baseType: !140, size: 128, offset: 3328)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !511, file: !512, line: 146, baseType: !48, size: 32, offset: 3456)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !511, file: !512, line: 147, baseType: !48, size: 32, offset: 3488)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !511, file: !512, line: 150, baseType: !627, size: 64, offset: 3520)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !503, line: 179, flags: DIFlagFwdDecl)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !511, file: !512, line: 151, baseType: !168, size: 64, offset: 3584)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !511, file: !512, line: 152, baseType: !48, size: 32, offset: 3648)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !511, file: !512, line: 153, baseType: !48, size: 32, offset: 3680)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !511, file: !512, line: 156, baseType: !571, size: 96, offset: 3712)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !511, file: !512, line: 156, baseType: !571, size: 96, offset: 3808)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !511, file: !512, line: 156, baseType: !571, size: 96, offset: 3904)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !511, file: !512, line: 157, baseType: !571, size: 96, offset: 4000)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !511, file: !512, line: 158, baseType: !571, size: 96, offset: 4096)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !511, file: !512, line: 159, baseType: !571, size: 96, offset: 4192)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !511, file: !512, line: 160, baseType: !571, size: 96, offset: 4288)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !511, file: !512, line: 160, baseType: !571, size: 96, offset: 4384)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !511, file: !512, line: 161, baseType: !642, size: 128, offset: 4480)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !391, size: 128, elements: !643)
!643 = !{!644}
!644 = !DISubrange(count: 4)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !511, file: !512, line: 161, baseType: !642, size: 128, offset: 4608)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !511, file: !512, line: 162, baseType: !571, size: 96, offset: 4736)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !511, file: !512, line: 162, baseType: !571, size: 96, offset: 4832)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !511, file: !512, line: 163, baseType: !391, size: 32, offset: 4928)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !511, file: !512, line: 163, baseType: !391, size: 32, offset: 4960)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !511, file: !512, line: 164, baseType: !651, size: 512, offset: 4992)
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !391, size: 512, elements: !652)
!652 = !{!644, !644}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !511, file: !512, line: 165, baseType: !651, size: 512, offset: 5504)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !511, file: !512, line: 166, baseType: !651, size: 512, offset: 6016)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !511, file: !512, line: 167, baseType: !651, size: 512, offset: 6528)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !511, file: !512, line: 176, baseType: !651, size: 512, offset: 7040)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !511, file: !512, line: 178, baseType: !7, size: 32, offset: 7552)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !511, file: !512, line: 180, baseType: !185, size: 16, offset: 7584)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !511, file: !512, line: 181, baseType: !185, size: 16, offset: 7600)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !511, file: !512, line: 183, baseType: !185, size: 16, offset: 7616)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !511, file: !512, line: 183, baseType: !185, size: 16, offset: 7632)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !511, file: !512, line: 184, baseType: !185, size: 16, offset: 7648)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !511, file: !512, line: 184, baseType: !185, size: 16, offset: 7664)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !511, file: !512, line: 185, baseType: !185, size: 16, offset: 7680)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !511, file: !512, line: 186, baseType: !185, size: 16, offset: 7696)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !511, file: !512, line: 187, baseType: !185, size: 16, offset: 7712)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !511, file: !512, line: 188, baseType: !103, size: 8, offset: 7728)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !511, file: !512, line: 189, baseType: !103, size: 8, offset: 7736)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !511, file: !512, line: 192, baseType: !48, size: 32, offset: 7744)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !511, file: !512, line: 192, baseType: !48, size: 32, offset: 7776)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !511, file: !512, line: 192, baseType: !48, size: 32, offset: 7808)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !511, file: !512, line: 192, baseType: !48, size: 32, offset: 7840)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !511, file: !512, line: 194, baseType: !48, size: 32, offset: 7872)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !511, file: !512, line: 202, baseType: !391, size: 32, offset: 7904)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !511, file: !512, line: 202, baseType: !391, size: 32, offset: 7936)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !511, file: !512, line: 202, baseType: !391, size: 32, offset: 7968)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !511, file: !512, line: 211, baseType: !391, size: 32, offset: 8000)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !511, file: !512, line: 212, baseType: !391, size: 32, offset: 8032)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !511, file: !512, line: 213, baseType: !391, size: 32, offset: 8064)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !511, file: !512, line: 214, baseType: !391, size: 32, offset: 8096)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !511, file: !512, line: 215, baseType: !391, size: 32, offset: 8128)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !511, file: !512, line: 216, baseType: !391, size: 32, offset: 8160)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !511, file: !512, line: 219, baseType: !391, size: 32, offset: 8192)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !511, file: !512, line: 220, baseType: !391, size: 32, offset: 8224)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !511, file: !512, line: 221, baseType: !391, size: 32, offset: 8256)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !511, file: !512, line: 224, baseType: !687, size: 16, offset: 8288)
!687 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !511, file: !512, line: 224, baseType: !687, size: 16, offset: 8304)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !511, file: !512, line: 226, baseType: !185, size: 16, offset: 8320)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !511, file: !512, line: 228, baseType: !103, size: 8, offset: 8336)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !511, file: !512, line: 229, baseType: !103, size: 8, offset: 8344)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !511, file: !512, line: 231, baseType: !185, size: 16, offset: 8352)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !511, file: !512, line: 232, baseType: !103, size: 8, offset: 8368)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !511, file: !512, line: 233, baseType: !103, size: 8, offset: 8376)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !511, file: !512, line: 234, baseType: !391, size: 32, offset: 8384)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !511, file: !512, line: 235, baseType: !391, size: 32, offset: 8416)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !511, file: !512, line: 237, baseType: !140, size: 128, offset: 8448)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !511, file: !512, line: 238, baseType: !140, size: 128, offset: 8576)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !511, file: !512, line: 239, baseType: !140, size: 128, offset: 8704)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !511, file: !512, line: 240, baseType: !140, size: 128, offset: 8832)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !511, file: !512, line: 242, baseType: !391, size: 32, offset: 8960)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !511, file: !512, line: 244, baseType: !185, size: 16, offset: 8992)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !511, file: !512, line: 245, baseType: !687, size: 16, offset: 9008)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !511, file: !512, line: 246, baseType: !642, size: 128, offset: 9024)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !511, file: !512, line: 248, baseType: !48, size: 32, offset: 9152)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !511, file: !512, line: 249, baseType: !48, size: 32, offset: 9184)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !511, file: !512, line: 251, baseType: !708, size: 64, offset: 9216)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !512, line: 251, flags: DIFlagFwdDecl)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !511, file: !512, line: 253, baseType: !103, size: 8, offset: 9280)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !511, file: !512, line: 254, baseType: !103, size: 8, offset: 9288)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !511, file: !512, line: 255, baseType: !185, size: 16, offset: 9296)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !511, file: !512, line: 256, baseType: !571, size: 96, offset: 9312)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !511, file: !512, line: 258, baseType: !140, size: 128, offset: 9408)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !511, file: !512, line: 259, baseType: !140, size: 128, offset: 9536)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !511, file: !512, line: 260, baseType: !140, size: 128, offset: 9664)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !511, file: !512, line: 261, baseType: !140, size: 128, offset: 9792)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !511, file: !512, line: 263, baseType: !719, size: 64, offset: 9920)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !512, line: 52, flags: DIFlagFwdDecl)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !511, file: !512, line: 264, baseType: !722, size: 64, offset: 9984)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !512, line: 53, flags: DIFlagFwdDecl)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !511, file: !512, line: 265, baseType: !725, size: 64, offset: 10048)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !727, line: 51, size: 1216, elements: !728)
!727 = !DIFile(filename: "blender/source/blender/makesdna/DNA_group_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!728 = !{!729, !730, !731, !732}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !726, file: !727, line: 52, baseType: !206, size: 960)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "gobject", scope: !726, file: !727, line: 54, baseType: !140, size: 128, offset: 960)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !726, file: !727, line: 59, baseType: !7, size: 32, offset: 1088)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "dupli_ofs", scope: !726, file: !727, line: 60, baseType: !571, size: 96, offset: 1120)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !511, file: !512, line: 267, baseType: !103, size: 8, offset: 10112)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !511, file: !512, line: 268, baseType: !103, size: 8, offset: 10120)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !511, file: !512, line: 269, baseType: !185, size: 16, offset: 10128)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !511, file: !512, line: 270, baseType: !391, size: 32, offset: 10144)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !511, file: !512, line: 272, baseType: !738, size: 64, offset: 10176)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !512, line: 54, flags: DIFlagFwdDecl)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !511, file: !512, line: 275, baseType: !741, size: 64, offset: 10240)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !512, line: 275, flags: DIFlagFwdDecl)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !511, file: !512, line: 277, baseType: !744, size: 64, offset: 10304)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !512, line: 56, flags: DIFlagFwdDecl)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !511, file: !512, line: 277, baseType: !744, size: 64, offset: 10368)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !511, file: !512, line: 278, baseType: !190, size: 64, offset: 10432)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !511, file: !512, line: 279, baseType: !190, size: 64, offset: 10496)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !511, file: !512, line: 280, baseType: !7, size: 32, offset: 10560)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !511, file: !512, line: 281, baseType: !7, size: 32, offset: 10592)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !511, file: !512, line: 283, baseType: !140, size: 128, offset: 10624)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !511, file: !512, line: 284, baseType: !140, size: 128, offset: 10752)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !511, file: !512, line: 285, baseType: !754, size: 64, offset: 10880)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !511, file: !512, line: 287, baseType: !756, size: 64, offset: 10944)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !57, line: 95, size: 768, elements: !758)
!758 = !{!759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "physics_object", scope: !757, file: !57, line: 97, baseType: !125, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "physics_shape", scope: !757, file: !57, line: 98, baseType: !125, size: 64, offset: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !757, file: !57, line: 101, baseType: !185, size: 16, offset: 128)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !757, file: !57, line: 102, baseType: !185, size: 16, offset: 144)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !757, file: !57, line: 104, baseType: !48, size: 32, offset: 160)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "col_groups", scope: !757, file: !57, line: 105, baseType: !48, size: 32, offset: 192)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "mesh_source", scope: !757, file: !57, line: 106, baseType: !185, size: 16, offset: 224)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !757, file: !57, line: 107, baseType: !185, size: 16, offset: 240)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !757, file: !57, line: 110, baseType: !391, size: 32, offset: 256)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "friction", scope: !757, file: !57, line: 112, baseType: !391, size: 32, offset: 288)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "restitution", scope: !757, file: !57, line: 113, baseType: !391, size: 32, offset: 320)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !757, file: !57, line: 115, baseType: !391, size: 32, offset: 352)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "lin_damping", scope: !757, file: !57, line: 117, baseType: !391, size: 32, offset: 384)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "ang_damping", scope: !757, file: !57, line: 118, baseType: !391, size: 32, offset: 416)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "lin_sleep_thresh", scope: !757, file: !57, line: 120, baseType: !391, size: 32, offset: 448)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "ang_sleep_thresh", scope: !757, file: !57, line: 121, baseType: !391, size: 32, offset: 480)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "orn", scope: !757, file: !57, line: 123, baseType: !642, size: 128, offset: 512)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !757, file: !57, line: 124, baseType: !571, size: 96, offset: 640)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !757, file: !57, line: 125, baseType: !391, size: 32, offset: 736)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !511, file: !512, line: 288, baseType: !779, size: 64, offset: 11008)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !57, line: 195, size: 1024, elements: !781)
!781 = !{!782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "ob1", scope: !780, file: !57, line: 196, baseType: !510, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "ob2", scope: !780, file: !57, line: 197, baseType: !510, size: 64, offset: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !780, file: !57, line: 200, baseType: !185, size: 16, offset: 128)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "num_solver_iterations", scope: !780, file: !57, line: 201, baseType: !185, size: 16, offset: 144)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !780, file: !57, line: 203, baseType: !48, size: 32, offset: 160)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "breaking_threshold", scope: !780, file: !57, line: 205, baseType: !391, size: 32, offset: 192)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !780, file: !57, line: 206, baseType: !391, size: 32, offset: 224)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "limit_lin_x_lower", scope: !780, file: !57, line: 210, baseType: !391, size: 32, offset: 256)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "limit_lin_x_upper", scope: !780, file: !57, line: 211, baseType: !391, size: 32, offset: 288)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "limit_lin_y_lower", scope: !780, file: !57, line: 212, baseType: !391, size: 32, offset: 320)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "limit_lin_y_upper", scope: !780, file: !57, line: 213, baseType: !391, size: 32, offset: 352)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "limit_lin_z_lower", scope: !780, file: !57, line: 214, baseType: !391, size: 32, offset: 384)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "limit_lin_z_upper", scope: !780, file: !57, line: 215, baseType: !391, size: 32, offset: 416)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "limit_ang_x_lower", scope: !780, file: !57, line: 217, baseType: !391, size: 32, offset: 448)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "limit_ang_x_upper", scope: !780, file: !57, line: 218, baseType: !391, size: 32, offset: 480)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "limit_ang_y_lower", scope: !780, file: !57, line: 219, baseType: !391, size: 32, offset: 512)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "limit_ang_y_upper", scope: !780, file: !57, line: 220, baseType: !391, size: 32, offset: 544)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "limit_ang_z_lower", scope: !780, file: !57, line: 221, baseType: !391, size: 32, offset: 576)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "limit_ang_z_upper", scope: !780, file: !57, line: 222, baseType: !391, size: 32, offset: 608)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "spring_stiffness_x", scope: !780, file: !57, line: 226, baseType: !391, size: 32, offset: 640)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "spring_stiffness_y", scope: !780, file: !57, line: 227, baseType: !391, size: 32, offset: 672)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "spring_stiffness_z", scope: !780, file: !57, line: 228, baseType: !391, size: 32, offset: 704)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "spring_damping_x", scope: !780, file: !57, line: 230, baseType: !391, size: 32, offset: 736)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "spring_damping_y", scope: !780, file: !57, line: 231, baseType: !391, size: 32, offset: 768)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "spring_damping_z", scope: !780, file: !57, line: 232, baseType: !391, size: 32, offset: 800)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "motor_lin_target_velocity", scope: !780, file: !57, line: 235, baseType: !391, size: 32, offset: 832)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "motor_ang_target_velocity", scope: !780, file: !57, line: 236, baseType: !391, size: 32, offset: 864)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "motor_lin_max_impulse", scope: !780, file: !57, line: 237, baseType: !391, size: 32, offset: 896)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "motor_ang_max_impulse", scope: !780, file: !57, line: 238, baseType: !391, size: 32, offset: 928)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "physics_constraint", scope: !780, file: !57, line: 241, baseType: !125, size: 64, offset: 960)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !511, file: !512, line: 290, baseType: !813, size: 64, offset: 11072)
!813 = !DICompositeType(tag: DW_TAG_array_type, baseType: !391, size: 64, elements: !362)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !511, file: !512, line: 291, baseType: !815, size: 64, offset: 11136)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !817, line: 65, baseType: !818)
!817 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !817, line: 50, size: 320, elements: !819)
!819 = !{!820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !818, file: !817, line: 51, baseType: !501, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !818, file: !817, line: 53, baseType: !48, size: 32, offset: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !818, file: !817, line: 54, baseType: !48, size: 32, offset: 96)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !818, file: !817, line: 55, baseType: !48, size: 32, offset: 128)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !818, file: !817, line: 55, baseType: !48, size: 32, offset: 160)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !818, file: !817, line: 56, baseType: !103, size: 8, offset: 192)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !818, file: !817, line: 56, baseType: !103, size: 8, offset: 200)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !818, file: !817, line: 57, baseType: !103, size: 8, offset: 208)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !818, file: !817, line: 57, baseType: !103, size: 8, offset: 216)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !818, file: !817, line: 59, baseType: !185, size: 16, offset: 224)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !818, file: !817, line: 59, baseType: !185, size: 16, offset: 240)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !818, file: !817, line: 59, baseType: !185, size: 16, offset: 256)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !818, file: !817, line: 61, baseType: !185, size: 16, offset: 272)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !818, file: !817, line: 63, baseType: !48, size: 32, offset: 288)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !511, file: !512, line: 293, baseType: !140, size: 128, offset: 11200)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !511, file: !512, line: 294, baseType: !836, size: 64, offset: 11328)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !512, line: 113, baseType: !838)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !512, line: 108, size: 256, elements: !839)
!839 = !{!840, !842, !843, !844, !845}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !838, file: !512, line: 109, baseType: !841, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !838, file: !512, line: 109, baseType: !841, size: 64, offset: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !838, file: !512, line: 110, baseType: !510, size: 64, offset: 128)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !838, file: !512, line: 111, baseType: !48, size: 32, offset: 192)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !838, file: !512, line: 112, baseType: !391, size: 32, offset: 224)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !502, file: !503, line: 1221, baseType: !847, size: 64, offset: 1088)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !503, line: 52, flags: DIFlagFwdDecl)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !502, file: !503, line: 1223, baseType: !501, size: 64, offset: 1152)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !502, file: !503, line: 1225, baseType: !140, size: 128, offset: 1216)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !502, file: !503, line: 1226, baseType: !852, size: 64, offset: 1344)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !503, line: 69, size: 320, elements: !854)
!854 = !{!855, !856, !857, !858, !859, !860, !861, !862}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !853, file: !503, line: 70, baseType: !852, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !853, file: !503, line: 70, baseType: !852, size: 64, offset: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !853, file: !503, line: 71, baseType: !7, size: 32, offset: 128)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !853, file: !503, line: 71, baseType: !7, size: 32, offset: 160)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !853, file: !503, line: 72, baseType: !48, size: 32, offset: 192)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !853, file: !503, line: 73, baseType: !185, size: 16, offset: 224)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !853, file: !503, line: 73, baseType: !185, size: 16, offset: 240)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !853, file: !503, line: 74, baseType: !510, size: 64, offset: 256)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !502, file: !503, line: 1227, baseType: !510, size: 64, offset: 1408)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !502, file: !503, line: 1229, baseType: !571, size: 96, offset: 1472)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !502, file: !503, line: 1230, baseType: !571, size: 96, offset: 1568)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !502, file: !503, line: 1231, baseType: !571, size: 96, offset: 1664)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !502, file: !503, line: 1231, baseType: !571, size: 96, offset: 1760)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !502, file: !503, line: 1233, baseType: !7, size: 32, offset: 1856)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !502, file: !503, line: 1234, baseType: !48, size: 32, offset: 1888)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !502, file: !503, line: 1235, baseType: !7, size: 32, offset: 1920)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !502, file: !503, line: 1237, baseType: !185, size: 16, offset: 1952)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !502, file: !503, line: 1239, baseType: !103, size: 8, offset: 1968)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !502, file: !503, line: 1240, baseType: !874, size: 8, offset: 1976)
!874 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 8, elements: !875)
!875 = !{!876}
!876 = !DISubrange(count: 1)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !502, file: !503, line: 1242, baseType: !878, size: 64, offset: 1984)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
