; ModuleID = 'blender/source/blender/editors/space_info/space_info.c'
source_filename = "blender/source/blender/editors/space_info/space_info.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type opaque
%struct.ListBase = type { i8*, i8* }
%struct.SpaceType = type { %struct.SpaceType*, %struct.SpaceType*, [64 x i8], i32, i32, %struct.SpaceLink* (%struct.bContext*)*, void (%struct.SpaceLink*)*, void (%struct.wmWindowManager*, %struct.ScrArea*)*, void (%struct.wmWindowManager*, %struct.ScrArea*)*, void (%struct.bScreen*, %struct.ScrArea*, %struct.wmNotifier*)*, void (%struct.bContext*, %struct.ScrArea*)*, %struct.SpaceLink* (%struct.SpaceLink*)*, void ()*, void (%struct.wmKeyConfig*)*, void ()*, i32 (%struct.bContext*, i8*, %struct.bContextDataResult*)*, %struct.ListBase, %struct.ListBase, i32 }
%struct.SpaceLink = type { %struct.SpaceLink*, %struct.SpaceLink*, %struct.ListBase, i32, float, [8 x i16] }
%struct.bContext = type opaque

!1252 = !DIEnumerator(name: "ICON_BLANK345", value: 777, isUnsigned: true)
!1253 = !DIEnumerator(name: "ICON_BLANK346", value: 778, isUnsigned: true)
!1254 = !DIEnumerator(name: "ICON_BLANK346b", value: 779, isUnsigned: true)
!1255 = !DIEnumerator(name: "ICON_BRUSH_ADD", value: 780, isUnsigned: true)
!1256 = !DIEnumerator(name: "ICON_BRUSH_BLOB", value: 781, isUnsigned: true)
!1257 = !DIEnumerator(name: "ICON_BRUSH_BLUR", value: 782, isUnsigned: true)
!1258 = !DIEnumerator(name: "ICON_BRUSH_CLAY", value: 783, isUnsigned: true)
!1259 = !DIEnumerator(name: "ICON_BRUSH_CLAY_STRIPS", value: 784, isUnsigned: true)
!1260 = !DIEnumerator(name: "ICON_BRUSH_CLONE", value: 785, isUnsigned: true)
!1261 = !DIEnumerator(name: "ICON_BRUSH_CREASE", value: 786, isUnsigned: true)
!1262 = !DIEnumerator(name: "ICON_BRUSH_DARKEN", value: 787, isUnsigned: true)
!1263 = !DIEnumerator(name: "ICON_BRUSH_FILL", value: 788, isUnsigned: true)
!1264 = !DIEnumerator(name: "ICON_BRUSH_FLATTEN", value: 789, isUnsigned: true)
!1265 = !DIEnumerator(name: "ICON_BRUSH_GRAB", value: 790, isUnsigned: true)
!1266 = !DIEnumerator(name: "ICON_BRUSH_INFLATE", value: 791, isUnsigned: true)
!1267 = !DIEnumerator(name: "ICON_BRUSH_LAYER", value: 792, isUnsigned: true)
!1268 = !DIEnumerator(name: "ICON_BRUSH_LIGHTEN", value: 793, isUnsigned: true)
!1269 = !DIEnumerator(name: "ICON_BRUSH_MASK", value: 794, isUnsigned: true)
!1270 = !DIEnumerator(name: "ICON_BRUSH_MIX", value: 795, isUnsigned: true)
!1271 = !DIEnumerator(name: "ICON_BRUSH_MULTIPLY", value: 796, isUnsigned: true)
!1272 = !DIEnumerator(name: "ICON_BRUSH_NUDGE", value: 797, isUnsigned: true)
!1273 = !DIEnumerator(name: "ICON_BRUSH_PINCH", value: 798, isUnsigned: true)
!1274 = !DIEnumerator(name: "ICON_BRUSH_SCRAPE", value: 799, isUnsigned: true)
!1275 = !DIEnumerator(name: "ICON_BRUSH_SCULPT_DRAW", value: 800, isUnsigned: true)
!1276 = !DIEnumerator(name: "ICON_BRUSH_SMEAR", value: 801, isUnsigned: true)
!1277 = !DIEnumerator(name: "ICON_BRUSH_SMOOTH", value: 802, isUnsigned: true)
!1278 = !DIEnumerator(name: "ICON_BRUSH_SNAKE_HOOK", value: 803, isUnsigned: true)
!1279 = !DIEnumerator(name: "ICON_BRUSH_SOFTEN", value: 804, isUnsigned: true)
!1280 = !DIEnumerator(name: "ICON_BRUSH_SUBTRACT", value: 805, isUnsigned: true)
!1281 = !DIEnumerator(name: "ICON_BRUSH_TEXDRAW", value: 806, isUnsigned: true)
!1282 = !DIEnumerator(name: "ICON_BRUSH_TEXFILL", value: 807, isUnsigned: true)
!1283 = !DIEnumerator(name: "ICON_BRUSH_TEXMASK", value: 808, isUnsigned: true)
!1284 = !DIEnumerator(name: "ICON_BRUSH_THUMB", value: 809, isUnsigned: true)
!1285 = !DIEnumerator(name: "ICON_BRUSH_ROTATE", value: 810, isUnsigned: true)
!1286 = !DIEnumerator(name: "ICON_BRUSH_VERTEXDRAW", value: 811, isUnsigned: true)
!1287 = !DIEnumerator(name: "ICON_MATCAP_01", value: 812, isUnsigned: true)
!1288 = !DIEnumerator(name: "ICON_MATCAP_02", value: 813, isUnsigned: true)
!1289 = !DIEnumerator(name: "ICON_MATCAP_03", value: 814, isUnsigned: true)
!1290 = !DIEnumerator(name: "ICON_MATCAP_04", value: 815, isUnsigned: true)
!1291 = !DIEnumerator(name: "ICON_MATCAP_05", value: 816, isUnsigned: true)
!1292 = !DIEnumerator(name: "ICON_MATCAP_06", value: 817, isUnsigned: true)
!1293 = !DIEnumerator(name: "ICON_MATCAP_07", value: 818, isUnsigned: true)
!1294 = !DIEnumerator(name: "ICON_MATCAP_08", value: 819, isUnsigned: true)
!1295 = !DIEnumerator(name: "ICON_MATCAP_09", value: 820, isUnsigned: true)
!1296 = !DIEnumerator(name: "ICON_MATCAP_10", value: 821, isUnsigned: true)
!1297 = !DIEnumerator(name: "ICON_MATCAP_11", value: 822, isUnsigned: true)
!1298 = !DIEnumerator(name: "ICON_MATCAP_12", value: 823, isUnsigned: true)
!1299 = !DIEnumerator(name: "ICON_MATCAP_13", value: 824, isUnsigned: true)
!1300 = !DIEnumerator(name: "ICON_MATCAP_14", value: 825, isUnsigned: true)
!1301 = !DIEnumerator(name: "ICON_MATCAP_15", value: 826, isUnsigned: true)
!1302 = !DIEnumerator(name: "ICON_MATCAP_16", value: 827, isUnsigned: true)
!1303 = !DIEnumerator(name: "ICON_MATCAP_17", value: 828, isUnsigned: true)
!1304 = !DIEnumerator(name: "ICON_MATCAP_18", value: 829, isUnsigned: true)
!1305 = !DIEnumerator(name: "ICON_MATCAP_19", value: 830, isUnsigned: true)
!1306 = !DIEnumerator(name: "ICON_MATCAP_20", value: 831, isUnsigned: true)
!1307 = !DIEnumerator(name: "ICON_MATCAP_21", value: 832, isUnsigned: true)
!1308 = !DIEnumerator(name: "ICON_MATCAP_22", value: 833, isUnsigned: true)
!1309 = !DIEnumerator(name: "ICON_MATCAP_23", value: 834, isUnsigned: true)
!1310 = !DIEnumerator(name: "ICON_MATCAP_24", value: 835, isUnsigned: true)
!1311 = !DIEnumerator(name: "VICO_VIEW3D_VEC", value: 836, isUnsigned: true)
!1312 = !DIEnumerator(name: "VICO_EDIT_VEC", value: 837, isUnsigned: true)
!1313 = !DIEnumerator(name: "VICO_EDITMODE_VEC_DEHLT", value: 838, isUnsigned: true)
!1314 = !DIEnumerator(name: "VICO_EDITMODE_VEC_HLT", value: 839, isUnsigned: true)
!1315 = !DIEnumerator(name: "VICO_DISCLOSURE_TRI_RIGHT_VEC", value: 840, isUnsigned: true)
!1316 = !DIEnumerator(name: "VICO_DISCLOSURE_TRI_DOWN_VEC", value: 841, isUnsigned: true)
!1317 = !DIEnumerator(name: "VICO_MOVE_UP_VEC", value: 842, isUnsigned: true)
!1318 = !DIEnumerator(name: "VICO_MOVE_DOWN_VEC", value: 843, isUnsigned: true)
!1319 = !DIEnumerator(name: "VICO_X_VEC", value: 844, isUnsigned: true)
!1320 = !DIEnumerator(name: "VICO_SMALL_TRI_RIGHT_VEC", value: 845, isUnsigned: true)
!1321 = !DIEnumerator(name: "BIFICONID_LAST", value: 846, isUnsigned: true)
!1322 = !{!1323}
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64)
!1324 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceLink", file: !4, line: 91, baseType: !1325)
!1325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !4, line: 85, size: 448, elements: !1326)
!1326 = !{!1327, !1329, !1330, !1338, !1339, !1341}
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1325, file: !4, line: 86, baseType: !1328, size: 64)
!1328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1325, file: !4, line: 86, baseType: !1328, size: 64, offset: 64)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !1325, file: !4, line: 87, baseType: !1331, size: 128, offset: 128)
!1331 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !1332, line: 71, baseType: !1333)
!1332 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !1332, line: 69, size: 128, elements: !1334)
!1334 = !{!1335, !1337}
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1333, file: !1332, line: 70, baseType: !1336, size: 64)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1333, file: !1332, line: 70, baseType: !1336, size: 64, offset: 64)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !1325, file: !4, line: 88, baseType: !250, size: 32, offset: 256)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !1325, file: !4, line: 89, baseType: !1340, size: 32, offset: 288)
!1340 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !1325, file: !4, line: 90, baseType: !1342, size: 128, offset: 320)
!1342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1343, size: 128, elements: !1344)
!1343 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1344 = !{!1345}
!1345 = !DISubrange(count: 8)
!1346 = !{i32 7, !"Dwarf Version", i32 4}
!1347 = !{i32 2, !"Debug Info Version", i32 3}
!1348 = !{i32 1, !"wchar_size", i32 4}
!1349 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!1350 = distinct !DISubprogram(name: "ED_spacetype_info", scope: !1, file: !1, line: 315, type: !1351, scopeLine: 316, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1353)
!1351 = !DISubroutineType(types: !1352)
!1352 = !{null}
!1353 = !{}
!1354 = !DILocalVariable(name: "st", scope: !1350, file: !1, line: 317, type: !1355)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64)
!1356 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceType", file: !1357, line: 112, baseType: !1358)
!1357 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_screen.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceType", file: !1357, line: 66, size: 1728, elements: !1359)
!1359 = !{!1360, !1362, !1363, !1368, !1369, !1370, !1378, !1382, !2860, !2861, !2878, !2882, !2886, !2888, !2892, !2893, !2899, !2900, !2901}
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1358, file: !1357, line: 67, baseType: !1361, size: 64)
!1361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1358, size: 64)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1358, file: !1357, line: 67, baseType: !1361, size: 64, offset: 64)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1358, file: !1357, line: 69, baseType: !1364, size: 512, offset: 128)
!1364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1365, size: 512, elements: !1366)
!1365 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!1366 = !{!1367}
!1367 = !DISubrange(count: 64)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "spaceid", scope: !1358, file: !1357, line: 70, baseType: !250, size: 32, offset: 640)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "iconid", scope: !1358, file: !1357, line: 71, baseType: !250, size: 32, offset: 672)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "new", scope: !1358, file: !1357, line: 74, baseType: !1371, size: 64, offset: 704)
!1371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1372, size: 64)
!1372 = !DISubroutineType(types: !1373)
!1373 = !{!1328, !1374}
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64)
!1375 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1376)
!1376 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !1377, line: 44, flags: DIFlagFwdDecl)
!1377 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !1358, file: !1357, line: 76, baseType: !1379, size: 64, offset: 768)
!1379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1380, size: 64)
!1380 = !DISubroutineType(types: !1381)
!1381 = !{null, !1328}
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1358, file: !1357, line: 79, baseType: !1383, size: 64, offset: 832)
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1384, size: 64)
!1384 = !DISubroutineType(types: !1385)
!1385 = !{null, !1386, !2816}
!1386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1387, size: 64)
!1387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindowManager", file: !1388, line: 128, size: 2816, elements: !1389)
!1388 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1389 = !{!1390, !1449, !2779, !2780, !2781, !2782, !2783, !2784, !2785, !2786, !2795, !2796, !2797, !2798, !2799, !2810, !2811, !2812, !2813, !2814, !2815}
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1387, file: !1388, line: 129, baseType: !1391, size: 960)
!1391 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !1392, line: 130, baseType: !1393)
!1392 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !1392, line: 117, size: 960, elements: !1394)
!1394 = !{!1395, !1396, !1397, !1399, !1418, !1422, !1423, !1424, !1425, !1426}
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1393, file: !1392, line: 118, baseType: !1336, size: 64)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1393, file: !1392, line: 118, baseType: !1336, size: 64, offset: 64)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !1393, file: !1392, line: 119, baseType: !1398, size: 64, offset: 128)
!1398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1393, size: 64)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1393, file: !1392, line: 120, baseType: !1400, size: 64, offset: 192)
!1400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1401, size: 64)
!1401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !1392, line: 136, size: 17600, elements: !1402)
!1402 = !{!1403, !1404, !1406, !1409, !1413, !1414, !1415}
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1401, file: !1392, line: 137, baseType: !1391, size: 960)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !1401, file: !1392, line: 138, baseType: !1405, size: 64, offset: 960)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1391, size: 64)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !1401, file: !1392, line: 139, baseType: !1407, size: 64, offset: 1024)
!1407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1408, size: 64)
!1408 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !1392, line: 43, flags: DIFlagFwdDecl)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1401, file: !1392, line: 140, baseType: !1410, size: 8192, offset: 1088)
!1410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1365, size: 8192, elements: !1411)
!1411 = !{!1412}
!1412 = !DISubrange(count: 1024)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !1401, file: !1392, line: 141, baseType: !1410, size: 8192, offset: 9280)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1401, file: !1392, line: 148, baseType: !1400, size: 64, offset: 17472)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1401, file: !1392, line: 150, baseType: !1416, size: 64, offset: 17536)
!1416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1417, size: 64)
!1417 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !1392, line: 45, flags: DIFlagFwdDecl)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1393, file: !1392, line: 121, baseType: !1419, size: 528, offset: 256)
!1419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1365, size: 528, elements: !1420)
!1420 = !{!1421}
!1421 = !DISubrange(count: 66)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1393, file: !1392, line: 126, baseType: !1343, size: 16, offset: 784)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1393, file: !1392, line: 127, baseType: !250, size: 32, offset: 800)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !1393, file: !1392, line: 128, baseType: !250, size: 32, offset: 832)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1393, file: !1392, line: 128, baseType: !250, size: 32, offset: 864)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1393, file: !1392, line: 129, baseType: !1427, size: 64, offset: 896)
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64)
!1428 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !1392, line: 75, baseType: !1429)
!1429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !1392, line: 62, size: 1024, elements: !1430)
!1430 = !{!1431, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1447, !1448}
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1429, file: !1392, line: 63, baseType: !1432, size: 64)
!1432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1429, file: !1392, line: 63, baseType: !1432, size: 64, offset: 64)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1429, file: !1392, line: 64, baseType: !1365, size: 8, offset: 128)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1429, file: !1392, line: 64, baseType: !1365, size: 8, offset: 136)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1429, file: !1392, line: 65, baseType: !1343, size: 16, offset: 144)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1429, file: !1392, line: 66, baseType: !1364, size: 512, offset: 160)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !1429, file: !1392, line: 67, baseType: !250, size: 32, offset: 672)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1429, file: !1392, line: 69, baseType: !1440, size: 256, offset: 704)
!1440 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !1392, line: 60, baseType: !1441)
!1441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !1392, line: 48, size: 256, elements: !1442)
!1442 = !{!1443, !1444, !1445, !1446}
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1441, file: !1392, line: 49, baseType: !1336, size: 64)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !1441, file: !1392, line: 58, baseType: !1331, size: 128, offset: 64)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1441, file: !1392, line: 59, baseType: !250, size: 32, offset: 192)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !1441, file: !1392, line: 59, baseType: !250, size: 32, offset: 224)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1429, file: !1392, line: 70, baseType: !250, size: 32, offset: 960)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !1429, file: !1392, line: 74, baseType: !250, size: 32, offset: 992)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "windrawable", scope: !1387, file: !1388, line: 131, baseType: !1450, size: 64, offset: 960)
!1450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1451, size: 64)
!1451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !1388, line: 169, size: 2048, elements: !1452)
!1452 = !{!1453, !1454, !1455, !1456, !2695, !2696, !2697, !2698, !2699, !2700, !2701, !2702, !2703, !2704, !2705, !2706, !2707, !2708, !2709, !2710, !2711, !2712, !2754, !2757, !2771, !2772, !2773, !2774, !2775, !2776, !2777, !2778}
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1451, file: !1388, line: 170, baseType: !1450, size: 64)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1451, file: !1388, line: 170, baseType: !1450, size: 64, offset: 64)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !1451, file: !1388, line: 172, baseType: !1336, size: 64, offset: 128)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !1451, file: !1388, line: 174, baseType: !1457, size: 64, offset: 192)
!1457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1458, size: 64)
!1458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !30, line: 49, size: 1984, elements: !1459)
!1459 = !{!1460, !1461, !1462, !1463, !1464, !1465, !2662, !2663, !2664, !2665, !2666, !2667, !2668, !2669, !2670, !2671, !2672, !2673, !2674, !2675, !2676, !2677, !2694}
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1458, file: !30, line: 50, baseType: !1391, size: 960)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !1458, file: !30, line: 52, baseType: !1331, size: 128, offset: 960)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !1458, file: !30, line: 53, baseType: !1331, size: 128, offset: 1088)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !1458, file: !30, line: 54, baseType: !1331, size: 128, offset: 1216)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !1458, file: !30, line: 55, baseType: !1331, size: 128, offset: 1344)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1458, file: !30, line: 57, baseType: !1466, size: 64, offset: 1472)
!1466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1467, size: 64)
!1467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !1468, line: 1216, size: 39680, elements: !1469)
!1468 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1469 = !{!1470, !1471, !1475, !1479, !1482, !1483, !1484, !1496, !1497, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1513, !1593, !2026, !2241, !2244, !2532, !2544, !2545, !2546, !2547, !2548, !2549, !2550, !2551, !2554, !2555, !2556, !2557, !2558, !2566, !2633, !2640, !2641, !2648, !2649, !2655, !2656, !2657, !2658, !2659}
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1467, file: !1468, line: 1217, baseType: !1391, size: 960)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1467, file: !1468, line: 1218, baseType: !1472, size: 64, offset: 960)
!1472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1473, size: 64)
!1473 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !1474, line: 43, flags: DIFlagFwdDecl)
!1474 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1467, file: !1468, line: 1220, baseType: !1476, size: 64, offset: 1024)
!1476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1477, size: 64)
!1477 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !1478, line: 44, flags: DIFlagFwdDecl)
!1478 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !1467, file: !1468, line: 1221, baseType: !1480, size: 64, offset: 1088)
!1480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1481, size: 64)
!1481 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !1468, line: 52, flags: DIFlagFwdDecl)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !1467, file: !1468, line: 1223, baseType: !1466, size: 64, offset: 1152)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1467, file: !1468, line: 1225, baseType: !1331, size: 128, offset: 1216)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !1467, file: !1468, line: 1226, baseType: !1485, size: 64, offset: 1344)
!1485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1486, size: 64)
!1486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !1468, line: 69, size: 320, elements: !1487)
!1487 = !{!1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495}
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1486, file: !1468, line: 70, baseType: !1485, size: 64)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1486, file: !1468, line: 70, baseType: !1485, size: 64, offset: 64)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1486, file: !1468, line: 71, baseType: !5, size: 32, offset: 128)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !1486, file: !1468, line: 71, baseType: !5, size: 32, offset: 160)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1486, file: !1468, line: 72, baseType: !250, size: 32, offset: 192)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !1486, file: !1468, line: 73, baseType: !1343, size: 16, offset: 224)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !1486, file: !1468, line: 73, baseType: !1343, size: 16, offset: 240)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1486, file: !1468, line: 74, baseType: !1476, size: 64, offset: 256)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !1467, file: !1468, line: 1227, baseType: !1476, size: 64, offset: 1408)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !1467, file: !1468, line: 1229, baseType: !1498, size: 96, offset: 1472)
!1498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1340, size: 96, elements: !1499)
!1499 = !{!1500}
!1500 = !DISubrange(count: 3)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !1467, file: !1468, line: 1230, baseType: !1498, size: 96, offset: 1568)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !1467, file: !1468, line: 1231, baseType: !1498, size: 96, offset: 1664)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !1467, file: !1468, line: 1231, baseType: !1498, size: 96, offset: 1760)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1467, file: !1468, line: 1233, baseType: !5, size: 32, offset: 1856)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !1467, file: !1468, line: 1234, baseType: !250, size: 32, offset: 1888)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !1467, file: !1468, line: 1235, baseType: !5, size: 32, offset: 1920)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1467, file: !1468, line: 1237, baseType: !1343, size: 16, offset: 1952)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !1467, file: !1468, line: 1239, baseType: !1365, size: 8, offset: 1968)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1467, file: !1468, line: 1240, baseType: !1510, size: 8, offset: 1976)
!1510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1365, size: 8, elements: !1511)
!1511 = !{!1512}
!1512 = !DISubrange(count: 1)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !1467, file: !1468, line: 1242, baseType: !1514, size: 64, offset: 1984)
!1514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1515, size: 64)
!1515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !1516, line: 328, size: 3456, elements: !1517)
!1516 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1517 = !{!1518, !1519, !1520, !1523, !1524, !1527, !1531, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1558, !1559, !1560, !1563, !1568, !1569, !1572, !1576, !1581, !1585, !1589, !1590, !1591, !1592}
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1515, file: !1516, line: 329, baseType: !1391, size: 960)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1515, file: !1516, line: 330, baseType: !1472, size: 64, offset: 960)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !1515, file: !1516, line: 332, baseType: !1521, size: 64, offset: 1024)
!1521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1522, size: 64)
!1522 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !1516, line: 332, flags: DIFlagFwdDecl)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1515, file: !1516, line: 333, baseType: !1364, size: 512, offset: 1088)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !1515, file: !1516, line: 335, baseType: !1525, size: 64, offset: 1600)
!1525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1526, size: 64)
!1526 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !1377, line: 41, flags: DIFlagFwdDecl)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1515, file: !1516, line: 337, baseType: !1528, size: 64, offset: 1664)
!1528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1529, size: 64)
!1529 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !1530, line: 45, flags: DIFlagFwdDecl)
!1530 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !1515, file: !1516, line: 338, baseType: !1532, size: 64, offset: 1728)
!1532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1340, size: 64, elements: !1533)
!1533 = !{!1534}
!1534 = !DISubrange(count: 2)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !1515, file: !1516, line: 340, baseType: !1331, size: 128, offset: 1792)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !1515, file: !1516, line: 340, baseType: !1331, size: 128, offset: 1920)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1515, file: !1516, line: 342, baseType: !250, size: 32, offset: 2048)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1515, file: !1516, line: 342, baseType: !250, size: 32, offset: 2080)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !1515, file: !1516, line: 343, baseType: !250, size: 32, offset: 2112)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1515, file: !1516, line: 345, baseType: !250, size: 32, offset: 2144)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !1515, file: !1516, line: 346, baseType: !250, size: 32, offset: 2176)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !1515, file: !1516, line: 347, baseType: !1343, size: 16, offset: 2208)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1515, file: !1516, line: 348, baseType: !1343, size: 16, offset: 2224)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1515, file: !1516, line: 349, baseType: !250, size: 32, offset: 2240)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !1515, file: !1516, line: 351, baseType: !250, size: 32, offset: 2272)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !1515, file: !1516, line: 353, baseType: !1343, size: 16, offset: 2304)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !1515, file: !1516, line: 354, baseType: !1343, size: 16, offset: 2320)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !1515, file: !1516, line: 355, baseType: !250, size: 32, offset: 2336)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !1515, file: !1516, line: 357, baseType: !1550, size: 128, offset: 2368)
!1550 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !1551, line: 95, baseType: !1552)
!1551 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !1551, line: 92, size: 128, elements: !1553)
!1553 = !{!1554, !1555, !1556, !1557}
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1552, file: !1551, line: 93, baseType: !1340, size: 32)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1552, file: !1551, line: 93, baseType: !1340, size: 32, offset: 32)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1552, file: !1551, line: 94, baseType: !1340, size: 32, offset: 64)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1552, file: !1551, line: 94, baseType: !1340, size: 32, offset: 96)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !1515, file: !1516, line: 363, baseType: !1331, size: 128, offset: 2496)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !1515, file: !1516, line: 363, baseType: !1331, size: 128, offset: 2624)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !1515, file: !1516, line: 368, baseType: !1561, size: 64, offset: 2752)
!1561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1562, size: 64)
!1562 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !1516, line: 48, flags: DIFlagFwdDecl)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !1515, file: !1516, line: 372, baseType: !1564, size: 32, offset: 2816)
!1564 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !1516, line: 274, baseType: !1565)
!1565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !1516, line: 271, size: 32, elements: !1566)
!1566 = !{!1567}
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1565, file: !1516, line: 273, baseType: !5, size: 32)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1515, file: !1516, line: 373, baseType: !250, size: 32, offset: 2848)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !1515, file: !1516, line: 382, baseType: !1570, size: 64, offset: 2880)
!1570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1571, size: 64)
!1571 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !1516, line: 46, flags: DIFlagFwdDecl)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !1515, file: !1516, line: 385, baseType: !1573, size: 64, offset: 2944)
!1573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1574, size: 64)
!1574 = !DISubroutineType(types: !1575)
!1575 = !{null, !1336, !1340}
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !1515, file: !1516, line: 386, baseType: !1577, size: 64, offset: 3008)
!1577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1578, size: 64)
!1578 = !DISubroutineType(types: !1579)
!1579 = !{null, !1336, !1580}
!1580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1365, size: 64)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !1515, file: !1516, line: 387, baseType: !1582, size: 64, offset: 3072)
!1582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1583, size: 64)
!1583 = !DISubroutineType(types: !1584)
!1584 = !{!250, !1336}
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !1515, file: !1516, line: 388, baseType: !1586, size: 64, offset: 3136)
!1586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1587, size: 64)
!1587 = !DISubroutineType(types: !1588)
!1588 = !{null, !1336}
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !1515, file: !1516, line: 389, baseType: !1336, size: 64, offset: 3200)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !1515, file: !1516, line: 389, baseType: !1336, size: 64, offset: 3264)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !1515, file: !1516, line: 389, baseType: !1336, size: 64, offset: 3328)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !1515, file: !1516, line: 389, baseType: !1336, size: 64, offset: 3392)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !1467, file: !1468, line: 1244, baseType: !1594, size: 64, offset: 2048)
!1594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1595, size: 64)
!1595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !1596, line: 200, size: 17024, elements: !1597)
!1596 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1597 = !{!1598, !1600, !1601, !1602, !2019, !2020, !2021, !2022, !2023, !2024, !2025}
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !1595, file: !1596, line: 201, baseType: !1599, size: 64)
!1599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !1595, file: !1596, line: 202, baseType: !1331, size: 128, offset: 64)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !1595, file: !1596, line: 203, baseType: !1331, size: 128, offset: 192)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !1595, file: !1596, line: 206, baseType: !1603, size: 64, offset: 320)
!1603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1604, size: 64)
!1604 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !1596, line: 190, baseType: !1605)
!1605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !1596, line: 126, size: 2816, elements: !1606)
!1606 = !{!1607, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1706, !1709, !1710, !1711, !1991, !1994, !1995, !1996, !1997, !1998, !1999, !2000, !2001, !2004, !2005, !2006, !2007, !2008, !2009, !2010, !2011, !2012, !2013, !2014, !2015, !2016, !2018}
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1605, file: !1596, line: 127, baseType: !1608, size: 64)
!1608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1605, size: 64)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1605, file: !1596, line: 127, baseType: !1608, size: 64, offset: 64)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !1605, file: !1596, line: 128, baseType: !1336, size: 64, offset: 128)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1605, file: !1596, line: 129, baseType: !1336, size: 64, offset: 192)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1605, file: !1596, line: 130, baseType: !1364, size: 512, offset: 256)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1605, file: !1596, line: 132, baseType: !250, size: 32, offset: 768)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1605, file: !1596, line: 132, baseType: !250, size: 32, offset: 800)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1605, file: !1596, line: 133, baseType: !250, size: 32, offset: 832)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1605, file: !1596, line: 134, baseType: !250, size: 32, offset: 864)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !1605, file: !1596, line: 134, baseType: !250, size: 32, offset: 896)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !1605, file: !1596, line: 134, baseType: !250, size: 32, offset: 928)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !1605, file: !1596, line: 135, baseType: !250, size: 32, offset: 960)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !1605, file: !1596, line: 135, baseType: !250, size: 32, offset: 992)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1605, file: !1596, line: 136, baseType: !250, size: 32, offset: 1024)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1605, file: !1596, line: 136, baseType: !250, size: 32, offset: 1056)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !1605, file: !1596, line: 137, baseType: !250, size: 32, offset: 1088)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !1605, file: !1596, line: 137, baseType: !250, size: 32, offset: 1120)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !1605, file: !1596, line: 138, baseType: !1340, size: 32, offset: 1152)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !1605, file: !1596, line: 139, baseType: !1340, size: 32, offset: 1184)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !1605, file: !1596, line: 139, baseType: !1340, size: 32, offset: 1216)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !1605, file: !1596, line: 141, baseType: !1343, size: 16, offset: 1248)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !1605, file: !1596, line: 142, baseType: !1343, size: 16, offset: 1264)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !1605, file: !1596, line: 143, baseType: !250, size: 32, offset: 1280)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !1605, file: !1596, line: 144, baseType: !250, size: 32, offset: 1312)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !1605, file: !1596, line: 146, baseType: !1633, size: 64, offset: 1344)
!1633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1634, size: 64)
!1634 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !1596, line: 114, baseType: !1635)
!1635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !1596, line: 99, size: 7232, elements: !1636)
!1636 = !{!1637, !1639, !1640, !1641, !1642, !1643, !1644, !1655, !1659, !1674, !1683, !1690, !1700}
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1635, file: !1596, line: 100, baseType: !1638, size: 64)
!1638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1635, size: 64)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1635, file: !1596, line: 100, baseType: !1638, size: 64, offset: 64)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1635, file: !1596, line: 101, baseType: !250, size: 32, offset: 128)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1635, file: !1596, line: 101, baseType: !250, size: 32, offset: 160)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !1635, file: !1596, line: 102, baseType: !250, size: 32, offset: 192)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !1635, file: !1596, line: 102, baseType: !250, size: 32, offset: 224)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !1635, file: !1596, line: 103, baseType: !1645, size: 64, offset: 256)
!1645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1646, size: 64)
!1646 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !1596, line: 59, baseType: !1647)
!1647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !1596, line: 56, size: 2112, elements: !1648)
!1648 = !{!1649, !1653, !1654}
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1647, file: !1596, line: 57, baseType: !1650, size: 2048)
!1650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1365, size: 2048, elements: !1651)
!1651 = !{!1652}
!1652 = !DISubrange(count: 256)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !1647, file: !1596, line: 58, baseType: !250, size: 32, offset: 2048)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !1647, file: !1596, line: 58, baseType: !250, size: 32, offset: 2080)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1635, file: !1596, line: 106, baseType: !1656, size: 6144, offset: 320)
!1656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1365, size: 6144, elements: !1657)
!1657 = !{!1658}
!1658 = !DISubrange(count: 768)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1635, file: !1596, line: 107, baseType: !1660, size: 64, offset: 6464)
!1660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1661, size: 64)
!1661 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !1596, line: 97, baseType: !1662)
!1662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !1596, line: 83, size: 8320, elements: !1663)
!1663 = !{!1664, !1665, !1666, !1670, !1671, !1672, !1673}
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1662, file: !1596, line: 84, baseType: !1656, size: 6144)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !1662, file: !1596, line: 87, baseType: !1650, size: 2048, offset: 6144)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1662, file: !1596, line: 88, baseType: !1667, size: 64, offset: 8192)
!1667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1668, size: 64)
!1668 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !1669, line: 41, flags: DIFlagFwdDecl)
!1669 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !1662, file: !1596, line: 90, baseType: !1343, size: 16, offset: 8256)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1662, file: !1596, line: 92, baseType: !1343, size: 16, offset: 8272)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !1662, file: !1596, line: 93, baseType: !1343, size: 16, offset: 8288)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !1662, file: !1596, line: 95, baseType: !1343, size: 16, offset: 8304)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !1635, file: !1596, line: 108, baseType: !1675, size: 64, offset: 6528)
!1675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1676, size: 64)
!1676 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !1596, line: 66, baseType: !1677)
!1677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !1596, line: 61, size: 128, elements: !1678)
!1678 = !{!1679, !1680, !1681, !1682}
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !1677, file: !1596, line: 62, baseType: !250, size: 32)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !1677, file: !1596, line: 63, baseType: !250, size: 32, offset: 32)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !1677, file: !1596, line: 64, baseType: !250, size: 32, offset: 64)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !1677, file: !1596, line: 65, baseType: !250, size: 32, offset: 96)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !1635, file: !1596, line: 109, baseType: !1684, size: 64, offset: 6592)
!1684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1685, size: 64)
!1685 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !1596, line: 71, baseType: !1686)
!1686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !1596, line: 68, size: 64, elements: !1687)
!1687 = !{!1688, !1689}
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !1686, file: !1596, line: 69, baseType: !250, size: 32)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !1686, file: !1596, line: 70, baseType: !250, size: 32, offset: 32)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !1635, file: !1596, line: 110, baseType: !1691, size: 64, offset: 6656)
!1691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1692, size: 64)
!1692 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !1596, line: 81, baseType: !1693)
!1693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !1596, line: 73, size: 352, elements: !1694)
!1694 = !{!1695, !1696, !1697, !1698, !1699}
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !1693, file: !1596, line: 74, baseType: !1498, size: 96)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !1693, file: !1596, line: 75, baseType: !1498, size: 96, offset: 96)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !1693, file: !1596, line: 76, baseType: !1498, size: 96, offset: 192)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1693, file: !1596, line: 77, baseType: !250, size: 32, offset: 288)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1693, file: !1596, line: 78, baseType: !250, size: 32, offset: 320)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1635, file: !1596, line: 113, baseType: !1701, size: 512, offset: 6720)
!1701 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !1702, line: 182, baseType: !1703)
!1702 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !1702, line: 180, size: 512, elements: !1704)
!1704 = !{!1705}
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1703, file: !1702, line: 181, baseType: !1364, size: 512)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1605, file: !1596, line: 148, baseType: !1707, size: 64, offset: 1408)
!1707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1708, size: 64)
!1708 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !1596, line: 49, flags: DIFlagFwdDecl)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1605, file: !1596, line: 151, baseType: !1466, size: 64, offset: 1472)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !1605, file: !1596, line: 152, baseType: !1476, size: 64, offset: 1536)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !1605, file: !1596, line: 153, baseType: !1712, size: 64, offset: 1600)
!1712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1713, size: 64)
!1713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !1474, line: 64, size: 19136, elements: !1714)
!1714 = !{!1715, !1716, !1717, !1718, !1719, !1720, !1722, !1723, !1724, !1725, !1728, !1729, !1977, !1978, !1986, !1987, !1988, !1989, !1990}
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1713, file: !1474, line: 65, baseType: !1391, size: 960)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1713, file: !1474, line: 66, baseType: !1472, size: 64, offset: 960)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1713, file: !1474, line: 68, baseType: !1410, size: 8192, offset: 1024)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1713, file: !1474, line: 70, baseType: !250, size: 32, offset: 9216)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1713, file: !1474, line: 71, baseType: !250, size: 32, offset: 9248)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !1713, file: !1474, line: 72, baseType: !1721, size: 64, offset: 9280)
!1721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 64, elements: !1533)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !1713, file: !1474, line: 74, baseType: !1340, size: 32, offset: 9344)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !1713, file: !1474, line: 74, baseType: !1340, size: 32, offset: 9376)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1713, file: !1474, line: 76, baseType: !1667, size: 64, offset: 9408)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1713, file: !1474, line: 77, baseType: !1726, size: 64, offset: 9472)
!1726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1727, size: 64)
!1727 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !1474, line: 77, flags: DIFlagFwdDecl)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1713, file: !1474, line: 78, baseType: !1528, size: 64, offset: 9536)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !1713, file: !1474, line: 80, baseType: !1730, size: 2624, offset: 9600)
!1730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !1530, line: 340, size: 2624, elements: !1731)
!1731 = !{!1732, !1760, !1778, !1779, !1780, !1798, !1856, !1857, !1957, !1958, !1959, !1960, !1966}
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !1730, file: !1530, line: 341, baseType: !1733, size: 576)
!1733 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !1530, line: 251, baseType: !1734)
!1734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !1530, line: 207, size: 576, elements: !1735)
!1735 = !{!1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759}
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1734, file: !1530, line: 208, baseType: !250, size: 32)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !1734, file: !1530, line: 211, baseType: !1343, size: 16, offset: 32)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !1734, file: !1530, line: 212, baseType: !1343, size: 16, offset: 48)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !1734, file: !1530, line: 213, baseType: !1340, size: 32, offset: 64)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !1734, file: !1530, line: 214, baseType: !1343, size: 16, offset: 96)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !1734, file: !1530, line: 215, baseType: !1343, size: 16, offset: 112)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !1734, file: !1530, line: 216, baseType: !1343, size: 16, offset: 128)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !1734, file: !1530, line: 217, baseType: !1343, size: 16, offset: 144)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !1734, file: !1530, line: 218, baseType: !1343, size: 16, offset: 160)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !1734, file: !1530, line: 219, baseType: !1343, size: 16, offset: 176)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !1734, file: !1530, line: 220, baseType: !1340, size: 32, offset: 192)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !1734, file: !1530, line: 222, baseType: !1343, size: 16, offset: 224)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !1734, file: !1530, line: 225, baseType: !1343, size: 16, offset: 240)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !1734, file: !1530, line: 228, baseType: !250, size: 32, offset: 256)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !1734, file: !1530, line: 229, baseType: !250, size: 32, offset: 288)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !1734, file: !1530, line: 233, baseType: !250, size: 32, offset: 320)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !1734, file: !1530, line: 236, baseType: !1343, size: 16, offset: 352)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1734, file: !1530, line: 236, baseType: !1343, size: 16, offset: 368)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !1734, file: !1530, line: 241, baseType: !1340, size: 32, offset: 384)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !1734, file: !1530, line: 244, baseType: !250, size: 32, offset: 416)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !1734, file: !1530, line: 244, baseType: !250, size: 32, offset: 448)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !1734, file: !1530, line: 245, baseType: !1340, size: 32, offset: 480)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !1734, file: !1530, line: 248, baseType: !1340, size: 32, offset: 512)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !1734, file: !1530, line: 250, baseType: !250, size: 32, offset: 544)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1730, file: !1530, line: 342, baseType: !1761, size: 448, offset: 576)
!1761 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !1530, line: 79, baseType: !1762)
!1762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !1530, line: 61, size: 448, elements: !1763)
!1763 = !{!1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777}
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !1762, file: !1530, line: 62, baseType: !1336, size: 64)
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !1762, file: !1530, line: 64, baseType: !1343, size: 16, offset: 64)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1762, file: !1530, line: 65, baseType: !1343, size: 16, offset: 80)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !1762, file: !1530, line: 67, baseType: !1340, size: 32, offset: 96)
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !1762, file: !1530, line: 68, baseType: !1340, size: 32, offset: 128)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !1762, file: !1530, line: 69, baseType: !1340, size: 32, offset: 160)
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !1762, file: !1530, line: 70, baseType: !1343, size: 16, offset: 192)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1762, file: !1530, line: 71, baseType: !1343, size: 16, offset: 208)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !1762, file: !1530, line: 72, baseType: !1532, size: 64, offset: 224)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !1762, file: !1530, line: 75, baseType: !1340, size: 32, offset: 288)
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !1762, file: !1530, line: 75, baseType: !1340, size: 32, offset: 320)
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !1762, file: !1530, line: 75, baseType: !1340, size: 32, offset: 352)
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !1762, file: !1530, line: 78, baseType: !1340, size: 32, offset: 384)
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !1762, file: !1530, line: 78, baseType: !1340, size: 32, offset: 416)
!1778 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !1730, file: !1530, line: 343, baseType: !1331, size: 128, offset: 1024)
!1779 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !1730, file: !1530, line: 344, baseType: !1331, size: 128, offset: 1152)
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !1730, file: !1530, line: 345, baseType: !1781, size: 192, offset: 1280)
!1781 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !1530, line: 278, baseType: !1782)
!1782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !1530, line: 270, size: 192, elements: !1783)
!1783 = !{!1784, !1785, !1786, !1787, !1788}
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1782, file: !1530, line: 271, baseType: !250, size: 32)
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1782, file: !1530, line: 273, baseType: !1340, size: 32, offset: 32)
!1786 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !1782, file: !1530, line: 275, baseType: !250, size: 32, offset: 64)
!1787 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !1782, file: !1530, line: 276, baseType: !250, size: 32, offset: 96)
!1788 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !1782, file: !1530, line: 277, baseType: !1789, size: 64, offset: 128)
!1789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1790, size: 64)
!1790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !1530, line: 55, size: 576, elements: !1791)
!1791 = !{!1792, !1793, !1794}
!1792 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1790, file: !1530, line: 56, baseType: !250, size: 32)
!1793 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1790, file: !1530, line: 57, baseType: !1340, size: 32, offset: 32)
!1794 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1790, file: !1530, line: 58, baseType: !1795, size: 512, offset: 64)
!1795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1340, size: 512, elements: !1796)
!1796 = !{!1797, !1797}
!1797 = !DISubrange(count: 4)
!1798 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !1730, file: !1530, line: 346, baseType: !1799, size: 384, offset: 1472)
!1799 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !1530, line: 268, baseType: !1800)
!1800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !1530, line: 253, size: 384, elements: !1801)
!1801 = !{!1802, !1803, !1804, !1805, !1806, !1850, !1851, !1852, !1853, !1854, !1855}
!1802 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1800, file: !1530, line: 254, baseType: !250, size: 32)
!1803 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !1800, file: !1530, line: 255, baseType: !250, size: 32, offset: 32)
!1804 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !1800, file: !1530, line: 255, baseType: !250, size: 32, offset: 64)
!1805 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !1800, file: !1530, line: 258, baseType: !1340, size: 32, offset: 96)
!1806 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !1800, file: !1530, line: 259, baseType: !1807, size: 64, offset: 128)
!1807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1808, size: 64)
!1808 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !1530, line: 164, baseType: !1809)
!1809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !1530, line: 108, size: 1664, elements: !1810)
!1810 = !{!1811, !1813, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849}
!1811 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1809, file: !1530, line: 109, baseType: !1812, size: 64)
!1812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1809, size: 64)
!1813 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1809, file: !1530, line: 109, baseType: !1812, size: 64, offset: 64)
!1814 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1809, file: !1530, line: 111, baseType: !1364, size: 512, offset: 128)
!1815 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !1809, file: !1530, line: 119, baseType: !1532, size: 64, offset: 640)
!1816 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !1809, file: !1530, line: 119, baseType: !1532, size: 64, offset: 704)
!1817 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !1809, file: !1530, line: 125, baseType: !1532, size: 64, offset: 768)
!1818 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !1809, file: !1530, line: 125, baseType: !1532, size: 64, offset: 832)
!1819 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1809, file: !1530, line: 127, baseType: !1532, size: 64, offset: 896)
!1820 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !1809, file: !1530, line: 130, baseType: !250, size: 32, offset: 960)
!1821 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !1809, file: !1530, line: 131, baseType: !250, size: 32, offset: 992)
!1822 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1809, file: !1530, line: 132, baseType: !1823, size: 64, offset: 1024)
!1823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1824, size: 64)
!1824 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !1530, line: 106, baseType: !1825)
!1825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !1530, line: 81, size: 512, elements: !1826)
!1826 = !{!1827, !1828, !1831, !1832, !1833, !1834}
!1827 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1825, file: !1530, line: 82, baseType: !1532, size: 64)
!1828 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !1825, file: !1530, line: 97, baseType: !1829, size: 256, offset: 64)
!1829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1340, size: 256, elements: !1830)
!1830 = !{!1797, !1534}
!1831 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !1825, file: !1530, line: 102, baseType: !1532, size: 64, offset: 320)
!1832 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !1825, file: !1530, line: 102, baseType: !1532, size: 64, offset: 384)
!1833 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1825, file: !1530, line: 104, baseType: !250, size: 32, offset: 448)
!1834 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1825, file: !1530, line: 105, baseType: !250, size: 32, offset: 480)
!1835 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !1809, file: !1530, line: 135, baseType: !1498, size: 96, offset: 1088)
!1836 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1809, file: !1530, line: 136, baseType: !1340, size: 32, offset: 1184)
!1837 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1809, file: !1530, line: 139, baseType: !250, size: 32, offset: 1216)
!1838 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !1809, file: !1530, line: 139, baseType: !250, size: 32, offset: 1248)
!1839 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !1809, file: !1530, line: 139, baseType: !250, size: 32, offset: 1280)
!1840 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !1809, file: !1530, line: 140, baseType: !1498, size: 96, offset: 1312)
!1841 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !1809, file: !1530, line: 143, baseType: !1343, size: 16, offset: 1408)
!1842 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !1809, file: !1530, line: 144, baseType: !1343, size: 16, offset: 1424)
!1843 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !1809, file: !1530, line: 145, baseType: !1343, size: 16, offset: 1440)
!1844 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !1809, file: !1530, line: 148, baseType: !1343, size: 16, offset: 1456)
!1845 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !1809, file: !1530, line: 149, baseType: !250, size: 32, offset: 1472)
!1846 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !1809, file: !1530, line: 150, baseType: !1340, size: 32, offset: 1504)
!1847 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1809, file: !1530, line: 152, baseType: !1528, size: 64, offset: 1536)
!1848 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !1809, file: !1530, line: 163, baseType: !1340, size: 32, offset: 1600)
!1849 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1809, file: !1530, line: 163, baseType: !1340, size: 32, offset: 1632)
!1850 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !1800, file: !1530, line: 261, baseType: !1340, size: 32, offset: 192)
!1851 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !1800, file: !1530, line: 261, baseType: !1340, size: 32, offset: 224)
!1852 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !1800, file: !1530, line: 261, baseType: !1340, size: 32, offset: 256)
!1853 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1800, file: !1530, line: 263, baseType: !250, size: 32, offset: 288)
!1854 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1800, file: !1530, line: 266, baseType: !250, size: 32, offset: 320)
!1855 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1800, file: !1530, line: 267, baseType: !1340, size: 32, offset: 352)
!1856 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !1730, file: !1530, line: 347, baseType: !1807, size: 64, offset: 1856)
!1857 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !1730, file: !1530, line: 348, baseType: !1858, size: 64, offset: 1920)
!1858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1859, size: 64)
!1859 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !1530, line: 205, baseType: !1860)
!1860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !1530, line: 186, size: 1024, elements: !1861)
!1861 = !{!1862, !1864, !1865, !1866, !1868, !1869, !1870, !1878, !1879, !1880, !1955, !1956}
!1862 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1860, file: !1530, line: 187, baseType: !1863, size: 64)
!1863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1860, size: 64)
!1864 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1860, file: !1530, line: 187, baseType: !1863, size: 64, offset: 64)
!1865 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1860, file: !1530, line: 189, baseType: !1364, size: 512, offset: 128)
!1866 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !1860, file: !1530, line: 191, baseType: !1867, size: 64, offset: 640)
!1867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1807, size: 64)
!1868 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !1860, file: !1530, line: 193, baseType: !250, size: 32, offset: 704)
!1869 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1860, file: !1530, line: 193, baseType: !250, size: 32, offset: 736)
!1870 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1860, file: !1530, line: 195, baseType: !1871, size: 64, offset: 768)
!1871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1872, size: 64)
!1872 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !1530, line: 184, baseType: !1873)
!1873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !1530, line: 166, size: 320, elements: !1874)
!1874 = !{!1875, !1876, !1877}
!1875 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !1873, file: !1530, line: 180, baseType: !1829, size: 256)
!1876 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1873, file: !1530, line: 182, baseType: !250, size: 32, offset: 256)
!1877 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1873, file: !1530, line: 183, baseType: !250, size: 32, offset: 288)
!1878 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !1860, file: !1530, line: 196, baseType: !250, size: 32, offset: 832)
!1879 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1860, file: !1530, line: 198, baseType: !250, size: 32, offset: 864)
!1880 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !1860, file: !1530, line: 200, baseType: !1881, size: 64, offset: 896)
!1881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1882, size: 64)
!1882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !1669, line: 77, size: 15424, elements: !1883)
!1883 = !{!1884, !1885, !1886, !1889, !1892, !1893, !1896, !1898, !1899, !1900, !1901, !1902, !1903, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1914, !1915, !1929, !1930, !1931, !1932, !1933, !1934, !1935, !1936, !1937, !1938, !1941, !1942, !1943, !1944, !1945, !1949}
!1884 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1882, file: !1669, line: 78, baseType: !1391, size: 960)
!1885 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1882, file: !1669, line: 80, baseType: !1410, size: 8192, offset: 960)
!1886 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1882, file: !1669, line: 82, baseType: !1887, size: 64, offset: 9152)
!1887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1888, size: 64)
!1888 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !1669, line: 43, flags: DIFlagFwdDecl)
!1889 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1882, file: !1669, line: 83, baseType: !1890, size: 64, offset: 9216)
!1890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1891, size: 64)
!1891 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !1392, line: 46, flags: DIFlagFwdDecl)
!1892 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1882, file: !1669, line: 86, baseType: !1667, size: 64, offset: 9280)
!1893 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !1882, file: !1669, line: 87, baseType: !1894, size: 64, offset: 9344)
!1894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1895, size: 64)
!1895 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !1669, line: 44, flags: DIFlagFwdDecl)
!1896 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !1882, file: !1669, line: 89, baseType: !1897, size: 512, offset: 9408)
!1897 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1894, size: 512, elements: !1344)
!1898 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !1882, file: !1669, line: 90, baseType: !1343, size: 16, offset: 9920)
!1899 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !1882, file: !1669, line: 90, baseType: !1343, size: 16, offset: 9936)
!1900 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1882, file: !1669, line: 92, baseType: !1343, size: 16, offset: 9952)
!1901 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1882, file: !1669, line: 92, baseType: !1343, size: 16, offset: 9968)
!1902 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1882, file: !1669, line: 93, baseType: !1343, size: 16, offset: 9984)
!1903 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1882, file: !1669, line: 93, baseType: !1343, size: 16, offset: 10000)
!1904 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1882, file: !1669, line: 94, baseType: !250, size: 32, offset: 10016)
!1905 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !1882, file: !1669, line: 97, baseType: !1343, size: 16, offset: 10048)
!1906 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !1882, file: !1669, line: 97, baseType: !1343, size: 16, offset: 10064)
!1907 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !1882, file: !1669, line: 98, baseType: !1343, size: 16, offset: 10080)
!1908 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !1882, file: !1669, line: 98, baseType: !1343, size: 16, offset: 10096)
!1909 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !1882, file: !1669, line: 99, baseType: !1343, size: 16, offset: 10112)
!1910 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !1882, file: !1669, line: 99, baseType: !1343, size: 16, offset: 10128)
!1911 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !1882, file: !1669, line: 100, baseType: !5, size: 32, offset: 10144)
!1912 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !1882, file: !1669, line: 101, baseType: !1913, size: 64, offset: 10176)
!1913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!1914 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1882, file: !1669, line: 103, baseType: !1416, size: 64, offset: 10240)
!1915 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !1882, file: !1669, line: 104, baseType: !1916, size: 64, offset: 10304)
!1916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1917, size: 64)
!1917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !1392, line: 159, size: 448, elements: !1918)
!1918 = !{!1919, !1921, !1922, !1924, !1925, !1927}
!1919 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1917, file: !1392, line: 161, baseType: !1920, size: 64)
!1920 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !1533)
!1921 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1917, file: !1392, line: 162, baseType: !1920, size: 64, offset: 64)
!1922 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !1917, file: !1392, line: 163, baseType: !1923, size: 32, offset: 128)
!1923 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1343, size: 32, elements: !1533)
!1924 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !1917, file: !1392, line: 164, baseType: !1923, size: 32, offset: 160)
!1925 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !1917, file: !1392, line: 165, baseType: !1926, size: 128, offset: 192)
!1926 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1913, size: 128, elements: !1533)
!1927 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1917, file: !1392, line: 166, baseType: !1928, size: 128, offset: 320)
!1928 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1890, size: 128, elements: !1533)
!1929 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !1882, file: !1669, line: 107, baseType: !1340, size: 32, offset: 10368)
!1930 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !1882, file: !1669, line: 108, baseType: !250, size: 32, offset: 10400)
!1931 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !1882, file: !1669, line: 109, baseType: !1343, size: 16, offset: 10432)
!1932 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1882, file: !1669, line: 110, baseType: !1343, size: 16, offset: 10448)
!1933 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !1882, file: !1669, line: 113, baseType: !250, size: 32, offset: 10464)
!1934 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !1882, file: !1669, line: 113, baseType: !250, size: 32, offset: 10496)
!1935 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !1882, file: !1669, line: 114, baseType: !1365, size: 8, offset: 10528)
!1936 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !1882, file: !1669, line: 114, baseType: !1365, size: 8, offset: 10536)
!1937 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !1882, file: !1669, line: 115, baseType: !1343, size: 16, offset: 10544)
!1938 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !1882, file: !1669, line: 116, baseType: !1939, size: 128, offset: 10560)
!1939 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1340, size: 128, elements: !1940)
!1940 = !{!1797}
!1941 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !1882, file: !1669, line: 119, baseType: !1340, size: 32, offset: 10688)
!1942 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !1882, file: !1669, line: 119, baseType: !1340, size: 32, offset: 10720)
!1943 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1882, file: !1669, line: 122, baseType: !1701, size: 512, offset: 10752)
!1944 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !1882, file: !1669, line: 123, baseType: !1365, size: 8, offset: 11264)
!1945 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1882, file: !1669, line: 125, baseType: !1946, size: 56, offset: 11272)
!1946 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1365, size: 56, elements: !1947)
!1947 = !{!1948}
!1948 = !DISubrange(count: 7)
!1949 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !1882, file: !1669, line: 126, baseType: !1950, size: 4096, offset: 11328)
!1950 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1951, size: 4096, elements: !1344)
!1951 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !1669, line: 69, baseType: !1952)
!1952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !1669, line: 67, size: 512, elements: !1953)
!1953 = !{!1954}
!1954 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1952, file: !1669, line: 68, baseType: !1364, size: 512)
!1955 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !1860, file: !1530, line: 201, baseType: !1340, size: 32, offset: 960)
!1956 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !1860, file: !1530, line: 204, baseType: !250, size: 32, offset: 992)
!1957 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1730, file: !1530, line: 350, baseType: !1331, size: 128, offset: 1984)
!1958 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !1730, file: !1530, line: 351, baseType: !250, size: 32, offset: 2112)
!1959 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !1730, file: !1530, line: 351, baseType: !250, size: 32, offset: 2144)
!1960 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !1730, file: !1530, line: 353, baseType: !1961, size: 64, offset: 2176)
!1961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1962, size: 64)
!1962 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !1530, line: 297, baseType: !1963)
!1963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !1530, line: 295, size: 2048, elements: !1964)
!1964 = !{!1965}
!1965 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !1963, file: !1530, line: 296, baseType: !1650, size: 2048)
!1966 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !1730, file: !1530, line: 355, baseType: !1967, size: 384, offset: 2240)
!1967 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !1530, line: 338, baseType: !1968)
!1968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !1530, line: 322, size: 384, elements: !1969)
!1969 = !{!1970, !1971, !1972, !1973, !1974, !1975, !1976}
!1970 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1968, file: !1530, line: 323, baseType: !250, size: 32)
!1971 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !1968, file: !1530, line: 325, baseType: !1343, size: 16, offset: 32)
!1972 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1968, file: !1530, line: 326, baseType: !1343, size: 16, offset: 48)
!1973 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !1968, file: !1530, line: 331, baseType: !1331, size: 128, offset: 64)
!1974 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1968, file: !1530, line: 334, baseType: !1331, size: 128, offset: 192)
!1975 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !1968, file: !1530, line: 335, baseType: !250, size: 32, offset: 320)
!1976 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1968, file: !1530, line: 337, baseType: !250, size: 32, offset: 352)
!1977 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !1713, file: !1474, line: 81, baseType: !1336, size: 64, offset: 12224)
!1978 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1713, file: !1474, line: 85, baseType: !1979, size: 6208, offset: 12288)
!1979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !1474, line: 55, size: 6208, elements: !1980)
!1980 = !{!1981, !1982, !1983, !1984, !1985}
!1981 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1979, file: !1474, line: 56, baseType: !1656, size: 6144)
!1982 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !1979, file: !1474, line: 58, baseType: !1343, size: 16, offset: 6144)
!1983 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1979, file: !1474, line: 59, baseType: !1343, size: 16, offset: 6160)
!1984 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !1979, file: !1474, line: 60, baseType: !1343, size: 16, offset: 6176)
!1985 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !1979, file: !1474, line: 61, baseType: !1343, size: 16, offset: 6192)
!1986 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1713, file: !1474, line: 86, baseType: !250, size: 32, offset: 18496)
!1987 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1713, file: !1474, line: 88, baseType: !250, size: 32, offset: 18528)
!1988 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1713, file: !1474, line: 90, baseType: !250, size: 32, offset: 18560)
!1989 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !1713, file: !1474, line: 94, baseType: !250, size: 32, offset: 18592)
!1990 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1713, file: !1474, line: 100, baseType: !1701, size: 512, offset: 18624)
!1991 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !1605, file: !1596, line: 154, baseType: !1992, size: 64, offset: 1664)
!1992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1993, size: 64)
!1993 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !1478, line: 264, flags: DIFlagFwdDecl)
!1994 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1605, file: !1596, line: 156, baseType: !1667, size: 64, offset: 1728)
!1995 = !DIDerivedType(tag: DW_TAG_member, name: "effect_fader", scope: !1605, file: !1596, line: 158, baseType: !1340, size: 32, offset: 1792)
!1996 = !DIDerivedType(tag: DW_TAG_member, name: "speed_fader", scope: !1605, file: !1596, line: 159, baseType: !1340, size: 32, offset: 1824)
!1997 = !DIDerivedType(tag: DW_TAG_member, name: "seq1", scope: !1605, file: !1596, line: 162, baseType: !1608, size: 64, offset: 1856)
!1998 = !DIDerivedType(tag: DW_TAG_member, name: "seq2", scope: !1605, file: !1596, line: 162, baseType: !1608, size: 64, offset: 1920)
!1999 = !DIDerivedType(tag: DW_TAG_member, name: "seq3", scope: !1605, file: !1596, line: 162, baseType: !1608, size: 64, offset: 1984)
!2000 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !1605, file: !1596, line: 164, baseType: !1331, size: 128, offset: 2048)
!2001 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !1605, file: !1596, line: 166, baseType: !2002, size: 64, offset: 2176)
!2002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2003, size: 64)
!2003 = !DICompositeType(tag: DW_TAG_structure_type, name: "bSound", file: !1596, line: 51, flags: DIFlagFwdDecl)
!2004 = !DIDerivedType(tag: DW_TAG_member, name: "scene_sound", scope: !1605, file: !1596, line: 167, baseType: !1336, size: 64, offset: 2240)
!2005 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !1605, file: !1596, line: 168, baseType: !1340, size: 32, offset: 2304)
!2006 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !1605, file: !1596, line: 170, baseType: !1340, size: 32, offset: 2336)
!2007 = !DIDerivedType(tag: DW_TAG_member, name: "pan", scope: !1605, file: !1596, line: 170, baseType: !1340, size: 32, offset: 2368)
!2008 = !DIDerivedType(tag: DW_TAG_member, name: "strobe", scope: !1605, file: !1596, line: 171, baseType: !1340, size: 32, offset: 2400)
!2009 = !DIDerivedType(tag: DW_TAG_member, name: "effectdata", scope: !1605, file: !1596, line: 173, baseType: !1336, size: 64, offset: 2432)
!2010 = !DIDerivedType(tag: DW_TAG_member, name: "anim_startofs", scope: !1605, file: !1596, line: 175, baseType: !250, size: 32, offset: 2496)
!2011 = !DIDerivedType(tag: DW_TAG_member, name: "anim_endofs", scope: !1605, file: !1596, line: 176, baseType: !250, size: 32, offset: 2528)
!2012 = !DIDerivedType(tag: DW_TAG_member, name: "blend_mode", scope: !1605, file: !1596, line: 179, baseType: !250, size: 32, offset: 2560)
!2013 = !DIDerivedType(tag: DW_TAG_member, name: "blend_opacity", scope: !1605, file: !1596, line: 180, baseType: !1340, size: 32, offset: 2592)
!2014 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !1605, file: !1596, line: 183, baseType: !250, size: 32, offset: 2624)
!2015 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !1605, file: !1596, line: 185, baseType: !1365, size: 8, offset: 2656)
!2016 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1605, file: !1596, line: 186, baseType: !2017, size: 24, offset: 2664)
!2017 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1365, size: 24, elements: !1499)
!2018 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !1605, file: !1596, line: 189, baseType: !1331, size: 128, offset: 2688)
!2019 = !DIDerivedType(tag: DW_TAG_member, name: "act_imagedir", scope: !1595, file: !1596, line: 207, baseType: !1410, size: 8192, offset: 384)
!2020 = !DIDerivedType(tag: DW_TAG_member, name: "act_sounddir", scope: !1595, file: !1596, line: 208, baseType: !1410, size: 8192, offset: 8576)
!2021 = !DIDerivedType(tag: DW_TAG_member, name: "over_ofs", scope: !1595, file: !1596, line: 210, baseType: !250, size: 32, offset: 16768)
!2022 = !DIDerivedType(tag: DW_TAG_member, name: "over_cfra", scope: !1595, file: !1596, line: 210, baseType: !250, size: 32, offset: 16800)
!2023 = !DIDerivedType(tag: DW_TAG_member, name: "over_flag", scope: !1595, file: !1596, line: 211, baseType: !250, size: 32, offset: 16832)
!2024 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1595, file: !1596, line: 211, baseType: !250, size: 32, offset: 16864)
!2025 = !DIDerivedType(tag: DW_TAG_member, name: "over_border", scope: !1595, file: !1596, line: 212, baseType: !1550, size: 128, offset: 16896)
!2026 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !1467, file: !1468, line: 1246, baseType: !2027, size: 64, offset: 2112)
!2027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2028, size: 64)
!2028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !1468, line: 1067, size: 5184, elements: !2029)
!2029 = !{!2030, !2060, !2061, !2076, !2082, !2083, !2084, !2085, !2086, !2087, !2088, !2089, !2090, !2091, !2092, !2093, !2094, !2098, !2114, !2141, !2142, !2143, !2144, !2145, !2146, !2147, !2148, !2149, !2150, !2151, !2152, !2153, !2154, !2155, !2156, !2157, !2158, !2159, !2160, !2161, !2162, !2163, !2164, !2165, !2166, !2167, !2168, !2169, !2171, !2172, !2173, !2174, !2175, !2176, !2177, !2178, !2179, !2180, !2181, !2182, !2183, !2184, !2185, !2186, !2187, !2188, !2189, !2190, !2191, !2192, !2193, !2194, !2195, !2196, !2224}
!2030 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !2028, file: !1468, line: 1068, baseType: !2031, size: 64)
!2031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2032, size: 64)
!2032 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !1468, line: 934, baseType: !2033)
!2033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !1468, line: 925, size: 576, elements: !2034)
!2034 = !{!2035, !2052, !2053, !2054, !2055, !2056, !2059}
!2035 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !2033, file: !1468, line: 926, baseType: !2036, size: 320)
!2036 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !1468, line: 830, baseType: !2037)
!2037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !1468, line: 813, size: 320, elements: !2038)
!2038 = !{!2039, !2042, !2045, !2046, !2049, !2050, !2051}
!2039 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !2037, file: !1468, line: 814, baseType: !2040, size: 64)
!2040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2041, size: 64)
!2041 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !1468, line: 51, flags: DIFlagFwdDecl)
!2042 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !2037, file: !1468, line: 815, baseType: !2043, size: 64, offset: 64)
!2043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2044, size: 64)
!2044 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !1468, line: 815, flags: DIFlagFwdDecl)
!2045 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !2037, file: !1468, line: 818, baseType: !1336, size: 64, offset: 128)
!2046 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !2037, file: !1468, line: 819, baseType: !2047, size: 32, offset: 192)
!2047 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2048, size: 32, elements: !1940)
!2048 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!2049 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !2037, file: !1468, line: 822, baseType: !250, size: 32, offset: 224)
!2050 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !2037, file: !1468, line: 826, baseType: !250, size: 32, offset: 256)
!2051 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !2037, file: !1468, line: 829, baseType: !250, size: 32, offset: 288)
!2052 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !2033, file: !1468, line: 928, baseType: !1343, size: 16, offset: 320)
!2053 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !2033, file: !1468, line: 928, baseType: !1343, size: 16, offset: 336)
!2054 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !2033, file: !1468, line: 929, baseType: !250, size: 32, offset: 352)
!2055 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !2033, file: !1468, line: 930, baseType: !1913, size: 64, offset: 384)
!2056 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !2033, file: !1468, line: 931, baseType: !2057, size: 64, offset: 448)
!2057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2058, size: 64)
!2058 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !1468, line: 931, flags: DIFlagFwdDecl)
!2059 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !2033, file: !1468, line: 933, baseType: !1336, size: 64, offset: 512)
!2060 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !2028, file: !1468, line: 1069, baseType: !2031, size: 64, offset: 64)
!2061 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !2028, file: !1468, line: 1070, baseType: !2062, size: 64, offset: 128)
!2062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2063, size: 64)
!2063 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !1468, line: 916, baseType: !2064)
!2064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !1468, line: 891, size: 704, elements: !2065)
!2065 = !{!2066, !2067, !2068, !2070, !2071, !2072, !2073, !2074, !2075}
!2066 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !2064, file: !1468, line: 892, baseType: !2036, size: 320)
!2067 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !2064, file: !1468, line: 896, baseType: !250, size: 32, offset: 320)
!2068 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !2064, file: !1468, line: 900, baseType: !2069, size: 96, offset: 352)
!2069 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 96, elements: !1499)
!2070 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !2064, file: !1468, line: 903, baseType: !1340, size: 32, offset: 448)
!2071 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !2064, file: !1468, line: 906, baseType: !250, size: 32, offset: 480)
!2072 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !2064, file: !1468, line: 909, baseType: !1340, size: 32, offset: 512)
!2073 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !2064, file: !1468, line: 912, baseType: !1340, size: 32, offset: 544)
!2074 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !2064, file: !1468, line: 914, baseType: !1476, size: 64, offset: 576)
!2075 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !2064, file: !1468, line: 915, baseType: !1336, size: 64, offset: 640)
!2076 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !2028, file: !1468, line: 1071, baseType: !2077, size: 64, offset: 192)
!2077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2078, size: 64)
!2078 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !1468, line: 920, baseType: !2079)
!2079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !1468, line: 918, size: 320, elements: !2080)
!2080 = !{!2081}
!2081 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !2079, file: !1468, line: 919, baseType: !2036, size: 320)
!2082 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !2028, file: !1468, line: 1075, baseType: !1340, size: 32, offset: 256)
!2083 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !2028, file: !1468, line: 1077, baseType: !1340, size: 32, offset: 288)
!2084 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !2028, file: !1468, line: 1078, baseType: !1340, size: 32, offset: 320)
!2085 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !2028, file: !1468, line: 1079, baseType: !1343, size: 16, offset: 352)
!2086 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !2028, file: !1468, line: 1082, baseType: !1343, size: 16, offset: 368)
!2087 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !2028, file: !1468, line: 1085, baseType: !1365, size: 8, offset: 384)
!2088 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !2028, file: !1468, line: 1086, baseType: !1365, size: 8, offset: 392)
!2089 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !2028, file: !1468, line: 1087, baseType: !1365, size: 8, offset: 400)
!2090 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !2028, file: !1468, line: 1088, baseType: !1365, size: 8, offset: 408)
!2091 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !2028, file: !1468, line: 1090, baseType: !1340, size: 32, offset: 416)
!2092 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !2028, file: !1468, line: 1093, baseType: !1343, size: 16, offset: 448)
!2093 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !2028, file: !1468, line: 1096, baseType: !1365, size: 8, offset: 464)
