; ModuleID = 'blender/source/blender/blenlib/intern/graph.c'
source_filename = "blender/source/blender/blenlib/intern/graph.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BGraph = type { %struct.ListBase, %struct.ListBase, float, void (%struct.BArc*)*, void (%struct.BNode*)*, void (%struct.BNode*, %struct.RadialArc*, i32)*, void (%struct.BNode*, %struct.BNode*, %struct.BNode*, %struct.BArc*, %struct.BArc*)* }
%struct.ListBase = type { i8*, i8* }
%struct.BArc = type { i8*, i8*, %struct.BNode*, %struct.BNode*, i32, float, i32, i32, i32 }
%struct.RadialArc = type { %struct.BArc*, [3 x float] }
%struct.BNode = type { i8*, i8*, [3 x float], i32, i32, %struct.BArc**, i32, i32, i32, [3 x float] }
%struct.BArcIterator = type { i8* (i8*)*, i8* (i8*)*, i8* (i8*, i32)*, i8* (i8*)*, i8* (i8*, i32)*, i8* (i8*)*, i32 (i8*)*, float*, float*, float, i32, i32 }

@MEM_freeN = external dso_local global void (i8*)*, align 8
@MEM_callocN = external dso_local global i8* (i64, i8*)*, align 8
@.str = private unnamed_addr constant [15 x i8] c"adjacency list\00", align 1
@.str.1 = private unnamed_addr constant [50 x i8] c"error in node [%p]. Added only %i arcs out of %i\0A\00", align 1
@.str.2 = private unnamed_addr constant [21 x i8] c"radial symmetry ring\00", align 1

; Function Attrs: noinline nounwind uwtable

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/blenlib/intern/graph.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "BArcIterator", file: !7, line: 123, baseType: !8)
!7 = !DIFile(filename: "blender/source/blender/blenlib/BLI_graph.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!8 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BArcIterator", file: !7, line: 109, size: 704, elements: !9)
!9 = !{!10, !15, !17, !23, !25, !27, !29, !34, !37, !38, !39, !40}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !8, file: !7, line: 110, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "HeadFct", file: !7, line: 101, baseType: !12)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DISubroutineType(types: !14)
!14 = !{!4, !4}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !8, file: !7, line: 111, baseType: !16, size: 64, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "TailFct", file: !7, line: 102, baseType: !12)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "peek", scope: !8, file: !7, line: 112, baseType: !18, size: 64, offset: 128)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "PeekFct", file: !7, line: 103, baseType: !19)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DISubroutineType(types: !21)
!21 = !{!4, !4, !22}
!22 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !8, file: !7, line: 113, baseType: !24, size: 64, offset: 192)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "NextFct", file: !7, line: 104, baseType: !12)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "nextN", scope: !8, file: !7, line: 114, baseType: !26, size: 64, offset: 256)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "NextNFct", file: !7, line: 105, baseType: !19)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !8, file: !7, line: 115, baseType: !28, size: 64, offset: 320)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "PreviousFct", file: !7, line: 106, baseType: !12)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "stopped", scope: !8, file: !7, line: 116, baseType: !30, size: 64, offset: 384)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "StoppedFct", file: !7, line: 107, baseType: !31)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DISubroutineType(types: !33)
!33 = !{!22, !4}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !8, file: !7, line: 118, baseType: !35, size: 64, offset: 448)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !8, file: !7, line: 118, baseType: !35, size: 64, offset: 512)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !8, file: !7, line: 119, baseType: !36, size: 32, offset: 576)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !8, file: !7, line: 121, baseType: !22, size: 32, offset: 608)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !8, file: !7, line: 122, baseType: !22, size: 32, offset: 640)
!41 = !{i32 7, !"Dwarf Version", i32 4}
!42 = !{i32 2, !"Debug Info Version", i32 3}
!43 = !{i32 1, !"wchar_size", i32 4}
!44 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!45 = distinct !DISubprogram(name: "BLI_freeNode", scope: !1, file: !1, line: 45, type: !46, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!46 = !DISubroutineType(types: !47)
!47 = !{null, !48, !115}
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "BGraph", file: !7, line: 62, baseType: !50)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BGraph", file: !7, line: 51, size: 576, elements: !51)
!51 = !{!52, !59, !60, !61, !95, !100, !110}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "arcs", scope: !50, file: !7, line: 52, baseType: !53, size: 128)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !54, line: 71, baseType: !55)
!54 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !54, line: 69, size: 128, elements: !56)
!56 = !{!57, !58}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !55, file: !54, line: 70, baseType: !4, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !55, file: !54, line: 70, baseType: !4, size: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !50, file: !7, line: 53, baseType: !53, size: 128, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !50, file: !7, line: 55, baseType: !36, size: 32, offset: 256)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "free_arc", scope: !50, file: !7, line: 58, baseType: !62, size: 64, offset: 320)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "FreeArc", file: !7, line: 40, baseType: !63)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DISubroutineType(types: !65)
!65 = !{null, !66}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BArc", file: !7, line: 79, size: 448, elements: !68)
!68 = !{!69, !70, !71, !89, !90, !91, !92, !93, !94}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !67, file: !7, line: 80, baseType: !4, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !67, file: !7, line: 80, baseType: !4, size: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !67, file: !7, line: 81, baseType: !72, size: 64, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BNode", file: !7, line: 64, size: 576, elements: !74)
!74 = !{!75, !76, !77, !81, !82, !83, !85, !86, !87, !88}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !73, file: !7, line: 65, baseType: !4, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !73, file: !7, line: 65, baseType: !4, size: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !73, file: !7, line: 66, baseType: !78, size: 96, offset: 128)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 96, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 3)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !73, file: !7, line: 67, baseType: !22, size: 32, offset: 224)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "degree", scope: !73, file: !7, line: 69, baseType: !22, size: 32, offset: 256)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "arcs", scope: !73, file: !7, line: 70, baseType: !84, size: 64, offset: 320)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "subgraph_index", scope: !73, file: !7, line: 72, baseType: !22, size: 32, offset: 384)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_level", scope: !73, file: !7, line: 74, baseType: !22, size: 32, offset: 416)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flag", scope: !73, file: !7, line: 75, baseType: !22, size: 32, offset: 448)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_axis", scope: !73, file: !7, line: 76, baseType: !78, size: 96, offset: 480)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !67, file: !7, line: 81, baseType: !72, size: 64, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !67, file: !7, line: 82, baseType: !22, size: 32, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !67, file: !7, line: 84, baseType: !36, size: 32, offset: 288)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_level", scope: !67, file: !7, line: 86, baseType: !22, size: 32, offset: 320)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_group", scope: !67, file: !7, line: 87, baseType: !22, size: 32, offset: 352)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flag", scope: !67, file: !7, line: 88, baseType: !22, size: 32, offset: 384)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "free_node", scope: !50, file: !7, line: 59, baseType: !96, size: 64, offset: 384)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "FreeNode", file: !7, line: 41, baseType: !97)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DISubroutineType(types: !99)
!99 = !{null, !72}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symmetry", scope: !50, file: !7, line: 60, baseType: !101, size: 64, offset: 448)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "RadialSymmetry", file: !7, line: 42, baseType: !102)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{null, !72, !105, !22}
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RadialArc", file: !7, line: 126, size: 192, elements: !107)
!107 = !{!108, !109}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "arc", scope: !106, file: !7, line: 127, baseType: !66, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !106, file: !7, line: 128, baseType: !78, size: 96, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "axial_symmetry", scope: !50, file: !7, line: 61, baseType: !111, size: 64, offset: 512)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "AxialSymmetry", file: !7, line: 43, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{null, !72, !72, !72, !66, !66}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "BNode", file: !7, line: 77, baseType: !73)
!117 = !DILocalVariable(name: "graph", arg: 1, scope: !45, file: !1, line: 45, type: !48)
!118 = !DILocation(line: 45, column: 27, scope: !45)
!119 = !DILocalVariable(name: "node", arg: 2, scope: !45, file: !1, line: 45, type: !115)
!120 = !DILocation(line: 45, column: 41, scope: !45)
!121 = !DILocation(line: 47, column: 6, scope: !122)
!122 = distinct !DILexicalBlock(scope: !45, file: !1, line: 47, column: 6)
!123 = !DILocation(line: 47, column: 12, scope: !122)
!124 = !DILocation(line: 47, column: 6, scope: !45)
!125 = !DILocation(line: 48, column: 3, scope: !126)
!126 = distinct !DILexicalBlock(scope: !122, file: !1, line: 47, column: 18)
!127 = !DILocation(line: 48, column: 13, scope: !126)
!128 = !DILocation(line: 48, column: 19, scope: !126)
!129 = !DILocation(line: 49, column: 2, scope: !126)
!130 = !DILocation(line: 51, column: 6, scope: !131)
!131 = distinct !DILexicalBlock(scope: !45, file: !1, line: 51, column: 6)
!132 = !DILocation(line: 51, column: 13, scope: !131)
!133 = !DILocation(line: 51, column: 6, scope: !45)
!134 = !DILocation(line: 52, column: 3, scope: !135)
!135 = distinct !DILexicalBlock(scope: !131, file: !1, line: 51, column: 24)
!136 = !DILocation(line: 52, column: 10, scope: !135)
!137 = !DILocation(line: 52, column: 20, scope: !135)
!138 = !DILocation(line: 53, column: 2, scope: !135)
!139 = !DILocation(line: 54, column: 1, scope: !45)
!140 = distinct !DISubprogram(name: "BLI_removeNode", scope: !1, file: !1, line: 56, type: !46, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!141 = !DILocalVariable(name: "graph", arg: 1, scope: !140, file: !1, line: 56, type: !48)
!142 = !DILocation(line: 56, column: 29, scope: !140)
!143 = !DILocalVariable(name: "node", arg: 2, scope: !140, file: !1, line: 56, type: !115)
!144 = !DILocation(line: 56, column: 43, scope: !140)
!145 = !DILocation(line: 58, column: 15, scope: !140)
!146 = !DILocation(line: 58, column: 22, scope: !140)
!147 = !DILocation(line: 58, column: 2, scope: !140)
!148 = !DILocation(line: 59, column: 17, scope: !140)
!149 = !DILocation(line: 59, column: 24, scope: !140)
!150 = !DILocation(line: 59, column: 31, scope: !140)
!151 = !DILocation(line: 59, column: 2, scope: !140)
!152 = !DILocation(line: 60, column: 1, scope: !140)
!153 = distinct !DISubprogram(name: "BLI_otherNode", scope: !1, file: !1, line: 62, type: !154, scopeLine: 63, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!154 = !DISubroutineType(types: !155)
!155 = !{!115, !156, !115}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "BArc", file: !7, line: 89, baseType: !67)
!158 = !DILocalVariable(name: "arc", arg: 1, scope: !153, file: !1, line: 62, type: !156)
!159 = !DILocation(line: 62, column: 28, scope: !153)
!160 = !DILocalVariable(name: "node", arg: 2, scope: !153, file: !1, line: 62, type: !115)
!161 = !DILocation(line: 62, column: 40, scope: !153)
!162 = !DILocation(line: 64, column: 10, scope: !153)
!163 = !DILocation(line: 64, column: 15, scope: !153)
!164 = !DILocation(line: 64, column: 23, scope: !153)
!165 = !DILocation(line: 64, column: 20, scope: !153)
!166 = !DILocation(line: 64, column: 9, scope: !153)
!167 = !DILocation(line: 64, column: 31, scope: !153)
!168 = !DILocation(line: 64, column: 36, scope: !153)
!169 = !DILocation(line: 64, column: 43, scope: !153)
