; ModuleID = 'blender/source/blender/modifiers/intern/MOD_screw.c'
source_filename = "blender/source/blender/modifiers/intern/MOD_screw.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!64 = !DIEnumerator(name: "MOD_SCREW_NORMAL_CALC", value: 2, isUnsigned: true)
!65 = !DIEnumerator(name: "MOD_SCREW_OBJECT_OFFSET", value: 4, isUnsigned: true)
!66 = !DIEnumerator(name: "MOD_SCREW_SMOOTH_SHADING", value: 32, isUnsigned: true)
!67 = !DIEnumerator(name: "MOD_SCREW_UV_STRETCH_U", value: 64, isUnsigned: true)
!68 = !DIEnumerator(name: "MOD_SCREW_UV_STRETCH_V", value: 128, isUnsigned: true)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !70, line: 76, baseType: !7, size: 32, elements: !71)
!70 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!71 = !{!72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112}
!72 = !DIEnumerator(name: "CD_MVERT", value: 0, isUnsigned: true)
!73 = !DIEnumerator(name: "CD_MSTICKY", value: 1, isUnsigned: true)
!74 = !DIEnumerator(name: "CD_MDEFORMVERT", value: 2, isUnsigned: true)
!75 = !DIEnumerator(name: "CD_MEDGE", value: 3, isUnsigned: true)
!76 = !DIEnumerator(name: "CD_MFACE", value: 4, isUnsigned: true)
!77 = !DIEnumerator(name: "CD_MTFACE", value: 5, isUnsigned: true)
!78 = !DIEnumerator(name: "CD_MCOL", value: 6, isUnsigned: true)
!79 = !DIEnumerator(name: "CD_ORIGINDEX", value: 7, isUnsigned: true)
!80 = !DIEnumerator(name: "CD_NORMAL", value: 8, isUnsigned: true)
!81 = !DIEnumerator(name: "CD_PROP_FLT", value: 10, isUnsigned: true)
!82 = !DIEnumerator(name: "CD_PROP_INT", value: 11, isUnsigned: true)
!83 = !DIEnumerator(name: "CD_PROP_STR", value: 12, isUnsigned: true)
!84 = !DIEnumerator(name: "CD_ORIGSPACE", value: 13, isUnsigned: true)
!85 = !DIEnumerator(name: "CD_ORCO", value: 14, isUnsigned: true)
!86 = !DIEnumerator(name: "CD_MTEXPOLY", value: 15, isUnsigned: true)
!87 = !DIEnumerator(name: "CD_MLOOPUV", value: 16, isUnsigned: true)
!88 = !DIEnumerator(name: "CD_MLOOPCOL", value: 17, isUnsigned: true)
!89 = !DIEnumerator(name: "CD_TANGENT", value: 18, isUnsigned: true)
!90 = !DIEnumerator(name: "CD_MDISPS", value: 19, isUnsigned: true)
!91 = !DIEnumerator(name: "CD_PREVIEW_MCOL", value: 20, isUnsigned: true)
!92 = !DIEnumerator(name: "CD_ID_MCOL", value: 21, isUnsigned: true)
!93 = !DIEnumerator(name: "CD_TEXTURE_MCOL", value: 22, isUnsigned: true)
!94 = !DIEnumerator(name: "CD_CLOTH_ORCO", value: 23, isUnsigned: true)
!95 = !DIEnumerator(name: "CD_RECAST", value: 24, isUnsigned: true)
!96 = !DIEnumerator(name: "CD_MPOLY", value: 25, isUnsigned: true)
!97 = !DIEnumerator(name: "CD_MLOOP", value: 26, isUnsigned: true)
!98 = !DIEnumerator(name: "CD_SHAPE_KEYINDEX", value: 27, isUnsigned: true)
!99 = !DIEnumerator(name: "CD_SHAPEKEY", value: 28, isUnsigned: true)
!100 = !DIEnumerator(name: "CD_BWEIGHT", value: 29, isUnsigned: true)
!101 = !DIEnumerator(name: "CD_CREASE", value: 30, isUnsigned: true)
!102 = !DIEnumerator(name: "CD_ORIGSPACE_MLOOP", value: 31, isUnsigned: true)
!103 = !DIEnumerator(name: "CD_PREVIEW_MLOOPCOL", value: 32, isUnsigned: true)
!104 = !DIEnumerator(name: "CD_BM_ELEM_PYPTR", value: 33, isUnsigned: true)
!105 = !DIEnumerator(name: "CD_PAINT_MASK", value: 34, isUnsigned: true)
!106 = !DIEnumerator(name: "CD_GRID_PAINT_MASK", value: 35, isUnsigned: true)
!107 = !DIEnumerator(name: "CD_MVERT_SKIN", value: 36, isUnsigned: true)
!108 = !DIEnumerator(name: "CD_FREESTYLE_EDGE", value: 37, isUnsigned: true)
!109 = !DIEnumerator(name: "CD_FREESTYLE_FACE", value: 38, isUnsigned: true)
!110 = !DIEnumerator(name: "CD_MLOOPTANGENT", value: 39, isUnsigned: true)
!111 = !DIEnumerator(name: "CD_TESSLOOPNORMAL", value: 40, isUnsigned: true)
!112 = !DIEnumerator(name: "CD_NUMTYPES", value: 41, isUnsigned: true)
!113 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !114, line: 341, baseType: !7, size: 32, elements: !115)
!114 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!115 = !{!116, !117}
!116 = !DIEnumerator(name: "ME_SMOOTH", value: 1, isUnsigned: true)
!117 = !DIEnumerator(name: "ME_FACE_SEL", value: 2, isUnsigned: true)
!118 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !114, line: 313, baseType: !7, size: 32, elements: !119)
!119 = !{!120, !121, !122, !123, !124, !125}
!120 = !DIEnumerator(name: "ME_EDGEDRAW", value: 2, isUnsigned: true)
!121 = !DIEnumerator(name: "ME_SEAM", value: 4, isUnsigned: true)
!122 = !DIEnumerator(name: "ME_EDGERENDER", value: 32, isUnsigned: true)
!123 = !DIEnumerator(name: "ME_LOOSEEDGE", value: 128, isUnsigned: true)
!124 = !DIEnumerator(name: "ME_EDGE_TMP_TAG", value: 256, isUnsigned: true)
!125 = !DIEnumerator(name: "ME_SHARP", value: 512, isUnsigned: true)
!126 = !{!127, !7, !145, !253, !139, !165, !193}
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScrewModifierData", file: !61, line: 862, baseType: !129)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScrewModifierData", file: !61, line: 850, size: 1152, elements: !130)
!130 = !{!131, !154, !993, !994, !995, !996, !997, !998, !999, !1000}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !129, file: !61, line: 851, baseType: !132, size: 896)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierData", file: !61, line: 110, baseType: !133)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierData", file: !61, line: 99, size: 896, elements: !134)
!134 = !{!135, !137, !138, !140, !141, !142, !143, !148, !152}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !133, file: !61, line: 100, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !133, file: !61, line: 100, baseType: !136, size: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !133, file: !61, line: 102, baseType: !139, size: 32, offset: 128)
!139 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !133, file: !61, line: 102, baseType: !139, size: 32, offset: 160)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "stackindex", scope: !133, file: !61, line: 103, baseType: !139, size: 32, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !133, file: !61, line: 103, baseType: !139, size: 32, offset: 224)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !133, file: !61, line: 104, baseType: !144, size: 512, offset: 256)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 512, elements: !146)
!145 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!146 = !{!147}
!147 = !DISubrange(count: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !133, file: !61, line: 107, baseType: !149, size: 64, offset: 768)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !151, line: 40, flags: DIFlagFwdDecl)
!151 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!152 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !133, file: !61, line: 109, baseType: !153, size: 64, offset: 832)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "ob_axis", scope: !129, file: !61, line: 853, baseType: !155, size: 64, offset: 896)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !157, line: 115, size: 11392, elements: !158)
!157 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!158 = !{!159, !226, !230, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !247, !259, !273, !274, !317, !318, !321, !322, !338, !339, !340, !341, !342, !343, !344, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !363, !364, !365, !366, !367, !368, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !428, !429, !430, !431, !432, !433, !434, !435, !436, !439, !442, !445, !446, !447, !448, !449, !452, !455, !940, !941, !947, !948, !949, !950, !951, !952, !954, !957, !960, !962, !981, !982}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !156, file: !157, line: 116, baseType: !160, size: 960)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !161, line: 130, baseType: !162)
!161 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !161, line: 117, size: 960, elements: !163)
!163 = !{!164, !166, !167, !169, !188, !192, !194, !195, !196, !197}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !162, file: !161, line: 118, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !162, file: !161, line: 118, baseType: !165, size: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !162, file: !161, line: 119, baseType: !168, size: 64, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !162, file: !161, line: 120, baseType: !170, size: 64, offset: 192)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !161, line: 136, size: 17600, elements: !172)
!172 = !{!173, !174, !176, !179, !183, !184, !185}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !171, file: !161, line: 137, baseType: !160, size: 960)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !171, file: !161, line: 138, baseType: !175, size: 64, offset: 960)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !171, file: !161, line: 139, baseType: !177, size: 64, offset: 1024)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !161, line: 43, flags: DIFlagFwdDecl)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !171, file: !161, line: 140, baseType: !180, size: 8192, offset: 1088)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 8192, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 1024)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !171, file: !161, line: 141, baseType: !180, size: 8192, offset: 9280)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !171, file: !161, line: 148, baseType: !170, size: 64, offset: 17472)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !171, file: !161, line: 150, baseType: !186, size: 64, offset: 17536)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !161, line: 45, flags: DIFlagFwdDecl)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !162, file: !161, line: 121, baseType: !189, size: 528, offset: 256)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 528, elements: !190)
!190 = !{!191}
!191 = !DISubrange(count: 66)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !162, file: !161, line: 126, baseType: !193, size: 16, offset: 784)
!193 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !162, file: !161, line: 127, baseType: !139, size: 32, offset: 800)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !162, file: !161, line: 128, baseType: !139, size: 32, offset: 832)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !162, file: !161, line: 128, baseType: !139, size: 32, offset: 864)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !162, file: !161, line: 129, baseType: !198, size: 64, offset: 896)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !161, line: 75, baseType: !200)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !161, line: 62, size: 1024, elements: !201)
!201 = !{!202, !204, !205, !206, !207, !208, !209, !210, !224, !225}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !200, file: !161, line: 63, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !200, file: !161, line: 63, baseType: !203, size: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !200, file: !161, line: 64, baseType: !145, size: 8, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !200, file: !161, line: 64, baseType: !145, size: 8, offset: 136)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !200, file: !161, line: 65, baseType: !193, size: 16, offset: 144)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !200, file: !161, line: 66, baseType: !144, size: 512, offset: 160)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !200, file: !161, line: 67, baseType: !139, size: 32, offset: 672)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !200, file: !161, line: 69, baseType: !211, size: 256, offset: 704)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !161, line: 60, baseType: !212)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !161, line: 48, size: 256, elements: !213)
!213 = !{!214, !215, !222, !223}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !212, file: !161, line: 49, baseType: !165, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !212, file: !161, line: 58, baseType: !216, size: 128, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !217, line: 71, baseType: !218)
!217 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !217, line: 69, size: 128, elements: !219)
!219 = !{!220, !221}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !218, file: !217, line: 70, baseType: !165, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !218, file: !217, line: 70, baseType: !165, size: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !212, file: !161, line: 59, baseType: !139, size: 32, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !212, file: !161, line: 59, baseType: !139, size: 32, offset: 224)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !200, file: !161, line: 70, baseType: !139, size: 32, offset: 960)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !200, file: !161, line: 74, baseType: !139, size: 32, offset: 992)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !156, file: !157, line: 117, baseType: !227, size: 64, offset: 960)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !229, line: 45, flags: DIFlagFwdDecl)
!229 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!230 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !156, file: !157, line: 119, baseType: !231, size: 64, offset: 1024)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !157, line: 57, flags: DIFlagFwdDecl)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !156, file: !157, line: 121, baseType: !193, size: 16, offset: 1088)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !156, file: !157, line: 121, baseType: !193, size: 16, offset: 1104)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !156, file: !157, line: 122, baseType: !139, size: 32, offset: 1120)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !156, file: !157, line: 122, baseType: !139, size: 32, offset: 1152)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !156, file: !157, line: 122, baseType: !139, size: 32, offset: 1184)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !156, file: !157, line: 123, baseType: !144, size: 512, offset: 1216)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !156, file: !157, line: 124, baseType: !155, size: 64, offset: 1728)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !156, file: !157, line: 124, baseType: !155, size: 64, offset: 1792)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !156, file: !157, line: 127, baseType: !155, size: 64, offset: 1856)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !156, file: !157, line: 127, baseType: !155, size: 64, offset: 1920)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !156, file: !157, line: 127, baseType: !155, size: 64, offset: 1984)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !156, file: !157, line: 128, baseType: !245, size: 64, offset: 2048)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !229, line: 46, flags: DIFlagFwdDecl)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !156, file: !157, line: 130, baseType: !248, size: 64, offset: 2112)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !157, line: 97, size: 832, elements: !250)
!250 = !{!251, !257, !258}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !249, file: !157, line: 98, baseType: !252, size: 768)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 768, elements: !254)
!253 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!254 = !{!255, !256}
!255 = !DISubrange(count: 8)
!256 = !DISubrange(count: 3)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !249, file: !157, line: 99, baseType: !139, size: 32, offset: 768)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !249, file: !157, line: 99, baseType: !139, size: 32, offset: 800)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !156, file: !157, line: 131, baseType: !260, size: 64, offset: 2176)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !262, line: 486, size: 1600, elements: !263)
!262 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!263 = !{!264, !265, !266, !267, !268, !269, !270, !271, !272}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !261, file: !262, line: 487, baseType: !160, size: 960)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !261, file: !262, line: 489, baseType: !216, size: 128, offset: 960)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !261, file: !262, line: 490, baseType: !216, size: 128, offset: 1088)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !261, file: !262, line: 491, baseType: !216, size: 128, offset: 1216)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !261, file: !262, line: 492, baseType: !216, size: 128, offset: 1344)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !261, file: !262, line: 494, baseType: !139, size: 32, offset: 1472)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !261, file: !262, line: 495, baseType: !139, size: 32, offset: 1504)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !261, file: !262, line: 497, baseType: !139, size: 32, offset: 1536)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !261, file: !262, line: 498, baseType: !139, size: 32, offset: 1568)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !156, file: !157, line: 132, baseType: !260, size: 64, offset: 2240)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !156, file: !157, line: 133, baseType: !275, size: 64, offset: 2304)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !262, line: 334, size: 1728, elements: !277)
!277 = !{!278, !279, !282, !283, !284, !285, !286, !287, !290, !291, !292, !293, !294, !295, !296, !316}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !276, file: !262, line: 335, baseType: !216, size: 128)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !276, file: !262, line: 336, baseType: !280, size: 64, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !262, line: 47, flags: DIFlagFwdDecl)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !276, file: !262, line: 338, baseType: !193, size: 16, offset: 192)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !276, file: !262, line: 338, baseType: !193, size: 16, offset: 208)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !276, file: !262, line: 339, baseType: !7, size: 32, offset: 224)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !276, file: !262, line: 340, baseType: !139, size: 32, offset: 256)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !276, file: !262, line: 342, baseType: !253, size: 32, offset: 288)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !276, file: !262, line: 343, baseType: !288, size: 96, offset: 320)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 96, elements: !289)
!289 = !{!256}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !276, file: !262, line: 344, baseType: !288, size: 96, offset: 416)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !276, file: !262, line: 347, baseType: !216, size: 128, offset: 512)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !276, file: !262, line: 349, baseType: !139, size: 32, offset: 640)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !276, file: !262, line: 350, baseType: !139, size: 32, offset: 672)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !276, file: !262, line: 351, baseType: !165, size: 64, offset: 704)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !276, file: !262, line: 352, baseType: !165, size: 64, offset: 768)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !276, file: !262, line: 354, baseType: !297, size: 384, offset: 832)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !262, line: 116, baseType: !298)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !262, line: 94, size: 384, elements: !299)
!299 = !{!300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !298, file: !262, line: 96, baseType: !139, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !298, file: !262, line: 96, baseType: !139, size: 32, offset: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !298, file: !262, line: 97, baseType: !139, size: 32, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !298, file: !262, line: 97, baseType: !139, size: 32, offset: 96)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !298, file: !262, line: 99, baseType: !193, size: 16, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !298, file: !262, line: 100, baseType: !193, size: 16, offset: 144)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !298, file: !262, line: 102, baseType: !193, size: 16, offset: 160)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !298, file: !262, line: 105, baseType: !193, size: 16, offset: 176)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !298, file: !262, line: 108, baseType: !193, size: 16, offset: 192)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !298, file: !262, line: 109, baseType: !193, size: 16, offset: 208)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !298, file: !262, line: 111, baseType: !193, size: 16, offset: 224)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !298, file: !262, line: 112, baseType: !193, size: 16, offset: 240)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !298, file: !262, line: 114, baseType: !139, size: 32, offset: 256)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !298, file: !262, line: 114, baseType: !139, size: 32, offset: 288)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !298, file: !262, line: 115, baseType: !139, size: 32, offset: 320)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !298, file: !262, line: 115, baseType: !139, size: 32, offset: 352)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !276, file: !262, line: 355, baseType: !144, size: 512, offset: 1216)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !156, file: !157, line: 134, baseType: !165, size: 64, offset: 2368)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !156, file: !157, line: 136, baseType: !319, size: 64, offset: 2432)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !157, line: 58, flags: DIFlagFwdDecl)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !156, file: !157, line: 138, baseType: !297, size: 384, offset: 2496)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !156, file: !157, line: 139, baseType: !323, size: 64, offset: 2880)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !262, line: 80, baseType: !325)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !262, line: 72, size: 192, elements: !326)
!326 = !{!327, !334, !335, !336, !337}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !325, file: !262, line: 73, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !262, line: 59, baseType: !330)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !262, line: 56, size: 128, elements: !331)
!331 = !{!332, !333}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !330, file: !262, line: 57, baseType: !288, size: 96)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !330, file: !262, line: 58, baseType: !139, size: 32, offset: 96)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !325, file: !262, line: 74, baseType: !139, size: 32, offset: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !325, file: !262, line: 76, baseType: !139, size: 32, offset: 96)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !325, file: !262, line: 77, baseType: !139, size: 32, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !325, file: !262, line: 79, baseType: !139, size: 32, offset: 160)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !156, file: !157, line: 141, baseType: !216, size: 128, offset: 2944)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !156, file: !157, line: 142, baseType: !216, size: 128, offset: 3072)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !156, file: !157, line: 143, baseType: !216, size: 128, offset: 3200)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !156, file: !157, line: 144, baseType: !216, size: 128, offset: 3328)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !156, file: !157, line: 146, baseType: !139, size: 32, offset: 3456)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !156, file: !157, line: 147, baseType: !139, size: 32, offset: 3488)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !156, file: !157, line: 150, baseType: !345, size: 64, offset: 3520)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !157, line: 50, flags: DIFlagFwdDecl)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !156, file: !157, line: 151, baseType: !153, size: 64, offset: 3584)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !156, file: !157, line: 152, baseType: !139, size: 32, offset: 3648)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !156, file: !157, line: 153, baseType: !139, size: 32, offset: 3680)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !156, file: !157, line: 156, baseType: !288, size: 96, offset: 3712)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !156, file: !157, line: 156, baseType: !288, size: 96, offset: 3808)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !156, file: !157, line: 156, baseType: !288, size: 96, offset: 3904)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !156, file: !157, line: 157, baseType: !288, size: 96, offset: 4000)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !156, file: !157, line: 158, baseType: !288, size: 96, offset: 4096)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !156, file: !157, line: 159, baseType: !288, size: 96, offset: 4192)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !156, file: !157, line: 160, baseType: !288, size: 96, offset: 4288)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !156, file: !157, line: 160, baseType: !288, size: 96, offset: 4384)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !156, file: !157, line: 161, baseType: !360, size: 128, offset: 4480)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 128, elements: !361)
!361 = !{!362}
!362 = !DISubrange(count: 4)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !156, file: !157, line: 161, baseType: !360, size: 128, offset: 4608)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !156, file: !157, line: 162, baseType: !288, size: 96, offset: 4736)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !156, file: !157, line: 162, baseType: !288, size: 96, offset: 4832)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !156, file: !157, line: 163, baseType: !253, size: 32, offset: 4928)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !156, file: !157, line: 163, baseType: !253, size: 32, offset: 4960)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !156, file: !157, line: 164, baseType: !369, size: 512, offset: 4992)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 512, elements: !370)
!370 = !{!362, !362}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !156, file: !157, line: 165, baseType: !369, size: 512, offset: 5504)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !156, file: !157, line: 166, baseType: !369, size: 512, offset: 6016)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !156, file: !157, line: 167, baseType: !369, size: 512, offset: 6528)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !156, file: !157, line: 176, baseType: !369, size: 512, offset: 7040)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !156, file: !157, line: 178, baseType: !7, size: 32, offset: 7552)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !156, file: !157, line: 180, baseType: !193, size: 16, offset: 7584)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !156, file: !157, line: 181, baseType: !193, size: 16, offset: 7600)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !156, file: !157, line: 183, baseType: !193, size: 16, offset: 7616)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !156, file: !157, line: 183, baseType: !193, size: 16, offset: 7632)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !156, file: !157, line: 184, baseType: !193, size: 16, offset: 7648)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !156, file: !157, line: 184, baseType: !193, size: 16, offset: 7664)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !156, file: !157, line: 185, baseType: !193, size: 16, offset: 7680)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !156, file: !157, line: 186, baseType: !193, size: 16, offset: 7696)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !156, file: !157, line: 187, baseType: !193, size: 16, offset: 7712)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !156, file: !157, line: 188, baseType: !145, size: 8, offset: 7728)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !156, file: !157, line: 189, baseType: !145, size: 8, offset: 7736)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !156, file: !157, line: 192, baseType: !139, size: 32, offset: 7744)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !156, file: !157, line: 192, baseType: !139, size: 32, offset: 7776)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !156, file: !157, line: 192, baseType: !139, size: 32, offset: 7808)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !156, file: !157, line: 192, baseType: !139, size: 32, offset: 7840)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !156, file: !157, line: 194, baseType: !139, size: 32, offset: 7872)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !156, file: !157, line: 202, baseType: !253, size: 32, offset: 7904)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !156, file: !157, line: 202, baseType: !253, size: 32, offset: 7936)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !156, file: !157, line: 202, baseType: !253, size: 32, offset: 7968)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !156, file: !157, line: 211, baseType: !253, size: 32, offset: 8000)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !156, file: !157, line: 212, baseType: !253, size: 32, offset: 8032)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !156, file: !157, line: 213, baseType: !253, size: 32, offset: 8064)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !156, file: !157, line: 214, baseType: !253, size: 32, offset: 8096)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !156, file: !157, line: 215, baseType: !253, size: 32, offset: 8128)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !156, file: !157, line: 216, baseType: !253, size: 32, offset: 8160)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !156, file: !157, line: 219, baseType: !253, size: 32, offset: 8192)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !156, file: !157, line: 220, baseType: !253, size: 32, offset: 8224)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !156, file: !157, line: 221, baseType: !253, size: 32, offset: 8256)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !156, file: !157, line: 224, baseType: !405, size: 16, offset: 8288)
!405 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !156, file: !157, line: 224, baseType: !405, size: 16, offset: 8304)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !156, file: !157, line: 226, baseType: !193, size: 16, offset: 8320)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !156, file: !157, line: 228, baseType: !145, size: 8, offset: 8336)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !156, file: !157, line: 229, baseType: !145, size: 8, offset: 8344)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !156, file: !157, line: 231, baseType: !193, size: 16, offset: 8352)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !156, file: !157, line: 232, baseType: !145, size: 8, offset: 8368)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !156, file: !157, line: 233, baseType: !145, size: 8, offset: 8376)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !156, file: !157, line: 234, baseType: !253, size: 32, offset: 8384)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !156, file: !157, line: 235, baseType: !253, size: 32, offset: 8416)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !156, file: !157, line: 237, baseType: !216, size: 128, offset: 8448)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !156, file: !157, line: 238, baseType: !216, size: 128, offset: 8576)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !156, file: !157, line: 239, baseType: !216, size: 128, offset: 8704)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !156, file: !157, line: 240, baseType: !216, size: 128, offset: 8832)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !156, file: !157, line: 242, baseType: !253, size: 32, offset: 8960)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !156, file: !157, line: 244, baseType: !193, size: 16, offset: 8992)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !156, file: !157, line: 245, baseType: !405, size: 16, offset: 9008)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !156, file: !157, line: 246, baseType: !360, size: 128, offset: 9024)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !156, file: !157, line: 248, baseType: !139, size: 32, offset: 9152)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !156, file: !157, line: 249, baseType: !139, size: 32, offset: 9184)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !156, file: !157, line: 251, baseType: !426, size: 64, offset: 9216)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !157, line: 251, flags: DIFlagFwdDecl)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !156, file: !157, line: 253, baseType: !145, size: 8, offset: 9280)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !156, file: !157, line: 254, baseType: !145, size: 8, offset: 9288)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !156, file: !157, line: 255, baseType: !193, size: 16, offset: 9296)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !156, file: !157, line: 256, baseType: !288, size: 96, offset: 9312)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !156, file: !157, line: 258, baseType: !216, size: 128, offset: 9408)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !156, file: !157, line: 259, baseType: !216, size: 128, offset: 9536)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !156, file: !157, line: 260, baseType: !216, size: 128, offset: 9664)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !156, file: !157, line: 261, baseType: !216, size: 128, offset: 9792)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !156, file: !157, line: 263, baseType: !437, size: 64, offset: 9920)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !157, line: 52, flags: DIFlagFwdDecl)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !156, file: !157, line: 264, baseType: !440, size: 64, offset: 9984)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !157, line: 53, flags: DIFlagFwdDecl)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !156, file: !157, line: 265, baseType: !443, size: 64, offset: 10048)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !262, line: 46, flags: DIFlagFwdDecl)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !156, file: !157, line: 267, baseType: !145, size: 8, offset: 10112)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !156, file: !157, line: 268, baseType: !145, size: 8, offset: 10120)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !156, file: !157, line: 269, baseType: !193, size: 16, offset: 10128)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !156, file: !157, line: 270, baseType: !253, size: 32, offset: 10144)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !156, file: !157, line: 272, baseType: !450, size: 64, offset: 10176)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !157, line: 54, flags: DIFlagFwdDecl)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !156, file: !157, line: 275, baseType: !453, size: 64, offset: 10240)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !157, line: 275, flags: DIFlagFwdDecl)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !156, file: !157, line: 277, baseType: !456, size: 64, offset: 10304)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !28, line: 178, size: 13504, elements: !458)
!458 = !{!459, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !510, !513, !515, !516, !518, !519, !520, !521, !527, !532, !533, !537, !538, !539, !540, !541, !553, !565, !579, !583, !587, !591, !600, !612, !616, !620, !624, !628, !632, !633, !634, !635, !636, !637, !641, !642, !643, !644, !648, !649, !650, !651, !652, !657, !658, !659, !660, !661, !665, !666, !667, !668, !669, !676, !687, !692, !698, !708, !714, !725, !732, !739, !743, !748, !752, !757, !758, !759, !766, !772, !773, !774, !779, !780, !789, !897, !901, !909, !913, !917, !921, !929, !939}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !457, file: !28, line: 180, baseType: !460, size: 1600)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !70, line: 73, baseType: !461)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !70, line: 64, size: 1600, elements: !462)
!462 = !{!463, !478, !482, !483, !484, !485, !488}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !461, file: !70, line: 65, baseType: !464, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !70, line: 53, baseType: !466)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !70, line: 42, size: 832, elements: !467)
!467 = !{!468, !469, !470, !471, !472, !473, !474, !475, !476, !477}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !466, file: !70, line: 43, baseType: !139, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !466, file: !70, line: 44, baseType: !139, size: 32, offset: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !466, file: !70, line: 45, baseType: !139, size: 32, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !466, file: !70, line: 46, baseType: !139, size: 32, offset: 96)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !466, file: !70, line: 47, baseType: !139, size: 32, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !466, file: !70, line: 48, baseType: !139, size: 32, offset: 160)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !466, file: !70, line: 49, baseType: !139, size: 32, offset: 192)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !466, file: !70, line: 50, baseType: !139, size: 32, offset: 224)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !466, file: !70, line: 51, baseType: !144, size: 512, offset: 256)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !466, file: !70, line: 52, baseType: !165, size: 64, offset: 768)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !461, file: !70, line: 66, baseType: !479, size: 1312, offset: 64)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 1312, elements: !480)
!480 = !{!481}
!481 = !DISubrange(count: 41)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !461, file: !70, line: 69, baseType: !139, size: 32, offset: 1376)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !461, file: !70, line: 69, baseType: !139, size: 32, offset: 1408)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !461, file: !70, line: 70, baseType: !139, size: 32, offset: 1440)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !461, file: !70, line: 71, baseType: !486, size: 64, offset: 1472)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !70, line: 71, flags: DIFlagFwdDecl)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !461, file: !70, line: 72, baseType: !489, size: 64, offset: 1536)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !70, line: 59, baseType: !491)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !70, line: 57, size: 8192, elements: !492)
!492 = !{!493}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !491, file: !70, line: 58, baseType: !180, size: 8192)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !457, file: !28, line: 180, baseType: !460, size: 1600, offset: 1600)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !457, file: !28, line: 180, baseType: !460, size: 1600, offset: 3200)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !457, file: !28, line: 180, baseType: !460, size: 1600, offset: 4800)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !457, file: !28, line: 180, baseType: !460, size: 1600, offset: 6400)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !457, file: !28, line: 181, baseType: !139, size: 32, offset: 8000)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !457, file: !28, line: 181, baseType: !139, size: 32, offset: 8032)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !457, file: !28, line: 181, baseType: !139, size: 32, offset: 8064)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !457, file: !28, line: 181, baseType: !139, size: 32, offset: 8096)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !457, file: !28, line: 181, baseType: !139, size: 32, offset: 8128)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !457, file: !28, line: 182, baseType: !139, size: 32, offset: 8160)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !457, file: !28, line: 183, baseType: !139, size: 32, offset: 8192)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !457, file: !28, line: 184, baseType: !506, size: 64, offset: 8256)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !507, line: 124, baseType: !508)
!507 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !507, line: 124, flags: DIFlagFwdDecl)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !457, file: !28, line: 185, baseType: !511, size: 64, offset: 8320)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !28, line: 97, flags: DIFlagFwdDecl)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !457, file: !28, line: 186, baseType: !514, size: 32, offset: 8384)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !28, line: 132, baseType: !27)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !457, file: !28, line: 187, baseType: !253, size: 32, offset: 8416)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !457, file: !28, line: 188, baseType: !517, size: 32, offset: 8448)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !28, line: 175, baseType: !33)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !457, file: !28, line: 189, baseType: !139, size: 32, offset: 8480)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !457, file: !28, line: 190, baseType: !345, size: 64, offset: 8512)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !457, file: !28, line: 193, baseType: !145, size: 8, offset: 8576)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !457, file: !28, line: 196, baseType: !522, size: 64, offset: 8640)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DISubroutineType(types: !524)
!524 = !{null, !525}
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !28, line: 177, baseType: !457)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !457, file: !28, line: 199, baseType: !528, size: 64, offset: 8704)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DISubroutineType(types: !530)
!530 = !{null, !525, !531}
!531 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !253)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !457, file: !28, line: 202, baseType: !522, size: 64, offset: 8768)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !457, file: !28, line: 207, baseType: !534, size: 64, offset: 8832)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{!139, !525}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !457, file: !28, line: 208, baseType: !534, size: 64, offset: 8896)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !457, file: !28, line: 209, baseType: !534, size: 64, offset: 8960)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !457, file: !28, line: 210, baseType: !534, size: 64, offset: 9024)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !457, file: !28, line: 211, baseType: !534, size: 64, offset: 9088)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !457, file: !28, line: 218, baseType: !542, size: 64, offset: 9152)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DISubroutineType(types: !544)
!544 = !{null, !525, !139, !545}
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !114, line: 65, size: 160, elements: !547)
!547 = !{!548, !549, !551, !552}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !546, file: !114, line: 66, baseType: !288, size: 96)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !546, file: !114, line: 67, baseType: !550, size: 48, offset: 96)
!550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 48, elements: !289)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !546, file: !114, line: 68, baseType: !145, size: 8, offset: 144)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !546, file: !114, line: 68, baseType: !145, size: 8, offset: 152)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !457, file: !28, line: 219, baseType: !554, size: 64, offset: 9216)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DISubroutineType(types: !556)
!556 = !{null, !525, !139, !557}
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !114, line: 48, size: 96, elements: !559)
!559 = !{!560, !561, !562, !563, !564}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !558, file: !114, line: 49, baseType: !7, size: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !558, file: !114, line: 49, baseType: !7, size: 32, offset: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !558, file: !114, line: 50, baseType: !145, size: 8, offset: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !558, file: !114, line: 50, baseType: !145, size: 8, offset: 72)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !558, file: !114, line: 51, baseType: !193, size: 16, offset: 80)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !457, file: !28, line: 220, baseType: !566, size: 64, offset: 9280)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{null, !525, !139, !569}
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !114, line: 42, size: 160, elements: !571)
!571 = !{!572, !573, !574, !575, !576, !577, !578}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !570, file: !114, line: 43, baseType: !7, size: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !570, file: !114, line: 43, baseType: !7, size: 32, offset: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !570, file: !114, line: 43, baseType: !7, size: 32, offset: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !570, file: !114, line: 43, baseType: !7, size: 32, offset: 96)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !570, file: !114, line: 44, baseType: !193, size: 16, offset: 128)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !570, file: !114, line: 45, baseType: !145, size: 8, offset: 144)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !570, file: !114, line: 45, baseType: !145, size: 8, offset: 152)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !457, file: !28, line: 227, baseType: !580, size: 64, offset: 9344)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DISubroutineType(types: !582)
!582 = !{!545, !525}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !457, file: !28, line: 228, baseType: !584, size: 64, offset: 9408)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DISubroutineType(types: !586)
!586 = !{!557, !525}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !457, file: !28, line: 229, baseType: !588, size: 64, offset: 9472)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DISubroutineType(types: !590)
!590 = !{!569, !525}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !457, file: !28, line: 230, baseType: !592, size: 64, offset: 9536)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DISubroutineType(types: !594)
!594 = !{!595, !525}
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !114, line: 88, size: 64, elements: !597)
!597 = !{!598, !599}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !596, file: !114, line: 89, baseType: !7, size: 32)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !596, file: !114, line: 90, baseType: !7, size: 32, offset: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !457, file: !28, line: 231, baseType: !601, size: 64, offset: 9600)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{!604, !525}
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !114, line: 79, size: 96, elements: !606)
!606 = !{!607, !608, !609, !610, !611}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !605, file: !114, line: 81, baseType: !139, size: 32)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !605, file: !114, line: 82, baseType: !139, size: 32, offset: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !605, file: !114, line: 83, baseType: !193, size: 16, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !605, file: !114, line: 84, baseType: !145, size: 8, offset: 80)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !605, file: !114, line: 84, baseType: !145, size: 8, offset: 88)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !457, file: !28, line: 236, baseType: !613, size: 64, offset: 9664)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DISubroutineType(types: !615)
!615 = !{null, !525, !545}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !457, file: !28, line: 237, baseType: !617, size: 64, offset: 9728)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DISubroutineType(types: !619)
!619 = !{null, !525, !557}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !457, file: !28, line: 238, baseType: !621, size: 64, offset: 9792)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DISubroutineType(types: !623)
!623 = !{null, !525, !569}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !457, file: !28, line: 239, baseType: !625, size: 64, offset: 9856)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{null, !525, !595}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !457, file: !28, line: 240, baseType: !629, size: 64, offset: 9920)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DISubroutineType(types: !631)
!631 = !{null, !525, !604}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !457, file: !28, line: 245, baseType: !580, size: 64, offset: 9984)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !457, file: !28, line: 246, baseType: !584, size: 64, offset: 10048)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !457, file: !28, line: 247, baseType: !588, size: 64, offset: 10112)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !457, file: !28, line: 248, baseType: !592, size: 64, offset: 10176)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !457, file: !28, line: 249, baseType: !601, size: 64, offset: 10240)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !457, file: !28, line: 255, baseType: !638, size: 64, offset: 10304)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DISubroutineType(types: !640)
!640 = !{!165, !525, !139, !139}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !457, file: !28, line: 256, baseType: !638, size: 64, offset: 10368)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !457, file: !28, line: 257, baseType: !638, size: 64, offset: 10432)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !457, file: !28, line: 258, baseType: !638, size: 64, offset: 10496)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !457, file: !28, line: 264, baseType: !645, size: 64, offset: 10560)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DISubroutineType(types: !647)
!647 = !{!165, !525, !139}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !457, file: !28, line: 265, baseType: !645, size: 64, offset: 10624)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !457, file: !28, line: 266, baseType: !645, size: 64, offset: 10688)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !457, file: !28, line: 267, baseType: !645, size: 64, offset: 10752)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !457, file: !28, line: 268, baseType: !645, size: 64, offset: 10816)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataLayout", scope: !457, file: !28, line: 272, baseType: !653, size: 64, offset: 10880)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DISubroutineType(types: !655)
!655 = !{!656, !525}
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataLayout", scope: !457, file: !28, line: 273, baseType: !653, size: 64, offset: 10944)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataLayout", scope: !457, file: !28, line: 274, baseType: !653, size: 64, offset: 11008)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataLayout", scope: !457, file: !28, line: 275, baseType: !653, size: 64, offset: 11072)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataLayout", scope: !457, file: !28, line: 276, baseType: !653, size: 64, offset: 11136)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromVertCData", scope: !457, file: !28, line: 279, baseType: !662, size: 64, offset: 11200)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DISubroutineType(types: !664)
!664 = !{null, !525, !139, !656, !139}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromEdgeCData", scope: !457, file: !28, line: 280, baseType: !662, size: 64, offset: 11264)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromFaceCData", scope: !457, file: !28, line: 281, baseType: !662, size: 64, offset: 11328)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "getNumGrids", scope: !457, file: !28, line: 284, baseType: !534, size: 64, offset: 11392)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "getGridSize", scope: !457, file: !28, line: 285, baseType: !534, size: 64, offset: 11456)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "getGridData", scope: !457, file: !28, line: 286, baseType: !670, size: 64, offset: 11520)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{!673, !525}
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !28, line: 82, flags: DIFlagFwdDecl)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "getGridAdjacency", scope: !457, file: !28, line: 287, baseType: !677, size: 64, offset: 11584)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DISubroutineType(types: !679)
!679 = !{!680, !525}
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGridAdjacency", file: !28, line: 120, baseType: !682)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMGridAdjacency", file: !28, line: 117, size: 256, elements: !683)
!683 = !{!684, !686}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !682, file: !28, line: 118, baseType: !685, size: 128)
!685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 128, elements: !361)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !682, file: !28, line: 119, baseType: !685, size: 128, offset: 128)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "getGridOffset", scope: !457, file: !28, line: 288, baseType: !688, size: 64, offset: 11648)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DISubroutineType(types: !690)
!690 = !{!691, !525}
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "getGridKey", scope: !457, file: !28, line: 289, baseType: !693, size: 64, offset: 11712)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DISubroutineType(types: !695)
!695 = !{null, !525, !696}
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGKey", file: !28, line: 83, flags: DIFlagFwdDecl)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "getGridFlagMats", scope: !457, file: !28, line: 290, baseType: !699, size: 64, offset: 11776)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DISubroutineType(types: !701)
!701 = !{!702, !525}
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFlagMat", file: !28, line: 126, baseType: !704)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMFlagMat", file: !28, line: 123, size: 32, elements: !705)
!705 = !{!706, !707}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !704, file: !28, line: 124, baseType: !193, size: 16)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !704, file: !28, line: 125, baseType: !145, size: 8, offset: 16)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "getGridHidden", scope: !457, file: !28, line: 291, baseType: !709, size: 64, offset: 11840)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DISubroutineType(types: !711)
!711 = !{!712, !525}
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedVert", scope: !457, file: !28, line: 299, baseType: !715, size: 64, offset: 11904)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DISubroutineType(types: !717)
!717 = !{null, !525, !718, !165, !724}
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{null, !165, !139, !721, !721, !722}
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !193)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMForeachFlag", file: !28, line: 162, baseType: !38)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedEdge", scope: !457, file: !28, line: 309, baseType: !726, size: 64, offset: 11968)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{null, !525, !729, !165}
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DISubroutineType(types: !731)
!731 = !{null, !165, !139, !721, !721}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedLoop", scope: !457, file: !28, line: 317, baseType: !733, size: 64, offset: 12032)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DISubroutineType(types: !735)
!735 = !{null, !525, !736, !165, !724}
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DISubroutineType(types: !738)
!738 = !{null, !165, !139, !139, !721, !721}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedFaceCenter", scope: !457, file: !28, line: 327, baseType: !740, size: 64, offset: 12096)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DISubroutineType(types: !742)
!742 = !{null, !525, !729, !165, !724}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "getMinMax", scope: !457, file: !28, line: 337, baseType: !744, size: 64, offset: 12160)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{null, !525, !747, !747}
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCo", scope: !457, file: !28, line: 344, baseType: !749, size: 64, offset: 12224)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{null, !525, !139, !747}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCos", scope: !457, file: !28, line: 347, baseType: !753, size: 64, offset: 12288)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{null, !525, !756}
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "getVertNo", scope: !457, file: !28, line: 350, baseType: !749, size: 64, offset: 12352)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyNo", scope: !457, file: !28, line: 351, baseType: !749, size: 64, offset: 12416)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyMap", scope: !457, file: !28, line: 355, baseType: !760, size: 64, offset: 12480)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DISubroutineType(types: !762)
!762 = !{!763, !155, !525}
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !765)
!765 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !28, line: 355, flags: DIFlagFwdDecl)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "getPBVH", scope: !457, file: !28, line: 359, baseType: !767, size: 64, offset: 12544)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DISubroutineType(types: !769)
!769 = !{!770, !155, !525}
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !28, line: 100, flags: DIFlagFwdDecl)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "drawVerts", scope: !457, file: !28, line: 364, baseType: !522, size: 64, offset: 12608)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "drawUVEdges", scope: !457, file: !28, line: 367, baseType: !522, size: 64, offset: 12672)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "drawEdges", scope: !457, file: !28, line: 373, baseType: !775, size: 64, offset: 12736)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DISubroutineType(types: !777)
!777 = !{null, !525, !778, !778}
!778 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "drawLooseEdges", scope: !457, file: !28, line: 376, baseType: !522, size: 64, offset: 12800)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesSolid", scope: !457, file: !28, line: 385, baseType: !781, size: 64, offset: 12864)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DISubroutineType(types: !783)
!783 = !{null, !525, !784, !778, !785}
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetMaterial", file: !28, line: 146, baseType: !786)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DISubroutineType(types: !788)
!788 = !{!139, !139, !165}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesTex", scope: !457, file: !28, line: 391, baseType: !790, size: 64, offset: 12928)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DISubroutineType(types: !792)
!792 = !{null, !525, !793, !892, !165, !896}
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptionsTex", file: !28, line: 150, baseType: !794)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DISubroutineType(types: !796)
!796 = !{!797, !798, !891, !139}
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawOption", file: !28, line: 143, baseType: !42)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !114, line: 160, size: 384, elements: !800)
!800 = !{!801, !805, !886, !887, !888, !889, !890}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !799, file: !114, line: 161, baseType: !802, size: 256)
!802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 256, elements: !803)
!803 = !{!362, !804}
!804 = !DISubrange(count: 2)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !799, file: !114, line: 162, baseType: !806, size: 64, offset: 256)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !151, line: 77, size: 15424, elements: !808)
!808 = !{!809, !810, !811, !814, !817, !820, !823, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !875, !876, !880}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !807, file: !151, line: 78, baseType: !160, size: 960)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !807, file: !151, line: 80, baseType: !180, size: 8192, offset: 960)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !807, file: !151, line: 82, baseType: !812, size: 64, offset: 9152)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !151, line: 43, flags: DIFlagFwdDecl)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !807, file: !151, line: 83, baseType: !815, size: 64, offset: 9216)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !161, line: 46, flags: DIFlagFwdDecl)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !807, file: !151, line: 86, baseType: !818, size: 64, offset: 9280)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !151, line: 41, flags: DIFlagFwdDecl)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !807, file: !151, line: 87, baseType: !821, size: 64, offset: 9344)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !151, line: 44, flags: DIFlagFwdDecl)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !807, file: !151, line: 89, baseType: !824, size: 512, offset: 9408)
!824 = !DICompositeType(tag: DW_TAG_array_type, baseType: !821, size: 512, elements: !825)
!825 = !{!255}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !807, file: !151, line: 90, baseType: !193, size: 16, offset: 9920)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !807, file: !151, line: 90, baseType: !193, size: 16, offset: 9936)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !807, file: !151, line: 92, baseType: !193, size: 16, offset: 9952)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !807, file: !151, line: 92, baseType: !193, size: 16, offset: 9968)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !807, file: !151, line: 93, baseType: !193, size: 16, offset: 9984)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !807, file: !151, line: 93, baseType: !193, size: 16, offset: 10000)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !807, file: !151, line: 94, baseType: !139, size: 32, offset: 10016)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !807, file: !151, line: 97, baseType: !193, size: 16, offset: 10048)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !807, file: !151, line: 97, baseType: !193, size: 16, offset: 10064)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !807, file: !151, line: 98, baseType: !193, size: 16, offset: 10080)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !807, file: !151, line: 98, baseType: !193, size: 16, offset: 10096)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !807, file: !151, line: 99, baseType: !193, size: 16, offset: 10112)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !807, file: !151, line: 99, baseType: !193, size: 16, offset: 10128)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !807, file: !151, line: 100, baseType: !7, size: 32, offset: 10144)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !807, file: !151, line: 101, baseType: !713, size: 64, offset: 10176)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !807, file: !151, line: 103, baseType: !186, size: 64, offset: 10240)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !807, file: !151, line: 104, baseType: !843, size: 64, offset: 10304)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !161, line: 159, size: 448, elements: !845)
!845 = !{!846, !849, !850, !852, !853, !855}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !844, file: !161, line: 161, baseType: !847, size: 64)
!847 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !848)
!848 = !{!804}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !844, file: !161, line: 162, baseType: !847, size: 64, offset: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !844, file: !161, line: 163, baseType: !851, size: 32, offset: 128)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 32, elements: !848)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !844, file: !161, line: 164, baseType: !851, size: 32, offset: 160)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !844, file: !161, line: 165, baseType: !854, size: 128, offset: 192)
!854 = !DICompositeType(tag: DW_TAG_array_type, baseType: !713, size: 128, elements: !848)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !844, file: !161, line: 166, baseType: !856, size: 128, offset: 320)
!856 = !DICompositeType(tag: DW_TAG_array_type, baseType: !815, size: 128, elements: !848)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !807, file: !151, line: 107, baseType: !253, size: 32, offset: 10368)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !807, file: !151, line: 108, baseType: !139, size: 32, offset: 10400)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !807, file: !151, line: 109, baseType: !193, size: 16, offset: 10432)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !807, file: !151, line: 110, baseType: !193, size: 16, offset: 10448)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !807, file: !151, line: 113, baseType: !139, size: 32, offset: 10464)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !807, file: !151, line: 113, baseType: !139, size: 32, offset: 10496)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !807, file: !151, line: 114, baseType: !145, size: 8, offset: 10528)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !807, file: !151, line: 114, baseType: !145, size: 8, offset: 10536)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !807, file: !151, line: 115, baseType: !193, size: 16, offset: 10544)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !807, file: !151, line: 116, baseType: !360, size: 128, offset: 10560)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !807, file: !151, line: 119, baseType: !253, size: 32, offset: 10688)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !807, file: !151, line: 119, baseType: !253, size: 32, offset: 10720)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !807, file: !151, line: 122, baseType: !870, size: 512, offset: 10752)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !871, line: 182, baseType: !872)
!871 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !871, line: 180, size: 512, elements: !873)
!873 = !{!874}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !872, file: !871, line: 181, baseType: !144, size: 512)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !807, file: !151, line: 123, baseType: !145, size: 8, offset: 11264)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !807, file: !151, line: 125, baseType: !877, size: 56, offset: 11272)
!877 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 56, elements: !878)
!878 = !{!879}
!879 = !DISubrange(count: 7)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !807, file: !151, line: 126, baseType: !881, size: 4096, offset: 11328)
!881 = !DICompositeType(tag: DW_TAG_array_type, baseType: !882, size: 4096, elements: !825)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !151, line: 69, baseType: !883)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !151, line: 67, size: 512, elements: !884)
!884 = !{!885}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !883, file: !151, line: 68, baseType: !144, size: 512)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !799, file: !114, line: 163, baseType: !145, size: 8, offset: 320)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !799, file: !114, line: 163, baseType: !145, size: 8, offset: 328)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !799, file: !114, line: 164, baseType: !193, size: 16, offset: 336)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !799, file: !114, line: 164, baseType: !193, size: 16, offset: 352)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !799, file: !114, line: 164, baseType: !193, size: 16, offset: 368)
!891 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !778)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCompareDrawOptions", file: !28, line: 147, baseType: !893)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DISubroutineType(types: !895)
!895 = !{!139, !165, !139, !139}
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawFlag", file: !28, line: 157, baseType: !48)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesGLSL", scope: !457, file: !28, line: 400, baseType: !898, size: 64, offset: 12992)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DISubroutineType(types: !900)
!900 = !{null, !525, !785}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFaces", scope: !457, file: !28, line: 415, baseType: !902, size: 64, offset: 13056)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DISubroutineType(types: !904)
!904 = !{null, !525, !905, !785, !892, !165, !896}
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptions", file: !28, line: 149, baseType: !906)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DISubroutineType(types: !908)
!908 = !{!797, !165, !139}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesTex", scope: !457, file: !28, line: 425, baseType: !910, size: 64, offset: 13120)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DISubroutineType(types: !912)
!912 = !{null, !525, !905, !892, !165, !896}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesGLSL", scope: !457, file: !28, line: 435, baseType: !914, size: 64, offset: 13184)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DISubroutineType(types: !916)
!916 = !{null, !525, !785, !905, !165}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdges", scope: !457, file: !28, line: 444, baseType: !918, size: 64, offset: 13248)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DISubroutineType(types: !920)
!920 = !{null, !525, !905, !165}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdgesInterp", scope: !457, file: !28, line: 455, baseType: !922, size: 64, offset: 13312)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DISubroutineType(types: !924)
!924 = !{null, !525, !905, !925, !165}
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawInterpOptions", file: !28, line: 148, baseType: !926)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DISubroutineType(types: !928)
!928 = !{null, !165, !139, !253}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesMat", scope: !457, file: !28, line: 464, baseType: !930, size: 64, offset: 13376)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DISubroutineType(types: !932)
!932 = !{null, !525, !933, !936, !165}
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DISubroutineType(types: !935)
!935 = !{null, !165, !139, !165}
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DISubroutineType(types: !938)
!938 = !{!778, !165, !139}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !457, file: !28, line: 470, baseType: !522, size: 64, offset: 13440)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !156, file: !157, line: 277, baseType: !456, size: 64, offset: 10368)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !156, file: !157, line: 278, baseType: !942, size: 64, offset: 10432)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !943, line: 27, baseType: !944)
!943 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !945, line: 45, baseType: !946)
!945 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!946 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !156, file: !157, line: 279, baseType: !942, size: 64, offset: 10496)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !156, file: !157, line: 280, baseType: !7, size: 32, offset: 10560)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !156, file: !157, line: 281, baseType: !7, size: 32, offset: 10592)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !156, file: !157, line: 283, baseType: !216, size: 128, offset: 10624)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !156, file: !157, line: 284, baseType: !216, size: 128, offset: 10752)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !156, file: !157, line: 285, baseType: !953, size: 64, offset: 10880)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !156, file: !157, line: 287, baseType: !955, size: 64, offset: 10944)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !157, line: 59, flags: DIFlagFwdDecl)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !156, file: !157, line: 288, baseType: !958, size: 64, offset: 11008)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !157, line: 288, flags: DIFlagFwdDecl)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !156, file: !157, line: 290, baseType: !961, size: 64, offset: 11072)
!961 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 64, elements: !848)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !156, file: !157, line: 291, baseType: !963, size: 64, offset: 11136)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !151, line: 65, baseType: !965)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !151, line: 50, size: 320, elements: !966)
!966 = !{!967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !965, file: !151, line: 51, baseType: !149, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !965, file: !151, line: 53, baseType: !139, size: 32, offset: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !965, file: !151, line: 54, baseType: !139, size: 32, offset: 96)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !965, file: !151, line: 55, baseType: !139, size: 32, offset: 128)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !965, file: !151, line: 55, baseType: !139, size: 32, offset: 160)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !965, file: !151, line: 56, baseType: !145, size: 8, offset: 192)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !965, file: !151, line: 56, baseType: !145, size: 8, offset: 200)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !965, file: !151, line: 57, baseType: !145, size: 8, offset: 208)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !965, file: !151, line: 57, baseType: !145, size: 8, offset: 216)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !965, file: !151, line: 59, baseType: !193, size: 16, offset: 224)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !965, file: !151, line: 59, baseType: !193, size: 16, offset: 240)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !965, file: !151, line: 59, baseType: !193, size: 16, offset: 256)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !965, file: !151, line: 61, baseType: !193, size: 16, offset: 272)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !965, file: !151, line: 63, baseType: !139, size: 32, offset: 288)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !156, file: !157, line: 293, baseType: !216, size: 128, offset: 11200)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !156, file: !157, line: 294, baseType: !983, size: 64, offset: 11328)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !157, line: 113, baseType: !985)
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !157, line: 108, size: 256, elements: !986)
!986 = !{!987, !989, !990, !991, !992}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !985, file: !157, line: 109, baseType: !988, size: 64)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !985, file: !157, line: 109, baseType: !988, size: 64, offset: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !985, file: !157, line: 110, baseType: !155, size: 64, offset: 128)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !985, file: !157, line: 111, baseType: !139, size: 32, offset: 192)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !985, file: !157, line: 112, baseType: !253, size: 32, offset: 224)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "steps", scope: !129, file: !61, line: 854, baseType: !7, size: 32, offset: 960)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "render_steps", scope: !129, file: !61, line: 855, baseType: !7, size: 32, offset: 992)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !129, file: !61, line: 856, baseType: !7, size: 32, offset: 1024)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "screw_ofs", scope: !129, file: !61, line: 857, baseType: !253, size: 32, offset: 1056)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "angle", scope: !129, file: !61, line: 858, baseType: !253, size: 32, offset: 1088)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "axis", scope: !129, file: !61, line: 859, baseType: !145, size: 8, offset: 1120)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !129, file: !61, line: 860, baseType: !145, size: 8, offset: 1128)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !129, file: !61, line: 861, baseType: !193, size: 16, offset: 1136)
!1001 = !{!0}
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierTypeInfo", file: !6, line: 309, baseType: !1003)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierTypeInfo", file: !6, line: 121, size: 1728, elements: !1004)
!1004 = !{!1005, !1009, !1010, !1011, !1013, !1015, !1019, !1024, !1031, !1037, !1041, !1045, !1049, !1053, !1059, !1060, !1064, !1116, !1120, !1121, !1130, !1139}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1003, file: !6, line: 123, baseType: !1006, size: 256)
!1006 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 256, elements: !1007)
!1007 = !{!1008}
!1008 = !DISubrange(count: 32)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "structName", scope: !1003, file: !6, line: 128, baseType: !1006, size: 256, offset: 256)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "structSize", scope: !1003, file: !6, line: 131, baseType: !139, size: 32, offset: 512)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1003, file: !6, line: 133, baseType: !1012, size: 32, offset: 544)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierTypeType", file: !6, line: 71, baseType: !5)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1003, file: !6, line: 134, baseType: !1014, size: 32, offset: 576)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierTypeFlag", file: !6, line: 104, baseType: !15)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "copyData", scope: !1003, file: !6, line: 142, baseType: !1016, size: 64, offset: 640)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{null, !136, !136}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "deformVerts", scope: !1003, file: !6, line: 151, baseType: !1020, size: 64, offset: 704)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{null, !136, !155, !456, !756, !139, !1023}
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierApplyFlag", file: !6, line: 118, baseType: !54)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "deformMatrices", scope: !1003, file: !6, line: 157, baseType: !1025, size: 64, offset: 768)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = !DISubroutineType(types: !1027)
