; ModuleID = 'blender/source/blender/editors/armature/armature_ops.c'
source_filename = "blender/source/blender/editors/armature/armature_ops.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.wmOperatorType = type { i8*, i8*, i8*, i8*, i32 (%struct.bContext*, %struct.wmOperator*)*, i8 (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, void (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, i32 (%struct.bContext*)*, void (%struct.bContext*, %struct.wmOperator*)*, %struct.StructRNA*, %struct.IDProperty*, %struct.PropertyRNA*, %struct.ListBase, %struct.wmKeyMap*, i8*, i32 (%struct.bContext*, %struct.wmOperatorType*)*, %struct.ExtensionRNA, i16 }
%struct.bContext = type opaque
%struct.wmOperator = type { %struct.wmOperator*, %struct.wmOperator*, [64 x i8], %struct.IDProperty*, %struct.wmOperatorType*, i8*, i8*, %struct.PointerRNA*, %struct.ReportList*, %struct.ListBase, %struct.wmOperator*, %struct.uiLayout*, i16, [3 x i16] }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }
%struct.ReportList = type { %struct.ListBase, i32, i32, i32, i32, %struct.wmTimer* }
%struct.wmTimer = type { %struct.wmTimer*, %struct.wmTimer*, %struct.wmWindow*, double, i32, i8*, double, double, double, double, double, i32 }

!245 = distinct !DISubprogram(name: "ED_operatortypes_armature", scope: !1, file: !1, line: 47, type: !246, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !248)
!246 = !DISubroutineType(types: !247)
!247 = !{null}
!248 = !{}
!249 = !DILocation(line: 50, column: 2, scope: !245)
!250 = !DILocation(line: 52, column: 2, scope: !245)
!251 = !DILocation(line: 53, column: 2, scope: !245)
!252 = !DILocation(line: 54, column: 2, scope: !245)
!253 = !DILocation(line: 55, column: 2, scope: !245)
!254 = !DILocation(line: 57, column: 2, scope: !245)
!255 = !DILocation(line: 58, column: 2, scope: !245)
!256 = !DILocation(line: 60, column: 2, scope: !245)
!257 = !DILocation(line: 61, column: 2, scope: !245)
!258 = !DILocation(line: 62, column: 2, scope: !245)
!259 = !DILocation(line: 63, column: 2, scope: !245)
!260 = !DILocation(line: 64, column: 2, scope: !245)
!261 = !DILocation(line: 65, column: 2, scope: !245)
!262 = !DILocation(line: 66, column: 2, scope: !245)
!263 = !DILocation(line: 67, column: 2, scope: !245)
!264 = !DILocation(line: 69, column: 2, scope: !245)
!265 = !DILocation(line: 70, column: 2, scope: !245)
!266 = !DILocation(line: 71, column: 2, scope: !245)
!267 = !DILocation(line: 72, column: 2, scope: !245)
!268 = !DILocation(line: 73, column: 2, scope: !245)
!269 = !DILocation(line: 74, column: 2, scope: !245)
!270 = !DILocation(line: 75, column: 2, scope: !245)
!271 = !DILocation(line: 76, column: 2, scope: !245)
!272 = !DILocation(line: 77, column: 2, scope: !245)
!273 = !DILocation(line: 78, column: 2, scope: !245)
!274 = !DILocation(line: 80, column: 2, scope: !245)
!275 = !DILocation(line: 81, column: 2, scope: !245)
!276 = !DILocation(line: 83, column: 2, scope: !245)
!277 = !DILocation(line: 84, column: 2, scope: !245)
!278 = !DILocation(line: 85, column: 2, scope: !245)
!279 = !DILocation(line: 88, column: 2, scope: !245)
!280 = !DILocation(line: 89, column: 2, scope: !245)
!281 = !DILocation(line: 90, column: 2, scope: !245)
!282 = !DILocation(line: 91, column: 2, scope: !245)
!283 = !DILocation(line: 92, column: 2, scope: !245)
!284 = !DILocation(line: 93, column: 2, scope: !245)
!285 = !DILocation(line: 94, column: 2, scope: !245)
!286 = !DILocation(line: 95, column: 2, scope: !245)
!287 = !DILocation(line: 98, column: 2, scope: !245)
!288 = !DILocation(line: 99, column: 2, scope: !245)
!289 = !DILocation(line: 101, column: 2, scope: !245)
!290 = !DILocation(line: 102, column: 2, scope: !245)
!291 = !DILocation(line: 104, column: 2, scope: !245)
!292 = !DILocation(line: 105, column: 2, scope: !245)
!293 = !DILocation(line: 106, column: 2, scope: !245)
!294 = !DILocation(line: 107, column: 2, scope: !245)
!295 = !DILocation(line: 108, column: 2, scope: !245)
!296 = !DILocation(line: 110, column: 2, scope: !245)
!297 = !DILocation(line: 111, column: 2, scope: !245)
!298 = !DILocation(line: 113, column: 2, scope: !245)
!299 = !DILocation(line: 115, column: 2, scope: !245)
!300 = !DILocation(line: 116, column: 2, scope: !245)
!301 = !DILocation(line: 117, column: 2, scope: !245)
!302 = !DILocation(line: 118, column: 2, scope: !245)
!303 = !DILocation(line: 119, column: 2, scope: !245)
!304 = !DILocation(line: 120, column: 2, scope: !245)
!305 = !DILocation(line: 122, column: 2, scope: !245)
!306 = !DILocation(line: 123, column: 2, scope: !245)
!307 = !DILocation(line: 124, column: 2, scope: !245)
!308 = !DILocation(line: 125, column: 2, scope: !245)
!309 = !DILocation(line: 126, column: 2, scope: !245)
!310 = !DILocation(line: 127, column: 2, scope: !245)
!311 = !DILocation(line: 128, column: 2, scope: !245)
!312 = !DILocation(line: 129, column: 2, scope: !245)
!313 = !DILocation(line: 131, column: 2, scope: !245)
!314 = !DILocation(line: 132, column: 2, scope: !245)
!315 = !DILocation(line: 133, column: 2, scope: !245)
!316 = !DILocation(line: 135, column: 2, scope: !245)
!317 = !DILocation(line: 136, column: 2, scope: !245)
!318 = !DILocation(line: 138, column: 2, scope: !245)
!319 = !DILocation(line: 140, column: 2, scope: !245)
!320 = !DILocation(line: 142, column: 2, scope: !245)
!321 = !DILocation(line: 144, column: 2, scope: !245)
!322 = !DILocation(line: 147, column: 2, scope: !245)
!323 = !DILocation(line: 148, column: 2, scope: !245)
!324 = !DILocation(line: 150, column: 2, scope: !245)
!325 = !DILocation(line: 151, column: 2, scope: !245)
!326 = !DILocation(line: 152, column: 2, scope: !245)
!327 = !DILocation(line: 154, column: 2, scope: !245)
!328 = !DILocation(line: 155, column: 2, scope: !245)
!329 = !DILocation(line: 157, column: 2, scope: !245)
!330 = !DILocation(line: 160, column: 2, scope: !245)
!331 = !DILocation(line: 161, column: 2, scope: !245)
!332 = !DILocation(line: 162, column: 2, scope: !245)
!333 = !DILocation(line: 163, column: 1, scope: !245)
!334 = distinct !DISubprogram(name: "ED_operatormacros_armature", scope: !1, file: !1, line: 165, type: !246, scopeLine: 166, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !248)
!335 = !DILocalVariable(name: "ot", scope: !334, file: !1, line: 167, type: !336)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorType", file: !338, line: 568, baseType: !339)
!338 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !338, line: 508, size: 1536, elements: !340)
!340 = !{!341, !345, !346, !347, !348, !1795, !1799, !1805, !1809, !1810, !1814, !1815, !1816, !1817, !1821, !1822, !1837, !1838, !1842, !1868}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !339, file: !338, line: 509, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !344)
!344 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !339, file: !338, line: 510, baseType: !342, size: 64, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !339, file: !338, line: 511, baseType: !342, size: 64, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !339, file: !338, line: 512, baseType: !342, size: 64, offset: 192)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !339, file: !338, line: 518, baseType: !349, size: 64, offset: 256)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DISubroutineType(types: !351)
!351 = !{!207, !352, !355}
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !354, line: 44, flags: DIFlagFwdDecl)
!354 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !357, line: 328, size: 1344, elements: !358)
!357 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!358 = !{!359, !360, !361, !365, !397, !399, !400, !401, !413, !1788, !1789, !1790, !1793, !1794}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !356, file: !357, line: 329, baseType: !355, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !356, file: !357, line: 329, baseType: !355, size: 64, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !356, file: !357, line: 332, baseType: !362, size: 512, offset: 128)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 512, elements: !363)
!363 = !{!364}
!364 = !DISubrange(count: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !356, file: !357, line: 333, baseType: !366, size: 64, offset: 640)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !368, line: 75, baseType: !369)
!368 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !368, line: 62, size: 1024, elements: !370)
!370 = !{!371, !373, !374, !375, !376, !378, !379, !380, !395, !396}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !369, file: !368, line: 63, baseType: !372, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !369, file: !368, line: 63, baseType: !372, size: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !369, file: !368, line: 64, baseType: !344, size: 8, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !369, file: !368, line: 64, baseType: !344, size: 8, offset: 136)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !369, file: !368, line: 65, baseType: !377, size: 16, offset: 144)
!377 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !369, file: !368, line: 66, baseType: !362, size: 512, offset: 160)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !369, file: !368, line: 67, baseType: !207, size: 32, offset: 672)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !369, file: !368, line: 69, baseType: !381, size: 256, offset: 704)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !368, line: 60, baseType: !382)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !368, line: 48, size: 256, elements: !383)
!383 = !{!384, !386, !393, !394}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !382, file: !368, line: 49, baseType: !385, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !382, file: !368, line: 58, baseType: !387, size: 128, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !388, line: 71, baseType: !389)
!388 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !388, line: 69, size: 128, elements: !390)
!390 = !{!391, !392}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !389, file: !388, line: 70, baseType: !385, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !389, file: !388, line: 70, baseType: !385, size: 64, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !382, file: !368, line: 59, baseType: !207, size: 32, offset: 192)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !382, file: !368, line: 59, baseType: !207, size: 32, offset: 224)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !369, file: !368, line: 70, baseType: !207, size: 32, offset: 960)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !369, file: !368, line: 74, baseType: !207, size: 32, offset: 992)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !356, file: !357, line: 336, baseType: !398, size: 64, offset: 704)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !356, file: !357, line: 337, baseType: !385, size: 64, offset: 768)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !356, file: !357, line: 338, baseType: !385, size: 64, offset: 832)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !356, file: !357, line: 340, baseType: !402, size: 64, offset: 896)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !354, line: 55, size: 192, elements: !404)
!404 = !{!405, !409, !412}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !403, file: !354, line: 58, baseType: !406, size: 64)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !403, file: !354, line: 56, size: 64, elements: !407)
!407 = !{!408}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !406, file: !354, line: 57, baseType: !385, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !403, file: !354, line: 60, baseType: !410, size: 64, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !354, line: 41, flags: DIFlagFwdDecl)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !403, file: !354, line: 61, baseType: !385, size: 64, offset: 128)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !356, file: !357, line: 341, baseType: !414, size: 64, offset: 960)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !357, line: 106, size: 320, elements: !416)
!416 = !{!417, !418, !419, !420, !421, !422}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !415, file: !357, line: 107, baseType: !387, size: 128)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !415, file: !357, line: 108, baseType: !207, size: 32, offset: 128)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !415, file: !357, line: 109, baseType: !207, size: 32, offset: 160)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !415, file: !357, line: 110, baseType: !207, size: 32, offset: 192)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !415, file: !357, line: 110, baseType: !207, size: 32, offset: 224)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !415, file: !357, line: 111, baseType: !423, size: 64, offset: 256)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !338, line: 490, size: 768, elements: !425)
!425 = !{!426, !427, !428, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !424, file: !338, line: 491, baseType: !423, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !424, file: !338, line: 491, baseType: !423, size: 64, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !424, file: !338, line: 493, baseType: !429, size: 64, offset: 128)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !357, line: 169, size: 2048, elements: !431)
!431 = !{!432, !433, !434, !435, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1754, !1757, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !430, file: !357, line: 170, baseType: !429, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !430, file: !357, line: 170, baseType: !429, size: 64, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !430, file: !357, line: 172, baseType: !385, size: 64, offset: 128)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !430, file: !357, line: 174, baseType: !436, size: 64, offset: 192)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !438, line: 49, size: 1984, elements: !439)
!438 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!439 = !{!440, !476, !477, !478, !479, !480, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !437, file: !438, line: 50, baseType: !441, size: 960)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !368, line: 130, baseType: !442)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !368, line: 117, size: 960, elements: !443)
!443 = !{!444, !445, !446, !448, !467, !471, !472, !473, !474, !475}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !442, file: !368, line: 118, baseType: !385, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !442, file: !368, line: 118, baseType: !385, size: 64, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !442, file: !368, line: 119, baseType: !447, size: 64, offset: 128)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !442, file: !368, line: 120, baseType: !449, size: 64, offset: 192)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !368, line: 136, size: 17600, elements: !451)
!451 = !{!452, !453, !455, !458, !462, !463, !464}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !450, file: !368, line: 137, baseType: !441, size: 960)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !450, file: !368, line: 138, baseType: !454, size: 64, offset: 960)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !450, file: !368, line: 139, baseType: !456, size: 64, offset: 1024)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !368, line: 43, flags: DIFlagFwdDecl)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !450, file: !368, line: 140, baseType: !459, size: 8192, offset: 1088)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 8192, elements: !460)
!460 = !{!461}
!461 = !DISubrange(count: 1024)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !450, file: !368, line: 141, baseType: !459, size: 8192, offset: 9280)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !450, file: !368, line: 148, baseType: !449, size: 64, offset: 17472)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !450, file: !368, line: 150, baseType: !465, size: 64, offset: 17536)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !368, line: 45, flags: DIFlagFwdDecl)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !442, file: !368, line: 121, baseType: !468, size: 528, offset: 256)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 528, elements: !469)
!469 = !{!470}
!470 = !DISubrange(count: 66)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !442, file: !368, line: 126, baseType: !377, size: 16, offset: 784)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !442, file: !368, line: 127, baseType: !207, size: 32, offset: 800)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !442, file: !368, line: 128, baseType: !207, size: 32, offset: 832)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !442, file: !368, line: 128, baseType: !207, size: 32, offset: 864)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !442, file: !368, line: 129, baseType: !366, size: 64, offset: 896)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !437, file: !438, line: 52, baseType: !387, size: 128, offset: 960)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !437, file: !438, line: 53, baseType: !387, size: 128, offset: 1088)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !437, file: !438, line: 54, baseType: !387, size: 128, offset: 1216)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !437, file: !438, line: 55, baseType: !387, size: 128, offset: 1344)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !437, file: !438, line: 57, baseType: !481, size: 64, offset: 1472)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !483, line: 1216, size: 39680, elements: !484)
!483 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!484 = !{!485, !486, !490, !494, !497, !498, !499, !511, !512, !517, !518, !519, !520, !521, !522, !523, !524, !525, !529, !607, !1042, !1257, !1260, !1549, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1571, !1572, !1573, !1574, !1575, !1583, !1650, !1657, !1658, !1665, !1666, !1672, !1673, !1674, !1675, !1676}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !482, file: !483, line: 1217, baseType: !441, size: 960)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !482, file: !483, line: 1218, baseType: !487, size: 64, offset: 960)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !489, line: 43, flags: DIFlagFwdDecl)
!489 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!490 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !482, file: !483, line: 1220, baseType: !491, size: 64, offset: 1024)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !493, line: 46, flags: DIFlagFwdDecl)
!493 = !DIFile(filename: "blender/source/blender/editors/include/ED_armature.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!494 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !482, file: !483, line: 1221, baseType: !495, size: 64, offset: 1088)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !483, line: 52, flags: DIFlagFwdDecl)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !482, file: !483, line: 1223, baseType: !481, size: 64, offset: 1152)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !482, file: !483, line: 1225, baseType: !387, size: 128, offset: 1216)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !482, file: !483, line: 1226, baseType: !500, size: 64, offset: 1344)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !483, line: 69, size: 320, elements: !502)
!502 = !{!503, !504, !505, !506, !507, !508, !509, !510}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !501, file: !483, line: 70, baseType: !500, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !501, file: !483, line: 70, baseType: !500, size: 64, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !501, file: !483, line: 71, baseType: !5, size: 32, offset: 128)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !501, file: !483, line: 71, baseType: !5, size: 32, offset: 160)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !501, file: !483, line: 72, baseType: !207, size: 32, offset: 192)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !501, file: !483, line: 73, baseType: !377, size: 16, offset: 224)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !501, file: !483, line: 73, baseType: !377, size: 16, offset: 240)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !501, file: !483, line: 74, baseType: !491, size: 64, offset: 256)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !482, file: !483, line: 1227, baseType: !491, size: 64, offset: 1408)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !482, file: !483, line: 1229, baseType: !513, size: 96, offset: 1472)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !514, size: 96, elements: !515)
!514 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!515 = !{!516}
!516 = !DISubrange(count: 3)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !482, file: !483, line: 1230, baseType: !513, size: 96, offset: 1568)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !482, file: !483, line: 1231, baseType: !513, size: 96, offset: 1664)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !482, file: !483, line: 1231, baseType: !513, size: 96, offset: 1760)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !482, file: !483, line: 1233, baseType: !5, size: 32, offset: 1856)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !482, file: !483, line: 1234, baseType: !207, size: 32, offset: 1888)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !482, file: !483, line: 1235, baseType: !5, size: 32, offset: 1920)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !482, file: !483, line: 1237, baseType: !377, size: 16, offset: 1952)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !482, file: !483, line: 1239, baseType: !344, size: 8, offset: 1968)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !482, file: !483, line: 1240, baseType: !526, size: 8, offset: 1976)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 8, elements: !527)
!527 = !{!528}
!528 = !DISubrange(count: 1)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !482, file: !483, line: 1242, baseType: !530, size: 64, offset: 1984)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !532, line: 328, size: 3456, elements: !533)
!532 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!533 = !{!534, !535, !536, !539, !540, !541, !545, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !572, !573, !574, !577, !582, !583, !586, !590, !595, !599, !603, !604, !605, !606}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !531, file: !532, line: 329, baseType: !441, size: 960)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !531, file: !532, line: 330, baseType: !487, size: 64, offset: 960)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !531, file: !532, line: 332, baseType: !537, size: 64, offset: 1024)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !532, line: 332, flags: DIFlagFwdDecl)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !531, file: !532, line: 333, baseType: !362, size: 512, offset: 1088)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !531, file: !532, line: 335, baseType: !410, size: 64, offset: 1600)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !531, file: !532, line: 337, baseType: !542, size: 64, offset: 1664)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !544, line: 45, flags: DIFlagFwdDecl)
!544 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!545 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !531, file: !532, line: 338, baseType: !546, size: 64, offset: 1728)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !514, size: 64, elements: !547)
!547 = !{!548}
!548 = !DISubrange(count: 2)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !531, file: !532, line: 340, baseType: !387, size: 128, offset: 1792)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !531, file: !532, line: 340, baseType: !387, size: 128, offset: 1920)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !531, file: !532, line: 342, baseType: !207, size: 32, offset: 2048)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !531, file: !532, line: 342, baseType: !207, size: 32, offset: 2080)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !531, file: !532, line: 343, baseType: !207, size: 32, offset: 2112)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !531, file: !532, line: 345, baseType: !207, size: 32, offset: 2144)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !531, file: !532, line: 346, baseType: !207, size: 32, offset: 2176)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !531, file: !532, line: 347, baseType: !377, size: 16, offset: 2208)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !531, file: !532, line: 348, baseType: !377, size: 16, offset: 2224)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !531, file: !532, line: 349, baseType: !207, size: 32, offset: 2240)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !531, file: !532, line: 351, baseType: !207, size: 32, offset: 2272)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !531, file: !532, line: 353, baseType: !377, size: 16, offset: 2304)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !531, file: !532, line: 354, baseType: !377, size: 16, offset: 2320)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !531, file: !532, line: 355, baseType: !207, size: 32, offset: 2336)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !531, file: !532, line: 357, baseType: !564, size: 128, offset: 2368)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !565, line: 95, baseType: !566)
!565 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !565, line: 92, size: 128, elements: !567)
!567 = !{!568, !569, !570, !571}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !566, file: !565, line: 93, baseType: !514, size: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !566, file: !565, line: 93, baseType: !514, size: 32, offset: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !566, file: !565, line: 94, baseType: !514, size: 32, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !566, file: !565, line: 94, baseType: !514, size: 32, offset: 96)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !531, file: !532, line: 363, baseType: !387, size: 128, offset: 2496)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !531, file: !532, line: 363, baseType: !387, size: 128, offset: 2624)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !531, file: !532, line: 368, baseType: !575, size: 64, offset: 2752)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !532, line: 48, flags: DIFlagFwdDecl)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !531, file: !532, line: 372, baseType: !578, size: 32, offset: 2816)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !532, line: 274, baseType: !579)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !532, line: 271, size: 32, elements: !580)
!580 = !{!581}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !579, file: !532, line: 273, baseType: !5, size: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !531, file: !532, line: 373, baseType: !207, size: 32, offset: 2848)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !531, file: !532, line: 382, baseType: !584, size: 64, offset: 2880)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !532, line: 46, flags: DIFlagFwdDecl)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !531, file: !532, line: 385, baseType: !587, size: 64, offset: 2944)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DISubroutineType(types: !589)
!589 = !{null, !385, !514}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !531, file: !532, line: 386, baseType: !591, size: 64, offset: 3008)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DISubroutineType(types: !593)
!593 = !{null, !385, !594}
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !531, file: !532, line: 387, baseType: !596, size: 64, offset: 3072)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DISubroutineType(types: !598)
!598 = !{!207, !385}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !531, file: !532, line: 388, baseType: !600, size: 64, offset: 3136)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DISubroutineType(types: !602)
!602 = !{null, !385}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !531, file: !532, line: 389, baseType: !385, size: 64, offset: 3200)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !531, file: !532, line: 389, baseType: !385, size: 64, offset: 3264)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !531, file: !532, line: 389, baseType: !385, size: 64, offset: 3328)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !531, file: !532, line: 389, baseType: !385, size: 64, offset: 3392)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !482, file: !483, line: 1244, baseType: !608, size: 64, offset: 2048)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !610, line: 200, size: 17024, elements: !611)
!610 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!611 = !{!612, !614, !615, !616, !1035, !1036, !1037, !1038, !1039, !1040, !1041}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !609, file: !610, line: 201, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !609, file: !610, line: 202, baseType: !387, size: 128, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !609, file: !610, line: 203, baseType: !387, size: 128, offset: 192)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !609, file: !610, line: 206, baseType: !617, size: 64, offset: 320)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !610, line: 190, baseType: !619)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !610, line: 126, size: 2816, elements: !620)
!620 = !{!621, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !720, !723, !724, !725, !1007, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1034}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !619, file: !610, line: 127, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !619, file: !610, line: 127, baseType: !622, size: 64, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !619, file: !610, line: 128, baseType: !385, size: 64, offset: 128)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !619, file: !610, line: 129, baseType: !385, size: 64, offset: 192)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !619, file: !610, line: 130, baseType: !362, size: 512, offset: 256)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !619, file: !610, line: 132, baseType: !207, size: 32, offset: 768)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !619, file: !610, line: 132, baseType: !207, size: 32, offset: 800)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !619, file: !610, line: 133, baseType: !207, size: 32, offset: 832)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !619, file: !610, line: 134, baseType: !207, size: 32, offset: 864)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !619, file: !610, line: 134, baseType: !207, size: 32, offset: 896)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !619, file: !610, line: 134, baseType: !207, size: 32, offset: 928)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !619, file: !610, line: 135, baseType: !207, size: 32, offset: 960)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !619, file: !610, line: 135, baseType: !207, size: 32, offset: 992)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !619, file: !610, line: 136, baseType: !207, size: 32, offset: 1024)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !619, file: !610, line: 136, baseType: !207, size: 32, offset: 1056)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !619, file: !610, line: 137, baseType: !207, size: 32, offset: 1088)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !619, file: !610, line: 137, baseType: !207, size: 32, offset: 1120)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !619, file: !610, line: 138, baseType: !514, size: 32, offset: 1152)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !619, file: !610, line: 139, baseType: !514, size: 32, offset: 1184)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !619, file: !610, line: 139, baseType: !514, size: 32, offset: 1216)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !619, file: !610, line: 141, baseType: !377, size: 16, offset: 1248)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !619, file: !610, line: 142, baseType: !377, size: 16, offset: 1264)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !619, file: !610, line: 143, baseType: !207, size: 32, offset: 1280)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !619, file: !610, line: 144, baseType: !207, size: 32, offset: 1312)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !619, file: !610, line: 146, baseType: !647, size: 64, offset: 1344)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !610, line: 114, baseType: !649)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !610, line: 99, size: 7232, elements: !650)
!650 = !{!651, !653, !654, !655, !656, !657, !658, !669, !673, !688, !697, !704, !714}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !649, file: !610, line: 100, baseType: !652, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !649, file: !610, line: 100, baseType: !652, size: 64, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !649, file: !610, line: 101, baseType: !207, size: 32, offset: 128)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !649, file: !610, line: 101, baseType: !207, size: 32, offset: 160)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !649, file: !610, line: 102, baseType: !207, size: 32, offset: 192)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !649, file: !610, line: 102, baseType: !207, size: 32, offset: 224)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !649, file: !610, line: 103, baseType: !659, size: 64, offset: 256)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !610, line: 59, baseType: !661)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !610, line: 56, size: 2112, elements: !662)
!662 = !{!663, !667, !668}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !661, file: !610, line: 57, baseType: !664, size: 2048)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 2048, elements: !665)
!665 = !{!666}
!666 = !DISubrange(count: 256)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !661, file: !610, line: 58, baseType: !207, size: 32, offset: 2048)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !661, file: !610, line: 58, baseType: !207, size: 32, offset: 2080)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !649, file: !610, line: 106, baseType: !670, size: 6144, offset: 320)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 6144, elements: !671)
!671 = !{!672}
!672 = !DISubrange(count: 768)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !649, file: !610, line: 107, baseType: !674, size: 64, offset: 6464)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !610, line: 97, baseType: !676)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !610, line: 83, size: 8320, elements: !677)
!677 = !{!678, !679, !680, !684, !685, !686, !687}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !676, file: !610, line: 84, baseType: !670, size: 6144)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !676, file: !610, line: 87, baseType: !664, size: 2048, offset: 6144)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !676, file: !610, line: 88, baseType: !681, size: 64, offset: 8192)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !683, line: 41, flags: DIFlagFwdDecl)
!683 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!684 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !676, file: !610, line: 90, baseType: !377, size: 16, offset: 8256)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !676, file: !610, line: 92, baseType: !377, size: 16, offset: 8272)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !676, file: !610, line: 93, baseType: !377, size: 16, offset: 8288)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !676, file: !610, line: 95, baseType: !377, size: 16, offset: 8304)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !649, file: !610, line: 108, baseType: !689, size: 64, offset: 6528)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !610, line: 66, baseType: !691)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !610, line: 61, size: 128, elements: !692)
!692 = !{!693, !694, !695, !696}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !691, file: !610, line: 62, baseType: !207, size: 32)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !691, file: !610, line: 63, baseType: !207, size: 32, offset: 32)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !691, file: !610, line: 64, baseType: !207, size: 32, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !691, file: !610, line: 65, baseType: !207, size: 32, offset: 96)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !649, file: !610, line: 109, baseType: !698, size: 64, offset: 6592)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !610, line: 71, baseType: !700)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !610, line: 68, size: 64, elements: !701)
!701 = !{!702, !703}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !700, file: !610, line: 69, baseType: !207, size: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !700, file: !610, line: 70, baseType: !207, size: 32, offset: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !649, file: !610, line: 110, baseType: !705, size: 64, offset: 6656)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !610, line: 81, baseType: !707)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !610, line: 73, size: 352, elements: !708)
!708 = !{!709, !710, !711, !712, !713}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !707, file: !610, line: 74, baseType: !513, size: 96)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !707, file: !610, line: 75, baseType: !513, size: 96, offset: 96)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !707, file: !610, line: 76, baseType: !513, size: 96, offset: 192)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !707, file: !610, line: 77, baseType: !207, size: 32, offset: 288)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !707, file: !610, line: 78, baseType: !207, size: 32, offset: 320)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !649, file: !610, line: 113, baseType: !715, size: 512, offset: 6720)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !716, line: 182, baseType: !717)
!716 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !716, line: 180, size: 512, elements: !718)
!718 = !{!719}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !717, file: !716, line: 181, baseType: !362, size: 512)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !619, file: !610, line: 148, baseType: !721, size: 64, offset: 1408)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !610, line: 49, flags: DIFlagFwdDecl)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !619, file: !610, line: 151, baseType: !481, size: 64, offset: 1472)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !619, file: !610, line: 152, baseType: !491, size: 64, offset: 1536)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !619, file: !610, line: 153, baseType: !726, size: 64, offset: 1600)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !489, line: 64, size: 19136, elements: !728)
!728 = !{!729, !730, !731, !732, !733, !734, !736, !737, !738, !739, !742, !743, !993, !994, !1002, !1003, !1004, !1005, !1006}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !727, file: !489, line: 65, baseType: !441, size: 960)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !727, file: !489, line: 66, baseType: !487, size: 64, offset: 960)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !727, file: !489, line: 68, baseType: !459, size: 8192, offset: 1024)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !727, file: !489, line: 70, baseType: !207, size: 32, offset: 9216)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !727, file: !489, line: 71, baseType: !207, size: 32, offset: 9248)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !727, file: !489, line: 72, baseType: !735, size: 64, offset: 9280)
!735 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 64, elements: !547)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !727, file: !489, line: 74, baseType: !514, size: 32, offset: 9344)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !727, file: !489, line: 74, baseType: !514, size: 32, offset: 9376)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !727, file: !489, line: 76, baseType: !681, size: 64, offset: 9408)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !727, file: !489, line: 77, baseType: !740, size: 64, offset: 9472)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !489, line: 77, flags: DIFlagFwdDecl)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !727, file: !489, line: 78, baseType: !542, size: 64, offset: 9536)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !727, file: !489, line: 80, baseType: !744, size: 2624, offset: 9600)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !544, line: 340, size: 2624, elements: !745)
!745 = !{!746, !774, !792, !793, !794, !812, !870, !871, !973, !974, !975, !976, !982}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !744, file: !544, line: 341, baseType: !747, size: 576)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !544, line: 251, baseType: !748)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !544, line: 207, size: 576, elements: !749)
!749 = !{!750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !748, file: !544, line: 208, baseType: !207, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !748, file: !544, line: 211, baseType: !377, size: 16, offset: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !748, file: !544, line: 212, baseType: !377, size: 16, offset: 48)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !748, file: !544, line: 213, baseType: !514, size: 32, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !748, file: !544, line: 214, baseType: !377, size: 16, offset: 96)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !748, file: !544, line: 215, baseType: !377, size: 16, offset: 112)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !748, file: !544, line: 216, baseType: !377, size: 16, offset: 128)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !748, file: !544, line: 217, baseType: !377, size: 16, offset: 144)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !748, file: !544, line: 218, baseType: !377, size: 16, offset: 160)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !748, file: !544, line: 219, baseType: !377, size: 16, offset: 176)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !748, file: !544, line: 220, baseType: !514, size: 32, offset: 192)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !748, file: !544, line: 222, baseType: !377, size: 16, offset: 224)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !748, file: !544, line: 225, baseType: !377, size: 16, offset: 240)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !748, file: !544, line: 228, baseType: !207, size: 32, offset: 256)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !748, file: !544, line: 229, baseType: !207, size: 32, offset: 288)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !748, file: !544, line: 233, baseType: !207, size: 32, offset: 320)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !748, file: !544, line: 236, baseType: !377, size: 16, offset: 352)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !748, file: !544, line: 236, baseType: !377, size: 16, offset: 368)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !748, file: !544, line: 241, baseType: !514, size: 32, offset: 384)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !748, file: !544, line: 244, baseType: !207, size: 32, offset: 416)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !748, file: !544, line: 244, baseType: !207, size: 32, offset: 448)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !748, file: !544, line: 245, baseType: !514, size: 32, offset: 480)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !748, file: !544, line: 248, baseType: !514, size: 32, offset: 512)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !748, file: !544, line: 250, baseType: !207, size: 32, offset: 544)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !744, file: !544, line: 342, baseType: !775, size: 448, offset: 576)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !544, line: 79, baseType: !776)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !544, line: 61, size: 448, elements: !777)
!777 = !{!778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !776, file: !544, line: 62, baseType: !385, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !776, file: !544, line: 64, baseType: !377, size: 16, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !776, file: !544, line: 65, baseType: !377, size: 16, offset: 80)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !776, file: !544, line: 67, baseType: !514, size: 32, offset: 96)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !776, file: !544, line: 68, baseType: !514, size: 32, offset: 128)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !776, file: !544, line: 69, baseType: !514, size: 32, offset: 160)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !776, file: !544, line: 70, baseType: !377, size: 16, offset: 192)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !776, file: !544, line: 71, baseType: !377, size: 16, offset: 208)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !776, file: !544, line: 72, baseType: !546, size: 64, offset: 224)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !776, file: !544, line: 75, baseType: !514, size: 32, offset: 288)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !776, file: !544, line: 75, baseType: !514, size: 32, offset: 320)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !776, file: !544, line: 75, baseType: !514, size: 32, offset: 352)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !776, file: !544, line: 78, baseType: !514, size: 32, offset: 384)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !776, file: !544, line: 78, baseType: !514, size: 32, offset: 416)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !744, file: !544, line: 343, baseType: !387, size: 128, offset: 1024)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !744, file: !544, line: 344, baseType: !387, size: 128, offset: 1152)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !744, file: !544, line: 345, baseType: !795, size: 192, offset: 1280)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !544, line: 278, baseType: !796)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !544, line: 270, size: 192, elements: !797)
!797 = !{!798, !799, !800, !801, !802}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !796, file: !544, line: 271, baseType: !207, size: 32)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !796, file: !544, line: 273, baseType: !514, size: 32, offset: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !796, file: !544, line: 275, baseType: !207, size: 32, offset: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !796, file: !544, line: 276, baseType: !207, size: 32, offset: 96)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !796, file: !544, line: 277, baseType: !803, size: 64, offset: 128)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !544, line: 55, size: 576, elements: !805)
!805 = !{!806, !807, !808}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !804, file: !544, line: 56, baseType: !207, size: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !804, file: !544, line: 57, baseType: !514, size: 32, offset: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !804, file: !544, line: 58, baseType: !809, size: 512, offset: 64)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !514, size: 512, elements: !810)
!810 = !{!811, !811}
!811 = !DISubrange(count: 4)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !744, file: !544, line: 346, baseType: !813, size: 384, offset: 1472)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !544, line: 268, baseType: !814)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !544, line: 253, size: 384, elements: !815)
!815 = !{!816, !817, !818, !819, !820, !864, !865, !866, !867, !868, !869}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !814, file: !544, line: 254, baseType: !207, size: 32)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !814, file: !544, line: 255, baseType: !207, size: 32, offset: 32)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !814, file: !544, line: 255, baseType: !207, size: 32, offset: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !814, file: !544, line: 258, baseType: !514, size: 32, offset: 96)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !814, file: !544, line: 259, baseType: !821, size: 64, offset: 128)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !544, line: 164, baseType: !823)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !544, line: 108, size: 1664, elements: !824)
!824 = !{!825, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !823, file: !544, line: 109, baseType: !826, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !823, file: !544, line: 109, baseType: !826, size: 64, offset: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !823, file: !544, line: 111, baseType: !362, size: 512, offset: 128)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !823, file: !544, line: 119, baseType: !546, size: 64, offset: 640)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !823, file: !544, line: 119, baseType: !546, size: 64, offset: 704)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !823, file: !544, line: 125, baseType: !546, size: 64, offset: 768)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !823, file: !544, line: 125, baseType: !546, size: 64, offset: 832)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !823, file: !544, line: 127, baseType: !546, size: 64, offset: 896)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !823, file: !544, line: 130, baseType: !207, size: 32, offset: 960)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !823, file: !544, line: 131, baseType: !207, size: 32, offset: 992)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !823, file: !544, line: 132, baseType: !837, size: 64, offset: 1024)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !544, line: 106, baseType: !839)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !544, line: 81, size: 512, elements: !840)
!840 = !{!841, !842, !845, !846, !847, !848}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !839, file: !544, line: 82, baseType: !546, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !839, file: !544, line: 97, baseType: !843, size: 256, offset: 64)
!843 = !DICompositeType(tag: DW_TAG_array_type, baseType: !514, size: 256, elements: !844)
!844 = !{!811, !548}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !839, file: !544, line: 102, baseType: !546, size: 64, offset: 320)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !839, file: !544, line: 102, baseType: !546, size: 64, offset: 384)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !839, file: !544, line: 104, baseType: !207, size: 32, offset: 448)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !839, file: !544, line: 105, baseType: !207, size: 32, offset: 480)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !823, file: !544, line: 135, baseType: !513, size: 96, offset: 1088)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !823, file: !544, line: 136, baseType: !514, size: 32, offset: 1184)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !823, file: !544, line: 139, baseType: !207, size: 32, offset: 1216)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !823, file: !544, line: 139, baseType: !207, size: 32, offset: 1248)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !823, file: !544, line: 139, baseType: !207, size: 32, offset: 1280)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !823, file: !544, line: 140, baseType: !513, size: 96, offset: 1312)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !823, file: !544, line: 143, baseType: !377, size: 16, offset: 1408)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !823, file: !544, line: 144, baseType: !377, size: 16, offset: 1424)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !823, file: !544, line: 145, baseType: !377, size: 16, offset: 1440)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !823, file: !544, line: 148, baseType: !377, size: 16, offset: 1456)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !823, file: !544, line: 149, baseType: !207, size: 32, offset: 1472)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !823, file: !544, line: 150, baseType: !514, size: 32, offset: 1504)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !823, file: !544, line: 152, baseType: !542, size: 64, offset: 1536)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !823, file: !544, line: 163, baseType: !514, size: 32, offset: 1600)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !823, file: !544, line: 163, baseType: !514, size: 32, offset: 1632)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !814, file: !544, line: 261, baseType: !514, size: 32, offset: 192)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !814, file: !544, line: 261, baseType: !514, size: 32, offset: 224)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !814, file: !544, line: 261, baseType: !514, size: 32, offset: 256)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !814, file: !544, line: 263, baseType: !207, size: 32, offset: 288)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !814, file: !544, line: 266, baseType: !207, size: 32, offset: 320)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !814, file: !544, line: 267, baseType: !514, size: 32, offset: 352)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !744, file: !544, line: 347, baseType: !821, size: 64, offset: 1856)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !744, file: !544, line: 348, baseType: !872, size: 64, offset: 1920)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !544, line: 205, baseType: !874)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !544, line: 186, size: 1024, elements: !875)
!875 = !{!876, !878, !879, !880, !882, !883, !884, !892, !893, !894, !971, !972}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !874, file: !544, line: 187, baseType: !877, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !874, file: !544, line: 187, baseType: !877, size: 64, offset: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !874, file: !544, line: 189, baseType: !362, size: 512, offset: 128)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !874, file: !544, line: 191, baseType: !881, size: 64, offset: 640)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !874, file: !544, line: 193, baseType: !207, size: 32, offset: 704)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !874, file: !544, line: 193, baseType: !207, size: 32, offset: 736)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !874, file: !544, line: 195, baseType: !885, size: 64, offset: 768)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !544, line: 184, baseType: !887)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !544, line: 166, size: 320, elements: !888)
!888 = !{!889, !890, !891}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !887, file: !544, line: 180, baseType: !843, size: 256)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !887, file: !544, line: 182, baseType: !207, size: 32, offset: 256)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !887, file: !544, line: 183, baseType: !207, size: 32, offset: 288)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !874, file: !544, line: 196, baseType: !207, size: 32, offset: 832)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !874, file: !544, line: 198, baseType: !207, size: 32, offset: 864)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !874, file: !544, line: 200, baseType: !895, size: 64, offset: 896)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !683, line: 77, size: 15424, elements: !897)
!897 = !{!898, !899, !900, !903, !906, !907, !910, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !930, !931, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !957, !958, !959, !960, !961, !965}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !896, file: !683, line: 78, baseType: !441, size: 960)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !896, file: !683, line: 80, baseType: !459, size: 8192, offset: 960)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !896, file: !683, line: 82, baseType: !901, size: 64, offset: 9152)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !683, line: 43, flags: DIFlagFwdDecl)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !896, file: !683, line: 83, baseType: !904, size: 64, offset: 9216)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !368, line: 46, flags: DIFlagFwdDecl)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !896, file: !683, line: 86, baseType: !681, size: 64, offset: 9280)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !896, file: !683, line: 87, baseType: !908, size: 64, offset: 9344)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !683, line: 44, flags: DIFlagFwdDecl)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !896, file: !683, line: 89, baseType: !911, size: 512, offset: 9408)
!911 = !DICompositeType(tag: DW_TAG_array_type, baseType: !908, size: 512, elements: !912)
!912 = !{!913}
!913 = !DISubrange(count: 8)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !896, file: !683, line: 90, baseType: !377, size: 16, offset: 9920)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !896, file: !683, line: 90, baseType: !377, size: 16, offset: 9936)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !896, file: !683, line: 92, baseType: !377, size: 16, offset: 9952)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !896, file: !683, line: 92, baseType: !377, size: 16, offset: 9968)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !896, file: !683, line: 93, baseType: !377, size: 16, offset: 9984)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !896, file: !683, line: 93, baseType: !377, size: 16, offset: 10000)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !896, file: !683, line: 94, baseType: !207, size: 32, offset: 10016)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !896, file: !683, line: 97, baseType: !377, size: 16, offset: 10048)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !896, file: !683, line: 97, baseType: !377, size: 16, offset: 10064)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !896, file: !683, line: 98, baseType: !377, size: 16, offset: 10080)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !896, file: !683, line: 98, baseType: !377, size: 16, offset: 10096)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !896, file: !683, line: 99, baseType: !377, size: 16, offset: 10112)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !896, file: !683, line: 99, baseType: !377, size: 16, offset: 10128)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !896, file: !683, line: 100, baseType: !5, size: 32, offset: 10144)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !896, file: !683, line: 101, baseType: !929, size: 64, offset: 10176)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !896, file: !683, line: 103, baseType: !465, size: 64, offset: 10240)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !896, file: !683, line: 104, baseType: !932, size: 64, offset: 10304)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !368, line: 159, size: 448, elements: !934)
!934 = !{!935, !937, !938, !940, !941, !943}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !933, file: !368, line: 161, baseType: !936, size: 64)
!936 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !547)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !933, file: !368, line: 162, baseType: !936, size: 64, offset: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !933, file: !368, line: 163, baseType: !939, size: 32, offset: 128)
!939 = !DICompositeType(tag: DW_TAG_array_type, baseType: !377, size: 32, elements: !547)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !933, file: !368, line: 164, baseType: !939, size: 32, offset: 160)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !933, file: !368, line: 165, baseType: !942, size: 128, offset: 192)
!942 = !DICompositeType(tag: DW_TAG_array_type, baseType: !929, size: 128, elements: !547)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !933, file: !368, line: 166, baseType: !944, size: 128, offset: 320)
!944 = !DICompositeType(tag: DW_TAG_array_type, baseType: !904, size: 128, elements: !547)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !896, file: !683, line: 107, baseType: !514, size: 32, offset: 10368)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !896, file: !683, line: 108, baseType: !207, size: 32, offset: 10400)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !896, file: !683, line: 109, baseType: !377, size: 16, offset: 10432)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !896, file: !683, line: 110, baseType: !377, size: 16, offset: 10448)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !896, file: !683, line: 113, baseType: !207, size: 32, offset: 10464)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !896, file: !683, line: 113, baseType: !207, size: 32, offset: 10496)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !896, file: !683, line: 114, baseType: !344, size: 8, offset: 10528)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !896, file: !683, line: 114, baseType: !344, size: 8, offset: 10536)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !896, file: !683, line: 115, baseType: !377, size: 16, offset: 10544)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !896, file: !683, line: 116, baseType: !955, size: 128, offset: 10560)
!955 = !DICompositeType(tag: DW_TAG_array_type, baseType: !514, size: 128, elements: !956)
!956 = !{!811}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !896, file: !683, line: 119, baseType: !514, size: 32, offset: 10688)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !896, file: !683, line: 119, baseType: !514, size: 32, offset: 10720)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !896, file: !683, line: 122, baseType: !715, size: 512, offset: 10752)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !896, file: !683, line: 123, baseType: !344, size: 8, offset: 11264)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !896, file: !683, line: 125, baseType: !962, size: 56, offset: 11272)
!962 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 56, elements: !963)
!963 = !{!964}
!964 = !DISubrange(count: 7)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !896, file: !683, line: 126, baseType: !966, size: 4096, offset: 11328)
!966 = !DICompositeType(tag: DW_TAG_array_type, baseType: !967, size: 4096, elements: !912)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !683, line: 69, baseType: !968)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !683, line: 67, size: 512, elements: !969)
!969 = !{!970}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !968, file: !683, line: 68, baseType: !362, size: 512)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !874, file: !544, line: 201, baseType: !514, size: 32, offset: 960)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !874, file: !544, line: 204, baseType: !207, size: 32, offset: 992)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !744, file: !544, line: 350, baseType: !387, size: 128, offset: 1984)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !744, file: !544, line: 351, baseType: !207, size: 32, offset: 2112)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !744, file: !544, line: 351, baseType: !207, size: 32, offset: 2144)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !744, file: !544, line: 353, baseType: !977, size: 64, offset: 2176)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !544, line: 297, baseType: !979)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !544, line: 295, size: 2048, elements: !980)
!980 = !{!981}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !979, file: !544, line: 296, baseType: !664, size: 2048)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !744, file: !544, line: 355, baseType: !983, size: 384, offset: 2240)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !544, line: 338, baseType: !984)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !544, line: 322, size: 384, elements: !985)
!985 = !{!986, !987, !988, !989, !990, !991, !992}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !984, file: !544, line: 323, baseType: !207, size: 32)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !984, file: !544, line: 325, baseType: !377, size: 16, offset: 32)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !984, file: !544, line: 326, baseType: !377, size: 16, offset: 48)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !984, file: !544, line: 331, baseType: !387, size: 128, offset: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !984, file: !544, line: 334, baseType: !387, size: 128, offset: 192)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !984, file: !544, line: 335, baseType: !207, size: 32, offset: 320)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !984, file: !544, line: 337, baseType: !207, size: 32, offset: 352)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !727, file: !489, line: 81, baseType: !385, size: 64, offset: 12224)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !727, file: !489, line: 85, baseType: !995, size: 6208, offset: 12288)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !489, line: 55, size: 6208, elements: !996)
!996 = !{!997, !998, !999, !1000, !1001}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !995, file: !489, line: 56, baseType: !670, size: 6144)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !995, file: !489, line: 58, baseType: !377, size: 16, offset: 6144)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !995, file: !489, line: 59, baseType: !377, size: 16, offset: 6160)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !995, file: !489, line: 60, baseType: !377, size: 16, offset: 6176)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !995, file: !489, line: 61, baseType: !377, size: 16, offset: 6192)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !727, file: !489, line: 86, baseType: !207, size: 32, offset: 18496)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !727, file: !489, line: 88, baseType: !207, size: 32, offset: 18528)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !727, file: !489, line: 90, baseType: !207, size: 32, offset: 18560)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !727, file: !489, line: 94, baseType: !207, size: 32, offset: 18592)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !727, file: !489, line: 100, baseType: !715, size: 512, offset: 18624)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !619, file: !610, line: 154, baseType: !1008, size: 64, offset: 1664)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !610, line: 154, flags: DIFlagFwdDecl)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !619, file: !610, line: 156, baseType: !681, size: 64, offset: 1728)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "effect_fader", scope: !619, file: !610, line: 158, baseType: !514, size: 32, offset: 1792)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "speed_fader", scope: !619, file: !610, line: 159, baseType: !514, size: 32, offset: 1824)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "seq1", scope: !619, file: !610, line: 162, baseType: !622, size: 64, offset: 1856)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "seq2", scope: !619, file: !610, line: 162, baseType: !622, size: 64, offset: 1920)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "seq3", scope: !619, file: !610, line: 162, baseType: !622, size: 64, offset: 1984)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !619, file: !610, line: 164, baseType: !387, size: 128, offset: 2048)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !619, file: !610, line: 166, baseType: !1018, size: 64, offset: 2176)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DICompositeType(tag: DW_TAG_structure_type, name: "bSound", file: !610, line: 51, flags: DIFlagFwdDecl)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "scene_sound", scope: !619, file: !610, line: 167, baseType: !385, size: 64, offset: 2240)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !619, file: !610, line: 168, baseType: !514, size: 32, offset: 2304)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !619, file: !610, line: 170, baseType: !514, size: 32, offset: 2336)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "pan", scope: !619, file: !610, line: 170, baseType: !514, size: 32, offset: 2368)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "strobe", scope: !619, file: !610, line: 171, baseType: !514, size: 32, offset: 2400)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "effectdata", scope: !619, file: !610, line: 173, baseType: !385, size: 64, offset: 2432)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "anim_startofs", scope: !619, file: !610, line: 175, baseType: !207, size: 32, offset: 2496)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "anim_endofs", scope: !619, file: !610, line: 176, baseType: !207, size: 32, offset: 2528)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "blend_mode", scope: !619, file: !610, line: 179, baseType: !207, size: 32, offset: 2560)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "blend_opacity", scope: !619, file: !610, line: 180, baseType: !514, size: 32, offset: 2592)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !619, file: !610, line: 183, baseType: !207, size: 32, offset: 2624)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !619, file: !610, line: 185, baseType: !344, size: 8, offset: 2656)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !619, file: !610, line: 186, baseType: !1033, size: 24, offset: 2664)
!1033 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 24, elements: !515)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !619, file: !610, line: 189, baseType: !387, size: 128, offset: 2688)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "act_imagedir", scope: !609, file: !610, line: 207, baseType: !459, size: 8192, offset: 384)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "act_sounddir", scope: !609, file: !610, line: 208, baseType: !459, size: 8192, offset: 8576)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "over_ofs", scope: !609, file: !610, line: 210, baseType: !207, size: 32, offset: 16768)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "over_cfra", scope: !609, file: !610, line: 210, baseType: !207, size: 32, offset: 16800)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "over_flag", scope: !609, file: !610, line: 211, baseType: !207, size: 32, offset: 16832)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !609, file: !610, line: 211, baseType: !207, size: 32, offset: 16864)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "over_border", scope: !609, file: !610, line: 212, baseType: !564, size: 128, offset: 16896)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !482, file: !483, line: 1246, baseType: !1043, size: 64, offset: 2112)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !483, line: 1067, size: 5184, elements: !1045)
!1045 = !{!1046, !1076, !1077, !1092, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1114, !1130, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1240}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !1044, file: !483, line: 1068, baseType: !1047, size: 64)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !483, line: 934, baseType: !1049)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !483, line: 925, size: 576, elements: !1050)
!1050 = !{!1051, !1068, !1069, !1070, !1071, !1072, !1075}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1049, file: !483, line: 926, baseType: !1052, size: 320)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !483, line: 830, baseType: !1053)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !483, line: 813, size: 320, elements: !1054)
!1054 = !{!1055, !1058, !1061, !1062, !1065, !1066, !1067}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !1053, file: !483, line: 814, baseType: !1056, size: 64)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !483, line: 51, flags: DIFlagFwdDecl)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !1053, file: !483, line: 815, baseType: !1059, size: 64, offset: 64)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1060 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !483, line: 815, flags: DIFlagFwdDecl)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !1053, file: !483, line: 818, baseType: !385, size: 64, offset: 128)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !1053, file: !483, line: 819, baseType: !1063, size: 32, offset: 192)
!1063 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1064, size: 32, elements: !956)
!1064 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1053, file: !483, line: 822, baseType: !207, size: 32, offset: 224)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !1053, file: !483, line: 826, baseType: !207, size: 32, offset: 256)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !1053, file: !483, line: 829, baseType: !207, size: 32, offset: 288)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1049, file: !483, line: 928, baseType: !377, size: 16, offset: 320)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1049, file: !483, line: 928, baseType: !377, size: 16, offset: 336)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !1049, file: !483, line: 929, baseType: !207, size: 32, offset: 352)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !1049, file: !483, line: 930, baseType: !929, size: 64, offset: 384)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !1049, file: !483, line: 931, baseType: !1073, size: 64, offset: 448)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1074 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !483, line: 931, flags: DIFlagFwdDecl)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !1049, file: !483, line: 933, baseType: !385, size: 64, offset: 512)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !1044, file: !483, line: 1069, baseType: !1047, size: 64, offset: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !1044, file: !483, line: 1070, baseType: !1078, size: 64, offset: 128)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64)
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !483, line: 916, baseType: !1080)
!1080 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !483, line: 891, size: 704, elements: !1081)
!1081 = !{!1082, !1083, !1084, !1086, !1087, !1088, !1089, !1090, !1091}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1080, file: !483, line: 892, baseType: !1052, size: 320)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1080, file: !483, line: 896, baseType: !207, size: 32, offset: 320)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !1080, file: !483, line: 900, baseType: !1085, size: 96, offset: 352)
!1085 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 96, elements: !515)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !1080, file: !483, line: 903, baseType: !514, size: 32, offset: 448)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !1080, file: !483, line: 906, baseType: !207, size: 32, offset: 480)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !1080, file: !483, line: 909, baseType: !514, size: 32, offset: 512)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !1080, file: !483, line: 912, baseType: !514, size: 32, offset: 544)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !1080, file: !483, line: 914, baseType: !491, size: 64, offset: 576)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1080, file: !483, line: 915, baseType: !385, size: 64, offset: 640)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !1044, file: !483, line: 1071, baseType: !1093, size: 64, offset: 192)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !483, line: 920, baseType: !1095)
!1095 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !483, line: 918, size: 320, elements: !1096)
!1096 = !{!1097}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1095, file: !483, line: 919, baseType: !1052, size: 320)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !1044, file: !483, line: 1075, baseType: !514, size: 32, offset: 256)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !1044, file: !483, line: 1077, baseType: !514, size: 32, offset: 288)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !1044, file: !483, line: 1078, baseType: !514, size: 32, offset: 320)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !1044, file: !483, line: 1079, baseType: !377, size: 16, offset: 352)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !1044, file: !483, line: 1082, baseType: !377, size: 16, offset: 368)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !1044, file: !483, line: 1085, baseType: !344, size: 8, offset: 384)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !1044, file: !483, line: 1086, baseType: !344, size: 8, offset: 392)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !1044, file: !483, line: 1087, baseType: !344, size: 8, offset: 400)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !1044, file: !483, line: 1088, baseType: !344, size: 8, offset: 408)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !1044, file: !483, line: 1090, baseType: !514, size: 32, offset: 416)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !1044, file: !483, line: 1093, baseType: !377, size: 16, offset: 448)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !1044, file: !483, line: 1096, baseType: !344, size: 8, offset: 464)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1044, file: !483, line: 1098, baseType: !1111, size: 40, offset: 472)
!1111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 40, elements: !1112)
!1112 = !{!1113}
!1113 = !DISubrange(count: 5)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !1044, file: !483, line: 1101, baseType: !1115, size: 832, offset: 512)
!1115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !483, line: 836, size: 832, elements: !1116)
!1116 = !{!1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1115, file: !483, line: 837, baseType: !1052, size: 320)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1115, file: !483, line: 839, baseType: !377, size: 16, offset: 320)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !1115, file: !483, line: 839, baseType: !377, size: 16, offset: 336)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !1115, file: !483, line: 842, baseType: !377, size: 16, offset: 352)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !1115, file: !483, line: 842, baseType: !377, size: 16, offset: 368)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !1115, file: !483, line: 843, baseType: !939, size: 32, offset: 384)
