; ModuleID = 'blender/source/blender/bmesh/tools/bmesh_region_match.c'
source_filename = "blender/source/blender/bmesh/tools/bmesh_region_match.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BMesh = type { i32, i32, i32, i32, i32, i32, i32, i8, i8, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BMVert**, %struct.BMEdge**, %struct.BMFace**, i32, i32, i32, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, i32, %struct.BMOperator*, %struct.CustomData, %struct.CustomData, %struct.CustomData, %struct.CustomData, i16, i32, i32, i32, %struct.ListBase, %struct.BMFace*, %struct.ListBase, i8* }
%struct.BMVert = type { %struct.BMHeader, %struct.BMFlagLayer*, [3 x float], [3 x float], %struct.BMEdge* }
%struct.BMHeader = type { i8*, i32, i8, i8, i8 }
%struct.BMFlagLayer = type { i16 }
%struct.BMEdge = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMVert*, %struct.BMVert*, %struct.BMLoop*, %struct.BMDiskLink, %struct.BMDiskLink }
%struct.BMLoop = type { %struct.BMHeader, %struct.BMVert*, %struct.BMEdge*, %struct.BMFace*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop* }
%struct.BMDiskLink = type { %struct.BMEdge*, %struct.BMEdge* }
%struct.BLI_mempool = type opaque

!33 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_BOOL", value: 68, isUnsigned: true)
!34 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INTERNAL", value: 69, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 182, baseType: !5, size: 32, elements: !36)
!36 = !{!37, !38, !39, !40, !41}
!37 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NOP", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_UNTAN_MULTIRES", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NORMALS_CALC", value: 2, isUnsigned: true)
!40 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_FLUSH", value: 4, isUnsigned: true)
!41 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 249, baseType: !5, size: 32, elements: !44)
!43 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!44 = !{!45, !46, !47, !48}
!45 = !DIEnumerator(name: "BM_VERT", value: 1, isUnsigned: true)
!46 = !DIEnumerator(name: "BM_EDGE", value: 2, isUnsigned: true)
!47 = !DIEnumerator(name: "BM_LOOP", value: 4, isUnsigned: true)
!48 = !DIEnumerator(name: "BM_FACE", value: 8, isUnsigned: true)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 260, baseType: !5, size: 32, elements: !50)
!50 = !{!51, !52, !53, !54, !55, !56, !57}
!51 = !DIEnumerator(name: "BM_ELEM_SELECT", value: 1, isUnsigned: true)
!52 = !DIEnumerator(name: "BM_ELEM_HIDDEN", value: 2, isUnsigned: true)
!53 = !DIEnumerator(name: "BM_ELEM_SEAM", value: 4, isUnsigned: true)
!54 = !DIEnumerator(name: "BM_ELEM_SMOOTH", value: 8, isUnsigned: true)
!55 = !DIEnumerator(name: "BM_ELEM_TAG", value: 16, isUnsigned: true)
!56 = !DIEnumerator(name: "BM_ELEM_DRAW", value: 32, isUnsigned: true)
!57 = !DIEnumerator(name: "BM_ELEM_INTERNAL_TAG", value: 128, isUnsigned: true)
!58 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BMIterType", file: !59, line: 57, baseType: !5, size: 32, elements: !60)
!59 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!60 = !{!61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74}
!61 = !DIEnumerator(name: "BM_VERTS_OF_MESH", value: 1, isUnsigned: true)
!62 = !DIEnumerator(name: "BM_EDGES_OF_MESH", value: 2, isUnsigned: true)
!63 = !DIEnumerator(name: "BM_FACES_OF_MESH", value: 3, isUnsigned: true)
!64 = !DIEnumerator(name: "BM_EDGES_OF_VERT", value: 4, isUnsigned: true)
!65 = !DIEnumerator(name: "BM_FACES_OF_VERT", value: 5, isUnsigned: true)
!66 = !DIEnumerator(name: "BM_LOOPS_OF_VERT", value: 6, isUnsigned: true)
!67 = !DIEnumerator(name: "BM_VERTS_OF_EDGE", value: 7, isUnsigned: true)
!68 = !DIEnumerator(name: "BM_FACES_OF_EDGE", value: 8, isUnsigned: true)
!69 = !DIEnumerator(name: "BM_VERTS_OF_FACE", value: 9, isUnsigned: true)
!70 = !DIEnumerator(name: "BM_EDGES_OF_FACE", value: 10, isUnsigned: true)
!71 = !DIEnumerator(name: "BM_LOOPS_OF_FACE", value: 11, isUnsigned: true)
!72 = !DIEnumerator(name: "BM_ALL_LOOPS_OF_FACE", value: 12, isUnsigned: true)
!73 = !DIEnumerator(name: "BM_LOOPS_OF_LOOP", value: 13, isUnsigned: true)
!74 = !DIEnumerator(name: "BM_LOOPS_OF_EDGE", value: 14, isUnsigned: true)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !76, line: 83, baseType: !5, size: 32, elements: !77)
!76 = !DIFile(filename: "blender/source/blender/blenlib/BLI_mempool.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!77 = !{!78, !79}
!78 = !DIEnumerator(name: "BLI_MEMPOOL_NOP", value: 0, isUnsigned: true)
!79 = !DIEnumerator(name: "BLI_MEMPOOL_ALLOW_ITER", value: 1, isUnsigned: true)
!80 = !{!81, !82, !83, !5, !84, !88, !89, !90, !94, !98, !162, !164, !146, !166, !169, !170}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!82 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "SUID_Int", file: !1, line: 943, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !86, line: 87, baseType: !87)
!86 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!87 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!88 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !59, line: 79, baseType: !58)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !59, line: 158, baseType: !91)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{null, !81}
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !59, line: 159, baseType: !95)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!81, !81}
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !43, line: 103, baseType: !100)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !43, line: 90, size: 448, elements: !101)
!101 = !{!102, !111, !117, !122, !123}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !100, file: !43, line: 91, baseType: !103, size: 128)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !43, line: 82, baseType: !104)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !43, line: 64, size: 128, elements: !105)
!105 = !{!106, !107, !108, !109, !110}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !104, file: !43, line: 65, baseType: !81, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !104, file: !43, line: 66, baseType: !82, size: 32, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !104, file: !43, line: 73, baseType: !88, size: 8, offset: 96)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !104, file: !43, line: 74, baseType: !88, size: 8, offset: 104)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !104, file: !43, line: 80, baseType: !88, size: 8, offset: 112)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !100, file: !43, line: 92, baseType: !112, size: 64, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !43, line: 180, size: 16, elements: !114)
!114 = !{!115}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !113, file: !43, line: 181, baseType: !116, size: 16)
!116 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !100, file: !43, line: 94, baseType: !118, size: 96, offset: 192)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 96, elements: !120)
!119 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!120 = !{!121}
!121 = !DISubrange(count: 3)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !100, file: !43, line: 95, baseType: !118, size: 96, offset: 288)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !100, file: !43, line: 102, baseType: !124, size: 64, offset: 384)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !43, line: 110, size: 640, elements: !126)
!126 = !{!127, !128, !129, !131, !132, !155, !161}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !125, file: !43, line: 111, baseType: !103, size: 128)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !125, file: !43, line: 112, baseType: !112, size: 64, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !125, file: !43, line: 114, baseType: !130, size: 64, offset: 192)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !125, file: !43, line: 114, baseType: !130, size: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !125, file: !43, line: 118, baseType: !133, size: 64, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !43, line: 125, size: 576, elements: !135)
!135 = !{!136, !137, !138, !139, !151, !152, !153, !154}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !134, file: !43, line: 126, baseType: !103, size: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !134, file: !43, line: 129, baseType: !130, size: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !134, file: !43, line: 130, baseType: !124, size: 64, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !134, file: !43, line: 131, baseType: !140, size: 64, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !43, line: 164, size: 448, elements: !142)
!142 = !{!143, !144, !145, !148, !149, !150}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !141, file: !43, line: 165, baseType: !103, size: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !141, file: !43, line: 166, baseType: !112, size: 64, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !141, file: !43, line: 172, baseType: !146, size: 64, offset: 192)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !43, line: 140, baseType: !134)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !141, file: !43, line: 174, baseType: !82, size: 32, offset: 256)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !141, file: !43, line: 175, baseType: !118, size: 96, offset: 288)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !141, file: !43, line: 176, baseType: !116, size: 16, offset: 384)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !134, file: !43, line: 135, baseType: !133, size: 64, offset: 320)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !134, file: !43, line: 135, baseType: !133, size: 64, offset: 384)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !134, file: !43, line: 139, baseType: !133, size: 64, offset: 448)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !134, file: !43, line: 139, baseType: !133, size: 64, offset: 512)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !125, file: !43, line: 122, baseType: !156, size: 128, offset: 384)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !43, line: 108, baseType: !157)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !43, line: 106, size: 128, elements: !158)
!158 = !{!159, !160}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !157, file: !43, line: 107, baseType: !124, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !157, file: !43, line: 107, baseType: !124, size: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !125, file: !43, line: 122, baseType: !156, size: 128, offset: 512)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !43, line: 123, baseType: !125)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !43, line: 178, baseType: !141)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "UUID_Int", file: !1, line: 82, baseType: !167)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !86, line: 90, baseType: !168)
!168 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_gh_Entry", file: !172, line: 94, size: 192, elements: !173)
!172 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!173 = !{!174, !175, !176}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !171, file: !172, line: 94, baseType: !81, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !171, file: !172, line: 94, baseType: !81, size: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !171, file: !172, line: 94, baseType: !81, size: 64, offset: 128)
!177 = !{i32 7, !"Dwarf Version", i32 4}
!178 = !{i32 2, !"Debug Info Version", i32 3}
!179 = !{i32 1, !"wchar_size", i32 4}
!180 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!181 = distinct !DISubprogram(name: "BM_mesh_region_match", scope: !1, file: !1, line: 1372, type: !182, scopeLine: 1376, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !326)
!182 = !DISubroutineType(types: !183)
!183 = !{!82, !184, !209, !5, !325}
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !43, line: 246, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !43, line: 186, size: 8064, elements: !187)
!187 = !{!188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !201, !202, !203, !204, !206, !208, !210, !211, !212, !213, !214, !215, !216, !217, !268, !308, !309, !310, !311, !312, !313, !314, !315, !322, !323, !324}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !186, file: !43, line: 187, baseType: !82, size: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !186, file: !43, line: 187, baseType: !82, size: 32, offset: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !186, file: !43, line: 187, baseType: !82, size: 32, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !186, file: !43, line: 187, baseType: !82, size: 32, offset: 96)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !186, file: !43, line: 188, baseType: !82, size: 32, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !186, file: !43, line: 188, baseType: !82, size: 32, offset: 160)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !186, file: !43, line: 188, baseType: !82, size: 32, offset: 192)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !186, file: !43, line: 193, baseType: !88, size: 8, offset: 224)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !186, file: !43, line: 197, baseType: !88, size: 8, offset: 232)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !186, file: !43, line: 201, baseType: !198, size: 64, offset: 256)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !200, line: 39, flags: DIFlagFwdDecl)
!200 = !DIFile(filename: "blender/source/blender/blenlib/BLI_linklist.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!201 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !186, file: !43, line: 201, baseType: !198, size: 64, offset: 320)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !186, file: !43, line: 201, baseType: !198, size: 64, offset: 384)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !186, file: !43, line: 201, baseType: !198, size: 64, offset: 448)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !186, file: !43, line: 208, baseType: !205, size: 64, offset: 512)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !186, file: !43, line: 209, baseType: !207, size: 64, offset: 576)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !186, file: !43, line: 210, baseType: !209, size: 64, offset: 640)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !186, file: !43, line: 213, baseType: !82, size: 32, offset: 704)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !186, file: !43, line: 214, baseType: !82, size: 32, offset: 736)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !186, file: !43, line: 215, baseType: !82, size: 32, offset: 768)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !186, file: !43, line: 218, baseType: !198, size: 64, offset: 832)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !186, file: !43, line: 218, baseType: !198, size: 64, offset: 896)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !186, file: !43, line: 218, baseType: !198, size: 64, offset: 960)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !186, file: !43, line: 220, baseType: !82, size: 32, offset: 1024)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !186, file: !43, line: 221, baseType: !218, size: 64, offset: 1088)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !4, line: 190, size: 10496, elements: !220)
!220 = !{!221, !256, !257, !261, !264, !265, !267}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !219, file: !4, line: 191, baseType: !222, size: 5120)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 5120, elements: !254)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !4, line: 147, size: 320, elements: !224)
!224 = !{!225, !228, !230, !240, !241}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !223, file: !4, line: 148, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !88)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !223, file: !4, line: 149, baseType: !229, size: 32, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !4, line: 112, baseType: !3)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !223, file: !4, line: 150, baseType: !231, size: 32, offset: 96)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !4, line: 142, baseType: !232)
!232 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !4, line: 138, size: 32, elements: !233)
!233 = !{!234, !236, !238}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !232, file: !4, line: 139, baseType: !235, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !4, line: 122, baseType: !15)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !232, file: !4, line: 140, baseType: !237, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !4, line: 136, baseType: !21)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !232, file: !4, line: 141, baseType: !239, size: 32)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !4, line: 130, baseType: !27)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !223, file: !4, line: 152, baseType: !82, size: 32, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !223, file: !4, line: 162, baseType: !242, size: 128, offset: 192)
!242 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !223, file: !4, line: 155, size: 128, elements: !243)
!243 = !{!244, !245, !246, !247, !248, !250}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !242, file: !4, line: 156, baseType: !82, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !242, file: !4, line: 157, baseType: !119, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !242, file: !4, line: 158, baseType: !81, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !242, file: !4, line: 159, baseType: !118, size: 96)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !242, file: !4, line: 160, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !242, file: !4, line: 161, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !172, line: 48, baseType: !253)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !172, line: 48, flags: DIFlagFwdDecl)
!254 = !{!255}
!255 = !DISubrange(count: 16)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !219, file: !4, line: 192, baseType: !222, size: 5120, offset: 5120)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !219, file: !4, line: 193, baseType: !258, size: 64, offset: 10240)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DISubroutineType(types: !260)
!260 = !{null, !184, !218}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !219, file: !4, line: 194, baseType: !262, size: 64, offset: 10304)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !200, line: 38, flags: DIFlagFwdDecl)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !219, file: !4, line: 195, baseType: !82, size: 32, offset: 10368)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !219, file: !4, line: 196, baseType: !266, size: 32, offset: 10400)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !4, line: 188, baseType: !35)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !219, file: !4, line: 197, baseType: !82, size: 32, offset: 10432)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !186, file: !43, line: 223, baseType: !269, size: 1600, offset: 1152)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !270, line: 73, baseType: !271)
!270 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !270, line: 64, size: 1600, elements: !272)
!272 = !{!273, !291, !295, !296, !297, !298, !299}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !271, file: !270, line: 65, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !270, line: 53, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !270, line: 42, size: 832, elements: !277)
!277 = !{!278, !279, !280, !281, !282, !283, !284, !285, !286, !290}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !276, file: !270, line: 43, baseType: !82, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !276, file: !270, line: 44, baseType: !82, size: 32, offset: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !276, file: !270, line: 45, baseType: !82, size: 32, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !276, file: !270, line: 46, baseType: !82, size: 32, offset: 96)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !276, file: !270, line: 47, baseType: !82, size: 32, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !276, file: !270, line: 48, baseType: !82, size: 32, offset: 160)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !276, file: !270, line: 49, baseType: !82, size: 32, offset: 192)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !276, file: !270, line: 50, baseType: !82, size: 32, offset: 224)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !276, file: !270, line: 51, baseType: !287, size: 512, offset: 256)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 512, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !276, file: !270, line: 52, baseType: !81, size: 64, offset: 768)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !271, file: !270, line: 66, baseType: !292, size: 1312, offset: 64)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 1312, elements: !293)
!293 = !{!294}
!294 = !DISubrange(count: 41)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !271, file: !270, line: 69, baseType: !82, size: 32, offset: 1376)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !271, file: !270, line: 69, baseType: !82, size: 32, offset: 1408)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !271, file: !270, line: 70, baseType: !82, size: 32, offset: 1440)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !271, file: !270, line: 71, baseType: !198, size: 64, offset: 1472)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !271, file: !270, line: 72, baseType: !300, size: 64, offset: 1536)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !270, line: 59, baseType: !302)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !270, line: 57, size: 8192, elements: !303)
!303 = !{!304}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !302, file: !270, line: 58, baseType: !305, size: 8192)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 8192, elements: !306)
!306 = !{!307}
!307 = !DISubrange(count: 1024)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !186, file: !43, line: 223, baseType: !269, size: 1600, offset: 2752)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !186, file: !43, line: 223, baseType: !269, size: 1600, offset: 4352)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !186, file: !43, line: 223, baseType: !269, size: 1600, offset: 5952)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !186, file: !43, line: 233, baseType: !116, size: 16, offset: 7552)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !186, file: !43, line: 236, baseType: !82, size: 32, offset: 7584)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !186, file: !43, line: 238, baseType: !82, size: 32, offset: 7616)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !186, file: !43, line: 238, baseType: !82, size: 32, offset: 7648)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !186, file: !43, line: 239, baseType: !316, size: 128, offset: 7680)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !317, line: 71, baseType: !318)
!317 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !317, line: 69, size: 128, elements: !319)
!319 = !{!320, !321}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !318, file: !317, line: 70, baseType: !81, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !318, file: !317, line: 70, baseType: !81, size: 64, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !186, file: !43, line: 241, baseType: !164, size: 64, offset: 7808)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !186, file: !43, line: 243, baseType: !316, size: 128, offset: 7872)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !186, file: !43, line: 245, baseType: !81, size: 64, offset: 8000)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!326 = !{}
!327 = !DILocalVariable(name: "bm", arg: 1, scope: !181, file: !1, line: 1373, type: !184)
!328 = !DILocation(line: 1373, column: 16, scope: !181)
!329 = !DILocalVariable(name: "faces_region", arg: 2, scope: !181, file: !1, line: 1374, type: !209)
!330 = !DILocation(line: 1374, column: 18, scope: !181)
!331 = !DILocalVariable(name: "faces_region_len", arg: 3, scope: !181, file: !1, line: 1374, type: !5)
!332 = !DILocation(line: 1374, column: 45, scope: !181)
!333 = !DILocalVariable(name: "r_face_regions", arg: 4, scope: !181, file: !1, line: 1375, type: !325)
!334 = !DILocation(line: 1375, column: 19, scope: !181)
!335 = !DILocalVariable(name: "e_src", scope: !181, file: !1, line: 1377, type: !162)
!336 = !DILocation(line: 1377, column: 10, scope: !181)
!337 = !DILocalVariable(name: "e_dst", scope: !181, file: !1, line: 1378, type: !162)
!338 = !DILocation(line: 1378, column: 10, scope: !181)
!339 = !DILocalVariable(name: "iter", scope: !181, file: !1, line: 1379, type: !340)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter", file: !59, line: 186, baseType: !341)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter", file: !59, line: 164, size: 512, elements: !342)
!342 = !{!343, !422, !423, !424, !425}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !341, file: !59, line: 179, baseType: !344, size: 320)
!344 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !341, file: !59, line: 166, size: 320, elements: !345)
!345 = !{!346, !360, !366, !374, !382, !388, !394, !400, !404, !410, !416}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "elem_of_mesh", scope: !344, file: !59, line: 167, baseType: !347, size: 192)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__elem_of_mesh", file: !59, line: 113, size: 192, elements: !348)
!348 = !{!349}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "pooliter", scope: !347, file: !59, line: 114, baseType: !350, size: 192)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool_iter", file: !76, line: 80, baseType: !351)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_iter", file: !76, line: 76, size: 192, elements: !352)
!352 = !{!353, !356, !359}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !351, file: !76, line: 77, baseType: !354, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool", file: !76, line: 47, baseType: !199)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "curchunk", scope: !351, file: !76, line: 78, baseType: !357, size: 64, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_chunk", file: !76, line: 45, flags: DIFlagFwdDecl)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "curindex", scope: !351, file: !76, line: 79, baseType: !5, size: 32, offset: 128)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_vert", scope: !344, file: !59, line: 169, baseType: !361, size: 192)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_vert", file: !59, line: 116, size: 192, elements: !362)
!362 = !{!363, !364, !365}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !361, file: !59, line: 117, baseType: !98, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !361, file: !59, line: 118, baseType: !162, size: 64, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !361, file: !59, line: 118, baseType: !162, size: 64, offset: 128)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_vert", scope: !344, file: !59, line: 170, baseType: !367, size: 320)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_vert", file: !59, line: 120, size: 320, elements: !368)
!368 = !{!369, !370, !371, !372, !373}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !367, file: !59, line: 121, baseType: !98, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !367, file: !59, line: 122, baseType: !146, size: 64, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !367, file: !59, line: 122, baseType: !146, size: 64, offset: 128)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !367, file: !59, line: 123, baseType: !162, size: 64, offset: 192)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !367, file: !59, line: 123, baseType: !162, size: 64, offset: 256)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_vert", scope: !344, file: !59, line: 171, baseType: !375, size: 320)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_vert", file: !59, line: 125, size: 320, elements: !376)
!376 = !{!377, !378, !379, !380, !381}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !375, file: !59, line: 126, baseType: !98, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !375, file: !59, line: 127, baseType: !146, size: 64, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !375, file: !59, line: 127, baseType: !146, size: 64, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !375, file: !59, line: 128, baseType: !162, size: 64, offset: 192)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !375, file: !59, line: 128, baseType: !162, size: 64, offset: 256)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_edge", scope: !344, file: !59, line: 172, baseType: !383, size: 192)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_edge", file: !59, line: 130, size: 192, elements: !384)
!384 = !{!385, !386, !387}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !383, file: !59, line: 131, baseType: !162, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !383, file: !59, line: 132, baseType: !146, size: 64, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !383, file: !59, line: 132, baseType: !146, size: 64, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_loop", scope: !344, file: !59, line: 173, baseType: !389, size: 192)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_loop", file: !59, line: 134, size: 192, elements: !390)
!390 = !{!391, !392, !393}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !389, file: !59, line: 135, baseType: !146, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !389, file: !59, line: 136, baseType: !146, size: 64, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !389, file: !59, line: 136, baseType: !146, size: 64, offset: 128)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_edge", scope: !344, file: !59, line: 174, baseType: !395, size: 192)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_edge", file: !59, line: 138, size: 192, elements: !396)
!396 = !{!397, !398, !399}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !395, file: !59, line: 139, baseType: !162, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !395, file: !59, line: 140, baseType: !146, size: 64, offset: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !395, file: !59, line: 140, baseType: !146, size: 64, offset: 128)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_edge", scope: !344, file: !59, line: 175, baseType: !401, size: 64)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_edge", file: !59, line: 142, size: 64, elements: !402)
!402 = !{!403}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !401, file: !59, line: 143, baseType: !162, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_face", scope: !344, file: !59, line: 176, baseType: !405, size: 192)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_face", file: !59, line: 145, size: 192, elements: !406)
!406 = !{!407, !408, !409}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !405, file: !59, line: 146, baseType: !164, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !405, file: !59, line: 147, baseType: !146, size: 64, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !405, file: !59, line: 147, baseType: !146, size: 64, offset: 128)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_face", scope: !344, file: !59, line: 177, baseType: !411, size: 192)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_face", file: !59, line: 149, size: 192, elements: !412)
!412 = !{!413, !414, !415}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !411, file: !59, line: 150, baseType: !164, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !411, file: !59, line: 151, baseType: !146, size: 64, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !411, file: !59, line: 151, baseType: !146, size: 64, offset: 128)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_face", scope: !344, file: !59, line: 178, baseType: !417, size: 192)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_face", file: !59, line: 153, size: 192, elements: !418)
!418 = !{!419, !420, !421}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !417, file: !59, line: 154, baseType: !164, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !417, file: !59, line: 155, baseType: !146, size: 64, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !417, file: !59, line: 155, baseType: !146, size: 64, offset: 128)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !341, file: !59, line: 181, baseType: !90, size: 64, offset: 320)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !341, file: !59, line: 182, baseType: !94, size: 64, offset: 384)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !341, file: !59, line: 184, baseType: !82, size: 32, offset: 448)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !341, file: !59, line: 185, baseType: !88, size: 8, offset: 480)
!426 = !DILocation(line: 1379, column: 9, scope: !181)
!427 = !DILocalVariable(name: "verts_region_len", scope: !181, file: !1, line: 1380, type: !5)
!428 = !DILocation(line: 1380, column: 15, scope: !181)
!429 = !DILocalVariable(name: "faces_result_len", scope: !181, file: !1, line: 1381, type: !5)
!430 = !DILocation(line: 1381, column: 15, scope: !181)
!431 = !DILocalVariable(name: "depth", scope: !181, file: !1, line: 1383, type: !5)
!432 = !DILocation(line: 1383, column: 15, scope: !181)
!433 = !DILocalVariable(name: "w_src", scope: !181, file: !1, line: 1387, type: !434)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "UUIDWalk", file: !1, line: 120, baseType: !435)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UUIDWalk", file: !1, line: 84, size: 960, elements: !436)
!436 = !{!437, !438, !439, !440, !441, !442, !443, !444, !446, !447}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "faces_step", scope: !435, file: !1, line: 87, baseType: !316, size: 128)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "verts_uuid", scope: !435, file: !1, line: 90, baseType: !251, size: 64, offset: 128)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "faces_uuid", scope: !435, file: !1, line: 91, baseType: !251, size: 64, offset: 192)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "link_pool", scope: !435, file: !1, line: 94, baseType: !354, size: 64, offset: 256)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "lbase_pool", scope: !435, file: !1, line: 97, baseType: !354, size: 64, offset: 320)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "step_pool", scope: !435, file: !1, line: 100, baseType: !354, size: 64, offset: 384)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "step_pool_items", scope: !435, file: !1, line: 101, baseType: !354, size: 64, offset: 448)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "use_face_isolate", scope: !435, file: !1, line: 104, baseType: !445, size: 8, offset: 512)
!445 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !435, file: !1, line: 107, baseType: !166, size: 64, offset: 576)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !435, file: !1, line: 118, baseType: !448, size: 320, offset: 640)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !435, file: !1, line: 110, size: 320, elements: !449)
!449 = !{!450, !451, !455, !456, !457}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "verts_uuid", scope: !448, file: !1, line: 111, baseType: !251, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "faces_step", scope: !448, file: !1, line: 112, baseType: !452, size: 64, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSet", file: !172, line: 176, baseType: !454)
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "GSet", file: !172, line: 176, flags: DIFlagFwdDecl)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "faces_from_uuid", scope: !448, file: !1, line: 114, baseType: !251, size: 64, offset: 128)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "rehash_store", scope: !448, file: !1, line: 116, baseType: !169, size: 64, offset: 192)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "rehash_store_len", scope: !448, file: !1, line: 117, baseType: !5, size: 32, offset: 256)
!458 = !DILocation(line: 1387, column: 11, scope: !181)
!459 = !DILocalVariable(name: "w_dst", scope: !181, file: !1, line: 1387, type: !434)
!460 = !DILocation(line: 1387, column: 18, scope: !181)
!461 = !DILocalVariable(name: "fm", scope: !181, file: !1, line: 1391, type: !462)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "UUIDFashMatch", file: !1, line: 1263, baseType: !167)
!464 = !DILocation(line: 1391, column: 17, scope: !181)
!465 = !DILocation(line: 1403, column: 33, scope: !181)
!466 = !DILocation(line: 1403, column: 2, scope: !181)
!467 = !DILocation(line: 1404, column: 22, scope: !181)
!468 = !DILocation(line: 1404, column: 36, scope: !181)
!469 = !DILocation(line: 1404, column: 2, scope: !181)
!470 = !DILocation(line: 1407, column: 28, scope: !181)
!471 = !DILocation(line: 1407, column: 2, scope: !181)
!472 = !DILocation(line: 1411, column: 10, scope: !181)
!473 = !DILocation(line: 1411, column: 24, scope: !181)
!474 = !DILocation(line: 1412, column: 10, scope: !181)
!475 = !DILocation(line: 1410, column: 10, scope: !181)
!476 = !DILocation(line: 1410, column: 8, scope: !181)
!477 = !DILocation(line: 1427, column: 6, scope: !478)
!478 = distinct !DILexicalBlock(scope: !181, file: !1, line: 1427, column: 6)
!479 = !DILocation(line: 1427, column: 12, scope: !478)
!480 = !DILocation(line: 1427, column: 6, scope: !181)
!481 = !DILocation(line: 1431, column: 3, scope: !482)
!482 = distinct !DILexicalBlock(scope: !478, file: !1, line: 1427, column: 21)
!483 = !DILocation(line: 1434, column: 21, scope: !181)
!484 = !DILocation(line: 1434, column: 2, scope: !181)
!485 = !DILocation(line: 1437, column: 6, scope: !486)
!486 = distinct !DILexicalBlock(scope: !181, file: !1, line: 1437, column: 6)
!487 = !DILocation(line: 1437, column: 12, scope: !486)
!488 = !DILocation(line: 1437, column: 6, scope: !181)
!489 = !DILocation(line: 1438, column: 32, scope: !490)
!490 = distinct !DILexicalBlock(scope: !486, file: !1, line: 1437, column: 17)
!491 = !DILocation(line: 1438, column: 36, scope: !490)
!492 = !DILocation(line: 1438, column: 8, scope: !490)
!493 = !DILocation(line: 1438, column: 6, scope: !490)
!494 = !DILocation(line: 1439, column: 2, scope: !490)
!495 = !DILocation(line: 1441, column: 6, scope: !496)
!496 = distinct !DILexicalBlock(scope: !486, file: !1, line: 1440, column: 7)
!497 = !DILocation(line: 1446, column: 27, scope: !181)
!498 = !DILocation(line: 1446, column: 45, scope: !181)
!499 = !DILocation(line: 1446, column: 2, scope: !181)
!500 = !DILocation(line: 1447, column: 27, scope: !181)
!501 = !DILocation(line: 1447, column: 45, scope: !181)
!502 = !DILocation(line: 1447, column: 2, scope: !181)
!503 = !DILocation(line: 1450, column: 2, scope: !504)
!504 = distinct !DILexicalBlock(scope: !181, file: !1, line: 1450, column: 2)
!505 = !DILocation(line: 1450, column: 2, scope: !506)
!506 = distinct !DILexicalBlock(scope: !504, file: !1, line: 1450, column: 2)
!507 = !DILocalVariable(name: "faces_result", scope: !508, file: !1, line: 1451, type: !209)
!508 = distinct !DILexicalBlock(scope: !506, file: !1, line: 1450, column: 52)
!509 = !DILocation(line: 1451, column: 12, scope: !508)
!510 = !DILocalVariable(name: "faces_result_len_out", scope: !508, file: !1, line: 1452, type: !5)
!511 = !DILocation(line: 1452, column: 16, scope: !508)
!512 = !DILocation(line: 1454, column: 7, scope: !513)
!513 = distinct !DILexicalBlock(scope: !508, file: !1, line: 1454, column: 7)
!514 = !DILocation(line: 1454, column: 7, scope: !508)
!515 = !DILocation(line: 1455, column: 4, scope: !516)
!516 = distinct !DILexicalBlock(scope: !513, file: !1, line: 1454, column: 46)
!517 = !DILocation(line: 1459, column: 7, scope: !518)
!518 = distinct !DILexicalBlock(scope: !508, file: !1, line: 1459, column: 7)
!519 = !DILocation(line: 1459, column: 10, scope: !518)
!520 = !DILocation(line: 1459, column: 45, scope: !518)
!521 = !DILocation(line: 1459, column: 49, scope: !518)
!522 = !DILocation(line: 1459, column: 56, scope: !518)
!523 = !DILocation(line: 1459, column: 14, scope: !518)
!524 = !DILocation(line: 1459, column: 7, scope: !508)
!525 = !DILocation(line: 1460, column: 4, scope: !526)
!526 = distinct !DILexicalBlock(scope: !518, file: !1, line: 1459, column: 64)
!527 = !DILocation(line: 1472, column: 11, scope: !508)
!528 = !DILocation(line: 1472, column: 18, scope: !508)
!529 = !DILocation(line: 1473, column: 11, scope: !508)
!530 = !DILocation(line: 1474, column: 11, scope: !508)
!531 = !DILocation(line: 1468, column: 18, scope: !508)
!532 = !DILocation(line: 1468, column: 16, scope: !508)
!533 = !DILocation(line: 1478, column: 7, scope: !534)
!534 = distinct !DILexicalBlock(scope: !508, file: !1, line: 1478, column: 7)
!535 = !DILocation(line: 1478, column: 7, scope: !508)
!536 = !DILocalVariable(name: "link", scope: !537, file: !1, line: 1479, type: !538)
!537 = distinct !DILexicalBlock(scope: !534, file: !1, line: 1478, column: 21)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "LinkData", file: !317, line: 66, baseType: !540)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LinkData", file: !317, line: 63, size: 192, elements: !541)
!541 = !{!542, !544, !545}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !540, file: !317, line: 64, baseType: !543, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !540, file: !317, line: 64, baseType: !543, size: 64, offset: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !540, file: !317, line: 65, baseType: !81, size: 64, offset: 128)
!546 = !DILocation(line: 1479, column: 14, scope: !537)
!547 = !DILocation(line: 1481, column: 24, scope: !537)
!548 = !DILocation(line: 1481, column: 38, scope: !537)
!549 = !DILocation(line: 1481, column: 4, scope: !537)
!550 = !DILocation(line: 1483, column: 28, scope: !537)
!551 = !DILocation(line: 1483, column: 11, scope: !537)
!552 = !DILocation(line: 1483, column: 9, scope: !537)
!553 = !DILocation(line: 1484, column: 16, scope: !537)
!554 = !DILocation(line: 1484, column: 32, scope: !537)
!555 = !DILocation(line: 1484, column: 4, scope: !537)
!556 = !DILocation(line: 1485, column: 21, scope: !537)
!557 = !DILocation(line: 1486, column: 3, scope: !537)
!558 = !DILocation(line: 1487, column: 2, scope: !508)
!559 = distinct !{!559, !503, !560}
!560 = !DILocation(line: 1487, column: 2, scope: !504)
!561 = !DILocation(line: 1490, column: 2, scope: !181)
!562 = !DILocation(line: 1491, column: 2, scope: !181)
!563 = !DILocation(line: 1497, column: 6, scope: !564)
!564 = distinct !DILexicalBlock(scope: !181, file: !1, line: 1497, column: 6)
!565 = !DILocation(line: 1497, column: 6, scope: !181)
!566 = !DILocation(line: 1498, column: 28, scope: !567)
!567 = distinct !DILexicalBlock(scope: !564, file: !1, line: 1497, column: 10)
!568 = !DILocation(line: 1498, column: 3, scope: !567)
!569 = !DILocation(line: 1499, column: 2, scope: !567)
!570 = !DILocation(line: 1510, column: 14, scope: !181)
!571 = !DILocation(line: 1510, column: 2, scope: !181)
!572 = !DILocation(line: 1511, column: 1, scope: !181)
!573 = distinct !DISubprogram(name: "bm_face_array_visit", scope: !1, file: !1, line: 905, type: !574, scopeLine: 909, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !326)
!574 = !DISubroutineType(types: !575)
!575 = !{null, !209, !576, !577, !445}
!576 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!578 = !DILocalVariable(name: "faces", arg: 1, scope: !573, file: !1, line: 906, type: !209)
!579 = !DILocation(line: 906, column: 18, scope: !573)
!580 = !DILocalVariable(name: "faces_len", arg: 2, scope: !573, file: !1, line: 906, type: !576)
!581 = !DILocation(line: 906, column: 44, scope: !573)
!582 = !DILocalVariable(name: "r_verts_len", arg: 3, scope: !573, file: !1, line: 907, type: !577)
!583 = !DILocation(line: 907, column: 23, scope: !573)
!584 = !DILocalVariable(name: "visit_faces", arg: 4, scope: !573, file: !1, line: 908, type: !445)
!585 = !DILocation(line: 908, column: 14, scope: !573)
!586 = !DILocalVariable(name: "verts_len", scope: !573, file: !1, line: 910, type: !5)
!587 = !DILocation(line: 910, column: 15, scope: !573)
!588 = !DILocalVariable(name: "i", scope: !573, file: !1, line: 911, type: !5)
!589 = !DILocation(line: 911, column: 15, scope: !573)
!590 = !DILocation(line: 912, column: 9, scope: !591)
!591 = distinct !DILexicalBlock(scope: !573, file: !1, line: 912, column: 2)
!592 = !DILocation(line: 912, column: 7, scope: !591)
!593 = !DILocation(line: 912, column: 14, scope: !594)
!594 = distinct !DILexicalBlock(scope: !591, file: !1, line: 912, column: 2)
!595 = !DILocation(line: 912, column: 18, scope: !594)
!596 = !DILocation(line: 912, column: 16, scope: !594)
!597 = !DILocation(line: 912, column: 2, scope: !591)
!598 = !DILocalVariable(name: "f", scope: !599, file: !1, line: 913, type: !164)
!599 = distinct !DILexicalBlock(scope: !594, file: !1, line: 912, column: 34)
!600 = !DILocation(line: 913, column: 11, scope: !599)
!601 = !DILocation(line: 913, column: 15, scope: !599)
!602 = !DILocation(line: 913, column: 21, scope: !599)
!603 = !DILocalVariable(name: "l_iter", scope: !599, file: !1, line: 914, type: !146)
!604 = !DILocation(line: 914, column: 11, scope: !599)
!605 = !DILocalVariable(name: "l_first", scope: !599, file: !1, line: 914, type: !146)
!606 = !DILocation(line: 914, column: 20, scope: !599)
!607 = !DILocation(line: 915, column: 22, scope: !599)
!608 = !DILocation(line: 915, column: 20, scope: !599)
!609 = !DILocation(line: 915, column: 10, scope: !599)
!610 = !DILocation(line: 916, column: 3, scope: !599)
!611 = !DILocation(line: 917, column: 8, scope: !612)
!612 = distinct !DILexicalBlock(scope: !613, file: !1, line: 917, column: 8)
!613 = distinct !DILexicalBlock(scope: !599, file: !1, line: 916, column: 6)
!614 = !DILocation(line: 917, column: 8, scope: !613)
!615 = !DILocation(line: 918, column: 10, scope: !616)
!616 = distinct !DILexicalBlock(scope: !617, file: !1, line: 918, column: 9)
!617 = distinct !DILexicalBlock(scope: !612, file: !1, line: 917, column: 21)
!618 = !DILocation(line: 918, column: 9, scope: !617)
!619 = !DILocation(line: 919, column: 16, scope: !620)
!620 = distinct !DILexicalBlock(scope: !616, file: !1, line: 918, column: 53)
!621 = !DILocation(line: 920, column: 5, scope: !620)
!622 = !DILocation(line: 921, column: 4, scope: !617)
!623 = !DILocation(line: 923, column: 4, scope: !613)
!624 = !DILocation(line: 924, column: 4, scope: !613)
!625 = !DILocation(line: 925, column: 3, scope: !613)
!626 = !DILocation(line: 925, column: 22, scope: !599)
!627 = !DILocation(line: 925, column: 30, scope: !599)
!628 = !DILocation(line: 925, column: 20, scope: !599)
!629 = !DILocation(line: 925, column: 39, scope: !599)
!630 = !DILocation(line: 925, column: 36, scope: !599)
!631 = distinct !{!631, !610, !632}
!632 = !DILocation(line: 925, column: 46, scope: !599)
!633 = !DILocation(line: 927, column: 7, scope: !634)
!634 = distinct !DILexicalBlock(scope: !599, file: !1, line: 927, column: 7)
!635 = !DILocation(line: 927, column: 7, scope: !599)
!636 = !DILocation(line: 928, column: 4, scope: !637)
!637 = distinct !DILexicalBlock(scope: !634, file: !1, line: 927, column: 20)
!638 = !DILocation(line: 929, column: 3, scope: !637)
!639 = !DILocation(line: 930, column: 2, scope: !599)
!640 = !DILocation(line: 912, column: 30, scope: !594)
!641 = !DILocation(line: 912, column: 2, scope: !594)
!642 = distinct !{!642, !597, !643}
!643 = !DILocation(line: 930, column: 2, scope: !591)
!644 = !DILocation(line: 932, column: 6, scope: !645)
!645 = distinct !DILexicalBlock(scope: !573, file: !1, line: 932, column: 6)
!646 = !DILocation(line: 932, column: 6, scope: !573)
!647 = !DILocation(line: 933, column: 18, scope: !648)
!648 = distinct !DILexicalBlock(scope: !645, file: !1, line: 932, column: 19)
!649 = !DILocation(line: 933, column: 4, scope: !648)
!650 = !DILocation(line: 933, column: 16, scope: !648)
!651 = !DILocation(line: 934, column: 2, scope: !648)
!652 = !DILocation(line: 935, column: 1, scope: !573)
!653 = distinct !DISubprogram(name: "bm_face_region_pivot_edge_find", scope: !1, file: !1, line: 1077, type: !654, scopeLine: 1081, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !326)
!654 = !DISubroutineType(types: !655)
!655 = !{!162, !209, !5, !5, !577}
!656 = !DILocalVariable(name: "faces_region", arg: 1, scope: !653, file: !1, line: 1078, type: !209)
!657 = !DILocation(line: 1078, column: 18, scope: !653)
!658 = !DILocalVariable(name: "faces_region_len", arg: 2, scope: !653, file: !1, line: 1078, type: !5)
!659 = !DILocation(line: 1078, column: 45, scope: !653)
!660 = !DILocalVariable(name: "verts_region_len", arg: 3, scope: !653, file: !1, line: 1079, type: !5)
!661 = !DILocation(line: 1079, column: 22, scope: !653)
!662 = !DILocalVariable(name: "r_depth", arg: 4, scope: !653, file: !1, line: 1080, type: !577)
!663 = !DILocation(line: 1080, column: 23, scope: !653)
!664 = !DILocalVariable(name: "vert_queue_prev", scope: !653, file: !1, line: 1085, type: !665)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "LinkNode", file: !200, line: 48, baseType: !667)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !200, line: 45, size: 128, elements: !668)
!668 = !{!669, !671}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !667, file: !200, line: 46, baseType: !670, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !667, file: !200, line: 47, baseType: !81, size: 64, offset: 64)
!672 = !DILocation(line: 1085, column: 2, scope: !653)
!673 = !DILocalVariable(name: "_vert_queue_prev_pool", scope: !653, file: !1, line: 1085, type: !354)
!674 = !DILocalVariable(name: "_vert_queue_prev_type", scope: !653, file: !1, line: 1085, type: !98)
!675 = !DILocalVariable(name: "vert_queue_next", scope: !653, file: !1, line: 1086, type: !665)
!676 = !DILocation(line: 1086, column: 2, scope: !653)
!677 = !DILocalVariable(name: "_vert_queue_next_pool", scope: !653, file: !1, line: 1086, type: !354)
!678 = !DILocalVariable(name: "_vert_queue_next_type", scope: !653, file: !1, line: 1086, type: !98)
!679 = !DILocalVariable(name: "gh", scope: !653, file: !1, line: 1088, type: !251)
!680 = !DILocation(line: 1088, column: 9, scope: !653)
!681 = !DILocation(line: 1088, column: 14, scope: !653)
!682 = !DILocalVariable(name: "i", scope: !653, file: !1, line: 1089, type: !5)
!683 = !DILocation(line: 1089, column: 15, scope: !653)
!684 = !DILocalVariable(name: "e_pivot", scope: !653, file: !1, line: 1091, type: !162)
!685 = !DILocation(line: 1091, column: 10, scope: !653)
!686 = !DILocalVariable(name: "e_pivot_fallback", scope: !653, file: !1, line: 1093, type: !162)
!687 = !DILocation(line: 1093, column: 10, scope: !653)
!688 = !DILocalVariable(name: "pass", scope: !653, file: !1, line: 1095, type: !84)
!689 = !DILocation(line: 1095, column: 11, scope: !653)
!690 = !DILocalVariable(name: "vert_queue_used", scope: !653, file: !1, line: 1098, type: !5)
!691 = !DILocation(line: 1098, column: 15, scope: !653)
!692 = !DILocation(line: 1100, column: 2, scope: !693)
!693 = distinct !DILexicalBlock(scope: !653, file: !1, line: 1100, column: 2)
!694 = !DILocation(line: 1101, column: 2, scope: !695)
!695 = distinct !DILexicalBlock(scope: !653, file: !1, line: 1101, column: 2)
!696 = !DILocation(line: 1104, column: 9, scope: !697)
!697 = distinct !DILexicalBlock(scope: !653, file: !1, line: 1104, column: 2)
!698 = !DILocation(line: 1104, column: 7, scope: !697)
!699 = !DILocation(line: 1104, column: 14, scope: !700)
!700 = distinct !DILexicalBlock(scope: !697, file: !1, line: 1104, column: 2)
!701 = !DILocation(line: 1104, column: 18, scope: !700)
!702 = !DILocation(line: 1104, column: 16, scope: !700)
!703 = !DILocation(line: 1104, column: 2, scope: !697)
!704 = !DILocalVariable(name: "f", scope: !705, file: !1, line: 1105, type: !164)
!705 = distinct !DILexicalBlock(scope: !700, file: !1, line: 1104, column: 41)
!706 = !DILocation(line: 1105, column: 11, scope: !705)
!707 = !DILocation(line: 1105, column: 15, scope: !705)
!708 = !DILocation(line: 1105, column: 28, scope: !705)
!709 = !DILocalVariable(name: "l_iter", scope: !705, file: !1, line: 1107, type: !146)
!710 = !DILocation(line: 1107, column: 11, scope: !705)
!711 = !DILocalVariable(name: "l_first", scope: !705, file: !1, line: 1107, type: !146)
!712 = !DILocation(line: 1107, column: 20, scope: !705)
!713 = !DILocation(line: 1108, column: 22, scope: !705)
!714 = !DILocation(line: 1108, column: 20, scope: !705)
!715 = !DILocation(line: 1108, column: 10, scope: !705)
!716 = !DILocation(line: 1109, column: 3, scope: !705)
!717 = !DILocalVariable(name: "e", scope: !718, file: !1, line: 1110, type: !162)
!718 = distinct !DILexicalBlock(scope: !705, file: !1, line: 1109, column: 6)
!719 = !DILocation(line: 1110, column: 12, scope: !718)
!720 = !DILocation(line: 1110, column: 16, scope: !718)
!721 = !DILocation(line: 1110, column: 24, scope: !718)
!722 = !DILocation(line: 1111, column: 35, scope: !723)
!723 = distinct !DILexicalBlock(scope: !718, file: !1, line: 1111, column: 8)
!724 = !DILocation(line: 1111, column: 8, scope: !723)
!725 = !DILocation(line: 1111, column: 8, scope: !718)
!726 = !DILocalVariable(name: "j", scope: !727, file: !1, line: 1112, type: !5)
!727 = distinct !DILexicalBlock(scope: !723, file: !1, line: 1111, column: 39)
!728 = !DILocation(line: 1112, column: 18, scope: !727)
!729 = !DILocation(line: 1113, column: 12, scope: !730)
!730 = distinct !DILexicalBlock(scope: !727, file: !1, line: 1113, column: 5)
!731 = !DILocation(line: 1113, column: 10, scope: !730)
!732 = !DILocation(line: 1113, column: 17, scope: !733)
!733 = distinct !DILexicalBlock(scope: !730, file: !1, line: 1113, column: 5)
!734 = !DILocation(line: 1113, column: 19, scope: !733)
!735 = !DILocation(line: 1113, column: 5, scope: !730)
!736 = !DILocation(line: 1114, column: 28, scope: !737)
!737 = distinct !DILexicalBlock(scope: !738, file: !1, line: 1114, column: 10)
!738 = distinct !DILexicalBlock(scope: !733, file: !1, line: 1113, column: 29)
!739 = !DILocation(line: 1114, column: 34, scope: !737)
!740 = !DILocation(line: 1114, column: 37, scope: !737)
!741 = !DILocation(line: 1114, column: 41, scope: !737)
!742 = !DILocation(line: 1114, column: 32, scope: !737)
!743 = !DILocation(line: 1114, column: 11, scope: !737)
!744 = !DILocation(line: 1114, column: 10, scope: !738)
!745 = !DILocalVariable(name: "v_id", scope: !746, file: !1, line: 1115, type: !84)
!746 = distinct !DILexicalBlock(scope: !737, file: !1, line: 1114, column: 46)
!747 = !DILocation(line: 1115, column: 16, scope: !746)
!748 = !DILocation(line: 1115, column: 57, scope: !746)
!749 = !DILocation(line: 1115, column: 60, scope: !746)
!750 = !DILocation(line: 1115, column: 64, scope: !746)
!751 = !DILocation(line: 1115, column: 55, scope: !746)
!752 = !DILocation(line: 1115, column: 23, scope: !746)
!753 = !DILocation(line: 1116, column: 24, scope: !746)
!754 = !DILocation(line: 1116, column: 30, scope: !746)
!755 = !DILocation(line: 1116, column: 33, scope: !746)
!756 = !DILocation(line: 1116, column: 37, scope: !746)
!757 = !DILocation(line: 1116, column: 28, scope: !746)
!758 = !DILocation(line: 1116, column: 49, scope: !746)
!759 = !DILocation(line: 1116, column: 41, scope: !746)
!760 = !DILocation(line: 1116, column: 7, scope: !746)
!761 = !DILocation(line: 1117, column: 7, scope: !746)
!762 = !DILocation(line: 1118, column: 23, scope: !746)
!763 = !DILocation(line: 1119, column: 6, scope: !746)
!764 = !DILocation(line: 1120, column: 5, scope: !738)
!765 = !DILocation(line: 1113, column: 25, scope: !733)
!766 = !DILocation(line: 1113, column: 5, scope: !733)
!767 = distinct !{!767, !735, !768}
!768 = !DILocation(line: 1120, column: 5, scope: !730)
!769 = !DILocation(line: 1121, column: 4, scope: !727)
!770 = !DILocation(line: 1124, column: 24, scope: !771)
!771 = distinct !DILexicalBlock(scope: !723, file: !1, line: 1122, column: 9)
!772 = !DILocation(line: 1124, column: 22, scope: !771)
!773 = !DILocation(line: 1126, column: 3, scope: !718)
!774 = !DILocation(line: 1126, column: 22, scope: !705)
!775 = !DILocation(line: 1126, column: 30, scope: !705)
!776 = !DILocation(line: 1126, column: 20, scope: !705)
!777 = !DILocation(line: 1126, column: 39, scope: !705)
!778 = !DILocation(line: 1126, column: 36, scope: !705)
!779 = distinct !{!779, !716, !780}
!780 = !DILocation(line: 1126, column: 46, scope: !705)
!781 = !DILocation(line: 1127, column: 2, scope: !705)
!782 = !DILocation(line: 1104, column: 37, scope: !700)
!783 = !DILocation(line: 1104, column: 2, scope: !700)
!784 = distinct !{!784, !703, !785}
!785 = !DILocation(line: 1127, column: 2, scope: !697)
!786 = !DILocation(line: 1129, column: 2, scope: !653)
!787 = !DILocation(line: 1129, column: 9, scope: !653)
!788 = !DILocalVariable(name: "v", scope: !789, file: !1, line: 1130, type: !98)
!789 = distinct !DILexicalBlock(scope: !653, file: !1, line: 1129, column: 46)
!790 = !DILocation(line: 1130, column: 11, scope: !789)
!791 = !DILocation(line: 1131, column: 3, scope: !789)
!792 = !DILocation(line: 1131, column: 15, scope: !789)
!793 = !DILocation(line: 1131, column: 13, scope: !789)
!794 = !DILocalVariable(name: "eiter", scope: !795, file: !1, line: 1132, type: !340)
!795 = distinct !DILexicalBlock(scope: !789, file: !1, line: 1131, column: 52)
!796 = !DILocation(line: 1132, column: 11, scope: !795)
!797 = !DILocalVariable(name: "e", scope: !795, file: !1, line: 1133, type: !162)
!798 = !DILocation(line: 1133, column: 12, scope: !795)
!799 = !DILocation(line: 1136, column: 4, scope: !800)
!800 = distinct !DILexicalBlock(scope: !795, file: !1, line: 1136, column: 4)
!801 = !DILocation(line: 1136, column: 4, scope: !802)
!802 = distinct !DILexicalBlock(scope: !800, file: !1, line: 1136, column: 4)
!803 = !DILocation(line: 1137, column: 9, scope: !804)
!804 = distinct !DILexicalBlock(scope: !805, file: !1, line: 1137, column: 9)
!805 = distinct !DILexicalBlock(scope: !802, file: !1, line: 1136, column: 50)
!806 = !DILocation(line: 1137, column: 9, scope: !805)
!807 = !DILocalVariable(name: "v_other", scope: !808, file: !1, line: 1138, type: !98)
!808 = distinct !DILexicalBlock(scope: !804, file: !1, line: 1137, column: 44)
!809 = !DILocation(line: 1138, column: 14, scope: !808)
!810 = !DILocation(line: 1138, column: 43, scope: !808)
!811 = !DILocation(line: 1138, column: 46, scope: !808)
!812 = !DILocation(line: 1138, column: 24, scope: !808)
!813 = !DILocation(line: 1139, column: 10, scope: !814)
!814 = distinct !DILexicalBlock(scope: !808, file: !1, line: 1139, column: 10)
!815 = !DILocation(line: 1139, column: 10, scope: !808)
!816 = !DILocation(line: 1140, column: 29, scope: !817)
!817 = distinct !DILexicalBlock(scope: !818, file: !1, line: 1140, column: 11)
!818 = distinct !DILexicalBlock(scope: !814, file: !1, line: 1139, column: 51)
!819 = !DILocation(line: 1140, column: 33, scope: !817)
!820 = !DILocation(line: 1140, column: 12, scope: !817)
!821 = !DILocation(line: 1140, column: 11, scope: !818)
!822 = !DILocalVariable(name: "v_id_other", scope: !823, file: !1, line: 1142, type: !824)
!823 = distinct !DILexicalBlock(scope: !817, file: !1, line: 1140, column: 43)
!824 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !84)
!825 = !DILocation(line: 1142, column: 23, scope: !823)
!826 = !DILocation(line: 1142, column: 65, scope: !823)
!827 = !DILocation(line: 1142, column: 69, scope: !823)
!828 = !DILocation(line: 1142, column: 37, scope: !823)
!829 = !DILocation(line: 1142, column: 36, scope: !823)
!830 = !DILocation(line: 1143, column: 25, scope: !823)
!831 = !DILocation(line: 1143, column: 29, scope: !823)
!832 = !DILocation(line: 1143, column: 46, scope: !823)
!833 = !DILocation(line: 1143, column: 38, scope: !823)
!834 = !DILocation(line: 1143, column: 8, scope: !823)
!835 = !DILocation(line: 1144, column: 8, scope: !823)
!836 = !DILocation(line: 1145, column: 24, scope: !823)
!837 = !DILocation(line: 1146, column: 7, scope: !823)
!838 = !DILocation(line: 1147, column: 6, scope: !818)
!839 = !DILocation(line: 1148, column: 5, scope: !808)
!840 = !DILocation(line: 1149, column: 4, scope: !805)
!841 = distinct !{!841, !799, !842}
!842 = !DILocation(line: 1149, column: 4, scope: !800)
!843 = distinct !{!843, !791, !844}
!844 = !DILocation(line: 1150, column: 3, scope: !789)
!845 = !DILocalVariable(name: "v_link", scope: !846, file: !1, line: 1154, type: !665)
!846 = distinct !DILexicalBlock(scope: !789, file: !1, line: 1153, column: 3)
!847 = !DILocation(line: 1154, column: 14, scope: !846)
!848 = !DILocation(line: 1155, column: 18, scope: !849)
!849 = distinct !DILexicalBlock(scope: !846, file: !1, line: 1155, column: 4)
!850 = !DILocation(line: 1155, column: 16, scope: !849)
!851 = !DILocation(line: 1155, column: 9, scope: !849)
!852 = !DILocation(line: 1155, column: 35, scope: !853)
!853 = distinct !DILexicalBlock(scope: !849, file: !1, line: 1155, column: 4)
!854 = !DILocation(line: 1155, column: 4, scope: !849)
!855 = !DILocalVariable(name: "v_id_p", scope: !856, file: !1, line: 1156, type: !83)
!856 = distinct !DILexicalBlock(scope: !853, file: !1, line: 1155, column: 66)
!857 = !DILocation(line: 1156, column: 15, scope: !856)
!858 = !DILocation(line: 1156, column: 55, scope: !856)
!859 = !DILocation(line: 1156, column: 59, scope: !856)
!860 = !DILocation(line: 1156, column: 67, scope: !856)
!861 = !DILocation(line: 1156, column: 36, scope: !856)
!862 = !DILocation(line: 1156, column: 24, scope: !856)
!863 = !DILocation(line: 1157, column: 18, scope: !856)
!864 = !DILocation(line: 1157, column: 17, scope: !856)
!865 = !DILocation(line: 1157, column: 15, scope: !856)
!866 = !DILocation(line: 1157, column: 6, scope: !856)
!867 = !DILocation(line: 1157, column: 13, scope: !856)
!868 = !DILocation(line: 1159, column: 4, scope: !856)
!869 = !DILocation(line: 1155, column: 52, scope: !853)
!870 = !DILocation(line: 1155, column: 60, scope: !853)
!871 = !DILocation(line: 1155, column: 50, scope: !853)
!872 = !DILocation(line: 1155, column: 4, scope: !853)
!873 = distinct !{!873, !854, !874}
!874 = !DILocation(line: 1159, column: 4, scope: !849)
!875 = !DILocalVariable(name: "sw_ap", scope: !876, file: !1, line: 1162, type: !665)
!876 = distinct !DILexicalBlock(scope: !877, file: !1, line: 1162, column: 3)
!877 = distinct !DILexicalBlock(scope: !789, file: !1, line: 1162, column: 3)
!878 = !DILocation(line: 1162, column: 3, scope: !876)
!879 = !DILocalVariable(name: "sw_ap", scope: !880, file: !1, line: 1162, type: !354)
!880 = distinct !DILexicalBlock(scope: !877, file: !1, line: 1162, column: 3)
!881 = !DILocation(line: 1162, column: 3, scope: !880)
!882 = !DILocation(line: 1163, column: 8, scope: !789)
!883 = !DILocation(line: 1165, column: 7, scope: !884)
!884 = distinct !DILexicalBlock(scope: !789, file: !1, line: 1165, column: 7)
!885 = !DILocation(line: 1165, column: 26, scope: !884)
!886 = !DILocation(line: 1165, column: 23, scope: !884)
!887 = !DILocation(line: 1165, column: 7, scope: !789)
!888 = !DILocation(line: 1166, column: 4, scope: !889)
!889 = distinct !DILexicalBlock(scope: !884, file: !1, line: 1165, column: 44)
!890 = distinct !{!890, !786, !891}
!891 = !DILocation(line: 1168, column: 2, scope: !653)
!892 = !DILocation(line: 1170, column: 6, scope: !893)
!893 = distinct !DILexicalBlock(scope: !653, file: !1, line: 1170, column: 6)
!894 = !DILocation(line: 1170, column: 42, scope: !893)
!895 = !DILocation(line: 1170, column: 6, scope: !653)
!896 = !DILocalVariable(name: "v_link", scope: !897, file: !1, line: 1172, type: !665)
!897 = distinct !DILexicalBlock(scope: !893, file: !1, line: 1170, column: 48)
!898 = !DILocation(line: 1172, column: 13, scope: !897)
!899 = !DILocalVariable(name: "e_pivot_best", scope: !897, file: !1, line: 1173, type: !162)
!900 = !DILocation(line: 1173, column: 11, scope: !897)
!901 = !DILocalVariable(name: "e_pivot_best_id", scope: !897, file: !1, line: 1174, type: !902)
!902 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 128, elements: !903)
!903 = !{!904}
!904 = !DISubrange(count: 2)
!905 = !DILocation(line: 1174, column: 12, scope: !897)
!906 = !DILocation(line: 1177, column: 17, scope: !907)
!907 = distinct !DILexicalBlock(scope: !897, file: !1, line: 1177, column: 3)
!908 = !DILocation(line: 1177, column: 15, scope: !907)
!909 = !DILocation(line: 1177, column: 8, scope: !907)
!910 = !DILocation(line: 1177, column: 34, scope: !911)
!911 = distinct !DILexicalBlock(scope: !907, file: !1, line: 1177, column: 3)
!912 = !DILocation(line: 1177, column: 3, scope: !907)
!913 = !DILocalVariable(name: "v", scope: !914, file: !1, line: 1178, type: !98)
!914 = distinct !DILexicalBlock(scope: !911, file: !1, line: 1177, column: 65)
!915 = !DILocation(line: 1178, column: 12, scope: !914)
!916 = !DILocation(line: 1178, column: 16, scope: !914)
!917 = !DILocation(line: 1178, column: 24, scope: !914)
!918 = !DILocation(line: 1179, column: 4, scope: !914)
!919 = !DILocation(line: 1180, column: 3, scope: !914)
!920 = !DILocation(line: 1177, column: 51, scope: !911)
!921 = !DILocation(line: 1177, column: 59, scope: !911)
!922 = !DILocation(line: 1177, column: 49, scope: !911)
!923 = !DILocation(line: 1177, column: 3, scope: !911)
!924 = distinct !{!924, !912, !925}
!925 = !DILocation(line: 1180, column: 3, scope: !907)
!926 = !DILocation(line: 1183, column: 17, scope: !927)
!927 = distinct !DILexicalBlock(scope: !897, file: !1, line: 1183, column: 3)
!928 = !DILocation(line: 1183, column: 15, scope: !927)
!929 = !DILocation(line: 1183, column: 8, scope: !927)
!930 = !DILocation(line: 1183, column: 34, scope: !931)
!931 = distinct !DILexicalBlock(scope: !927, file: !1, line: 1183, column: 3)
!932 = !DILocation(line: 1183, column: 3, scope: !927)
!933 = !DILocalVariable(name: "eiter", scope: !934, file: !1, line: 1184, type: !340)
!934 = distinct !DILexicalBlock(scope: !931, file: !1, line: 1183, column: 65)
!935 = !DILocation(line: 1184, column: 11, scope: !934)
!936 = !DILocalVariable(name: "e_test", scope: !934, file: !1, line: 1185, type: !162)
!937 = !DILocation(line: 1185, column: 12, scope: !934)
!938 = !DILocalVariable(name: "v", scope: !934, file: !1, line: 1187, type: !98)
!939 = !DILocation(line: 1187, column: 12, scope: !934)
!940 = !DILocation(line: 1187, column: 16, scope: !934)
!941 = !DILocation(line: 1187, column: 24, scope: !934)
!942 = !DILocation(line: 1188, column: 4, scope: !934)
!943 = !DILocation(line: 1190, column: 4, scope: !944)
!944 = distinct !DILexicalBlock(scope: !934, file: !1, line: 1190, column: 4)
!945 = !DILocation(line: 1190, column: 4, scope: !946)
!946 = distinct !DILexicalBlock(scope: !944, file: !1, line: 1190, column: 4)
!947 = !DILocation(line: 1191, column: 9, scope: !948)
!948 = distinct !DILexicalBlock(scope: !949, file: !1, line: 1191, column: 9)
!949 = distinct !DILexicalBlock(scope: !946, file: !1, line: 1190, column: 55)
!950 = !DILocation(line: 1191, column: 9, scope: !949)
!951 = !DILocalVariable(name: "v_other", scope: !952, file: !1, line: 1192, type: !98)
!952 = distinct !DILexicalBlock(scope: !948, file: !1, line: 1191, column: 49)
!953 = !DILocation(line: 1192, column: 14, scope: !952)
!954 = !DILocation(line: 1192, column: 43, scope: !952)
!955 = !DILocation(line: 1192, column: 51, scope: !952)
!956 = !DILocation(line: 1192, column: 24, scope: !952)
!957 = !DILocation(line: 1193, column: 10, scope: !958)
!958 = distinct !DILexicalBlock(scope: !952, file: !1, line: 1193, column: 10)
!959 = !DILocation(line: 1193, column: 50, scope: !958)
!960 = !DILocation(line: 1193, column: 10, scope: !952)
!961 = !DILocation(line: 1194, column: 42, scope: !962)
!962 = distinct !DILexicalBlock(scope: !958, file: !1, line: 1193, column: 60)
!963 = !DILocation(line: 1194, column: 46, scope: !962)
!964 = !DILocation(line: 1194, column: 69, scope: !962)
!965 = !DILocation(line: 1194, column: 7, scope: !962)
!966 = !DILocation(line: 1195, column: 6, scope: !962)
!967 = !DILocation(line: 1196, column: 5, scope: !952)
!968 = !DILocation(line: 1197, column: 4, scope: !949)
!969 = distinct !{!969, !943, !970}
!970 = !DILocation(line: 1197, column: 4, scope: !944)
!971 = !DILocation(line: 1198, column: 3, scope: !934)
!972 = !DILocation(line: 1183, column: 51, scope: !931)
!973 = !DILocation(line: 1183, column: 59, scope: !931)
!974 = !DILocation(line: 1183, column: 49, scope: !931)
!975 = !DILocation(line: 1183, column: 3, scope: !931)
!976 = distinct !{!976, !932, !977}
!977 = !DILocation(line: 1198, column: 3, scope: !927)
!978 = !DILocation(line: 1200, column: 13, scope: !897)
!979 = !DILocation(line: 1200, column: 11, scope: !897)
!980 = !DILocation(line: 1201, column: 2, scope: !897)
!981 = !DILocation(line: 1203, column: 7, scope: !982)
!982 = distinct !DILexicalBlock(scope: !653, file: !1, line: 1203, column: 6)
!983 = !DILocation(line: 1203, column: 15, scope: !982)
!984 = !DILocation(line: 1203, column: 24, scope: !982)
!985 = !DILocation(line: 1203, column: 27, scope: !982)
!986 = !DILocation(line: 1203, column: 6, scope: !653)
!987 = !DILocalVariable(name: "e_pivot_best", scope: !988, file: !1, line: 1205, type: !162)
!988 = distinct !DILexicalBlock(scope: !982, file: !1, line: 1203, column: 64)
!989 = !DILocation(line: 1205, column: 11, scope: !988)
!990 = !DILocalVariable(name: "e_pivot_best_id", scope: !988, file: !1, line: 1206, type: !902)
!991 = !DILocation(line: 1206, column: 12, scope: !988)
!992 = !DILocalVariable(name: "v_link", scope: !988, file: !1, line: 1208, type: !665)
!993 = !DILocation(line: 1208, column: 13, scope: !988)
!994 = !DILocation(line: 1213, column: 8, scope: !988)
!995 = !DILocation(line: 1215, column: 17, scope: !996)
!996 = distinct !DILexicalBlock(scope: !988, file: !1, line: 1215, column: 3)
!997 = !DILocation(line: 1215, column: 15, scope: !996)
!998 = !DILocation(line: 1215, column: 8, scope: !996)
!999 = !DILocation(line: 1215, column: 34, scope: !1000)
!1000 = distinct !DILexicalBlock(scope: !996, file: !1, line: 1215, column: 3)
!1001 = !DILocation(line: 1215, column: 3, scope: !996)
!1002 = !DILocalVariable(name: "v", scope: !1003, file: !1, line: 1216, type: !98)
!1003 = distinct !DILexicalBlock(scope: !1000, file: !1, line: 1215, column: 65)
!1004 = !DILocation(line: 1216, column: 12, scope: !1003)
!1005 = !DILocation(line: 1216, column: 16, scope: !1003)
!1006 = !DILocation(line: 1216, column: 24, scope: !1003)
!1007 = !DILocalVariable(name: "eiter", scope: !1003, file: !1, line: 1218, type: !340)
!1008 = !DILocation(line: 1218, column: 11, scope: !1003)
!1009 = !DILocalVariable(name: "e_test", scope: !1003, file: !1, line: 1219, type: !162)
!1010 = !DILocation(line: 1219, column: 12, scope: !1003)
!1011 = !DILocation(line: 1220, column: 4, scope: !1012)
!1012 = distinct !DILexicalBlock(scope: !1003, file: !1, line: 1220, column: 4)
!1013 = !DILocation(line: 1220, column: 4, scope: !1014)
!1014 = distinct !DILexicalBlock(scope: !1012, file: !1, line: 1220, column: 4)
!1015 = !DILocation(line: 1221, column: 9, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !1017, file: !1, line: 1221, column: 9)
!1017 = distinct !DILexicalBlock(scope: !1014, file: !1, line: 1220, column: 55)
!1018 = !DILocation(line: 1221, column: 9, scope: !1017)
!1019 = !DILocalVariable(name: "v_other", scope: !1020, file: !1, line: 1222, type: !98)
!1020 = distinct !DILexicalBlock(scope: !1016, file: !1, line: 1221, column: 49)
!1021 = !DILocation(line: 1222, column: 14, scope: !1020)
!1022 = !DILocation(line: 1222, column: 43, scope: !1020)
!1023 = !DILocation(line: 1222, column: 51, scope: !1020)
!1024 = !DILocation(line: 1222, column: 24, scope: !1020)
!1025 = !DILocation(line: 1223, column: 10, scope: !1026)
!1026 = distinct !DILexicalBlock(scope: !1020, file: !1, line: 1223, column: 10)
!1027 = !DILocation(line: 1223, column: 10, scope: !1020)
!1028 = !DILocation(line: 1224, column: 42, scope: !1029)
!1029 = distinct !DILexicalBlock(scope: !1026, file: !1, line: 1223, column: 51)
!1030 = !DILocation(line: 1224, column: 46, scope: !1029)
!1031 = !DILocation(line: 1224, column: 69, scope: !1029)
!1032 = !DILocation(line: 1224, column: 7, scope: !1029)
!1033 = !DILocation(line: 1225, column: 6, scope: !1029)
!1034 = !DILocation(line: 1226, column: 5, scope: !1020)
!1035 = !DILocation(line: 1227, column: 4, scope: !1017)
!1036 = distinct !{!1036, !1011, !1037}
!1037 = !DILocation(line: 1227, column: 4, scope: !1012)
!1038 = !DILocation(line: 1228, column: 3, scope: !1003)
!1039 = !DILocation(line: 1215, column: 51, scope: !1000)
!1040 = !DILocation(line: 1215, column: 59, scope: !1000)
!1041 = !DILocation(line: 1215, column: 49, scope: !1000)
!1042 = !DILocation(line: 1215, column: 3, scope: !1000)
!1043 = distinct !{!1043, !1001, !1044}
!1044 = !DILocation(line: 1228, column: 3, scope: !996)
!1045 = !DILocation(line: 1230, column: 13, scope: !988)
!1046 = !DILocation(line: 1230, column: 11, scope: !988)
!1047 = !DILocation(line: 1231, column: 2, scope: !988)
!1048 = !DILocation(line: 1233, column: 2, scope: !1049)
!1049 = distinct !DILexicalBlock(scope: !653, file: !1, line: 1233, column: 2)
!1050 = !DILocation(line: 1234, column: 2, scope: !1051)
!1051 = distinct !DILexicalBlock(scope: !653, file: !1, line: 1234, column: 2)
!1052 = !DILocation(line: 1236, column: 17, scope: !653)
!1053 = !DILocation(line: 1236, column: 2, scope: !653)
!1054 = !DILocation(line: 1238, column: 6, scope: !1055)
!1055 = distinct !DILexicalBlock(scope: !653, file: !1, line: 1238, column: 6)
!1056 = !DILocation(line: 1238, column: 14, scope: !1055)
!1057 = !DILocation(line: 1238, column: 6, scope: !653)
!1058 = !DILocation(line: 1242, column: 13, scope: !1059)
!1059 = distinct !DILexicalBlock(scope: !1055, file: !1, line: 1238, column: 23)
!1060 = !DILocation(line: 1242, column: 11, scope: !1059)
!1061 = !DILocation(line: 1243, column: 8, scope: !1059)
!1062 = !DILocation(line: 1244, column: 2, scope: !1059)
!1063 = !DILocation(line: 1246, column: 27, scope: !653)
!1064 = !DILocation(line: 1246, column: 13, scope: !653)
!1065 = !DILocation(line: 1246, column: 3, scope: !653)
!1066 = !DILocation(line: 1246, column: 11, scope: !653)
!1067 = !DILocation(line: 1248, column: 9, scope: !653)
!1068 = !DILocation(line: 1248, column: 2, scope: !653)
!1069 = distinct !DISubprogram(name: "BLI_listbase_clear", scope: !1070, file: !1070, line: 89, type: !1071, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !326)
!1070 = !DIFile(filename: "blender/source/blender/blenlib/BLI_listbase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1071 = !DISubroutineType(types: !1072)
!1072 = !{null, !1073}
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!1074 = !DILocalVariable(name: "lb", arg: 1, scope: !1069, file: !1070, line: 89, type: !1073)
!1075 = !DILocation(line: 89, column: 53, scope: !1069)
!1076 = !DILocation(line: 89, column: 71, scope: !1069)
!1077 = !DILocation(line: 89, column: 75, scope: !1069)
!1078 = !DILocation(line: 89, column: 80, scope: !1069)
!1079 = !DILocation(line: 89, column: 59, scope: !1069)
!1080 = !DILocation(line: 89, column: 63, scope: !1069)
!1081 = !DILocation(line: 89, column: 69, scope: !1069)
!1082 = !DILocation(line: 89, column: 93, scope: !1069)
!1083 = distinct !DISubprogram(name: "bm_vert_fasthash_create", scope: !1, file: !1, line: 1295, type: !1084, scopeLine: 1297, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !326)
!1084 = !DISubroutineType(types: !1085)
!1085 = !{!462, !184, !576}
!1086 = !DILocalVariable(name: "bm", arg: 1, scope: !1083, file: !1, line: 1296, type: !184)
!1087 = !DILocation(line: 1296, column: 16, scope: !1083)
!1088 = !DILocalVariable(name: "depth", arg: 2, scope: !1083, file: !1, line: 1296, type: !576)
!1089 = !DILocation(line: 1296, column: 39, scope: !1083)
!1090 = !DILocalVariable(name: "id_prev", scope: !1083, file: !1, line: 1298, type: !462)
!1091 = !DILocation(line: 1298, column: 17, scope: !1083)
!1092 = !DILocalVariable(name: "id_curr", scope: !1083, file: !1, line: 1299, type: !462)
!1093 = !DILocation(line: 1299, column: 17, scope: !1083)
!1094 = !DILocalVariable(name: "pass", scope: !1083, file: !1, line: 1300, type: !5)
!1095 = !DILocation(line: 1300, column: 15, scope: !1083)
!1096 = !DILocalVariable(name: "i", scope: !1083, file: !1, line: 1300, type: !5)
!1097 = !DILocation(line: 1300, column: 21, scope: !1083)
!1098 = !DILocalVariable(name: "v", scope: !1083, file: !1, line: 1301, type: !98)
!1099 = !DILocation(line: 1301, column: 10, scope: !1083)
!1100 = !DILocalVariable(name: "iter", scope: !1083, file: !1, line: 1302, type: !340)
!1101 = !DILocation(line: 1302, column: 9, scope: !1083)
!1102 = !DILocation(line: 1304, column: 12, scope: !1083)
!1103 = !DILocation(line: 1304, column: 57, scope: !1083)
!1104 = !DILocation(line: 1304, column: 61, scope: !1083)
!1105 = !DILocation(line: 1304, column: 43, scope: !1083)
!1106 = !DILocation(line: 1304, column: 41, scope: !1083)
!1107 = !DILocation(line: 1304, column: 10, scope: !1083)
!1108 = !DILocation(line: 1305, column: 12, scope: !1083)
!1109 = !DILocation(line: 1305, column: 57, scope: !1083)
!1110 = !DILocation(line: 1305, column: 61, scope: !1083)
!1111 = !DILocation(line: 1305, column: 43, scope: !1083)
!1112 = !DILocation(line: 1305, column: 41, scope: !1083)
!1113 = !DILocation(line: 1305, column: 10, scope: !1083)
!1114 = !DILocation(line: 1307, column: 2, scope: !1115)
!1115 = distinct !DILexicalBlock(scope: !1083, file: !1, line: 1307, column: 2)
!1116 = !DILocation(line: 1307, column: 2, scope: !1117)
!1117 = distinct !DILexicalBlock(scope: !1115, file: !1, line: 1307, column: 2)
!1118 = !DILocation(line: 1308, column: 40, scope: !1119)
!1119 = distinct !DILexicalBlock(scope: !1117, file: !1, line: 1307, column: 57)
!1120 = !DILocation(line: 1308, column: 16, scope: !1119)
!1121 = !DILocation(line: 1308, column: 3, scope: !1119)
!1122 = !DILocation(line: 1308, column: 11, scope: !1119)
!1123 = !DILocation(line: 1308, column: 14, scope: !1119)
!1124 = !DILocation(line: 1309, column: 2, scope: !1119)
!1125 = distinct !{!1125, !1114, !1126}
!1126 = !DILocation(line: 1309, column: 2, scope: !1115)
!1127 = !DILocation(line: 1311, column: 12, scope: !1128)
!1128 = distinct !DILexicalBlock(scope: !1083, file: !1, line: 1311, column: 2)
!1129 = !DILocation(line: 1311, column: 7, scope: !1128)
!1130 = !DILocation(line: 1311, column: 17, scope: !1131)
!1131 = distinct !DILexicalBlock(scope: !1128, file: !1, line: 1311, column: 2)
!1132 = !DILocation(line: 1311, column: 24, scope: !1131)
!1133 = !DILocation(line: 1311, column: 22, scope: !1131)
!1134 = !DILocation(line: 1311, column: 2, scope: !1128)
!1135 = !DILocalVariable(name: "e", scope: !1136, file: !1, line: 1312, type: !162)
!1136 = distinct !DILexicalBlock(scope: !1131, file: !1, line: 1311, column: 39)
!1137 = !DILocation(line: 1312, column: 11, scope: !1136)
!1138 = !DILocation(line: 1314, column: 10, scope: !1136)
!1139 = !DILocation(line: 1314, column: 3, scope: !1136)
!1140 = !DILocation(line: 1314, column: 19, scope: !1136)
!1141 = !DILocation(line: 1314, column: 61, scope: !1136)
!1142 = !DILocation(line: 1314, column: 65, scope: !1136)
!1143 = !DILocation(line: 1314, column: 47, scope: !1136)
!1144 = !DILocation(line: 1314, column: 45, scope: !1136)
!1145 = !DILocation(line: 1316, column: 3, scope: !1146)
!1146 = distinct !DILexicalBlock(scope: !1136, file: !1, line: 1316, column: 3)
!1147 = !DILocation(line: 1316, column: 3, scope: !1148)
!1148 = distinct !DILexicalBlock(scope: !1146, file: !1, line: 1316, column: 3)
!1149 = !DILocation(line: 1317, column: 24, scope: !1150)
!1150 = distinct !DILexicalBlock(scope: !1151, file: !1, line: 1317, column: 8)
!1151 = distinct !DILexicalBlock(scope: !1148, file: !1, line: 1316, column: 49)
!1152 = !DILocation(line: 1317, column: 8, scope: !1150)
!1153 = !DILocation(line: 1317, column: 27, scope: !1150)
!1154 = !DILocation(line: 1317, column: 8, scope: !1151)
!1155 = !DILocalVariable(name: "i1", scope: !1156, file: !1, line: 1318, type: !1157)
!1156 = distinct !DILexicalBlock(scope: !1150, file: !1, line: 1317, column: 37)
!1157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !82)
!1158 = !DILocation(line: 1318, column: 15, scope: !1156)
!1159 = !DILocation(line: 1318, column: 20, scope: !1156)
!1160 = !DILocalVariable(name: "i2", scope: !1156, file: !1, line: 1319, type: !1157)
!1161 = !DILocation(line: 1319, column: 15, scope: !1156)
!1162 = !DILocation(line: 1319, column: 20, scope: !1156)
!1163 = !DILocation(line: 1321, column: 20, scope: !1156)
!1164 = !DILocation(line: 1321, column: 28, scope: !1156)
!1165 = !DILocation(line: 1321, column: 5, scope: !1156)
!1166 = !DILocation(line: 1321, column: 13, scope: !1156)
!1167 = !DILocation(line: 1321, column: 17, scope: !1156)
!1168 = !DILocation(line: 1322, column: 20, scope: !1156)
!1169 = !DILocation(line: 1322, column: 28, scope: !1156)
!1170 = !DILocation(line: 1322, column: 5, scope: !1156)
!1171 = !DILocation(line: 1322, column: 13, scope: !1156)
!1172 = !DILocation(line: 1322, column: 17, scope: !1156)
!1173 = !DILocation(line: 1323, column: 4, scope: !1156)
!1174 = !DILocation(line: 1324, column: 3, scope: !1151)
!1175 = distinct !{!1175, !1145, !1176}
!1176 = !DILocation(line: 1324, column: 3, scope: !1146)
!1177 = !DILocation(line: 1325, column: 2, scope: !1136)
!1178 = !DILocation(line: 1311, column: 35, scope: !1131)
!1179 = !DILocation(line: 1311, column: 2, scope: !1131)
!1180 = distinct !{!1180, !1134, !1181}
!1181 = !DILocation(line: 1325, column: 2, scope: !1128)
!1182 = !DILocation(line: 1326, column: 2, scope: !1083)
!1183 = !DILocation(line: 1326, column: 12, scope: !1083)
!1184 = !DILocation(line: 1328, column: 9, scope: !1083)
!1185 = !DILocation(line: 1328, column: 2, scope: !1083)
!1186 = distinct !DISubprogram(name: "bm_uuidwalk_init", scope: !1, file: !1, line: 217, type: !1187, scopeLine: 221, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !326)
!1187 = !DISubroutineType(types: !1188)
!1188 = !{null, !1189, !576, !576}
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!1190 = !DILocalVariable(name: "uuidwalk", arg: 1, scope: !1186, file: !1, line: 218, type: !1189)
!1191 = !DILocation(line: 218, column: 19, scope: !1186)
!1192 = !DILocalVariable(name: "faces_src_region_len", arg: 2, scope: !1186, file: !1, line: 219, type: !576)
!1193 = !DILocation(line: 219, column: 28, scope: !1186)
!1194 = !DILocalVariable(name: "verts_src_region_len", arg: 3, scope: !1186, file: !1, line: 220, type: !576)
!1195 = !DILocation(line: 220, column: 28, scope: !1186)
!1196 = !DILocation(line: 222, column: 22, scope: !1186)
!1197 = !DILocation(line: 222, column: 32, scope: !1186)
!1198 = !DILocation(line: 222, column: 2, scope: !1186)
!1199 = !DILocation(line: 224, column: 55, scope: !1186)
!1200 = !DILocation(line: 224, column: 25, scope: !1186)
!1201 = !DILocation(line: 224, column: 2, scope: !1186)
!1202 = !DILocation(line: 224, column: 12, scope: !1186)
!1203 = !DILocation(line: 224, column: 23, scope: !1186)
!1204 = !DILocation(line: 225, column: 55, scope: !1186)
!1205 = !DILocation(line: 225, column: 25, scope: !1186)
!1206 = !DILocation(line: 225, column: 2, scope: !1186)
!1207 = !DILocation(line: 225, column: 12, scope: !1186)
!1208 = !DILocation(line: 225, column: 23, scope: !1186)
!1209 = !DILocation(line: 227, column: 31, scope: !1186)
!1210 = !DILocation(line: 227, column: 2, scope: !1186)
!1211 = !DILocation(line: 227, column: 12, scope: !1186)
!1212 = !DILocation(line: 227, column: 18, scope: !1186)
!1213 = !DILocation(line: 227, column: 29, scope: !1186)
!1214 = !DILocation(line: 228, column: 31, scope: !1186)
!1215 = !DILocation(line: 228, column: 2, scope: !1186)
!1216 = !DILocation(line: 228, column: 12, scope: !1186)
!1217 = !DILocation(line: 228, column: 18, scope: !1186)
!1218 = !DILocation(line: 228, column: 29, scope: !1186)
!1219 = !DILocation(line: 231, column: 36, scope: !1186)
!1220 = !DILocation(line: 231, column: 2, scope: !1186)
!1221 = !DILocation(line: 231, column: 12, scope: !1186)
!1222 = !DILocation(line: 231, column: 18, scope: !1186)
!1223 = !DILocation(line: 231, column: 34, scope: !1186)
!1224 = !DILocation(line: 233, column: 2, scope: !1186)
!1225 = !DILocation(line: 233, column: 12, scope: !1186)
!1226 = !DILocation(line: 233, column: 18, scope: !1186)
!1227 = !DILocation(line: 233, column: 31, scope: !1186)
!1228 = !DILocation(line: 234, column: 2, scope: !1186)
!1229 = !DILocation(line: 234, column: 12, scope: !1186)
!1230 = !DILocation(line: 234, column: 18, scope: !1186)
!1231 = !DILocation(line: 234, column: 35, scope: !1186)
!1232 = !DILocation(line: 236, column: 2, scope: !1186)
!1233 = !DILocation(line: 236, column: 12, scope: !1186)
!1234 = !DILocation(line: 236, column: 29, scope: !1186)
!1235 = !DILocation(line: 239, column: 24, scope: !1186)
!1236 = !DILocation(line: 239, column: 2, scope: !1186)
!1237 = !DILocation(line: 239, column: 12, scope: !1186)
!1238 = !DILocation(line: 239, column: 22, scope: !1186)
!1239 = !DILocation(line: 240, column: 24, scope: !1186)
!1240 = !DILocation(line: 240, column: 2, scope: !1186)
!1241 = !DILocation(line: 240, column: 12, scope: !1186)
!1242 = !DILocation(line: 240, column: 22, scope: !1186)
!1243 = !DILocation(line: 241, column: 30, scope: !1186)
!1244 = !DILocation(line: 241, column: 2, scope: !1186)
!1245 = !DILocation(line: 241, column: 12, scope: !1186)
!1246 = !DILocation(line: 241, column: 28, scope: !1186)
!1247 = !DILocation(line: 243, column: 2, scope: !1186)
!1248 = !DILocation(line: 243, column: 12, scope: !1186)
!1249 = !DILocation(line: 243, column: 17, scope: !1186)
!1250 = !DILocation(line: 244, column: 1, scope: !1186)
!1251 = distinct !DISubprogram(name: "BM_iter_new", scope: !1252, file: !1252, line: 172, type: !1253, scopeLine: 173, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !326)
!1252 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators_inline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1253 = !DISubroutineType(types: !1254)
!1254 = !{!81, !1255, !184, !227, !81}
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!1256 = !DILocalVariable(name: "iter", arg: 1, scope: !1251, file: !1252, line: 172, type: !1255)
!1257 = !DILocation(line: 172, column: 38, scope: !1251)
!1258 = !DILocalVariable(name: "bm", arg: 2, scope: !1251, file: !1252, line: 172, type: !184)
!1259 = !DILocation(line: 172, column: 51, scope: !1251)
!1260 = !DILocalVariable(name: "itype", arg: 3, scope: !1251, file: !1252, line: 172, type: !227)
!1261 = !DILocation(line: 172, column: 66, scope: !1251)
!1262 = !DILocalVariable(name: "data", arg: 4, scope: !1251, file: !1252, line: 172, type: !81)
!1263 = !DILocation(line: 172, column: 79, scope: !1251)
!1264 = !DILocation(line: 174, column: 6, scope: !1265)
!1265 = distinct !DILexicalBlock(scope: !1251, file: !1252, line: 174, column: 6)
!1266 = !DILocation(line: 174, column: 6, scope: !1251)
!1267 = !DILocation(line: 175, column: 23, scope: !1268)
!1268 = distinct !DILexicalBlock(scope: !1265, file: !1252, line: 174, column: 51)
!1269 = !DILocation(line: 175, column: 10, scope: !1268)
!1270 = !DILocation(line: 175, column: 3, scope: !1268)
!1271 = !DILocation(line: 178, column: 3, scope: !1272)
!1272 = distinct !DILexicalBlock(scope: !1265, file: !1252, line: 177, column: 7)
!1273 = !DILocation(line: 180, column: 1, scope: !1251)
!1274 = distinct !DISubprogram(name: "_bm_elem_flag_test", scope: !1275, file: !1275, line: 42, type: !1276, scopeLine: 43, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !326)
!1275 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_inline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1276 = !DISubroutineType(types: !1277)
!1277 = !{!88, !1278, !227}
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64)
!1279 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!1280 = !DILocalVariable(name: "head", arg: 1, scope: !1274, file: !1275, line: 42, type: !1278)
!1281 = !DILocation(line: 42, column: 52, scope: !1274)
!1282 = !DILocalVariable(name: "hflag", arg: 2, scope: !1274, file: !1275, line: 42, type: !227)
!1283 = !DILocation(line: 42, column: 69, scope: !1274)
!1284 = !DILocation(line: 44, column: 9, scope: !1274)
!1285 = !DILocation(line: 44, column: 15, scope: !1274)
!1286 = !DILocation(line: 44, column: 23, scope: !1274)
!1287 = !DILocation(line: 44, column: 21, scope: !1274)
!1288 = !DILocation(line: 44, column: 2, scope: !1274)
!1289 = distinct !DISubprogram(name: "bm_vert_fasthash_edge_is_match", scope: !1, file: !1, line: 1342, type: !1290, scopeLine: 1344, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !326)
!1290 = !DISubroutineType(types: !1291)
!1291 = !{!445, !462, !1292, !1292}
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64)
!1293 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !163)
!1294 = !DILocalVariable(name: "fm", arg: 1, scope: !1289, file: !1, line: 1343, type: !462)
!1295 = !DILocation(line: 1343, column: 24, scope: !1289)
!1296 = !DILocalVariable(name: "e_a", arg: 2, scope: !1289, file: !1, line: 1343, type: !1292)
!1297 = !DILocation(line: 1343, column: 42, scope: !1289)
!1298 = !DILocalVariable(name: "e_b", arg: 3, scope: !1289, file: !1, line: 1343, type: !1292)
!1299 = !DILocation(line: 1343, column: 61, scope: !1289)
!1300 = !DILocalVariable(name: "e_a_fm", scope: !1289, file: !1, line: 1345, type: !1301)
!1301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 128, elements: !903)
!1302 = !DILocation(line: 1345, column: 16, scope: !1289)
!1303 = !DILocalVariable(name: "e_b_fm", scope: !1289, file: !1, line: 1346, type: !1301)
!1304 = !DILocation(line: 1346, column: 16, scope: !1289)
!1305 = !DILocation(line: 1348, column: 30, scope: !1289)
!1306 = !DILocation(line: 1348, column: 34, scope: !1289)
!1307 = !DILocation(line: 1348, column: 39, scope: !1289)
