; ModuleID = 'blender/source/blender/modifiers/intern/MOD_array.c'
source_filename = "blender/source/blender/modifiers/intern/MOD_array.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!82 = !DIEnumerator(name: "OB_LATTICE", value: 22, isUnsigned: true)
!83 = !DIEnumerator(name: "OB_ARMATURE", value: 25, isUnsigned: true)
!84 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !61, line: 249, baseType: !7, size: 32, elements: !85)
!85 = !{!86, !87, !88}
!86 = !DIEnumerator(name: "MOD_ARR_FIXEDCOUNT", value: 0, isUnsigned: true)
!87 = !DIEnumerator(name: "MOD_ARR_FITLENGTH", value: 1, isUnsigned: true)
!88 = !DIEnumerator(name: "MOD_ARR_FITCURVE", value: 2, isUnsigned: true)
!89 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !90, line: 76, baseType: !7, size: 32, elements: !91)
!90 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!91 = !{!92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132}
!92 = !DIEnumerator(name: "CD_MVERT", value: 0, isUnsigned: true)
!93 = !DIEnumerator(name: "CD_MSTICKY", value: 1, isUnsigned: true)
!94 = !DIEnumerator(name: "CD_MDEFORMVERT", value: 2, isUnsigned: true)
!95 = !DIEnumerator(name: "CD_MEDGE", value: 3, isUnsigned: true)
!96 = !DIEnumerator(name: "CD_MFACE", value: 4, isUnsigned: true)
!97 = !DIEnumerator(name: "CD_MTFACE", value: 5, isUnsigned: true)
!98 = !DIEnumerator(name: "CD_MCOL", value: 6, isUnsigned: true)
!99 = !DIEnumerator(name: "CD_ORIGINDEX", value: 7, isUnsigned: true)
!100 = !DIEnumerator(name: "CD_NORMAL", value: 8, isUnsigned: true)
!101 = !DIEnumerator(name: "CD_PROP_FLT", value: 10, isUnsigned: true)
!102 = !DIEnumerator(name: "CD_PROP_INT", value: 11, isUnsigned: true)
!103 = !DIEnumerator(name: "CD_PROP_STR", value: 12, isUnsigned: true)
!104 = !DIEnumerator(name: "CD_ORIGSPACE", value: 13, isUnsigned: true)
!105 = !DIEnumerator(name: "CD_ORCO", value: 14, isUnsigned: true)
!106 = !DIEnumerator(name: "CD_MTEXPOLY", value: 15, isUnsigned: true)
!107 = !DIEnumerator(name: "CD_MLOOPUV", value: 16, isUnsigned: true)
!108 = !DIEnumerator(name: "CD_MLOOPCOL", value: 17, isUnsigned: true)
!109 = !DIEnumerator(name: "CD_TANGENT", value: 18, isUnsigned: true)
!110 = !DIEnumerator(name: "CD_MDISPS", value: 19, isUnsigned: true)
!111 = !DIEnumerator(name: "CD_PREVIEW_MCOL", value: 20, isUnsigned: true)
!112 = !DIEnumerator(name: "CD_ID_MCOL", value: 21, isUnsigned: true)
!113 = !DIEnumerator(name: "CD_TEXTURE_MCOL", value: 22, isUnsigned: true)
!114 = !DIEnumerator(name: "CD_CLOTH_ORCO", value: 23, isUnsigned: true)
!115 = !DIEnumerator(name: "CD_RECAST", value: 24, isUnsigned: true)
!116 = !DIEnumerator(name: "CD_MPOLY", value: 25, isUnsigned: true)
!117 = !DIEnumerator(name: "CD_MLOOP", value: 26, isUnsigned: true)
!118 = !DIEnumerator(name: "CD_SHAPE_KEYINDEX", value: 27, isUnsigned: true)
!119 = !DIEnumerator(name: "CD_SHAPEKEY", value: 28, isUnsigned: true)
!120 = !DIEnumerator(name: "CD_BWEIGHT", value: 29, isUnsigned: true)
!121 = !DIEnumerator(name: "CD_CREASE", value: 30, isUnsigned: true)
!122 = !DIEnumerator(name: "CD_ORIGSPACE_MLOOP", value: 31, isUnsigned: true)
!123 = !DIEnumerator(name: "CD_PREVIEW_MLOOPCOL", value: 32, isUnsigned: true)
!124 = !DIEnumerator(name: "CD_BM_ELEM_PYPTR", value: 33, isUnsigned: true)
!125 = !DIEnumerator(name: "CD_PAINT_MASK", value: 34, isUnsigned: true)
!126 = !DIEnumerator(name: "CD_GRID_PAINT_MASK", value: 35, isUnsigned: true)
!127 = !DIEnumerator(name: "CD_MVERT_SKIN", value: 36, isUnsigned: true)
!128 = !DIEnumerator(name: "CD_FREESTYLE_EDGE", value: 37, isUnsigned: true)
!129 = !DIEnumerator(name: "CD_FREESTYLE_FACE", value: 38, isUnsigned: true)
!130 = !DIEnumerator(name: "CD_MLOOPTANGENT", value: 39, isUnsigned: true)
!131 = !DIEnumerator(name: "CD_TESSLOOPNORMAL", value: 40, isUnsigned: true)
!132 = !DIEnumerator(name: "CD_NUMTYPES", value: 41, isUnsigned: true)
!133 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !134, line: 63, baseType: !7, size: 32, elements: !135)
!134 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_cdderivedmesh.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!135 = !{!136, !137}
!136 = !DIEnumerator(name: "CDDM_MERGE_VERTS_DUMP_IF_MAPPED", value: 0, isUnsigned: true)
!137 = !DIEnumerator(name: "CDDM_MERGE_VERTS_DUMP_IF_EQUAL", value: 1, isUnsigned: true)
!138 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !139, line: 69, baseType: !7, size: 32, elements: !140)
!139 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_depsgraph.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!140 = !{!141}
!141 = !DIEnumerator(name: "DAG_EVAL_NEED_CURVE_PATH", value: 1, isUnsigned: true)
!142 = !{!143, !175, !203, !1743}
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "ArrayModifierData", file: !61, line: 246, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ArrayModifierData", file: !61, line: 204, size: 1536, elements: !146)
!146 = !{!147, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !145, file: !61, line: 205, baseType: !148, size: 896)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierData", file: !61, line: 110, baseType: !149)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierData", file: !61, line: 99, size: 896, elements: !150)
!150 = !{!151, !153, !154, !156, !157, !158, !159, !164, !1730}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !149, file: !61, line: 100, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !149, file: !61, line: 100, baseType: !152, size: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !149, file: !61, line: 102, baseType: !155, size: 32, offset: 128)
!155 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !149, file: !61, line: 102, baseType: !155, size: 32, offset: 160)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "stackindex", scope: !149, file: !61, line: 103, baseType: !155, size: 32, offset: 192)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !149, file: !61, line: 103, baseType: !155, size: 32, offset: 224)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !149, file: !61, line: 104, baseType: !160, size: 512, offset: 256)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 512, elements: !162)
!161 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!162 = !{!163}
!163 = !DISubrange(count: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !149, file: !61, line: 107, baseType: !165, size: 64, offset: 768)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !167, line: 1216, size: 39680, elements: !168)
!167 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!168 = !{!169, !236, !240, !1031, !1034, !1035, !1036, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1062, !1066, !1069, !1293, !1296, !1596, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1626, !1627, !1628, !1629, !1630, !1638, !1704, !1711, !1712, !1719, !1722, !1723, !1724, !1725, !1726, !1727}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !166, file: !167, line: 1217, baseType: !170, size: 960)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !171, line: 130, baseType: !172)
!171 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !171, line: 117, size: 960, elements: !173)
!173 = !{!174, !176, !177, !179, !198, !202, !204, !205, !206, !207}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !172, file: !171, line: 118, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !172, file: !171, line: 118, baseType: !175, size: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !172, file: !171, line: 119, baseType: !178, size: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !172, file: !171, line: 120, baseType: !180, size: 64, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !171, line: 136, size: 17600, elements: !182)
!182 = !{!183, !184, !186, !189, !193, !194, !195}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !181, file: !171, line: 137, baseType: !170, size: 960)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !181, file: !171, line: 138, baseType: !185, size: 64, offset: 960)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !181, file: !171, line: 139, baseType: !187, size: 64, offset: 1024)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !171, line: 43, flags: DIFlagFwdDecl)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !181, file: !171, line: 140, baseType: !190, size: 8192, offset: 1088)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 8192, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 1024)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !181, file: !171, line: 141, baseType: !190, size: 8192, offset: 9280)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !181, file: !171, line: 148, baseType: !180, size: 64, offset: 17472)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !181, file: !171, line: 150, baseType: !196, size: 64, offset: 17536)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !171, line: 45, flags: DIFlagFwdDecl)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !172, file: !171, line: 121, baseType: !199, size: 528, offset: 256)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 528, elements: !200)
!200 = !{!201}
!201 = !DISubrange(count: 66)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !172, file: !171, line: 126, baseType: !203, size: 16, offset: 784)
!203 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !172, file: !171, line: 127, baseType: !155, size: 32, offset: 800)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !172, file: !171, line: 128, baseType: !155, size: 32, offset: 832)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !172, file: !171, line: 128, baseType: !155, size: 32, offset: 864)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !172, file: !171, line: 129, baseType: !208, size: 64, offset: 896)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !171, line: 75, baseType: !210)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !171, line: 62, size: 1024, elements: !211)
!211 = !{!212, !214, !215, !216, !217, !218, !219, !220, !234, !235}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !210, file: !171, line: 63, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !210, file: !171, line: 63, baseType: !213, size: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !210, file: !171, line: 64, baseType: !161, size: 8, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !210, file: !171, line: 64, baseType: !161, size: 8, offset: 136)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !210, file: !171, line: 65, baseType: !203, size: 16, offset: 144)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !210, file: !171, line: 66, baseType: !160, size: 512, offset: 160)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !210, file: !171, line: 67, baseType: !155, size: 32, offset: 672)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !210, file: !171, line: 69, baseType: !221, size: 256, offset: 704)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !171, line: 60, baseType: !222)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !171, line: 48, size: 256, elements: !223)
!223 = !{!224, !225, !232, !233}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !222, file: !171, line: 49, baseType: !175, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !222, file: !171, line: 58, baseType: !226, size: 128, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !227, line: 71, baseType: !228)
!227 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !227, line: 69, size: 128, elements: !229)
!229 = !{!230, !231}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !228, file: !227, line: 70, baseType: !175, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !228, file: !227, line: 70, baseType: !175, size: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !222, file: !171, line: 59, baseType: !155, size: 32, offset: 192)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !222, file: !171, line: 59, baseType: !155, size: 32, offset: 224)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !210, file: !171, line: 70, baseType: !155, size: 32, offset: 960)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !210, file: !171, line: 74, baseType: !155, size: 32, offset: 992)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !166, file: !167, line: 1218, baseType: !237, size: 64, offset: 960)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !239, line: 48, flags: DIFlagFwdDecl)
!239 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!240 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !166, file: !167, line: 1220, baseType: !241, size: 64, offset: 1024)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !71, line: 115, size: 11392, elements: !243)
!243 = !{!244, !245, !246, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !263, !275, !289, !290, !333, !334, !337, !338, !354, !355, !356, !357, !358, !359, !360, !364, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !380, !381, !382, !383, !384, !385, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !445, !446, !447, !448, !449, !450, !451, !452, !453, !456, !459, !462, !463, !464, !465, !466, !469, !491, !978, !979, !985, !986, !987, !988, !989, !990, !992, !995, !998, !1000, !1019, !1020}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !242, file: !71, line: 116, baseType: !170, size: 960)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !242, file: !71, line: 117, baseType: !237, size: 64, offset: 960)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !242, file: !71, line: 119, baseType: !247, size: 64, offset: 1024)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !71, line: 57, flags: DIFlagFwdDecl)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !242, file: !71, line: 121, baseType: !203, size: 16, offset: 1088)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !242, file: !71, line: 121, baseType: !203, size: 16, offset: 1104)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !242, file: !71, line: 122, baseType: !155, size: 32, offset: 1120)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !242, file: !71, line: 122, baseType: !155, size: 32, offset: 1152)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !242, file: !71, line: 122, baseType: !155, size: 32, offset: 1184)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !242, file: !71, line: 123, baseType: !160, size: 512, offset: 1216)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !242, file: !71, line: 124, baseType: !241, size: 64, offset: 1728)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !242, file: !71, line: 124, baseType: !241, size: 64, offset: 1792)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !242, file: !71, line: 127, baseType: !241, size: 64, offset: 1856)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !242, file: !71, line: 127, baseType: !241, size: 64, offset: 1920)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !242, file: !71, line: 127, baseType: !241, size: 64, offset: 1984)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !242, file: !71, line: 128, baseType: !261, size: 64, offset: 2048)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !239, line: 44, flags: DIFlagFwdDecl)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !242, file: !71, line: 130, baseType: !264, size: 64, offset: 2112)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !71, line: 97, size: 832, elements: !266)
!266 = !{!267, !273, !274}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !265, file: !71, line: 98, baseType: !268, size: 768)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !269, size: 768, elements: !270)
!269 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!270 = !{!271, !272}
!271 = !DISubrange(count: 8)
!272 = !DISubrange(count: 3)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !265, file: !71, line: 99, baseType: !155, size: 32, offset: 768)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !265, file: !71, line: 99, baseType: !155, size: 32, offset: 800)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !242, file: !71, line: 131, baseType: !276, size: 64, offset: 2176)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !278, line: 486, size: 1600, elements: !279)
!278 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!279 = !{!280, !281, !282, !283, !284, !285, !286, !287, !288}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !277, file: !278, line: 487, baseType: !170, size: 960)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !277, file: !278, line: 489, baseType: !226, size: 128, offset: 960)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !277, file: !278, line: 490, baseType: !226, size: 128, offset: 1088)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !277, file: !278, line: 491, baseType: !226, size: 128, offset: 1216)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !277, file: !278, line: 492, baseType: !226, size: 128, offset: 1344)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !277, file: !278, line: 494, baseType: !155, size: 32, offset: 1472)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !277, file: !278, line: 495, baseType: !155, size: 32, offset: 1504)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !277, file: !278, line: 497, baseType: !155, size: 32, offset: 1536)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !277, file: !278, line: 498, baseType: !155, size: 32, offset: 1568)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !242, file: !71, line: 132, baseType: !276, size: 64, offset: 2240)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !242, file: !71, line: 133, baseType: !291, size: 64, offset: 2304)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !278, line: 334, size: 1728, elements: !293)
!293 = !{!294, !295, !298, !299, !300, !301, !302, !303, !306, !307, !308, !309, !310, !311, !312, !332}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !292, file: !278, line: 335, baseType: !226, size: 128)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !292, file: !278, line: 336, baseType: !296, size: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !239, line: 51, flags: DIFlagFwdDecl)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !292, file: !278, line: 338, baseType: !203, size: 16, offset: 192)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !292, file: !278, line: 338, baseType: !203, size: 16, offset: 208)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !292, file: !278, line: 339, baseType: !7, size: 32, offset: 224)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !292, file: !278, line: 340, baseType: !155, size: 32, offset: 256)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !292, file: !278, line: 342, baseType: !269, size: 32, offset: 288)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !292, file: !278, line: 343, baseType: !304, size: 96, offset: 320)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !269, size: 96, elements: !305)
!305 = !{!272}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !292, file: !278, line: 344, baseType: !304, size: 96, offset: 416)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !292, file: !278, line: 347, baseType: !226, size: 128, offset: 512)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !292, file: !278, line: 349, baseType: !155, size: 32, offset: 640)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !292, file: !278, line: 350, baseType: !155, size: 32, offset: 672)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !292, file: !278, line: 351, baseType: !175, size: 64, offset: 704)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !292, file: !278, line: 352, baseType: !175, size: 64, offset: 768)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !292, file: !278, line: 354, baseType: !313, size: 384, offset: 832)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !278, line: 116, baseType: !314)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !278, line: 94, size: 384, elements: !315)
!315 = !{!316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !314, file: !278, line: 96, baseType: !155, size: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !314, file: !278, line: 96, baseType: !155, size: 32, offset: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !314, file: !278, line: 97, baseType: !155, size: 32, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !314, file: !278, line: 97, baseType: !155, size: 32, offset: 96)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !314, file: !278, line: 99, baseType: !203, size: 16, offset: 128)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !314, file: !278, line: 100, baseType: !203, size: 16, offset: 144)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !314, file: !278, line: 102, baseType: !203, size: 16, offset: 160)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !314, file: !278, line: 105, baseType: !203, size: 16, offset: 176)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !314, file: !278, line: 108, baseType: !203, size: 16, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !314, file: !278, line: 109, baseType: !203, size: 16, offset: 208)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !314, file: !278, line: 111, baseType: !203, size: 16, offset: 224)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !314, file: !278, line: 112, baseType: !203, size: 16, offset: 240)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !314, file: !278, line: 114, baseType: !155, size: 32, offset: 256)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !314, file: !278, line: 114, baseType: !155, size: 32, offset: 288)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !314, file: !278, line: 115, baseType: !155, size: 32, offset: 320)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !314, file: !278, line: 115, baseType: !155, size: 32, offset: 352)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !292, file: !278, line: 355, baseType: !160, size: 512, offset: 1216)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !242, file: !71, line: 134, baseType: !175, size: 64, offset: 2368)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !242, file: !71, line: 136, baseType: !335, size: 64, offset: 2432)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !71, line: 58, flags: DIFlagFwdDecl)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !242, file: !71, line: 138, baseType: !313, size: 384, offset: 2496)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !242, file: !71, line: 139, baseType: !339, size: 64, offset: 2880)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !278, line: 80, baseType: !341)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !278, line: 72, size: 192, elements: !342)
!342 = !{!343, !350, !351, !352, !353}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !341, file: !278, line: 73, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !278, line: 59, baseType: !346)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !278, line: 56, size: 128, elements: !347)
!347 = !{!348, !349}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !346, file: !278, line: 57, baseType: !304, size: 96)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !346, file: !278, line: 58, baseType: !155, size: 32, offset: 96)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !341, file: !278, line: 74, baseType: !155, size: 32, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !341, file: !278, line: 76, baseType: !155, size: 32, offset: 96)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !341, file: !278, line: 77, baseType: !155, size: 32, offset: 128)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !341, file: !278, line: 79, baseType: !155, size: 32, offset: 160)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !242, file: !71, line: 141, baseType: !226, size: 128, offset: 2944)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !242, file: !71, line: 142, baseType: !226, size: 128, offset: 3072)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !242, file: !71, line: 143, baseType: !226, size: 128, offset: 3200)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !242, file: !71, line: 144, baseType: !226, size: 128, offset: 3328)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !242, file: !71, line: 146, baseType: !155, size: 32, offset: 3456)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !242, file: !71, line: 147, baseType: !155, size: 32, offset: 3488)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !242, file: !71, line: 150, baseType: !361, size: 64, offset: 3520)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !239, line: 46, flags: DIFlagFwdDecl)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !242, file: !71, line: 151, baseType: !365, size: 64, offset: 3584)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !242, file: !71, line: 152, baseType: !155, size: 32, offset: 3648)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !242, file: !71, line: 153, baseType: !155, size: 32, offset: 3680)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !242, file: !71, line: 156, baseType: !304, size: 96, offset: 3712)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !242, file: !71, line: 156, baseType: !304, size: 96, offset: 3808)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !242, file: !71, line: 156, baseType: !304, size: 96, offset: 3904)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !242, file: !71, line: 157, baseType: !304, size: 96, offset: 4000)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !242, file: !71, line: 158, baseType: !304, size: 96, offset: 4096)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !242, file: !71, line: 159, baseType: !304, size: 96, offset: 4192)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !242, file: !71, line: 160, baseType: !304, size: 96, offset: 4288)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !242, file: !71, line: 160, baseType: !304, size: 96, offset: 4384)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !242, file: !71, line: 161, baseType: !377, size: 128, offset: 4480)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !269, size: 128, elements: !378)
!378 = !{!379}
!379 = !DISubrange(count: 4)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !242, file: !71, line: 161, baseType: !377, size: 128, offset: 4608)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !242, file: !71, line: 162, baseType: !304, size: 96, offset: 4736)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !242, file: !71, line: 162, baseType: !304, size: 96, offset: 4832)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !242, file: !71, line: 163, baseType: !269, size: 32, offset: 4928)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !242, file: !71, line: 163, baseType: !269, size: 32, offset: 4960)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !242, file: !71, line: 164, baseType: !386, size: 512, offset: 4992)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !269, size: 512, elements: !387)
!387 = !{!379, !379}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !242, file: !71, line: 165, baseType: !386, size: 512, offset: 5504)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !242, file: !71, line: 166, baseType: !386, size: 512, offset: 6016)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !242, file: !71, line: 167, baseType: !386, size: 512, offset: 6528)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !242, file: !71, line: 176, baseType: !386, size: 512, offset: 7040)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !242, file: !71, line: 178, baseType: !7, size: 32, offset: 7552)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !242, file: !71, line: 180, baseType: !203, size: 16, offset: 7584)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !242, file: !71, line: 181, baseType: !203, size: 16, offset: 7600)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !242, file: !71, line: 183, baseType: !203, size: 16, offset: 7616)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !242, file: !71, line: 183, baseType: !203, size: 16, offset: 7632)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !242, file: !71, line: 184, baseType: !203, size: 16, offset: 7648)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !242, file: !71, line: 184, baseType: !203, size: 16, offset: 7664)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !242, file: !71, line: 185, baseType: !203, size: 16, offset: 7680)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !242, file: !71, line: 186, baseType: !203, size: 16, offset: 7696)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !242, file: !71, line: 187, baseType: !203, size: 16, offset: 7712)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !242, file: !71, line: 188, baseType: !161, size: 8, offset: 7728)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !242, file: !71, line: 189, baseType: !161, size: 8, offset: 7736)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !242, file: !71, line: 192, baseType: !155, size: 32, offset: 7744)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !242, file: !71, line: 192, baseType: !155, size: 32, offset: 7776)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !242, file: !71, line: 192, baseType: !155, size: 32, offset: 7808)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !242, file: !71, line: 192, baseType: !155, size: 32, offset: 7840)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !242, file: !71, line: 194, baseType: !155, size: 32, offset: 7872)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !242, file: !71, line: 202, baseType: !269, size: 32, offset: 7904)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !242, file: !71, line: 202, baseType: !269, size: 32, offset: 7936)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !242, file: !71, line: 202, baseType: !269, size: 32, offset: 7968)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !242, file: !71, line: 211, baseType: !269, size: 32, offset: 8000)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !242, file: !71, line: 212, baseType: !269, size: 32, offset: 8032)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !242, file: !71, line: 213, baseType: !269, size: 32, offset: 8064)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !242, file: !71, line: 214, baseType: !269, size: 32, offset: 8096)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !242, file: !71, line: 215, baseType: !269, size: 32, offset: 8128)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !242, file: !71, line: 216, baseType: !269, size: 32, offset: 8160)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !242, file: !71, line: 219, baseType: !269, size: 32, offset: 8192)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !242, file: !71, line: 220, baseType: !269, size: 32, offset: 8224)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !242, file: !71, line: 221, baseType: !269, size: 32, offset: 8256)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !242, file: !71, line: 224, baseType: !422, size: 16, offset: 8288)
!422 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !242, file: !71, line: 224, baseType: !422, size: 16, offset: 8304)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !242, file: !71, line: 226, baseType: !203, size: 16, offset: 8320)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !242, file: !71, line: 228, baseType: !161, size: 8, offset: 8336)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !242, file: !71, line: 229, baseType: !161, size: 8, offset: 8344)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !242, file: !71, line: 231, baseType: !203, size: 16, offset: 8352)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !242, file: !71, line: 232, baseType: !161, size: 8, offset: 8368)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !242, file: !71, line: 233, baseType: !161, size: 8, offset: 8376)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !242, file: !71, line: 234, baseType: !269, size: 32, offset: 8384)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !242, file: !71, line: 235, baseType: !269, size: 32, offset: 8416)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !242, file: !71, line: 237, baseType: !226, size: 128, offset: 8448)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !242, file: !71, line: 238, baseType: !226, size: 128, offset: 8576)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !242, file: !71, line: 239, baseType: !226, size: 128, offset: 8704)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !242, file: !71, line: 240, baseType: !226, size: 128, offset: 8832)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !242, file: !71, line: 242, baseType: !269, size: 32, offset: 8960)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !242, file: !71, line: 244, baseType: !203, size: 16, offset: 8992)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !242, file: !71, line: 245, baseType: !422, size: 16, offset: 9008)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !242, file: !71, line: 246, baseType: !377, size: 128, offset: 9024)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !242, file: !71, line: 248, baseType: !155, size: 32, offset: 9152)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !242, file: !71, line: 249, baseType: !155, size: 32, offset: 9184)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !242, file: !71, line: 251, baseType: !443, size: 64, offset: 9216)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !71, line: 251, flags: DIFlagFwdDecl)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !242, file: !71, line: 253, baseType: !161, size: 8, offset: 9280)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !242, file: !71, line: 254, baseType: !161, size: 8, offset: 9288)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !242, file: !71, line: 255, baseType: !203, size: 16, offset: 9296)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !242, file: !71, line: 256, baseType: !304, size: 96, offset: 9312)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !242, file: !71, line: 258, baseType: !226, size: 128, offset: 9408)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !242, file: !71, line: 259, baseType: !226, size: 128, offset: 9536)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !242, file: !71, line: 260, baseType: !226, size: 128, offset: 9664)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !242, file: !71, line: 261, baseType: !226, size: 128, offset: 9792)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !242, file: !71, line: 263, baseType: !454, size: 64, offset: 9920)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !71, line: 52, flags: DIFlagFwdDecl)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !242, file: !71, line: 264, baseType: !457, size: 64, offset: 9984)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !71, line: 53, flags: DIFlagFwdDecl)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !242, file: !71, line: 265, baseType: !460, size: 64, offset: 10048)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !278, line: 46, flags: DIFlagFwdDecl)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !242, file: !71, line: 267, baseType: !161, size: 8, offset: 10112)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !242, file: !71, line: 268, baseType: !161, size: 8, offset: 10120)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !242, file: !71, line: 269, baseType: !203, size: 16, offset: 10128)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !242, file: !71, line: 270, baseType: !269, size: 32, offset: 10144)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !242, file: !71, line: 272, baseType: !467, size: 64, offset: 10176)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !71, line: 54, flags: DIFlagFwdDecl)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !242, file: !71, line: 275, baseType: !470, size: 64, offset: 10240)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !472, line: 49, size: 448, elements: !473)
!472 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_curve.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!473 = !{!474, !475, !476, !477}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "disp", scope: !471, file: !472, line: 50, baseType: !226, size: 128)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "bev", scope: !471, file: !472, line: 51, baseType: !226, size: 128, offset: 128)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "deformed_nurbs", scope: !471, file: !472, line: 52, baseType: !226, size: 128, offset: 256)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !471, file: !472, line: 53, baseType: !478, size: 64, offset: 384)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Path", file: !239, line: 65, size: 128, elements: !480)
!480 = !{!481, !489, !490}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !479, file: !239, line: 66, baseType: !482, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PathPoint", file: !239, line: 56, size: 320, elements: !484)
!484 = !{!485, !486, !487, !488}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !483, file: !239, line: 57, baseType: !377, size: 128)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !483, file: !239, line: 58, baseType: !377, size: 128, offset: 128)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !483, file: !239, line: 59, baseType: !269, size: 32, offset: 256)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !483, file: !239, line: 59, baseType: !269, size: 32, offset: 288)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !479, file: !239, line: 67, baseType: !155, size: 32, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "totdist", scope: !479, file: !239, line: 68, baseType: !269, size: 32, offset: 96)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !242, file: !71, line: 277, baseType: !492, size: 64, offset: 10304)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !28, line: 178, size: 13504, elements: !494)
!494 = !{!495, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !546, !549, !551, !552, !554, !555, !556, !557, !563, !568, !569, !573, !574, !575, !576, !577, !590, !602, !616, !620, !624, !628, !637, !649, !653, !657, !661, !665, !669, !670, !671, !672, !673, !674, !678, !679, !680, !681, !685, !686, !687, !688, !689, !694, !695, !696, !697, !698, !702, !703, !704, !705, !706, !713, !724, !729, !735, !745, !751, !762, !769, !776, !780, !785, !789, !794, !795, !796, !803, !809, !810, !811, !816, !817, !826, !935, !939, !947, !951, !955, !959, !967, !977}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !493, file: !28, line: 180, baseType: !496, size: 1600)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !90, line: 73, baseType: !497)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !90, line: 64, size: 1600, elements: !498)
!498 = !{!499, !514, !518, !519, !520, !521, !524}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !497, file: !90, line: 65, baseType: !500, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !90, line: 53, baseType: !502)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !90, line: 42, size: 832, elements: !503)
!503 = !{!504, !505, !506, !507, !508, !509, !510, !511, !512, !513}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !502, file: !90, line: 43, baseType: !155, size: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !502, file: !90, line: 44, baseType: !155, size: 32, offset: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !502, file: !90, line: 45, baseType: !155, size: 32, offset: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !502, file: !90, line: 46, baseType: !155, size: 32, offset: 96)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !502, file: !90, line: 47, baseType: !155, size: 32, offset: 128)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !502, file: !90, line: 48, baseType: !155, size: 32, offset: 160)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !502, file: !90, line: 49, baseType: !155, size: 32, offset: 192)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !502, file: !90, line: 50, baseType: !155, size: 32, offset: 224)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !502, file: !90, line: 51, baseType: !160, size: 512, offset: 256)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !502, file: !90, line: 52, baseType: !175, size: 64, offset: 768)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !497, file: !90, line: 66, baseType: !515, size: 1312, offset: 64)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 1312, elements: !516)
!516 = !{!517}
!517 = !DISubrange(count: 41)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !497, file: !90, line: 69, baseType: !155, size: 32, offset: 1376)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !497, file: !90, line: 69, baseType: !155, size: 32, offset: 1408)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !497, file: !90, line: 70, baseType: !155, size: 32, offset: 1440)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !497, file: !90, line: 71, baseType: !522, size: 64, offset: 1472)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !90, line: 71, flags: DIFlagFwdDecl)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !497, file: !90, line: 72, baseType: !525, size: 64, offset: 1536)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !90, line: 59, baseType: !527)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !90, line: 57, size: 8192, elements: !528)
!528 = !{!529}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !527, file: !90, line: 58, baseType: !190, size: 8192)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !493, file: !28, line: 180, baseType: !496, size: 1600, offset: 1600)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !493, file: !28, line: 180, baseType: !496, size: 1600, offset: 3200)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !493, file: !28, line: 180, baseType: !496, size: 1600, offset: 4800)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !493, file: !28, line: 180, baseType: !496, size: 1600, offset: 6400)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !493, file: !28, line: 181, baseType: !155, size: 32, offset: 8000)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !493, file: !28, line: 181, baseType: !155, size: 32, offset: 8032)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !493, file: !28, line: 181, baseType: !155, size: 32, offset: 8064)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !493, file: !28, line: 181, baseType: !155, size: 32, offset: 8096)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !493, file: !28, line: 181, baseType: !155, size: 32, offset: 8128)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !493, file: !28, line: 182, baseType: !155, size: 32, offset: 8160)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !493, file: !28, line: 183, baseType: !155, size: 32, offset: 8192)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !493, file: !28, line: 184, baseType: !542, size: 64, offset: 8256)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !543, line: 124, baseType: !544)
!543 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !543, line: 124, flags: DIFlagFwdDecl)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !493, file: !28, line: 185, baseType: !547, size: 64, offset: 8320)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !28, line: 97, flags: DIFlagFwdDecl)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !493, file: !28, line: 186, baseType: !550, size: 32, offset: 8384)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !28, line: 132, baseType: !27)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !493, file: !28, line: 187, baseType: !269, size: 32, offset: 8416)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !493, file: !28, line: 188, baseType: !553, size: 32, offset: 8448)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !28, line: 175, baseType: !33)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !493, file: !28, line: 189, baseType: !155, size: 32, offset: 8480)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !493, file: !28, line: 190, baseType: !361, size: 64, offset: 8512)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !493, file: !28, line: 193, baseType: !161, size: 8, offset: 8576)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !493, file: !28, line: 196, baseType: !558, size: 64, offset: 8640)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DISubroutineType(types: !560)
!560 = !{null, !561}
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !28, line: 177, baseType: !493)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !493, file: !28, line: 199, baseType: !564, size: 64, offset: 8704)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DISubroutineType(types: !566)
!566 = !{null, !561, !567}
!567 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !269)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !493, file: !28, line: 202, baseType: !558, size: 64, offset: 8768)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !493, file: !28, line: 207, baseType: !570, size: 64, offset: 8832)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DISubroutineType(types: !572)
!572 = !{!155, !561}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !493, file: !28, line: 208, baseType: !570, size: 64, offset: 8896)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !493, file: !28, line: 209, baseType: !570, size: 64, offset: 8960)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !493, file: !28, line: 210, baseType: !570, size: 64, offset: 9024)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !493, file: !28, line: 211, baseType: !570, size: 64, offset: 9088)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !493, file: !28, line: 218, baseType: !578, size: 64, offset: 9152)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{null, !561, !155, !581}
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !583, line: 65, size: 160, elements: !584)
!583 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!584 = !{!585, !586, !588, !589}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !582, file: !583, line: 66, baseType: !304, size: 96)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !582, file: !583, line: 67, baseType: !587, size: 48, offset: 96)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 48, elements: !305)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !582, file: !583, line: 68, baseType: !161, size: 8, offset: 144)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !582, file: !583, line: 68, baseType: !161, size: 8, offset: 152)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !493, file: !28, line: 219, baseType: !591, size: 64, offset: 9216)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DISubroutineType(types: !593)
!593 = !{null, !561, !155, !594}
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !583, line: 48, size: 96, elements: !596)
!596 = !{!597, !598, !599, !600, !601}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !595, file: !583, line: 49, baseType: !7, size: 32)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !595, file: !583, line: 49, baseType: !7, size: 32, offset: 32)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !595, file: !583, line: 50, baseType: !161, size: 8, offset: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !595, file: !583, line: 50, baseType: !161, size: 8, offset: 72)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !595, file: !583, line: 51, baseType: !203, size: 16, offset: 80)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !493, file: !28, line: 220, baseType: !603, size: 64, offset: 9280)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DISubroutineType(types: !605)
!605 = !{null, !561, !155, !606}
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !583, line: 42, size: 160, elements: !608)
!608 = !{!609, !610, !611, !612, !613, !614, !615}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !607, file: !583, line: 43, baseType: !7, size: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !607, file: !583, line: 43, baseType: !7, size: 32, offset: 32)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !607, file: !583, line: 43, baseType: !7, size: 32, offset: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !607, file: !583, line: 43, baseType: !7, size: 32, offset: 96)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !607, file: !583, line: 44, baseType: !203, size: 16, offset: 128)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !607, file: !583, line: 45, baseType: !161, size: 8, offset: 144)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !607, file: !583, line: 45, baseType: !161, size: 8, offset: 152)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !493, file: !28, line: 227, baseType: !617, size: 64, offset: 9344)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DISubroutineType(types: !619)
!619 = !{!581, !561}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !493, file: !28, line: 228, baseType: !621, size: 64, offset: 9408)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DISubroutineType(types: !623)
!623 = !{!594, !561}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !493, file: !28, line: 229, baseType: !625, size: 64, offset: 9472)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{!606, !561}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !493, file: !28, line: 230, baseType: !629, size: 64, offset: 9536)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DISubroutineType(types: !631)
!631 = !{!632, !561}
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !583, line: 88, size: 64, elements: !634)
!634 = !{!635, !636}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !633, file: !583, line: 89, baseType: !7, size: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !633, file: !583, line: 90, baseType: !7, size: 32, offset: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !493, file: !28, line: 231, baseType: !638, size: 64, offset: 9600)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DISubroutineType(types: !640)
!640 = !{!641, !561}
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !583, line: 79, size: 96, elements: !643)
!643 = !{!644, !645, !646, !647, !648}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !642, file: !583, line: 81, baseType: !155, size: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !642, file: !583, line: 82, baseType: !155, size: 32, offset: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !642, file: !583, line: 83, baseType: !203, size: 16, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !642, file: !583, line: 84, baseType: !161, size: 8, offset: 80)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !642, file: !583, line: 84, baseType: !161, size: 8, offset: 88)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !493, file: !28, line: 236, baseType: !650, size: 64, offset: 9664)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DISubroutineType(types: !652)
!652 = !{null, !561, !581}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !493, file: !28, line: 237, baseType: !654, size: 64, offset: 9728)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DISubroutineType(types: !656)
!656 = !{null, !561, !594}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !493, file: !28, line: 238, baseType: !658, size: 64, offset: 9792)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DISubroutineType(types: !660)
!660 = !{null, !561, !606}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !493, file: !28, line: 239, baseType: !662, size: 64, offset: 9856)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DISubroutineType(types: !664)
!664 = !{null, !561, !632}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !493, file: !28, line: 240, baseType: !666, size: 64, offset: 9920)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DISubroutineType(types: !668)
!668 = !{null, !561, !641}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !493, file: !28, line: 245, baseType: !617, size: 64, offset: 9984)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !493, file: !28, line: 246, baseType: !621, size: 64, offset: 10048)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !493, file: !28, line: 247, baseType: !625, size: 64, offset: 10112)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !493, file: !28, line: 248, baseType: !629, size: 64, offset: 10176)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !493, file: !28, line: 249, baseType: !638, size: 64, offset: 10240)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !493, file: !28, line: 255, baseType: !675, size: 64, offset: 10304)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DISubroutineType(types: !677)
!677 = !{!175, !561, !155, !155}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !493, file: !28, line: 256, baseType: !675, size: 64, offset: 10368)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !493, file: !28, line: 257, baseType: !675, size: 64, offset: 10432)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !493, file: !28, line: 258, baseType: !675, size: 64, offset: 10496)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !493, file: !28, line: 264, baseType: !682, size: 64, offset: 10560)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DISubroutineType(types: !684)
!684 = !{!175, !561, !155}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !493, file: !28, line: 265, baseType: !682, size: 64, offset: 10624)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !493, file: !28, line: 266, baseType: !682, size: 64, offset: 10688)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !493, file: !28, line: 267, baseType: !682, size: 64, offset: 10752)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !493, file: !28, line: 268, baseType: !682, size: 64, offset: 10816)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataLayout", scope: !493, file: !28, line: 272, baseType: !690, size: 64, offset: 10880)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DISubroutineType(types: !692)
!692 = !{!693, !561}
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataLayout", scope: !493, file: !28, line: 273, baseType: !690, size: 64, offset: 10944)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataLayout", scope: !493, file: !28, line: 274, baseType: !690, size: 64, offset: 11008)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataLayout", scope: !493, file: !28, line: 275, baseType: !690, size: 64, offset: 11072)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataLayout", scope: !493, file: !28, line: 276, baseType: !690, size: 64, offset: 11136)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromVertCData", scope: !493, file: !28, line: 279, baseType: !699, size: 64, offset: 11200)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DISubroutineType(types: !701)
!701 = !{null, !561, !155, !693, !155}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromEdgeCData", scope: !493, file: !28, line: 280, baseType: !699, size: 64, offset: 11264)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromFaceCData", scope: !493, file: !28, line: 281, baseType: !699, size: 64, offset: 11328)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "getNumGrids", scope: !493, file: !28, line: 284, baseType: !570, size: 64, offset: 11392)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "getGridSize", scope: !493, file: !28, line: 285, baseType: !570, size: 64, offset: 11456)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "getGridData", scope: !493, file: !28, line: 286, baseType: !707, size: 64, offset: 11520)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DISubroutineType(types: !709)
!709 = !{!710, !561}
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !28, line: 82, flags: DIFlagFwdDecl)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "getGridAdjacency", scope: !493, file: !28, line: 287, baseType: !714, size: 64, offset: 11584)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DISubroutineType(types: !716)
!716 = !{!717, !561}
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGridAdjacency", file: !28, line: 120, baseType: !719)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMGridAdjacency", file: !28, line: 117, size: 256, elements: !720)
!720 = !{!721, !723}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !719, file: !28, line: 118, baseType: !722, size: 128)
!722 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 128, elements: !378)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !719, file: !28, line: 119, baseType: !722, size: 128, offset: 128)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "getGridOffset", scope: !493, file: !28, line: 288, baseType: !725, size: 64, offset: 11648)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DISubroutineType(types: !727)
!727 = !{!728, !561}
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "getGridKey", scope: !493, file: !28, line: 289, baseType: !730, size: 64, offset: 11712)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DISubroutineType(types: !732)
!732 = !{null, !561, !733}
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGKey", file: !28, line: 83, flags: DIFlagFwdDecl)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "getGridFlagMats", scope: !493, file: !28, line: 290, baseType: !736, size: 64, offset: 11776)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DISubroutineType(types: !738)
!738 = !{!739, !561}
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFlagMat", file: !28, line: 126, baseType: !741)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMFlagMat", file: !28, line: 123, size: 32, elements: !742)
!742 = !{!743, !744}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !741, file: !28, line: 124, baseType: !203, size: 16)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !741, file: !28, line: 125, baseType: !161, size: 8, offset: 16)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "getGridHidden", scope: !493, file: !28, line: 291, baseType: !746, size: 64, offset: 11840)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{!749, !561}
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedVert", scope: !493, file: !28, line: 299, baseType: !752, size: 64, offset: 11904)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DISubroutineType(types: !754)
!754 = !{null, !561, !755, !175, !761}
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DISubroutineType(types: !757)
!757 = !{null, !175, !155, !758, !758, !759}
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !203)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMForeachFlag", file: !28, line: 162, baseType: !38)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedEdge", scope: !493, file: !28, line: 309, baseType: !763, size: 64, offset: 11968)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DISubroutineType(types: !765)
!765 = !{null, !561, !766, !175}
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DISubroutineType(types: !768)
!768 = !{null, !175, !155, !758, !758}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedLoop", scope: !493, file: !28, line: 317, baseType: !770, size: 64, offset: 12032)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DISubroutineType(types: !772)
!772 = !{null, !561, !773, !175, !761}
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DISubroutineType(types: !775)
!775 = !{null, !175, !155, !155, !758, !758}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedFaceCenter", scope: !493, file: !28, line: 327, baseType: !777, size: 64, offset: 12096)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DISubroutineType(types: !779)
!779 = !{null, !561, !766, !175, !761}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "getMinMax", scope: !493, file: !28, line: 337, baseType: !781, size: 64, offset: 12160)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DISubroutineType(types: !783)
!783 = !{null, !561, !784, !784}
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCo", scope: !493, file: !28, line: 344, baseType: !786, size: 64, offset: 12224)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DISubroutineType(types: !788)
!788 = !{null, !561, !155, !784}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCos", scope: !493, file: !28, line: 347, baseType: !790, size: 64, offset: 12288)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DISubroutineType(types: !792)
!792 = !{null, !561, !793}
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "getVertNo", scope: !493, file: !28, line: 350, baseType: !786, size: 64, offset: 12352)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyNo", scope: !493, file: !28, line: 351, baseType: !786, size: 64, offset: 12416)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyMap", scope: !493, file: !28, line: 355, baseType: !797, size: 64, offset: 12480)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DISubroutineType(types: !799)
!799 = !{!800, !241, !561}
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !802)
!802 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !28, line: 355, flags: DIFlagFwdDecl)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "getPBVH", scope: !493, file: !28, line: 359, baseType: !804, size: 64, offset: 12544)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DISubroutineType(types: !806)
!806 = !{!807, !241, !561}
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !28, line: 100, flags: DIFlagFwdDecl)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "drawVerts", scope: !493, file: !28, line: 364, baseType: !558, size: 64, offset: 12608)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "drawUVEdges", scope: !493, file: !28, line: 367, baseType: !558, size: 64, offset: 12672)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "drawEdges", scope: !493, file: !28, line: 373, baseType: !812, size: 64, offset: 12736)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DISubroutineType(types: !814)
!814 = !{null, !561, !815, !815}
!815 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "drawLooseEdges", scope: !493, file: !28, line: 376, baseType: !558, size: 64, offset: 12800)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesSolid", scope: !493, file: !28, line: 385, baseType: !818, size: 64, offset: 12864)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DISubroutineType(types: !820)
!820 = !{null, !561, !821, !815, !822}
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetMaterial", file: !28, line: 146, baseType: !823)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DISubroutineType(types: !825)
!825 = !{!155, !155, !175}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesTex", scope: !493, file: !28, line: 391, baseType: !827, size: 64, offset: 12928)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DISubroutineType(types: !829)
!829 = !{null, !561, !830, !930, !175, !934}
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptionsTex", file: !28, line: 150, baseType: !831)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DISubroutineType(types: !833)
!833 = !{!834, !835, !929, !155}
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawOption", file: !28, line: 143, baseType: !42)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !583, line: 160, size: 384, elements: !837)
!837 = !{!838, !842, !924, !925, !926, !927, !928}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !836, file: !583, line: 161, baseType: !839, size: 256)
!839 = !DICompositeType(tag: DW_TAG_array_type, baseType: !269, size: 256, elements: !840)
!840 = !{!379, !841}
!841 = !DISubrange(count: 2)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !836, file: !583, line: 162, baseType: !843, size: 64, offset: 256)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !845, line: 77, size: 15424, elements: !846)
!845 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!846 = !{!847, !848, !849, !852, !855, !858, !861, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !913, !914, !918}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !844, file: !845, line: 78, baseType: !170, size: 960)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !844, file: !845, line: 80, baseType: !190, size: 8192, offset: 960)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !844, file: !845, line: 82, baseType: !850, size: 64, offset: 9152)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !845, line: 43, flags: DIFlagFwdDecl)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !844, file: !845, line: 83, baseType: !853, size: 64, offset: 9216)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !171, line: 46, flags: DIFlagFwdDecl)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !844, file: !845, line: 86, baseType: !856, size: 64, offset: 9280)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !845, line: 41, flags: DIFlagFwdDecl)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !844, file: !845, line: 87, baseType: !859, size: 64, offset: 9344)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !845, line: 44, flags: DIFlagFwdDecl)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !844, file: !845, line: 89, baseType: !862, size: 512, offset: 9408)
!862 = !DICompositeType(tag: DW_TAG_array_type, baseType: !859, size: 512, elements: !863)
!863 = !{!271}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !844, file: !845, line: 90, baseType: !203, size: 16, offset: 9920)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !844, file: !845, line: 90, baseType: !203, size: 16, offset: 9936)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !844, file: !845, line: 92, baseType: !203, size: 16, offset: 9952)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !844, file: !845, line: 92, baseType: !203, size: 16, offset: 9968)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !844, file: !845, line: 93, baseType: !203, size: 16, offset: 9984)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !844, file: !845, line: 93, baseType: !203, size: 16, offset: 10000)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !844, file: !845, line: 94, baseType: !155, size: 32, offset: 10016)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !844, file: !845, line: 97, baseType: !203, size: 16, offset: 10048)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !844, file: !845, line: 97, baseType: !203, size: 16, offset: 10064)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !844, file: !845, line: 98, baseType: !203, size: 16, offset: 10080)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !844, file: !845, line: 98, baseType: !203, size: 16, offset: 10096)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !844, file: !845, line: 99, baseType: !203, size: 16, offset: 10112)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !844, file: !845, line: 99, baseType: !203, size: 16, offset: 10128)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !844, file: !845, line: 100, baseType: !7, size: 32, offset: 10144)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !844, file: !845, line: 101, baseType: !750, size: 64, offset: 10176)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !844, file: !845, line: 103, baseType: !196, size: 64, offset: 10240)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !844, file: !845, line: 104, baseType: !881, size: 64, offset: 10304)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !171, line: 159, size: 448, elements: !883)
!883 = !{!884, !887, !888, !890, !891, !893}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !882, file: !171, line: 161, baseType: !885, size: 64)
!885 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !886)
!886 = !{!841}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !882, file: !171, line: 162, baseType: !885, size: 64, offset: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !882, file: !171, line: 163, baseType: !889, size: 32, offset: 128)
!889 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 32, elements: !886)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !882, file: !171, line: 164, baseType: !889, size: 32, offset: 160)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !882, file: !171, line: 165, baseType: !892, size: 128, offset: 192)
!892 = !DICompositeType(tag: DW_TAG_array_type, baseType: !750, size: 128, elements: !886)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !882, file: !171, line: 166, baseType: !894, size: 128, offset: 320)
!894 = !DICompositeType(tag: DW_TAG_array_type, baseType: !853, size: 128, elements: !886)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !844, file: !845, line: 107, baseType: !269, size: 32, offset: 10368)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !844, file: !845, line: 108, baseType: !155, size: 32, offset: 10400)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !844, file: !845, line: 109, baseType: !203, size: 16, offset: 10432)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !844, file: !845, line: 110, baseType: !203, size: 16, offset: 10448)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !844, file: !845, line: 113, baseType: !155, size: 32, offset: 10464)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !844, file: !845, line: 113, baseType: !155, size: 32, offset: 10496)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !844, file: !845, line: 114, baseType: !161, size: 8, offset: 10528)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !844, file: !845, line: 114, baseType: !161, size: 8, offset: 10536)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !844, file: !845, line: 115, baseType: !203, size: 16, offset: 10544)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !844, file: !845, line: 116, baseType: !377, size: 128, offset: 10560)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !844, file: !845, line: 119, baseType: !269, size: 32, offset: 10688)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !844, file: !845, line: 119, baseType: !269, size: 32, offset: 10720)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !844, file: !845, line: 122, baseType: !908, size: 512, offset: 10752)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !909, line: 182, baseType: !910)
!909 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !909, line: 180, size: 512, elements: !911)
!911 = !{!912}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !910, file: !909, line: 181, baseType: !160, size: 512)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !844, file: !845, line: 123, baseType: !161, size: 8, offset: 11264)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !844, file: !845, line: 125, baseType: !915, size: 56, offset: 11272)
!915 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 56, elements: !916)
!916 = !{!917}
!917 = !DISubrange(count: 7)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !844, file: !845, line: 126, baseType: !919, size: 4096, offset: 11328)
!919 = !DICompositeType(tag: DW_TAG_array_type, baseType: !920, size: 4096, elements: !863)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !845, line: 69, baseType: !921)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !845, line: 67, size: 512, elements: !922)
!922 = !{!923}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !921, file: !845, line: 68, baseType: !160, size: 512)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !836, file: !583, line: 163, baseType: !161, size: 8, offset: 320)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !836, file: !583, line: 163, baseType: !161, size: 8, offset: 328)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !836, file: !583, line: 164, baseType: !203, size: 16, offset: 336)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !836, file: !583, line: 164, baseType: !203, size: 16, offset: 352)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !836, file: !583, line: 164, baseType: !203, size: 16, offset: 368)
!929 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !815)
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCompareDrawOptions", file: !28, line: 147, baseType: !931)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DISubroutineType(types: !933)
!933 = !{!155, !175, !155, !155}
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawFlag", file: !28, line: 157, baseType: !48)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesGLSL", scope: !493, file: !28, line: 400, baseType: !936, size: 64, offset: 12992)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DISubroutineType(types: !938)
!938 = !{null, !561, !822}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFaces", scope: !493, file: !28, line: 415, baseType: !940, size: 64, offset: 13056)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DISubroutineType(types: !942)
!942 = !{null, !561, !943, !822, !930, !175, !934}
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptions", file: !28, line: 149, baseType: !944)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DISubroutineType(types: !946)
!946 = !{!834, !175, !155}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesTex", scope: !493, file: !28, line: 425, baseType: !948, size: 64, offset: 13120)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DISubroutineType(types: !950)
!950 = !{null, !561, !943, !930, !175, !934}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesGLSL", scope: !493, file: !28, line: 435, baseType: !952, size: 64, offset: 13184)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = !DISubroutineType(types: !954)
!954 = !{null, !561, !822, !943, !175}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdges", scope: !493, file: !28, line: 444, baseType: !956, size: 64, offset: 13248)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = !DISubroutineType(types: !958)
!958 = !{null, !561, !943, !175}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdgesInterp", scope: !493, file: !28, line: 455, baseType: !960, size: 64, offset: 13312)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DISubroutineType(types: !962)
!962 = !{null, !561, !943, !963, !175}
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawInterpOptions", file: !28, line: 148, baseType: !964)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DISubroutineType(types: !966)
!966 = !{null, !175, !155, !269}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesMat", scope: !493, file: !28, line: 464, baseType: !968, size: 64, offset: 13376)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DISubroutineType(types: !970)
!970 = !{null, !561, !971, !974, !175}
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DISubroutineType(types: !973)
!973 = !{null, !175, !155, !175}
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DISubroutineType(types: !976)
!976 = !{!815, !175, !155}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !493, file: !28, line: 470, baseType: !558, size: 64, offset: 13440)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !242, file: !71, line: 277, baseType: !492, size: 64, offset: 10368)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !242, file: !71, line: 278, baseType: !980, size: 64, offset: 10432)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !981, line: 27, baseType: !982)
!981 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !983, line: 45, baseType: !984)
!983 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!984 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !242, file: !71, line: 279, baseType: !980, size: 64, offset: 10496)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !242, file: !71, line: 280, baseType: !7, size: 32, offset: 10560)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !242, file: !71, line: 281, baseType: !7, size: 32, offset: 10592)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !242, file: !71, line: 283, baseType: !226, size: 128, offset: 10624)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !242, file: !71, line: 284, baseType: !226, size: 128, offset: 10752)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !242, file: !71, line: 285, baseType: !991, size: 64, offset: 10880)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !242, file: !71, line: 287, baseType: !993, size: 64, offset: 10944)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !71, line: 59, flags: DIFlagFwdDecl)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !242, file: !71, line: 288, baseType: !996, size: 64, offset: 11008)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !71, line: 288, flags: DIFlagFwdDecl)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !242, file: !71, line: 290, baseType: !999, size: 64, offset: 11072)
!999 = !DICompositeType(tag: DW_TAG_array_type, baseType: !269, size: 64, elements: !886)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !242, file: !71, line: 291, baseType: !1001, size: 64, offset: 11136)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !845, line: 65, baseType: !1003)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !845, line: 50, size: 320, elements: !1004)
!1004 = !{!1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1003, file: !845, line: 51, baseType: !165, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1003, file: !845, line: 53, baseType: !155, size: 32, offset: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !1003, file: !845, line: 54, baseType: !155, size: 32, offset: 96)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1003, file: !845, line: 55, baseType: !155, size: 32, offset: 128)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !1003, file: !845, line: 55, baseType: !155, size: 32, offset: 160)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !1003, file: !845, line: 56, baseType: !161, size: 8, offset: 192)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !1003, file: !845, line: 56, baseType: !161, size: 8, offset: 200)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1003, file: !845, line: 57, baseType: !161, size: 8, offset: 208)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1003, file: !845, line: 57, baseType: !161, size: 8, offset: 216)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !1003, file: !845, line: 59, baseType: !203, size: 16, offset: 224)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !1003, file: !845, line: 59, baseType: !203, size: 16, offset: 240)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !1003, file: !845, line: 59, baseType: !203, size: 16, offset: 256)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1003, file: !845, line: 61, baseType: !203, size: 16, offset: 272)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1003, file: !845, line: 63, baseType: !155, size: 32, offset: 288)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !242, file: !71, line: 293, baseType: !226, size: 128, offset: 11200)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !242, file: !71, line: 294, baseType: !1021, size: 64, offset: 11328)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !71, line: 113, baseType: !1023)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !71, line: 108, size: 256, elements: !1024)
!1024 = !{!1025, !1027, !1028, !1029, !1030}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1023, file: !71, line: 109, baseType: !1026, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1023, file: !71, line: 109, baseType: !1026, size: 64, offset: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1023, file: !71, line: 110, baseType: !241, size: 64, offset: 128)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1023, file: !71, line: 111, baseType: !155, size: 32, offset: 192)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !1023, file: !71, line: 112, baseType: !269, size: 32, offset: 224)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !166, file: !167, line: 1221, baseType: !1032, size: 64, offset: 1088)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !167, line: 52, flags: DIFlagFwdDecl)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !166, file: !167, line: 1223, baseType: !165, size: 64, offset: 1152)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !166, file: !167, line: 1225, baseType: !226, size: 128, offset: 1216)
