; ModuleID = 'blender/source/blender/modifiers/intern/MOD_weightvgproximity.c'
source_filename = "blender/source/blender/modifiers/intern/MOD_weightvgproximity.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!95 = !DIEnumerator(name: "CD_BM_ELEM_PYPTR", value: 33, isUnsigned: true)
!96 = !DIEnumerator(name: "CD_PAINT_MASK", value: 34, isUnsigned: true)
!97 = !DIEnumerator(name: "CD_GRID_PAINT_MASK", value: 35, isUnsigned: true)
!98 = !DIEnumerator(name: "CD_MVERT_SKIN", value: 36, isUnsigned: true)
!99 = !DIEnumerator(name: "CD_FREESTYLE_EDGE", value: 37, isUnsigned: true)
!100 = !DIEnumerator(name: "CD_FREESTYLE_FACE", value: 38, isUnsigned: true)
!101 = !DIEnumerator(name: "CD_MLOOPTANGENT", value: 39, isUnsigned: true)
!102 = !DIEnumerator(name: "CD_TESSLOOPNORMAL", value: 40, isUnsigned: true)
!103 = !DIEnumerator(name: "CD_NUMTYPES", value: 41, isUnsigned: true)
!104 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !105, line: 1091, baseType: !7, size: 32, elements: !106)
!105 = !DIFile(filename: "blender/source/blender/makesdna/DNA_modifier_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!106 = !{!107, !108}
!107 = !DIEnumerator(name: "MOD_WVG_PROXIMITY_OBJECT", value: 1, isUnsigned: true)
!108 = !DIEnumerator(name: "MOD_WVG_PROXIMITY_GEOMETRY", value: 2, isUnsigned: true)
!109 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !105, line: 1097, baseType: !7, size: 32, elements: !110)
!110 = !{!111, !112, !113}
!111 = !DIEnumerator(name: "MOD_WVG_PROXIMITY_GEOM_VERTS", value: 1, isUnsigned: true)
!112 = !DIEnumerator(name: "MOD_WVG_PROXIMITY_GEOM_EDGES", value: 2, isUnsigned: true)
!113 = !DIEnumerator(name: "MOD_WVG_PROXIMITY_GEOM_FACES", value: 4, isUnsigned: true)
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !115, line: 339, baseType: !7, size: 32, elements: !116)
!115 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127}
!117 = !DIEnumerator(name: "OB_EMPTY", value: 0, isUnsigned: true)
!118 = !DIEnumerator(name: "OB_MESH", value: 1, isUnsigned: true)
!119 = !DIEnumerator(name: "OB_CURVE", value: 2, isUnsigned: true)
!120 = !DIEnumerator(name: "OB_SURF", value: 3, isUnsigned: true)
!121 = !DIEnumerator(name: "OB_FONT", value: 4, isUnsigned: true)
!122 = !DIEnumerator(name: "OB_MBALL", value: 5, isUnsigned: true)
!123 = !DIEnumerator(name: "OB_LAMP", value: 10, isUnsigned: true)
!124 = !DIEnumerator(name: "OB_CAMERA", value: 11, isUnsigned: true)
!125 = !DIEnumerator(name: "OB_SPEAKER", value: 12, isUnsigned: true)
!126 = !DIEnumerator(name: "OB_LATTICE", value: 22, isUnsigned: true)
!127 = !DIEnumerator(name: "OB_ARMATURE", value: 25, isUnsigned: true)
!128 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !105, line: 1108, baseType: !7, size: 32, elements: !129)
!129 = !{!130, !131, !132, !133, !134, !135, !136, !137}
!130 = !DIEnumerator(name: "MOD_WVG_MAPPING_NONE", value: 0, isUnsigned: true)
!131 = !DIEnumerator(name: "MOD_WVG_MAPPING_CURVE", value: 1, isUnsigned: true)
!132 = !DIEnumerator(name: "MOD_WVG_MAPPING_SHARP", value: 2, isUnsigned: true)
!133 = !DIEnumerator(name: "MOD_WVG_MAPPING_SMOOTH", value: 3, isUnsigned: true)
!134 = !DIEnumerator(name: "MOD_WVG_MAPPING_ROOT", value: 4, isUnsigned: true)
!135 = !DIEnumerator(name: "MOD_WVG_MAPPING_SPHERE", value: 7, isUnsigned: true)
!136 = !DIEnumerator(name: "MOD_WVG_MAPPING_RANDOM", value: 8, isUnsigned: true)
!137 = !DIEnumerator(name: "MOD_WVG_MAPPING_STEP", value: 9, isUnsigned: true)
!138 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !105, line: 1122, baseType: !7, size: 32, elements: !139)
!139 = !{!140, !141, !142, !143, !144, !145, !146, !147}
!140 = !DIEnumerator(name: "MOD_WVG_MASK_TEX_USE_INT", value: 1, isUnsigned: true)
!141 = !DIEnumerator(name: "MOD_WVG_MASK_TEX_USE_RED", value: 2, isUnsigned: true)
!142 = !DIEnumerator(name: "MOD_WVG_MASK_TEX_USE_GREEN", value: 3, isUnsigned: true)
!143 = !DIEnumerator(name: "MOD_WVG_MASK_TEX_USE_BLUE", value: 4, isUnsigned: true)
!144 = !DIEnumerator(name: "MOD_WVG_MASK_TEX_USE_HUE", value: 5, isUnsigned: true)
!145 = !DIEnumerator(name: "MOD_WVG_MASK_TEX_USE_SAT", value: 6, isUnsigned: true)
!146 = !DIEnumerator(name: "MOD_WVG_MASK_TEX_USE_VAL", value: 7, isUnsigned: true)
!147 = !DIEnumerator(name: "MOD_WVG_MASK_TEX_USE_ALPHA", value: 8, isUnsigned: true)
!148 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !105, line: 393, baseType: !7, size: 32, elements: !149)
!149 = !{!150, !151, !152, !153}
!150 = !DIEnumerator(name: "MOD_DISP_MAP_LOCAL", value: 0, isUnsigned: true)
!151 = !DIEnumerator(name: "MOD_DISP_MAP_GLOBAL", value: 1, isUnsigned: true)
!152 = !DIEnumerator(name: "MOD_DISP_MAP_OBJECT", value: 2, isUnsigned: true)
!153 = !DIEnumerator(name: "MOD_DISP_MAP_UV", value: 3, isUnsigned: true)
!154 = !{!155, !194, !1258, !180, !1392, !1393}
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "WeightVGProximityModifierData", file: !105, line: 1088, baseType: !157)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "WeightVGProximityModifierData", file: !105, line: 1058, size: 2880, elements: !158)
!158 = !{!159, !181, !182, !183, !184, !1025, !1026, !1027, !1028, !1251, !1252, !1253, !1254, !1255, !1256, !1257}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !157, file: !105, line: 1059, baseType: !160, size: 896)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierData", file: !105, line: 110, baseType: !161)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierData", file: !105, line: 99, size: 896, elements: !162)
!162 = !{!163, !165, !166, !168, !169, !170, !171, !176, !179}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !161, file: !105, line: 100, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !161, file: !105, line: 100, baseType: !164, size: 64, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !161, file: !105, line: 102, baseType: !167, size: 32, offset: 128)
!167 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !161, file: !105, line: 102, baseType: !167, size: 32, offset: 160)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "stackindex", scope: !161, file: !105, line: 103, baseType: !167, size: 32, offset: 192)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !161, file: !105, line: 103, baseType: !167, size: 32, offset: 224)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !161, file: !105, line: 104, baseType: !172, size: 512, offset: 256)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 512, elements: !174)
!173 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!174 = !{!175}
!175 = !DISubrange(count: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !161, file: !105, line: 107, baseType: !177, size: 64, offset: 768)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !105, line: 107, flags: DIFlagFwdDecl)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !161, file: !105, line: 109, baseType: !180, size: 64, offset: 832)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "defgrp_name", scope: !157, file: !105, line: 1061, baseType: !172, size: 512, offset: 896)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "proximity_mode", scope: !157, file: !105, line: 1064, baseType: !167, size: 32, offset: 1408)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "proximity_flags", scope: !157, file: !105, line: 1065, baseType: !167, size: 32, offset: 1440)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "proximity_ob_target", scope: !157, file: !105, line: 1068, baseType: !185, size: 64, offset: 1472)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !115, line: 115, size: 11392, elements: !187)
!187 = !{!188, !255, !259, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !276, !288, !302, !303, !347, !348, !351, !352, !368, !369, !370, !371, !372, !373, !374, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !393, !394, !395, !396, !397, !398, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !458, !459, !460, !461, !462, !463, !464, !465, !466, !469, !472, !475, !476, !477, !478, !479, !482, !485, !972, !973, !979, !980, !981, !982, !983, !984, !986, !989, !992, !994, !1013, !1014}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !186, file: !115, line: 116, baseType: !189, size: 960)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !190, line: 130, baseType: !191)
!190 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !190, line: 117, size: 960, elements: !192)
!192 = !{!193, !195, !196, !198, !217, !221, !223, !224, !225, !226}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !191, file: !190, line: 118, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !191, file: !190, line: 118, baseType: !194, size: 64, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !191, file: !190, line: 119, baseType: !197, size: 64, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !191, file: !190, line: 120, baseType: !199, size: 64, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !190, line: 136, size: 17600, elements: !201)
!201 = !{!202, !203, !205, !208, !212, !213, !214}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !200, file: !190, line: 137, baseType: !189, size: 960)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !200, file: !190, line: 138, baseType: !204, size: 64, offset: 960)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !200, file: !190, line: 139, baseType: !206, size: 64, offset: 1024)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !190, line: 43, flags: DIFlagFwdDecl)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !200, file: !190, line: 140, baseType: !209, size: 8192, offset: 1088)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 8192, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 1024)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !200, file: !190, line: 141, baseType: !209, size: 8192, offset: 9280)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !200, file: !190, line: 148, baseType: !199, size: 64, offset: 17472)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !200, file: !190, line: 150, baseType: !215, size: 64, offset: 17536)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !190, line: 45, flags: DIFlagFwdDecl)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !191, file: !190, line: 121, baseType: !218, size: 528, offset: 256)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 528, elements: !219)
!219 = !{!220}
!220 = !DISubrange(count: 66)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !191, file: !190, line: 126, baseType: !222, size: 16, offset: 784)
!222 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !191, file: !190, line: 127, baseType: !167, size: 32, offset: 800)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !191, file: !190, line: 128, baseType: !167, size: 32, offset: 832)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !191, file: !190, line: 128, baseType: !167, size: 32, offset: 864)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !191, file: !190, line: 129, baseType: !227, size: 64, offset: 896)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !190, line: 75, baseType: !229)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !190, line: 62, size: 1024, elements: !230)
!230 = !{!231, !233, !234, !235, !236, !237, !238, !239, !253, !254}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !229, file: !190, line: 63, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !229, file: !190, line: 63, baseType: !232, size: 64, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !229, file: !190, line: 64, baseType: !173, size: 8, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !229, file: !190, line: 64, baseType: !173, size: 8, offset: 136)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !229, file: !190, line: 65, baseType: !222, size: 16, offset: 144)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !229, file: !190, line: 66, baseType: !172, size: 512, offset: 160)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !229, file: !190, line: 67, baseType: !167, size: 32, offset: 672)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !229, file: !190, line: 69, baseType: !240, size: 256, offset: 704)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !190, line: 60, baseType: !241)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !190, line: 48, size: 256, elements: !242)
!242 = !{!243, !244, !251, !252}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !241, file: !190, line: 49, baseType: !194, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !241, file: !190, line: 58, baseType: !245, size: 128, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !246, line: 71, baseType: !247)
!246 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !246, line: 69, size: 128, elements: !248)
!248 = !{!249, !250}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !247, file: !246, line: 70, baseType: !194, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !247, file: !246, line: 70, baseType: !194, size: 64, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !241, file: !190, line: 59, baseType: !167, size: 32, offset: 192)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !241, file: !190, line: 59, baseType: !167, size: 32, offset: 224)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !229, file: !190, line: 70, baseType: !167, size: 32, offset: 960)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !229, file: !190, line: 74, baseType: !167, size: 32, offset: 992)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !186, file: !115, line: 117, baseType: !256, size: 64, offset: 960)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !258, line: 39, flags: DIFlagFwdDecl)
!258 = !DIFile(filename: "blender/source/blender/makesdna/DNA_mesh_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!259 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !186, file: !115, line: 119, baseType: !260, size: 64, offset: 1024)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !115, line: 57, flags: DIFlagFwdDecl)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !186, file: !115, line: 121, baseType: !222, size: 16, offset: 1088)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !186, file: !115, line: 121, baseType: !222, size: 16, offset: 1104)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !186, file: !115, line: 122, baseType: !167, size: 32, offset: 1120)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !186, file: !115, line: 122, baseType: !167, size: 32, offset: 1152)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !186, file: !115, line: 122, baseType: !167, size: 32, offset: 1184)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !186, file: !115, line: 123, baseType: !172, size: 512, offset: 1216)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !186, file: !115, line: 124, baseType: !185, size: 64, offset: 1728)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !186, file: !115, line: 124, baseType: !185, size: 64, offset: 1792)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !186, file: !115, line: 127, baseType: !185, size: 64, offset: 1856)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !186, file: !115, line: 127, baseType: !185, size: 64, offset: 1920)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !186, file: !115, line: 127, baseType: !185, size: 64, offset: 1984)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !186, file: !115, line: 128, baseType: !274, size: 64, offset: 2048)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !258, line: 41, flags: DIFlagFwdDecl)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !186, file: !115, line: 130, baseType: !277, size: 64, offset: 2112)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !115, line: 97, size: 832, elements: !279)
!279 = !{!280, !286, !287}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !278, file: !115, line: 98, baseType: !281, size: 768)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 768, elements: !283)
!282 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!283 = !{!284, !285}
!284 = !DISubrange(count: 8)
!285 = !DISubrange(count: 3)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !278, file: !115, line: 99, baseType: !167, size: 32, offset: 768)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !278, file: !115, line: 99, baseType: !167, size: 32, offset: 800)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !186, file: !115, line: 131, baseType: !289, size: 64, offset: 2176)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !291, line: 486, size: 1600, elements: !292)
!291 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!292 = !{!293, !294, !295, !296, !297, !298, !299, !300, !301}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !290, file: !291, line: 487, baseType: !189, size: 960)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !290, file: !291, line: 489, baseType: !245, size: 128, offset: 960)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !290, file: !291, line: 490, baseType: !245, size: 128, offset: 1088)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !290, file: !291, line: 491, baseType: !245, size: 128, offset: 1216)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !290, file: !291, line: 492, baseType: !245, size: 128, offset: 1344)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !290, file: !291, line: 494, baseType: !167, size: 32, offset: 1472)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !290, file: !291, line: 495, baseType: !167, size: 32, offset: 1504)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !290, file: !291, line: 497, baseType: !167, size: 32, offset: 1536)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !290, file: !291, line: 498, baseType: !167, size: 32, offset: 1568)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !186, file: !115, line: 132, baseType: !289, size: 64, offset: 2240)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !186, file: !115, line: 133, baseType: !304, size: 64, offset: 2304)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !291, line: 334, size: 1728, elements: !306)
!306 = !{!307, !308, !312, !313, !314, !315, !316, !317, !320, !321, !322, !323, !324, !325, !326, !346}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !305, file: !291, line: 335, baseType: !245, size: 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !305, file: !291, line: 336, baseType: !309, size: 64, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !311, line: 48, flags: DIFlagFwdDecl)
!311 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!312 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !305, file: !291, line: 338, baseType: !222, size: 16, offset: 192)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !305, file: !291, line: 338, baseType: !222, size: 16, offset: 208)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !305, file: !291, line: 339, baseType: !7, size: 32, offset: 224)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !305, file: !291, line: 340, baseType: !167, size: 32, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !305, file: !291, line: 342, baseType: !282, size: 32, offset: 288)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !305, file: !291, line: 343, baseType: !318, size: 96, offset: 320)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 96, elements: !319)
!319 = !{!285}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !305, file: !291, line: 344, baseType: !318, size: 96, offset: 416)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !305, file: !291, line: 347, baseType: !245, size: 128, offset: 512)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !305, file: !291, line: 349, baseType: !167, size: 32, offset: 640)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !305, file: !291, line: 350, baseType: !167, size: 32, offset: 672)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !305, file: !291, line: 351, baseType: !194, size: 64, offset: 704)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !305, file: !291, line: 352, baseType: !194, size: 64, offset: 768)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !305, file: !291, line: 354, baseType: !327, size: 384, offset: 832)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !291, line: 116, baseType: !328)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !291, line: 94, size: 384, elements: !329)
!329 = !{!330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !328, file: !291, line: 96, baseType: !167, size: 32)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !328, file: !291, line: 96, baseType: !167, size: 32, offset: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !328, file: !291, line: 97, baseType: !167, size: 32, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !328, file: !291, line: 97, baseType: !167, size: 32, offset: 96)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !328, file: !291, line: 99, baseType: !222, size: 16, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !328, file: !291, line: 100, baseType: !222, size: 16, offset: 144)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !328, file: !291, line: 102, baseType: !222, size: 16, offset: 160)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !328, file: !291, line: 105, baseType: !222, size: 16, offset: 176)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !328, file: !291, line: 108, baseType: !222, size: 16, offset: 192)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !328, file: !291, line: 109, baseType: !222, size: 16, offset: 208)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !328, file: !291, line: 111, baseType: !222, size: 16, offset: 224)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !328, file: !291, line: 112, baseType: !222, size: 16, offset: 240)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !328, file: !291, line: 114, baseType: !167, size: 32, offset: 256)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !328, file: !291, line: 114, baseType: !167, size: 32, offset: 288)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !328, file: !291, line: 115, baseType: !167, size: 32, offset: 320)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !328, file: !291, line: 115, baseType: !167, size: 32, offset: 352)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !305, file: !291, line: 355, baseType: !172, size: 512, offset: 1216)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !186, file: !115, line: 134, baseType: !194, size: 64, offset: 2368)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !186, file: !115, line: 136, baseType: !349, size: 64, offset: 2432)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !115, line: 58, flags: DIFlagFwdDecl)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !186, file: !115, line: 138, baseType: !327, size: 384, offset: 2496)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !186, file: !115, line: 139, baseType: !353, size: 64, offset: 2880)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !291, line: 80, baseType: !355)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !291, line: 72, size: 192, elements: !356)
!356 = !{!357, !364, !365, !366, !367}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !355, file: !291, line: 73, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !291, line: 59, baseType: !360)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !291, line: 56, size: 128, elements: !361)
!361 = !{!362, !363}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !360, file: !291, line: 57, baseType: !318, size: 96)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !360, file: !291, line: 58, baseType: !167, size: 32, offset: 96)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !355, file: !291, line: 74, baseType: !167, size: 32, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !355, file: !291, line: 76, baseType: !167, size: 32, offset: 96)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !355, file: !291, line: 77, baseType: !167, size: 32, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !355, file: !291, line: 79, baseType: !167, size: 32, offset: 160)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !186, file: !115, line: 141, baseType: !245, size: 128, offset: 2944)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !186, file: !115, line: 142, baseType: !245, size: 128, offset: 3072)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !186, file: !115, line: 143, baseType: !245, size: 128, offset: 3200)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !186, file: !115, line: 144, baseType: !245, size: 128, offset: 3328)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !186, file: !115, line: 146, baseType: !167, size: 32, offset: 3456)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !186, file: !115, line: 147, baseType: !167, size: 32, offset: 3488)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !186, file: !115, line: 150, baseType: !375, size: 64, offset: 3520)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !258, line: 53, flags: DIFlagFwdDecl)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !186, file: !115, line: 151, baseType: !180, size: 64, offset: 3584)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !186, file: !115, line: 152, baseType: !167, size: 32, offset: 3648)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !186, file: !115, line: 153, baseType: !167, size: 32, offset: 3680)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !186, file: !115, line: 156, baseType: !318, size: 96, offset: 3712)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !186, file: !115, line: 156, baseType: !318, size: 96, offset: 3808)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !186, file: !115, line: 156, baseType: !318, size: 96, offset: 3904)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !186, file: !115, line: 157, baseType: !318, size: 96, offset: 4000)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !186, file: !115, line: 158, baseType: !318, size: 96, offset: 4096)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !186, file: !115, line: 159, baseType: !318, size: 96, offset: 4192)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !186, file: !115, line: 160, baseType: !318, size: 96, offset: 4288)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !186, file: !115, line: 160, baseType: !318, size: 96, offset: 4384)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !186, file: !115, line: 161, baseType: !390, size: 128, offset: 4480)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 128, elements: !391)
!391 = !{!392}
!392 = !DISubrange(count: 4)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !186, file: !115, line: 161, baseType: !390, size: 128, offset: 4608)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !186, file: !115, line: 162, baseType: !318, size: 96, offset: 4736)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !186, file: !115, line: 162, baseType: !318, size: 96, offset: 4832)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !186, file: !115, line: 163, baseType: !282, size: 32, offset: 4928)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !186, file: !115, line: 163, baseType: !282, size: 32, offset: 4960)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !186, file: !115, line: 164, baseType: !399, size: 512, offset: 4992)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 512, elements: !400)
!400 = !{!392, !392}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !186, file: !115, line: 165, baseType: !399, size: 512, offset: 5504)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !186, file: !115, line: 166, baseType: !399, size: 512, offset: 6016)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !186, file: !115, line: 167, baseType: !399, size: 512, offset: 6528)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !186, file: !115, line: 176, baseType: !399, size: 512, offset: 7040)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !186, file: !115, line: 178, baseType: !7, size: 32, offset: 7552)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !186, file: !115, line: 180, baseType: !222, size: 16, offset: 7584)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !186, file: !115, line: 181, baseType: !222, size: 16, offset: 7600)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !186, file: !115, line: 183, baseType: !222, size: 16, offset: 7616)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !186, file: !115, line: 183, baseType: !222, size: 16, offset: 7632)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !186, file: !115, line: 184, baseType: !222, size: 16, offset: 7648)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !186, file: !115, line: 184, baseType: !222, size: 16, offset: 7664)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !186, file: !115, line: 185, baseType: !222, size: 16, offset: 7680)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !186, file: !115, line: 186, baseType: !222, size: 16, offset: 7696)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !186, file: !115, line: 187, baseType: !222, size: 16, offset: 7712)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !186, file: !115, line: 188, baseType: !173, size: 8, offset: 7728)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !186, file: !115, line: 189, baseType: !173, size: 8, offset: 7736)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !186, file: !115, line: 192, baseType: !167, size: 32, offset: 7744)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !186, file: !115, line: 192, baseType: !167, size: 32, offset: 7776)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !186, file: !115, line: 192, baseType: !167, size: 32, offset: 7808)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !186, file: !115, line: 192, baseType: !167, size: 32, offset: 7840)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !186, file: !115, line: 194, baseType: !167, size: 32, offset: 7872)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !186, file: !115, line: 202, baseType: !282, size: 32, offset: 7904)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !186, file: !115, line: 202, baseType: !282, size: 32, offset: 7936)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !186, file: !115, line: 202, baseType: !282, size: 32, offset: 7968)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !186, file: !115, line: 211, baseType: !282, size: 32, offset: 8000)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !186, file: !115, line: 212, baseType: !282, size: 32, offset: 8032)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !186, file: !115, line: 213, baseType: !282, size: 32, offset: 8064)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !186, file: !115, line: 214, baseType: !282, size: 32, offset: 8096)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !186, file: !115, line: 215, baseType: !282, size: 32, offset: 8128)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !186, file: !115, line: 216, baseType: !282, size: 32, offset: 8160)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !186, file: !115, line: 219, baseType: !282, size: 32, offset: 8192)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !186, file: !115, line: 220, baseType: !282, size: 32, offset: 8224)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !186, file: !115, line: 221, baseType: !282, size: 32, offset: 8256)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !186, file: !115, line: 224, baseType: !435, size: 16, offset: 8288)
!435 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !186, file: !115, line: 224, baseType: !435, size: 16, offset: 8304)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !186, file: !115, line: 226, baseType: !222, size: 16, offset: 8320)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !186, file: !115, line: 228, baseType: !173, size: 8, offset: 8336)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !186, file: !115, line: 229, baseType: !173, size: 8, offset: 8344)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !186, file: !115, line: 231, baseType: !222, size: 16, offset: 8352)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !186, file: !115, line: 232, baseType: !173, size: 8, offset: 8368)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !186, file: !115, line: 233, baseType: !173, size: 8, offset: 8376)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !186, file: !115, line: 234, baseType: !282, size: 32, offset: 8384)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !186, file: !115, line: 235, baseType: !282, size: 32, offset: 8416)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !186, file: !115, line: 237, baseType: !245, size: 128, offset: 8448)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !186, file: !115, line: 238, baseType: !245, size: 128, offset: 8576)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !186, file: !115, line: 239, baseType: !245, size: 128, offset: 8704)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !186, file: !115, line: 240, baseType: !245, size: 128, offset: 8832)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !186, file: !115, line: 242, baseType: !282, size: 32, offset: 8960)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !186, file: !115, line: 244, baseType: !222, size: 16, offset: 8992)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !186, file: !115, line: 245, baseType: !435, size: 16, offset: 9008)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !186, file: !115, line: 246, baseType: !390, size: 128, offset: 9024)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !186, file: !115, line: 248, baseType: !167, size: 32, offset: 9152)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !186, file: !115, line: 249, baseType: !167, size: 32, offset: 9184)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !186, file: !115, line: 251, baseType: !456, size: 64, offset: 9216)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !115, line: 251, flags: DIFlagFwdDecl)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !186, file: !115, line: 253, baseType: !173, size: 8, offset: 9280)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !186, file: !115, line: 254, baseType: !173, size: 8, offset: 9288)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !186, file: !115, line: 255, baseType: !222, size: 16, offset: 9296)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !186, file: !115, line: 256, baseType: !318, size: 96, offset: 9312)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !186, file: !115, line: 258, baseType: !245, size: 128, offset: 9408)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !186, file: !115, line: 259, baseType: !245, size: 128, offset: 9536)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !186, file: !115, line: 260, baseType: !245, size: 128, offset: 9664)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !186, file: !115, line: 261, baseType: !245, size: 128, offset: 9792)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !186, file: !115, line: 263, baseType: !467, size: 64, offset: 9920)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !115, line: 52, flags: DIFlagFwdDecl)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !186, file: !115, line: 264, baseType: !470, size: 64, offset: 9984)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !115, line: 53, flags: DIFlagFwdDecl)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !186, file: !115, line: 265, baseType: !473, size: 64, offset: 10048)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !291, line: 46, flags: DIFlagFwdDecl)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !186, file: !115, line: 267, baseType: !173, size: 8, offset: 10112)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !186, file: !115, line: 268, baseType: !173, size: 8, offset: 10120)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !186, file: !115, line: 269, baseType: !222, size: 16, offset: 10128)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !186, file: !115, line: 270, baseType: !282, size: 32, offset: 10144)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !186, file: !115, line: 272, baseType: !480, size: 64, offset: 10176)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !105, line: 732, flags: DIFlagFwdDecl)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !186, file: !115, line: 275, baseType: !483, size: 64, offset: 10240)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !115, line: 275, flags: DIFlagFwdDecl)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !186, file: !115, line: 277, baseType: !486, size: 64, offset: 10304)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !28, line: 178, size: 13504, elements: !488)
!488 = !{!489, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !540, !543, !545, !546, !548, !549, !550, !551, !557, !562, !563, !567, !568, !569, !570, !571, !584, !596, !610, !614, !618, !622, !631, !643, !647, !651, !655, !659, !663, !664, !665, !666, !667, !668, !672, !673, !674, !675, !679, !680, !681, !682, !683, !688, !689, !690, !691, !692, !696, !697, !698, !699, !700, !707, !718, !723, !729, !739, !745, !756, !763, !770, !774, !779, !783, !788, !789, !790, !797, !803, !804, !805, !810, !811, !820, !929, !933, !941, !945, !949, !953, !961, !971}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !487, file: !28, line: 180, baseType: !490, size: 1600)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !61, line: 73, baseType: !491)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !61, line: 64, size: 1600, elements: !492)
!492 = !{!493, !508, !512, !513, !514, !515, !518}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !491, file: !61, line: 65, baseType: !494, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !61, line: 53, baseType: !496)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !61, line: 42, size: 832, elements: !497)
!497 = !{!498, !499, !500, !501, !502, !503, !504, !505, !506, !507}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !496, file: !61, line: 43, baseType: !167, size: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !496, file: !61, line: 44, baseType: !167, size: 32, offset: 32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !496, file: !61, line: 45, baseType: !167, size: 32, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !496, file: !61, line: 46, baseType: !167, size: 32, offset: 96)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !496, file: !61, line: 47, baseType: !167, size: 32, offset: 128)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !496, file: !61, line: 48, baseType: !167, size: 32, offset: 160)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !496, file: !61, line: 49, baseType: !167, size: 32, offset: 192)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !496, file: !61, line: 50, baseType: !167, size: 32, offset: 224)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !496, file: !61, line: 51, baseType: !172, size: 512, offset: 256)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !496, file: !61, line: 52, baseType: !194, size: 64, offset: 768)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !491, file: !61, line: 66, baseType: !509, size: 1312, offset: 64)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 1312, elements: !510)
!510 = !{!511}
!511 = !DISubrange(count: 41)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !491, file: !61, line: 69, baseType: !167, size: 32, offset: 1376)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !491, file: !61, line: 69, baseType: !167, size: 32, offset: 1408)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !491, file: !61, line: 70, baseType: !167, size: 32, offset: 1440)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !491, file: !61, line: 71, baseType: !516, size: 64, offset: 1472)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !61, line: 71, flags: DIFlagFwdDecl)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !491, file: !61, line: 72, baseType: !519, size: 64, offset: 1536)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !61, line: 59, baseType: !521)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !61, line: 57, size: 8192, elements: !522)
!522 = !{!523}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !521, file: !61, line: 58, baseType: !209, size: 8192)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !487, file: !28, line: 180, baseType: !490, size: 1600, offset: 1600)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !487, file: !28, line: 180, baseType: !490, size: 1600, offset: 3200)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !487, file: !28, line: 180, baseType: !490, size: 1600, offset: 4800)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !487, file: !28, line: 180, baseType: !490, size: 1600, offset: 6400)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !487, file: !28, line: 181, baseType: !167, size: 32, offset: 8000)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !487, file: !28, line: 181, baseType: !167, size: 32, offset: 8032)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !487, file: !28, line: 181, baseType: !167, size: 32, offset: 8064)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !487, file: !28, line: 181, baseType: !167, size: 32, offset: 8096)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !487, file: !28, line: 181, baseType: !167, size: 32, offset: 8128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !487, file: !28, line: 182, baseType: !167, size: 32, offset: 8160)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !487, file: !28, line: 183, baseType: !167, size: 32, offset: 8192)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !487, file: !28, line: 184, baseType: !536, size: 64, offset: 8256)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !537, line: 124, baseType: !538)
!537 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !537, line: 124, flags: DIFlagFwdDecl)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !487, file: !28, line: 185, baseType: !541, size: 64, offset: 8320)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !28, line: 97, flags: DIFlagFwdDecl)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !487, file: !28, line: 186, baseType: !544, size: 32, offset: 8384)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !28, line: 132, baseType: !27)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !487, file: !28, line: 187, baseType: !282, size: 32, offset: 8416)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !487, file: !28, line: 188, baseType: !547, size: 32, offset: 8448)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !28, line: 175, baseType: !33)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !487, file: !28, line: 189, baseType: !167, size: 32, offset: 8480)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !487, file: !28, line: 190, baseType: !375, size: 64, offset: 8512)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !487, file: !28, line: 193, baseType: !173, size: 8, offset: 8576)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !487, file: !28, line: 196, baseType: !552, size: 64, offset: 8640)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DISubroutineType(types: !554)
!554 = !{null, !555}
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !28, line: 177, baseType: !487)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !487, file: !28, line: 199, baseType: !558, size: 64, offset: 8704)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DISubroutineType(types: !560)
!560 = !{null, !555, !561}
!561 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !282)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !487, file: !28, line: 202, baseType: !552, size: 64, offset: 8768)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !487, file: !28, line: 207, baseType: !564, size: 64, offset: 8832)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DISubroutineType(types: !566)
!566 = !{!167, !555}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !487, file: !28, line: 208, baseType: !564, size: 64, offset: 8896)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !487, file: !28, line: 209, baseType: !564, size: 64, offset: 8960)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !487, file: !28, line: 210, baseType: !564, size: 64, offset: 9024)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !487, file: !28, line: 211, baseType: !564, size: 64, offset: 9088)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !487, file: !28, line: 218, baseType: !572, size: 64, offset: 9152)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DISubroutineType(types: !574)
!574 = !{null, !555, !167, !575}
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !577, line: 65, size: 160, elements: !578)
!577 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!578 = !{!579, !580, !582, !583}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !576, file: !577, line: 66, baseType: !318, size: 96)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !576, file: !577, line: 67, baseType: !581, size: 48, offset: 96)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 48, elements: !319)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !576, file: !577, line: 68, baseType: !173, size: 8, offset: 144)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !576, file: !577, line: 68, baseType: !173, size: 8, offset: 152)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !487, file: !28, line: 219, baseType: !585, size: 64, offset: 9216)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DISubroutineType(types: !587)
!587 = !{null, !555, !167, !588}
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !577, line: 48, size: 96, elements: !590)
!590 = !{!591, !592, !593, !594, !595}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !589, file: !577, line: 49, baseType: !7, size: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !589, file: !577, line: 49, baseType: !7, size: 32, offset: 32)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !589, file: !577, line: 50, baseType: !173, size: 8, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !589, file: !577, line: 50, baseType: !173, size: 8, offset: 72)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !589, file: !577, line: 51, baseType: !222, size: 16, offset: 80)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !487, file: !28, line: 220, baseType: !597, size: 64, offset: 9280)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DISubroutineType(types: !599)
!599 = !{null, !555, !167, !600}
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !577, line: 42, size: 160, elements: !602)
!602 = !{!603, !604, !605, !606, !607, !608, !609}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !601, file: !577, line: 43, baseType: !7, size: 32)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !601, file: !577, line: 43, baseType: !7, size: 32, offset: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !601, file: !577, line: 43, baseType: !7, size: 32, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !601, file: !577, line: 43, baseType: !7, size: 32, offset: 96)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !601, file: !577, line: 44, baseType: !222, size: 16, offset: 128)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !601, file: !577, line: 45, baseType: !173, size: 8, offset: 144)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !601, file: !577, line: 45, baseType: !173, size: 8, offset: 152)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !487, file: !28, line: 227, baseType: !611, size: 64, offset: 9344)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DISubroutineType(types: !613)
!613 = !{!575, !555}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !487, file: !28, line: 228, baseType: !615, size: 64, offset: 9408)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{!588, !555}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !487, file: !28, line: 229, baseType: !619, size: 64, offset: 9472)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DISubroutineType(types: !621)
!621 = !{!600, !555}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !487, file: !28, line: 230, baseType: !623, size: 64, offset: 9536)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DISubroutineType(types: !625)
!625 = !{!626, !555}
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !577, line: 88, size: 64, elements: !628)
!628 = !{!629, !630}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !627, file: !577, line: 89, baseType: !7, size: 32)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !627, file: !577, line: 90, baseType: !7, size: 32, offset: 32)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !487, file: !28, line: 231, baseType: !632, size: 64, offset: 9600)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DISubroutineType(types: !634)
!634 = !{!635, !555}
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !577, line: 79, size: 96, elements: !637)
!637 = !{!638, !639, !640, !641, !642}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !636, file: !577, line: 81, baseType: !167, size: 32)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !636, file: !577, line: 82, baseType: !167, size: 32, offset: 32)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !636, file: !577, line: 83, baseType: !222, size: 16, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !636, file: !577, line: 84, baseType: !173, size: 8, offset: 80)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !636, file: !577, line: 84, baseType: !173, size: 8, offset: 88)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !487, file: !28, line: 236, baseType: !644, size: 64, offset: 9664)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DISubroutineType(types: !646)
!646 = !{null, !555, !575}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !487, file: !28, line: 237, baseType: !648, size: 64, offset: 9728)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DISubroutineType(types: !650)
!650 = !{null, !555, !588}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !487, file: !28, line: 238, baseType: !652, size: 64, offset: 9792)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DISubroutineType(types: !654)
!654 = !{null, !555, !600}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !487, file: !28, line: 239, baseType: !656, size: 64, offset: 9856)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{null, !555, !626}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !487, file: !28, line: 240, baseType: !660, size: 64, offset: 9920)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DISubroutineType(types: !662)
!662 = !{null, !555, !635}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !487, file: !28, line: 245, baseType: !611, size: 64, offset: 9984)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !487, file: !28, line: 246, baseType: !615, size: 64, offset: 10048)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !487, file: !28, line: 247, baseType: !619, size: 64, offset: 10112)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !487, file: !28, line: 248, baseType: !623, size: 64, offset: 10176)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !487, file: !28, line: 249, baseType: !632, size: 64, offset: 10240)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !487, file: !28, line: 255, baseType: !669, size: 64, offset: 10304)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DISubroutineType(types: !671)
!671 = !{!194, !555, !167, !167}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !487, file: !28, line: 256, baseType: !669, size: 64, offset: 10368)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !487, file: !28, line: 257, baseType: !669, size: 64, offset: 10432)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !487, file: !28, line: 258, baseType: !669, size: 64, offset: 10496)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !487, file: !28, line: 264, baseType: !676, size: 64, offset: 10560)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DISubroutineType(types: !678)
!678 = !{!194, !555, !167}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !487, file: !28, line: 265, baseType: !676, size: 64, offset: 10624)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !487, file: !28, line: 266, baseType: !676, size: 64, offset: 10688)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !487, file: !28, line: 267, baseType: !676, size: 64, offset: 10752)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !487, file: !28, line: 268, baseType: !676, size: 64, offset: 10816)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataLayout", scope: !487, file: !28, line: 272, baseType: !684, size: 64, offset: 10880)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DISubroutineType(types: !686)
!686 = !{!687, !555}
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataLayout", scope: !487, file: !28, line: 273, baseType: !684, size: 64, offset: 10944)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataLayout", scope: !487, file: !28, line: 274, baseType: !684, size: 64, offset: 11008)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataLayout", scope: !487, file: !28, line: 275, baseType: !684, size: 64, offset: 11072)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataLayout", scope: !487, file: !28, line: 276, baseType: !684, size: 64, offset: 11136)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromVertCData", scope: !487, file: !28, line: 279, baseType: !693, size: 64, offset: 11200)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DISubroutineType(types: !695)
!695 = !{null, !555, !167, !687, !167}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromEdgeCData", scope: !487, file: !28, line: 280, baseType: !693, size: 64, offset: 11264)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromFaceCData", scope: !487, file: !28, line: 281, baseType: !693, size: 64, offset: 11328)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "getNumGrids", scope: !487, file: !28, line: 284, baseType: !564, size: 64, offset: 11392)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "getGridSize", scope: !487, file: !28, line: 285, baseType: !564, size: 64, offset: 11456)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "getGridData", scope: !487, file: !28, line: 286, baseType: !701, size: 64, offset: 11520)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DISubroutineType(types: !703)
!703 = !{!704, !555}
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !28, line: 82, flags: DIFlagFwdDecl)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "getGridAdjacency", scope: !487, file: !28, line: 287, baseType: !708, size: 64, offset: 11584)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DISubroutineType(types: !710)
!710 = !{!711, !555}
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGridAdjacency", file: !28, line: 120, baseType: !713)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMGridAdjacency", file: !28, line: 117, size: 256, elements: !714)
!714 = !{!715, !717}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !713, file: !28, line: 118, baseType: !716, size: 128)
!716 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 128, elements: !391)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !713, file: !28, line: 119, baseType: !716, size: 128, offset: 128)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "getGridOffset", scope: !487, file: !28, line: 288, baseType: !719, size: 64, offset: 11648)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DISubroutineType(types: !721)
!721 = !{!722, !555}
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "getGridKey", scope: !487, file: !28, line: 289, baseType: !724, size: 64, offset: 11712)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DISubroutineType(types: !726)
!726 = !{null, !555, !727}
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGKey", file: !28, line: 83, flags: DIFlagFwdDecl)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "getGridFlagMats", scope: !487, file: !28, line: 290, baseType: !730, size: 64, offset: 11776)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DISubroutineType(types: !732)
!732 = !{!733, !555}
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFlagMat", file: !28, line: 126, baseType: !735)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMFlagMat", file: !28, line: 123, size: 32, elements: !736)
!736 = !{!737, !738}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !735, file: !28, line: 124, baseType: !222, size: 16)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !735, file: !28, line: 125, baseType: !173, size: 8, offset: 16)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "getGridHidden", scope: !487, file: !28, line: 291, baseType: !740, size: 64, offset: 11840)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DISubroutineType(types: !742)
!742 = !{!743, !555}
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedVert", scope: !487, file: !28, line: 299, baseType: !746, size: 64, offset: 11904)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{null, !555, !749, !194, !755}
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{null, !194, !167, !752, !752, !753}
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !222)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMForeachFlag", file: !28, line: 162, baseType: !38)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedEdge", scope: !487, file: !28, line: 309, baseType: !757, size: 64, offset: 11968)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DISubroutineType(types: !759)
!759 = !{null, !555, !760, !194}
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DISubroutineType(types: !762)
!762 = !{null, !194, !167, !752, !752}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedLoop", scope: !487, file: !28, line: 317, baseType: !764, size: 64, offset: 12032)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DISubroutineType(types: !766)
!766 = !{null, !555, !767, !194, !755}
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DISubroutineType(types: !769)
!769 = !{null, !194, !167, !167, !752, !752}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedFaceCenter", scope: !487, file: !28, line: 327, baseType: !771, size: 64, offset: 12096)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DISubroutineType(types: !773)
!773 = !{null, !555, !760, !194, !755}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "getMinMax", scope: !487, file: !28, line: 337, baseType: !775, size: 64, offset: 12160)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DISubroutineType(types: !777)
!777 = !{null, !555, !778, !778}
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCo", scope: !487, file: !28, line: 344, baseType: !780, size: 64, offset: 12224)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DISubroutineType(types: !782)
!782 = !{null, !555, !167, !778}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCos", scope: !487, file: !28, line: 347, baseType: !784, size: 64, offset: 12288)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DISubroutineType(types: !786)
!786 = !{null, !555, !787}
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "getVertNo", scope: !487, file: !28, line: 350, baseType: !780, size: 64, offset: 12352)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyNo", scope: !487, file: !28, line: 351, baseType: !780, size: 64, offset: 12416)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyMap", scope: !487, file: !28, line: 355, baseType: !791, size: 64, offset: 12480)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DISubroutineType(types: !793)
!793 = !{!794, !185, !555}
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !796)
!796 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !28, line: 355, flags: DIFlagFwdDecl)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "getPBVH", scope: !487, file: !28, line: 359, baseType: !798, size: 64, offset: 12544)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DISubroutineType(types: !800)
!800 = !{!801, !185, !555}
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !28, line: 100, flags: DIFlagFwdDecl)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "drawVerts", scope: !487, file: !28, line: 364, baseType: !552, size: 64, offset: 12608)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "drawUVEdges", scope: !487, file: !28, line: 367, baseType: !552, size: 64, offset: 12672)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "drawEdges", scope: !487, file: !28, line: 373, baseType: !806, size: 64, offset: 12736)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DISubroutineType(types: !808)
!808 = !{null, !555, !809, !809}
!809 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "drawLooseEdges", scope: !487, file: !28, line: 376, baseType: !552, size: 64, offset: 12800)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesSolid", scope: !487, file: !28, line: 385, baseType: !812, size: 64, offset: 12864)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DISubroutineType(types: !814)
!814 = !{null, !555, !815, !809, !816}
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetMaterial", file: !28, line: 146, baseType: !817)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DISubroutineType(types: !819)
!819 = !{!167, !167, !194}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesTex", scope: !487, file: !28, line: 391, baseType: !821, size: 64, offset: 12928)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DISubroutineType(types: !823)
!823 = !{null, !555, !824, !924, !194, !928}
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptionsTex", file: !28, line: 150, baseType: !825)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DISubroutineType(types: !827)
!827 = !{!828, !829, !923, !167}
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawOption", file: !28, line: 143, baseType: !42)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !577, line: 160, size: 384, elements: !831)
!831 = !{!832, !836, !918, !919, !920, !921, !922}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !830, file: !577, line: 161, baseType: !833, size: 256)
!833 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 256, elements: !834)
!834 = !{!392, !835}
!835 = !DISubrange(count: 2)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !830, file: !577, line: 162, baseType: !837, size: 64, offset: 256)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !839, line: 77, size: 15424, elements: !840)
!839 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!840 = !{!841, !842, !843, !846, !849, !852, !855, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !907, !908, !912}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !838, file: !839, line: 78, baseType: !189, size: 960)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !838, file: !839, line: 80, baseType: !209, size: 8192, offset: 960)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !838, file: !839, line: 82, baseType: !844, size: 64, offset: 9152)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !839, line: 43, flags: DIFlagFwdDecl)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !838, file: !839, line: 83, baseType: !847, size: 64, offset: 9216)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !190, line: 46, flags: DIFlagFwdDecl)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !838, file: !839, line: 86, baseType: !850, size: 64, offset: 9280)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !839, line: 41, flags: DIFlagFwdDecl)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !838, file: !839, line: 87, baseType: !853, size: 64, offset: 9344)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !839, line: 44, flags: DIFlagFwdDecl)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !838, file: !839, line: 89, baseType: !856, size: 512, offset: 9408)
!856 = !DICompositeType(tag: DW_TAG_array_type, baseType: !853, size: 512, elements: !857)
!857 = !{!284}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !838, file: !839, line: 90, baseType: !222, size: 16, offset: 9920)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !838, file: !839, line: 90, baseType: !222, size: 16, offset: 9936)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !838, file: !839, line: 92, baseType: !222, size: 16, offset: 9952)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !838, file: !839, line: 92, baseType: !222, size: 16, offset: 9968)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !838, file: !839, line: 93, baseType: !222, size: 16, offset: 9984)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !838, file: !839, line: 93, baseType: !222, size: 16, offset: 10000)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !838, file: !839, line: 94, baseType: !167, size: 32, offset: 10016)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !838, file: !839, line: 97, baseType: !222, size: 16, offset: 10048)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !838, file: !839, line: 97, baseType: !222, size: 16, offset: 10064)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !838, file: !839, line: 98, baseType: !222, size: 16, offset: 10080)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !838, file: !839, line: 98, baseType: !222, size: 16, offset: 10096)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !838, file: !839, line: 99, baseType: !222, size: 16, offset: 10112)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !838, file: !839, line: 99, baseType: !222, size: 16, offset: 10128)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !838, file: !839, line: 100, baseType: !7, size: 32, offset: 10144)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !838, file: !839, line: 101, baseType: !744, size: 64, offset: 10176)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !838, file: !839, line: 103, baseType: !215, size: 64, offset: 10240)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !838, file: !839, line: 104, baseType: !875, size: 64, offset: 10304)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !190, line: 159, size: 448, elements: !877)
!877 = !{!878, !881, !882, !884, !885, !887}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !876, file: !190, line: 161, baseType: !879, size: 64)
!879 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !880)
!880 = !{!835}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !876, file: !190, line: 162, baseType: !879, size: 64, offset: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !876, file: !190, line: 163, baseType: !883, size: 32, offset: 128)
!883 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 32, elements: !880)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !876, file: !190, line: 164, baseType: !883, size: 32, offset: 160)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !876, file: !190, line: 165, baseType: !886, size: 128, offset: 192)
!886 = !DICompositeType(tag: DW_TAG_array_type, baseType: !744, size: 128, elements: !880)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !876, file: !190, line: 166, baseType: !888, size: 128, offset: 320)
!888 = !DICompositeType(tag: DW_TAG_array_type, baseType: !847, size: 128, elements: !880)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !838, file: !839, line: 107, baseType: !282, size: 32, offset: 10368)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !838, file: !839, line: 108, baseType: !167, size: 32, offset: 10400)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !838, file: !839, line: 109, baseType: !222, size: 16, offset: 10432)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !838, file: !839, line: 110, baseType: !222, size: 16, offset: 10448)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !838, file: !839, line: 113, baseType: !167, size: 32, offset: 10464)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !838, file: !839, line: 113, baseType: !167, size: 32, offset: 10496)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !838, file: !839, line: 114, baseType: !173, size: 8, offset: 10528)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !838, file: !839, line: 114, baseType: !173, size: 8, offset: 10536)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !838, file: !839, line: 115, baseType: !222, size: 16, offset: 10544)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !838, file: !839, line: 116, baseType: !390, size: 128, offset: 10560)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !838, file: !839, line: 119, baseType: !282, size: 32, offset: 10688)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !838, file: !839, line: 119, baseType: !282, size: 32, offset: 10720)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !838, file: !839, line: 122, baseType: !902, size: 512, offset: 10752)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !903, line: 182, baseType: !904)
!903 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !903, line: 180, size: 512, elements: !905)
!905 = !{!906}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !904, file: !903, line: 181, baseType: !172, size: 512)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !838, file: !839, line: 123, baseType: !173, size: 8, offset: 11264)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !838, file: !839, line: 125, baseType: !909, size: 56, offset: 11272)
!909 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 56, elements: !910)
!910 = !{!911}
!911 = !DISubrange(count: 7)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !838, file: !839, line: 126, baseType: !913, size: 4096, offset: 11328)
!913 = !DICompositeType(tag: DW_TAG_array_type, baseType: !914, size: 4096, elements: !857)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !839, line: 69, baseType: !915)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !839, line: 67, size: 512, elements: !916)
!916 = !{!917}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !915, file: !839, line: 68, baseType: !172, size: 512)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !830, file: !577, line: 163, baseType: !173, size: 8, offset: 320)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !830, file: !577, line: 163, baseType: !173, size: 8, offset: 328)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !830, file: !577, line: 164, baseType: !222, size: 16, offset: 336)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !830, file: !577, line: 164, baseType: !222, size: 16, offset: 352)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !830, file: !577, line: 164, baseType: !222, size: 16, offset: 368)
!923 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !809)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCompareDrawOptions", file: !28, line: 147, baseType: !925)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DISubroutineType(types: !927)
!927 = !{!167, !194, !167, !167}
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawFlag", file: !28, line: 157, baseType: !48)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesGLSL", scope: !487, file: !28, line: 400, baseType: !930, size: 64, offset: 12992)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DISubroutineType(types: !932)
!932 = !{null, !555, !816}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFaces", scope: !487, file: !28, line: 415, baseType: !934, size: 64, offset: 13056)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DISubroutineType(types: !936)
!936 = !{null, !555, !937, !816, !924, !194, !928}
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptions", file: !28, line: 149, baseType: !938)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DISubroutineType(types: !940)
!940 = !{!828, !194, !167}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesTex", scope: !487, file: !28, line: 425, baseType: !942, size: 64, offset: 13120)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DISubroutineType(types: !944)
!944 = !{null, !555, !937, !924, !194, !928}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesGLSL", scope: !487, file: !28, line: 435, baseType: !946, size: 64, offset: 13184)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DISubroutineType(types: !948)
!948 = !{null, !555, !816, !937, !194}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdges", scope: !487, file: !28, line: 444, baseType: !950, size: 64, offset: 13248)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DISubroutineType(types: !952)
!952 = !{null, !555, !937, !194}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdgesInterp", scope: !487, file: !28, line: 455, baseType: !954, size: 64, offset: 13312)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DISubroutineType(types: !956)
!956 = !{null, !555, !937, !957, !194}
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawInterpOptions", file: !28, line: 148, baseType: !958)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DISubroutineType(types: !960)
!960 = !{null, !194, !167, !282}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesMat", scope: !487, file: !28, line: 464, baseType: !962, size: 64, offset: 13376)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DISubroutineType(types: !964)
!964 = !{null, !555, !965, !968, !194}
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DISubroutineType(types: !967)
!967 = !{null, !194, !167, !194}
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DISubroutineType(types: !970)
!970 = !{!809, !194, !167}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !487, file: !28, line: 470, baseType: !552, size: 64, offset: 13440)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !186, file: !115, line: 277, baseType: !486, size: 64, offset: 10368)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !186, file: !115, line: 278, baseType: !974, size: 64, offset: 10432)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !975, line: 27, baseType: !976)
!975 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !977, line: 45, baseType: !978)
!977 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!978 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !186, file: !115, line: 279, baseType: !974, size: 64, offset: 10496)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !186, file: !115, line: 280, baseType: !7, size: 32, offset: 10560)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !186, file: !115, line: 281, baseType: !7, size: 32, offset: 10592)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !186, file: !115, line: 283, baseType: !245, size: 128, offset: 10624)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !186, file: !115, line: 284, baseType: !245, size: 128, offset: 10752)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !186, file: !115, line: 285, baseType: !985, size: 64, offset: 10880)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !186, file: !115, line: 287, baseType: !987, size: 64, offset: 10944)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !115, line: 59, flags: DIFlagFwdDecl)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !186, file: !115, line: 288, baseType: !990, size: 64, offset: 11008)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !115, line: 288, flags: DIFlagFwdDecl)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !186, file: !115, line: 290, baseType: !993, size: 64, offset: 11072)
!993 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 64, elements: !880)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !186, file: !115, line: 291, baseType: !995, size: 64, offset: 11136)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !839, line: 65, baseType: !997)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !839, line: 50, size: 320, elements: !998)
!998 = !{!999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !997, file: !839, line: 51, baseType: !177, size: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !997, file: !839, line: 53, baseType: !167, size: 32, offset: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !997, file: !839, line: 54, baseType: !167, size: 32, offset: 96)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !997, file: !839, line: 55, baseType: !167, size: 32, offset: 128)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !997, file: !839, line: 55, baseType: !167, size: 32, offset: 160)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !997, file: !839, line: 56, baseType: !173, size: 8, offset: 192)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !997, file: !839, line: 56, baseType: !173, size: 8, offset: 200)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !997, file: !839, line: 57, baseType: !173, size: 8, offset: 208)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !997, file: !839, line: 57, baseType: !173, size: 8, offset: 216)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !997, file: !839, line: 59, baseType: !222, size: 16, offset: 224)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !997, file: !839, line: 59, baseType: !222, size: 16, offset: 240)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !997, file: !839, line: 59, baseType: !222, size: 16, offset: 256)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !997, file: !839, line: 61, baseType: !222, size: 16, offset: 272)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !997, file: !839, line: 63, baseType: !167, size: 32, offset: 288)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !186, file: !115, line: 293, baseType: !245, size: 128, offset: 11200)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !186, file: !115, line: 294, baseType: !1015, size: 64, offset: 11328)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !115, line: 113, baseType: !1017)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !115, line: 108, size: 256, elements: !1018)
!1018 = !{!1019, !1021, !1022, !1023, !1024}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1017, file: !115, line: 109, baseType: !1020, size: 64)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1017, file: !115, line: 109, baseType: !1020, size: 64, offset: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1017, file: !115, line: 110, baseType: !185, size: 64, offset: 128)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1017, file: !115, line: 111, baseType: !167, size: 32, offset: 192)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !1017, file: !115, line: 112, baseType: !282, size: 32, offset: 224)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "mask_constant", scope: !157, file: !105, line: 1071, baseType: !282, size: 32, offset: 1536)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "mask_defgrp_name", scope: !157, file: !105, line: 1072, baseType: !172, size: 512, offset: 1568)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "mask_tex_use_channel", scope: !157, file: !105, line: 1075, baseType: !167, size: 32, offset: 2080)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "mask_texture", scope: !157, file: !105, line: 1076, baseType: !1029, size: 64, offset: 2112)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !1031, line: 202, size: 3328, elements: !1032)
!1031 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1032 = !{!1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1088, !1089, !1090, !1116, !1144, !1145, !1220, !1241, !1249, !1250}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1030, file: !1031, line: 203, baseType: !189, size: 960)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1030, file: !1031, line: 204, baseType: !256, size: 64, offset: 960)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !1030, file: !1031, line: 206, baseType: !282, size: 32, offset: 1024)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !1030, file: !1031, line: 206, baseType: !282, size: 32, offset: 1056)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !1030, file: !1031, line: 207, baseType: !282, size: 32, offset: 1088)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !1030, file: !1031, line: 207, baseType: !282, size: 32, offset: 1120)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !1030, file: !1031, line: 207, baseType: !282, size: 32, offset: 1152)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !1030, file: !1031, line: 207, baseType: !282, size: 32, offset: 1184)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !1030, file: !1031, line: 207, baseType: !282, size: 32, offset: 1216)
