; ModuleID = 'blender/source/blender/editors/sculpt_paint/paint_image.c'
source_filename = "blender/source/blender/editors/sculpt_paint/paint_image.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ImagePaintPartialRedraw = type { i32, i32, i32, i32, i32 }
%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }

!199 = !DIEnumerator(name: "PAINT_TEXTURE_PROJECTIVE", value: 3, isUnsigned: true)
!200 = !DIEnumerator(name: "PAINT_TEXTURE_2D", value: 4, isUnsigned: true)
!201 = !DIEnumerator(name: "PAINT_SCULPT_UV", value: 5, isUnsigned: true)
!202 = !DIEnumerator(name: "PAINT_INVALID", value: 6, isUnsigned: true)
!203 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !204, line: 1669, baseType: !7, size: 32, elements: !205)
!204 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!205 = !{!206, !207, !208}
!206 = !DIEnumerator(name: "PAINT_SHOW_BRUSH", value: 1, isUnsigned: true)
!207 = !DIEnumerator(name: "PAINT_FAST_NAVIGATE", value: 2, isUnsigned: true)
!208 = !DIEnumerator(name: "PAINT_SHOW_BRUSH_ON_SURFACE", value: 4, isUnsigned: true)
!209 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !210, line: 82, baseType: !7, size: 32, elements: !211)
!210 = !DIFile(filename: "blender/source/blender/windowmanager/wm_cursors.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!211 = !{!212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229}
!212 = !DIEnumerator(name: "BC_NW_ARROWCURSOR", value: 2, isUnsigned: true)
!213 = !DIEnumerator(name: "BC_NS_ARROWCURSOR", value: 3, isUnsigned: true)
!214 = !DIEnumerator(name: "BC_EW_ARROWCURSOR", value: 4, isUnsigned: true)
!215 = !DIEnumerator(name: "BC_WAITCURSOR", value: 5, isUnsigned: true)
!216 = !DIEnumerator(name: "BC_CROSSCURSOR", value: 6, isUnsigned: true)
!217 = !DIEnumerator(name: "BC_EDITCROSSCURSOR", value: 7, isUnsigned: true)
!218 = !DIEnumerator(name: "BC_BOXSELCURSOR", value: 8, isUnsigned: true)
!219 = !DIEnumerator(name: "BC_KNIFECURSOR", value: 9, isUnsigned: true)
!220 = !DIEnumerator(name: "BC_VLOOPCURSOR", value: 10, isUnsigned: true)
!221 = !DIEnumerator(name: "BC_TEXTEDITCURSOR", value: 11, isUnsigned: true)
!222 = !DIEnumerator(name: "BC_PAINTBRUSHCURSOR", value: 12, isUnsigned: true)
!223 = !DIEnumerator(name: "BC_HANDCURSOR", value: 13, isUnsigned: true)
!224 = !DIEnumerator(name: "BC_NSEW_SCROLLCURSOR", value: 14, isUnsigned: true)
!225 = !DIEnumerator(name: "BC_NS_SCROLLCURSOR", value: 15, isUnsigned: true)
!226 = !DIEnumerator(name: "BC_EW_SCROLLCURSOR", value: 16, isUnsigned: true)
!227 = !DIEnumerator(name: "BC_EYEDROPPER_CURSOR", value: 17, isUnsigned: true)
!228 = !DIEnumerator(name: "BC_SWAPAREA_CURSOR", value: 18, isUnsigned: true)
!229 = !DIEnumerator(name: "BC_NUMCURSORS", value: 19, isUnsigned: true)
!230 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ImagePaintMode", file: !204, line: 1717, baseType: !7, size: 32, elements: !231)
!231 = !{!232, !233}
!232 = !DIEnumerator(name: "IMAGEPAINT_MODE_MATERIAL", value: 0, isUnsigned: true)
!233 = !DIEnumerator(name: "IMAGEPAINT_MODE_IMAGE", value: 1, isUnsigned: true)
!234 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !172, line: 339, baseType: !7, size: 32, elements: !235)
!235 = !{!236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246}
!236 = !DIEnumerator(name: "OB_EMPTY", value: 0, isUnsigned: true)
!237 = !DIEnumerator(name: "OB_MESH", value: 1, isUnsigned: true)
!238 = !DIEnumerator(name: "OB_CURVE", value: 2, isUnsigned: true)
!239 = !DIEnumerator(name: "OB_SURF", value: 3, isUnsigned: true)
!240 = !DIEnumerator(name: "OB_FONT", value: 4, isUnsigned: true)
!241 = !DIEnumerator(name: "OB_MBALL", value: 5, isUnsigned: true)
!242 = !DIEnumerator(name: "OB_LAMP", value: 10, isUnsigned: true)
!243 = !DIEnumerator(name: "OB_CAMERA", value: 11, isUnsigned: true)
!244 = !DIEnumerator(name: "OB_SPEAKER", value: 12, isUnsigned: true)
!245 = !DIEnumerator(name: "OB_LATTICE", value: 22, isUnsigned: true)
!246 = !DIEnumerator(name: "OB_ARMATURE", value: 25, isUnsigned: true)
!247 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !204, line: 1027, baseType: !7, size: 32, elements: !248)
!248 = !{!249, !250, !251, !252, !253, !254, !255}
!249 = !DIEnumerator(name: "UNIFIED_PAINT_SIZE", value: 1, isUnsigned: true)
!250 = !DIEnumerator(name: "UNIFIED_PAINT_ALPHA", value: 2, isUnsigned: true)
!251 = !DIEnumerator(name: "UNIFIED_PAINT_WEIGHT", value: 32, isUnsigned: true)
!252 = !DIEnumerator(name: "UNIFIED_PAINT_COLOR", value: 64, isUnsigned: true)
!253 = !DIEnumerator(name: "UNIFIED_PAINT_BRUSH_LOCK_SIZE", value: 4, isUnsigned: true)
!254 = !DIEnumerator(name: "UNIFIED_PAINT_BRUSH_SIZE_PRESSURE", value: 8, isUnsigned: true)
!255 = !DIEnumerator(name: "UNIFIED_PAINT_BRUSH_ALPHA_PRESSURE", value: 16, isUnsigned: true)
!256 = !{!257, !258, !3779, !309}
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceImage", file: !129, line: 743, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceImage", file: !129, line: 710, size: 84672, elements: !261)
!261 = !{!262, !285, !286, !287, !288, !289, !438, !3711, !3712, !3753, !3754, !3755, !3756, !3757, !3758, !3759, !3760, !3761, !3762, !3763, !3764, !3765, !3766, !3767, !3768, !3769, !3770}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !260, file: !129, line: 711, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceLink", file: !129, line: 91, baseType: !265)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !129, line: 85, size: 448, elements: !266)
!266 = !{!267, !269, !270, !277, !278, !280}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !265, file: !129, line: 86, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !265, file: !129, line: 86, baseType: !268, size: 64, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !265, file: !129, line: 87, baseType: !271, size: 128, offset: 128)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !272, line: 71, baseType: !273)
!272 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !272, line: 69, size: 128, elements: !274)
!274 = !{!275, !276}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !273, file: !272, line: 70, baseType: !257, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !273, file: !272, line: 70, baseType: !257, size: 64, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !265, file: !129, line: 88, baseType: !87, size: 32, offset: 256)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !265, file: !129, line: 89, baseType: !279, size: 32, offset: 288)
!279 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !265, file: !129, line: 90, baseType: !281, size: 128, offset: 320)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 128, elements: !283)
!282 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!283 = !{!284}
!284 = !DISubrange(count: 8)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !260, file: !129, line: 711, baseType: !263, size: 64, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !260, file: !129, line: 712, baseType: !271, size: 128, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !260, file: !129, line: 713, baseType: !87, size: 32, offset: 256)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !260, file: !129, line: 715, baseType: !87, size: 32, offset: 288)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !260, file: !129, line: 717, baseType: !290, size: 64, offset: 320)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !292, line: 77, size: 15424, elements: !293)
!292 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!293 = !{!294, !357, !358, !361, !364, !368, !371, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !389, !390, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !419, !420, !421, !427, !428, !432}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !291, file: !292, line: 78, baseType: !295, size: 960)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !296, line: 130, baseType: !297)
!296 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !296, line: 117, size: 960, elements: !298)
!298 = !{!299, !300, !301, !303, !323, !327, !328, !329, !330, !331}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !297, file: !296, line: 118, baseType: !257, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !297, file: !296, line: 118, baseType: !257, size: 64, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !297, file: !296, line: 119, baseType: !302, size: 64, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !297, file: !296, line: 120, baseType: !304, size: 64, offset: 192)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !296, line: 136, size: 17600, elements: !306)
!306 = !{!307, !308, !310, !313, !318, !319, !320}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !305, file: !296, line: 137, baseType: !295, size: 960)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !305, file: !296, line: 138, baseType: !309, size: 64, offset: 960)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !305, file: !296, line: 139, baseType: !311, size: 64, offset: 1024)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !296, line: 43, flags: DIFlagFwdDecl)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !305, file: !296, line: 140, baseType: !314, size: 8192, offset: 1088)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !315, size: 8192, elements: !316)
!315 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!316 = !{!317}
!317 = !DISubrange(count: 1024)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !305, file: !296, line: 141, baseType: !314, size: 8192, offset: 9280)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !305, file: !296, line: 148, baseType: !304, size: 64, offset: 17472)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !305, file: !296, line: 150, baseType: !321, size: 64, offset: 17536)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !296, line: 45, flags: DIFlagFwdDecl)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !297, file: !296, line: 121, baseType: !324, size: 528, offset: 256)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !315, size: 528, elements: !325)
!325 = !{!326}
!326 = !DISubrange(count: 66)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !297, file: !296, line: 126, baseType: !282, size: 16, offset: 784)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !297, file: !296, line: 127, baseType: !87, size: 32, offset: 800)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !297, file: !296, line: 128, baseType: !87, size: 32, offset: 832)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !297, file: !296, line: 128, baseType: !87, size: 32, offset: 864)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !297, file: !296, line: 129, baseType: !332, size: 64, offset: 896)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !296, line: 75, baseType: !334)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !296, line: 62, size: 1024, elements: !335)
!335 = !{!336, !338, !339, !340, !341, !342, !346, !347, !355, !356}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !334, file: !296, line: 63, baseType: !337, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !334, file: !296, line: 63, baseType: !337, size: 64, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !334, file: !296, line: 64, baseType: !315, size: 8, offset: 128)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !334, file: !296, line: 64, baseType: !315, size: 8, offset: 136)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !334, file: !296, line: 65, baseType: !282, size: 16, offset: 144)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !334, file: !296, line: 66, baseType: !343, size: 512, offset: 160)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !315, size: 512, elements: !344)
!344 = !{!345}
!345 = !DISubrange(count: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !334, file: !296, line: 67, baseType: !87, size: 32, offset: 672)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !334, file: !296, line: 69, baseType: !348, size: 256, offset: 704)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !296, line: 60, baseType: !349)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !296, line: 48, size: 256, elements: !350)
!350 = !{!351, !352, !353, !354}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !349, file: !296, line: 49, baseType: !257, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !349, file: !296, line: 58, baseType: !271, size: 128, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !349, file: !296, line: 59, baseType: !87, size: 32, offset: 192)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !349, file: !296, line: 59, baseType: !87, size: 32, offset: 224)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !334, file: !296, line: 70, baseType: !87, size: 32, offset: 960)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !334, file: !296, line: 74, baseType: !87, size: 32, offset: 992)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !291, file: !292, line: 80, baseType: !314, size: 8192, offset: 960)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !291, file: !292, line: 82, baseType: !359, size: 64, offset: 9152)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !292, line: 43, flags: DIFlagFwdDecl)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !291, file: !292, line: 83, baseType: !362, size: 64, offset: 9216)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !296, line: 46, flags: DIFlagFwdDecl)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !291, file: !292, line: 86, baseType: !365, size: 64, offset: 9280)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !367, line: 85, flags: DIFlagFwdDecl)
!367 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!368 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !291, file: !292, line: 87, baseType: !369, size: 64, offset: 9344)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !292, line: 44, flags: DIFlagFwdDecl)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !291, file: !292, line: 89, baseType: !372, size: 512, offset: 9408)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !369, size: 512, elements: !283)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !291, file: !292, line: 90, baseType: !282, size: 16, offset: 9920)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !291, file: !292, line: 90, baseType: !282, size: 16, offset: 9936)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !291, file: !292, line: 92, baseType: !282, size: 16, offset: 9952)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !291, file: !292, line: 92, baseType: !282, size: 16, offset: 9968)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !291, file: !292, line: 93, baseType: !282, size: 16, offset: 9984)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !291, file: !292, line: 93, baseType: !282, size: 16, offset: 10000)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !291, file: !292, line: 94, baseType: !87, size: 32, offset: 10016)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !291, file: !292, line: 97, baseType: !282, size: 16, offset: 10048)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !291, file: !292, line: 97, baseType: !282, size: 16, offset: 10064)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !291, file: !292, line: 98, baseType: !282, size: 16, offset: 10080)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !291, file: !292, line: 98, baseType: !282, size: 16, offset: 10096)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !291, file: !292, line: 99, baseType: !282, size: 16, offset: 10112)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !291, file: !292, line: 99, baseType: !282, size: 16, offset: 10128)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !291, file: !292, line: 100, baseType: !7, size: 32, offset: 10144)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !291, file: !292, line: 101, baseType: !388, size: 64, offset: 10176)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !291, file: !292, line: 103, baseType: !321, size: 64, offset: 10240)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !291, file: !292, line: 104, baseType: !391, size: 64, offset: 10304)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !296, line: 159, size: 448, elements: !393)
!393 = !{!394, !398, !399, !401, !402, !404}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !392, file: !296, line: 161, baseType: !395, size: 64)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !396)
!396 = !{!397}
!397 = !DISubrange(count: 2)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !392, file: !296, line: 162, baseType: !395, size: 64, offset: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !392, file: !296, line: 163, baseType: !400, size: 32, offset: 128)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 32, elements: !396)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !392, file: !296, line: 164, baseType: !400, size: 32, offset: 160)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !392, file: !296, line: 165, baseType: !403, size: 128, offset: 192)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 128, elements: !396)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !392, file: !296, line: 166, baseType: !405, size: 128, offset: 320)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !362, size: 128, elements: !396)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !291, file: !292, line: 107, baseType: !279, size: 32, offset: 10368)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !291, file: !292, line: 108, baseType: !87, size: 32, offset: 10400)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !291, file: !292, line: 109, baseType: !282, size: 16, offset: 10432)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !291, file: !292, line: 110, baseType: !282, size: 16, offset: 10448)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !291, file: !292, line: 113, baseType: !87, size: 32, offset: 10464)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !291, file: !292, line: 113, baseType: !87, size: 32, offset: 10496)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !291, file: !292, line: 114, baseType: !315, size: 8, offset: 10528)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !291, file: !292, line: 114, baseType: !315, size: 8, offset: 10536)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !291, file: !292, line: 115, baseType: !282, size: 16, offset: 10544)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !291, file: !292, line: 116, baseType: !416, size: 128, offset: 10560)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !279, size: 128, elements: !417)
!417 = !{!418}
!418 = !DISubrange(count: 4)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !291, file: !292, line: 119, baseType: !279, size: 32, offset: 10688)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !291, file: !292, line: 119, baseType: !279, size: 32, offset: 10720)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !291, file: !292, line: 122, baseType: !422, size: 512, offset: 10752)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !423, line: 182, baseType: !424)
!423 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !423, line: 180, size: 512, elements: !425)
!425 = !{!426}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !424, file: !423, line: 181, baseType: !343, size: 512)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !291, file: !292, line: 123, baseType: !315, size: 8, offset: 11264)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !291, file: !292, line: 125, baseType: !429, size: 56, offset: 11272)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !315, size: 56, elements: !430)
!430 = !{!431}
!431 = !DISubrange(count: 7)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !291, file: !292, line: 126, baseType: !433, size: 4096, offset: 11328)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 4096, elements: !283)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !292, line: 69, baseType: !435)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !292, line: 67, size: 512, elements: !436)
!436 = !{!437}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !435, file: !292, line: 68, baseType: !343, size: 512)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !260, file: !129, line: 718, baseType: !439, size: 320, offset: 384)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !292, line: 50, size: 320, elements: !440)
!440 = !{!441, !3698, !3699, !3700, !3701, !3702, !3703, !3704, !3705, !3706, !3707, !3708, !3709, !3710}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !439, file: !292, line: 51, baseType: !442, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !204, line: 1216, size: 39680, elements: !444)
!444 = !{!445, !446, !450, !2559, !2640, !2641, !2642, !2654, !2655, !2656, !2657, !2658, !2659, !2660, !2661, !2662, !2663, !2664, !2665, !2666, !3008, !3333, !3336, !3574, !3586, !3587, !3588, !3589, !3590, !3591, !3592, !3593, !3596, !3597, !3598, !3599, !3600, !3608, !3674, !3681, !3682, !3689, !3690, !3691, !3692, !3693, !3694, !3695}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !443, file: !204, line: 1217, baseType: !295, size: 960)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !443, file: !204, line: 1218, baseType: !447, size: 64, offset: 960)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !449, line: 45, flags: DIFlagFwdDecl)
!449 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!450 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !443, file: !204, line: 1220, baseType: !451, size: 64, offset: 1024)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !172, line: 115, size: 11392, elements: !453)
!453 = !{!454, !455, !456, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !751, !760, !774, !775, !815, !816, !819, !820, !836, !837, !838, !839, !840, !841, !842, !2050, !2051, !2052, !2053, !2054, !2055, !2056, !2057, !2058, !2059, !2060, !2061, !2062, !2063, !2064, !2065, !2066, !2067, !2068, !2069, !2070, !2071, !2072, !2073, !2074, !2075, !2076, !2077, !2078, !2079, !2080, !2081, !2082, !2083, !2084, !2085, !2086, !2087, !2088, !2089, !2090, !2091, !2092, !2093, !2094, !2095, !2096, !2097, !2098, !2099, !2100, !2101, !2103, !2104, !2105, !2106, !2107, !2108, !2109, !2110, !2111, !2112, !2113, !2114, !2115, !2116, !2117, !2118, !2119, !2120, !2121, !2122, !2125, !2126, !2127, !2128, !2129, !2130, !2131, !2132, !2133, !2136, !2139, !2140, !2141, !2142, !2143, !2144, !2147, !2150, !2523, !2524, !2530, !2531, !2532, !2533, !2534, !2535, !2537, !2540, !2543, !2544, !2547, !2548}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !452, file: !172, line: 116, baseType: !295, size: 960)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !452, file: !172, line: 117, baseType: !447, size: 64, offset: 960)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !452, file: !172, line: 119, baseType: !457, size: 64, offset: 1024)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !194, line: 155, size: 1856, elements: !459)
!459 = !{!460, !463, !476, !485, !491, !492, !493, !495, !498, !500, !504, !700, !701, !702, !704, !707, !710, !711, !712, !713, !714, !718, !719, !720, !721, !722, !726, !727, !730, !733, !734, !735, !736}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "multires", scope: !458, file: !194, line: 157, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DICompositeType(tag: DW_TAG_structure_type, name: "MultiresModifierData", file: !194, line: 157, flags: DIFlagFwdDecl)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "mvert", scope: !458, file: !194, line: 158, baseType: !464, size: 64, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !466, line: 65, size: 160, elements: !467)
!466 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!467 = !{!468, !472, !474, !475}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !465, file: !466, line: 66, baseType: !469, size: 96)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !279, size: 96, elements: !470)
!470 = !{!471}
!471 = !DISubrange(count: 3)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !465, file: !466, line: 67, baseType: !473, size: 48, offset: 96)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 48, elements: !470)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !465, file: !466, line: 68, baseType: !315, size: 8, offset: 144)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !465, file: !466, line: 68, baseType: !315, size: 8, offset: 152)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "mpoly", scope: !458, file: !194, line: 159, baseType: !477, size: 64, offset: 128)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !466, line: 79, size: 96, elements: !479)
!479 = !{!480, !481, !482, !483, !484}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !478, file: !466, line: 81, baseType: !87, size: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !478, file: !466, line: 82, baseType: !87, size: 32, offset: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !478, file: !466, line: 83, baseType: !282, size: 16, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !478, file: !466, line: 84, baseType: !315, size: 8, offset: 80)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !478, file: !466, line: 84, baseType: !315, size: 8, offset: 88)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "mloop", scope: !458, file: !194, line: 160, baseType: !486, size: 64, offset: 192)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !466, line: 88, size: 64, elements: !488)
!488 = !{!489, !490}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !487, file: !466, line: 89, baseType: !7, size: 32)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !487, file: !466, line: 90, baseType: !7, size: 32, offset: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !458, file: !194, line: 161, baseType: !87, size: 32, offset: 256)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "totpoly", scope: !458, file: !194, line: 161, baseType: !87, size: 32, offset: 288)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "face_normals", scope: !458, file: !194, line: 162, baseType: !494, size: 64, offset: 320)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "kb", scope: !458, file: !194, line: 163, baseType: !496, size: 64, offset: 384)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DICompositeType(tag: DW_TAG_structure_type, name: "KeyBlock", file: !55, line: 92, flags: DIFlagFwdDecl)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "vmask", scope: !458, file: !194, line: 164, baseType: !499, size: 64, offset: 448)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "pmap", scope: !458, file: !194, line: 167, baseType: !501, size: 64, offset: 512)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !503)
!503 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !55, line: 355, flags: DIFlagFwdDecl)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "bm", scope: !458, file: !194, line: 170, baseType: !505, size: 64, offset: 576)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !507, line: 186, size: 8064, elements: !508)
!507 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!508 = !{!509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !522, !523, !524, !525, !586, !590, !594, !595, !596, !597, !598, !599, !600, !601, !656, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !506, file: !507, line: 187, baseType: !87, size: 32)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !506, file: !507, line: 187, baseType: !87, size: 32, offset: 32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !506, file: !507, line: 187, baseType: !87, size: 32, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !506, file: !507, line: 187, baseType: !87, size: 32, offset: 96)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !506, file: !507, line: 188, baseType: !87, size: 32, offset: 128)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !506, file: !507, line: 188, baseType: !87, size: 32, offset: 160)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !506, file: !507, line: 188, baseType: !87, size: 32, offset: 192)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !506, file: !507, line: 193, baseType: !315, size: 8, offset: 224)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !506, file: !507, line: 197, baseType: !315, size: 8, offset: 232)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !506, file: !507, line: 201, baseType: !519, size: 64, offset: 256)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !521, line: 71, flags: DIFlagFwdDecl)
!521 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!522 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !506, file: !507, line: 201, baseType: !519, size: 64, offset: 320)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !506, file: !507, line: 201, baseType: !519, size: 64, offset: 384)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !506, file: !507, line: 201, baseType: !519, size: 64, offset: 448)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !506, file: !507, line: 208, baseType: !526, size: 64, offset: 512)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !507, line: 103, baseType: !529)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !507, line: 90, size: 448, elements: !530)
!530 = !{!531, !540, !545, !546, !547}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !529, file: !507, line: 91, baseType: !532, size: 128)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !507, line: 82, baseType: !533)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !507, line: 64, size: 128, elements: !534)
!534 = !{!535, !536, !537, !538, !539}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !533, file: !507, line: 65, baseType: !257, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !533, file: !507, line: 66, baseType: !87, size: 32, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !533, file: !507, line: 73, baseType: !315, size: 8, offset: 96)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !533, file: !507, line: 74, baseType: !315, size: 8, offset: 104)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !533, file: !507, line: 80, baseType: !315, size: 8, offset: 112)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !529, file: !507, line: 92, baseType: !541, size: 64, offset: 128)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !507, line: 180, size: 16, elements: !543)
!543 = !{!544}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !542, file: !507, line: 181, baseType: !282, size: 16)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !529, file: !507, line: 94, baseType: !469, size: 96, offset: 192)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !529, file: !507, line: 95, baseType: !469, size: 96, offset: 288)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !529, file: !507, line: 102, baseType: !548, size: 64, offset: 384)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !507, line: 110, size: 640, elements: !550)
!550 = !{!551, !552, !553, !555, !556, !579, !585}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !549, file: !507, line: 111, baseType: !532, size: 128)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !549, file: !507, line: 112, baseType: !541, size: 64, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !549, file: !507, line: 114, baseType: !554, size: 64, offset: 192)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !549, file: !507, line: 114, baseType: !554, size: 64, offset: 256)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !549, file: !507, line: 118, baseType: !557, size: 64, offset: 320)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !507, line: 125, size: 576, elements: !559)
!559 = !{!560, !561, !562, !563, !575, !576, !577, !578}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !558, file: !507, line: 126, baseType: !532, size: 128)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !558, file: !507, line: 129, baseType: !554, size: 64, offset: 128)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !558, file: !507, line: 130, baseType: !548, size: 64, offset: 192)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !558, file: !507, line: 131, baseType: !564, size: 64, offset: 256)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !507, line: 164, size: 448, elements: !566)
!566 = !{!567, !568, !569, !572, !573, !574}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !565, file: !507, line: 165, baseType: !532, size: 128)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !565, file: !507, line: 166, baseType: !541, size: 64, offset: 128)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !565, file: !507, line: 172, baseType: !570, size: 64, offset: 192)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !507, line: 140, baseType: !558)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !565, file: !507, line: 174, baseType: !87, size: 32, offset: 256)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !565, file: !507, line: 175, baseType: !469, size: 96, offset: 288)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !565, file: !507, line: 176, baseType: !282, size: 16, offset: 384)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !558, file: !507, line: 135, baseType: !557, size: 64, offset: 320)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !558, file: !507, line: 135, baseType: !557, size: 64, offset: 384)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !558, file: !507, line: 139, baseType: !557, size: 64, offset: 448)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !558, file: !507, line: 139, baseType: !557, size: 64, offset: 512)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !549, file: !507, line: 122, baseType: !580, size: 128, offset: 384)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !507, line: 108, baseType: !581)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !507, line: 106, size: 128, elements: !582)
!582 = !{!583, !584}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !581, file: !507, line: 107, baseType: !548, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !581, file: !507, line: 107, baseType: !548, size: 64, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !549, file: !507, line: 122, baseType: !580, size: 128, offset: 512)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !506, file: !507, line: 209, baseType: !587, size: 64, offset: 576)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !507, line: 123, baseType: !549)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !506, file: !507, line: 210, baseType: !591, size: 64, offset: 640)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !507, line: 178, baseType: !565)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !506, file: !507, line: 213, baseType: !87, size: 32, offset: 704)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !506, file: !507, line: 214, baseType: !87, size: 32, offset: 736)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !506, file: !507, line: 215, baseType: !87, size: 32, offset: 768)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !506, file: !507, line: 218, baseType: !519, size: 64, offset: 832)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !506, file: !507, line: 218, baseType: !519, size: 64, offset: 896)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !506, file: !507, line: 218, baseType: !519, size: 64, offset: 960)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !506, file: !507, line: 220, baseType: !87, size: 32, offset: 1024)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !506, file: !507, line: 221, baseType: !602, size: 64, offset: 1088)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !17, line: 190, size: 10496, elements: !604)
!604 = !{!605, !642, !643, !649, !652, !653, !655}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !603, file: !17, line: 191, baseType: !606, size: 5120)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !607, size: 5120, elements: !640)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !17, line: 147, size: 320, elements: !608)
!608 = !{!609, !612, !614, !624, !625}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !607, file: !17, line: 148, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !315)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !607, file: !17, line: 149, baseType: !613, size: 32, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !17, line: 112, baseType: !16)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !607, file: !17, line: 150, baseType: !615, size: 32, offset: 96)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !17, line: 142, baseType: !616)
!616 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !17, line: 138, size: 32, elements: !617)
!617 = !{!618, !620, !622}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !616, file: !17, line: 139, baseType: !619, size: 32)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !17, line: 122, baseType: !27)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !616, file: !17, line: 140, baseType: !621, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !17, line: 136, baseType: !33)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !616, file: !17, line: 141, baseType: !623, size: 32)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !17, line: 130, baseType: !39)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !607, file: !17, line: 152, baseType: !87, size: 32, offset: 128)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !607, file: !17, line: 162, baseType: !626, size: 128, offset: 192)
!626 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !607, file: !17, line: 155, size: 128, elements: !627)
!627 = !{!628, !629, !630, !631, !632, !634}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !626, file: !17, line: 156, baseType: !87, size: 32)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !626, file: !17, line: 157, baseType: !279, size: 32)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !626, file: !17, line: 158, baseType: !257, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !626, file: !17, line: 159, baseType: !469, size: 96)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !626, file: !17, line: 160, baseType: !633, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !626, file: !17, line: 161, baseType: !635, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !637, line: 48, baseType: !638)
!637 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!638 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !639, line: 51, flags: DIFlagFwdDecl)
!639 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!640 = !{!641}
!641 = !DISubrange(count: 16)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !603, file: !17, line: 192, baseType: !606, size: 5120, offset: 5120)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !603, file: !17, line: 193, baseType: !644, size: 64, offset: 10240)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DISubroutineType(types: !646)
!646 = !{null, !647, !602}
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !507, line: 246, baseType: !506)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !603, file: !17, line: 194, baseType: !650, size: 64, offset: 10304)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !17, line: 194, flags: DIFlagFwdDecl)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !603, file: !17, line: 195, baseType: !87, size: 32, offset: 10368)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !603, file: !17, line: 196, baseType: !654, size: 32, offset: 10400)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !17, line: 188, baseType: !47)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !603, file: !17, line: 197, baseType: !87, size: 32, offset: 10432)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !506, file: !507, line: 223, baseType: !657, size: 1600, offset: 1152)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !521, line: 73, baseType: !658)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !521, line: 64, size: 1600, elements: !659)
!659 = !{!660, !675, !679, !680, !681, !682, !683}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !658, file: !521, line: 65, baseType: !661, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !521, line: 53, baseType: !663)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !521, line: 42, size: 832, elements: !664)
!664 = !{!665, !666, !667, !668, !669, !670, !671, !672, !673, !674}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !663, file: !521, line: 43, baseType: !87, size: 32)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !663, file: !521, line: 44, baseType: !87, size: 32, offset: 32)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !663, file: !521, line: 45, baseType: !87, size: 32, offset: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !663, file: !521, line: 46, baseType: !87, size: 32, offset: 96)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !663, file: !521, line: 47, baseType: !87, size: 32, offset: 128)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !663, file: !521, line: 48, baseType: !87, size: 32, offset: 160)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !663, file: !521, line: 49, baseType: !87, size: 32, offset: 192)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !663, file: !521, line: 50, baseType: !87, size: 32, offset: 224)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !663, file: !521, line: 51, baseType: !343, size: 512, offset: 256)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !663, file: !521, line: 52, baseType: !257, size: 64, offset: 768)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !658, file: !521, line: 66, baseType: !676, size: 1312, offset: 64)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 1312, elements: !677)
!677 = !{!678}
!678 = !DISubrange(count: 41)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !658, file: !521, line: 69, baseType: !87, size: 32, offset: 1376)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !658, file: !521, line: 69, baseType: !87, size: 32, offset: 1408)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !658, file: !521, line: 70, baseType: !87, size: 32, offset: 1440)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !658, file: !521, line: 71, baseType: !519, size: 64, offset: 1472)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !658, file: !521, line: 72, baseType: !684, size: 64, offset: 1536)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !521, line: 59, baseType: !686)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !521, line: 57, size: 8192, elements: !687)
!687 = !{!688}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !686, file: !521, line: 58, baseType: !314, size: 8192)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !506, file: !507, line: 223, baseType: !657, size: 1600, offset: 2752)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !506, file: !507, line: 223, baseType: !657, size: 1600, offset: 4352)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !506, file: !507, line: 223, baseType: !657, size: 1600, offset: 5952)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !506, file: !507, line: 233, baseType: !282, size: 16, offset: 7552)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !506, file: !507, line: 236, baseType: !87, size: 32, offset: 7584)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !506, file: !507, line: 238, baseType: !87, size: 32, offset: 7616)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !506, file: !507, line: 238, baseType: !87, size: 32, offset: 7648)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !506, file: !507, line: 239, baseType: !271, size: 128, offset: 7680)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !506, file: !507, line: 241, baseType: !592, size: 64, offset: 7808)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !506, file: !507, line: 243, baseType: !271, size: 128, offset: 7872)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !506, file: !507, line: 245, baseType: !257, size: 64, offset: 8000)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "cd_vert_node_offset", scope: !458, file: !194, line: 171, baseType: !87, size: 32, offset: 640)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "cd_face_node_offset", scope: !458, file: !194, line: 172, baseType: !87, size: 32, offset: 672)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "bm_smooth_shading", scope: !458, file: !194, line: 173, baseType: !703, size: 8, offset: 704)
!703 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "bm_log", scope: !458, file: !194, line: 175, baseType: !705, size: 64, offset: 768)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMLog", file: !194, line: 175, flags: DIFlagFwdDecl)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "pbvh", scope: !458, file: !194, line: 178, baseType: !708, size: 64, offset: 832)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !55, line: 100, flags: DIFlagFwdDecl)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "show_diffuse_color", scope: !458, file: !194, line: 179, baseType: !703, size: 8, offset: 896)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers_active", scope: !458, file: !194, line: 182, baseType: !703, size: 8, offset: 904)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "orig_cos", scope: !458, file: !194, line: 183, baseType: !494, size: 64, offset: 960)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "deform_cos", scope: !458, file: !194, line: 184, baseType: !494, size: 64, offset: 1024)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "deform_imats", scope: !458, file: !194, line: 185, baseType: !715, size: 64, offset: 1088)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DICompositeType(tag: DW_TAG_array_type, baseType: !279, size: 288, elements: !717)
!717 = !{!471, !471}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "partial_redraw", scope: !458, file: !194, line: 188, baseType: !703, size: 8, offset: 1152)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_side", scope: !458, file: !194, line: 191, baseType: !7, size: 32, offset: 1184)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "texcache", scope: !458, file: !194, line: 191, baseType: !388, size: 64, offset: 1216)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_actual", scope: !458, file: !194, line: 191, baseType: !7, size: 32, offset: 1280)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "tex_pool", scope: !458, file: !194, line: 192, baseType: !723, size: 64, offset: 1344)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePool", file: !725, line: 33, flags: DIFlagFwdDecl)
!725 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_brush.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!726 = !DIDerivedType(tag: DW_TAG_member, name: "layer_co", scope: !458, file: !194, line: 195, baseType: !494, size: 64, offset: 1408)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "stroke", scope: !458, file: !194, line: 197, baseType: !728, size: 64, offset: 1472)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptStroke", file: !194, line: 197, flags: DIFlagFwdDecl)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !458, file: !194, line: 198, baseType: !731, size: 64, offset: 1536)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DICompositeType(tag: DW_TAG_structure_type, name: "StrokeCache", file: !194, line: 59, flags: DIFlagFwdDecl)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke_valid", scope: !458, file: !194, line: 201, baseType: !703, size: 8, offset: 1600)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke", scope: !458, file: !194, line: 202, baseType: !469, size: 96, offset: 1632)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_accum", scope: !458, file: !194, line: 204, baseType: !469, size: 96, offset: 1728)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_counter", scope: !458, file: !194, line: 205, baseType: !87, size: 32, offset: 1824)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !452, file: !172, line: 121, baseType: !282, size: 16, offset: 1088)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !452, file: !172, line: 121, baseType: !282, size: 16, offset: 1104)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !452, file: !172, line: 122, baseType: !87, size: 32, offset: 1120)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !452, file: !172, line: 122, baseType: !87, size: 32, offset: 1152)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !452, file: !172, line: 122, baseType: !87, size: 32, offset: 1184)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !452, file: !172, line: 123, baseType: !343, size: 512, offset: 1216)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !452, file: !172, line: 124, baseType: !451, size: 64, offset: 1728)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !452, file: !172, line: 124, baseType: !451, size: 64, offset: 1792)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !452, file: !172, line: 127, baseType: !451, size: 64, offset: 1856)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !452, file: !172, line: 127, baseType: !451, size: 64, offset: 1920)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !452, file: !172, line: 127, baseType: !451, size: 64, offset: 1984)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !452, file: !172, line: 128, baseType: !749, size: 64, offset: 2048)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !449, line: 46, flags: DIFlagFwdDecl)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !452, file: !172, line: 130, baseType: !752, size: 64, offset: 2112)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !172, line: 97, size: 832, elements: !754)
!754 = !{!755, !758, !759}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !753, file: !172, line: 98, baseType: !756, size: 768)
!756 = !DICompositeType(tag: DW_TAG_array_type, baseType: !279, size: 768, elements: !757)
!757 = !{!284, !471}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !753, file: !172, line: 99, baseType: !87, size: 32, offset: 768)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !753, file: !172, line: 99, baseType: !87, size: 32, offset: 800)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !452, file: !172, line: 131, baseType: !761, size: 64, offset: 2176)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !763, line: 486, size: 1600, elements: !764)
!763 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!764 = !{!765, !766, !767, !768, !769, !770, !771, !772, !773}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !762, file: !763, line: 487, baseType: !295, size: 960)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !762, file: !763, line: 489, baseType: !271, size: 128, offset: 960)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !762, file: !763, line: 490, baseType: !271, size: 128, offset: 1088)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !762, file: !763, line: 491, baseType: !271, size: 128, offset: 1216)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !762, file: !763, line: 492, baseType: !271, size: 128, offset: 1344)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !762, file: !763, line: 494, baseType: !87, size: 32, offset: 1472)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !762, file: !763, line: 495, baseType: !87, size: 32, offset: 1504)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !762, file: !763, line: 497, baseType: !87, size: 32, offset: 1536)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !762, file: !763, line: 498, baseType: !87, size: 32, offset: 1568)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !452, file: !172, line: 132, baseType: !761, size: 64, offset: 2240)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !452, file: !172, line: 133, baseType: !776, size: 64, offset: 2304)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !763, line: 334, size: 1728, elements: !778)
!778 = !{!779, !780, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !814}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !777, file: !763, line: 335, baseType: !271, size: 128)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !777, file: !763, line: 336, baseType: !781, size: 64, offset: 128)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !777, file: !763, line: 338, baseType: !282, size: 16, offset: 192)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !777, file: !763, line: 338, baseType: !282, size: 16, offset: 208)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !777, file: !763, line: 339, baseType: !7, size: 32, offset: 224)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !777, file: !763, line: 340, baseType: !87, size: 32, offset: 256)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !777, file: !763, line: 342, baseType: !279, size: 32, offset: 288)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !777, file: !763, line: 343, baseType: !469, size: 96, offset: 320)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !777, file: !763, line: 344, baseType: !469, size: 96, offset: 416)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !777, file: !763, line: 347, baseType: !271, size: 128, offset: 512)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !777, file: !763, line: 349, baseType: !87, size: 32, offset: 640)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !777, file: !763, line: 350, baseType: !87, size: 32, offset: 672)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !777, file: !763, line: 351, baseType: !257, size: 64, offset: 704)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !777, file: !763, line: 352, baseType: !257, size: 64, offset: 768)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !777, file: !763, line: 354, baseType: !795, size: 384, offset: 832)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !763, line: 116, baseType: !796)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !763, line: 94, size: 384, elements: !797)
!797 = !{!798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !796, file: !763, line: 96, baseType: !87, size: 32)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !796, file: !763, line: 96, baseType: !87, size: 32, offset: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !796, file: !763, line: 97, baseType: !87, size: 32, offset: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !796, file: !763, line: 97, baseType: !87, size: 32, offset: 96)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !796, file: !763, line: 99, baseType: !282, size: 16, offset: 128)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !796, file: !763, line: 100, baseType: !282, size: 16, offset: 144)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !796, file: !763, line: 102, baseType: !282, size: 16, offset: 160)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !796, file: !763, line: 105, baseType: !282, size: 16, offset: 176)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !796, file: !763, line: 108, baseType: !282, size: 16, offset: 192)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !796, file: !763, line: 109, baseType: !282, size: 16, offset: 208)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !796, file: !763, line: 111, baseType: !282, size: 16, offset: 224)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !796, file: !763, line: 112, baseType: !282, size: 16, offset: 240)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !796, file: !763, line: 114, baseType: !87, size: 32, offset: 256)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !796, file: !763, line: 114, baseType: !87, size: 32, offset: 288)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !796, file: !763, line: 115, baseType: !87, size: 32, offset: 320)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !796, file: !763, line: 115, baseType: !87, size: 32, offset: 352)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !777, file: !763, line: 355, baseType: !343, size: 512, offset: 1216)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !452, file: !172, line: 134, baseType: !257, size: 64, offset: 2368)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !452, file: !172, line: 136, baseType: !817, size: 64, offset: 2432)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !204, line: 61, flags: DIFlagFwdDecl)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !452, file: !172, line: 138, baseType: !795, size: 384, offset: 2496)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !452, file: !172, line: 139, baseType: !821, size: 64, offset: 2880)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !763, line: 80, baseType: !823)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !763, line: 72, size: 192, elements: !824)
!824 = !{!825, !832, !833, !834, !835}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !823, file: !763, line: 73, baseType: !826, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !763, line: 59, baseType: !828)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !763, line: 56, size: 128, elements: !829)
!829 = !{!830, !831}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !828, file: !763, line: 57, baseType: !469, size: 96)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !828, file: !763, line: 58, baseType: !87, size: 32, offset: 96)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !823, file: !763, line: 74, baseType: !87, size: 32, offset: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !823, file: !763, line: 76, baseType: !87, size: 32, offset: 96)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !823, file: !763, line: 77, baseType: !87, size: 32, offset: 128)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !823, file: !763, line: 79, baseType: !87, size: 32, offset: 160)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !452, file: !172, line: 141, baseType: !271, size: 128, offset: 2944)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !452, file: !172, line: 142, baseType: !271, size: 128, offset: 3072)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !452, file: !172, line: 143, baseType: !271, size: 128, offset: 3200)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !452, file: !172, line: 144, baseType: !271, size: 128, offset: 3328)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !452, file: !172, line: 146, baseType: !87, size: 32, offset: 3456)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !452, file: !172, line: 147, baseType: !87, size: 32, offset: 3488)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !452, file: !172, line: 150, baseType: !843, size: 64, offset: 3520)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !846, line: 93, size: 7552, elements: !847)
!846 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!847 = !{!848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !896, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !2006, !2007, !2008, !2012, !2013, !2014, !2015, !2016, !2017, !2018, !2019, !2020, !2021, !2022, !2023, !2024, !2025, !2026, !2027, !2028, !2029, !2030, !2031, !2032, !2033, !2034, !2035, !2036, !2037, !2038, !2039, !2040, !2041, !2049}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !845, file: !846, line: 94, baseType: !295, size: 960)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !845, file: !846, line: 95, baseType: !447, size: 64, offset: 960)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !845, file: !846, line: 97, baseType: !282, size: 16, offset: 1024)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !845, file: !846, line: 97, baseType: !282, size: 16, offset: 1040)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !845, file: !846, line: 99, baseType: !279, size: 32, offset: 1056)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !845, file: !846, line: 99, baseType: !279, size: 32, offset: 1088)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !845, file: !846, line: 99, baseType: !279, size: 32, offset: 1120)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !845, file: !846, line: 100, baseType: !279, size: 32, offset: 1152)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !845, file: !846, line: 100, baseType: !279, size: 32, offset: 1184)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !845, file: !846, line: 100, baseType: !279, size: 32, offset: 1216)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !845, file: !846, line: 101, baseType: !279, size: 32, offset: 1248)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !845, file: !846, line: 101, baseType: !279, size: 32, offset: 1280)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !845, file: !846, line: 101, baseType: !279, size: 32, offset: 1312)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !845, file: !846, line: 102, baseType: !279, size: 32, offset: 1344)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !845, file: !846, line: 102, baseType: !279, size: 32, offset: 1376)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !845, file: !846, line: 102, baseType: !279, size: 32, offset: 1408)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !845, file: !846, line: 103, baseType: !279, size: 32, offset: 1440)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !845, file: !846, line: 103, baseType: !279, size: 32, offset: 1472)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !845, file: !846, line: 103, baseType: !279, size: 32, offset: 1504)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !845, file: !846, line: 103, baseType: !279, size: 32, offset: 1536)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !845, file: !846, line: 103, baseType: !279, size: 32, offset: 1568)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !845, file: !846, line: 104, baseType: !279, size: 32, offset: 1600)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !845, file: !846, line: 104, baseType: !279, size: 32, offset: 1632)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !845, file: !846, line: 104, baseType: !279, size: 32, offset: 1664)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !845, file: !846, line: 104, baseType: !279, size: 32, offset: 1696)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !845, file: !846, line: 104, baseType: !279, size: 32, offset: 1728)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !845, file: !846, line: 105, baseType: !279, size: 32, offset: 1760)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !845, file: !846, line: 108, baseType: !876, size: 704, offset: 1792)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !846, line: 53, size: 704, elements: !877)
!877 = !{!878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !876, file: !846, line: 54, baseType: !279, size: 32)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !876, file: !846, line: 55, baseType: !279, size: 32, offset: 32)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !876, file: !846, line: 56, baseType: !279, size: 32, offset: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !876, file: !846, line: 57, baseType: !279, size: 32, offset: 96)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !876, file: !846, line: 59, baseType: !469, size: 96, offset: 128)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !876, file: !846, line: 60, baseType: !469, size: 96, offset: 224)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !876, file: !846, line: 61, baseType: !469, size: 96, offset: 320)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !876, file: !846, line: 63, baseType: !279, size: 32, offset: 416)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !876, file: !846, line: 64, baseType: !279, size: 32, offset: 448)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !876, file: !846, line: 65, baseType: !279, size: 32, offset: 480)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !876, file: !846, line: 67, baseType: !282, size: 16, offset: 512)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !876, file: !846, line: 68, baseType: !282, size: 16, offset: 528)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !876, file: !846, line: 69, baseType: !282, size: 16, offset: 544)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !876, file: !846, line: 70, baseType: !282, size: 16, offset: 560)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !876, file: !846, line: 72, baseType: !279, size: 32, offset: 576)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !876, file: !846, line: 73, baseType: !279, size: 32, offset: 608)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !876, file: !846, line: 74, baseType: !279, size: 32, offset: 640)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !876, file: !846, line: 75, baseType: !279, size: 32, offset: 672)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !845, file: !846, line: 109, baseType: !897, size: 128, offset: 2496)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !846, line: 79, size: 128, elements: !898)
!898 = !{!899, !900, !901, !902}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !897, file: !846, line: 80, baseType: !87, size: 32)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !897, file: !846, line: 81, baseType: !87, size: 32, offset: 32)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !897, file: !846, line: 82, baseType: !87, size: 32, offset: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !897, file: !846, line: 83, baseType: !87, size: 32, offset: 96)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !845, file: !846, line: 111, baseType: !279, size: 32, offset: 2624)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !845, file: !846, line: 111, baseType: !279, size: 32, offset: 2656)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !845, file: !846, line: 112, baseType: !279, size: 32, offset: 2688)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !845, file: !846, line: 112, baseType: !279, size: 32, offset: 2720)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !845, file: !846, line: 113, baseType: !279, size: 32, offset: 2752)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !845, file: !846, line: 114, baseType: !279, size: 32, offset: 2784)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !845, file: !846, line: 114, baseType: !279, size: 32, offset: 2816)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !845, file: !846, line: 115, baseType: !282, size: 16, offset: 2848)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !845, file: !846, line: 115, baseType: !282, size: 16, offset: 2864)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !845, file: !846, line: 116, baseType: !282, size: 16, offset: 2880)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !845, file: !846, line: 117, baseType: !315, size: 8, offset: 2896)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !845, file: !846, line: 117, baseType: !315, size: 8, offset: 2904)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !845, file: !846, line: 119, baseType: !279, size: 32, offset: 2912)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !845, file: !846, line: 119, baseType: !279, size: 32, offset: 2944)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !845, file: !846, line: 120, baseType: !282, size: 16, offset: 2976)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !845, file: !846, line: 120, baseType: !282, size: 16, offset: 2992)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !845, file: !846, line: 121, baseType: !279, size: 32, offset: 3008)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !845, file: !846, line: 121, baseType: !279, size: 32, offset: 3040)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !845, file: !846, line: 122, baseType: !279, size: 32, offset: 3072)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !845, file: !846, line: 123, baseType: !279, size: 32, offset: 3104)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !845, file: !846, line: 124, baseType: !282, size: 16, offset: 3136)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !845, file: !846, line: 125, baseType: !282, size: 16, offset: 3152)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !845, file: !846, line: 127, baseType: !87, size: 32, offset: 3168)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !845, file: !846, line: 127, baseType: !87, size: 32, offset: 3200)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !845, file: !846, line: 128, baseType: !87, size: 32, offset: 3232)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !845, file: !846, line: 128, baseType: !87, size: 32, offset: 3264)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !845, file: !846, line: 129, baseType: !282, size: 16, offset: 3296)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !845, file: !846, line: 129, baseType: !282, size: 16, offset: 3312)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !845, file: !846, line: 129, baseType: !282, size: 16, offset: 3328)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !845, file: !846, line: 129, baseType: !282, size: 16, offset: 3344)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !845, file: !846, line: 130, baseType: !279, size: 32, offset: 3360)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !845, file: !846, line: 130, baseType: !279, size: 32, offset: 3392)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !845, file: !846, line: 130, baseType: !279, size: 32, offset: 3424)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !845, file: !846, line: 130, baseType: !279, size: 32, offset: 3456)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !845, file: !846, line: 131, baseType: !279, size: 32, offset: 3488)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !845, file: !846, line: 131, baseType: !279, size: 32, offset: 3520)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !845, file: !846, line: 131, baseType: !279, size: 32, offset: 3552)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !845, file: !846, line: 131, baseType: !279, size: 32, offset: 3584)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !845, file: !846, line: 132, baseType: !279, size: 32, offset: 3616)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !845, file: !846, line: 132, baseType: !279, size: 32, offset: 3648)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !845, file: !846, line: 133, baseType: !343, size: 512, offset: 3680)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !845, file: !846, line: 135, baseType: !279, size: 32, offset: 4192)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !845, file: !846, line: 136, baseType: !279, size: 32, offset: 4224)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !845, file: !846, line: 137, baseType: !279, size: 32, offset: 4256)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !845, file: !846, line: 138, baseType: !87, size: 32, offset: 4288)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !845, file: !846, line: 141, baseType: !315, size: 8, offset: 4320)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !845, file: !846, line: 141, baseType: !315, size: 8, offset: 4328)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !845, file: !846, line: 141, baseType: !315, size: 8, offset: 4336)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !845, file: !846, line: 141, baseType: !315, size: 8, offset: 4344)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !845, file: !846, line: 142, baseType: !282, size: 16, offset: 4352)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !845, file: !846, line: 142, baseType: !282, size: 16, offset: 4368)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !845, file: !846, line: 142, baseType: !282, size: 16, offset: 4384)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !845, file: !846, line: 145, baseType: !315, size: 8, offset: 4400)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !845, file: !846, line: 145, baseType: !315, size: 8, offset: 4408)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !845, file: !846, line: 148, baseType: !282, size: 16, offset: 4416)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !845, file: !846, line: 148, baseType: !282, size: 16, offset: 4432)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !845, file: !846, line: 149, baseType: !279, size: 32, offset: 4448)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !845, file: !846, line: 149, baseType: !279, size: 32, offset: 4480)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !845, file: !846, line: 152, baseType: !416, size: 128, offset: 4512)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !845, file: !846, line: 153, baseType: !279, size: 32, offset: 4640)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !845, file: !846, line: 154, baseType: !279, size: 32, offset: 4672)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !845, file: !846, line: 157, baseType: !282, size: 16, offset: 4704)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !845, file: !846, line: 157, baseType: !282, size: 16, offset: 4720)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !845, file: !846, line: 160, baseType: !967, size: 64, offset: 4736)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !449, line: 113, size: 6208, elements: !969)
!969 = !{!970, !971, !972, !973, !974, !975, !979}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !968, file: !449, line: 114, baseType: !282, size: 16)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !968, file: !449, line: 114, baseType: !282, size: 16, offset: 16)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !968, file: !449, line: 115, baseType: !315, size: 8, offset: 32)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !968, file: !449, line: 115, baseType: !315, size: 8, offset: 40)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !968, file: !449, line: 116, baseType: !315, size: 8, offset: 48)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !968, file: !449, line: 117, baseType: !976, size: 8, offset: 56)
!976 = !DICompositeType(tag: DW_TAG_array_type, baseType: !315, size: 8, elements: !977)
!977 = !{!978}
!978 = !DISubrange(count: 1)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !968, file: !449, line: 119, baseType: !980, size: 6144, offset: 64)
!980 = !DICompositeType(tag: DW_TAG_array_type, baseType: !981, size: 6144, elements: !990)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !449, line: 109, baseType: !982)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !449, line: 106, size: 192, elements: !983)
!983 = !{!984, !985, !986, !987, !988, !989}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !982, file: !449, line: 107, baseType: !279, size: 32)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !982, file: !449, line: 107, baseType: !279, size: 32, offset: 32)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !982, file: !449, line: 107, baseType: !279, size: 32, offset: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !982, file: !449, line: 107, baseType: !279, size: 32, offset: 96)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !982, file: !449, line: 107, baseType: !279, size: 32, offset: 128)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !982, file: !449, line: 108, baseType: !87, size: 32, offset: 160)
!990 = !{!991}
!991 = !DISubrange(count: 32)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !845, file: !846, line: 161, baseType: !967, size: 64, offset: 4800)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !845, file: !846, line: 162, baseType: !315, size: 8, offset: 4864)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !845, file: !846, line: 162, baseType: !315, size: 8, offset: 4872)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !845, file: !846, line: 163, baseType: !315, size: 8, offset: 4880)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !845, file: !846, line: 163, baseType: !315, size: 8, offset: 4888)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !845, file: !846, line: 164, baseType: !282, size: 16, offset: 4896)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !845, file: !846, line: 164, baseType: !282, size: 16, offset: 4912)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !845, file: !846, line: 165, baseType: !279, size: 32, offset: 4928)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !845, file: !846, line: 165, baseType: !279, size: 32, offset: 4960)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !845, file: !846, line: 167, baseType: !1002, size: 1152, offset: 4992)
!1002 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1003, size: 1152, elements: !2004)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !449, line: 57, size: 2496, elements: !1005)
!1005 = !{!1006, !1007, !1008, !1009, !1010, !1011, !1945, !1946, !1947, !1948, !1949, !1950, !1951, !1952, !1953, !1954, !1955, !1956, !1957, !1958, !1959, !1960, !1961, !1962, !1963, !1964, !1965, !1966, !1967, !1968, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1977, !1978, !1979, !1980, !1981, !1982, !1983, !1984, !1985, !1986, !1987, !1988, !1989, !1990, !1991, !1992, !1993, !1994, !1995, !1996, !1997, !1998, !1999, !2000, !2001, !2002, !2003}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !1004, file: !449, line: 59, baseType: !282, size: 16)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !1004, file: !449, line: 59, baseType: !282, size: 16, offset: 16)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !1004, file: !449, line: 59, baseType: !282, size: 16, offset: 32)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !1004, file: !449, line: 59, baseType: !282, size: 16, offset: 48)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1004, file: !449, line: 60, baseType: !451, size: 64, offset: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !1004, file: !449, line: 61, baseType: !1012, size: 64, offset: 128)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !449, line: 202, size: 3328, elements: !1014)
!1014 = !{!1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1819, !1820, !1821, !1822, !1846, !1847, !1914, !1935, !1943, !1944}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1013, file: !449, line: 203, baseType: !295, size: 960)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1013, file: !449, line: 204, baseType: !447, size: 64, offset: 960)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !1013, file: !449, line: 206, baseType: !279, size: 32, offset: 1024)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !1013, file: !449, line: 206, baseType: !279, size: 32, offset: 1056)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !1013, file: !449, line: 207, baseType: !279, size: 32, offset: 1088)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !1013, file: !449, line: 207, baseType: !279, size: 32, offset: 1120)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !1013, file: !449, line: 207, baseType: !279, size: 32, offset: 1152)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !1013, file: !449, line: 207, baseType: !279, size: 32, offset: 1184)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !1013, file: !449, line: 207, baseType: !279, size: 32, offset: 1216)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !1013, file: !449, line: 207, baseType: !279, size: 32, offset: 1248)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !1013, file: !449, line: 208, baseType: !279, size: 32, offset: 1280)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1013, file: !449, line: 208, baseType: !279, size: 32, offset: 1312)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !1013, file: !449, line: 211, baseType: !279, size: 32, offset: 1344)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !1013, file: !449, line: 211, baseType: !279, size: 32, offset: 1376)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !1013, file: !449, line: 211, baseType: !279, size: 32, offset: 1408)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !1013, file: !449, line: 211, baseType: !279, size: 32, offset: 1440)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !1013, file: !449, line: 211, baseType: !279, size: 32, offset: 1472)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !1013, file: !449, line: 214, baseType: !279, size: 32, offset: 1504)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !1013, file: !449, line: 214, baseType: !279, size: 32, offset: 1536)
