; ModuleID = 'blender/source/blender/editors/interface/interface.c'
source_filename = "blender/source/blender/editors/interface/interface.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }
%struct.StructRNA = type opaque

!1485 = !DIEnumerator(name: "TH_DIS_MARKER", value: 145, isUnsigned: true)
!1486 = !DIEnumerator(name: "TH_PATH_BEFORE", value: 146, isUnsigned: true)
!1487 = !DIEnumerator(name: "TH_PATH_AFTER", value: 147, isUnsigned: true)
!1488 = !DIEnumerator(name: "TH_CAMERA_PATH", value: 148, isUnsigned: true)
!1489 = !DIEnumerator(name: "TH_LOCK_MARKER", value: 149, isUnsigned: true)
!1490 = !DIEnumerator(name: "TH_STITCH_PREVIEW_FACE", value: 150, isUnsigned: true)
!1491 = !DIEnumerator(name: "TH_STITCH_PREVIEW_EDGE", value: 151, isUnsigned: true)
!1492 = !DIEnumerator(name: "TH_STITCH_PREVIEW_VERT", value: 152, isUnsigned: true)
!1493 = !DIEnumerator(name: "TH_STITCH_PREVIEW_STITCHABLE", value: 153, isUnsigned: true)
!1494 = !DIEnumerator(name: "TH_STITCH_PREVIEW_UNSTITCHABLE", value: 154, isUnsigned: true)
!1495 = !DIEnumerator(name: "TH_STITCH_PREVIEW_ACTIVE", value: 155, isUnsigned: true)
!1496 = !DIEnumerator(name: "TH_PAINT_CURVE_HANDLE", value: 156, isUnsigned: true)
!1497 = !DIEnumerator(name: "TH_PAINT_CURVE_PIVOT", value: 157, isUnsigned: true)
!1498 = !DIEnumerator(name: "TH_UV_SHADOW", value: 158, isUnsigned: true)
!1499 = !DIEnumerator(name: "TH_UV_OTHERS", value: 159, isUnsigned: true)
!1500 = !DIEnumerator(name: "TH_FREESTYLE_EDGE_MARK", value: 160, isUnsigned: true)
!1501 = !DIEnumerator(name: "TH_FREESTYLE_FACE_MARK", value: 161, isUnsigned: true)
!1502 = !DIEnumerator(name: "TH_MATCH", value: 162, isUnsigned: true)
!1503 = !DIEnumerator(name: "TH_SELECT_HIGHLIGHT", value: 163, isUnsigned: true)
!1504 = !DIEnumerator(name: "TH_SKIN_ROOT", value: 164, isUnsigned: true)
!1505 = !DIEnumerator(name: "TH_ANIM_ACTIVE", value: 165, isUnsigned: true)
!1506 = !DIEnumerator(name: "TH_ANIM_INACTIVE", value: 166, isUnsigned: true)
!1507 = !DIEnumerator(name: "TH_NLA_TWEAK", value: 167, isUnsigned: true)
!1508 = !DIEnumerator(name: "TH_NLA_TWEAK_DUPLI", value: 168, isUnsigned: true)
!1509 = !DIEnumerator(name: "TH_NLA_TRANSITION", value: 169, isUnsigned: true)
!1510 = !DIEnumerator(name: "TH_NLA_TRANSITION_SEL", value: 170, isUnsigned: true)
!1511 = !DIEnumerator(name: "TH_NLA_META", value: 171, isUnsigned: true)
!1512 = !DIEnumerator(name: "TH_NLA_META_SEL", value: 172, isUnsigned: true)
!1513 = !DIEnumerator(name: "TH_NLA_SOUND", value: 173, isUnsigned: true)
!1514 = !DIEnumerator(name: "TH_NLA_SOUND_SEL", value: 174, isUnsigned: true)
!1515 = !DIEnumerator(name: "TH_EMBOSS", value: 175, isUnsigned: true)
!1516 = !DIEnumerator(name: "TH_AXIS_X", value: 176, isUnsigned: true)
!1517 = !DIEnumerator(name: "TH_AXIS_Y", value: 177, isUnsigned: true)
!1518 = !DIEnumerator(name: "TH_AXIS_Z", value: 178, isUnsigned: true)
!1519 = !DIEnumerator(name: "TH_LOW_GRAD", value: 179, isUnsigned: true)
!1520 = !DIEnumerator(name: "TH_HIGH_GRAD", value: 180, isUnsigned: true)
!1521 = !DIEnumerator(name: "TH_SHOW_BACK_GRAD", value: 181, isUnsigned: true)
!1522 = !DIEnumerator(name: "TH_INFO_SELECTED", value: 182, isUnsigned: true)
!1523 = !DIEnumerator(name: "TH_INFO_SELECTED_TEXT", value: 183, isUnsigned: true)
!1524 = !DIEnumerator(name: "TH_INFO_ERROR", value: 184, isUnsigned: true)
!1525 = !DIEnumerator(name: "TH_INFO_ERROR_TEXT", value: 185, isUnsigned: true)
!1526 = !DIEnumerator(name: "TH_INFO_WARNING", value: 186, isUnsigned: true)
!1527 = !DIEnumerator(name: "TH_INFO_WARNING_TEXT", value: 187, isUnsigned: true)
!1528 = !DIEnumerator(name: "TH_INFO_INFO", value: 188, isUnsigned: true)
!1529 = !DIEnumerator(name: "TH_INFO_INFO_TEXT", value: 189, isUnsigned: true)
!1530 = !DIEnumerator(name: "TH_INFO_DEBUG", value: 190, isUnsigned: true)
!1531 = !DIEnumerator(name: "TH_INFO_DEBUG_TEXT", value: 191, isUnsigned: true)
!1532 = !DIEnumerator(name: "TH_VIEW_OVERLAY", value: 192, isUnsigned: true)
!1533 = !{!1534, !1067, !1535, !1536, !1540, !1541, !1543, !1542, !1544, !1546, !1545, !1547, !1550, !1551, !1552, !1558, !3259, !3245, !3260}
!1534 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1537, size: 64)
!1537 = !DIDerivedType(tag: DW_TAG_typedef, name: "bContext", file: !1538, line: 69, baseType: !1539)
!1538 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1539 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !965, line: 44, flags: DIFlagFwdDecl)
!1540 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!1541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1542, size: 64)
!1542 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!1543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1534, size: 64)
!1544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1545, size: 64)
!1545 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1547 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1548, line: 46, baseType: !1549)
!1548 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!1549 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1550 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1551 = !DIDerivedType(tag: DW_TAG_typedef, name: "BIFIconID", file: !70, line: 44, baseType: !69)
!1552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1553, size: 64)
!1553 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiStringInfo", file: !6, line: 570, baseType: !1554)
!1554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uiStringInfo", file: !6, line: 567, size: 128, elements: !1555)
!1555 = !{!1556, !1557}
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1554, file: !6, line: 568, baseType: !1067, size: 32)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "strinfo", scope: !1554, file: !6, line: 569, baseType: !1541, size: 64, offset: 64)
!1558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1559, size: 64)
!1559 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiBut", file: !6, line: 82, baseType: !1560)
!1560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uiBut", file: !956, line: 195, size: 8000, elements: !1561)
!1561 = !{!1562, !1564, !1565, !1566, !1567, !1569, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1585, !1589, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1609, !1615, !1616, !1617, !1619, !1620, !1634, !1639, !1640, !1652, !1653, !1658, !1659, !1660, !1675, !1679, !1680, !1681, !1682, !1683, !1684, !1686, !1687, !1688, !1689, !1690, !3227, !3232, !3233, !3235, !3236, !3237, !3238, !3239, !3240, !3241, !3242, !3243, !3244, !3247, !3248, !3251, !3252, !3253, !3255, !3256, !3257, !3258}
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1560, file: !956, line: 196, baseType: !1563, size: 64)
!1563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1560, size: 64)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1560, file: !956, line: 196, baseType: !1563, size: 64, offset: 64)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1560, file: !956, line: 197, baseType: !1067, size: 32, offset: 128)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "drawflag", scope: !1560, file: !956, line: 197, baseType: !1067, size: 32, offset: 160)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1560, file: !956, line: 198, baseType: !1568, size: 32, offset: 192)
!1568 = !DIDerivedType(tag: DW_TAG_typedef, name: "eButType", file: !6, line: 282, baseType: !16)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "pointype", scope: !1560, file: !956, line: 199, baseType: !1570, size: 32, offset: 224)
!1570 = !DIDerivedType(tag: DW_TAG_typedef, name: "eButPointerType", file: !6, line: 230, baseType: !62)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !1560, file: !956, line: 200, baseType: !1545, size: 16, offset: 256)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "bitnr", scope: !1560, file: !956, line: 200, baseType: !1545, size: 16, offset: 272)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "retval", scope: !1560, file: !956, line: 200, baseType: !1545, size: 16, offset: 288)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "strwidth", scope: !1560, file: !956, line: 200, baseType: !1545, size: 16, offset: 304)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "alignnr", scope: !1560, file: !956, line: 200, baseType: !1545, size: 16, offset: 320)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "ofs", scope: !1560, file: !956, line: 201, baseType: !1545, size: 16, offset: 336)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1560, file: !956, line: 201, baseType: !1545, size: 16, offset: 352)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "selsta", scope: !1560, file: !956, line: 201, baseType: !1545, size: 16, offset: 368)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "selend", scope: !1560, file: !956, line: 201, baseType: !1545, size: 16, offset: 384)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1560, file: !956, line: 203, baseType: !1541, size: 64, offset: 448)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "strdata", scope: !1560, file: !956, line: 204, baseType: !1582, size: 1024, offset: 512)
!1582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1542, size: 1024, elements: !1583)
!1583 = !{!1584}
!1584 = !DISubrange(count: 128)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "drawstr", scope: !1560, file: !956, line: 205, baseType: !1586, size: 3200, offset: 1536)
!1586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1542, size: 3200, elements: !1587)
!1587 = !{!1588}
!1588 = !DISubrange(count: 400)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !1560, file: !956, line: 207, baseType: !1590, size: 128, offset: 4736)
!1590 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !1591, line: 95, baseType: !1592)
!1591 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !1591, line: 92, size: 128, elements: !1593)
!1593 = !{!1594, !1595, !1596, !1597}
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1592, file: !1591, line: 93, baseType: !1534, size: 32)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1592, file: !1591, line: 93, baseType: !1534, size: 32, offset: 32)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1592, file: !1591, line: 94, baseType: !1534, size: 32, offset: 64)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1592, file: !1591, line: 94, baseType: !1534, size: 32, offset: 96)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "poin", scope: !1560, file: !956, line: 209, baseType: !1541, size: 64, offset: 4864)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "hardmin", scope: !1560, file: !956, line: 210, baseType: !1534, size: 32, offset: 4928)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "hardmax", scope: !1560, file: !956, line: 210, baseType: !1534, size: 32, offset: 4960)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "softmin", scope: !1560, file: !956, line: 210, baseType: !1534, size: 32, offset: 4992)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "softmax", scope: !1560, file: !956, line: 210, baseType: !1534, size: 32, offset: 5024)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "a1", scope: !1560, file: !956, line: 222, baseType: !1534, size: 32, offset: 5056)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "a2", scope: !1560, file: !956, line: 230, baseType: !1534, size: 32, offset: 5088)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !1560, file: !956, line: 232, baseType: !1606, size: 32, offset: 5120)
!1606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1550, size: 32, elements: !1607)
!1607 = !{!1608}
!1608 = !DISubrange(count: 4)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !1560, file: !956, line: 234, baseType: !1610, size: 64, offset: 5184)
!1610 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiButHandleFunc", file: !6, line: 336, baseType: !1611)
!1611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1612, size: 64)
!1612 = !DISubroutineType(types: !1613)
!1613 = !{null, !1614, !1535, !1535}
!1614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1539, size: 64)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "func_arg1", scope: !1560, file: !956, line: 235, baseType: !1535, size: 64, offset: 5248)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "func_arg2", scope: !1560, file: !956, line: 236, baseType: !1535, size: 64, offset: 5312)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "funcN", scope: !1560, file: !956, line: 238, baseType: !1618, size: 64, offset: 5376)
!1618 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiButHandleNFunc", file: !6, line: 338, baseType: !1611)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "func_argN", scope: !1560, file: !956, line: 239, baseType: !1535, size: 64, offset: 5440)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1560, file: !956, line: 241, baseType: !1621, size: 64, offset: 5504)
!1621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1622, size: 64)
!1622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bContextStore", file: !1538, line: 84, size: 320, elements: !1623)
!1623 = !{!1624, !1625, !1626, !1633}
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1622, file: !1538, line: 85, baseType: !1621, size: 64)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1622, file: !1538, line: 85, baseType: !1621, size: 64, offset: 64)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1622, file: !1538, line: 87, baseType: !1627, size: 128, offset: 128)
!1627 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !1628, line: 71, baseType: !1629)
!1628 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !1628, line: 69, size: 128, elements: !1630)
!1630 = !{!1631, !1632}
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1629, file: !1628, line: 70, baseType: !1535, size: 64)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1629, file: !1628, line: 70, baseType: !1535, size: 64, offset: 64)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1622, file: !1538, line: 88, baseType: !1550, size: 8, offset: 256)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "autocomplete_func", scope: !1560, file: !956, line: 243, baseType: !1635, size: 64, offset: 5568)
!1635 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiButCompleteFunc", file: !6, line: 339, baseType: !1636)
!1636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1637, size: 64)
!1637 = !DISubroutineType(types: !1638)
!1638 = !{!1067, !1614, !1541, !1535}
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "autofunc_arg", scope: !1560, file: !956, line: 244, baseType: !1535, size: 64, offset: 5632)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "search_func", scope: !1560, file: !956, line: 246, baseType: !1641, size: 64, offset: 5696)
!1641 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiButSearchFunc", file: !6, line: 340, baseType: !1642)
!1642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1643, size: 64)
!1643 = !DISubroutineType(types: !1644)
!1644 = !{null, !1645, !1535, !1647, !1649}
!1645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1646, size: 64)
!1646 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1539)
!1647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1648, size: 64)
!1648 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1542)
!1649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1650, size: 64)
!1650 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiSearchItems", file: !6, line: 334, baseType: !1651)
!1651 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiSearchItems", file: !6, line: 334, flags: DIFlagFwdDecl)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "search_arg", scope: !1560, file: !956, line: 247, baseType: !1535, size: 64, offset: 5760)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "rename_func", scope: !1560, file: !956, line: 249, baseType: !1654, size: 64, offset: 5824)
!1654 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiButHandleRenameFunc", file: !6, line: 337, baseType: !1655)
!1655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1656, size: 64)
!1656 = !DISubroutineType(types: !1657)
!1657 = !{null, !1614, !1535, !1541}
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "rename_arg1", scope: !1560, file: !956, line: 250, baseType: !1535, size: 64, offset: 5888)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "rename_orig", scope: !1560, file: !956, line: 251, baseType: !1535, size: 64, offset: 5952)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !1560, file: !956, line: 253, baseType: !1661, size: 64, offset: 6016)
!1661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1662, size: 64)
!1662 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiLink", file: !956, line: 193, baseType: !1663)
!1663 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !956, line: 184, size: 384, elements: !1664)
!1664 = !{!1665, !1667, !1669, !1670, !1671, !1672, !1673, !1674}
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "poin", scope: !1663, file: !956, line: 185, baseType: !1666, size: 64)
!1666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1535, size: 64)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "ppoin", scope: !1663, file: !956, line: 186, baseType: !1668, size: 64, offset: 64)
!1668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1666, size: 64)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "totlink", scope: !1663, file: !956, line: 187, baseType: !1544, size: 64, offset: 128)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "maxlink", scope: !1663, file: !956, line: 189, baseType: !1545, size: 16, offset: 192)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1663, file: !956, line: 189, baseType: !1545, size: 16, offset: 208)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "fromcode", scope: !1663, file: !956, line: 190, baseType: !1545, size: 16, offset: 224)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "tocode", scope: !1663, file: !956, line: 190, baseType: !1545, size: 16, offset: 240)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "lines", scope: !1663, file: !956, line: 192, baseType: !1627, size: 128, offset: 256)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "linkto", scope: !1560, file: !956, line: 254, baseType: !1676, size: 32, offset: 6080)
!1676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1545, size: 32, elements: !1677)
!1677 = !{!1678}
!1678 = !DISubrange(count: 2)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "tip", scope: !1560, file: !956, line: 256, baseType: !1647, size: 64, offset: 6144)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "lockstr", scope: !1560, file: !956, line: 256, baseType: !1647, size: 64, offset: 6208)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !1560, file: !956, line: 258, baseType: !1551, size: 32, offset: 6272)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !1560, file: !956, line: 259, baseType: !1550, size: 8, offset: 6304)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !1560, file: !956, line: 260, baseType: !1542, size: 8, offset: 6312)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "pie_dir", scope: !1560, file: !956, line: 261, baseType: !1685, size: 8, offset: 6320)
!1685 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !1560, file: !956, line: 262, baseType: !1542, size: 8, offset: 6328)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "unit_type", scope: !1560, file: !956, line: 263, baseType: !1550, size: 8, offset: 6336)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "modifier_key", scope: !1560, file: !956, line: 264, baseType: !1545, size: 16, offset: 6352)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "iconadd", scope: !1560, file: !956, line: 265, baseType: !1545, size: 16, offset: 6368)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "block_create_func", scope: !1560, file: !956, line: 268, baseType: !1691, size: 64, offset: 6400)
!1691 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiBlockCreateFunc", file: !6, line: 380, baseType: !1692)
!1692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1693, size: 64)
!1693 = !DISubroutineType(types: !1694)
!1694 = !{!1695, !1614, !1916, !1535}
!1695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1696, size: 64)
!1696 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiBlock", file: !6, line: 83, baseType: !1697)
!1697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uiBlock", file: !956, line: 320, size: 5440, elements: !1698)
!1698 = !{!1699, !1700, !1701, !1702, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1819, !1820, !1822, !1823, !1873, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1892, !1896, !1897, !1898, !1899, !1900, !1901, !1902, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !3209, !3210, !3211, !3213, !3214, !3215, !3216}
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1697, file: !956, line: 321, baseType: !1695, size: 64)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1697, file: !956, line: 321, baseType: !1695, size: 64, offset: 64)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "buttons", scope: !1697, file: !956, line: 323, baseType: !1627, size: 128, offset: 128)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "panel", scope: !1697, file: !956, line: 324, baseType: !1703, size: 64, offset: 256)
!1703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1704, size: 64)
!1704 = !DIDerivedType(tag: DW_TAG_typedef, name: "Panel", file: !1705, line: 113, baseType: !1706)
!1705 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Panel", file: !1705, line: 97, size: 2176, elements: !1707)
!1707 = !{!1708, !1710, !1711, !1778, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796}
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1706, file: !1705, line: 98, baseType: !1709, size: 64)
!1709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1706, size: 64)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1706, file: !1705, line: 98, baseType: !1709, size: 64, offset: 64)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1706, file: !1705, line: 100, baseType: !1712, size: 64, offset: 128)
!1712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1713, size: 64)
!1713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PanelType", file: !1714, line: 169, size: 3264, elements: !1715)
!1714 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_screen.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1715 = !{!1716, !1717, !1718, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1733, !1737, !1738}
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1713, file: !1714, line: 170, baseType: !1712, size: 64)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1713, file: !1714, line: 170, baseType: !1712, size: 64, offset: 64)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1713, file: !1714, line: 172, baseType: !1719, size: 512, offset: 128)
!1719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1542, size: 512, elements: !1720)
!1720 = !{!1721}
!1721 = !DISubrange(count: 64)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1713, file: !1714, line: 173, baseType: !1719, size: 512, offset: 640)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !1713, file: !1714, line: 174, baseType: !1719, size: 512, offset: 1152)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1713, file: !1714, line: 175, baseType: !1719, size: 512, offset: 1664)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1713, file: !1714, line: 176, baseType: !1719, size: 512, offset: 2176)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "space_type", scope: !1713, file: !1714, line: 177, baseType: !1067, size: 32, offset: 2688)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "region_type", scope: !1713, file: !1714, line: 178, baseType: !1067, size: 32, offset: 2720)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1713, file: !1714, line: 180, baseType: !1067, size: 32, offset: 2752)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !1713, file: !1714, line: 183, baseType: !1730, size: 64, offset: 2816)
!1730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1731, size: 64)
!1731 = !DISubroutineType(types: !1732)
!1732 = !{!1067, !1645, !1712}
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "draw_header", scope: !1713, file: !1714, line: 185, baseType: !1734, size: 64, offset: 2880)
!1734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1735, size: 64)
!1735 = !DISubroutineType(types: !1736)
!1736 = !{null, !1645, !1709}
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !1713, file: !1714, line: 187, baseType: !1734, size: 64, offset: 2944)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !1713, file: !1714, line: 190, baseType: !1739, size: 256, offset: 3008)
!1739 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !965, line: 436, baseType: !1740)
!1740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !965, line: 430, size: 256, elements: !1741)
!1741 = !{!1742, !1743, !1747, !1773}
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1740, file: !965, line: 431, baseType: !1535, size: 64)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !1740, file: !965, line: 432, baseType: !1744, size: 64, offset: 64)
!1744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1745, size: 64)
!1745 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !965, line: 417, baseType: !1746)
!1746 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !965, line: 41, flags: DIFlagFwdDecl)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !1740, file: !965, line: 433, baseType: !1748, size: 64, offset: 128)
!1748 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !965, line: 408, baseType: !1749)
!1749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1750, size: 64)
!1750 = !DISubroutineType(types: !1751)
!1751 = !{!1067, !1614, !1752, !1762, !1764}
!1752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1753, size: 64)
!1753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !965, line: 55, size: 192, elements: !1754)
!1754 = !{!1755, !1759, !1761}
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1753, file: !965, line: 58, baseType: !1756, size: 64)
!1756 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1753, file: !965, line: 56, size: 64, elements: !1757)
!1757 = !{!1758}
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1756, file: !965, line: 57, baseType: !1535, size: 64)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1753, file: !965, line: 60, baseType: !1760, size: 64, offset: 64)
!1760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1746, size: 64)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1753, file: !965, line: 61, baseType: !1535, size: 64, offset: 128)
!1762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1763, size: 64)
!1763 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !965, line: 38, flags: DIFlagFwdDecl)
!1764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1765, size: 64)
!1765 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !965, line: 348, baseType: !1766)
!1766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !965, line: 337, size: 256, elements: !1767)
!1767 = !{!1768, !1769, !1770, !1771, !1772}
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1766, file: !965, line: 339, baseType: !1535, size: 64)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !1766, file: !965, line: 342, baseType: !1762, size: 64, offset: 64)
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !1766, file: !965, line: 345, baseType: !1067, size: 32, offset: 128)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !1766, file: !965, line: 347, baseType: !1067, size: 32, offset: 160)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !1766, file: !965, line: 347, baseType: !1067, size: 32, offset: 192)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !1740, file: !965, line: 434, baseType: !1774, size: 64, offset: 192)
!1774 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !965, line: 409, baseType: !1775)
!1775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1776, size: 64)
!1776 = !DISubroutineType(types: !1777)
!1777 = !{null, !1535}
!1778 = !DIDerivedType(tag: DW_TAG_member, name: "layout", scope: !1706, file: !1705, line: 101, baseType: !1779, size: 64, offset: 192)
!1779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1780, size: 64)
!1780 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !1705, line: 46, flags: DIFlagFwdDecl)
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "panelname", scope: !1706, file: !1705, line: 103, baseType: !1719, size: 512, offset: 256)
!1782 = !DIDerivedType(tag: DW_TAG_member, name: "tabname", scope: !1706, file: !1705, line: 103, baseType: !1719, size: 512, offset: 768)
!1783 = !DIDerivedType(tag: DW_TAG_member, name: "drawname", scope: !1706, file: !1705, line: 104, baseType: !1719, size: 512, offset: 1280)
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "ofsx", scope: !1706, file: !1705, line: 105, baseType: !1067, size: 32, offset: 1792)
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "ofsy", scope: !1706, file: !1705, line: 105, baseType: !1067, size: 32, offset: 1824)
!1786 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !1706, file: !1705, line: 105, baseType: !1067, size: 32, offset: 1856)
!1787 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !1706, file: !1705, line: 105, baseType: !1067, size: 32, offset: 1888)
!1788 = !DIDerivedType(tag: DW_TAG_member, name: "labelofs", scope: !1706, file: !1705, line: 106, baseType: !1545, size: 16, offset: 1920)
!1789 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1706, file: !1705, line: 106, baseType: !1545, size: 16, offset: 1936)
!1790 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1706, file: !1705, line: 107, baseType: !1545, size: 16, offset: 1952)
!1791 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_flag", scope: !1706, file: !1705, line: 107, baseType: !1545, size: 16, offset: 1968)
!1792 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1706, file: !1705, line: 108, baseType: !1545, size: 16, offset: 1984)
!1793 = !DIDerivedType(tag: DW_TAG_member, name: "snap", scope: !1706, file: !1705, line: 109, baseType: !1545, size: 16, offset: 2000)
!1794 = !DIDerivedType(tag: DW_TAG_member, name: "sortorder", scope: !1706, file: !1705, line: 110, baseType: !1067, size: 32, offset: 2016)
!1795 = !DIDerivedType(tag: DW_TAG_member, name: "paneltab", scope: !1706, file: !1705, line: 111, baseType: !1709, size: 64, offset: 2048)
!1796 = !DIDerivedType(tag: DW_TAG_member, name: "activedata", scope: !1706, file: !1705, line: 112, baseType: !1535, size: 64, offset: 2112)
!1797 = !DIDerivedType(tag: DW_TAG_member, name: "oldblock", scope: !1697, file: !956, line: 325, baseType: !1695, size: 64, offset: 320)
!1798 = !DIDerivedType(tag: DW_TAG_member, name: "butstore", scope: !1697, file: !956, line: 327, baseType: !1627, size: 128, offset: 384)
!1799 = !DIDerivedType(tag: DW_TAG_member, name: "layouts", scope: !1697, file: !956, line: 329, baseType: !1627, size: 128, offset: 512)
!1800 = !DIDerivedType(tag: DW_TAG_member, name: "curlayout", scope: !1697, file: !956, line: 330, baseType: !1779, size: 64, offset: 640)
!1801 = !DIDerivedType(tag: DW_TAG_member, name: "contexts", scope: !1697, file: !956, line: 332, baseType: !1627, size: 128, offset: 704)
!1802 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1697, file: !956, line: 334, baseType: !1582, size: 1024, offset: 832)
!1803 = !DIDerivedType(tag: DW_TAG_member, name: "winmat", scope: !1697, file: !956, line: 336, baseType: !1804, size: 512, offset: 1856)
!1804 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1534, size: 512, elements: !1805)
!1805 = !{!1608, !1608}
!1806 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !1697, file: !956, line: 338, baseType: !1590, size: 128, offset: 2368)
!1807 = !DIDerivedType(tag: DW_TAG_member, name: "aspect", scope: !1697, file: !956, line: 339, baseType: !1534, size: 32, offset: 2496)
!1808 = !DIDerivedType(tag: DW_TAG_member, name: "puphash", scope: !1697, file: !956, line: 341, baseType: !7, size: 32, offset: 2528)
!1809 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !1697, file: !956, line: 343, baseType: !1610, size: 64, offset: 2560)
!1810 = !DIDerivedType(tag: DW_TAG_member, name: "func_arg1", scope: !1697, file: !956, line: 344, baseType: !1535, size: 64, offset: 2624)
!1811 = !DIDerivedType(tag: DW_TAG_member, name: "func_arg2", scope: !1697, file: !956, line: 345, baseType: !1535, size: 64, offset: 2688)
!1812 = !DIDerivedType(tag: DW_TAG_member, name: "funcN", scope: !1697, file: !956, line: 347, baseType: !1618, size: 64, offset: 2752)
!1813 = !DIDerivedType(tag: DW_TAG_member, name: "func_argN", scope: !1697, file: !956, line: 348, baseType: !1535, size: 64, offset: 2816)
!1814 = !DIDerivedType(tag: DW_TAG_member, name: "butm_func", scope: !1697, file: !956, line: 350, baseType: !1815, size: 64, offset: 2880)
!1815 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiMenuHandleFunc", file: !6, line: 346, baseType: !1816)
!1816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1817, size: 64)
!1817 = !DISubroutineType(types: !1818)
!1818 = !{null, !1614, !1535, !1067}
!1819 = !DIDerivedType(tag: DW_TAG_member, name: "butm_func_arg", scope: !1697, file: !956, line: 351, baseType: !1535, size: 64, offset: 2944)
!1820 = !DIDerivedType(tag: DW_TAG_member, name: "handle_func", scope: !1697, file: !956, line: 353, baseType: !1821, size: 64, offset: 3008)
!1821 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiBlockHandleFunc", file: !6, line: 341, baseType: !1816)
!1822 = !DIDerivedType(tag: DW_TAG_member, name: "handle_func_arg", scope: !1697, file: !956, line: 354, baseType: !1535, size: 64, offset: 3072)
!1823 = !DIDerivedType(tag: DW_TAG_member, name: "block_event_func", scope: !1697, file: !956, line: 357, baseType: !1824, size: 64, offset: 3136)
!1824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1825, size: 64)
!1825 = !DISubroutineType(types: !1826)
!1826 = !{!1067, !1645, !1827, !1828}
!1827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1697, size: 64)
!1828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1829, size: 64)
!1829 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1830)
!1830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmEvent", file: !1020, line: 421, size: 960, elements: !1831)
!1831 = !{!1832, !1834, !1835, !1836, !1837, !1838, !1839, !1841, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1869, !1870, !1871, !1872}
!1832 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1830, file: !1020, line: 422, baseType: !1833, size: 64)
!1833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1830, size: 64)
!1834 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1830, file: !1020, line: 422, baseType: !1833, size: 64, offset: 64)
!1835 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1830, file: !1020, line: 424, baseType: !1545, size: 16, offset: 128)
!1836 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1830, file: !1020, line: 425, baseType: !1545, size: 16, offset: 144)
!1837 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1830, file: !1020, line: 426, baseType: !1067, size: 32, offset: 160)
!1838 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1830, file: !1020, line: 426, baseType: !1067, size: 32, offset: 192)
!1839 = !DIDerivedType(tag: DW_TAG_member, name: "mval", scope: !1830, file: !1020, line: 427, baseType: !1840, size: 64, offset: 224)
!1840 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1067, size: 64, elements: !1677)
!1841 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_buf", scope: !1830, file: !1020, line: 428, baseType: !1842, size: 48, offset: 288)
!1842 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1542, size: 48, elements: !1843)
!1843 = !{!1844}
!1844 = !DISubrange(count: 6)
!1845 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !1830, file: !1020, line: 431, baseType: !1542, size: 8, offset: 336)
!1846 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1830, file: !1020, line: 432, baseType: !1542, size: 8, offset: 344)
!1847 = !DIDerivedType(tag: DW_TAG_member, name: "prevtype", scope: !1830, file: !1020, line: 435, baseType: !1545, size: 16, offset: 352)
!1848 = !DIDerivedType(tag: DW_TAG_member, name: "prevval", scope: !1830, file: !1020, line: 436, baseType: !1545, size: 16, offset: 368)
!1849 = !DIDerivedType(tag: DW_TAG_member, name: "prevx", scope: !1830, file: !1020, line: 437, baseType: !1067, size: 32, offset: 384)
!1850 = !DIDerivedType(tag: DW_TAG_member, name: "prevy", scope: !1830, file: !1020, line: 437, baseType: !1067, size: 32, offset: 416)
!1851 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicktime", scope: !1830, file: !1020, line: 438, baseType: !1540, size: 64, offset: 448)
!1852 = !DIDerivedType(tag: DW_TAG_member, name: "prevclickx", scope: !1830, file: !1020, line: 439, baseType: !1067, size: 32, offset: 512)
!1853 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicky", scope: !1830, file: !1020, line: 439, baseType: !1067, size: 32, offset: 544)
!1854 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !1830, file: !1020, line: 442, baseType: !1545, size: 16, offset: 576)
!1855 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !1830, file: !1020, line: 442, baseType: !1545, size: 16, offset: 592)
!1856 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !1830, file: !1020, line: 442, baseType: !1545, size: 16, offset: 608)
!1857 = !DIDerivedType(tag: DW_TAG_member, name: "oskey", scope: !1830, file: !1020, line: 442, baseType: !1545, size: 16, offset: 624)
!1858 = !DIDerivedType(tag: DW_TAG_member, name: "keymodifier", scope: !1830, file: !1020, line: 443, baseType: !1545, size: 16, offset: 640)
!1859 = !DIDerivedType(tag: DW_TAG_member, name: "check_click", scope: !1830, file: !1020, line: 446, baseType: !1545, size: 16, offset: 656)
!1860 = !DIDerivedType(tag: DW_TAG_member, name: "keymap_idname", scope: !1830, file: !1020, line: 449, baseType: !1647, size: 64, offset: 704)
!1861 = !DIDerivedType(tag: DW_TAG_member, name: "tablet_data", scope: !1830, file: !1020, line: 452, baseType: !1862, size: 64, offset: 768)
!1862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1863, size: 64)
!1863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTabletData", file: !1020, line: 463, size: 128, elements: !1864)
!1864 = !{!1865, !1866, !1867, !1868}
!1865 = !DIDerivedType(tag: DW_TAG_member, name: "Active", scope: !1863, file: !1020, line: 464, baseType: !1067, size: 32)
!1866 = !DIDerivedType(tag: DW_TAG_member, name: "Pressure", scope: !1863, file: !1020, line: 465, baseType: !1534, size: 32, offset: 32)
!1867 = !DIDerivedType(tag: DW_TAG_member, name: "Xtilt", scope: !1863, file: !1020, line: 466, baseType: !1534, size: 32, offset: 64)
!1868 = !DIDerivedType(tag: DW_TAG_member, name: "Ytilt", scope: !1863, file: !1020, line: 467, baseType: !1534, size: 32, offset: 96)
!1869 = !DIDerivedType(tag: DW_TAG_member, name: "custom", scope: !1830, file: !1020, line: 455, baseType: !1545, size: 16, offset: 832)
!1870 = !DIDerivedType(tag: DW_TAG_member, name: "customdatafree", scope: !1830, file: !1020, line: 456, baseType: !1545, size: 16, offset: 848)
!1871 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1830, file: !1020, line: 457, baseType: !1067, size: 32, offset: 864)
!1872 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !1830, file: !1020, line: 458, baseType: !1535, size: 64, offset: 896)
!1873 = !DIDerivedType(tag: DW_TAG_member, name: "drawextra", scope: !1697, file: !956, line: 360, baseType: !1874, size: 64, offset: 3200)
!1874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1875, size: 64)
!1875 = !DISubroutineType(types: !1876)
!1876 = !{null, !1645, !1535, !1535, !1535, !1877}
!1877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1878, size: 64)
!1878 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !1591, line: 89, baseType: !1879)
!1879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !1591, line: 86, size: 128, elements: !1880)
!1880 = !{!1881, !1882, !1883, !1884}
!1881 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1879, file: !1591, line: 87, baseType: !1067, size: 32)
!1882 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1879, file: !1591, line: 87, baseType: !1067, size: 32, offset: 32)
!1883 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1879, file: !1591, line: 88, baseType: !1067, size: 32, offset: 64)
!1884 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1879, file: !1591, line: 88, baseType: !1067, size: 32, offset: 96)
!1885 = !DIDerivedType(tag: DW_TAG_member, name: "drawextra_arg1", scope: !1697, file: !956, line: 361, baseType: !1535, size: 64, offset: 3264)
!1886 = !DIDerivedType(tag: DW_TAG_member, name: "drawextra_arg2", scope: !1697, file: !956, line: 362, baseType: !1535, size: 64, offset: 3328)
!1887 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1697, file: !956, line: 364, baseType: !1067, size: 32, offset: 3392)
!1888 = !DIDerivedType(tag: DW_TAG_member, name: "alignnr", scope: !1697, file: !956, line: 365, baseType: !1545, size: 16, offset: 3424)
!1889 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !1697, file: !956, line: 367, baseType: !1542, size: 8, offset: 3440)
!1890 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !1697, file: !956, line: 368, baseType: !1542, size: 8, offset: 3448)
!1891 = !DIDerivedType(tag: DW_TAG_member, name: "auto_open", scope: !1697, file: !956, line: 369, baseType: !1550, size: 8, offset: 3456)
!1892 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !1697, file: !956, line: 370, baseType: !1893, size: 56, offset: 3464)
!1893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1542, size: 56, elements: !1894)
!1894 = !{!1895}
!1895 = !DISubrange(count: 7)
!1896 = !DIDerivedType(tag: DW_TAG_member, name: "auto_open_last", scope: !1697, file: !956, line: 371, baseType: !1540, size: 64, offset: 3520)
!1897 = !DIDerivedType(tag: DW_TAG_member, name: "lockstr", scope: !1697, file: !956, line: 373, baseType: !1647, size: 64, offset: 3584)
!1898 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !1697, file: !956, line: 375, baseType: !1542, size: 8, offset: 3648)
!1899 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !1697, file: !956, line: 376, baseType: !1542, size: 8, offset: 3656)
!1900 = !DIDerivedType(tag: DW_TAG_member, name: "tooltipdisabled", scope: !1697, file: !956, line: 377, baseType: !1542, size: 8, offset: 3664)
!1901 = !DIDerivedType(tag: DW_TAG_member, name: "endblock", scope: !1697, file: !956, line: 378, baseType: !1542, size: 8, offset: 3672)
!1902 = !DIDerivedType(tag: DW_TAG_member, name: "bounds_type", scope: !1697, file: !956, line: 380, baseType: !1903, size: 32, offset: 3680)
!1903 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBlockBoundsCalc", file: !6, line: 434, baseType: !5)
!1904 = !DIDerivedType(tag: DW_TAG_member, name: "mx", scope: !1697, file: !956, line: 381, baseType: !1067, size: 32, offset: 3712)
!1905 = !DIDerivedType(tag: DW_TAG_member, name: "my", scope: !1697, file: !956, line: 381, baseType: !1067, size: 32, offset: 3744)
!1906 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1697, file: !956, line: 382, baseType: !1067, size: 32, offset: 3776)
!1907 = !DIDerivedType(tag: DW_TAG_member, name: "minbounds", scope: !1697, file: !956, line: 382, baseType: !1067, size: 32, offset: 3808)
!1908 = !DIDerivedType(tag: DW_TAG_member, name: "safety", scope: !1697, file: !956, line: 384, baseType: !1590, size: 128, offset: 3840)
!1909 = !DIDerivedType(tag: DW_TAG_member, name: "saferct", scope: !1697, file: !956, line: 385, baseType: !1627, size: 128, offset: 3968)
!1910 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !1697, file: !956, line: 387, baseType: !1911, size: 64, offset: 4096)
!1911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1912, size: 64)
!1912 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiPopupBlockHandle", file: !6, line: 84, baseType: !1913)
!1913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uiPopupBlockHandle", file: !956, line: 491, size: 1536, elements: !1914)
!1914 = !{!1915, !3089, !3090, !3091, !3092, !3093, !3094, !3098, !3099, !3114, !3115, !3120, !3197, !3200, !3201, !3202, !3203, !3204, !3205, !3206, !3207, !3208}
!1915 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1913, file: !956, line: 493, baseType: !1916, size: 64)
!1916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1917, size: 64)
!1917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !1705, line: 230, size: 3072, elements: !1918)
!1918 = !{!1919, !1920, !1921, !2864, !2865, !2866, !2867, !2868, !2869, !2870, !2871, !2872, !2873, !2874, !2875, !2876, !2877, !2878, !2879, !2880, !2881, !3079, !3080, !3081, !3082, !3083, !3084, !3085, !3086, !3087, !3088}
!1919 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1917, file: !1705, line: 231, baseType: !1916, size: 64)
!1920 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1917, file: !1705, line: 231, baseType: !1916, size: 64, offset: 64)
!1921 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !1917, file: !1705, line: 233, baseType: !1922, size: 1280, offset: 128)
!1922 = !DIDerivedType(tag: DW_TAG_typedef, name: "View2D", file: !1923, line: 71, baseType: !1924)
!1923 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view2d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View2D", file: !1923, line: 40, size: 1280, elements: !1925)
!1925 = !{!1926, !1927, !1928, !1929, !1930, !1931, !1933, !1934, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1951, !1954}
!1926 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !1924, file: !1923, line: 41, baseType: !1590, size: 128)
!1927 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !1924, file: !1923, line: 41, baseType: !1590, size: 128, offset: 128)
!1928 = !DIDerivedType(tag: DW_TAG_member, name: "vert", scope: !1924, file: !1923, line: 42, baseType: !1878, size: 128, offset: 256)
!1929 = !DIDerivedType(tag: DW_TAG_member, name: "hor", scope: !1924, file: !1923, line: 42, baseType: !1878, size: 128, offset: 384)
!1930 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !1924, file: !1923, line: 43, baseType: !1878, size: 128, offset: 512)
!1931 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1924, file: !1923, line: 45, baseType: !1932, size: 64, offset: 640)
!1932 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1534, size: 64, elements: !1677)
!1933 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1924, file: !1923, line: 45, baseType: !1932, size: 64, offset: 704)
!1934 = !DIDerivedType(tag: DW_TAG_member, name: "minzoom", scope: !1924, file: !1923, line: 46, baseType: !1534, size: 32, offset: 768)
!1935 = !DIDerivedType(tag: DW_TAG_member, name: "maxzoom", scope: !1924, file: !1923, line: 46, baseType: !1534, size: 32, offset: 800)
!1936 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !1924, file: !1923, line: 48, baseType: !1545, size: 16, offset: 832)
!1937 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_ui", scope: !1924, file: !1923, line: 49, baseType: !1545, size: 16, offset: 848)
!1938 = !DIDerivedType(tag: DW_TAG_member, name: "keeptot", scope: !1924, file: !1923, line: 51, baseType: !1545, size: 16, offset: 864)
!1939 = !DIDerivedType(tag: DW_TAG_member, name: "keepzoom", scope: !1924, file: !1923, line: 52, baseType: !1545, size: 16, offset: 880)
!1940 = !DIDerivedType(tag: DW_TAG_member, name: "keepofs", scope: !1924, file: !1923, line: 53, baseType: !1545, size: 16, offset: 896)
!1941 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1924, file: !1923, line: 55, baseType: !1545, size: 16, offset: 912)
!1942 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1924, file: !1923, line: 56, baseType: !1545, size: 16, offset: 928)
!1943 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !1924, file: !1923, line: 58, baseType: !1545, size: 16, offset: 944)
!1944 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !1924, file: !1923, line: 58, baseType: !1545, size: 16, offset: 960)
!1945 = !DIDerivedType(tag: DW_TAG_member, name: "oldwinx", scope: !1924, file: !1923, line: 59, baseType: !1545, size: 16, offset: 976)
!1946 = !DIDerivedType(tag: DW_TAG_member, name: "oldwiny", scope: !1924, file: !1923, line: 59, baseType: !1545, size: 16, offset: 992)
!1947 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !1924, file: !1923, line: 61, baseType: !1545, size: 16, offset: 1008)
!1948 = !DIDerivedType(tag: DW_TAG_member, name: "tab_offset", scope: !1924, file: !1923, line: 63, baseType: !1543, size: 64, offset: 1024)
!1949 = !DIDerivedType(tag: DW_TAG_member, name: "tab_num", scope: !1924, file: !1923, line: 64, baseType: !1067, size: 32, offset: 1088)
!1950 = !DIDerivedType(tag: DW_TAG_member, name: "tab_cur", scope: !1924, file: !1923, line: 65, baseType: !1067, size: 32, offset: 1120)
!1951 = !DIDerivedType(tag: DW_TAG_member, name: "sms", scope: !1924, file: !1923, line: 68, baseType: !1952, size: 64, offset: 1152)
!1952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1953, size: 64)
!1953 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmoothView2DStore", file: !1923, line: 68, flags: DIFlagFwdDecl)
!1954 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_timer", scope: !1924, file: !1923, line: 69, baseType: !1955, size: 64, offset: 1216)
!1955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1956, size: 64)
!1956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !1020, line: 490, size: 768, elements: !1957)
!1957 = !{!1958, !1959, !1960, !2855, !2856, !2857, !2858, !2859, !2860, !2861, !2862, !2863}
!1958 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1956, file: !1020, line: 491, baseType: !1955, size: 64)
!1959 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1956, file: !1020, line: 491, baseType: !1955, size: 64, offset: 64)
!1960 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !1956, file: !1020, line: 493, baseType: !1961, size: 64, offset: 128)
!1961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1962, size: 64)
!1962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !1963, line: 169, size: 2048, elements: !1964)
!1963 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1964 = !{!1965, !1966, !1967, !1968, !2812, !2813, !2814, !2815, !2816, !2817, !2818, !2819, !2820, !2821, !2822, !2823, !2824, !2825, !2826, !2827, !2828, !2829, !2830, !2833, !2847, !2848, !2849, !2850, !2851, !2852, !2853, !2854}
!1965 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1962, file: !1963, line: 170, baseType: !1961, size: 64)
!1966 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1962, file: !1963, line: 170, baseType: !1961, size: 64, offset: 64)
!1967 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !1962, file: !1963, line: 172, baseType: !1535, size: 64, offset: 128)
!1968 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !1962, file: !1963, line: 174, baseType: !1969, size: 64, offset: 192)
!1969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1970, size: 64)
!1970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !1705, line: 49, size: 1984, elements: !1971)
!1971 = !{!1972, !2031, !2032, !2033, !2034, !2035, !2795, !2796, !2797, !2798, !2799, !2800, !2801, !2802, !2803, !2804, !2805, !2806, !2807, !2808, !2809, !2810, !2811}
!1972 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1970, file: !1705, line: 50, baseType: !1973, size: 960)
!1973 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !1974, line: 130, baseType: !1975)
!1974 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !1974, line: 117, size: 960, elements: !1976)
!1976 = !{!1977, !1978, !1979, !1981, !2000, !2004, !2005, !2006, !2007, !2008}
!1977 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1975, file: !1974, line: 118, baseType: !1535, size: 64)
!1978 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1975, file: !1974, line: 118, baseType: !1535, size: 64, offset: 64)
!1979 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !1975, file: !1974, line: 119, baseType: !1980, size: 64, offset: 128)
!1980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1975, size: 64)
!1981 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1975, file: !1974, line: 120, baseType: !1982, size: 64, offset: 192)
!1982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1983, size: 64)
!1983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !1974, line: 136, size: 17600, elements: !1984)
!1984 = !{!1985, !1986, !1988, !1991, !1995, !1996, !1997}
!1985 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1983, file: !1974, line: 137, baseType: !1973, size: 960)
!1986 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !1983, file: !1974, line: 138, baseType: !1987, size: 64, offset: 960)
!1987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1973, size: 64)
!1988 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !1983, file: !1974, line: 139, baseType: !1989, size: 64, offset: 1024)
!1989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1990, size: 64)
!1990 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !1974, line: 43, flags: DIFlagFwdDecl)
!1991 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1983, file: !1974, line: 140, baseType: !1992, size: 8192, offset: 1088)
!1992 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1542, size: 8192, elements: !1993)
!1993 = !{!1994}
!1994 = !DISubrange(count: 1024)
!1995 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !1983, file: !1974, line: 141, baseType: !1992, size: 8192, offset: 9280)
!1996 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1983, file: !1974, line: 148, baseType: !1982, size: 64, offset: 17472)
!1997 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1983, file: !1974, line: 150, baseType: !1998, size: 64, offset: 17536)
!1998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1999, size: 64)
!1999 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !1974, line: 45, flags: DIFlagFwdDecl)
!2000 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1975, file: !1974, line: 121, baseType: !2001, size: 528, offset: 256)
!2001 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1542, size: 528, elements: !2002)
!2002 = !{!2003}
!2003 = !DISubrange(count: 66)
!2004 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1975, file: !1974, line: 126, baseType: !1545, size: 16, offset: 784)
!2005 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1975, file: !1974, line: 127, baseType: !1067, size: 32, offset: 800)
!2006 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !1975, file: !1974, line: 128, baseType: !1067, size: 32, offset: 832)
!2007 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1975, file: !1974, line: 128, baseType: !1067, size: 32, offset: 864)
!2008 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1975, file: !1974, line: 129, baseType: !2009, size: 64, offset: 896)
!2009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2010, size: 64)
!2010 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !1974, line: 75, baseType: !2011)
!2011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !1974, line: 62, size: 1024, elements: !2012)
!2012 = !{!2013, !2015, !2016, !2017, !2018, !2019, !2020, !2021, !2029, !2030}
!2013 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2011, file: !1974, line: 63, baseType: !2014, size: 64)
!2014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2011, size: 64)
!2015 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2011, file: !1974, line: 63, baseType: !2014, size: 64, offset: 64)
!2016 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !2011, file: !1974, line: 64, baseType: !1542, size: 8, offset: 128)
!2017 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !2011, file: !1974, line: 64, baseType: !1542, size: 8, offset: 136)
!2018 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !2011, file: !1974, line: 65, baseType: !1545, size: 16, offset: 144)
!2019 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2011, file: !1974, line: 66, baseType: !1719, size: 512, offset: 160)
!2020 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !2011, file: !1974, line: 67, baseType: !1067, size: 32, offset: 672)
!2021 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !2011, file: !1974, line: 69, baseType: !2022, size: 256, offset: 704)
!2022 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !1974, line: 60, baseType: !2023)
!2023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !1974, line: 48, size: 256, elements: !2024)
!2024 = !{!2025, !2026, !2027, !2028}
!2025 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !2023, file: !1974, line: 49, baseType: !1535, size: 64)
!2026 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !2023, file: !1974, line: 58, baseType: !1627, size: 128, offset: 64)
!2027 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !2023, file: !1974, line: 59, baseType: !1067, size: 32, offset: 192)
!2028 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !2023, file: !1974, line: 59, baseType: !1067, size: 32, offset: 224)
!2029 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !2011, file: !1974, line: 70, baseType: !1067, size: 32, offset: 960)
!2030 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !2011, file: !1974, line: 74, baseType: !1067, size: 32, offset: 992)
!2031 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !1970, file: !1705, line: 52, baseType: !1627, size: 128, offset: 960)
!2032 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !1970, file: !1705, line: 53, baseType: !1627, size: 128, offset: 1088)
!2033 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !1970, file: !1705, line: 54, baseType: !1627, size: 128, offset: 1216)
!2034 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !1970, file: !1705, line: 55, baseType: !1627, size: 128, offset: 1344)
!2035 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1970, file: !1705, line: 57, baseType: !2036, size: 64, offset: 1472)
!2036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2037, size: 64)
!2037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !2038, line: 1216, size: 39680, elements: !2039)
!2038 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2039 = !{!2040, !2041, !2044, !2047, !2050, !2051, !2052, !2064, !2065, !2069, !2070, !2071, !2072, !2073, !2074, !2075, !2076, !2077, !2081, !2084, !2087, !2380, !2383, !2662, !2674, !2675, !2676, !2677, !2678, !2679, !2680, !2681, !2684, !2685, !2686, !2687, !2688, !2696, !2763, !2770, !2773, !2780, !2783, !2788, !2789, !2790, !2791, !2792}
!2040 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !2037, file: !2038, line: 1217, baseType: !1973, size: 960)
!2041 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !2037, file: !2038, line: 1218, baseType: !2042, size: 64, offset: 960)
!2042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2043, size: 64)
!2043 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !2038, line: 58, flags: DIFlagFwdDecl)
!2044 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !2037, file: !2038, line: 1220, baseType: !2045, size: 64, offset: 1024)
!2045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2046, size: 64)
!2046 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !2038, line: 50, flags: DIFlagFwdDecl)
!2047 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !2037, file: !2038, line: 1221, baseType: !2048, size: 64, offset: 1088)
!2048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2049, size: 64)
!2049 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !2038, line: 52, flags: DIFlagFwdDecl)
!2050 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !2037, file: !2038, line: 1223, baseType: !2036, size: 64, offset: 1152)
!2051 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2037, file: !2038, line: 1225, baseType: !1627, size: 128, offset: 1216)
!2052 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !2037, file: !2038, line: 1226, baseType: !2053, size: 64, offset: 1344)
!2053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2054, size: 64)
!2054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !2038, line: 69, size: 320, elements: !2055)
!2055 = !{!2056, !2057, !2058, !2059, !2060, !2061, !2062, !2063}
!2056 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2054, file: !2038, line: 70, baseType: !2053, size: 64)
!2057 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2054, file: !2038, line: 70, baseType: !2053, size: 64, offset: 64)
!2058 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !2054, file: !2038, line: 71, baseType: !7, size: 32, offset: 128)
!2059 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !2054, file: !2038, line: 71, baseType: !7, size: 32, offset: 160)
!2060 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !2054, file: !2038, line: 72, baseType: !1067, size: 32, offset: 192)
!2061 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !2054, file: !2038, line: 73, baseType: !1545, size: 16, offset: 224)
!2062 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !2054, file: !2038, line: 73, baseType: !1545, size: 16, offset: 240)
!2063 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !2054, file: !2038, line: 74, baseType: !2045, size: 64, offset: 256)
!2064 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !2037, file: !2038, line: 1227, baseType: !2045, size: 64, offset: 1408)
!2065 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !2037, file: !2038, line: 1229, baseType: !2066, size: 96, offset: 1472)
!2066 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1534, size: 96, elements: !2067)
!2067 = !{!2068}
!2068 = !DISubrange(count: 3)
!2069 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !2037, file: !2038, line: 1230, baseType: !2066, size: 96, offset: 1568)
!2070 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !2037, file: !2038, line: 1231, baseType: !2066, size: 96, offset: 1664)
!2071 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !2037, file: !2038, line: 1231, baseType: !2066, size: 96, offset: 1760)
!2072 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !2037, file: !2038, line: 1233, baseType: !7, size: 32, offset: 1856)
!2073 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !2037, file: !2038, line: 1234, baseType: !1067, size: 32, offset: 1888)
!2074 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !2037, file: !2038, line: 1235, baseType: !7, size: 32, offset: 1920)
!2075 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !2037, file: !2038, line: 1237, baseType: !1545, size: 16, offset: 1952)
!2076 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !2037, file: !2038, line: 1239, baseType: !1542, size: 8, offset: 1968)
!2077 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !2037, file: !2038, line: 1240, baseType: !2078, size: 8, offset: 1976)
!2078 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1542, size: 8, elements: !2079)
!2079 = !{!2080}
!2080 = !DISubrange(count: 1)
!2081 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !2037, file: !2038, line: 1242, baseType: !2082, size: 64, offset: 1984)
!2082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2083, size: 64)
!2083 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !2038, line: 57, flags: DIFlagFwdDecl)
!2084 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !2037, file: !2038, line: 1244, baseType: !2085, size: 64, offset: 2048)
!2085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2086, size: 64)
!2086 = !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !2038, line: 59, flags: DIFlagFwdDecl)
!2087 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !2037, file: !2038, line: 1246, baseType: !2088, size: 64, offset: 2112)
!2088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2089, size: 64)
!2089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !2038, line: 1067, size: 5184, elements: !2090)
!2090 = !{!2091, !2120, !2121, !2136, !2142, !2143, !2144, !2145, !2146, !2147, !2148, !2149, !2150, !2151, !2152, !2153, !2154, !2158, !2252, !2279, !2280, !2281, !2282, !2283, !2284, !2285, !2286, !2287, !2288, !2289, !2290, !2291, !2292, !2293, !2294, !2295, !2296, !2297, !2298, !2299, !2301, !2302, !2303, !2304, !2305, !2306, !2307, !2308, !2310, !2311, !2312, !2313, !2314, !2315, !2316, !2317, !2318, !2319, !2320, !2321, !2322, !2323, !2324, !2325, !2326, !2327, !2328, !2329, !2330, !2331, !2332, !2333, !2334, !2335, !2363}
!2091 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !2089, file: !2038, line: 1068, baseType: !2092, size: 64)
!2092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2093, size: 64)
!2093 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !2038, line: 934, baseType: !2094)
!2094 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !2038, line: 925, size: 576, elements: !2095)
!2095 = !{!2096, !2111, !2112, !2113, !2114, !2116, !2119}
!2096 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !2094, file: !2038, line: 926, baseType: !2097, size: 320)
!2097 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !2038, line: 830, baseType: !2098)
!2098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !2038, line: 813, size: 320, elements: !2099)
!2099 = !{!2100, !2103, !2106, !2107, !2108, !2109, !2110}
!2100 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !2098, file: !2038, line: 814, baseType: !2101, size: 64)
!2101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2102, size: 64)
!2102 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !2038, line: 51, flags: DIFlagFwdDecl)
!2103 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !2098, file: !2038, line: 815, baseType: !2104, size: 64, offset: 64)
!2104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2105, size: 64)
!2105 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !2038, line: 815, flags: DIFlagFwdDecl)
!2106 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !2098, file: !2038, line: 818, baseType: !1535, size: 64, offset: 128)
!2107 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !2098, file: !2038, line: 819, baseType: !1606, size: 32, offset: 192)
!2108 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !2098, file: !2038, line: 822, baseType: !1067, size: 32, offset: 224)
!2109 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !2098, file: !2038, line: 826, baseType: !1067, size: 32, offset: 256)
!2110 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !2098, file: !2038, line: 829, baseType: !1067, size: 32, offset: 288)
!2111 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !2094, file: !2038, line: 928, baseType: !1545, size: 16, offset: 320)
!2112 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !2094, file: !2038, line: 928, baseType: !1545, size: 16, offset: 336)
!2113 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !2094, file: !2038, line: 929, baseType: !1067, size: 32, offset: 352)
!2114 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !2094, file: !2038, line: 930, baseType: !2115, size: 64, offset: 384)
!2115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!2116 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !2094, file: !2038, line: 931, baseType: !2117, size: 64, offset: 448)
!2117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2118, size: 64)
!2118 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !2038, line: 931, flags: DIFlagFwdDecl)
!2119 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !2094, file: !2038, line: 933, baseType: !1535, size: 64, offset: 512)
!2120 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !2089, file: !2038, line: 1069, baseType: !2092, size: 64, offset: 64)
!2121 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !2089, file: !2038, line: 1070, baseType: !2122, size: 64, offset: 128)
!2122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2123, size: 64)
!2123 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !2038, line: 916, baseType: !2124)
!2124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !2038, line: 891, size: 704, elements: !2125)
!2125 = !{!2126, !2127, !2128, !2130, !2131, !2132, !2133, !2134, !2135}
!2126 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !2124, file: !2038, line: 892, baseType: !2097, size: 320)
!2127 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !2124, file: !2038, line: 896, baseType: !1067, size: 32, offset: 320)
!2128 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !2124, file: !2038, line: 900, baseType: !2129, size: 96, offset: 352)
!2129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1067, size: 96, elements: !2067)
!2130 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !2124, file: !2038, line: 903, baseType: !1534, size: 32, offset: 448)
!2131 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !2124, file: !2038, line: 906, baseType: !1067, size: 32, offset: 480)
!2132 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !2124, file: !2038, line: 909, baseType: !1534, size: 32, offset: 512)
!2133 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !2124, file: !2038, line: 912, baseType: !1534, size: 32, offset: 544)
!2134 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !2124, file: !2038, line: 914, baseType: !2045, size: 64, offset: 576)
!2135 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !2124, file: !2038, line: 915, baseType: !1535, size: 64, offset: 640)
!2136 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !2089, file: !2038, line: 1071, baseType: !2137, size: 64, offset: 192)
!2137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2138, size: 64)
!2138 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !2038, line: 920, baseType: !2139)
!2139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !2038, line: 918, size: 320, elements: !2140)
!2140 = !{!2141}
!2141 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !2139, file: !2038, line: 919, baseType: !2097, size: 320)
!2142 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !2089, file: !2038, line: 1075, baseType: !1534, size: 32, offset: 256)
!2143 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !2089, file: !2038, line: 1077, baseType: !1534, size: 32, offset: 288)
!2144 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !2089, file: !2038, line: 1078, baseType: !1534, size: 32, offset: 320)
!2145 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !2089, file: !2038, line: 1079, baseType: !1545, size: 16, offset: 352)
!2146 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !2089, file: !2038, line: 1082, baseType: !1545, size: 16, offset: 368)
!2147 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !2089, file: !2038, line: 1085, baseType: !1542, size: 8, offset: 384)
!2148 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !2089, file: !2038, line: 1086, baseType: !1542, size: 8, offset: 392)
!2149 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !2089, file: !2038, line: 1087, baseType: !1542, size: 8, offset: 400)
!2150 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !2089, file: !2038, line: 1088, baseType: !1542, size: 8, offset: 408)
!2151 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !2089, file: !2038, line: 1090, baseType: !1534, size: 32, offset: 416)
!2152 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !2089, file: !2038, line: 1093, baseType: !1545, size: 16, offset: 448)
!2153 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !2089, file: !2038, line: 1096, baseType: !1542, size: 8, offset: 464)
!2154 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !2089, file: !2038, line: 1098, baseType: !2155, size: 40, offset: 472)
!2155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1542, size: 40, elements: !2156)
!2156 = !{!2157}
!2157 = !DISubrange(count: 5)
!2158 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !2089, file: !2038, line: 1101, baseType: !2159, size: 832, offset: 512)
!2159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !2038, line: 836, size: 832, elements: !2160)
!2160 = !{!2161, !2162, !2163, !2164, !2165, !2166, !2167, !2168, !2169, !2248, !2249, !2250, !2251}
!2161 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !2159, file: !2038, line: 837, baseType: !2097, size: 320)
!2162 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !2159, file: !2038, line: 839, baseType: !1545, size: 16, offset: 320)
!2163 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !2159, file: !2038, line: 839, baseType: !1545, size: 16, offset: 336)
!2164 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !2159, file: !2038, line: 842, baseType: !1545, size: 16, offset: 352)
!2165 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !2159, file: !2038, line: 842, baseType: !1545, size: 16, offset: 368)
!2166 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !2159, file: !2038, line: 843, baseType: !1676, size: 32, offset: 384)
!2167 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !2159, file: !2038, line: 845, baseType: !1067, size: 32, offset: 416)
!2168 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !2159, file: !2038, line: 847, baseType: !1535, size: 64, offset: 448)
!2169 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !2159, file: !2038, line: 848, baseType: !2170, size: 64, offset: 512)
!2170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2171, size: 64)
!2171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !2172, line: 77, size: 15424, elements: !2173)
!2172 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2173 = !{!2174, !2175, !2176, !2179, !2182, !2185, !2188, !2192, !2193, !2194, !2195, !2196, !2197, !2198, !2199, !2200, !2201, !2202, !2203, !2204, !2205, !2206, !2207, !2208, !2221, !2222, !2223, !2224, !2225, !2226, !2227, !2228, !2229, !2230, !2232, !2233, !2234, !2240, !2241, !2242}
!2174 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !2171, file: !2172, line: 78, baseType: !1973, size: 960)
!2175 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2171, file: !2172, line: 80, baseType: !1992, size: 8192, offset: 960)
!2176 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !2171, file: !2172, line: 82, baseType: !2177, size: 64, offset: 9152)
!2177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2178, size: 64)
!2178 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !2172, line: 43, flags: DIFlagFwdDecl)
!2179 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !2171, file: !2172, line: 83, baseType: !2180, size: 64, offset: 9216)
!2180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2181, size: 64)
!2181 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !1974, line: 46, flags: DIFlagFwdDecl)
!2182 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !2171, file: !2172, line: 86, baseType: !2183, size: 64, offset: 9280)
!2183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2184, size: 64)
!2184 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !2172, line: 41, flags: DIFlagFwdDecl)
!2185 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !2171, file: !2172, line: 87, baseType: !2186, size: 64, offset: 9344)
!2186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2187, size: 64)
!2187 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !2172, line: 44, flags: DIFlagFwdDecl)
!2188 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !2171, file: !2172, line: 89, baseType: !2189, size: 512, offset: 9408)
!2189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2186, size: 512, elements: !2190)
!2190 = !{!2191}
!2191 = !DISubrange(count: 8)
!2192 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !2171, file: !2172, line: 90, baseType: !1545, size: 16, offset: 9920)
!2193 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !2171, file: !2172, line: 90, baseType: !1545, size: 16, offset: 9936)
!2194 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !2171, file: !2172, line: 92, baseType: !1545, size: 16, offset: 9952)
!2195 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !2171, file: !2172, line: 92, baseType: !1545, size: 16, offset: 9968)
!2196 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !2171, file: !2172, line: 93, baseType: !1545, size: 16, offset: 9984)
!2197 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !2171, file: !2172, line: 93, baseType: !1545, size: 16, offset: 10000)
!2198 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !2171, file: !2172, line: 94, baseType: !1067, size: 32, offset: 10016)
!2199 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !2171, file: !2172, line: 97, baseType: !1545, size: 16, offset: 10048)
!2200 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !2171, file: !2172, line: 97, baseType: !1545, size: 16, offset: 10064)
!2201 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !2171, file: !2172, line: 98, baseType: !1545, size: 16, offset: 10080)
!2202 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !2171, file: !2172, line: 98, baseType: !1545, size: 16, offset: 10096)
!2203 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !2171, file: !2172, line: 99, baseType: !1545, size: 16, offset: 10112)
!2204 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !2171, file: !2172, line: 99, baseType: !1545, size: 16, offset: 10128)
!2205 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !2171, file: !2172, line: 100, baseType: !7, size: 32, offset: 10144)
!2206 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !2171, file: !2172, line: 101, baseType: !2115, size: 64, offset: 10176)
!2207 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !2171, file: !2172, line: 103, baseType: !1998, size: 64, offset: 10240)
!2208 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !2171, file: !2172, line: 104, baseType: !2209, size: 64, offset: 10304)
!2209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2210, size: 64)
!2210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !1974, line: 159, size: 448, elements: !2211)
!2211 = !{!2212, !2214, !2215, !2216, !2217, !2219}
!2212 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !2210, file: !1974, line: 161, baseType: !2213, size: 64)
!2213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !1677)
!2214 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !2210, file: !1974, line: 162, baseType: !2213, size: 64, offset: 64)
!2215 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !2210, file: !1974, line: 163, baseType: !1676, size: 32, offset: 128)
!2216 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !2210, file: !1974, line: 164, baseType: !1676, size: 32, offset: 160)
!2217 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !2210, file: !1974, line: 165, baseType: !2218, size: 128, offset: 192)
!2218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2115, size: 128, elements: !1677)
!2219 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !2210, file: !1974, line: 166, baseType: !2220, size: 128, offset: 320)
!2220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2180, size: 128, elements: !1677)
!2221 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !2171, file: !2172, line: 107, baseType: !1534, size: 32, offset: 10368)
!2222 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !2171, file: !2172, line: 108, baseType: !1067, size: 32, offset: 10400)
!2223 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !2171, file: !2172, line: 109, baseType: !1545, size: 16, offset: 10432)
!2224 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !2171, file: !2172, line: 110, baseType: !1545, size: 16, offset: 10448)
!2225 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !2171, file: !2172, line: 113, baseType: !1067, size: 32, offset: 10464)
!2226 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !2171, file: !2172, line: 113, baseType: !1067, size: 32, offset: 10496)
!2227 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !2171, file: !2172, line: 114, baseType: !1542, size: 8, offset: 10528)
!2228 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !2171, file: !2172, line: 114, baseType: !1542, size: 8, offset: 10536)
!2229 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !2171, file: !2172, line: 115, baseType: !1545, size: 16, offset: 10544)
!2230 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !2171, file: !2172, line: 116, baseType: !2231, size: 128, offset: 10560)
!2231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1534, size: 128, elements: !1607)
!2232 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !2171, file: !2172, line: 119, baseType: !1534, size: 32, offset: 10688)
!2233 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !2171, file: !2172, line: 119, baseType: !1534, size: 32, offset: 10720)
!2234 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !2171, file: !2172, line: 122, baseType: !2235, size: 512, offset: 10752)
!2235 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !2236, line: 182, baseType: !2237)
!2236 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !2236, line: 180, size: 512, elements: !2238)
!2238 = !{!2239}
!2239 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2237, file: !2236, line: 181, baseType: !1719, size: 512)
!2240 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !2171, file: !2172, line: 123, baseType: !1542, size: 8, offset: 11264)
!2241 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !2171, file: !2172, line: 125, baseType: !1893, size: 56, offset: 11272)
!2242 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !2171, file: !2172, line: 126, baseType: !2243, size: 4096, offset: 11328)
!2243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2244, size: 4096, elements: !2190)
!2244 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !2172, line: 69, baseType: !2245)
!2245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !2172, line: 67, size: 512, elements: !2246)
!2246 = !{!2247}
!2247 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2245, file: !2172, line: 68, baseType: !1719, size: 512)
!2248 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !2159, file: !2038, line: 849, baseType: !2170, size: 64, offset: 576)
!2249 = !DIDerivedType(tag: DW_TAG_member, name: "canvas", scope: !2159, file: !2038, line: 850, baseType: !2170, size: 64, offset: 640)
!2250 = !DIDerivedType(tag: DW_TAG_member, name: "stencil_col", scope: !2159, file: !2038, line: 851, baseType: !2066, size: 96, offset: 704)
!2251 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !2159, file: !2038, line: 852, baseType: !1534, size: 32, offset: 800)
!2252 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !2089, file: !2038, line: 1104, baseType: !2253, size: 1344, offset: 1344)
!2253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleEditSettings", file: !2038, line: 867, size: 1344, elements: !2254)
!2254 = !{!2255, !2256, !2257, !2258, !2259, !2270, !2271, !2272, !2273, !2274, !2275, !2276, !2277, !2278}
!2255 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !2253, file: !2038, line: 868, baseType: !1545, size: 16)
!2256 = !DIDerivedType(tag: DW_TAG_member, name: "totrekey", scope: !2253, file: !2038, line: 869, baseType: !1545, size: 16, offset: 16)
!2257 = !DIDerivedType(tag: DW_TAG_member, name: "totaddkey", scope: !2253, file: !2038, line: 870, baseType: !1545, size: 16, offset: 32)
!2258 = !DIDerivedType(tag: DW_TAG_member, name: "brushtype", scope: !2253, file: !2038, line: 871, baseType: !1545, size: 16, offset: 48)
!2259 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !2253, file: !2038, line: 873, baseType: !2260, size: 896, offset: 64)
!2260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2261, size: 896, elements: !1894)
!2261 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParticleBrushData", file: !2038, line: 864, baseType: !2262)
!2262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleBrushData", file: !2038, line: 859, size: 128, elements: !2263)
!2263 = !{!2264, !2265, !2266, !2267, !2268, !2269}
!2264 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2262, file: !2038, line: 860, baseType: !1545, size: 16)
!2265 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !2262, file: !2038, line: 861, baseType: !1545, size: 16, offset: 16)
!2266 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !2262, file: !2038, line: 861, baseType: !1545, size: 16, offset: 32)
!2267 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !2262, file: !2038, line: 861, baseType: !1545, size: 16, offset: 48)
!2268 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !2262, file: !2038, line: 862, baseType: !1067, size: 32, offset: 64)
!2269 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !2262, file: !2038, line: 863, baseType: !1534, size: 32, offset: 96)
!2270 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !2253, file: !2038, line: 874, baseType: !1535, size: 64, offset: 960)
!2271 = !DIDerivedType(tag: DW_TAG_member, name: "emitterdist", scope: !2253, file: !2038, line: 876, baseType: !1534, size: 32, offset: 1024)
!2272 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !2253, file: !2038, line: 876, baseType: !1534, size: 32, offset: 1056)
!2273 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !2253, file: !2038, line: 878, baseType: !1067, size: 32, offset: 1088)
!2274 = !DIDerivedType(tag: DW_TAG_member, name: "edittype", scope: !2253, file: !2038, line: 879, baseType: !1067, size: 32, offset: 1120)
!2275 = !DIDerivedType(tag: DW_TAG_member, name: "draw_step", scope: !2253, file: !2038, line: 881, baseType: !1067, size: 32, offset: 1152)
!2276 = !DIDerivedType(tag: DW_TAG_member, name: "fade_frames", scope: !2253, file: !2038, line: 881, baseType: !1067, size: 32, offset: 1184)
!2277 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !2253, file: !2038, line: 883, baseType: !2036, size: 64, offset: 1216)
!2278 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !2253, file: !2038, line: 884, baseType: !2045, size: 64, offset: 1280)
!2279 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_size", scope: !2089, file: !2038, line: 1107, baseType: !1534, size: 32, offset: 2688)
!2280 = !DIDerivedType(tag: DW_TAG_member, name: "select_thresh", scope: !2089, file: !2038, line: 1110, baseType: !1534, size: 32, offset: 2720)
!2281 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_mode", scope: !2089, file: !2038, line: 1113, baseType: !1545, size: 16, offset: 2752)
!2282 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_flag", scope: !2089, file: !2038, line: 1113, baseType: !1545, size: 16, offset: 2768)
!2283 = !DIDerivedType(tag: DW_TAG_member, name: "multires_subdiv_type", scope: !2089, file: !2038, line: 1116, baseType: !1542, size: 8, offset: 2784)
!2284 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !2089, file: !2038, line: 1117, baseType: !2078, size: 8, offset: 2792)
!2285 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_resolution", scope: !2089, file: !2038, line: 1120, baseType: !1545, size: 16, offset: 2800)
!2286 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_internal", scope: !2089, file: !2038, line: 1121, baseType: !1534, size: 32, offset: 2816)
!2287 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_external", scope: !2089, file: !2038, line: 1122, baseType: !1534, size: 32, offset: 2848)
!2288 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_ratio", scope: !2089, file: !2038, line: 1123, baseType: !1534, size: 32, offset: 2880)
!2289 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_limit", scope: !2089, file: !2038, line: 1124, baseType: !1534, size: 32, offset: 2912)
!2290 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_angle_limit", scope: !2089, file: !2038, line: 1125, baseType: !1534, size: 32, offset: 2944)
!2291 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_correlation_limit", scope: !2089, file: !2038, line: 1126, baseType: !1534, size: 32, offset: 2976)
!2292 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_symmetry_limit", scope: !2089, file: !2038, line: 1127, baseType: !1534, size: 32, offset: 3008)
!2293 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_angle_weight", scope: !2089, file: !2038, line: 1128, baseType: !1534, size: 32, offset: 3040)
!2294 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_length_weight", scope: !2089, file: !2038, line: 1129, baseType: !1534, size: 32, offset: 3072)
!2295 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_distance_weight", scope: !2089, file: !2038, line: 1130, baseType: !1534, size: 32, offset: 3104)
!2296 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_options", scope: !2089, file: !2038, line: 1131, baseType: !1545, size: 16, offset: 3136)
!2297 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro", scope: !2089, file: !2038, line: 1132, baseType: !1542, size: 8, offset: 3152)
!2298 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro_passes", scope: !2089, file: !2038, line: 1133, baseType: !1542, size: 8, offset: 3160)
!2299 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivisions", scope: !2089, file: !2038, line: 1134, baseType: !2300, size: 24, offset: 3168)
!2300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1542, size: 24, elements: !2067)
!2301 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_multi_level", scope: !2089, file: !2038, line: 1135, baseType: !1542, size: 8, offset: 3192)
!2302 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_template", scope: !2089, file: !2038, line: 1138, baseType: !2045, size: 64, offset: 3200)
!2303 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching", scope: !2089, file: !2038, line: 1139, baseType: !1542, size: 8, offset: 3264)
!2304 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching_convert", scope: !2089, file: !2038, line: 1140, baseType: !1542, size: 8, offset: 3272)
!2305 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivision_number", scope: !2089, file: !2038, line: 1141, baseType: !1542, size: 8, offset: 3280)
!2306 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_options", scope: !2089, file: !2038, line: 1142, baseType: !1542, size: 8, offset: 3288)
!2307 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_roll", scope: !2089, file: !2038, line: 1143, baseType: !1542, size: 8, offset: 3296)
!2308 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_side_string", scope: !2089, file: !2038, line: 1144, baseType: !2309, size: 64, offset: 3304)
!2309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1542, size: 64, elements: !2190)
!2310 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_num_string", scope: !2089, file: !2038, line: 1145, baseType: !2309, size: 64, offset: 3368)
!2311 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode", scope: !2089, file: !2038, line: 1148, baseType: !1542, size: 8, offset: 3432)
!2312 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode_live_unwrap", scope: !2089, file: !2038, line: 1149, baseType: !1542, size: 8, offset: 3440)
!2313 = !DIDerivedType(tag: DW_TAG_member, name: "snap_mode", scope: !2089, file: !2038, line: 1152, baseType: !1542, size: 8, offset: 3448)
!2314 = !DIDerivedType(tag: DW_TAG_member, name: "snap_node_mode", scope: !2089, file: !2038, line: 1152, baseType: !1542, size: 8, offset: 3456)
!2315 = !DIDerivedType(tag: DW_TAG_member, name: "snap_uv_mode", scope: !2089, file: !2038, line: 1153, baseType: !1542, size: 8, offset: 3464)
!2316 = !DIDerivedType(tag: DW_TAG_member, name: "snap_flag", scope: !2089, file: !2038, line: 1154, baseType: !1545, size: 16, offset: 3472)
!2317 = !DIDerivedType(tag: DW_TAG_member, name: "snap_target", scope: !2089, file: !2038, line: 1154, baseType: !1545, size: 16, offset: 3488)
!2318 = !DIDerivedType(tag: DW_TAG_member, name: "proportional", scope: !2089, file: !2038, line: 1155, baseType: !1545, size: 16, offset: 3504)
!2319 = !DIDerivedType(tag: DW_TAG_member, name: "prop_mode", scope: !2089, file: !2038, line: 1155, baseType: !1545, size: 16, offset: 3520)
!2320 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_objects", scope: !2089, file: !2038, line: 1156, baseType: !1542, size: 8, offset: 3536)
!2321 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_mask", scope: !2089, file: !2038, line: 1157, baseType: !1542, size: 8, offset: 3544)
!2322 = !DIDerivedType(tag: DW_TAG_member, name: "auto_normalize", scope: !2089, file: !2038, line: 1159, baseType: !1542, size: 8, offset: 3552)
!2323 = !DIDerivedType(tag: DW_TAG_member, name: "multipaint", scope: !2089, file: !2038, line: 1160, baseType: !1542, size: 8, offset: 3560)
!2324 = !DIDerivedType(tag: DW_TAG_member, name: "weightuser", scope: !2089, file: !2038, line: 1161, baseType: !1542, size: 8, offset: 3568)
!2325 = !DIDerivedType(tag: DW_TAG_member, name: "vgroupsubset", scope: !2089, file: !2038, line: 1162, baseType: !1542, size: 8, offset: 3576)
