; ModuleID = 'blender/source/blender/bmesh/intern/bmesh_log.c'
source_filename = "blender/source/blender/bmesh/intern/bmesh_log.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BMLog = type { %struct.RangeTreeUInt*, %struct.GHash*, %struct.GHash*, %struct.ListBase, %struct.BMLogEntry* }
%struct.RangeTreeUInt = type opaque
%struct.GHash = type opaque
%struct.ListBase = type { i8*, i8* }
%struct.BMLogEntry = type { %struct.BMLogEntry*, %struct.BMLogEntry*, %struct.GHash*, %struct.GHash*, %struct.GHash*, %struct.GHash*, %struct.GHash*, %struct.GHash*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BMLog* }
%struct.BLI_mempool = type opaque
%struct.BMesh = type { i32, i32, i32, i32, i32, i32, i32, i8, i8, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BMVert**, %struct.BMEdge**, %struct.BMFace**, i32, i32, i32, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, i32, %struct.BMOperator*, %struct.CustomData, %struct.CustomData, %struct.CustomData, %struct.CustomData, i16, i32, i32, i32, %struct.ListBase, %struct.BMFace*, %struct.ListBase, i8* }
%struct.BMVert = type { %struct.BMHeader, %struct.BMFlagLayer*, [3 x float], [3 x float], %struct.BMEdge* }
%struct.BMHeader = type { i8*, i32, i8, i8, i8 }
%struct.BMFlagLayer = type { i16 }

!56 = !DIEnumerator(name: "BM_ALL_LOOPS_OF_FACE", value: 12, isUnsigned: true)
!57 = !DIEnumerator(name: "BM_LOOPS_OF_LOOP", value: 13, isUnsigned: true)
!58 = !DIEnumerator(name: "BM_LOOPS_OF_EDGE", value: 14, isUnsigned: true)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !60, line: 76, baseType: !5, size: 32, elements: !61)
!60 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!61 = !{!62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102}
!62 = !DIEnumerator(name: "CD_MVERT", value: 0, isUnsigned: true)
!63 = !DIEnumerator(name: "CD_MSTICKY", value: 1, isUnsigned: true)
!64 = !DIEnumerator(name: "CD_MDEFORMVERT", value: 2, isUnsigned: true)
!65 = !DIEnumerator(name: "CD_MEDGE", value: 3, isUnsigned: true)
!66 = !DIEnumerator(name: "CD_MFACE", value: 4, isUnsigned: true)
!67 = !DIEnumerator(name: "CD_MTFACE", value: 5, isUnsigned: true)
!68 = !DIEnumerator(name: "CD_MCOL", value: 6, isUnsigned: true)
!69 = !DIEnumerator(name: "CD_ORIGINDEX", value: 7, isUnsigned: true)
!70 = !DIEnumerator(name: "CD_NORMAL", value: 8, isUnsigned: true)
!71 = !DIEnumerator(name: "CD_PROP_FLT", value: 10, isUnsigned: true)
!72 = !DIEnumerator(name: "CD_PROP_INT", value: 11, isUnsigned: true)
!73 = !DIEnumerator(name: "CD_PROP_STR", value: 12, isUnsigned: true)
!74 = !DIEnumerator(name: "CD_ORIGSPACE", value: 13, isUnsigned: true)
!75 = !DIEnumerator(name: "CD_ORCO", value: 14, isUnsigned: true)
!76 = !DIEnumerator(name: "CD_MTEXPOLY", value: 15, isUnsigned: true)
!77 = !DIEnumerator(name: "CD_MLOOPUV", value: 16, isUnsigned: true)
!78 = !DIEnumerator(name: "CD_MLOOPCOL", value: 17, isUnsigned: true)
!79 = !DIEnumerator(name: "CD_TANGENT", value: 18, isUnsigned: true)
!80 = !DIEnumerator(name: "CD_MDISPS", value: 19, isUnsigned: true)
!81 = !DIEnumerator(name: "CD_PREVIEW_MCOL", value: 20, isUnsigned: true)
!82 = !DIEnumerator(name: "CD_ID_MCOL", value: 21, isUnsigned: true)
!83 = !DIEnumerator(name: "CD_TEXTURE_MCOL", value: 22, isUnsigned: true)
!84 = !DIEnumerator(name: "CD_CLOTH_ORCO", value: 23, isUnsigned: true)
!85 = !DIEnumerator(name: "CD_RECAST", value: 24, isUnsigned: true)
!86 = !DIEnumerator(name: "CD_MPOLY", value: 25, isUnsigned: true)
!87 = !DIEnumerator(name: "CD_MLOOP", value: 26, isUnsigned: true)
!88 = !DIEnumerator(name: "CD_SHAPE_KEYINDEX", value: 27, isUnsigned: true)
!89 = !DIEnumerator(name: "CD_SHAPEKEY", value: 28, isUnsigned: true)
!90 = !DIEnumerator(name: "CD_BWEIGHT", value: 29, isUnsigned: true)
!91 = !DIEnumerator(name: "CD_CREASE", value: 30, isUnsigned: true)
!92 = !DIEnumerator(name: "CD_ORIGSPACE_MLOOP", value: 31, isUnsigned: true)
!93 = !DIEnumerator(name: "CD_PREVIEW_MLOOPCOL", value: 32, isUnsigned: true)
!94 = !DIEnumerator(name: "CD_BM_ELEM_PYPTR", value: 33, isUnsigned: true)
!95 = !DIEnumerator(name: "CD_PAINT_MASK", value: 34, isUnsigned: true)
!96 = !DIEnumerator(name: "CD_GRID_PAINT_MASK", value: 35, isUnsigned: true)
!97 = !DIEnumerator(name: "CD_MVERT_SKIN", value: 36, isUnsigned: true)
!98 = !DIEnumerator(name: "CD_FREESTYLE_EDGE", value: 37, isUnsigned: true)
!99 = !DIEnumerator(name: "CD_FREESTYLE_FACE", value: 38, isUnsigned: true)
!100 = !DIEnumerator(name: "CD_MLOOPTANGENT", value: 39, isUnsigned: true)
!101 = !DIEnumerator(name: "CD_TESSLOOPNORMAL", value: 40, isUnsigned: true)
!102 = !DIEnumerator(name: "CD_NUMTYPES", value: 41, isUnsigned: true)
!103 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !104, line: 83, baseType: !5, size: 32, elements: !105)
!104 = !DIFile(filename: "blender/source/blender/blenlib/BLI_mempool.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!105 = !{!106, !107}
!106 = !DIEnumerator(name: "BLI_MEMPOOL_NOP", value: 0, isUnsigned: true)
!107 = !DIEnumerator(name: "BLI_MEMPOOL_ALLOW_ITER", value: 1, isUnsigned: true)
!108 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMCreateFlag", file: !109, line: 33, baseType: !5, size: 32, elements: !110)
!109 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_core.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!110 = !{!111, !112, !113}
!111 = !DIEnumerator(name: "BM_CREATE_NOP", value: 0, isUnsigned: true)
!112 = !DIEnumerator(name: "BM_CREATE_NO_DOUBLE", value: 2, isUnsigned: true)
!113 = !DIEnumerator(name: "BM_CREATE_SKIP_CD", value: 4, isUnsigned: true)
!114 = !{!5, !115, !118, !119, !120, !122, !129, !130, !134, !138, !205, !207, !189, !209, !210, !159}
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !116, line: 46, baseType: !117)
!116 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!117 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !121, line: 90, baseType: !117)
!121 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_gh_Entry", file: !124, line: 94, size: 192, elements: !125)
!124 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!125 = !{!126, !127, !128}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !123, file: !124, line: 94, baseType: !118, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !123, file: !124, line: 94, baseType: !118, size: 64, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !123, file: !124, line: 94, baseType: !118, size: 64, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !43, line: 79, baseType: !42)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !43, line: 158, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{null, !118}
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !43, line: 159, baseType: !135)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{!118, !118}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !140, line: 103, baseType: !141)
!140 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !140, line: 90, size: 448, elements: !142)
!142 = !{!143, !154, !160, !165, !166}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !141, file: !140, line: 91, baseType: !144, size: 128)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !140, line: 82, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !140, line: 64, size: 128, elements: !146)
!146 = !{!147, !148, !150, !152, !153}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !145, file: !140, line: 65, baseType: !118, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !145, file: !140, line: 66, baseType: !149, size: 32, offset: 64)
!149 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !145, file: !140, line: 73, baseType: !151, size: 8, offset: 96)
!151 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !145, file: !140, line: 74, baseType: !151, size: 8, offset: 104)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !145, file: !140, line: 80, baseType: !151, size: 8, offset: 112)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !141, file: !140, line: 92, baseType: !155, size: 64, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !140, line: 180, size: 16, elements: !157)
!157 = !{!158}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !156, file: !140, line: 181, baseType: !159, size: 16)
!159 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !141, file: !140, line: 94, baseType: !161, size: 96, offset: 192)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !162, size: 96, elements: !163)
!162 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!163 = !{!164}
!164 = !DISubrange(count: 3)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !141, file: !140, line: 95, baseType: !161, size: 96, offset: 288)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !141, file: !140, line: 102, baseType: !167, size: 64, offset: 384)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !140, line: 110, size: 640, elements: !169)
!169 = !{!170, !171, !172, !174, !175, !198, !204}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !168, file: !140, line: 111, baseType: !144, size: 128)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !168, file: !140, line: 112, baseType: !155, size: 64, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !168, file: !140, line: 114, baseType: !173, size: 64, offset: 192)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !168, file: !140, line: 114, baseType: !173, size: 64, offset: 256)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !168, file: !140, line: 118, baseType: !176, size: 64, offset: 320)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !140, line: 125, size: 576, elements: !178)
!178 = !{!179, !180, !181, !182, !194, !195, !196, !197}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !177, file: !140, line: 126, baseType: !144, size: 128)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !177, file: !140, line: 129, baseType: !173, size: 64, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !177, file: !140, line: 130, baseType: !167, size: 64, offset: 192)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !177, file: !140, line: 131, baseType: !183, size: 64, offset: 256)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !140, line: 164, size: 448, elements: !185)
!185 = !{!186, !187, !188, !191, !192, !193}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !184, file: !140, line: 165, baseType: !144, size: 128)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !184, file: !140, line: 166, baseType: !155, size: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !184, file: !140, line: 172, baseType: !189, size: 64, offset: 192)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !140, line: 140, baseType: !177)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !184, file: !140, line: 174, baseType: !149, size: 32, offset: 256)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !184, file: !140, line: 175, baseType: !161, size: 96, offset: 288)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !184, file: !140, line: 176, baseType: !159, size: 16, offset: 384)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !177, file: !140, line: 135, baseType: !176, size: 64, offset: 320)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !177, file: !140, line: 135, baseType: !176, size: 64, offset: 384)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !177, file: !140, line: 139, baseType: !176, size: 64, offset: 448)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !177, file: !140, line: 139, baseType: !176, size: 64, offset: 512)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !168, file: !140, line: 122, baseType: !199, size: 128, offset: 384)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !140, line: 108, baseType: !200)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !140, line: 106, size: 128, elements: !201)
!201 = !{!202, !203}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !200, file: !140, line: 107, baseType: !167, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !200, file: !140, line: 107, baseType: !167, size: 64, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !168, file: !140, line: 122, baseType: !199, size: 128, offset: 512)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !140, line: 123, baseType: !168)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !140, line: 178, baseType: !184)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!211 = !{i32 7, !"Dwarf Version", i32 4}
!212 = !{i32 2, !"Debug Info Version", i32 3}
!213 = !{i32 1, !"wchar_size", i32 4}
!214 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!215 = distinct !DISubprogram(name: "BM_log_create", scope: !1, file: !1, line: 476, type: !216, scopeLine: 477, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !387)
!216 = !DISubroutineType(types: !217)
!217 = !{!218, !258}
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLog", file: !220, line: 33, baseType: !221)
!220 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_log.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLog", file: !1, line: 85, size: 384, elements: !222)
!222 = !{!223, !226, !230, !231, !238}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "unused_ids", scope: !221, file: !1, line: 87, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeTreeUInt", file: !220, line: 31, flags: DIFlagFwdDecl)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "id_to_elem", scope: !221, file: !1, line: 98, baseType: !227, size: 64, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !124, line: 48, baseType: !229)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !124, line: 48, flags: DIFlagFwdDecl)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "elem_to_id", scope: !221, file: !1, line: 99, baseType: !227, size: 64, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !221, file: !1, line: 102, baseType: !232, size: 128, offset: 192)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !233, line: 71, baseType: !234)
!233 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !233, line: 69, size: 128, elements: !235)
!235 = !{!236, !237}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !234, file: !233, line: 70, baseType: !118, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !234, file: !233, line: 70, baseType: !118, size: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "current_entry", scope: !221, file: !1, line: 112, baseType: !239, size: 64, offset: 320)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLogEntry", file: !220, line: 34, baseType: !241)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLogEntry", file: !1, line: 53, size: 704, elements: !242)
!242 = !{!243, !245, !246, !247, !248, !249, !250, !251, !252, !256, !257}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !241, file: !1, line: 54, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !241, file: !1, line: 54, baseType: !244, size: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "deleted_verts", scope: !241, file: !1, line: 61, baseType: !227, size: 64, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "deleted_faces", scope: !241, file: !1, line: 62, baseType: !227, size: 64, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "added_verts", scope: !241, file: !1, line: 65, baseType: !227, size: 64, offset: 256)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "added_faces", scope: !241, file: !1, line: 66, baseType: !227, size: 64, offset: 320)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "modified_verts", scope: !241, file: !1, line: 69, baseType: !227, size: 64, offset: 384)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "modified_faces", scope: !241, file: !1, line: 70, baseType: !227, size: 64, offset: 448)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "pool_verts", scope: !241, file: !1, line: 72, baseType: !253, size: 64, offset: 512)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool", file: !104, line: 47, baseType: !255)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !104, line: 44, flags: DIFlagFwdDecl)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "pool_faces", scope: !241, file: !1, line: 73, baseType: !253, size: 64, offset: 576)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !241, file: !1, line: 82, baseType: !218, size: 64, offset: 640)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !140, line: 246, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !140, line: 186, size: 8064, elements: !261)
!261 = !{!262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !273, !274, !275, !276, !278, !280, !282, !283, !284, !285, !286, !287, !288, !289, !337, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !260, file: !140, line: 187, baseType: !149, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !260, file: !140, line: 187, baseType: !149, size: 32, offset: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !260, file: !140, line: 187, baseType: !149, size: 32, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !260, file: !140, line: 187, baseType: !149, size: 32, offset: 96)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !260, file: !140, line: 188, baseType: !149, size: 32, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !260, file: !140, line: 188, baseType: !149, size: 32, offset: 160)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !260, file: !140, line: 188, baseType: !149, size: 32, offset: 192)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !260, file: !140, line: 193, baseType: !151, size: 8, offset: 224)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !260, file: !140, line: 197, baseType: !151, size: 8, offset: 232)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !260, file: !140, line: 201, baseType: !272, size: 64, offset: 256)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !260, file: !140, line: 201, baseType: !272, size: 64, offset: 320)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !260, file: !140, line: 201, baseType: !272, size: 64, offset: 384)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !260, file: !140, line: 201, baseType: !272, size: 64, offset: 448)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !260, file: !140, line: 208, baseType: !277, size: 64, offset: 512)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !260, file: !140, line: 209, baseType: !279, size: 64, offset: 576)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !260, file: !140, line: 210, baseType: !281, size: 64, offset: 640)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !260, file: !140, line: 213, baseType: !149, size: 32, offset: 704)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !260, file: !140, line: 214, baseType: !149, size: 32, offset: 736)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !260, file: !140, line: 215, baseType: !149, size: 32, offset: 768)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !260, file: !140, line: 218, baseType: !272, size: 64, offset: 832)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !260, file: !140, line: 218, baseType: !272, size: 64, offset: 896)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !260, file: !140, line: 218, baseType: !272, size: 64, offset: 960)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !260, file: !140, line: 220, baseType: !149, size: 32, offset: 1024)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !260, file: !140, line: 221, baseType: !290, size: 64, offset: 1088)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !4, line: 190, size: 10496, elements: !292)
!292 = !{!293, !325, !326, !330, !333, !334, !336}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !291, file: !4, line: 191, baseType: !294, size: 5120)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 5120, elements: !323)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !4, line: 147, size: 320, elements: !296)
!296 = !{!297, !300, !302, !312, !313}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !295, file: !4, line: 148, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !295, file: !4, line: 149, baseType: !301, size: 32, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !4, line: 112, baseType: !3)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !295, file: !4, line: 150, baseType: !303, size: 32, offset: 96)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !4, line: 142, baseType: !304)
!304 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !4, line: 138, size: 32, elements: !305)
!305 = !{!306, !308, !310}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !304, file: !4, line: 139, baseType: !307, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !4, line: 122, baseType: !15)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !304, file: !4, line: 140, baseType: !309, size: 32)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !4, line: 136, baseType: !21)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !304, file: !4, line: 141, baseType: !311, size: 32)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !4, line: 130, baseType: !27)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !295, file: !4, line: 152, baseType: !149, size: 32, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !295, file: !4, line: 162, baseType: !314, size: 128, offset: 192)
!314 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !295, file: !4, line: 155, size: 128, elements: !315)
!315 = !{!316, !317, !318, !319, !320, !322}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !314, file: !4, line: 156, baseType: !149, size: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !314, file: !4, line: 157, baseType: !162, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !314, file: !4, line: 158, baseType: !118, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !314, file: !4, line: 159, baseType: !161, size: 96)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !314, file: !4, line: 160, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !314, file: !4, line: 161, baseType: !227, size: 64)
!323 = !{!324}
!324 = !DISubrange(count: 16)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !291, file: !4, line: 192, baseType: !294, size: 5120, offset: 5120)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !291, file: !4, line: 193, baseType: !327, size: 64, offset: 10240)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{null, !258, !290}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !291, file: !4, line: 194, baseType: !331, size: 64, offset: 10304)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !4, line: 194, flags: DIFlagFwdDecl)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !291, file: !4, line: 195, baseType: !149, size: 32, offset: 10368)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !291, file: !4, line: 196, baseType: !335, size: 32, offset: 10400)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !4, line: 188, baseType: !35)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !291, file: !4, line: 197, baseType: !149, size: 32, offset: 10432)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !260, file: !140, line: 223, baseType: !338, size: 1600, offset: 1152)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !60, line: 73, baseType: !339)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !60, line: 64, size: 1600, elements: !340)
!340 = !{!341, !359, !363, !364, !365, !366, !367}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !339, file: !60, line: 65, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !60, line: 53, baseType: !344)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !60, line: 42, size: 832, elements: !345)
!345 = !{!346, !347, !348, !349, !350, !351, !352, !353, !354, !358}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !344, file: !60, line: 43, baseType: !149, size: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !344, file: !60, line: 44, baseType: !149, size: 32, offset: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !344, file: !60, line: 45, baseType: !149, size: 32, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !344, file: !60, line: 46, baseType: !149, size: 32, offset: 96)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !344, file: !60, line: 47, baseType: !149, size: 32, offset: 128)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !344, file: !60, line: 48, baseType: !149, size: 32, offset: 160)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !344, file: !60, line: 49, baseType: !149, size: 32, offset: 192)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !344, file: !60, line: 50, baseType: !149, size: 32, offset: 224)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !344, file: !60, line: 51, baseType: !355, size: 512, offset: 256)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 512, elements: !356)
!356 = !{!357}
!357 = !DISubrange(count: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !344, file: !60, line: 52, baseType: !118, size: 64, offset: 768)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !339, file: !60, line: 66, baseType: !360, size: 1312, offset: 64)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 1312, elements: !361)
!361 = !{!362}
!362 = !DISubrange(count: 41)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !339, file: !60, line: 69, baseType: !149, size: 32, offset: 1376)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !339, file: !60, line: 69, baseType: !149, size: 32, offset: 1408)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !339, file: !60, line: 70, baseType: !149, size: 32, offset: 1440)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !339, file: !60, line: 71, baseType: !272, size: 64, offset: 1472)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !339, file: !60, line: 72, baseType: !368, size: 64, offset: 1536)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !60, line: 59, baseType: !370)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !60, line: 57, size: 8192, elements: !371)
!371 = !{!372}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !370, file: !60, line: 58, baseType: !373, size: 8192)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 8192, elements: !374)
!374 = !{!375}
!375 = !DISubrange(count: 1024)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !260, file: !140, line: 223, baseType: !338, size: 1600, offset: 2752)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !260, file: !140, line: 223, baseType: !338, size: 1600, offset: 4352)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !260, file: !140, line: 223, baseType: !338, size: 1600, offset: 5952)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !260, file: !140, line: 233, baseType: !159, size: 16, offset: 7552)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !260, file: !140, line: 236, baseType: !149, size: 32, offset: 7584)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !260, file: !140, line: 238, baseType: !149, size: 32, offset: 7616)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !260, file: !140, line: 238, baseType: !149, size: 32, offset: 7648)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !260, file: !140, line: 239, baseType: !232, size: 128, offset: 7680)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !260, file: !140, line: 241, baseType: !207, size: 64, offset: 7808)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !260, file: !140, line: 243, baseType: !232, size: 128, offset: 7872)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !260, file: !140, line: 245, baseType: !118, size: 64, offset: 8000)
!387 = !{}
!388 = !DILocalVariable(name: "bm", arg: 1, scope: !215, file: !1, line: 476, type: !258)
!389 = !DILocation(line: 476, column: 29, scope: !215)
!390 = !DILocalVariable(name: "log", scope: !215, file: !1, line: 478, type: !218)
!391 = !DILocation(line: 478, column: 9, scope: !215)
!392 = !DILocation(line: 478, column: 15, scope: !215)
!393 = !DILocation(line: 480, column: 20, scope: !215)
!394 = !DILocation(line: 480, column: 2, scope: !215)
!395 = !DILocation(line: 480, column: 7, scope: !215)
!396 = !DILocation(line: 480, column: 18, scope: !215)
!397 = !DILocation(line: 481, column: 66, scope: !215)
!398 = !DILocation(line: 481, column: 70, scope: !215)
!399 = !DILocation(line: 481, column: 80, scope: !215)
!400 = !DILocation(line: 481, column: 84, scope: !215)
!401 = !DILocation(line: 481, column: 78, scope: !215)
!402 = !DILocation(line: 481, column: 20, scope: !215)
!403 = !DILocation(line: 481, column: 2, scope: !215)
!404 = !DILocation(line: 481, column: 7, scope: !215)
!405 = !DILocation(line: 481, column: 18, scope: !215)
!406 = !DILocation(line: 482, column: 66, scope: !215)
!407 = !DILocation(line: 482, column: 70, scope: !215)
!408 = !DILocation(line: 482, column: 80, scope: !215)
!409 = !DILocation(line: 482, column: 84, scope: !215)
!410 = !DILocation(line: 482, column: 78, scope: !215)
!411 = !DILocation(line: 482, column: 20, scope: !215)
!412 = !DILocation(line: 482, column: 2, scope: !215)
!413 = !DILocation(line: 482, column: 7, scope: !215)
!414 = !DILocation(line: 482, column: 18, scope: !215)
!415 = !DILocation(line: 485, column: 20, scope: !215)
!416 = !DILocation(line: 485, column: 24, scope: !215)
!417 = !DILocation(line: 485, column: 2, scope: !215)
!418 = !DILocation(line: 487, column: 9, scope: !215)
!419 = !DILocation(line: 487, column: 2, scope: !215)
!420 = distinct !DISubprogram(name: "bm_log_assign_ids", scope: !1, file: !1, line: 365, type: !421, scopeLine: 366, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !387)
!421 = !DISubroutineType(types: !422)
!422 = !{null, !258, !218}
!423 = !DILocalVariable(name: "bm", arg: 1, scope: !420, file: !1, line: 365, type: !258)
!424 = !DILocation(line: 365, column: 38, scope: !420)
!425 = !DILocalVariable(name: "log", arg: 2, scope: !420, file: !1, line: 365, type: !218)
!426 = !DILocation(line: 365, column: 49, scope: !420)
!427 = !DILocalVariable(name: "iter", scope: !420, file: !1, line: 367, type: !428)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter", file: !43, line: 186, baseType: !429)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter", file: !43, line: 164, size: 512, elements: !430)
!430 = !{!431, !508, !509, !510, !511}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !429, file: !43, line: 179, baseType: !432, size: 320)
!432 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !429, file: !43, line: 166, size: 320, elements: !433)
!433 = !{!434, !446, !452, !460, !468, !474, !480, !486, !490, !496, !502}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "elem_of_mesh", scope: !432, file: !43, line: 167, baseType: !435, size: 192)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__elem_of_mesh", file: !43, line: 113, size: 192, elements: !436)
!436 = !{!437}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "pooliter", scope: !435, file: !43, line: 114, baseType: !438, size: 192)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool_iter", file: !104, line: 80, baseType: !439)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_iter", file: !104, line: 76, size: 192, elements: !440)
!440 = !{!441, !442, !445}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !439, file: !104, line: 77, baseType: !253, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "curchunk", scope: !439, file: !104, line: 78, baseType: !443, size: 64, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_chunk", file: !104, line: 45, flags: DIFlagFwdDecl)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "curindex", scope: !439, file: !104, line: 79, baseType: !5, size: 32, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_vert", scope: !432, file: !43, line: 169, baseType: !447, size: 192)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_vert", file: !43, line: 116, size: 192, elements: !448)
!448 = !{!449, !450, !451}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !447, file: !43, line: 117, baseType: !138, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !447, file: !43, line: 118, baseType: !205, size: 64, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !447, file: !43, line: 118, baseType: !205, size: 64, offset: 128)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_vert", scope: !432, file: !43, line: 170, baseType: !453, size: 320)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_vert", file: !43, line: 120, size: 320, elements: !454)
!454 = !{!455, !456, !457, !458, !459}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !453, file: !43, line: 121, baseType: !138, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !453, file: !43, line: 122, baseType: !189, size: 64, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !453, file: !43, line: 122, baseType: !189, size: 64, offset: 128)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !453, file: !43, line: 123, baseType: !205, size: 64, offset: 192)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !453, file: !43, line: 123, baseType: !205, size: 64, offset: 256)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_vert", scope: !432, file: !43, line: 171, baseType: !461, size: 320)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_vert", file: !43, line: 125, size: 320, elements: !462)
!462 = !{!463, !464, !465, !466, !467}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !461, file: !43, line: 126, baseType: !138, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !461, file: !43, line: 127, baseType: !189, size: 64, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !461, file: !43, line: 127, baseType: !189, size: 64, offset: 128)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !461, file: !43, line: 128, baseType: !205, size: 64, offset: 192)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !461, file: !43, line: 128, baseType: !205, size: 64, offset: 256)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_edge", scope: !432, file: !43, line: 172, baseType: !469, size: 192)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_edge", file: !43, line: 130, size: 192, elements: !470)
!470 = !{!471, !472, !473}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !469, file: !43, line: 131, baseType: !205, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !469, file: !43, line: 132, baseType: !189, size: 64, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !469, file: !43, line: 132, baseType: !189, size: 64, offset: 128)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_loop", scope: !432, file: !43, line: 173, baseType: !475, size: 192)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_loop", file: !43, line: 134, size: 192, elements: !476)
!476 = !{!477, !478, !479}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !475, file: !43, line: 135, baseType: !189, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !475, file: !43, line: 136, baseType: !189, size: 64, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !475, file: !43, line: 136, baseType: !189, size: 64, offset: 128)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_edge", scope: !432, file: !43, line: 174, baseType: !481, size: 192)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_edge", file: !43, line: 138, size: 192, elements: !482)
!482 = !{!483, !484, !485}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !481, file: !43, line: 139, baseType: !205, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !481, file: !43, line: 140, baseType: !189, size: 64, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !481, file: !43, line: 140, baseType: !189, size: 64, offset: 128)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_edge", scope: !432, file: !43, line: 175, baseType: !487, size: 64)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_edge", file: !43, line: 142, size: 64, elements: !488)
!488 = !{!489}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !487, file: !43, line: 143, baseType: !205, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_face", scope: !432, file: !43, line: 176, baseType: !491, size: 192)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_face", file: !43, line: 145, size: 192, elements: !492)
!492 = !{!493, !494, !495}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !491, file: !43, line: 146, baseType: !207, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !491, file: !43, line: 147, baseType: !189, size: 64, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !491, file: !43, line: 147, baseType: !189, size: 64, offset: 128)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_face", scope: !432, file: !43, line: 177, baseType: !497, size: 192)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_face", file: !43, line: 149, size: 192, elements: !498)
!498 = !{!499, !500, !501}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !497, file: !43, line: 150, baseType: !207, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !497, file: !43, line: 151, baseType: !189, size: 64, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !497, file: !43, line: 151, baseType: !189, size: 64, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_face", scope: !432, file: !43, line: 178, baseType: !503, size: 192)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_face", file: !43, line: 153, size: 192, elements: !504)
!504 = !{!505, !506, !507}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !503, file: !43, line: 154, baseType: !207, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !503, file: !43, line: 155, baseType: !189, size: 64, offset: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !503, file: !43, line: 155, baseType: !189, size: 64, offset: 128)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !429, file: !43, line: 181, baseType: !130, size: 64, offset: 320)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !429, file: !43, line: 182, baseType: !134, size: 64, offset: 384)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !429, file: !43, line: 184, baseType: !149, size: 32, offset: 448)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !429, file: !43, line: 185, baseType: !151, size: 8, offset: 480)
!512 = !DILocation(line: 367, column: 9, scope: !420)
!513 = !DILocalVariable(name: "v", scope: !420, file: !1, line: 368, type: !138)
!514 = !DILocation(line: 368, column: 10, scope: !420)
!515 = !DILocalVariable(name: "f", scope: !420, file: !1, line: 369, type: !207)
!516 = !DILocation(line: 369, column: 10, scope: !420)
!517 = !DILocation(line: 372, column: 2, scope: !518)
!518 = distinct !DILexicalBlock(scope: !420, file: !1, line: 372, column: 2)
!519 = !DILocation(line: 372, column: 2, scope: !520)
!520 = distinct !DILexicalBlock(scope: !518, file: !1, line: 372, column: 2)
!521 = !DILocalVariable(name: "id", scope: !522, file: !1, line: 373, type: !5)
!522 = distinct !DILexicalBlock(scope: !520, file: !1, line: 372, column: 48)
!523 = !DILocation(line: 373, column: 16, scope: !522)
!524 = !DILocation(line: 373, column: 46, scope: !522)
!525 = !DILocation(line: 373, column: 51, scope: !522)
!526 = !DILocation(line: 373, column: 21, scope: !522)
!527 = !DILocation(line: 374, column: 22, scope: !522)
!528 = !DILocation(line: 374, column: 27, scope: !522)
!529 = !DILocation(line: 374, column: 30, scope: !522)
!530 = !DILocation(line: 374, column: 3, scope: !522)
!531 = !DILocation(line: 375, column: 2, scope: !522)
!532 = distinct !{!532, !517, !533}
!533 = !DILocation(line: 375, column: 2, scope: !518)
!534 = !DILocation(line: 378, column: 2, scope: !535)
!535 = distinct !DILexicalBlock(scope: !420, file: !1, line: 378, column: 2)
!536 = !DILocation(line: 378, column: 2, scope: !537)
!537 = distinct !DILexicalBlock(scope: !535, file: !1, line: 378, column: 2)
!538 = !DILocalVariable(name: "id", scope: !539, file: !1, line: 379, type: !5)
!539 = distinct !DILexicalBlock(scope: !537, file: !1, line: 378, column: 48)
!540 = !DILocation(line: 379, column: 16, scope: !539)
!541 = !DILocation(line: 379, column: 46, scope: !539)
!542 = !DILocation(line: 379, column: 51, scope: !539)
!543 = !DILocation(line: 379, column: 21, scope: !539)
!544 = !DILocation(line: 380, column: 22, scope: !539)
!545 = !DILocation(line: 380, column: 27, scope: !539)
!546 = !DILocation(line: 380, column: 30, scope: !539)
!547 = !DILocation(line: 380, column: 3, scope: !539)
!548 = !DILocation(line: 381, column: 2, scope: !539)
!549 = distinct !{!549, !534, !550}
!550 = !DILocation(line: 381, column: 2, scope: !535)
!551 = !DILocation(line: 382, column: 1, scope: !420)
!552 = distinct !DISubprogram(name: "BM_log_cleanup_entry", scope: !1, file: !1, line: 490, type: !553, scopeLine: 491, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !387)
!553 = !DISubroutineType(types: !554)
!554 = !{null, !239}
!555 = !DILocalVariable(name: "entry", arg: 1, scope: !552, file: !1, line: 490, type: !239)
!556 = !DILocation(line: 490, column: 39, scope: !552)
!557 = !DILocalVariable(name: "log", scope: !552, file: !1, line: 492, type: !218)
!558 = !DILocation(line: 492, column: 9, scope: !552)
!559 = !DILocation(line: 492, column: 15, scope: !552)
!560 = !DILocation(line: 492, column: 22, scope: !552)
!561 = !DILocation(line: 494, column: 6, scope: !562)
!562 = distinct !DILexicalBlock(scope: !552, file: !1, line: 494, column: 6)
!563 = !DILocation(line: 494, column: 6, scope: !552)
!564 = !DILocation(line: 496, column: 26, scope: !565)
!565 = distinct !DILexicalBlock(scope: !562, file: !1, line: 494, column: 11)
!566 = !DILocation(line: 496, column: 31, scope: !565)
!567 = !DILocation(line: 496, column: 43, scope: !565)
!568 = !DILocation(line: 496, column: 50, scope: !565)
!569 = !DILocation(line: 496, column: 3, scope: !565)
!570 = !DILocation(line: 497, column: 26, scope: !565)
!571 = !DILocation(line: 497, column: 31, scope: !565)
!572 = !DILocation(line: 497, column: 43, scope: !565)
!573 = !DILocation(line: 497, column: 50, scope: !565)
!574 = !DILocation(line: 497, column: 3, scope: !565)
!575 = !DILocation(line: 498, column: 26, scope: !565)
!576 = !DILocation(line: 498, column: 31, scope: !565)
!577 = !DILocation(line: 498, column: 43, scope: !565)
!578 = !DILocation(line: 498, column: 50, scope: !565)
!579 = !DILocation(line: 498, column: 3, scope: !565)
!580 = !DILocation(line: 499, column: 26, scope: !565)
!581 = !DILocation(line: 499, column: 31, scope: !565)
!582 = !DILocation(line: 499, column: 43, scope: !565)
!583 = !DILocation(line: 499, column: 50, scope: !565)
!584 = !DILocation(line: 499, column: 3, scope: !565)
!585 = !DILocation(line: 500, column: 26, scope: !565)
!586 = !DILocation(line: 500, column: 31, scope: !565)
!587 = !DILocation(line: 500, column: 43, scope: !565)
!588 = !DILocation(line: 500, column: 50, scope: !565)
!589 = !DILocation(line: 500, column: 3, scope: !565)
!590 = !DILocation(line: 501, column: 26, scope: !565)
!591 = !DILocation(line: 501, column: 31, scope: !565)
!592 = !DILocation(line: 501, column: 43, scope: !565)
!593 = !DILocation(line: 501, column: 50, scope: !565)
!594 = !DILocation(line: 501, column: 3, scope: !565)
!595 = !DILocation(line: 504, column: 19, scope: !565)
!596 = !DILocation(line: 504, column: 26, scope: !565)
!597 = !DILocation(line: 504, column: 3, scope: !565)
!598 = !DILocation(line: 505, column: 19, scope: !565)
!599 = !DILocation(line: 505, column: 26, scope: !565)
!600 = !DILocation(line: 505, column: 3, scope: !565)
!601 = !DILocation(line: 506, column: 19, scope: !565)
!602 = !DILocation(line: 506, column: 26, scope: !565)
!603 = !DILocation(line: 506, column: 3, scope: !565)
!604 = !DILocation(line: 507, column: 19, scope: !565)
!605 = !DILocation(line: 507, column: 26, scope: !565)
!606 = !DILocation(line: 507, column: 3, scope: !565)
!607 = !DILocation(line: 508, column: 19, scope: !565)
!608 = !DILocation(line: 508, column: 26, scope: !565)
!609 = !DILocation(line: 508, column: 3, scope: !565)
!610 = !DILocation(line: 509, column: 2, scope: !565)
!611 = !DILocation(line: 510, column: 1, scope: !552)
!612 = distinct !DISubprogram(name: "bm_log_id_ghash_retake", scope: !1, file: !1, line: 418, type: !613, scopeLine: 419, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !387)
!613 = !DISubroutineType(types: !614)
!614 = !{null, !615, !227}
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "RangeTreeUInt", file: !617, line: 27, baseType: !225)
!617 = !DIFile(filename: "blender/extern/rangetree/range_tree_c_api.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!618 = !DILocalVariable(name: "unused_ids", arg: 1, scope: !612, file: !1, line: 418, type: !615)
!619 = !DILocation(line: 418, column: 51, scope: !612)
!620 = !DILocalVariable(name: "id_ghash", arg: 2, scope: !612, file: !1, line: 418, type: !227)
!621 = !DILocation(line: 418, column: 70, scope: !612)
!622 = !DILocalVariable(name: "gh_iter", scope: !612, file: !1, line: 420, type: !623)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashIterator", file: !124, line: 54, baseType: !624)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GHashIterator", file: !124, line: 50, size: 192, elements: !625)
!625 = !{!626, !627, !630}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "gh", scope: !624, file: !124, line: 51, baseType: !227, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "curEntry", scope: !624, file: !124, line: 52, baseType: !628, size: 64, offset: 64)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry", file: !124, line: 52, flags: DIFlagFwdDecl)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "curBucket", scope: !624, file: !124, line: 53, baseType: !5, size: 32, offset: 128)
!631 = !DILocation(line: 420, column: 16, scope: !612)
!632 = !DILocation(line: 422, column: 2, scope: !633)
!633 = distinct !DILexicalBlock(scope: !612, file: !1, line: 422, column: 2)
!634 = !DILocation(line: 422, column: 2, scope: !635)
!635 = distinct !DILexicalBlock(scope: !633, file: !1, line: 422, column: 2)
!636 = !DILocalVariable(name: "key", scope: !637, file: !1, line: 423, type: !118)
!637 = distinct !DILexicalBlock(scope: !635, file: !1, line: 422, column: 33)
!638 = !DILocation(line: 423, column: 9, scope: !637)
!639 = !DILocation(line: 423, column: 15, scope: !637)
!640 = !DILocalVariable(name: "id", scope: !637, file: !1, line: 424, type: !5)
!641 = !DILocation(line: 424, column: 16, scope: !637)
!642 = !DILocation(line: 424, column: 21, scope: !637)
!643 = !DILocation(line: 426, column: 26, scope: !637)
!644 = !DILocation(line: 426, column: 38, scope: !637)
!645 = !DILocation(line: 426, column: 3, scope: !637)
!646 = !DILocation(line: 427, column: 2, scope: !637)
!647 = distinct !{!647, !632, !648}
!648 = !DILocation(line: 427, column: 2, scope: !633)
!649 = !DILocation(line: 428, column: 1, scope: !612)
!650 = distinct !DISubprogram(name: "BM_log_from_existing_entries_create", scope: !1, file: !1, line: 521, type: !651, scopeLine: 522, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !387)
!651 = !DISubroutineType(types: !652)
!652 = !{!218, !258, !239}
!653 = !DILocalVariable(name: "bm", arg: 1, scope: !650, file: !1, line: 521, type: !258)
!654 = !DILocation(line: 521, column: 51, scope: !650)
!655 = !DILocalVariable(name: "entry", arg: 2, scope: !650, file: !1, line: 521, type: !239)
!656 = !DILocation(line: 521, column: 67, scope: !650)
!657 = !DILocalVariable(name: "log", scope: !650, file: !1, line: 523, type: !218)
!658 = !DILocation(line: 523, column: 9, scope: !650)
!659 = !DILocation(line: 523, column: 29, scope: !650)
!660 = !DILocation(line: 523, column: 15, scope: !650)
!661 = !DILocation(line: 525, column: 6, scope: !662)
!662 = distinct !DILexicalBlock(scope: !650, file: !1, line: 525, column: 6)
!663 = !DILocation(line: 525, column: 13, scope: !662)
!664 = !DILocation(line: 525, column: 6, scope: !650)
!665 = !DILocation(line: 526, column: 24, scope: !662)
!666 = !DILocation(line: 526, column: 3, scope: !662)
!667 = !DILocation(line: 526, column: 8, scope: !662)
!668 = !DILocation(line: 526, column: 22, scope: !662)
!669 = !DILocation(line: 528, column: 3, scope: !662)
!670 = !DILocation(line: 528, column: 8, scope: !662)
!671 = !DILocation(line: 528, column: 22, scope: !662)
!672 = !DILocation(line: 531, column: 43, scope: !650)
!673 = !DILocation(line: 531, column: 23, scope: !650)
!674 = !DILocation(line: 531, column: 28, scope: !650)
!675 = !DILocation(line: 531, column: 36, scope: !650)
!676 = !DILocation(line: 531, column: 41, scope: !650)
!677 = !DILocation(line: 531, column: 2, scope: !650)
!678 = !DILocation(line: 531, column: 7, scope: !650)
!679 = !DILocation(line: 531, column: 15, scope: !650)
!680 = !DILocation(line: 531, column: 21, scope: !650)
!681 = !DILocation(line: 534, column: 3, scope: !682)
!682 = distinct !DILexicalBlock(scope: !650, file: !1, line: 533, column: 2)
!683 = !DILocation(line: 534, column: 10, scope: !682)
!684 = !DILocation(line: 534, column: 17, scope: !682)
!685 = !DILocation(line: 535, column: 12, scope: !686)
!686 = distinct !DILexicalBlock(scope: !682, file: !1, line: 534, column: 23)
!687 = !DILocation(line: 535, column: 19, scope: !686)
!688 = !DILocation(line: 535, column: 10, scope: !686)
!689 = !DILocation(line: 536, column: 25, scope: !686)
!690 = !DILocation(line: 536, column: 4, scope: !686)
!691 = !DILocation(line: 536, column: 9, scope: !686)
!692 = !DILocation(line: 536, column: 17, scope: !686)
!693 = !DILocation(line: 536, column: 23, scope: !686)
!694 = distinct !{!694, !681, !695}
!695 = !DILocation(line: 537, column: 3, scope: !682)
!696 = !DILocation(line: 538, column: 11, scope: !682)
!697 = !DILocation(line: 538, column: 16, scope: !682)
!698 = !DILocation(line: 538, column: 24, scope: !682)
!699 = !DILocation(line: 538, column: 9, scope: !682)
!700 = !DILocation(line: 539, column: 3, scope: !682)
!701 = !DILocation(line: 539, column: 10, scope: !682)
!702 = !DILocation(line: 539, column: 17, scope: !682)
!703 = !DILocation(line: 540, column: 12, scope: !704)
!704 = distinct !DILexicalBlock(scope: !682, file: !1, line: 539, column: 23)
!705 = !DILocation(line: 540, column: 19, scope: !704)
!706 = !DILocation(line: 540, column: 10, scope: !704)
!707 = !DILocation(line: 541, column: 24, scope: !704)
!708 = !DILocation(line: 541, column: 4, scope: !704)
!709 = !DILocation(line: 541, column: 9, scope: !704)
!710 = !DILocation(line: 541, column: 17, scope: !704)
!711 = !DILocation(line: 541, column: 22, scope: !704)
!712 = distinct !{!712, !700, !713}
!713 = !DILocation(line: 542, column: 3, scope: !682)
!714 = !DILocation(line: 545, column: 15, scope: !715)
!715 = distinct !DILexicalBlock(scope: !650, file: !1, line: 545, column: 2)
!716 = !DILocation(line: 545, column: 20, scope: !715)
!717 = !DILocation(line: 545, column: 28, scope: !715)
!718 = !DILocation(line: 545, column: 13, scope: !715)
!719 = !DILocation(line: 545, column: 7, scope: !715)
!720 = !DILocation(line: 545, column: 35, scope: !721)
!721 = distinct !DILexicalBlock(scope: !715, file: !1, line: 545, column: 2)
!722 = !DILocation(line: 545, column: 2, scope: !715)
!723 = !DILocation(line: 546, column: 16, scope: !724)
!724 = distinct !DILexicalBlock(scope: !721, file: !1, line: 545, column: 63)
!725 = !DILocation(line: 546, column: 3, scope: !724)
!726 = !DILocation(line: 546, column: 10, scope: !724)
!727 = !DILocation(line: 546, column: 14, scope: !724)
!728 = !DILocation(line: 549, column: 26, scope: !724)
!729 = !DILocation(line: 549, column: 31, scope: !724)
!730 = !DILocation(line: 549, column: 43, scope: !724)
!731 = !DILocation(line: 549, column: 50, scope: !724)
!732 = !DILocation(line: 549, column: 3, scope: !724)
!733 = !DILocation(line: 550, column: 26, scope: !724)
!734 = !DILocation(line: 550, column: 31, scope: !724)
!735 = !DILocation(line: 550, column: 43, scope: !724)
!736 = !DILocation(line: 550, column: 50, scope: !724)
!737 = !DILocation(line: 550, column: 3, scope: !724)
!738 = !DILocation(line: 551, column: 26, scope: !724)
!739 = !DILocation(line: 551, column: 31, scope: !724)
!740 = !DILocation(line: 551, column: 43, scope: !724)
!741 = !DILocation(line: 551, column: 50, scope: !724)
!742 = !DILocation(line: 551, column: 3, scope: !724)
!743 = !DILocation(line: 552, column: 26, scope: !724)
!744 = !DILocation(line: 552, column: 31, scope: !724)
!745 = !DILocation(line: 552, column: 43, scope: !724)
!746 = !DILocation(line: 552, column: 50, scope: !724)
!747 = !DILocation(line: 552, column: 3, scope: !724)
!748 = !DILocation(line: 553, column: 26, scope: !724)
!749 = !DILocation(line: 553, column: 31, scope: !724)
!750 = !DILocation(line: 553, column: 43, scope: !724)
!751 = !DILocation(line: 553, column: 50, scope: !724)
!752 = !DILocation(line: 553, column: 3, scope: !724)
!753 = !DILocation(line: 554, column: 26, scope: !724)
!754 = !DILocation(line: 554, column: 31, scope: !724)
!755 = !DILocation(line: 554, column: 43, scope: !724)
!756 = !DILocation(line: 554, column: 50, scope: !724)
!757 = !DILocation(line: 554, column: 3, scope: !724)
!758 = !DILocation(line: 555, column: 2, scope: !724)
!759 = !DILocation(line: 545, column: 50, scope: !721)
!760 = !DILocation(line: 545, column: 57, scope: !721)
!761 = !DILocation(line: 545, column: 48, scope: !721)
!762 = !DILocation(line: 545, column: 2, scope: !721)
!763 = distinct !{!763, !722, !764}
!764 = !DILocation(line: 555, column: 2, scope: !715)
!765 = !DILocation(line: 557, column: 9, scope: !650)
!766 = !DILocation(line: 557, column: 2, scope: !650)
!767 = distinct !DISubprogram(name: "BM_log_free", scope: !1, file: !1, line: 561, type: !768, scopeLine: 562, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !387)
!768 = !DISubroutineType(types: !769)
!769 = !{null, !218}
!770 = !DILocalVariable(name: "log", arg: 1, scope: !767, file: !1, line: 561, type: !218)
!771 = !DILocation(line: 561, column: 25, scope: !767)
!772 = !DILocalVariable(name: "entry", scope: !767, file: !1, line: 563, type: !239)
!773 = !DILocation(line: 563, column: 14, scope: !767)
!774 = !DILocation(line: 565, column: 6, scope: !775)
!775 = distinct !DILexicalBlock(scope: !767, file: !1, line: 565, column: 6)
!776 = !DILocation(line: 565, column: 11, scope: !775)
!777 = !DILocation(line: 565, column: 6, scope: !767)
!778 = !DILocation(line: 566, column: 24, scope: !775)
!779 = !DILocation(line: 566, column: 29, scope: !775)
!780 = !DILocation(line: 566, column: 3, scope: !775)
!781 = !DILocation(line: 568, column: 6, scope: !782)
!782 = distinct !DILexicalBlock(scope: !767, file: !1, line: 568, column: 6)
!783 = !DILocation(line: 568, column: 11, scope: !782)
!784 = !DILocation(line: 568, column: 6, scope: !767)
!785 = !DILocation(line: 569, column: 18, scope: !782)
!786 = !DILocation(line: 569, column: 23, scope: !782)
!787 = !DILocation(line: 569, column: 3, scope: !782)
!788 = !DILocation(line: 571, column: 6, scope: !789)
!789 = distinct !DILexicalBlock(scope: !767, file: !1, line: 571, column: 6)
!790 = !DILocation(line: 571, column: 11, scope: !789)
!791 = !DILocation(line: 571, column: 6, scope: !767)
!792 = !DILocation(line: 572, column: 18, scope: !789)
!793 = !DILocation(line: 572, column: 23, scope: !789)
!794 = !DILocation(line: 572, column: 3, scope: !789)
!795 = !DILocation(line: 576, column: 15, scope: !796)
!796 = distinct !DILexicalBlock(scope: !767, file: !1, line: 576, column: 2)
!797 = !DILocation(line: 576, column: 20, scope: !796)
!798 = !DILocation(line: 576, column: 28, scope: !796)
!799 = !DILocation(line: 576, column: 13, scope: !796)
!800 = !DILocation(line: 576, column: 7, scope: !796)
!801 = !DILocation(line: 576, column: 35, scope: !802)
!802 = distinct !DILexicalBlock(scope: !796, file: !1, line: 576, column: 2)
!803 = !DILocation(line: 576, column: 2, scope: !796)
!804 = !DILocation(line: 577, column: 3, scope: !802)
!805 = !DILocation(line: 577, column: 10, scope: !802)
!806 = !DILocation(line: 577, column: 14, scope: !802)
!807 = !DILocation(line: 576, column: 50, scope: !802)
!808 = !DILocation(line: 576, column: 57, scope: !802)
!809 = !DILocation(line: 576, column: 48, scope: !802)
!810 = !DILocation(line: 576, column: 2, scope: !802)
!811 = distinct !{!811, !803, !812}
!812 = !DILocation(line: 577, column: 16, scope: !796)
!813 = !DILocation(line: 579, column: 2, scope: !767)
!814 = !DILocation(line: 579, column: 12, scope: !767)
!815 = !DILocation(line: 580, column: 1, scope: !767)
!816 = distinct !DISubprogram(name: "BM_log_length", scope: !1, file: !1, line: 583, type: !817, scopeLine: 584, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !387)
!817 = !DISubroutineType(types: !818)
!818 = !{!149, !819}
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !219)
!821 = !DILocalVariable(name: "log", arg: 1, scope: !816, file: !1, line: 583, type: !819)
!822 = !DILocation(line: 583, column: 32, scope: !816)
!823 = !DILocation(line: 585, column: 24, scope: !816)
!824 = !DILocation(line: 585, column: 29, scope: !816)
!825 = !DILocation(line: 585, column: 9, scope: !816)
!826 = !DILocation(line: 585, column: 2, scope: !816)
!827 = distinct !DISubprogram(name: "BM_log_mesh_elems_reorder", scope: !1, file: !1, line: 589, type: !421, scopeLine: 590, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !387)
!828 = !DILocalVariable(name: "bm", arg: 1, scope: !827, file: !1, line: 589, type: !258)
!829 = !DILocation(line: 589, column: 39, scope: !827)
!830 = !DILocalVariable(name: "log", arg: 2, scope: !827, file: !1, line: 589, type: !218)
!831 = !DILocation(line: 589, column: 50, scope: !827)
!832 = !DILocalVariable(name: "varr", scope: !827, file: !1, line: 591, type: !118)
!833 = !DILocation(line: 591, column: 8, scope: !827)
!834 = !DILocalVariable(name: "farr", scope: !827, file: !1, line: 592, type: !118)
!835 = !DILocation(line: 592, column: 8, scope: !827)
!836 = !DILocalVariable(name: "id_to_idx", scope: !827, file: !1, line: 594, type: !227)
!837 = !DILocation(line: 594, column: 9, scope: !827)
!838 = !DILocalVariable(name: "bm_iter", scope: !827, file: !1, line: 596, type: !428)
!839 = !DILocation(line: 596, column: 9, scope: !827)
!840 = !DILocalVariable(name: "v", scope: !827, file: !1, line: 597, type: !138)
!841 = !DILocation(line: 597, column: 10, scope: !827)
!842 = !DILocalVariable(name: "f", scope: !827, file: !1, line: 598, type: !207)
!843 = !DILocation(line: 598, column: 10, scope: !827)
!844 = !DILocalVariable(name: "i", scope: !827, file: !1, line: 600, type: !149)
!845 = !DILocation(line: 600, column: 6, scope: !827)
!846 = !DILocation(line: 603, column: 4, scope: !827)
!847 = !DILocation(line: 604, column: 9, scope: !827)
!848 = !DILocation(line: 604, column: 43, scope: !827)
!849 = !DILocation(line: 604, column: 47, scope: !827)
!850 = !DILocation(line: 604, column: 35, scope: !827)
!851 = !DILocation(line: 604, column: 33, scope: !827)
!852 = !DILocation(line: 604, column: 7, scope: !827)
!853 = !DILocation(line: 605, column: 2, scope: !854)
!854 = distinct !DILexicalBlock(scope: !827, file: !1, line: 605, column: 2)
!855 = !DILocation(line: 605, column: 2, scope: !856)
!856 = distinct !DILexicalBlock(scope: !854, file: !1, line: 605, column: 2)
!857 = !DILocation(line: 606, column: 52, scope: !858)
!858 = distinct !DILexicalBlock(scope: !856, file: !1, line: 605, column: 51)
!859 = !DILocation(line: 606, column: 57, scope: !858)
!860 = !DILocation(line: 606, column: 33, scope: !858)
!861 = !DILocation(line: 606, column: 20, scope: !858)
!862 = !DILocation(line: 606, column: 4, scope: !858)
!863 = !DILocation(line: 606, column: 27, scope: !858)
!864 = !DILocation(line: 606, column: 3, scope: !858)
!865 = !DILocation(line: 606, column: 31, scope: !858)
!866 = !DILocation(line: 607, column: 2, scope: !858)
!867 = distinct !{!867, !853, !868}
!868 = !DILocation(line: 607, column: 2, scope: !854)
!869 = !DILocation(line: 610, column: 4, scope: !827)
!870 = !DILocation(line: 611, column: 9, scope: !827)
!871 = !DILocation(line: 611, column: 43, scope: !827)
!872 = !DILocation(line: 611, column: 47, scope: !827)
!873 = !DILocation(line: 611, column: 35, scope: !827)
!874 = !DILocation(line: 611, column: 33, scope: !827)
!875 = !DILocation(line: 611, column: 7, scope: !827)
!876 = !DILocation(line: 612, column: 2, scope: !877)
!877 = distinct !DILexicalBlock(scope: !827, file: !1, line: 612, column: 2)
!878 = !DILocation(line: 612, column: 2, scope: !879)
!879 = distinct !DILexicalBlock(scope: !877, file: !1, line: 612, column: 2)
!880 = !DILocation(line: 613, column: 52, scope: !881)
!881 = distinct !DILexicalBlock(scope: !879, file: !1, line: 612, column: 51)
!882 = !DILocation(line: 613, column: 57, scope: !881)
!883 = !DILocation(line: 613, column: 33, scope: !881)
!884 = !DILocation(line: 613, column: 20, scope: !881)
!885 = !DILocation(line: 613, column: 4, scope: !881)
!886 = !DILocation(line: 613, column: 27, scope: !881)
!887 = !DILocation(line: 613, column: 3, scope: !881)
!888 = !DILocation(line: 613, column: 31, scope: !881)
!889 = !DILocation(line: 614, column: 2, scope: !881)
!890 = distinct !{!890, !876, !891}
!891 = !DILocation(line: 614, column: 2, scope: !877)
!892 = !DILocation(line: 617, column: 45, scope: !827)
!893 = !DILocation(line: 617, column: 65, scope: !827)
!894 = !DILocation(line: 617, column: 69, scope: !827)
!895 = !DILocation(line: 617, column: 14, scope: !827)
!896 = !DILocation(line: 617, column: 12, scope: !827)
!897 = !DILocation(line: 618, column: 4, scope: !827)
!898 = !DILocation(line: 619, column: 2, scope: !899)
!899 = distinct !DILexicalBlock(scope: !827, file: !1, line: 619, column: 2)
!900 = !DILocation(line: 619, column: 2, scope: !901)
!901 = distinct !DILexicalBlock(scope: !899, file: !1, line: 619, column: 2)
!902 = !DILocalVariable(name: "id", scope: !903, file: !1, line: 620, type: !904)
!903 = distinct !DILexicalBlock(scope: !901, file: !1, line: 619, column: 51)
!904 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!905 = !DILocation(line: 620, column: 18, scope: !903)
!906 = !DILocation(line: 620, column: 42, scope: !903)
!907 = !DILocation(line: 620, column: 47, scope: !903)
!908 = !DILocation(line: 620, column: 23, scope: !903)
!909 = !DILocalVariable(name: "key", scope: !903, file: !1, line: 621, type: !910)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!912 = !DILocation(line: 621, column: 15, scope: !903)
!913 = !DILocation(line: 621, column: 21, scope: !903)
!914 = !DILocalVariable(name: "val", scope: !903, file: !1, line: 622, type: !910)
!915 = !DILocation(line: 622, column: 15, scope: !903)
!916 = !DILocation(line: 622, column: 38, scope: !903)
!917 = !DILocation(line: 622, column: 49, scope: !903)
!918 = !DILocation(line: 622, column: 21, scope: !903)
!919 = !DILocation(line: 623, column: 33, scope: !903)
!920 = !DILocation(line: 623, column: 20, scope: !903)
!921 = !DILocation(line: 623, column: 4, scope: !903)
!922 = !DILocation(line: 623, column: 27, scope: !903)
!923 = !DILocation(line: 623, column: 3, scope: !903)
!924 = !DILocation(line: 623, column: 31, scope: !903)
!925 = !DILocation(line: 624, column: 2, scope: !903)
!926 = distinct !{!926, !898, !927}
!927 = !DILocation(line: 624, column: 2, scope: !899)
!928 = !DILocation(line: 625, column: 17, scope: !827)
!929 = !DILocation(line: 625, column: 2, scope: !827)
!930 = !DILocation(line: 628, column: 45, scope: !827)
!931 = !DILocation(line: 628, column: 65, scope: !827)
!932 = !DILocation(line: 628, column: 69, scope: !827)
!933 = !DILocation(line: 628, column: 14, scope: !827)
!934 = !DILocation(line: 628, column: 12, scope: !827)
!935 = !DILocation(line: 629, column: 4, scope: !827)
!936 = !DILocation(line: 630, column: 2, scope: !937)
!937 = distinct !DILexicalBlock(scope: !827, file: !1, line: 630, column: 2)
!938 = !DILocation(line: 630, column: 2, scope: !939)
!939 = distinct !DILexicalBlock(scope: !937, file: !1, line: 630, column: 2)
!940 = !DILocalVariable(name: "id", scope: !941, file: !1, line: 631, type: !904)
!941 = distinct !DILexicalBlock(scope: !939, file: !1, line: 630, column: 51)
!942 = !DILocation(line: 631, column: 18, scope: !941)
!943 = !DILocation(line: 631, column: 42, scope: !941)
!944 = !DILocation(line: 631, column: 47, scope: !941)
!945 = !DILocation(line: 631, column: 23, scope: !941)
!946 = !DILocalVariable(name: "key", scope: !941, file: !1, line: 632, type: !910)
!947 = !DILocation(line: 632, column: 15, scope: !941)
!948 = !DILocation(line: 632, column: 21, scope: !941)
!949 = !DILocalVariable(name: "val", scope: !941, file: !1, line: 633, type: !910)
!950 = !DILocation(line: 633, column: 15, scope: !941)
!951 = !DILocation(line: 633, column: 38, scope: !941)
!952 = !DILocation(line: 633, column: 49, scope: !941)
!953 = !DILocation(line: 633, column: 21, scope: !941)
!954 = !DILocation(line: 634, column: 33, scope: !941)
!955 = !DILocation(line: 634, column: 20, scope: !941)
!956 = !DILocation(line: 634, column: 4, scope: !941)
!957 = !DILocation(line: 634, column: 27, scope: !941)
!958 = !DILocation(line: 634, column: 3, scope: !941)
!959 = !DILocation(line: 634, column: 31, scope: !941)
!960 = !DILocation(line: 635, column: 2, scope: !941)
!961 = distinct !{!961, !936, !962}
!962 = !DILocation(line: 635, column: 2, scope: !937)
!963 = !DILocation(line: 636, column: 17, scope: !827)
!964 = !DILocation(line: 636, column: 2, scope: !827)
!965 = !DILocation(line: 638, column: 16, scope: !827)
!966 = !DILocation(line: 638, column: 20, scope: !827)
!967 = !DILocation(line: 638, column: 32, scope: !827)
!968 = !DILocation(line: 638, column: 2, scope: !827)
!969 = !DILocation(line: 640, column: 2, scope: !827)
!970 = !DILocation(line: 640, column: 12, scope: !827)
!971 = !DILocation(line: 641, column: 2, scope: !827)
!972 = !DILocation(line: 641, column: 12, scope: !827)
!973 = !DILocation(line: 642, column: 1, scope: !827)
!974 = distinct !DISubprogram(name: "BM_iter_new", scope: !975, file: !975, line: 172, type: !976, scopeLine: 173, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !387)
!975 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators_inline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!976 = !DISubroutineType(types: !977)
!977 = !{!118, !978, !258, !299, !118}
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!979 = !DILocalVariable(name: "iter", arg: 1, scope: !974, file: !975, line: 172, type: !978)
!980 = !DILocation(line: 172, column: 38, scope: !974)
!981 = !DILocalVariable(name: "bm", arg: 2, scope: !974, file: !975, line: 172, type: !258)
!982 = !DILocation(line: 172, column: 51, scope: !974)
!983 = !DILocalVariable(name: "itype", arg: 3, scope: !974, file: !975, line: 172, type: !299)
!984 = !DILocation(line: 172, column: 66, scope: !974)
!985 = !DILocalVariable(name: "data", arg: 4, scope: !974, file: !975, line: 172, type: !118)
!986 = !DILocation(line: 172, column: 79, scope: !974)
!987 = !DILocation(line: 174, column: 6, scope: !988)
!988 = distinct !DILexicalBlock(scope: !974, file: !975, line: 174, column: 6)
!989 = !DILocation(line: 174, column: 6, scope: !974)
!990 = !DILocation(line: 175, column: 23, scope: !991)
!991 = distinct !DILexicalBlock(scope: !988, file: !975, line: 174, column: 51)
!992 = !DILocation(line: 175, column: 10, scope: !991)
!993 = !DILocation(line: 175, column: 3, scope: !991)
!994 = !DILocation(line: 178, column: 3, scope: !995)
!995 = distinct !DILexicalBlock(scope: !988, file: !975, line: 177, column: 7)
!996 = !DILocation(line: 180, column: 1, scope: !974)
!997 = distinct !DISubprogram(name: "bm_log_vert_id_get", scope: !1, file: !1, line: 130, type: !998, scopeLine: 131, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !387)
!998 = !DISubroutineType(types: !999)
!999 = !{!5, !218, !138}
!1000 = !DILocalVariable(name: "log", arg: 1, scope: !997, file: !1, line: 130, type: !218)
!1001 = !DILocation(line: 130, column: 47, scope: !997)
!1002 = !DILocalVariable(name: "v", arg: 2, scope: !997, file: !1, line: 130, type: !138)
!1003 = !DILocation(line: 130, column: 60, scope: !997)
!1004 = !DILocation(line: 133, column: 9, scope: !997)
!1005 = !DILocation(line: 133, column: 2, scope: !997)
!1006 = distinct !DISubprogram(name: "BM_iter_step", scope: !975, file: !975, line: 40, type: !1007, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !387)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{!118, !978}
!1009 = !DILocalVariable(name: "iter", arg: 1, scope: !1006, file: !975, line: 40, type: !978)
!1010 = !DILocation(line: 40, column: 39, scope: !1006)
!1011 = !DILocation(line: 42, column: 9, scope: !1006)
!1012 = !DILocation(line: 42, column: 15, scope: !1006)
!1013 = !DILocation(line: 42, column: 20, scope: !1006)
!1014 = !DILocation(line: 42, column: 2, scope: !1006)
!1015 = distinct !DISubprogram(name: "bm_log_face_id_get", scope: !1, file: !1, line: 154, type: !1016, scopeLine: 155, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !387)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!5, !218, !207}
!1018 = !DILocalVariable(name: "log", arg: 1, scope: !1015, file: !1, line: 154, type: !218)
!1019 = !DILocation(line: 154, column: 47, scope: !1015)
!1020 = !DILocalVariable(name: "f", arg: 2, scope: !1015, file: !1, line: 154, type: !207)
!1021 = !DILocation(line: 154, column: 60, scope: !1015)
!1022 = !DILocation(line: 157, column: 9, scope: !1015)
!1023 = !DILocation(line: 157, column: 2, scope: !1015)
!1024 = distinct !DISubprogram(name: "bm_log_compress_ids_to_indices", scope: !1, file: !1, line: 445, type: !1025, scopeLine: 446, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !387)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!227, !119, !5}
!1027 = !DILocalVariable(name: "ids", arg: 1, scope: !1024, file: !1, line: 445, type: !119)
!1028 = !DILocation(line: 445, column: 60, scope: !1024)
!1029 = !DILocalVariable(name: "totid", arg: 2, scope: !1024, file: !1, line: 445, type: !5)
!1030 = !DILocation(line: 445, column: 78, scope: !1024)
!1031 = !DILocalVariable(name: "map", scope: !1024, file: !1, line: 447, type: !227)
!1032 = !DILocation(line: 447, column: 9, scope: !1024)
!1033 = !DILocation(line: 447, column: 46, scope: !1024)
!1034 = !DILocation(line: 447, column: 15, scope: !1024)
!1035 = !DILocalVariable(name: "i", scope: !1024, file: !1, line: 448, type: !5)
!1036 = !DILocation(line: 448, column: 15, scope: !1024)
!1037 = !DILocation(line: 450, column: 8, scope: !1024)
!1038 = !DILocation(line: 450, column: 13, scope: !1024)
!1039 = !DILocation(line: 450, column: 2, scope: !1024)
!1040 = !DILocation(line: 452, column: 9, scope: !1041)
!1041 = distinct !DILexicalBlock(scope: !1024, file: !1, line: 452, column: 2)
!1042 = !DILocation(line: 452, column: 7, scope: !1041)
!1043 = !DILocation(line: 452, column: 14, scope: !1044)
!1044 = distinct !DILexicalBlock(scope: !1041, file: !1, line: 452, column: 2)
!1045 = !DILocation(line: 452, column: 18, scope: !1044)
!1046 = !DILocation(line: 452, column: 16, scope: !1044)
!1047 = !DILocation(line: 452, column: 2, scope: !1041)
!1048 = !DILocalVariable(name: "key", scope: !1049, file: !1, line: 453, type: !118)
!1049 = distinct !DILexicalBlock(scope: !1044, file: !1, line: 452, column: 30)
!1050 = !DILocation(line: 453, column: 9, scope: !1049)
!1051 = !DILocation(line: 453, column: 15, scope: !1049)
!1052 = !DILocalVariable(name: "val", scope: !1049, file: !1, line: 454, type: !118)
!1053 = !DILocation(line: 454, column: 9, scope: !1049)
!1054 = !DILocation(line: 454, column: 15, scope: !1049)
!1055 = !DILocation(line: 455, column: 20, scope: !1049)
!1056 = !DILocation(line: 455, column: 25, scope: !1049)
!1057 = !DILocation(line: 455, column: 30, scope: !1049)
!1058 = !DILocation(line: 455, column: 3, scope: !1049)
!1059 = !DILocation(line: 456, column: 2, scope: !1049)
!1060 = !DILocation(line: 452, column: 26, scope: !1044)
!1061 = !DILocation(line: 452, column: 2, scope: !1044)
!1062 = distinct !{!1062, !1047, !1063}
!1063 = !DILocation(line: 456, column: 2, scope: !1041)
!1064 = !DILocation(line: 458, column: 9, scope: !1024)
!1065 = !DILocation(line: 458, column: 2, scope: !1024)
!1066 = distinct !DISubprogram(name: "BM_log_entry_add", scope: !1, file: !1, line: 654, type: !1067, scopeLine: 655, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !387)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{!239, !218}
!1069 = !DILocalVariable(name: "log", arg: 1, scope: !1066, file: !1, line: 654, type: !218)
!1070 = !DILocation(line: 654, column: 37, scope: !1066)
!1071 = !DILocalVariable(name: "entry", scope: !1066, file: !1, line: 656, type: !239)
!1072 = !DILocation(line: 656, column: 14, scope: !1066)
!1073 = !DILocalVariable(name: "next", scope: !1066, file: !1, line: 656, type: !239)
!1074 = !DILocation(line: 656, column: 22, scope: !1066)
!1075 = !DILocation(line: 659, column: 10, scope: !1066)
!1076 = !DILocation(line: 659, column: 15, scope: !1066)
!1077 = !DILocation(line: 659, column: 8, scope: !1066)
!1078 = !DILocation(line: 660, column: 6, scope: !1079)
!1079 = distinct !DILexicalBlock(scope: !1066, file: !1, line: 660, column: 6)
!1080 = !DILocation(line: 660, column: 6, scope: !1066)
!1081 = !DILocation(line: 661, column: 16, scope: !1082)
!1082 = distinct !DILexicalBlock(scope: !1083, file: !1, line: 661, column: 3)
!1083 = distinct !DILexicalBlock(scope: !1079, file: !1, line: 660, column: 13)
!1084 = !DILocation(line: 661, column: 23, scope: !1082)
!1085 = !DILocation(line: 661, column: 14, scope: !1082)
!1086 = !DILocation(line: 661, column: 8, scope: !1082)
!1087 = !DILocation(line: 661, column: 29, scope: !1088)
!1088 = distinct !DILexicalBlock(scope: !1082, file: !1, line: 661, column: 3)
!1089 = !DILocation(line: 661, column: 3, scope: !1082)
!1090 = !DILocation(line: 662, column: 11, scope: !1091)
!1091 = distinct !DILexicalBlock(scope: !1088, file: !1, line: 661, column: 50)
!1092 = !DILocation(line: 662, column: 18, scope: !1091)
!1093 = !DILocation(line: 662, column: 9, scope: !1091)
!1094 = !DILocation(line: 663, column: 22, scope: !1091)
!1095 = !DILocation(line: 663, column: 4, scope: !1091)
!1096 = !DILocation(line: 664, column: 19, scope: !1091)
!1097 = !DILocation(line: 664, column: 24, scope: !1091)
!1098 = !DILocation(line: 664, column: 33, scope: !1091)
!1099 = !DILocation(line: 664, column: 4, scope: !1091)
!1100 = !DILocation(line: 665, column: 3, scope: !1091)
!1101 = !DILocation(line: 661, column: 44, scope: !1088)
!1102 = !DILocation(line: 661, column: 42, scope: !1088)
!1103 = !DILocation(line: 661, column: 3, scope: !1088)
!1104 = distinct !{!1104, !1089, !1105}
!1105 = !DILocation(line: 665, column: 3, scope: !1082)
!1106 = !DILocation(line: 666, column: 2, scope: !1083)
!1107 = !DILocation(line: 669, column: 10, scope: !1066)
!1108 = !DILocation(line: 669, column: 8, scope: !1066)
!1109 = !DILocation(line: 670, column: 15, scope: !1066)
!1110 = !DILocation(line: 670, column: 20, scope: !1066)
!1111 = !DILocation(line: 670, column: 29, scope: !1066)
!1112 = !DILocation(line: 670, column: 2, scope: !1066)
!1113 = !DILocation(line: 671, column: 15, scope: !1066)
!1114 = !DILocation(line: 671, column: 2, scope: !1066)
!1115 = !DILocation(line: 671, column: 9, scope: !1066)
!1116 = !DILocation(line: 671, column: 13, scope: !1066)
!1117 = !DILocation(line: 672, column: 23, scope: !1066)
!1118 = !DILocation(line: 672, column: 2, scope: !1066)
!1119 = !DILocation(line: 672, column: 7, scope: !1066)
!1120 = !DILocation(line: 672, column: 21, scope: !1066)
!1121 = !DILocation(line: 674, column: 9, scope: !1066)
!1122 = !DILocation(line: 674, column: 2, scope: !1066)
!1123 = distinct !DISubprogram(name: "bm_log_entry_free", scope: !1, file: !1, line: 405, type: !553, scopeLine: 406, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !387)
!1124 = !DILocalVariable(name: "entry", arg: 1, scope: !1123, file: !1, line: 405, type: !239)
!1125 = !DILocation(line: 405, column: 43, scope: !1123)
!1126 = !DILocation(line: 407, column: 17, scope: !1123)
!1127 = !DILocation(line: 407, column: 24, scope: !1123)
!1128 = !DILocation(line: 407, column: 2, scope: !1123)
!1129 = !DILocation(line: 408, column: 17, scope: !1123)
!1130 = !DILocation(line: 408, column: 24, scope: !1123)
!1131 = !DILocation(line: 408, column: 2, scope: !1123)
!1132 = !DILocation(line: 409, column: 17, scope: !1123)
!1133 = !DILocation(line: 409, column: 24, scope: !1123)
!1134 = !DILocation(line: 409, column: 2, scope: !1123)
!1135 = !DILocation(line: 410, column: 17, scope: !1123)
!1136 = !DILocation(line: 410, column: 24, scope: !1123)
!1137 = !DILocation(line: 410, column: 2, scope: !1123)
!1138 = !DILocation(line: 411, column: 17, scope: !1123)
!1139 = !DILocation(line: 411, column: 24, scope: !1123)
!1140 = !DILocation(line: 411, column: 2, scope: !1123)
!1141 = !DILocation(line: 412, column: 17, scope: !1123)
!1142 = !DILocation(line: 412, column: 24, scope: !1123)
!1143 = !DILocation(line: 412, column: 2, scope: !1123)
!1144 = !DILocation(line: 414, column: 22, scope: !1123)
!1145 = !DILocation(line: 414, column: 29, scope: !1123)
!1146 = !DILocation(line: 414, column: 2, scope: !1123)
!1147 = !DILocation(line: 415, column: 22, scope: !1123)
!1148 = !DILocation(line: 415, column: 29, scope: !1123)
!1149 = !DILocation(line: 415, column: 2, scope: !1123)
!1150 = !DILocation(line: 416, column: 1, scope: !1123)
!1151 = distinct !DISubprogram(name: "bm_log_entry_create", scope: !1, file: !1, line: 385, type: !1152, scopeLine: 386, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !387)
!1152 = !DISubroutineType(types: !1153)
!1153 = !{!239}
!1154 = !DILocalVariable(name: "entry", scope: !1151, file: !1, line: 387, type: !239)
!1155 = !DILocation(line: 387, column: 14, scope: !1151)
!1156 = !DILocation(line: 387, column: 22, scope: !1151)
!1157 = !DILocation(line: 389, column: 25, scope: !1151)
!1158 = !DILocation(line: 389, column: 2, scope: !1151)
!1159 = !DILocation(line: 389, column: 9, scope: !1151)
!1160 = !DILocation(line: 389, column: 23, scope: !1151)
!1161 = !DILocation(line: 390, column: 25, scope: !1151)
!1162 = !DILocation(line: 390, column: 2, scope: !1151)
!1163 = !DILocation(line: 390, column: 9, scope: !1151)
!1164 = !DILocation(line: 390, column: 23, scope: !1151)
!1165 = !DILocation(line: 391, column: 23, scope: !1151)
!1166 = !DILocation(line: 391, column: 2, scope: !1151)
!1167 = !DILocation(line: 391, column: 9, scope: !1151)
!1168 = !DILocation(line: 391, column: 21, scope: !1151)
!1169 = !DILocation(line: 392, column: 23, scope: !1151)
!1170 = !DILocation(line: 392, column: 2, scope: !1151)
!1171 = !DILocation(line: 392, column: 9, scope: !1151)
!1172 = !DILocation(line: 392, column: 21, scope: !1151)
!1173 = !DILocation(line: 393, column: 26, scope: !1151)
!1174 = !DILocation(line: 393, column: 2, scope: !1151)
!1175 = !DILocation(line: 393, column: 9, scope: !1151)
!1176 = !DILocation(line: 393, column: 24, scope: !1151)
!1177 = !DILocation(line: 394, column: 26, scope: !1151)
!1178 = !DILocation(line: 394, column: 2, scope: !1151)
!1179 = !DILocation(line: 394, column: 9, scope: !1151)
!1180 = !DILocation(line: 394, column: 24, scope: !1151)
!1181 = !DILocation(line: 396, column: 22, scope: !1151)
!1182 = !DILocation(line: 396, column: 2, scope: !1151)
!1183 = !DILocation(line: 396, column: 9, scope: !1151)
!1184 = !DILocation(line: 396, column: 20, scope: !1151)
!1185 = !DILocation(line: 397, column: 22, scope: !1151)
!1186 = !DILocation(line: 397, column: 2, scope: !1151)
!1187 = !DILocation(line: 397, column: 9, scope: !1151)
!1188 = !DILocation(line: 397, column: 20, scope: !1151)
!1189 = !DILocation(line: 399, column: 9, scope: !1151)
!1190 = !DILocation(line: 399, column: 2, scope: !1151)
!1191 = distinct !DISubprogram(name: "BM_log_entry_drop", scope: !1, file: !1, line: 686, type: !553, scopeLine: 687, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !387)
!1192 = !DILocalVariable(name: "entry", arg: 1, scope: !1191, file: !1, line: 686, type: !239)
!1193 = !DILocation(line: 686, column: 36, scope: !1191)
!1194 = !DILocalVariable(name: "log", scope: !1191, file: !1, line: 688, type: !218)
!1195 = !DILocation(line: 688, column: 9, scope: !1191)
!1196 = !DILocation(line: 688, column: 15, scope: !1191)
!1197 = !DILocation(line: 688, column: 22, scope: !1191)
!1198 = !DILocation(line: 690, column: 7, scope: !1199)
!1199 = distinct !DILexicalBlock(scope: !1191, file: !1, line: 690, column: 6)
!1200 = !DILocation(line: 690, column: 6, scope: !1191)
!1201 = !DILocation(line: 693, column: 7, scope: !1202)
!1202 = distinct !DILexicalBlock(scope: !1203, file: !1, line: 693, column: 7)
!1203 = distinct !DILexicalBlock(scope: !1199, file: !1, line: 690, column: 12)
!1204 = !DILocation(line: 693, column: 14, scope: !1202)
!1205 = !DILocation(line: 693, column: 7, scope: !1203)
!1206 = !DILocation(line: 694, column: 4, scope: !1202)
!1207 = !DILocation(line: 694, column: 11, scope: !1202)
!1208 = !DILocation(line: 694, column: 17, scope: !1202)
!1209 = !DILocation(line: 694, column: 22, scope: !1202)
!1210 = !DILocation(line: 695, column: 12, scope: !1211)
!1211 = distinct !DILexicalBlock(scope: !1202, file: !1, line: 695, column: 12)
!1212 = !DILocation(line: 695, column: 19, scope: !1211)
!1213 = !DILocation(line: 695, column: 12, scope: !1202)
!1214 = !DILocation(line: 696, column: 4, scope: !1211)
!1215 = !DILocation(line: 696, column: 11, scope: !1211)
!1216 = !DILocation(line: 696, column: 17, scope: !1211)
!1217 = !DILocation(line: 696, column: 22, scope: !1211)
!1218 = !DILocation(line: 698, column: 21, scope: !1203)
!1219 = !DILocation(line: 698, column: 3, scope: !1203)
!1220 = !DILocation(line: 699, column: 3, scope: !1203)
!1221 = !DILocation(line: 699, column: 13, scope: !1203)
!1222 = !DILocation(line: 700, column: 3, scope: !1203)
!1223 = !DILocation(line: 703, column: 7, scope: !1224)
!1224 = distinct !DILexicalBlock(scope: !1191, file: !1, line: 703, column: 6)
!1225 = !DILocation(line: 703, column: 14, scope: !1224)
!1226 = !DILocation(line: 703, column: 6, scope: !1191)
!1227 = !DILocation(line: 729, column: 2, scope: !1228)
!1228 = distinct !DILexicalBlock(scope: !1224, file: !1, line: 703, column: 20)
!1229 = !DILocation(line: 730, column: 12, scope: !1230)
!1230 = distinct !DILexicalBlock(scope: !1224, file: !1, line: 730, column: 11)
!1231 = !DILocation(line: 730, column: 19, scope: !1230)
!1232 = !DILocation(line: 730, column: 11, scope: !1224)
!1233 = !DILocation(line: 735, column: 27, scope: !1234)
!1234 = distinct !DILexicalBlock(scope: !1230, file: !1, line: 730, column: 25)
!1235 = !DILocation(line: 735, column: 32, scope: !1234)
!1236 = !DILocation(line: 735, column: 39, scope: !1234)
!1237 = !DILocation(line: 735, column: 3, scope: !1234)
!1238 = !DILocation(line: 736, column: 27, scope: !1234)
!1239 = !DILocation(line: 736, column: 32, scope: !1234)
!1240 = !DILocation(line: 736, column: 39, scope: !1234)
!1241 = !DILocation(line: 736, column: 3, scope: !1234)
!1242 = !DILocation(line: 737, column: 2, scope: !1234)
!1243 = !DILocation(line: 742, column: 6, scope: !1244)
!1244 = distinct !DILexicalBlock(scope: !1191, file: !1, line: 742, column: 6)
!1245 = !DILocation(line: 742, column: 11, scope: !1244)
!1246 = !DILocation(line: 742, column: 28, scope: !1244)
!1247 = !DILocation(line: 742, column: 25, scope: !1244)
!1248 = !DILocation(line: 742, column: 6, scope: !1191)
!1249 = !DILocation(line: 743, column: 24, scope: !1244)
!1250 = !DILocation(line: 743, column: 31, scope: !1244)
!1251 = !DILocation(line: 743, column: 3, scope: !1244)
!1252 = !DILocation(line: 743, column: 8, scope: !1244)
!1253 = !DILocation(line: 743, column: 22, scope: !1244)
!1254 = !DILocation(line: 745, column: 20, scope: !1191)
!1255 = !DILocation(line: 745, column: 2, scope: !1191)
!1256 = !DILocation(line: 746, column: 17, scope: !1191)
!1257 = !DILocation(line: 746, column: 22, scope: !1191)
!1258 = !DILocation(line: 746, column: 31, scope: !1191)
!1259 = !DILocation(line: 746, column: 2, scope: !1191)
!1260 = !DILocation(line: 747, column: 1, scope: !1191)
!1261 = distinct !DISubprogram(name: "bm_log_id_ghash_release", scope: !1, file: !1, line: 462, type: !1262, scopeLine: 463, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !387)
!1262 = !DISubroutineType(types: !1263)
!1263 = !{null, !218, !227}
!1264 = !DILocalVariable(name: "log", arg: 1, scope: !1261, file: !1, line: 462, type: !218)
!1265 = !DILocation(line: 462, column: 44, scope: !1261)
!1266 = !DILocalVariable(name: "id_ghash", arg: 2, scope: !1261, file: !1, line: 462, type: !227)
!1267 = !DILocation(line: 462, column: 56, scope: !1261)
!1268 = !DILocalVariable(name: "gh_iter", scope: !1261, file: !1, line: 464, type: !623)
!1269 = !DILocation(line: 464, column: 16, scope: !1261)
!1270 = !DILocation(line: 466, column: 2, scope: !1271)
!1271 = distinct !DILexicalBlock(scope: !1261, file: !1, line: 466, column: 2)
!1272 = !DILocation(line: 466, column: 2, scope: !1273)
!1273 = distinct !DILexicalBlock(scope: !1271, file: !1, line: 466, column: 2)
!1274 = !DILocalVariable(name: "key", scope: !1275, file: !1, line: 467, type: !118)
!1275 = distinct !DILexicalBlock(scope: !1273, file: !1, line: 466, column: 33)
!1276 = !DILocation(line: 467, column: 9, scope: !1275)
!1277 = !DILocation(line: 467, column: 15, scope: !1275)
!1278 = !DILocalVariable(name: "id", scope: !1275, file: !1, line: 468, type: !5)
!1279 = !DILocation(line: 468, column: 16, scope: !1275)
!1280 = !DILocation(line: 468, column: 21, scope: !1275)
!1281 = !DILocation(line: 469, column: 27, scope: !1275)
!1282 = !DILocation(line: 469, column: 32, scope: !1275)
!1283 = !DILocation(line: 469, column: 44, scope: !1275)
!1284 = !DILocation(line: 469, column: 3, scope: !1275)
!1285 = !DILocation(line: 470, column: 2, scope: !1275)
!1286 = distinct !{!1286, !1270, !1287}
!1287 = !DILocation(line: 470, column: 2, scope: !1271)
!1288 = !DILocation(line: 471, column: 1, scope: !1261)
!1289 = distinct !DISubprogram(name: "BM_log_undo", scope: !1, file: !1, line: 752, type: !421, scopeLine: 753, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !387)
!1290 = !DILocalVariable(name: "bm", arg: 1, scope: !1289, file: !1, line: 752, type: !258)
!1291 = !DILocation(line: 752, column: 25, scope: !1289)
!1292 = !DILocalVariable(name: "log", arg: 2, scope: !1289, file: !1, line: 752, type: !218)
!1293 = !DILocation(line: 752, column: 36, scope: !1289)
!1294 = !DILocalVariable(name: "entry", scope: !1289, file: !1, line: 754, type: !239)
!1295 = !DILocation(line: 754, column: 14, scope: !1289)
!1296 = !DILocation(line: 754, column: 22, scope: !1289)
!1297 = !DILocation(line: 754, column: 27, scope: !1289)
!1298 = !DILocation(line: 756, column: 6, scope: !1299)
!1299 = distinct !DILexicalBlock(scope: !1289, file: !1, line: 756, column: 6)
!1300 = !DILocation(line: 756, column: 6, scope: !1289)
!1301 = !DILocation(line: 757, column: 24, scope: !1302)
!1302 = distinct !DILexicalBlock(scope: !1299, file: !1, line: 756, column: 13)
!1303 = !DILocation(line: 757, column: 31, scope: !1302)
!1304 = !DILocation(line: 757, column: 3, scope: !1302)
!1305 = !DILocation(line: 757, column: 8, scope: !1302)
!1306 = !DILocation(line: 757, column: 22, scope: !1302)
!1307 = !DILocation(line: 760, column: 23, scope: !1302)
!1308 = !DILocation(line: 760, column: 27, scope: !1302)
!1309 = !DILocation(line: 760, column: 32, scope: !1302)
!1310 = !DILocation(line: 760, column: 39, scope: !1302)
!1311 = !DILocation(line: 760, column: 3, scope: !1302)
!1312 = !DILocation(line: 761, column: 23, scope: !1302)
!1313 = !DILocation(line: 761, column: 27, scope: !1302)
!1314 = !DILocation(line: 761, column: 32, scope: !1302)
!1315 = !DILocation(line: 761, column: 39, scope: !1302)
!1316 = !DILocation(line: 761, column: 3, scope: !1302)
!1317 = !DILocation(line: 764, column: 24, scope: !1302)
!1318 = !DILocation(line: 764, column: 28, scope: !1302)
!1319 = !DILocation(line: 764, column: 33, scope: !1302)
!1320 = !DILocation(line: 764, column: 40, scope: !1302)
!1321 = !DILocation(line: 764, column: 3, scope: !1302)
!1322 = !DILocation(line: 765, column: 24, scope: !1302)
!1323 = !DILocation(line: 765, column: 28, scope: !1302)
!1324 = !DILocation(line: 765, column: 33, scope: !1302)
!1325 = !DILocation(line: 765, column: 40, scope: !1302)
!1326 = !DILocation(line: 765, column: 3, scope: !1302)
!1327 = !DILocation(line: 768, column: 27, scope: !1302)
!1328 = !DILocation(line: 768, column: 31, scope: !1302)
!1329 = !DILocation(line: 768, column: 36, scope: !1302)
!1330 = !DILocation(line: 768, column: 43, scope: !1302)
!1331 = !DILocation(line: 768, column: 3, scope: !1302)
!1332 = !DILocation(line: 769, column: 27, scope: !1302)
!1333 = !DILocation(line: 769, column: 32, scope: !1302)
!1334 = !DILocation(line: 769, column: 39, scope: !1302)
!1335 = !DILocation(line: 769, column: 3, scope: !1302)
!1336 = !DILocation(line: 770, column: 2, scope: !1302)
!1337 = !DILocation(line: 771, column: 1, scope: !1289)
!1338 = distinct !DISubprogram(name: "bm_log_faces_unmake", scope: !1, file: !1, line: 265, type: !1339, scopeLine: 266, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !387)
!1339 = !DISubroutineType(types: !1340)
!1340 = !{null, !258, !218, !227}
!1341 = !DILocalVariable(name: "bm", arg: 1, scope: !1338, file: !1, line: 265, type: !258)
!1342 = !DILocation(line: 265, column: 40, scope: !1338)
!1343 = !DILocalVariable(name: "log", arg: 2, scope: !1338, file: !1, line: 265, type: !218)
!1344 = !DILocation(line: 265, column: 51, scope: !1338)
!1345 = !DILocalVariable(name: "faces", arg: 3, scope: !1338, file: !1, line: 265, type: !227)
!1346 = !DILocation(line: 265, column: 63, scope: !1338)
!1347 = !DILocalVariable(name: "gh_iter", scope: !1338, file: !1, line: 267, type: !623)
!1348 = !DILocation(line: 267, column: 16, scope: !1338)
!1349 = !DILocation(line: 268, column: 2, scope: !1350)
!1350 = distinct !DILexicalBlock(scope: !1338, file: !1, line: 268, column: 2)
!1351 = !DILocation(line: 268, column: 2, scope: !1352)
!1352 = distinct !DILexicalBlock(scope: !1350, file: !1, line: 268, column: 2)
