; ModuleID = 'blender_bin/source/blender/makesrna/intern/rna_animviz_gen.c'
source_filename = "blender_bin/source/blender/makesrna/intern/rna_animviz_gen.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.CollectionPropertyRNA = type { %struct.PropertyRNA, void (%struct.CollectionPropertyIterator*, %struct.PointerRNA*)*, void (%struct.CollectionPropertyIterator*)*, void (%struct.CollectionPropertyIterator*)*, void (%struct.PointerRNA*, %struct.CollectionPropertyIterator*)*, i32 (%struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32, %struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i8*, %struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32, %struct.PointerRNA*)*, %struct.StructRNA* }
%struct.PropertyRNA = type { %struct.PropertyRNA*, %struct.PropertyRNA*, i32, i8*, i32, i8*, i8*, i32, i8*, i32, i32, i32 (%struct.PointerRNA*, i32*)*, i32, [3 x i32], i32, void (%struct.Main*, %struct.Scene*, %struct.PointerRNA*)*, i32, i32 (%struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32)*, i32, i32, %struct.StructRNA*, i8* }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "motionpath_bake_location_items", scope: !2, file: !1744, line: 46, type: !1739, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !56, globals: !1362, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "blender_bin/source/blender/makesrna/intern/rna_animviz_gen.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{!5, !16, !47}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertyType", file: !6, line: 71, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15}
!9 = !DIEnumerator(name: "PROP_BOOLEAN", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "PROP_INT", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "PROP_FLOAT", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "PROP_STRING", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "PROP_ENUM", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "PROP_POINTER", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "PROP_COLLECTION", value: 6, isUnsigned: true)
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertySubType", file: !6, line: 107, baseType: !7, size: 32, elements: !17)
!17 = !{!18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46}
!18 = !DIEnumerator(name: "PROP_NONE", value: 0, isUnsigned: true)
!19 = !DIEnumerator(name: "PROP_FILEPATH", value: 1, isUnsigned: true)
!20 = !DIEnumerator(name: "PROP_DIRPATH", value: 2, isUnsigned: true)
!21 = !DIEnumerator(name: "PROP_FILENAME", value: 3, isUnsigned: true)
!22 = !DIEnumerator(name: "PROP_BYTESTRING", value: 4, isUnsigned: true)
!23 = !DIEnumerator(name: "PROP_PASSWORD", value: 6, isUnsigned: true)
!24 = !DIEnumerator(name: "PROP_PIXEL", value: 12, isUnsigned: true)
!25 = !DIEnumerator(name: "PROP_UNSIGNED", value: 13, isUnsigned: true)
!26 = !DIEnumerator(name: "PROP_PERCENTAGE", value: 14, isUnsigned: true)
!27 = !DIEnumerator(name: "PROP_FACTOR", value: 15, isUnsigned: true)
!28 = !DIEnumerator(name: "PROP_ANGLE", value: 327696, isUnsigned: true)
!29 = !DIEnumerator(name: "PROP_TIME", value: 393233, isUnsigned: true)
!30 = !DIEnumerator(name: "PROP_DISTANCE", value: 65554, isUnsigned: true)
!31 = !DIEnumerator(name: "PROP_DISTANCE_CAMERA", value: 589843, isUnsigned: true)
!32 = !DIEnumerator(name: "PROP_COLOR", value: 20, isUnsigned: true)
!33 = !DIEnumerator(name: "PROP_TRANSLATION", value: 65557, isUnsigned: true)
!34 = !DIEnumerator(name: "PROP_DIRECTION", value: 22, isUnsigned: true)
!35 = !DIEnumerator(name: "PROP_VELOCITY", value: 458775, isUnsigned: true)
!36 = !DIEnumerator(name: "PROP_ACCELERATION", value: 524312, isUnsigned: true)
!37 = !DIEnumerator(name: "PROP_MATRIX", value: 25, isUnsigned: true)
!38 = !DIEnumerator(name: "PROP_EULER", value: 327706, isUnsigned: true)
!39 = !DIEnumerator(name: "PROP_QUATERNION", value: 27, isUnsigned: true)
!40 = !DIEnumerator(name: "PROP_AXISANGLE", value: 28, isUnsigned: true)
!41 = !DIEnumerator(name: "PROP_XYZ", value: 29, isUnsigned: true)
!42 = !DIEnumerator(name: "PROP_XYZ_LENGTH", value: 65565, isUnsigned: true)
!43 = !DIEnumerator(name: "PROP_COLOR_GAMMA", value: 30, isUnsigned: true)
!44 = !DIEnumerator(name: "PROP_COORDS", value: 31, isUnsigned: true)
!45 = !DIEnumerator(name: "PROP_LAYER", value: 40, isUnsigned: true)
!46 = !DIEnumerator(name: "PROP_LAYER_MEMBER", value: 41, isUnsigned: true)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RawPropertyType", file: !6, line: 286, baseType: !48, size: 32, elements: !49)
!48 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!49 = !{!50, !51, !52, !53, !54, !55}
!50 = !DIEnumerator(name: "PROP_RAW_UNSET", value: -1)
!51 = !DIEnumerator(name: "PROP_RAW_INT", value: 0)
!52 = !DIEnumerator(name: "PROP_RAW_SHORT", value: 1)
!53 = !DIEnumerator(name: "PROP_RAW_CHAR", value: 2)
!54 = !DIEnumerator(name: "PROP_RAW_DOUBLE", value: 3)
!55 = !DIEnumerator(name: "PROP_RAW_FLOAT", value: 4)
!56 = !{!57, !1326, !48, !1346, !91, !1351, !354, !1361}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyRNA", file: !6, line: 333, baseType: !59)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PropertyRNA", file: !60, line: 157, size: 1344, elements: !61)
!60 = !DIFile(filename: "blender/source/blender/makesrna/intern/rna_internal_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!61 = !{!62, !64, !65, !66, !70, !71, !72, !73, !74, !75, !77, !79, !453, !454, !458, !459, !1310, !1311, !1316, !1321, !1322, !1324, !1325}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !59, file: !60, line: 158, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !59, file: !60, line: 158, baseType: !63, size: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !59, file: !60, line: 161, baseType: !48, size: 32, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !59, file: !60, line: 164, baseType: !67, size: 64, offset: 192)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!69 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !59, file: !60, line: 166, baseType: !48, size: 32, offset: 256)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !59, file: !60, line: 169, baseType: !67, size: 64, offset: 320)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !59, file: !60, line: 171, baseType: !67, size: 64, offset: 384)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !59, file: !60, line: 173, baseType: !48, size: 32, offset: 448)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !59, file: !60, line: 175, baseType: !67, size: 64, offset: 512)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !59, file: !60, line: 178, baseType: !76, size: 32, offset: 576)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyType", file: !6, line: 79, baseType: !5)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !59, file: !60, line: 180, baseType: !78, size: 32, offset: 608)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertySubType", file: !6, line: 147, baseType: !16)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "getlength", scope: !59, file: !60, line: 182, baseType: !80, size: 64, offset: 640)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropArrayLengthGetFunc", file: !60, line: 73, baseType: !81)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DISubroutineType(types: !83)
!83 = !{!48, !84, !399}
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !6, line: 55, size: 192, elements: !86)
!86 = !{!87, !92, !452}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !85, file: !6, line: 58, baseType: !88, size: 64)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !85, file: !6, line: 56, size: 64, elements: !89)
!89 = !{!90}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !88, file: !6, line: 57, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !85, file: !6, line: 60, baseType: !93, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !60, line: 339, size: 1600, elements: !95)
!95 = !{!96, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !129, !135, !434, !439, !445, !451}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !94, file: !60, line: 341, baseType: !97, size: 320)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "ContainerRNA", file: !60, line: 135, baseType: !98)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ContainerRNA", file: !60, line: 130, size: 320, elements: !99)
!99 = !{!100, !101, !102, !105}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !98, file: !60, line: 131, baseType: !91, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !98, file: !60, line: 131, baseType: !91, size: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "prophash", scope: !98, file: !60, line: 133, baseType: !103, size: 64, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !60, line: 46, flags: DIFlagFwdDecl)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !98, file: !60, line: 134, baseType: !106, size: 128, offset: 192)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !107, line: 71, baseType: !108)
!107 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !107, line: 69, size: 128, elements: !109)
!109 = !{!110, !111}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !108, file: !107, line: 70, baseType: !91, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !108, file: !107, line: 70, baseType: !91, size: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !94, file: !60, line: 344, baseType: !67, size: 64, offset: 320)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "py_type", scope: !94, file: !60, line: 348, baseType: !91, size: 64, offset: 384)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "blender_type", scope: !94, file: !60, line: 349, baseType: !91, size: 64, offset: 448)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !94, file: !60, line: 352, baseType: !48, size: 32, offset: 512)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !94, file: !60, line: 355, baseType: !67, size: 64, offset: 576)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !94, file: !60, line: 357, baseType: !67, size: 64, offset: 640)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !94, file: !60, line: 359, baseType: !67, size: 64, offset: 704)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !94, file: !60, line: 361, baseType: !48, size: 32, offset: 768)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "nameproperty", scope: !94, file: !60, line: 364, baseType: !57, size: 64, offset: 832)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "iteratorproperty", scope: !94, file: !60, line: 367, baseType: !57, size: 64, offset: 896)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !94, file: !60, line: 370, baseType: !93, size: 64, offset: 960)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "nested", scope: !94, file: !60, line: 376, baseType: !93, size: 64, offset: 1024)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "refine", scope: !94, file: !60, line: 379, baseType: !125, size: 64, offset: 1088)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRefineFunc", file: !60, line: 70, baseType: !126)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!93, !84}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !94, file: !60, line: 382, baseType: !130, size: 64, offset: 1152)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructPathFunc", file: !60, line: 71, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!134, !84}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !94, file: !60, line: 385, baseType: !136, size: 64, offset: 1216)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRegisterFunc", file: !6, line: 410, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!93, !140, !269, !91, !67, !395, !400, !430}
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Main", file: !142, line: 53, size: 15232, elements: !143)
!142 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_main.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!143 = !{!144, !145, !146, !150, !152, !153, !154, !155, !161, !165, !166, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !263, !266}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !141, file: !142, line: 54, baseType: !140, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !141, file: !142, line: 54, baseType: !140, size: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !141, file: !142, line: 55, baseType: !147, size: 8192, offset: 128)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 8192, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 1024)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "versionfile", scope: !141, file: !142, line: 56, baseType: !151, size: 16, offset: 8320)
!151 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "subversionfile", scope: !141, file: !142, line: 56, baseType: !151, size: 16, offset: 8336)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "minversionfile", scope: !141, file: !142, line: 57, baseType: !151, size: 16, offset: 8352)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "minsubversionfile", scope: !141, file: !142, line: 57, baseType: !151, size: 16, offset: 8368)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "build_commit_timestamp", scope: !141, file: !142, line: 58, baseType: !156, size: 64, offset: 8384)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !157, line: 27, baseType: !158)
!157 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !159, line: 45, baseType: !160)
!159 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!160 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "build_hash", scope: !141, file: !142, line: 59, baseType: !162, size: 128, offset: 8448)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 128, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 16)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", scope: !141, file: !142, line: 60, baseType: !151, size: 16, offset: 8576)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "curlib", scope: !141, file: !142, line: 62, baseType: !167, size: 64, offset: 8640)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !169, line: 136, size: 17600, elements: !170)
!169 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!170 = !{!171, !214, !216, !219, !220, !221, !222}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !168, file: !169, line: 137, baseType: !172, size: 960)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !169, line: 130, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !169, line: 117, size: 960, elements: !174)
!174 = !{!175, !176, !177, !179, !180, !184, !185, !186, !187, !188}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !173, file: !169, line: 118, baseType: !91, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !173, file: !169, line: 118, baseType: !91, size: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !173, file: !169, line: 119, baseType: !178, size: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !173, file: !169, line: 120, baseType: !167, size: 64, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !173, file: !169, line: 121, baseType: !181, size: 528, offset: 256)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 528, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 66)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !173, file: !169, line: 126, baseType: !151, size: 16, offset: 784)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !173, file: !169, line: 127, baseType: !48, size: 32, offset: 800)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !173, file: !169, line: 128, baseType: !48, size: 32, offset: 832)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !173, file: !169, line: 128, baseType: !48, size: 32, offset: 864)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !173, file: !169, line: 129, baseType: !189, size: 64, offset: 896)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !169, line: 75, baseType: !191)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !169, line: 62, size: 1024, elements: !192)
!192 = !{!193, !195, !196, !197, !198, !199, !203, !204, !212, !213}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !191, file: !169, line: 63, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !191, file: !169, line: 63, baseType: !194, size: 64, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !191, file: !169, line: 64, baseType: !69, size: 8, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !191, file: !169, line: 64, baseType: !69, size: 8, offset: 136)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !191, file: !169, line: 65, baseType: !151, size: 16, offset: 144)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !191, file: !169, line: 66, baseType: !200, size: 512, offset: 160)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 512, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !191, file: !169, line: 67, baseType: !48, size: 32, offset: 672)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !191, file: !169, line: 69, baseType: !205, size: 256, offset: 704)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !169, line: 60, baseType: !206)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !169, line: 48, size: 256, elements: !207)
!207 = !{!208, !209, !210, !211}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !206, file: !169, line: 49, baseType: !91, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !206, file: !169, line: 58, baseType: !106, size: 128, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !206, file: !169, line: 59, baseType: !48, size: 32, offset: 192)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !206, file: !169, line: 59, baseType: !48, size: 32, offset: 224)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !191, file: !169, line: 70, baseType: !48, size: 32, offset: 960)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !191, file: !169, line: 74, baseType: !48, size: 32, offset: 992)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !168, file: !169, line: 138, baseType: !215, size: 64, offset: 960)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !168, file: !169, line: 139, baseType: !217, size: 64, offset: 1024)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !169, line: 43, flags: DIFlagFwdDecl)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !168, file: !169, line: 140, baseType: !147, size: 8192, offset: 1088)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !168, file: !169, line: 141, baseType: !147, size: 8192, offset: 9280)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !168, file: !169, line: 148, baseType: !167, size: 64, offset: 17472)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !168, file: !169, line: 150, baseType: !223, size: 64, offset: 17536)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !169, line: 45, flags: DIFlagFwdDecl)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !141, file: !142, line: 63, baseType: !106, size: 128, offset: 8704)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "library", scope: !141, file: !142, line: 64, baseType: !106, size: 128, offset: 8832)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !141, file: !142, line: 65, baseType: !106, size: 128, offset: 8960)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "mesh", scope: !141, file: !142, line: 66, baseType: !106, size: 128, offset: 9088)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !141, file: !142, line: 67, baseType: !106, size: 128, offset: 9216)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "mball", scope: !141, file: !142, line: 68, baseType: !106, size: 128, offset: 9344)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !141, file: !142, line: 69, baseType: !106, size: 128, offset: 9472)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !141, file: !142, line: 70, baseType: !106, size: 128, offset: 9600)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !141, file: !142, line: 71, baseType: !106, size: 128, offset: 9728)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "latt", scope: !141, file: !142, line: 72, baseType: !106, size: 128, offset: 9856)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "lamp", scope: !141, file: !142, line: 73, baseType: !106, size: 128, offset: 9984)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !141, file: !142, line: 74, baseType: !106, size: 128, offset: 10112)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !141, file: !142, line: 75, baseType: !106, size: 128, offset: 10240)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !141, file: !142, line: 76, baseType: !106, size: 128, offset: 10368)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !141, file: !142, line: 77, baseType: !106, size: 128, offset: 10496)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !141, file: !142, line: 78, baseType: !106, size: 128, offset: 10624)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !141, file: !142, line: 79, baseType: !106, size: 128, offset: 10752)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "vfont", scope: !141, file: !142, line: 80, baseType: !106, size: 128, offset: 10880)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !141, file: !142, line: 81, baseType: !106, size: 128, offset: 11008)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "speaker", scope: !141, file: !142, line: 82, baseType: !106, size: 128, offset: 11136)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !141, file: !142, line: 83, baseType: !106, size: 128, offset: 11264)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !141, file: !142, line: 84, baseType: !106, size: 128, offset: 11392)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "armature", scope: !141, file: !142, line: 85, baseType: !106, size: 128, offset: 11520)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !141, file: !142, line: 86, baseType: !106, size: 128, offset: 11648)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !141, file: !142, line: 87, baseType: !106, size: 128, offset: 11776)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !141, file: !142, line: 88, baseType: !106, size: 128, offset: 11904)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !141, file: !142, line: 89, baseType: !106, size: 128, offset: 12032)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "palettes", scope: !141, file: !142, line: 90, baseType: !106, size: 128, offset: 12160)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "paintcurves", scope: !141, file: !142, line: 91, baseType: !106, size: 128, offset: 12288)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "wm", scope: !141, file: !142, line: 92, baseType: !106, size: 128, offset: 12416)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil", scope: !141, file: !142, line: 93, baseType: !106, size: 128, offset: 12544)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "movieclip", scope: !141, file: !142, line: 94, baseType: !106, size: 128, offset: 12672)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !141, file: !142, line: 95, baseType: !106, size: 128, offset: 12800)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "linestyle", scope: !141, file: !142, line: 96, baseType: !106, size: 128, offset: 12928)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "id_tag_update", scope: !141, file: !142, line: 98, baseType: !260, size: 2048, offset: 13056)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 2048, elements: !261)
!261 = !{!262}
!262 = !DISubrange(count: 256)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "eval_ctx", scope: !141, file: !142, line: 101, baseType: !264, size: 64, offset: 15104)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "EvaluationContext", file: !142, line: 49, flags: DIFlagFwdDecl)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !141, file: !142, line: 103, baseType: !267, size: 64, offset: 15168)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "MainLock", file: !142, line: 51, flags: DIFlagFwdDecl)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !271, line: 106, size: 320, elements: !272)
!271 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!272 = !{!273, !274, !275, !276, !277, !278}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !270, file: !271, line: 107, baseType: !106, size: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !270, file: !271, line: 108, baseType: !48, size: 32, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !270, file: !271, line: 109, baseType: !48, size: 32, offset: 160)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !270, file: !271, line: 110, baseType: !48, size: 32, offset: 192)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !270, file: !271, line: 110, baseType: !48, size: 32, offset: 224)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !270, file: !271, line: 111, baseType: !279, size: 64, offset: 256)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !281, line: 490, size: 768, elements: !282)
!281 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!282 = !{!283, !284, !285, !386, !387, !388, !389, !390, !391, !392, !393, !394}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !280, file: !281, line: 491, baseType: !279, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !280, file: !281, line: 491, baseType: !279, size: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !280, file: !281, line: 493, baseType: !286, size: 64, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !271, line: 169, size: 2048, elements: !288)
!288 = !{!289, !290, !291, !292, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !361, !364, !378, !379, !380, !381, !382, !383, !384, !385}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !287, file: !271, line: 170, baseType: !286, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !287, file: !271, line: 170, baseType: !286, size: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !287, file: !271, line: 172, baseType: !91, size: 64, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !287, file: !271, line: 174, baseType: !293, size: 64, offset: 192)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !295, line: 41, flags: DIFlagFwdDecl)
!295 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!296 = !DIDerivedType(tag: DW_TAG_member, name: "newscreen", scope: !287, file: !271, line: 175, baseType: !293, size: 64, offset: 256)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "screenname", scope: !287, file: !271, line: 176, baseType: !200, size: 512, offset: 320)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "posx", scope: !287, file: !271, line: 178, baseType: !151, size: 16, offset: 832)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "posy", scope: !287, file: !271, line: 178, baseType: !151, size: 16, offset: 848)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !287, file: !271, line: 178, baseType: !151, size: 16, offset: 864)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !287, file: !271, line: 178, baseType: !151, size: 16, offset: 880)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "windowstate", scope: !287, file: !271, line: 179, baseType: !151, size: 16, offset: 896)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !287, file: !271, line: 180, baseType: !151, size: 16, offset: 912)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !287, file: !271, line: 181, baseType: !151, size: 16, offset: 928)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !287, file: !271, line: 182, baseType: !151, size: 16, offset: 944)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "lastcursor", scope: !287, file: !271, line: 183, baseType: !151, size: 16, offset: 960)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "modalcursor", scope: !287, file: !271, line: 184, baseType: !151, size: 16, offset: 976)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "grabcursor", scope: !287, file: !271, line: 185, baseType: !151, size: 16, offset: 992)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "addmousemove", scope: !287, file: !271, line: 186, baseType: !151, size: 16, offset: 1008)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "winid", scope: !287, file: !271, line: 188, baseType: !48, size: 32, offset: 1024)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "lock_pie_event", scope: !287, file: !271, line: 190, baseType: !151, size: 16, offset: 1056)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "last_pie_event", scope: !287, file: !271, line: 191, baseType: !151, size: 16, offset: 1072)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "eventstate", scope: !287, file: !271, line: 194, baseType: !314, size: 64, offset: 1088)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmEvent", file: !281, line: 421, size: 960, elements: !316)
!316 = !{!317, !318, !319, !320, !321, !322, !323, !327, !331, !332, !333, !334, !335, !336, !337, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !357, !358, !359, !360}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !315, file: !281, line: 422, baseType: !314, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !315, file: !281, line: 422, baseType: !314, size: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !315, file: !281, line: 424, baseType: !151, size: 16, offset: 128)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !315, file: !281, line: 425, baseType: !151, size: 16, offset: 144)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !315, file: !281, line: 426, baseType: !48, size: 32, offset: 160)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !315, file: !281, line: 426, baseType: !48, size: 32, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "mval", scope: !315, file: !281, line: 427, baseType: !324, size: 64, offset: 224)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 64, elements: !325)
!325 = !{!326}
!326 = !DISubrange(count: 2)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_buf", scope: !315, file: !281, line: 428, baseType: !328, size: 48, offset: 288)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 48, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 6)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !315, file: !281, line: 431, baseType: !69, size: 8, offset: 336)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !315, file: !281, line: 432, baseType: !69, size: 8, offset: 344)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "prevtype", scope: !315, file: !281, line: 435, baseType: !151, size: 16, offset: 352)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "prevval", scope: !315, file: !281, line: 436, baseType: !151, size: 16, offset: 368)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "prevx", scope: !315, file: !281, line: 437, baseType: !48, size: 32, offset: 384)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "prevy", scope: !315, file: !281, line: 437, baseType: !48, size: 32, offset: 416)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicktime", scope: !315, file: !281, line: 438, baseType: !338, size: 64, offset: 448)
!338 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "prevclickx", scope: !315, file: !281, line: 439, baseType: !48, size: 32, offset: 512)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicky", scope: !315, file: !281, line: 439, baseType: !48, size: 32, offset: 544)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !315, file: !281, line: 442, baseType: !151, size: 16, offset: 576)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !315, file: !281, line: 442, baseType: !151, size: 16, offset: 592)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !315, file: !281, line: 442, baseType: !151, size: 16, offset: 608)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "oskey", scope: !315, file: !281, line: 442, baseType: !151, size: 16, offset: 624)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "keymodifier", scope: !315, file: !281, line: 443, baseType: !151, size: 16, offset: 640)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "check_click", scope: !315, file: !281, line: 446, baseType: !151, size: 16, offset: 656)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "keymap_idname", scope: !315, file: !281, line: 449, baseType: !67, size: 64, offset: 704)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tablet_data", scope: !315, file: !281, line: 452, baseType: !349, size: 64, offset: 768)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTabletData", file: !281, line: 463, size: 128, elements: !351)
!351 = !{!352, !353, !355, !356}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "Active", scope: !350, file: !281, line: 464, baseType: !48, size: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "Pressure", scope: !350, file: !281, line: 465, baseType: !354, size: 32, offset: 32)
!354 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "Xtilt", scope: !350, file: !281, line: 466, baseType: !354, size: 32, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "Ytilt", scope: !350, file: !281, line: 467, baseType: !354, size: 32, offset: 96)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "custom", scope: !315, file: !281, line: 455, baseType: !151, size: 16, offset: 832)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "customdatafree", scope: !315, file: !281, line: 456, baseType: !151, size: 16, offset: 848)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !315, file: !281, line: 457, baseType: !48, size: 32, offset: 864)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !315, file: !281, line: 458, baseType: !91, size: 64, offset: 896)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "curswin", scope: !287, file: !271, line: 196, baseType: !362, size: 64, offset: 1152)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmSubWindow", file: !271, line: 55, flags: DIFlagFwdDecl)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "tweak", scope: !287, file: !271, line: 198, baseType: !365, size: 64, offset: 1216)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmGesture", file: !281, line: 398, size: 448, elements: !367)
!367 = !{!368, !369, !370, !371, !372, !373, !374, !375, !376, !377}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !366, file: !281, line: 399, baseType: !365, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !366, file: !281, line: 399, baseType: !365, size: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !366, file: !281, line: 400, baseType: !48, size: 32, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !366, file: !281, line: 401, baseType: !48, size: 32, offset: 160)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !366, file: !281, line: 402, baseType: !48, size: 32, offset: 192)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "swinid", scope: !366, file: !281, line: 403, baseType: !48, size: 32, offset: 224)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !366, file: !281, line: 404, baseType: !48, size: 32, offset: 256)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !366, file: !281, line: 405, baseType: !48, size: 32, offset: 288)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !366, file: !281, line: 407, baseType: !91, size: 64, offset: 320)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !366, file: !281, line: 414, baseType: !91, size: 64, offset: 384)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "drawmethod", scope: !287, file: !271, line: 200, baseType: !48, size: 32, offset: 1280)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "drawfail", scope: !287, file: !271, line: 200, baseType: !48, size: 32, offset: 1312)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "drawdata", scope: !287, file: !271, line: 201, baseType: !91, size: 64, offset: 1344)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !287, file: !271, line: 203, baseType: !106, size: 128, offset: 1408)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !287, file: !271, line: 204, baseType: !106, size: 128, offset: 1536)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "modalhandlers", scope: !287, file: !271, line: 205, baseType: !106, size: 128, offset: 1664)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "subwindows", scope: !287, file: !271, line: 207, baseType: !106, size: 128, offset: 1792)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "gesture", scope: !287, file: !271, line: 208, baseType: !106, size: 128, offset: 1920)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "timestep", scope: !280, file: !281, line: 495, baseType: !338, size: 64, offset: 192)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !280, file: !281, line: 496, baseType: !48, size: 32, offset: 256)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !280, file: !281, line: 497, baseType: !91, size: 64, offset: 320)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !280, file: !281, line: 499, baseType: !338, size: 64, offset: 384)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !280, file: !281, line: 500, baseType: !338, size: 64, offset: 448)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ltime", scope: !280, file: !281, line: 502, baseType: !338, size: 64, offset: 512)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ntime", scope: !280, file: !281, line: 503, baseType: !338, size: 64, offset: 576)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !280, file: !281, line: 504, baseType: !338, size: 64, offset: 640)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "sleep", scope: !280, file: !281, line: 505, baseType: !48, size: 32, offset: 704)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructValidateFunc", file: !6, line: 407, baseType: !396)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DISubroutineType(types: !398)
!398 = !{!48, !84, !91, !399}
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !6, line: 408, baseType: !401)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!48, !404, !84, !406, !420}
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !6, line: 44, flags: DIFlagFwdDecl)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !60, line: 137, size: 640, elements: !408)
!408 = !{!409, !410, !411, !412, !413, !429}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !407, file: !60, line: 139, baseType: !97, size: 320)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !407, file: !60, line: 142, baseType: !67, size: 64, offset: 320)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !407, file: !60, line: 144, baseType: !48, size: 32, offset: 384)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !407, file: !60, line: 147, baseType: !67, size: 64, offset: 448)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !407, file: !60, line: 150, baseType: !414, size: 64, offset: 512)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "CallFunc", file: !6, line: 388, baseType: !415)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{null, !404, !269, !418, !420}
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "PointerRNA", file: !6, line: 62, baseType: !85)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !6, line: 348, baseType: !422)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !6, line: 337, size: 256, elements: !423)
!423 = !{!424, !425, !426, !427, !428}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !422, file: !6, line: 339, baseType: !91, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !422, file: !6, line: 342, baseType: !406, size: 64, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !422, file: !6, line: 345, baseType: !48, size: 32, offset: 128)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !422, file: !6, line: 347, baseType: !48, size: 32, offset: 160)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !422, file: !6, line: 347, baseType: !48, size: 32, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "c_ret", scope: !407, file: !60, line: 154, baseType: !57, size: 64, offset: 576)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !6, line: 409, baseType: !431)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{null, !91}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "unreg", scope: !94, file: !60, line: 386, baseType: !435, size: 64, offset: 1280)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructUnregisterFunc", file: !6, line: 414, baseType: !436)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{null, !140, !93}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !94, file: !60, line: 387, baseType: !440, size: 64, offset: 1344)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructInstanceFunc", file: !6, line: 415, baseType: !441)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DISubroutineType(types: !443)
!443 = !{!444, !418}
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "idproperties", scope: !94, file: !60, line: 390, baseType: !446, size: 64, offset: 1408)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertiesFunc", file: !60, line: 69, baseType: !447)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{!194, !84, !450}
!450 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "functions", scope: !94, file: !60, line: 393, baseType: !106, size: 128, offset: 1472)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !85, file: !6, line: 61, baseType: !91, size: 64, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "arraydimension", scope: !59, file: !60, line: 184, baseType: !7, size: 32, offset: 704)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !59, file: !60, line: 186, baseType: !455, size: 96, offset: 736)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 96, elements: !456)
!456 = !{!457}
!457 = !DISubrange(count: 3)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "totarraylength", scope: !59, file: !60, line: 187, baseType: !7, size: 32, offset: 832)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !59, file: !60, line: 190, baseType: !460, size: 64, offset: 896)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "UpdateFunc", file: !60, line: 64, baseType: !461)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{null, !140, !464, !84}
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !466, line: 1216, size: 39680, elements: !467)
!466 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!467 = !{!468, !469, !539, !542, !545, !546, !547, !559, !560, !562, !563, !564, !565, !566, !567, !568, !569, !570, !574, !577, !580, !881, !884, !1181, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1203, !1204, !1205, !1206, !1207, !1215, !1282, !1289, !1292, !1299, !1302, !1303, !1304, !1305, !1306, !1307}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !465, file: !466, line: 1217, baseType: !172, size: 960)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !465, file: !466, line: 1218, baseType: !470, size: 64, offset: 960)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !472, line: 838, size: 768, elements: !473)
!472 = !DIFile(filename: "blender/source/blender/makesdna/DNA_anim_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!473 = !{!474, !489, !490, !500, !501, !532, !533, !534, !535, !536, !537, !538}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !471, file: !472, line: 840, baseType: !475, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !477, line: 499, baseType: !478)
!477 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !477, line: 486, size: 1600, elements: !479)
!479 = !{!480, !481, !482, !483, !484, !485, !486, !487, !488}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !478, file: !477, line: 487, baseType: !172, size: 960)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !478, file: !477, line: 489, baseType: !106, size: 128, offset: 960)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !478, file: !477, line: 490, baseType: !106, size: 128, offset: 1088)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !478, file: !477, line: 491, baseType: !106, size: 128, offset: 1216)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !478, file: !477, line: 492, baseType: !106, size: 128, offset: 1344)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !478, file: !477, line: 494, baseType: !48, size: 32, offset: 1472)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !478, file: !477, line: 495, baseType: !48, size: 32, offset: 1504)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !478, file: !477, line: 497, baseType: !48, size: 32, offset: 1536)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !478, file: !477, line: 498, baseType: !48, size: 32, offset: 1568)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !471, file: !472, line: 844, baseType: !475, size: 64, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !471, file: !472, line: 848, baseType: !491, size: 64, offset: 128)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !472, line: 549, baseType: !493)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !472, line: 544, size: 320, elements: !494)
!494 = !{!495, !497, !498, !499}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !493, file: !472, line: 545, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !493, file: !472, line: 545, baseType: !496, size: 64, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !493, file: !472, line: 547, baseType: !475, size: 64, offset: 128)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !493, file: !472, line: 548, baseType: !106, size: 128, offset: 192)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !471, file: !472, line: 851, baseType: !106, size: 128, offset: 192)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !471, file: !472, line: 853, baseType: !502, size: 64, offset: 320)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !472, line: 594, baseType: !504)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !472, line: 561, size: 1664, elements: !505)
!505 = !{!506, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !504, file: !472, line: 562, baseType: !507, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !504, file: !472, line: 562, baseType: !507, size: 64, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !504, file: !472, line: 564, baseType: !106, size: 128, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !504, file: !472, line: 565, baseType: !475, size: 64, offset: 256)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !504, file: !472, line: 566, baseType: !491, size: 64, offset: 320)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !504, file: !472, line: 568, baseType: !106, size: 128, offset: 384)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !504, file: !472, line: 569, baseType: !106, size: 128, offset: 512)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !504, file: !472, line: 571, baseType: !200, size: 512, offset: 640)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !504, file: !472, line: 573, baseType: !354, size: 32, offset: 1152)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "strip_time", scope: !504, file: !472, line: 574, baseType: !354, size: 32, offset: 1184)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !504, file: !472, line: 576, baseType: !354, size: 32, offset: 1216)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !504, file: !472, line: 576, baseType: !354, size: 32, offset: 1248)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "actstart", scope: !504, file: !472, line: 577, baseType: !354, size: 32, offset: 1280)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "actend", scope: !504, file: !472, line: 577, baseType: !354, size: 32, offset: 1312)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !504, file: !472, line: 579, baseType: !354, size: 32, offset: 1344)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !504, file: !472, line: 580, baseType: !354, size: 32, offset: 1376)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !504, file: !472, line: 582, baseType: !354, size: 32, offset: 1408)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !504, file: !472, line: 582, baseType: !354, size: 32, offset: 1440)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "blendmode", scope: !504, file: !472, line: 583, baseType: !151, size: 16, offset: 1472)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "extendmode", scope: !504, file: !472, line: 585, baseType: !151, size: 16, offset: 1488)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !504, file: !472, line: 586, baseType: !151, size: 16, offset: 1504)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !504, file: !472, line: 588, baseType: !151, size: 16, offset: 1520)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handle", scope: !504, file: !472, line: 590, baseType: !91, size: 64, offset: 1536)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !504, file: !472, line: 592, baseType: !48, size: 32, offset: 1600)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !504, file: !472, line: 593, baseType: !48, size: 32, offset: 1632)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "drivers", scope: !471, file: !472, line: 858, baseType: !106, size: 128, offset: 384)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "overrides", scope: !471, file: !472, line: 859, baseType: !106, size: 128, offset: 512)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !471, file: !472, line: 862, baseType: !48, size: 32, offset: 640)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !471, file: !472, line: 863, baseType: !48, size: 32, offset: 672)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "act_blendmode", scope: !471, file: !472, line: 866, baseType: !151, size: 16, offset: 704)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "act_extendmode", scope: !471, file: !472, line: 867, baseType: !151, size: 16, offset: 720)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "act_influence", scope: !471, file: !472, line: 868, baseType: !354, size: 32, offset: 736)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !465, file: !466, line: 1220, baseType: !540, size: 64, offset: 1024)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !466, line: 50, flags: DIFlagFwdDecl)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !465, file: !466, line: 1221, baseType: !543, size: 64, offset: 1088)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !466, line: 52, flags: DIFlagFwdDecl)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !465, file: !466, line: 1223, baseType: !464, size: 64, offset: 1152)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !465, file: !466, line: 1225, baseType: !106, size: 128, offset: 1216)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !465, file: !466, line: 1226, baseType: !548, size: 64, offset: 1344)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !466, line: 69, size: 320, elements: !550)
!550 = !{!551, !552, !553, !554, !555, !556, !557, !558}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !549, file: !466, line: 70, baseType: !548, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !549, file: !466, line: 70, baseType: !548, size: 64, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !549, file: !466, line: 71, baseType: !7, size: 32, offset: 128)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !549, file: !466, line: 71, baseType: !7, size: 32, offset: 160)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !549, file: !466, line: 72, baseType: !48, size: 32, offset: 192)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !549, file: !466, line: 73, baseType: !151, size: 16, offset: 224)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !549, file: !466, line: 73, baseType: !151, size: 16, offset: 240)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !549, file: !466, line: 74, baseType: !540, size: 64, offset: 256)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !465, file: !466, line: 1227, baseType: !540, size: 64, offset: 1408)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !465, file: !466, line: 1229, baseType: !561, size: 96, offset: 1472)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !354, size: 96, elements: !456)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !465, file: !466, line: 1230, baseType: !561, size: 96, offset: 1568)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !465, file: !466, line: 1231, baseType: !561, size: 96, offset: 1664)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !465, file: !466, line: 1231, baseType: !561, size: 96, offset: 1760)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !465, file: !466, line: 1233, baseType: !7, size: 32, offset: 1856)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !465, file: !466, line: 1234, baseType: !48, size: 32, offset: 1888)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !465, file: !466, line: 1235, baseType: !7, size: 32, offset: 1920)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !465, file: !466, line: 1237, baseType: !151, size: 16, offset: 1952)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !465, file: !466, line: 1239, baseType: !69, size: 8, offset: 1968)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !465, file: !466, line: 1240, baseType: !571, size: 8, offset: 1976)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 8, elements: !572)
!572 = !{!573}
!573 = !DISubrange(count: 1)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !465, file: !466, line: 1242, baseType: !575, size: 64, offset: 1984)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !466, line: 57, flags: DIFlagFwdDecl)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !465, file: !466, line: 1244, baseType: !578, size: 64, offset: 2048)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !466, line: 59, flags: DIFlagFwdDecl)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !465, file: !466, line: 1246, baseType: !581, size: 64, offset: 2112)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !466, line: 1067, size: 5184, elements: !583)
!583 = !{!584, !616, !617, !632, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !654, !752, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !801, !802, !803, !804, !805, !806, !807, !808, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !864}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !582, file: !466, line: 1068, baseType: !585, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !466, line: 934, baseType: !587)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !466, line: 925, size: 576, elements: !588)
!588 = !{!589, !607, !608, !609, !610, !612, !615}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !587, file: !466, line: 926, baseType: !590, size: 320)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !466, line: 830, baseType: !591)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !466, line: 813, size: 320, elements: !592)
!592 = !{!593, !596, !599, !600, !604, !605, !606}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !591, file: !466, line: 814, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !466, line: 51, flags: DIFlagFwdDecl)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !591, file: !466, line: 815, baseType: !597, size: 64, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !466, line: 815, flags: DIFlagFwdDecl)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !591, file: !466, line: 818, baseType: !91, size: 64, offset: 128)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !591, file: !466, line: 819, baseType: !601, size: 32, offset: 192)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !450, size: 32, elements: !602)
!602 = !{!603}
!603 = !DISubrange(count: 4)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !591, file: !466, line: 822, baseType: !48, size: 32, offset: 224)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !591, file: !466, line: 826, baseType: !48, size: 32, offset: 256)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !591, file: !466, line: 829, baseType: !48, size: 32, offset: 288)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !587, file: !466, line: 928, baseType: !151, size: 16, offset: 320)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !587, file: !466, line: 928, baseType: !151, size: 16, offset: 336)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !587, file: !466, line: 929, baseType: !48, size: 32, offset: 352)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !587, file: !466, line: 930, baseType: !611, size: 64, offset: 384)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !587, file: !466, line: 931, baseType: !613, size: 64, offset: 448)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !466, line: 931, flags: DIFlagFwdDecl)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !587, file: !466, line: 933, baseType: !91, size: 64, offset: 512)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !582, file: !466, line: 1069, baseType: !585, size: 64, offset: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !582, file: !466, line: 1070, baseType: !618, size: 64, offset: 128)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !466, line: 916, baseType: !620)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !466, line: 891, size: 704, elements: !621)
!621 = !{!622, !623, !624, !626, !627, !628, !629, !630, !631}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !620, file: !466, line: 892, baseType: !590, size: 320)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !620, file: !466, line: 896, baseType: !48, size: 32, offset: 320)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !620, file: !466, line: 900, baseType: !625, size: 96, offset: 352)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 96, elements: !456)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !620, file: !466, line: 903, baseType: !354, size: 32, offset: 448)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !620, file: !466, line: 906, baseType: !48, size: 32, offset: 480)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !620, file: !466, line: 909, baseType: !354, size: 32, offset: 512)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !620, file: !466, line: 912, baseType: !354, size: 32, offset: 544)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !620, file: !466, line: 914, baseType: !540, size: 64, offset: 576)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !620, file: !466, line: 915, baseType: !91, size: 64, offset: 640)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !582, file: !466, line: 1071, baseType: !633, size: 64, offset: 192)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !466, line: 920, baseType: !635)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !466, line: 918, size: 320, elements: !636)
!636 = !{!637}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !635, file: !466, line: 919, baseType: !590, size: 320)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !582, file: !466, line: 1075, baseType: !354, size: 32, offset: 256)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !582, file: !466, line: 1077, baseType: !354, size: 32, offset: 288)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !582, file: !466, line: 1078, baseType: !354, size: 32, offset: 320)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !582, file: !466, line: 1079, baseType: !151, size: 16, offset: 352)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !582, file: !466, line: 1082, baseType: !151, size: 16, offset: 368)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !582, file: !466, line: 1085, baseType: !69, size: 8, offset: 384)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !582, file: !466, line: 1086, baseType: !69, size: 8, offset: 392)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !582, file: !466, line: 1087, baseType: !69, size: 8, offset: 400)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !582, file: !466, line: 1088, baseType: !69, size: 8, offset: 408)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !582, file: !466, line: 1090, baseType: !354, size: 32, offset: 416)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !582, file: !466, line: 1093, baseType: !151, size: 16, offset: 448)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !582, file: !466, line: 1096, baseType: !69, size: 8, offset: 464)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !582, file: !466, line: 1098, baseType: !651, size: 40, offset: 472)
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 40, elements: !652)
!652 = !{!653}
!653 = !DISubrange(count: 5)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !582, file: !466, line: 1101, baseType: !655, size: 832, offset: 512)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !466, line: 836, size: 832, elements: !656)
!656 = !{!657, !658, !659, !660, !661, !662, !664, !665, !666, !748, !749, !750, !751}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !655, file: !466, line: 837, baseType: !590, size: 320)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !655, file: !466, line: 839, baseType: !151, size: 16, offset: 320)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !655, file: !466, line: 839, baseType: !151, size: 16, offset: 336)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !655, file: !466, line: 842, baseType: !151, size: 16, offset: 352)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !655, file: !466, line: 842, baseType: !151, size: 16, offset: 368)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !655, file: !466, line: 843, baseType: !663, size: 32, offset: 384)
!663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 32, elements: !325)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !655, file: !466, line: 845, baseType: !48, size: 32, offset: 416)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !655, file: !466, line: 847, baseType: !91, size: 64, offset: 448)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !655, file: !466, line: 848, baseType: !667, size: 64, offset: 512)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !669, line: 77, size: 15424, elements: !670)
!669 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!670 = !{!671, !672, !673, !676, !679, !682, !685, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !729, !730, !731, !737, !738, !742}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !668, file: !669, line: 78, baseType: !172, size: 960)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !668, file: !669, line: 80, baseType: !147, size: 8192, offset: 960)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !668, file: !669, line: 82, baseType: !674, size: 64, offset: 9152)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !669, line: 43, flags: DIFlagFwdDecl)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !668, file: !669, line: 83, baseType: !677, size: 64, offset: 9216)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !169, line: 46, flags: DIFlagFwdDecl)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !668, file: !669, line: 86, baseType: !680, size: 64, offset: 9280)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !669, line: 41, flags: DIFlagFwdDecl)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !668, file: !669, line: 87, baseType: !683, size: 64, offset: 9344)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !669, line: 44, flags: DIFlagFwdDecl)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !668, file: !669, line: 89, baseType: !686, size: 512, offset: 9408)
!686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !683, size: 512, elements: !687)
!687 = !{!688}
!688 = !DISubrange(count: 8)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !668, file: !669, line: 90, baseType: !151, size: 16, offset: 9920)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !668, file: !669, line: 90, baseType: !151, size: 16, offset: 9936)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !668, file: !669, line: 92, baseType: !151, size: 16, offset: 9952)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !668, file: !669, line: 92, baseType: !151, size: 16, offset: 9968)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !668, file: !669, line: 93, baseType: !151, size: 16, offset: 9984)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !668, file: !669, line: 93, baseType: !151, size: 16, offset: 10000)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !668, file: !669, line: 94, baseType: !48, size: 32, offset: 10016)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !668, file: !669, line: 97, baseType: !151, size: 16, offset: 10048)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !668, file: !669, line: 97, baseType: !151, size: 16, offset: 10064)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !668, file: !669, line: 98, baseType: !151, size: 16, offset: 10080)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !668, file: !669, line: 98, baseType: !151, size: 16, offset: 10096)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !668, file: !669, line: 99, baseType: !151, size: 16, offset: 10112)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !668, file: !669, line: 99, baseType: !151, size: 16, offset: 10128)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !668, file: !669, line: 100, baseType: !7, size: 32, offset: 10144)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !668, file: !669, line: 101, baseType: !611, size: 64, offset: 10176)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !668, file: !669, line: 103, baseType: !223, size: 64, offset: 10240)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !668, file: !669, line: 104, baseType: !706, size: 64, offset: 10304)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !169, line: 159, size: 448, elements: !708)
!708 = !{!709, !711, !712, !713, !714, !716}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !707, file: !169, line: 161, baseType: !710, size: 64)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !325)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !707, file: !169, line: 162, baseType: !710, size: 64, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !707, file: !169, line: 163, baseType: !663, size: 32, offset: 128)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !707, file: !169, line: 164, baseType: !663, size: 32, offset: 160)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !707, file: !169, line: 165, baseType: !715, size: 128, offset: 192)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !611, size: 128, elements: !325)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !707, file: !169, line: 166, baseType: !717, size: 128, offset: 320)
!717 = !DICompositeType(tag: DW_TAG_array_type, baseType: !677, size: 128, elements: !325)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !668, file: !669, line: 107, baseType: !354, size: 32, offset: 10368)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !668, file: !669, line: 108, baseType: !48, size: 32, offset: 10400)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !668, file: !669, line: 109, baseType: !151, size: 16, offset: 10432)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !668, file: !669, line: 110, baseType: !151, size: 16, offset: 10448)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !668, file: !669, line: 113, baseType: !48, size: 32, offset: 10464)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !668, file: !669, line: 113, baseType: !48, size: 32, offset: 10496)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !668, file: !669, line: 114, baseType: !69, size: 8, offset: 10528)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !668, file: !669, line: 114, baseType: !69, size: 8, offset: 10536)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !668, file: !669, line: 115, baseType: !151, size: 16, offset: 10544)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !668, file: !669, line: 116, baseType: !728, size: 128, offset: 10560)
!728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !354, size: 128, elements: !602)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !668, file: !669, line: 119, baseType: !354, size: 32, offset: 10688)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !668, file: !669, line: 119, baseType: !354, size: 32, offset: 10720)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !668, file: !669, line: 122, baseType: !732, size: 512, offset: 10752)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !733, line: 182, baseType: !734)
!733 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !733, line: 180, size: 512, elements: !735)
!735 = !{!736}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !734, file: !733, line: 181, baseType: !200, size: 512)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !668, file: !669, line: 123, baseType: !69, size: 8, offset: 11264)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !668, file: !669, line: 125, baseType: !739, size: 56, offset: 11272)
!739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 56, elements: !740)
!740 = !{!741}
!741 = !DISubrange(count: 7)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !668, file: !669, line: 126, baseType: !743, size: 4096, offset: 11328)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !744, size: 4096, elements: !687)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !669, line: 69, baseType: !745)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !669, line: 67, size: 512, elements: !746)
!746 = !{!747}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !745, file: !669, line: 68, baseType: !200, size: 512)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !655, file: !466, line: 849, baseType: !667, size: 64, offset: 576)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "canvas", scope: !655, file: !466, line: 850, baseType: !667, size: 64, offset: 640)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "stencil_col", scope: !655, file: !466, line: 851, baseType: !561, size: 96, offset: 704)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !655, file: !466, line: 852, baseType: !354, size: 32, offset: 800)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !582, file: !466, line: 1104, baseType: !753, size: 1344, offset: 1344)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleEditSettings", file: !466, line: 867, size: 1344, elements: !754)
!754 = !{!755, !756, !757, !758, !759, !770, !771, !772, !773, !774, !775, !776, !777, !778}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !753, file: !466, line: 868, baseType: !151, size: 16)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "totrekey", scope: !753, file: !466, line: 869, baseType: !151, size: 16, offset: 16)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "totaddkey", scope: !753, file: !466, line: 870, baseType: !151, size: 16, offset: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "brushtype", scope: !753, file: !466, line: 871, baseType: !151, size: 16, offset: 48)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !753, file: !466, line: 873, baseType: !760, size: 896, offset: 64)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !761, size: 896, elements: !740)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParticleBrushData", file: !466, line: 864, baseType: !762)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleBrushData", file: !466, line: 859, size: 128, elements: !763)
!763 = !{!764, !765, !766, !767, !768, !769}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !762, file: !466, line: 860, baseType: !151, size: 16)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !762, file: !466, line: 861, baseType: !151, size: 16, offset: 16)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !762, file: !466, line: 861, baseType: !151, size: 16, offset: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !762, file: !466, line: 861, baseType: !151, size: 16, offset: 48)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !762, file: !466, line: 862, baseType: !48, size: 32, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !762, file: !466, line: 863, baseType: !354, size: 32, offset: 96)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !753, file: !466, line: 874, baseType: !91, size: 64, offset: 960)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "emitterdist", scope: !753, file: !466, line: 876, baseType: !354, size: 32, offset: 1024)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !753, file: !466, line: 876, baseType: !354, size: 32, offset: 1056)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !753, file: !466, line: 878, baseType: !48, size: 32, offset: 1088)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "edittype", scope: !753, file: !466, line: 879, baseType: !48, size: 32, offset: 1120)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "draw_step", scope: !753, file: !466, line: 881, baseType: !48, size: 32, offset: 1152)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "fade_frames", scope: !753, file: !466, line: 881, baseType: !48, size: 32, offset: 1184)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !753, file: !466, line: 883, baseType: !464, size: 64, offset: 1216)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !753, file: !466, line: 884, baseType: !540, size: 64, offset: 1280)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_size", scope: !582, file: !466, line: 1107, baseType: !354, size: 32, offset: 2688)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "select_thresh", scope: !582, file: !466, line: 1110, baseType: !354, size: 32, offset: 2720)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_mode", scope: !582, file: !466, line: 1113, baseType: !151, size: 16, offset: 2752)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_flag", scope: !582, file: !466, line: 1113, baseType: !151, size: 16, offset: 2768)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "multires_subdiv_type", scope: !582, file: !466, line: 1116, baseType: !69, size: 8, offset: 2784)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !582, file: !466, line: 1117, baseType: !571, size: 8, offset: 2792)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_resolution", scope: !582, file: !466, line: 1120, baseType: !151, size: 16, offset: 2800)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_internal", scope: !582, file: !466, line: 1121, baseType: !354, size: 32, offset: 2816)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_external", scope: !582, file: !466, line: 1122, baseType: !354, size: 32, offset: 2848)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_ratio", scope: !582, file: !466, line: 1123, baseType: !354, size: 32, offset: 2880)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_limit", scope: !582, file: !466, line: 1124, baseType: !354, size: 32, offset: 2912)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_angle_limit", scope: !582, file: !466, line: 1125, baseType: !354, size: 32, offset: 2944)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_correlation_limit", scope: !582, file: !466, line: 1126, baseType: !354, size: 32, offset: 2976)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_symmetry_limit", scope: !582, file: !466, line: 1127, baseType: !354, size: 32, offset: 3008)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_angle_weight", scope: !582, file: !466, line: 1128, baseType: !354, size: 32, offset: 3040)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_length_weight", scope: !582, file: !466, line: 1129, baseType: !354, size: 32, offset: 3072)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_distance_weight", scope: !582, file: !466, line: 1130, baseType: !354, size: 32, offset: 3104)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_options", scope: !582, file: !466, line: 1131, baseType: !151, size: 16, offset: 3136)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro", scope: !582, file: !466, line: 1132, baseType: !69, size: 8, offset: 3152)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro_passes", scope: !582, file: !466, line: 1133, baseType: !69, size: 8, offset: 3160)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivisions", scope: !582, file: !466, line: 1134, baseType: !800, size: 24, offset: 3168)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 24, elements: !456)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_multi_level", scope: !582, file: !466, line: 1135, baseType: !69, size: 8, offset: 3192)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_template", scope: !582, file: !466, line: 1138, baseType: !540, size: 64, offset: 3200)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching", scope: !582, file: !466, line: 1139, baseType: !69, size: 8, offset: 3264)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching_convert", scope: !582, file: !466, line: 1140, baseType: !69, size: 8, offset: 3272)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivision_number", scope: !582, file: !466, line: 1141, baseType: !69, size: 8, offset: 3280)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_options", scope: !582, file: !466, line: 1142, baseType: !69, size: 8, offset: 3288)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_roll", scope: !582, file: !466, line: 1143, baseType: !69, size: 8, offset: 3296)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_side_string", scope: !582, file: !466, line: 1144, baseType: !809, size: 64, offset: 3304)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 64, elements: !687)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_num_string", scope: !582, file: !466, line: 1145, baseType: !809, size: 64, offset: 3368)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode", scope: !582, file: !466, line: 1148, baseType: !69, size: 8, offset: 3432)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode_live_unwrap", scope: !582, file: !466, line: 1149, baseType: !69, size: 8, offset: 3440)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "snap_mode", scope: !582, file: !466, line: 1152, baseType: !69, size: 8, offset: 3448)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "snap_node_mode", scope: !582, file: !466, line: 1152, baseType: !69, size: 8, offset: 3456)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "snap_uv_mode", scope: !582, file: !466, line: 1153, baseType: !69, size: 8, offset: 3464)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "snap_flag", scope: !582, file: !466, line: 1154, baseType: !151, size: 16, offset: 3472)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "snap_target", scope: !582, file: !466, line: 1154, baseType: !151, size: 16, offset: 3488)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "proportional", scope: !582, file: !466, line: 1155, baseType: !151, size: 16, offset: 3504)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "prop_mode", scope: !582, file: !466, line: 1155, baseType: !151, size: 16, offset: 3520)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_objects", scope: !582, file: !466, line: 1156, baseType: !69, size: 8, offset: 3536)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_mask", scope: !582, file: !466, line: 1157, baseType: !69, size: 8, offset: 3544)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "auto_normalize", scope: !582, file: !466, line: 1159, baseType: !69, size: 8, offset: 3552)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "multipaint", scope: !582, file: !466, line: 1160, baseType: !69, size: 8, offset: 3560)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "weightuser", scope: !582, file: !466, line: 1161, baseType: !69, size: 8, offset: 3568)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "vgroupsubset", scope: !582, file: !466, line: 1162, baseType: !69, size: 8, offset: 3576)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "use_uv_sculpt", scope: !582, file: !466, line: 1165, baseType: !48, size: 32, offset: 3584)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "uv_sculpt_settings", scope: !582, file: !466, line: 1166, baseType: !48, size: 32, offset: 3616)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "uv_sculpt_tool", scope: !582, file: !466, line: 1167, baseType: !48, size: 32, offset: 3648)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "uv_relax_method", scope: !582, file: !466, line: 1168, baseType: !48, size: 32, offset: 3680)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_settings", scope: !582, file: !466, line: 1171, baseType: !151, size: 16, offset: 3712)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "pad5", scope: !582, file: !466, line: 1171, baseType: !151, size: 16, offset: 3728)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_size", scope: !582, file: !466, line: 1172, baseType: !48, size: 32, offset: 3744)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_unprojected_radius", scope: !582, file: !466, line: 1173, baseType: !354, size: 32, offset: 3776)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_alpha", scope: !582, file: !466, line: 1174, baseType: !354, size: 32, offset: 3808)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "unified_paint_settings", scope: !582, file: !466, line: 1177, baseType: !836, size: 1024, offset: 3840)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UnifiedPaintSettings", file: !466, line: 963, size: 1024, elements: !837)
!837 = !{!838, !839, !840, !841, !842, !843, !844, !845, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !862, !863}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !836, file: !466, line: 965, baseType: !48, size: 32)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "unprojected_radius", scope: !836, file: !466, line: 968, baseType: !354, size: 32, offset: 32)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !836, file: !466, line: 971, baseType: !354, size: 32, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !836, file: !466, line: 974, baseType: !354, size: 32, offset: 96)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "rgb", scope: !836, file: !466, line: 977, baseType: !561, size: 96, offset: 128)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "secondary_rgb", scope: !836, file: !466, line: 979, baseType: !561, size: 96, offset: 224)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !836, file: !466, line: 982, baseType: !48, size: 32, offset: 320)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "last_rake", scope: !836, file: !466, line: 987, baseType: !846, size: 64, offset: 352)
!846 = !DICompositeType(tag: DW_TAG_array_type, baseType: !354, size: 64, elements: !325)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "brush_rotation", scope: !836, file: !466, line: 989, baseType: !354, size: 32, offset: 416)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "draw_anchored", scope: !836, file: !466, line: 994, baseType: !48, size: 32, offset: 448)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "anchored_size", scope: !836, file: !466, line: 995, baseType: !48, size: 32, offset: 480)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "draw_inverted", scope: !836, file: !466, line: 997, baseType: !69, size: 8, offset: 512)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !836, file: !466, line: 998, baseType: !739, size: 56, offset: 520)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "overlap_factor", scope: !836, file: !466, line: 1000, baseType: !354, size: 32, offset: 576)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "anchored_initial_mouse", scope: !836, file: !466, line: 1003, baseType: !846, size: 64, offset: 608)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "stroke_active", scope: !836, file: !466, line: 1006, baseType: !48, size: 32, offset: 672)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "size_pressure_value", scope: !836, file: !466, line: 1009, baseType: !354, size: 32, offset: 704)
