; ModuleID = 'blender/source/blender/nodes/shader/nodes/node_shader_math.c'
source_filename = "blender/source/blender/nodes/shader/nodes/node_shader_math.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "ntype", scope: !2, file: !3, line: 281, type: !2262, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "register_node_type_sh_math", scope: !3, file: !3, line: 279, type: !4, scopeLine: 280, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !2258)
!3 = !DIFile(filename: "blender/source/blender/nodes/shader/nodes/node_shader_math.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{null}
!6 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !7, retainedTypes: !35, globals: !36, splitDebugInlining: false, nameTableKind: None)
!7 = !{!8, !22}
!8 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "GPUType", file: !9, line: 69, baseType: !10, size: 32, elements: !11)
!9 = !DIFile(filename: "blender/source/blender/gpu/GPU_material.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!10 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21}
!12 = !DIEnumerator(name: "GPU_NONE", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "GPU_FLOAT", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "GPU_VEC2", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "GPU_VEC3", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "GPU_VEC4", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "GPU_MAT3", value: 9, isUnsigned: true)
!18 = !DIEnumerator(name: "GPU_MAT4", value: 16, isUnsigned: true)
!19 = !DIEnumerator(name: "GPU_TEX2D", value: 1002, isUnsigned: true)
!20 = !DIEnumerator(name: "GPU_SHADOW2D", value: 1003, isUnsigned: true)
!21 = !DIEnumerator(name: "GPU_ATTRIB", value: 3001, isUnsigned: true)
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNodeSocketDatatype", file: !23, line: 135, baseType: !24, size: 32, elements: !25)
!23 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!24 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34}
!26 = !DIEnumerator(name: "SOCK_CUSTOM", value: -1)
!27 = !DIEnumerator(name: "SOCK_FLOAT", value: 0)
!28 = !DIEnumerator(name: "SOCK_VECTOR", value: 1)
!29 = !DIEnumerator(name: "SOCK_RGBA", value: 2)
!30 = !DIEnumerator(name: "SOCK_SHADER", value: 3)
!31 = !DIEnumerator(name: "SOCK_BOOLEAN", value: 4)
!32 = !DIEnumerator(name: "__SOCK_MESH", value: 5)
!33 = !DIEnumerator(name: "SOCK_INT", value: 6)
!34 = !DIEnumerator(name: "SOCK_STRING", value: 7)
!35 = !{!24}
!36 = !{!0, !37, !2244, !2247}
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "sh_node_math_in", scope: !6, file: !3, line: 37, type: !39, isLocal: true, isDefinition: true)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 4224, elements: !525)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !41, line: 109, baseType: !42)
!41 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !41, line: 98, size: 1408, elements: !43)
!43 = !{!44, !45, !46, !51, !53, !54, !55, !56, !57, !58, !59, !60, !2243}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !42, file: !41, line: 99, baseType: !24, size: 32)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !42, file: !41, line: 99, baseType: !24, size: 32, offset: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !42, file: !41, line: 100, baseType: !47, size: 512, offset: 64)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 512, elements: !49)
!48 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!49 = !{!50}
!50 = !DISubrange(count: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !42, file: !41, line: 101, baseType: !52, size: 32, offset: 576)
!52 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !42, file: !41, line: 101, baseType: !52, size: 32, offset: 608)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !42, file: !41, line: 101, baseType: !52, size: 32, offset: 640)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !42, file: !41, line: 101, baseType: !52, size: 32, offset: 672)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !42, file: !41, line: 102, baseType: !52, size: 32, offset: 704)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !42, file: !41, line: 102, baseType: !52, size: 32, offset: 736)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !42, file: !41, line: 103, baseType: !24, size: 32, offset: 768)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !42, file: !41, line: 104, baseType: !24, size: 32, offset: 800)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !42, file: !41, line: 107, baseType: !61, size: 64, offset: 832)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !23, line: 87, size: 2816, elements: !63)
!63 = !{!64, !65, !66, !67, !99, !100, !101, !102, !103, !104, !105, !106, !2229, !2230, !2231, !2232, !2233, !2234, !2235, !2236, !2237, !2238, !2239, !2240, !2241}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !62, file: !23, line: 88, baseType: !61, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !62, file: !23, line: 88, baseType: !61, size: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !62, file: !23, line: 88, baseType: !61, size: 64, offset: 128)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !62, file: !23, line: 90, baseType: !68, size: 64, offset: 192)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !70, line: 75, baseType: !71)
!70 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !70, line: 62, size: 1024, elements: !72)
!72 = !{!73, !75, !76, !77, !78, !80, !81, !82, !97, !98}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !71, file: !70, line: 63, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !71, file: !70, line: 63, baseType: !74, size: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !71, file: !70, line: 64, baseType: !48, size: 8, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !71, file: !70, line: 64, baseType: !48, size: 8, offset: 136)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !71, file: !70, line: 65, baseType: !79, size: 16, offset: 144)
!79 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !71, file: !70, line: 66, baseType: !47, size: 512, offset: 160)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !71, file: !70, line: 67, baseType: !24, size: 32, offset: 672)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !71, file: !70, line: 69, baseType: !83, size: 256, offset: 704)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !70, line: 60, baseType: !84)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !70, line: 48, size: 256, elements: !85)
!85 = !{!86, !88, !95, !96}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !84, file: !70, line: 49, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !84, file: !70, line: 58, baseType: !89, size: 128, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !90, line: 71, baseType: !91)
!90 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !90, line: 69, size: 128, elements: !92)
!92 = !{!93, !94}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !91, file: !90, line: 70, baseType: !87, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !91, file: !90, line: 70, baseType: !87, size: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !84, file: !70, line: 59, baseType: !24, size: 32, offset: 192)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !84, file: !70, line: 59, baseType: !24, size: 32, offset: 224)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !71, file: !70, line: 70, baseType: !24, size: 32, offset: 960)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !71, file: !70, line: 74, baseType: !24, size: 32, offset: 992)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !62, file: !23, line: 92, baseType: !47, size: 512, offset: 256)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !62, file: !23, line: 94, baseType: !47, size: 512, offset: 768)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !62, file: !23, line: 99, baseType: !87, size: 64, offset: 1280)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !62, file: !23, line: 101, baseType: !79, size: 16, offset: 1344)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !62, file: !23, line: 101, baseType: !79, size: 16, offset: 1360)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !62, file: !23, line: 102, baseType: !79, size: 16, offset: 1376)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !62, file: !23, line: 103, baseType: !79, size: 16, offset: 1392)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !62, file: !23, line: 104, baseType: !107, size: 64, offset: 1408)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !41, line: 114, size: 1600, elements: !109)
!109 = !{!110, !111, !134, !139, !143, !147, !2216, !2220, !2221, !2225, !2226, !2227, !2228}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !108, file: !41, line: 115, baseType: !47, size: 512)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !108, file: !41, line: 117, baseType: !112, size: 64, offset: 512)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{null, !115, !118, !120, !120, !132}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !117, line: 60, flags: DIFlagFwdDecl)
!117 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_blender.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !41, line: 73, flags: DIFlagFwdDecl)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !122, line: 55, size: 192, elements: !123)
!122 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!123 = !{!124, !128, !131}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !121, file: !122, line: 58, baseType: !125, size: 64)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !121, file: !122, line: 56, size: 64, elements: !126)
!126 = !{!127}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !125, file: !122, line: 57, baseType: !87, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !121, file: !122, line: 60, baseType: !129, size: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !23, line: 335, flags: DIFlagFwdDecl)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !121, file: !122, line: 61, baseType: !87, size: 64, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "draw_color", scope: !108, file: !41, line: 118, baseType: !135, size: 64, offset: 576)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{null, !115, !120, !120, !138}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw", scope: !108, file: !41, line: 120, baseType: !140, size: 64, offset: 640)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{null, !115, !118, !120}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw_color", scope: !108, file: !41, line: 121, baseType: !144, size: 64, offset: 704)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{null, !115, !120, !138}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "interface_register_properties", scope: !108, file: !41, line: 122, baseType: !148, size: 64, offset: 768)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{null, !151, !61, !129}
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !23, line: 328, size: 3456, elements: !153)
!153 = !{!154, !190, !194, !2172, !2173, !2174, !2175, !2176, !2177, !2178, !2179, !2180, !2181, !2182, !2183, !2184, !2185, !2186, !2187, !2188, !2189, !2190, !2191, !2192, !2193, !2194, !2195, !2196, !2199, !2203, !2207, !2211, !2212, !2213, !2214, !2215}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !152, file: !23, line: 329, baseType: !155, size: 960)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !70, line: 130, baseType: !156)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !70, line: 117, size: 960, elements: !157)
!157 = !{!158, !159, !160, !162, !181, !185, !186, !187, !188, !189}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !156, file: !70, line: 118, baseType: !87, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !156, file: !70, line: 118, baseType: !87, size: 64, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !156, file: !70, line: 119, baseType: !161, size: 64, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !156, file: !70, line: 120, baseType: !163, size: 64, offset: 192)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !70, line: 136, size: 17600, elements: !165)
!165 = !{!166, !167, !169, !172, !176, !177, !178}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !164, file: !70, line: 137, baseType: !155, size: 960)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !164, file: !70, line: 138, baseType: !168, size: 64, offset: 960)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !164, file: !70, line: 139, baseType: !170, size: 64, offset: 1024)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !70, line: 43, flags: DIFlagFwdDecl)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !164, file: !70, line: 140, baseType: !173, size: 8192, offset: 1088)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 8192, elements: !174)
!174 = !{!175}
!175 = !DISubrange(count: 1024)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !164, file: !70, line: 141, baseType: !173, size: 8192, offset: 9280)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !164, file: !70, line: 148, baseType: !163, size: 64, offset: 17472)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !164, file: !70, line: 150, baseType: !179, size: 64, offset: 17536)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !70, line: 45, flags: DIFlagFwdDecl)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !156, file: !70, line: 121, baseType: !182, size: 528, offset: 256)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 528, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 66)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !156, file: !70, line: 126, baseType: !79, size: 16, offset: 784)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !156, file: !70, line: 127, baseType: !24, size: 32, offset: 800)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !156, file: !70, line: 128, baseType: !24, size: 32, offset: 832)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !156, file: !70, line: 128, baseType: !24, size: 32, offset: 864)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !156, file: !70, line: 129, baseType: !68, size: 64, offset: 896)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !152, file: !23, line: 330, baseType: !191, size: 64, offset: 960)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !193, line: 48, flags: DIFlagFwdDecl)
!193 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!194 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !152, file: !23, line: 332, baseType: !195, size: 64, offset: 1024)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !41, line: 283, size: 4096, elements: !197)
!197 = !{!198, !199, !200, !201, !205, !206, !210, !566, !2134, !2138, !2144, !2148, !2149, !2150, !2151, !2170, !2171}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !196, file: !41, line: 284, baseType: !24, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !196, file: !41, line: 285, baseType: !47, size: 512, offset: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !196, file: !41, line: 287, baseType: !47, size: 512, offset: 544)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !196, file: !41, line: 288, baseType: !202, size: 2048, offset: 1056)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 2048, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 256)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !196, file: !41, line: 289, baseType: !24, size: 32, offset: 3104)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !196, file: !41, line: 292, baseType: !207, size: 64, offset: 3136)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{null, !151}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !196, file: !41, line: 293, baseType: !211, size: 64, offset: 3200)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{null, !151, !214}
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !23, line: 167, size: 3712, elements: !216)
!216 = !{!217, !218, !219, !220, !221, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !558, !559, !560, !561, !562, !563}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !215, file: !23, line: 168, baseType: !214, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !215, file: !23, line: 168, baseType: !214, size: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !215, file: !23, line: 168, baseType: !214, size: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !215, file: !23, line: 170, baseType: !68, size: 64, offset: 192)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !215, file: !23, line: 172, baseType: !222, size: 64, offset: 256)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !41, line: 144, size: 6016, elements: !224)
!224 = !{!225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !244, !245, !246, !260, !264, !268, !269, !353, !358, !362, !363, !364, !365, !369, !370, !374, !378, !382, !386, !390, !394, !398, !399, !418, !423, !466, !486}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !223, file: !41, line: 145, baseType: !87, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !223, file: !41, line: 145, baseType: !87, size: 64, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !223, file: !41, line: 146, baseType: !79, size: 16, offset: 128)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !223, file: !41, line: 148, baseType: !47, size: 512, offset: 144)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !223, file: !41, line: 149, baseType: !24, size: 32, offset: 672)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !223, file: !41, line: 151, baseType: !47, size: 512, offset: 704)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !223, file: !41, line: 152, baseType: !202, size: 2048, offset: 1216)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !223, file: !41, line: 153, baseType: !24, size: 32, offset: 3264)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !223, file: !41, line: 155, baseType: !52, size: 32, offset: 3296)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !223, file: !41, line: 155, baseType: !52, size: 32, offset: 3328)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !223, file: !41, line: 155, baseType: !52, size: 32, offset: 3360)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !223, file: !41, line: 156, baseType: !52, size: 32, offset: 3392)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !223, file: !41, line: 156, baseType: !52, size: 32, offset: 3424)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !223, file: !41, line: 156, baseType: !52, size: 32, offset: 3456)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !223, file: !41, line: 157, baseType: !79, size: 16, offset: 3488)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !223, file: !41, line: 157, baseType: !79, size: 16, offset: 3504)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !223, file: !41, line: 157, baseType: !79, size: 16, offset: 3520)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !223, file: !41, line: 160, baseType: !243, size: 64, offset: 3584)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !223, file: !41, line: 160, baseType: !243, size: 64, offset: 3648)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "storagename", scope: !223, file: !41, line: 162, baseType: !47, size: 512, offset: 3712)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype", scope: !223, file: !41, line: 165, baseType: !247, size: 64, offset: 4224)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{null, !250, !252, !254, !151, !214, !256}
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !116)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !41, line: 81, flags: DIFlagFwdDecl)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceNode", file: !23, line: 43, flags: DIFlagFwdDecl)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !23, line: 274, baseType: !257)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !23, line: 271, size: 32, elements: !258)
!258 = !{!259}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !257, file: !23, line: 273, baseType: !10, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype_prepare", scope: !223, file: !41, line: 168, baseType: !261, size: 64, offset: 4288)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{null, !250, !151, !214}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons", scope: !223, file: !41, line: 171, baseType: !265, size: 64, offset: 4352)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{null, !118, !115, !120}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons_ex", scope: !223, file: !41, line: 173, baseType: !265, size: 64, offset: 4416)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "draw_backdrop", scope: !223, file: !41, line: 176, baseType: !270, size: 64, offset: 4480)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{null, !254, !273, !214, !24, !24}
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !275, line: 70, size: 19840, elements: !276)
!275 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!276 = !{!277, !278, !279, !280, !281, !283, !284, !285, !286, !288, !289, !294, !295, !296, !297, !298, !300, !302, !303, !304, !308, !309, !310, !311, !312, !315, !316, !317, !318, !319, !322, !323, !325, !326, !327, !331, !332, !333, !336, !337, !346}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !274, file: !275, line: 71, baseType: !273, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !274, file: !275, line: 71, baseType: !273, size: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !274, file: !275, line: 74, baseType: !24, size: 32, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !274, file: !275, line: 74, baseType: !24, size: 32, offset: 160)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !274, file: !275, line: 79, baseType: !282, size: 8, offset: 192)
!282 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !274, file: !275, line: 80, baseType: !24, size: 32, offset: 224)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !274, file: !275, line: 83, baseType: !24, size: 32, offset: 256)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "mall", scope: !274, file: !275, line: 84, baseType: !24, size: 32, offset: 288)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !274, file: !275, line: 87, baseType: !287, size: 64, offset: 320)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "rect_float", scope: !274, file: !275, line: 88, baseType: !138, size: 64, offset: 384)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "ppm", scope: !274, file: !275, line: 93, baseType: !290, size: 128, offset: 448)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 128, elements: !292)
!291 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!292 = !{!293}
!293 = !DISubrange(count: 2)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "tilex", scope: !274, file: !275, line: 96, baseType: !24, size: 32, offset: 576)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tiley", scope: !274, file: !275, line: 96, baseType: !24, size: 32, offset: 608)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "xtiles", scope: !274, file: !275, line: 97, baseType: !24, size: 32, offset: 640)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ytiles", scope: !274, file: !275, line: 97, baseType: !24, size: 32, offset: 672)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tiles", scope: !274, file: !275, line: 98, baseType: !299, size: 64, offset: 704)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !274, file: !275, line: 101, baseType: !301, size: 64, offset: 768)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_float", scope: !274, file: !275, line: 102, baseType: !138, size: 64, offset: 832)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !274, file: !275, line: 105, baseType: !52, size: 32, offset: 896)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "mipmap", scope: !274, file: !275, line: 108, baseType: !305, size: 1280, offset: 960)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !273, size: 1280, elements: !306)
!306 = !{!307}
!307 = !DISubrange(count: 20)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "miptot", scope: !274, file: !275, line: 109, baseType: !24, size: 32, offset: 2240)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "miplevel", scope: !274, file: !275, line: 109, baseType: !24, size: 32, offset: 2272)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !274, file: !275, line: 112, baseType: !24, size: 32, offset: 2304)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "userflags", scope: !274, file: !275, line: 113, baseType: !24, size: 32, offset: 2336)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !274, file: !275, line: 114, baseType: !313, size: 64, offset: 2368)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImMetaData", file: !275, line: 50, flags: DIFlagFwdDecl)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !274, file: !275, line: 115, baseType: !87, size: 64, offset: 2432)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !274, file: !275, line: 118, baseType: !24, size: 32, offset: 2496)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !274, file: !275, line: 119, baseType: !173, size: 8192, offset: 2528)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "cachename", scope: !274, file: !275, line: 120, baseType: !173, size: 8192, offset: 10720)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "c_handle", scope: !274, file: !275, line: 123, baseType: !320, size: 64, offset: 18944)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DICompositeType(tag: DW_TAG_structure_type, name: "MEM_CacheLimiterHandle_s", file: !275, line: 123, flags: DIFlagFwdDecl)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "refcounter", scope: !274, file: !275, line: 124, baseType: !24, size: 32, offset: 19008)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffer", scope: !274, file: !275, line: 127, baseType: !324, size: 64, offset: 19072)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "encodedsize", scope: !274, file: !275, line: 128, baseType: !10, size: 32, offset: 19136)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffersize", scope: !274, file: !275, line: 129, baseType: !10, size: 32, offset: 19168)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "rect_colorspace", scope: !274, file: !275, line: 132, baseType: !328, size: 64, offset: 19200)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !330, line: 63, flags: DIFlagFwdDecl)
!330 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!331 = !DIDerivedType(tag: DW_TAG_member, name: "float_colorspace", scope: !274, file: !275, line: 133, baseType: !328, size: 64, offset: 19264)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer_flags", scope: !274, file: !275, line: 134, baseType: !287, size: 64, offset: 19328)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_cache", scope: !274, file: !275, line: 135, baseType: !334, size: 64, offset: 19392)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColormanageCache", file: !275, line: 135, flags: DIFlagFwdDecl)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_flag", scope: !274, file: !275, line: 136, baseType: !24, size: 32, offset: 19456)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_rect", scope: !274, file: !275, line: 137, baseType: !338, size: 128, offset: 19488)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !339, line: 89, baseType: !340)
!339 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !339, line: 86, size: 128, elements: !341)
!341 = !{!342, !343, !344, !345}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !340, file: !339, line: 87, baseType: !24, size: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !340, file: !339, line: 87, baseType: !24, size: 32, offset: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !340, file: !339, line: 88, baseType: !24, size: 32, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !340, file: !339, line: 88, baseType: !24, size: 32, offset: 96)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "dds_data", scope: !274, file: !275, line: 140, baseType: !347, size: 192, offset: 19648)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DDSData", file: !275, line: 55, size: 192, elements: !348)
!348 = !{!349, !350, !351, !352}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "fourcc", scope: !347, file: !275, line: 56, baseType: !10, size: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "nummipmaps", scope: !347, file: !275, line: 57, baseType: !10, size: 32, offset: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !347, file: !275, line: 58, baseType: !324, size: 64, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !347, file: !275, line: 59, baseType: !10, size: 32, offset: 128)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "labelfunc", scope: !223, file: !41, line: 179, baseType: !354, size: 64, offset: 4544)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DISubroutineType(types: !356)
!356 = !{null, !151, !214, !357, !24}
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "resize_area_func", scope: !223, file: !41, line: 181, baseType: !359, size: 64, offset: 4608)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!24, !214, !24, !24}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "select_area_func", scope: !223, file: !41, line: 183, baseType: !359, size: 64, offset: 4672)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "tweak_area_func", scope: !223, file: !41, line: 185, baseType: !359, size: 64, offset: 4736)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "updatefunc", scope: !223, file: !41, line: 188, baseType: !211, size: 64, offset: 4800)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "verifyfunc", scope: !223, file: !41, line: 190, baseType: !366, size: 64, offset: 4864)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DISubroutineType(types: !368)
!368 = !{null, !151, !214, !161}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "initfunc", scope: !223, file: !41, line: 193, baseType: !211, size: 64, offset: 4928)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "freefunc", scope: !223, file: !41, line: 195, baseType: !371, size: 64, offset: 4992)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{null, !214}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "copyfunc", scope: !223, file: !41, line: 197, baseType: !375, size: 64, offset: 5056)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{null, !151, !214, !214}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "initfunc_api", scope: !223, file: !41, line: 200, baseType: !379, size: 64, offset: 5120)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{null, !250, !120}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "freefunc_api", scope: !223, file: !41, line: 201, baseType: !383, size: 64, offset: 5184)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{null, !120}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "copyfunc_api", scope: !223, file: !41, line: 202, baseType: !387, size: 64, offset: 5248)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{null, !120, !214}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !223, file: !41, line: 205, baseType: !391, size: 64, offset: 5312)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{!24, !222, !151}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "poll_instance", scope: !223, file: !41, line: 207, baseType: !395, size: 64, offset: 5376)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!24, !214, !151}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "update_internal_links", scope: !223, file: !41, line: 210, baseType: !211, size: 64, offset: 5440)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "initexecfunc", scope: !223, file: !41, line: 213, baseType: !400, size: 64, offset: 5504)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeInitExecFunction", file: !41, line: 135, baseType: !401)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!87, !404, !214, !256}
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeExecContext", file: !406, line: 54, size: 64, elements: !407)
!406 = !DIFile(filename: "blender/source/blender/nodes/intern/node_util.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!407 = !{!408}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !405, file: !406, line: 55, baseType: !409, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !41, line: 500, size: 64, elements: !411)
!411 = !{!412}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !410, file: !41, line: 502, baseType: !413, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !415, line: 48, baseType: !416)
!415 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !417, line: 47, flags: DIFlagFwdDecl)
!417 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!418 = !DIDerivedType(tag: DW_TAG_member, name: "freeexecfunc", scope: !223, file: !41, line: 214, baseType: !419, size: 64, offset: 5568)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeFreeExecFunction", file: !41, line: 136, baseType: !420)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{null, !87}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "execfunc", scope: !223, file: !41, line: 215, baseType: !424, size: 64, offset: 5632)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeExecFunction", file: !41, line: 137, baseType: !425)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DISubroutineType(types: !427)
!427 = !{null, !87, !24, !214, !428, !447, !447}
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeExecData", file: !406, line: 58, size: 128, elements: !430)
!430 = !{!431, !432}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !429, file: !406, line: 59, baseType: !87, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !429, file: !406, line: 60, baseType: !433, size: 64, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodePreview", file: !23, line: 289, size: 192, elements: !435)
!435 = !{!436, !443, !444, !445, !446}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "hash_entry", scope: !434, file: !23, line: 290, baseType: !437, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceHashEntry", file: !23, line: 286, baseType: !438)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHashEntry", file: !23, line: 280, size: 64, elements: !439)
!439 = !{!440, !441, !442}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !438, file: !23, line: 281, baseType: !256, size: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !438, file: !23, line: 284, baseType: !79, size: 16, offset: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !438, file: !23, line: 285, baseType: !79, size: 16, offset: 48)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !434, file: !23, line: 292, baseType: !324, size: 64, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "xsize", scope: !434, file: !23, line: 293, baseType: !79, size: 16, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "ysize", scope: !434, file: !23, line: 293, baseType: !79, size: 16, offset: 144)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !434, file: !23, line: 294, baseType: !24, size: 32, offset: 160)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeStack", file: !23, line: 62, size: 384, elements: !450)
!450 = !{!451, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !449, file: !23, line: 63, baseType: !452, size: 128)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 128, elements: !453)
!453 = !{!454}
!454 = !DISubrange(count: 4)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !449, file: !23, line: 64, baseType: !52, size: 32, offset: 128)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !449, file: !23, line: 64, baseType: !52, size: 32, offset: 160)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !449, file: !23, line: 65, baseType: !87, size: 64, offset: 192)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "hasinput", scope: !449, file: !23, line: 66, baseType: !79, size: 16, offset: 256)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "hasoutput", scope: !449, file: !23, line: 67, baseType: !79, size: 16, offset: 272)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !449, file: !23, line: 68, baseType: !79, size: 16, offset: 288)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "sockettype", scope: !449, file: !23, line: 69, baseType: !79, size: 16, offset: 304)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !449, file: !23, line: 70, baseType: !79, size: 16, offset: 320)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !449, file: !23, line: 71, baseType: !79, size: 16, offset: 336)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !449, file: !23, line: 72, baseType: !465, size: 32, offset: 352)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 32, elements: !292)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "gpufunc", scope: !223, file: !41, line: 217, baseType: !467, size: 64, offset: 5696)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeGPUExecFunction", file: !41, line: 138, baseType: !468)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{!24, !471, !214, !428, !473, !473}
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUMaterial", file: !41, line: 64, flags: DIFlagFwdDecl)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GPUNodeStack", file: !9, line: 106, size: 384, elements: !475)
!475 = !{!476, !478, !479, !480, !483, !484, !485}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !474, file: !9, line: 107, baseType: !477, size: 32)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPUType", file: !9, line: 80, baseType: !8)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !474, file: !9, line: 108, baseType: !132, size: 64, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !474, file: !9, line: 109, baseType: !452, size: 128, offset: 128)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !474, file: !9, line: 110, baseType: !481, size: 64, offset: 256)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUNodeLink", file: !9, line: 55, flags: DIFlagFwdDecl)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "hasinput", scope: !474, file: !9, line: 111, baseType: !282, size: 8, offset: 320)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "hasoutput", scope: !474, file: !9, line: 112, baseType: !282, size: 8, offset: 328)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "sockettype", scope: !474, file: !9, line: 113, baseType: !79, size: 16, offset: 336)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !223, file: !41, line: 220, baseType: !487, size: 256, offset: 5760)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !122, line: 436, baseType: !488)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !122, line: 430, size: 256, elements: !489)
!489 = !{!490, !491, !494, !510}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !488, file: !122, line: 431, baseType: !87, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !488, file: !122, line: 432, baseType: !492, size: 64, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !122, line: 417, baseType: !130)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !488, file: !122, line: 433, baseType: !495, size: 64, offset: 128)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !122, line: 408, baseType: !496)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DISubroutineType(types: !498)
!498 = !{!24, !115, !120, !499, !501}
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !122, line: 38, flags: DIFlagFwdDecl)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !122, line: 348, baseType: !503)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !122, line: 337, size: 256, elements: !504)
!504 = !{!505, !506, !507, !508, !509}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !503, file: !122, line: 339, baseType: !87, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !503, file: !122, line: 342, baseType: !499, size: 64, offset: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !503, file: !122, line: 345, baseType: !24, size: 32, offset: 128)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !503, file: !122, line: 347, baseType: !24, size: 32, offset: 160)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !503, file: !122, line: 347, baseType: !24, size: 32, offset: 192)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !488, file: !122, line: 434, baseType: !511, size: 64, offset: 192)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !122, line: 409, baseType: !420)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !215, file: !23, line: 173, baseType: !47, size: 512, offset: 320)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !215, file: !23, line: 175, baseType: !47, size: 512, offset: 832)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !215, file: !23, line: 176, baseType: !24, size: 32, offset: 1344)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !215, file: !23, line: 177, baseType: !79, size: 16, offset: 1376)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !215, file: !23, line: 177, baseType: !79, size: 16, offset: 1392)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !215, file: !23, line: 178, baseType: !79, size: 16, offset: 1408)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !215, file: !23, line: 178, baseType: !79, size: 16, offset: 1424)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "lasty", scope: !215, file: !23, line: 179, baseType: !79, size: 16, offset: 1440)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "menunr", scope: !215, file: !23, line: 179, baseType: !79, size: 16, offset: 1456)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "stack_index", scope: !215, file: !23, line: 180, baseType: !79, size: 16, offset: 1472)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !215, file: !23, line: 181, baseType: !79, size: 16, offset: 1488)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !215, file: !23, line: 182, baseType: !524, size: 96, offset: 1504)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 96, elements: !525)
!525 = !{!526}
!526 = !DISubrange(count: 3)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !215, file: !23, line: 184, baseType: !89, size: 128, offset: 1600)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !215, file: !23, line: 184, baseType: !89, size: 128, offset: 1728)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !215, file: !23, line: 185, baseType: !214, size: 64, offset: 1856)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !215, file: !23, line: 186, baseType: !161, size: 64, offset: 1920)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !215, file: !23, line: 187, baseType: !87, size: 64, offset: 1984)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "original", scope: !215, file: !23, line: 188, baseType: !214, size: 64, offset: 2048)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "internal_links", scope: !215, file: !23, line: 189, baseType: !89, size: 128, offset: 2112)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !215, file: !23, line: 191, baseType: !52, size: 32, offset: 2240)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !215, file: !23, line: 191, baseType: !52, size: 32, offset: 2272)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !215, file: !23, line: 192, baseType: !52, size: 32, offset: 2304)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !215, file: !23, line: 192, baseType: !52, size: 32, offset: 2336)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "miniwidth", scope: !215, file: !23, line: 193, baseType: !52, size: 32, offset: 2368)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "offsetx", scope: !215, file: !23, line: 194, baseType: !52, size: 32, offset: 2400)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "offsety", scope: !215, file: !23, line: 194, baseType: !52, size: 32, offset: 2432)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !215, file: !23, line: 196, baseType: !24, size: 32, offset: 2464)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !215, file: !23, line: 198, baseType: !47, size: 512, offset: 2496)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "custom1", scope: !215, file: !23, line: 199, baseType: !79, size: 16, offset: 3008)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "custom2", scope: !215, file: !23, line: 199, baseType: !79, size: 16, offset: 3024)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "custom3", scope: !215, file: !23, line: 200, baseType: !52, size: 32, offset: 3040)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "custom4", scope: !215, file: !23, line: 200, baseType: !52, size: 32, offset: 3072)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "need_exec", scope: !215, file: !23, line: 202, baseType: !79, size: 16, offset: 3104)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !215, file: !23, line: 202, baseType: !79, size: 16, offset: 3120)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "threaddata", scope: !215, file: !23, line: 203, baseType: !87, size: 64, offset: 3136)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "totr", scope: !215, file: !23, line: 204, baseType: !551, size: 128, offset: 3200)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !339, line: 95, baseType: !552)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !339, line: 92, size: 128, elements: !553)
!553 = !{!554, !555, !556, !557}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !552, file: !339, line: 93, baseType: !52, size: 32)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !552, file: !339, line: 93, baseType: !52, size: 32, offset: 32)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !552, file: !339, line: 94, baseType: !52, size: 32, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !552, file: !339, line: 94, baseType: !52, size: 32, offset: 96)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "butr", scope: !215, file: !23, line: 205, baseType: !551, size: 128, offset: 3328)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "prvr", scope: !215, file: !23, line: 206, baseType: !551, size: 128, offset: 3456)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "preview_xsize", scope: !215, file: !23, line: 215, baseType: !79, size: 16, offset: 3584)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "preview_ysize", scope: !215, file: !23, line: 215, baseType: !79, size: 16, offset: 3600)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !215, file: !23, line: 216, baseType: !24, size: 32, offset: 3616)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !215, file: !23, line: 217, baseType: !564, size: 64, offset: 3648)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiBlock", file: !23, line: 51, flags: DIFlagFwdDecl)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "foreach_nodeclass", scope: !196, file: !41, line: 294, baseType: !567, size: 64, offset: 3264)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DISubroutineType(types: !569)
!569 = !{null, !570, !87, !2130}
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !330, line: 1216, size: 39680, elements: !572)
!572 = !{!573, !574, !575, !1436, !1517, !1518, !1519, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1546, !1758, !1761, !2004, !2016, !2017, !2018, !2019, !2020, !2021, !2022, !2023, !2026, !2027, !2028, !2029, !2030, !2038, !2104, !2111, !2112, !2119, !2122, !2123, !2124, !2125, !2126, !2127}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !571, file: !330, line: 1217, baseType: !155, size: 960)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !571, file: !330, line: 1218, baseType: !191, size: 64, offset: 960)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !571, file: !330, line: 1220, baseType: !576, size: 64, offset: 1024)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !578, line: 115, size: 11392, elements: !579)
!578 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!579 = !{!580, !581, !582, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !599, !609, !622, !623, !663, !664, !667, !668, !684, !685, !686, !687, !688, !689, !690, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1383, !1386, !1387, !1388, !1389, !1390, !1391, !1394, !1397, !1400, !1401, !1407, !1408, !1409, !1410, !1411, !1412, !1414, !1417, !1420, !1421, !1424, !1425}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !577, file: !578, line: 116, baseType: !155, size: 960)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !577, file: !578, line: 117, baseType: !191, size: 64, offset: 960)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !577, file: !578, line: 119, baseType: !583, size: 64, offset: 1024)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !578, line: 57, flags: DIFlagFwdDecl)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !577, file: !578, line: 121, baseType: !79, size: 16, offset: 1088)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !577, file: !578, line: 121, baseType: !79, size: 16, offset: 1104)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !577, file: !578, line: 122, baseType: !24, size: 32, offset: 1120)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !577, file: !578, line: 122, baseType: !24, size: 32, offset: 1152)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !577, file: !578, line: 122, baseType: !24, size: 32, offset: 1184)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !577, file: !578, line: 123, baseType: !47, size: 512, offset: 1216)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !577, file: !578, line: 124, baseType: !576, size: 64, offset: 1728)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !577, file: !578, line: 124, baseType: !576, size: 64, offset: 1792)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !577, file: !578, line: 127, baseType: !576, size: 64, offset: 1856)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !577, file: !578, line: 127, baseType: !576, size: 64, offset: 1920)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !577, file: !578, line: 127, baseType: !576, size: 64, offset: 1984)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !577, file: !578, line: 128, baseType: !597, size: 64, offset: 2048)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !193, line: 49, flags: DIFlagFwdDecl)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !577, file: !578, line: 130, baseType: !600, size: 64, offset: 2112)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !578, line: 97, size: 832, elements: !602)
!602 = !{!603, !607, !608}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !601, file: !578, line: 98, baseType: !604, size: 768)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 768, elements: !605)
!605 = !{!606, !526}
!606 = !DISubrange(count: 8)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !601, file: !578, line: 99, baseType: !24, size: 32, offset: 768)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !601, file: !578, line: 99, baseType: !24, size: 32, offset: 800)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !577, file: !578, line: 131, baseType: !610, size: 64, offset: 2176)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !417, line: 486, size: 1600, elements: !612)
!612 = !{!613, !614, !615, !616, !617, !618, !619, !620, !621}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !611, file: !417, line: 487, baseType: !155, size: 960)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !611, file: !417, line: 489, baseType: !89, size: 128, offset: 960)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !611, file: !417, line: 490, baseType: !89, size: 128, offset: 1088)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !611, file: !417, line: 491, baseType: !89, size: 128, offset: 1216)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !611, file: !417, line: 492, baseType: !89, size: 128, offset: 1344)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !611, file: !417, line: 494, baseType: !24, size: 32, offset: 1472)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !611, file: !417, line: 495, baseType: !24, size: 32, offset: 1504)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !611, file: !417, line: 497, baseType: !24, size: 32, offset: 1536)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !611, file: !417, line: 498, baseType: !24, size: 32, offset: 1568)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !577, file: !578, line: 132, baseType: !610, size: 64, offset: 2240)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !577, file: !578, line: 133, baseType: !624, size: 64, offset: 2304)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !417, line: 334, size: 1728, elements: !626)
!626 = !{!627, !628, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !662}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !625, file: !417, line: 335, baseType: !89, size: 128)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !625, file: !417, line: 336, baseType: !629, size: 64, offset: 128)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !625, file: !417, line: 338, baseType: !79, size: 16, offset: 192)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !625, file: !417, line: 338, baseType: !79, size: 16, offset: 208)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !625, file: !417, line: 339, baseType: !10, size: 32, offset: 224)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !625, file: !417, line: 340, baseType: !24, size: 32, offset: 256)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !625, file: !417, line: 342, baseType: !52, size: 32, offset: 288)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !625, file: !417, line: 343, baseType: !524, size: 96, offset: 320)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !625, file: !417, line: 344, baseType: !524, size: 96, offset: 416)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !625, file: !417, line: 347, baseType: !89, size: 128, offset: 512)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !625, file: !417, line: 349, baseType: !24, size: 32, offset: 640)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !625, file: !417, line: 350, baseType: !24, size: 32, offset: 672)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !625, file: !417, line: 351, baseType: !87, size: 64, offset: 704)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !625, file: !417, line: 352, baseType: !87, size: 64, offset: 768)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !625, file: !417, line: 354, baseType: !643, size: 384, offset: 832)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !417, line: 116, baseType: !644)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !417, line: 94, size: 384, elements: !645)
!645 = !{!646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !644, file: !417, line: 96, baseType: !24, size: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !644, file: !417, line: 96, baseType: !24, size: 32, offset: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !644, file: !417, line: 97, baseType: !24, size: 32, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !644, file: !417, line: 97, baseType: !24, size: 32, offset: 96)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !644, file: !417, line: 99, baseType: !79, size: 16, offset: 128)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !644, file: !417, line: 100, baseType: !79, size: 16, offset: 144)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !644, file: !417, line: 102, baseType: !79, size: 16, offset: 160)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !644, file: !417, line: 105, baseType: !79, size: 16, offset: 176)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !644, file: !417, line: 108, baseType: !79, size: 16, offset: 192)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !644, file: !417, line: 109, baseType: !79, size: 16, offset: 208)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !644, file: !417, line: 111, baseType: !79, size: 16, offset: 224)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !644, file: !417, line: 112, baseType: !79, size: 16, offset: 240)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !644, file: !417, line: 114, baseType: !24, size: 32, offset: 256)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !644, file: !417, line: 114, baseType: !24, size: 32, offset: 288)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !644, file: !417, line: 115, baseType: !24, size: 32, offset: 320)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !644, file: !417, line: 115, baseType: !24, size: 32, offset: 352)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !625, file: !417, line: 355, baseType: !47, size: 512, offset: 1216)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !577, file: !578, line: 134, baseType: !87, size: 64, offset: 2368)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !577, file: !578, line: 136, baseType: !665, size: 64, offset: 2432)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !330, line: 61, flags: DIFlagFwdDecl)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !577, file: !578, line: 138, baseType: !643, size: 384, offset: 2496)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !577, file: !578, line: 139, baseType: !669, size: 64, offset: 2880)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !417, line: 80, baseType: !671)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !417, line: 72, size: 192, elements: !672)
!672 = !{!673, !680, !681, !682, !683}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !671, file: !417, line: 73, baseType: !674, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !417, line: 59, baseType: !676)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !417, line: 56, size: 128, elements: !677)
!677 = !{!678, !679}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !676, file: !417, line: 57, baseType: !524, size: 96)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !676, file: !417, line: 58, baseType: !24, size: 32, offset: 96)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !671, file: !417, line: 74, baseType: !24, size: 32, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !671, file: !417, line: 76, baseType: !24, size: 32, offset: 96)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !671, file: !417, line: 77, baseType: !24, size: 32, offset: 128)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !671, file: !417, line: 79, baseType: !24, size: 32, offset: 160)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !577, file: !578, line: 141, baseType: !89, size: 128, offset: 2944)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !577, file: !578, line: 142, baseType: !89, size: 128, offset: 3072)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !577, file: !578, line: 143, baseType: !89, size: 128, offset: 3200)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !577, file: !578, line: 144, baseType: !89, size: 128, offset: 3328)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !577, file: !578, line: 146, baseType: !24, size: 32, offset: 3456)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !577, file: !578, line: 147, baseType: !24, size: 32, offset: 3488)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !577, file: !578, line: 150, baseType: !691, size: 64, offset: 3520)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !193, line: 93, size: 7552, elements: !694)
!694 = !{!695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !743, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1296}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !693, file: !193, line: 94, baseType: !155, size: 960)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !693, file: !193, line: 95, baseType: !191, size: 64, offset: 960)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !693, file: !193, line: 97, baseType: !79, size: 16, offset: 1024)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !693, file: !193, line: 97, baseType: !79, size: 16, offset: 1040)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !693, file: !193, line: 99, baseType: !52, size: 32, offset: 1056)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !693, file: !193, line: 99, baseType: !52, size: 32, offset: 1088)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !693, file: !193, line: 99, baseType: !52, size: 32, offset: 1120)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !693, file: !193, line: 100, baseType: !52, size: 32, offset: 1152)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !693, file: !193, line: 100, baseType: !52, size: 32, offset: 1184)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !693, file: !193, line: 100, baseType: !52, size: 32, offset: 1216)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !693, file: !193, line: 101, baseType: !52, size: 32, offset: 1248)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !693, file: !193, line: 101, baseType: !52, size: 32, offset: 1280)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !693, file: !193, line: 101, baseType: !52, size: 32, offset: 1312)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !693, file: !193, line: 102, baseType: !52, size: 32, offset: 1344)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !693, file: !193, line: 102, baseType: !52, size: 32, offset: 1376)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !693, file: !193, line: 102, baseType: !52, size: 32, offset: 1408)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !693, file: !193, line: 103, baseType: !52, size: 32, offset: 1440)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !693, file: !193, line: 103, baseType: !52, size: 32, offset: 1472)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !693, file: !193, line: 103, baseType: !52, size: 32, offset: 1504)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !693, file: !193, line: 103, baseType: !52, size: 32, offset: 1536)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !693, file: !193, line: 103, baseType: !52, size: 32, offset: 1568)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !693, file: !193, line: 104, baseType: !52, size: 32, offset: 1600)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !693, file: !193, line: 104, baseType: !52, size: 32, offset: 1632)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !693, file: !193, line: 104, baseType: !52, size: 32, offset: 1664)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !693, file: !193, line: 104, baseType: !52, size: 32, offset: 1696)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !693, file: !193, line: 104, baseType: !52, size: 32, offset: 1728)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !693, file: !193, line: 105, baseType: !52, size: 32, offset: 1760)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !693, file: !193, line: 108, baseType: !723, size: 704, offset: 1792)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !193, line: 53, size: 704, elements: !724)
!724 = !{!725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !723, file: !193, line: 54, baseType: !52, size: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !723, file: !193, line: 55, baseType: !52, size: 32, offset: 32)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !723, file: !193, line: 56, baseType: !52, size: 32, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !723, file: !193, line: 57, baseType: !52, size: 32, offset: 96)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !723, file: !193, line: 59, baseType: !524, size: 96, offset: 128)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !723, file: !193, line: 60, baseType: !524, size: 96, offset: 224)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !723, file: !193, line: 61, baseType: !524, size: 96, offset: 320)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !723, file: !193, line: 63, baseType: !52, size: 32, offset: 416)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !723, file: !193, line: 64, baseType: !52, size: 32, offset: 448)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !723, file: !193, line: 65, baseType: !52, size: 32, offset: 480)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !723, file: !193, line: 67, baseType: !79, size: 16, offset: 512)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !723, file: !193, line: 68, baseType: !79, size: 16, offset: 528)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !723, file: !193, line: 69, baseType: !79, size: 16, offset: 544)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !723, file: !193, line: 70, baseType: !79, size: 16, offset: 560)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !723, file: !193, line: 72, baseType: !52, size: 32, offset: 576)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !723, file: !193, line: 73, baseType: !52, size: 32, offset: 608)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !723, file: !193, line: 74, baseType: !52, size: 32, offset: 640)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !723, file: !193, line: 75, baseType: !52, size: 32, offset: 672)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !693, file: !193, line: 109, baseType: !744, size: 128, offset: 2496)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !193, line: 79, size: 128, elements: !745)
!745 = !{!746, !747, !748, !749}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !744, file: !193, line: 80, baseType: !24, size: 32)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !744, file: !193, line: 81, baseType: !24, size: 32, offset: 32)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !744, file: !193, line: 82, baseType: !24, size: 32, offset: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !744, file: !193, line: 83, baseType: !24, size: 32, offset: 96)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !693, file: !193, line: 111, baseType: !52, size: 32, offset: 2624)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !693, file: !193, line: 111, baseType: !52, size: 32, offset: 2656)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !693, file: !193, line: 112, baseType: !52, size: 32, offset: 2688)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !693, file: !193, line: 112, baseType: !52, size: 32, offset: 2720)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !693, file: !193, line: 113, baseType: !52, size: 32, offset: 2752)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !693, file: !193, line: 114, baseType: !52, size: 32, offset: 2784)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !693, file: !193, line: 114, baseType: !52, size: 32, offset: 2816)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !693, file: !193, line: 115, baseType: !79, size: 16, offset: 2848)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !693, file: !193, line: 115, baseType: !79, size: 16, offset: 2864)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !693, file: !193, line: 116, baseType: !79, size: 16, offset: 2880)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !693, file: !193, line: 117, baseType: !48, size: 8, offset: 2896)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !693, file: !193, line: 117, baseType: !48, size: 8, offset: 2904)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !693, file: !193, line: 119, baseType: !52, size: 32, offset: 2912)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !693, file: !193, line: 119, baseType: !52, size: 32, offset: 2944)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !693, file: !193, line: 120, baseType: !79, size: 16, offset: 2976)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !693, file: !193, line: 120, baseType: !79, size: 16, offset: 2992)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !693, file: !193, line: 121, baseType: !52, size: 32, offset: 3008)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !693, file: !193, line: 121, baseType: !52, size: 32, offset: 3040)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !693, file: !193, line: 122, baseType: !52, size: 32, offset: 3072)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !693, file: !193, line: 123, baseType: !52, size: 32, offset: 3104)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !693, file: !193, line: 124, baseType: !79, size: 16, offset: 3136)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !693, file: !193, line: 125, baseType: !79, size: 16, offset: 3152)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !693, file: !193, line: 127, baseType: !24, size: 32, offset: 3168)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !693, file: !193, line: 127, baseType: !24, size: 32, offset: 3200)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !693, file: !193, line: 128, baseType: !24, size: 32, offset: 3232)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !693, file: !193, line: 128, baseType: !24, size: 32, offset: 3264)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !693, file: !193, line: 129, baseType: !79, size: 16, offset: 3296)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !693, file: !193, line: 129, baseType: !79, size: 16, offset: 3312)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !693, file: !193, line: 129, baseType: !79, size: 16, offset: 3328)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !693, file: !193, line: 129, baseType: !79, size: 16, offset: 3344)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !693, file: !193, line: 130, baseType: !52, size: 32, offset: 3360)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !693, file: !193, line: 130, baseType: !52, size: 32, offset: 3392)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !693, file: !193, line: 130, baseType: !52, size: 32, offset: 3424)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !693, file: !193, line: 130, baseType: !52, size: 32, offset: 3456)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !693, file: !193, line: 131, baseType: !52, size: 32, offset: 3488)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !693, file: !193, line: 131, baseType: !52, size: 32, offset: 3520)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !693, file: !193, line: 131, baseType: !52, size: 32, offset: 3552)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !693, file: !193, line: 131, baseType: !52, size: 32, offset: 3584)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !693, file: !193, line: 132, baseType: !52, size: 32, offset: 3616)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !693, file: !193, line: 132, baseType: !52, size: 32, offset: 3648)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !693, file: !193, line: 133, baseType: !47, size: 512, offset: 3680)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !693, file: !193, line: 135, baseType: !52, size: 32, offset: 4192)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !693, file: !193, line: 136, baseType: !52, size: 32, offset: 4224)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !693, file: !193, line: 137, baseType: !52, size: 32, offset: 4256)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !693, file: !193, line: 138, baseType: !24, size: 32, offset: 4288)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !693, file: !193, line: 141, baseType: !48, size: 8, offset: 4320)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !693, file: !193, line: 141, baseType: !48, size: 8, offset: 4328)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !693, file: !193, line: 141, baseType: !48, size: 8, offset: 4336)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !693, file: !193, line: 141, baseType: !48, size: 8, offset: 4344)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !693, file: !193, line: 142, baseType: !79, size: 16, offset: 4352)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !693, file: !193, line: 142, baseType: !79, size: 16, offset: 4368)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !693, file: !193, line: 142, baseType: !79, size: 16, offset: 4384)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !693, file: !193, line: 145, baseType: !48, size: 8, offset: 4400)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !693, file: !193, line: 145, baseType: !48, size: 8, offset: 4408)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !693, file: !193, line: 148, baseType: !79, size: 16, offset: 4416)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !693, file: !193, line: 148, baseType: !79, size: 16, offset: 4432)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !693, file: !193, line: 149, baseType: !52, size: 32, offset: 4448)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !693, file: !193, line: 149, baseType: !52, size: 32, offset: 4480)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !693, file: !193, line: 152, baseType: !452, size: 128, offset: 4512)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !693, file: !193, line: 153, baseType: !52, size: 32, offset: 4640)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !693, file: !193, line: 154, baseType: !52, size: 32, offset: 4672)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !693, file: !193, line: 157, baseType: !79, size: 16, offset: 4704)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !693, file: !193, line: 157, baseType: !79, size: 16, offset: 4720)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !693, file: !193, line: 160, baseType: !814, size: 64, offset: 4736)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !816, line: 113, size: 6208, elements: !817)
!816 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!817 = !{!818, !819, !820, !821, !822, !823, !827}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !815, file: !816, line: 114, baseType: !79, size: 16)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !815, file: !816, line: 114, baseType: !79, size: 16, offset: 16)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !815, file: !816, line: 115, baseType: !48, size: 8, offset: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !815, file: !816, line: 115, baseType: !48, size: 8, offset: 40)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !815, file: !816, line: 116, baseType: !48, size: 8, offset: 48)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !815, file: !816, line: 117, baseType: !824, size: 8, offset: 56)
!824 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 8, elements: !825)
!825 = !{!826}
!826 = !DISubrange(count: 1)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !815, file: !816, line: 119, baseType: !828, size: 6144, offset: 64)
!828 = !DICompositeType(tag: DW_TAG_array_type, baseType: !829, size: 6144, elements: !838)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !816, line: 109, baseType: !830)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !816, line: 106, size: 192, elements: !831)
!831 = !{!832, !833, !834, !835, !836, !837}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !830, file: !816, line: 107, baseType: !52, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !830, file: !816, line: 107, baseType: !52, size: 32, offset: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !830, file: !816, line: 107, baseType: !52, size: 32, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !830, file: !816, line: 107, baseType: !52, size: 32, offset: 96)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !830, file: !816, line: 107, baseType: !52, size: 32, offset: 128)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !830, file: !816, line: 108, baseType: !24, size: 32, offset: 160)
!838 = !{!839}
!839 = !DISubrange(count: 32)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !693, file: !193, line: 161, baseType: !814, size: 64, offset: 4800)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !693, file: !193, line: 162, baseType: !48, size: 8, offset: 4864)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !693, file: !193, line: 162, baseType: !48, size: 8, offset: 4872)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !693, file: !193, line: 163, baseType: !48, size: 8, offset: 4880)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !693, file: !193, line: 163, baseType: !48, size: 8, offset: 4888)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !693, file: !193, line: 164, baseType: !79, size: 16, offset: 4896)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !693, file: !193, line: 164, baseType: !79, size: 16, offset: 4912)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !693, file: !193, line: 165, baseType: !52, size: 32, offset: 4928)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !693, file: !193, line: 165, baseType: !52, size: 32, offset: 4960)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !693, file: !193, line: 167, baseType: !850, size: 1152, offset: 4992)
!850 = !DICompositeType(tag: DW_TAG_array_type, baseType: !851, size: 1152, elements: !1254)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !816, line: 57, size: 2496, elements: !853)
!853 = !{!854, !855, !856, !857, !858, !859, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !852, file: !816, line: 59, baseType: !79, size: 16)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !852, file: !816, line: 59, baseType: !79, size: 16, offset: 16)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !852, file: !816, line: 59, baseType: !79, size: 16, offset: 32)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !852, file: !816, line: 59, baseType: !79, size: 16, offset: 48)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !852, file: !816, line: 60, baseType: !576, size: 64, offset: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !852, file: !816, line: 61, baseType: !860, size: 64, offset: 128)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !816, line: 202, size: 3328, elements: !862)
!862 = !{!863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !932, !933, !934, !1065, !1066, !1094, !1095, !1164, !1185, !1193, !1194}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !861, file: !816, line: 203, baseType: !155, size: 960)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !861, file: !816, line: 204, baseType: !191, size: 64, offset: 960)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !861, file: !816, line: 206, baseType: !52, size: 32, offset: 1024)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !861, file: !816, line: 206, baseType: !52, size: 32, offset: 1056)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !861, file: !816, line: 207, baseType: !52, size: 32, offset: 1088)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !861, file: !816, line: 207, baseType: !52, size: 32, offset: 1120)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !861, file: !816, line: 207, baseType: !52, size: 32, offset: 1152)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !861, file: !816, line: 207, baseType: !52, size: 32, offset: 1184)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !861, file: !816, line: 207, baseType: !52, size: 32, offset: 1216)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !861, file: !816, line: 207, baseType: !52, size: 32, offset: 1248)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !861, file: !816, line: 208, baseType: !52, size: 32, offset: 1280)
