; ModuleID = 'blender/source/blender/editors/space_view3d/view3d_fly.c'
source_filename = "blender/source/blender/editors/space_view3d/view3d_fly.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "modal_items", scope: !2, file: !3, line: 97, type: !541, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "fly_modal_keymap", scope: !3, file: !3, line: 95, type: !4, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !31, retainedNodes: !540)
!3 = !DIFile(filename: "blender/source/blender/editors/space_view3d/view3d_fly.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmKeyConfig", file: !8, line: 318, baseType: !9)
!8 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmKeyConfig", file: !8, line: 310, size: 1344, elements: !10)
!10 = !{!11, !13, !14, !19, !20, !28, !30}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !9, file: !8, line: 311, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !9, file: !8, line: 311, baseType: !12, size: 64, offset: 64)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !9, file: !8, line: 313, baseType: !15, size: 512, offset: 128)
!15 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 512, elements: !17)
!16 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!17 = !{!18}
!18 = !DISubrange(count: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "basename", scope: !9, file: !8, line: 314, baseType: !15, size: 512, offset: 640)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "keymaps", scope: !9, file: !8, line: 316, baseType: !21, size: 128, offset: 1152)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !22, line: 71, baseType: !23)
!22 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !22, line: 69, size: 128, elements: !24)
!24 = !{!25, !27}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !23, file: !22, line: 70, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !23, file: !22, line: 70, baseType: !26, size: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "actkeymap", scope: !9, file: !8, line: 317, baseType: !29, size: 32, offset: 1280)
!29 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !9, file: !8, line: 317, baseType: !29, size: 32, offset: 1312)
!31 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !32, retainedTypes: !537, globals: !539, splitDebugInlining: false, nameTableKind: None)
!32 = !{!33, !235, !256, !264, !269, !277, !288, !293, !324, !520}
!33 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !34, line: 54, baseType: !35, size: 32, elements: !36)
!34 = !DIFile(filename: "blender/source/blender/windowmanager/wm_event_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!35 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!36 = !{!37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234}
!37 = !DIEnumerator(name: "EVENT_NONE", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "LEFTMOUSE", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "MIDDLEMOUSE", value: 2, isUnsigned: true)
!40 = !DIEnumerator(name: "RIGHTMOUSE", value: 3, isUnsigned: true)
!41 = !DIEnumerator(name: "MOUSEMOVE", value: 4, isUnsigned: true)
!42 = !DIEnumerator(name: "ACTIONMOUSE", value: 5, isUnsigned: true)
!43 = !DIEnumerator(name: "SELECTMOUSE", value: 6, isUnsigned: true)
!44 = !DIEnumerator(name: "BUTTON4MOUSE", value: 7, isUnsigned: true)
!45 = !DIEnumerator(name: "BUTTON5MOUSE", value: 8, isUnsigned: true)
!46 = !DIEnumerator(name: "BUTTON6MOUSE", value: 18, isUnsigned: true)
!47 = !DIEnumerator(name: "BUTTON7MOUSE", value: 19, isUnsigned: true)
!48 = !DIEnumerator(name: "MOUSEPAN", value: 14, isUnsigned: true)
!49 = !DIEnumerator(name: "MOUSEZOOM", value: 15, isUnsigned: true)
!50 = !DIEnumerator(name: "MOUSEROTATE", value: 16, isUnsigned: true)
!51 = !DIEnumerator(name: "WHEELUPMOUSE", value: 10, isUnsigned: true)
!52 = !DIEnumerator(name: "WHEELDOWNMOUSE", value: 11, isUnsigned: true)
!53 = !DIEnumerator(name: "WHEELINMOUSE", value: 12, isUnsigned: true)
!54 = !DIEnumerator(name: "WHEELOUTMOUSE", value: 13, isUnsigned: true)
!55 = !DIEnumerator(name: "INBETWEEN_MOUSEMOVE", value: 17, isUnsigned: true)
!56 = !DIEnumerator(name: "AKEY", value: 97, isUnsigned: true)
!57 = !DIEnumerator(name: "BKEY", value: 98, isUnsigned: true)
!58 = !DIEnumerator(name: "CKEY", value: 99, isUnsigned: true)
!59 = !DIEnumerator(name: "DKEY", value: 100, isUnsigned: true)
!60 = !DIEnumerator(name: "EKEY", value: 101, isUnsigned: true)
!61 = !DIEnumerator(name: "FKEY", value: 102, isUnsigned: true)
!62 = !DIEnumerator(name: "GKEY", value: 103, isUnsigned: true)
!63 = !DIEnumerator(name: "HKEY", value: 104, isUnsigned: true)
!64 = !DIEnumerator(name: "IKEY", value: 105, isUnsigned: true)
!65 = !DIEnumerator(name: "JKEY", value: 106, isUnsigned: true)
!66 = !DIEnumerator(name: "KKEY", value: 107, isUnsigned: true)
!67 = !DIEnumerator(name: "LKEY", value: 108, isUnsigned: true)
!68 = !DIEnumerator(name: "MKEY", value: 109, isUnsigned: true)
!69 = !DIEnumerator(name: "NKEY", value: 110, isUnsigned: true)
!70 = !DIEnumerator(name: "OKEY", value: 111, isUnsigned: true)
!71 = !DIEnumerator(name: "PKEY", value: 112, isUnsigned: true)
!72 = !DIEnumerator(name: "QKEY", value: 113, isUnsigned: true)
!73 = !DIEnumerator(name: "RKEY", value: 114, isUnsigned: true)
!74 = !DIEnumerator(name: "SKEY", value: 115, isUnsigned: true)
!75 = !DIEnumerator(name: "TKEY", value: 116, isUnsigned: true)
!76 = !DIEnumerator(name: "UKEY", value: 117, isUnsigned: true)
!77 = !DIEnumerator(name: "VKEY", value: 118, isUnsigned: true)
!78 = !DIEnumerator(name: "WKEY", value: 119, isUnsigned: true)
!79 = !DIEnumerator(name: "XKEY", value: 120, isUnsigned: true)
!80 = !DIEnumerator(name: "YKEY", value: 121, isUnsigned: true)
!81 = !DIEnumerator(name: "ZKEY", value: 122, isUnsigned: true)
!82 = !DIEnumerator(name: "ZEROKEY", value: 48, isUnsigned: true)
!83 = !DIEnumerator(name: "ONEKEY", value: 49, isUnsigned: true)
!84 = !DIEnumerator(name: "TWOKEY", value: 50, isUnsigned: true)
!85 = !DIEnumerator(name: "THREEKEY", value: 51, isUnsigned: true)
!86 = !DIEnumerator(name: "FOURKEY", value: 52, isUnsigned: true)
!87 = !DIEnumerator(name: "FIVEKEY", value: 53, isUnsigned: true)
!88 = !DIEnumerator(name: "SIXKEY", value: 54, isUnsigned: true)
!89 = !DIEnumerator(name: "SEVENKEY", value: 55, isUnsigned: true)
!90 = !DIEnumerator(name: "EIGHTKEY", value: 56, isUnsigned: true)
!91 = !DIEnumerator(name: "NINEKEY", value: 57, isUnsigned: true)
!92 = !DIEnumerator(name: "CAPSLOCKKEY", value: 211, isUnsigned: true)
!93 = !DIEnumerator(name: "LEFTCTRLKEY", value: 212, isUnsigned: true)
!94 = !DIEnumerator(name: "LEFTALTKEY", value: 213, isUnsigned: true)
!95 = !DIEnumerator(name: "RIGHTALTKEY", value: 214, isUnsigned: true)
!96 = !DIEnumerator(name: "RIGHTCTRLKEY", value: 215, isUnsigned: true)
!97 = !DIEnumerator(name: "RIGHTSHIFTKEY", value: 216, isUnsigned: true)
!98 = !DIEnumerator(name: "LEFTSHIFTKEY", value: 217, isUnsigned: true)
!99 = !DIEnumerator(name: "ESCKEY", value: 218, isUnsigned: true)
!100 = !DIEnumerator(name: "TABKEY", value: 219, isUnsigned: true)
!101 = !DIEnumerator(name: "RETKEY", value: 220, isUnsigned: true)
!102 = !DIEnumerator(name: "SPACEKEY", value: 221, isUnsigned: true)
!103 = !DIEnumerator(name: "LINEFEEDKEY", value: 222, isUnsigned: true)
!104 = !DIEnumerator(name: "BACKSPACEKEY", value: 223, isUnsigned: true)
!105 = !DIEnumerator(name: "DELKEY", value: 224, isUnsigned: true)
!106 = !DIEnumerator(name: "SEMICOLONKEY", value: 225, isUnsigned: true)
!107 = !DIEnumerator(name: "PERIODKEY", value: 226, isUnsigned: true)
!108 = !DIEnumerator(name: "COMMAKEY", value: 227, isUnsigned: true)
!109 = !DIEnumerator(name: "QUOTEKEY", value: 228, isUnsigned: true)
!110 = !DIEnumerator(name: "ACCENTGRAVEKEY", value: 229, isUnsigned: true)
!111 = !DIEnumerator(name: "MINUSKEY", value: 230, isUnsigned: true)
!112 = !DIEnumerator(name: "SLASHKEY", value: 232, isUnsigned: true)
!113 = !DIEnumerator(name: "BACKSLASHKEY", value: 233, isUnsigned: true)
!114 = !DIEnumerator(name: "EQUALKEY", value: 234, isUnsigned: true)
!115 = !DIEnumerator(name: "LEFTBRACKETKEY", value: 235, isUnsigned: true)
!116 = !DIEnumerator(name: "RIGHTBRACKETKEY", value: 236, isUnsigned: true)
!117 = !DIEnumerator(name: "LEFTARROWKEY", value: 137, isUnsigned: true)
!118 = !DIEnumerator(name: "DOWNARROWKEY", value: 138, isUnsigned: true)
!119 = !DIEnumerator(name: "RIGHTARROWKEY", value: 139, isUnsigned: true)
!120 = !DIEnumerator(name: "UPARROWKEY", value: 140, isUnsigned: true)
!121 = !DIEnumerator(name: "PAD0", value: 150, isUnsigned: true)
!122 = !DIEnumerator(name: "PAD1", value: 151, isUnsigned: true)
!123 = !DIEnumerator(name: "PAD2", value: 152, isUnsigned: true)
!124 = !DIEnumerator(name: "PAD3", value: 153, isUnsigned: true)
!125 = !DIEnumerator(name: "PAD4", value: 154, isUnsigned: true)
!126 = !DIEnumerator(name: "PAD5", value: 155, isUnsigned: true)
!127 = !DIEnumerator(name: "PAD6", value: 156, isUnsigned: true)
!128 = !DIEnumerator(name: "PAD7", value: 157, isUnsigned: true)
!129 = !DIEnumerator(name: "PAD8", value: 158, isUnsigned: true)
!130 = !DIEnumerator(name: "PAD9", value: 159, isUnsigned: true)
!131 = !DIEnumerator(name: "PADPERIOD", value: 199, isUnsigned: true)
!132 = !DIEnumerator(name: "PADASTERKEY", value: 160, isUnsigned: true)
!133 = !DIEnumerator(name: "PADSLASHKEY", value: 161, isUnsigned: true)
!134 = !DIEnumerator(name: "PADMINUS", value: 162, isUnsigned: true)
!135 = !DIEnumerator(name: "PADENTER", value: 163, isUnsigned: true)
!136 = !DIEnumerator(name: "PADPLUSKEY", value: 164, isUnsigned: true)
!137 = !DIEnumerator(name: "PAUSEKEY", value: 165, isUnsigned: true)
!138 = !DIEnumerator(name: "INSERTKEY", value: 166, isUnsigned: true)
!139 = !DIEnumerator(name: "HOMEKEY", value: 167, isUnsigned: true)
!140 = !DIEnumerator(name: "PAGEUPKEY", value: 168, isUnsigned: true)
!141 = !DIEnumerator(name: "PAGEDOWNKEY", value: 169, isUnsigned: true)
!142 = !DIEnumerator(name: "ENDKEY", value: 170, isUnsigned: true)
!143 = !DIEnumerator(name: "UNKNOWNKEY", value: 171, isUnsigned: true)
!144 = !DIEnumerator(name: "OSKEY", value: 172, isUnsigned: true)
!145 = !DIEnumerator(name: "GRLESSKEY", value: 173, isUnsigned: true)
!146 = !DIEnumerator(name: "MEDIAPLAY", value: 174, isUnsigned: true)
!147 = !DIEnumerator(name: "MEDIASTOP", value: 175, isUnsigned: true)
!148 = !DIEnumerator(name: "MEDIAFIRST", value: 176, isUnsigned: true)
!149 = !DIEnumerator(name: "MEDIALAST", value: 177, isUnsigned: true)
!150 = !DIEnumerator(name: "F1KEY", value: 300, isUnsigned: true)
!151 = !DIEnumerator(name: "F2KEY", value: 301, isUnsigned: true)
!152 = !DIEnumerator(name: "F3KEY", value: 302, isUnsigned: true)
!153 = !DIEnumerator(name: "F4KEY", value: 303, isUnsigned: true)
!154 = !DIEnumerator(name: "F5KEY", value: 304, isUnsigned: true)
!155 = !DIEnumerator(name: "F6KEY", value: 305, isUnsigned: true)
!156 = !DIEnumerator(name: "F7KEY", value: 306, isUnsigned: true)
!157 = !DIEnumerator(name: "F8KEY", value: 307, isUnsigned: true)
!158 = !DIEnumerator(name: "F9KEY", value: 308, isUnsigned: true)
!159 = !DIEnumerator(name: "F10KEY", value: 309, isUnsigned: true)
!160 = !DIEnumerator(name: "F11KEY", value: 310, isUnsigned: true)
!161 = !DIEnumerator(name: "F12KEY", value: 311, isUnsigned: true)
!162 = !DIEnumerator(name: "F13KEY", value: 312, isUnsigned: true)
!163 = !DIEnumerator(name: "F14KEY", value: 313, isUnsigned: true)
!164 = !DIEnumerator(name: "F15KEY", value: 314, isUnsigned: true)
!165 = !DIEnumerator(name: "F16KEY", value: 315, isUnsigned: true)
!166 = !DIEnumerator(name: "F17KEY", value: 316, isUnsigned: true)
!167 = !DIEnumerator(name: "F18KEY", value: 317, isUnsigned: true)
!168 = !DIEnumerator(name: "F19KEY", value: 318, isUnsigned: true)
!169 = !DIEnumerator(name: "NDOF_MOTION", value: 400, isUnsigned: true)
!170 = !DIEnumerator(name: "NDOF_BUTTON_NONE", value: 400, isUnsigned: true)
!171 = !DIEnumerator(name: "NDOF_BUTTON_MENU", value: 401, isUnsigned: true)
!172 = !DIEnumerator(name: "NDOF_BUTTON_FIT", value: 402, isUnsigned: true)
!173 = !DIEnumerator(name: "NDOF_BUTTON_TOP", value: 403, isUnsigned: true)
!174 = !DIEnumerator(name: "NDOF_BUTTON_BOTTOM", value: 404, isUnsigned: true)
!175 = !DIEnumerator(name: "NDOF_BUTTON_LEFT", value: 405, isUnsigned: true)
!176 = !DIEnumerator(name: "NDOF_BUTTON_RIGHT", value: 406, isUnsigned: true)
!177 = !DIEnumerator(name: "NDOF_BUTTON_FRONT", value: 407, isUnsigned: true)
!178 = !DIEnumerator(name: "NDOF_BUTTON_BACK", value: 408, isUnsigned: true)
!179 = !DIEnumerator(name: "NDOF_BUTTON_ISO1", value: 409, isUnsigned: true)
!180 = !DIEnumerator(name: "NDOF_BUTTON_ISO2", value: 410, isUnsigned: true)
!181 = !DIEnumerator(name: "NDOF_BUTTON_ROLL_CW", value: 411, isUnsigned: true)
!182 = !DIEnumerator(name: "NDOF_BUTTON_ROLL_CCW", value: 412, isUnsigned: true)
!183 = !DIEnumerator(name: "NDOF_BUTTON_SPIN_CW", value: 413, isUnsigned: true)
!184 = !DIEnumerator(name: "NDOF_BUTTON_SPIN_CCW", value: 414, isUnsigned: true)
!185 = !DIEnumerator(name: "NDOF_BUTTON_TILT_CW", value: 415, isUnsigned: true)
!186 = !DIEnumerator(name: "NDOF_BUTTON_TILT_CCW", value: 416, isUnsigned: true)
!187 = !DIEnumerator(name: "NDOF_BUTTON_ROTATE", value: 417, isUnsigned: true)
!188 = !DIEnumerator(name: "NDOF_BUTTON_PANZOOM", value: 418, isUnsigned: true)
!189 = !DIEnumerator(name: "NDOF_BUTTON_DOMINANT", value: 419, isUnsigned: true)
!190 = !DIEnumerator(name: "NDOF_BUTTON_PLUS", value: 420, isUnsigned: true)
!191 = !DIEnumerator(name: "NDOF_BUTTON_MINUS", value: 421, isUnsigned: true)
!192 = !DIEnumerator(name: "NDOF_BUTTON_ESC", value: 422, isUnsigned: true)
!193 = !DIEnumerator(name: "NDOF_BUTTON_ALT", value: 423, isUnsigned: true)
!194 = !DIEnumerator(name: "NDOF_BUTTON_SHIFT", value: 424, isUnsigned: true)
!195 = !DIEnumerator(name: "NDOF_BUTTON_CTRL", value: 425, isUnsigned: true)
!196 = !DIEnumerator(name: "NDOF_BUTTON_1", value: 426, isUnsigned: true)
!197 = !DIEnumerator(name: "NDOF_BUTTON_2", value: 427, isUnsigned: true)
!198 = !DIEnumerator(name: "NDOF_BUTTON_3", value: 428, isUnsigned: true)
!199 = !DIEnumerator(name: "NDOF_BUTTON_4", value: 429, isUnsigned: true)
!200 = !DIEnumerator(name: "NDOF_BUTTON_5", value: 430, isUnsigned: true)
!201 = !DIEnumerator(name: "NDOF_BUTTON_6", value: 431, isUnsigned: true)
!202 = !DIEnumerator(name: "NDOF_BUTTON_7", value: 432, isUnsigned: true)
!203 = !DIEnumerator(name: "NDOF_BUTTON_8", value: 433, isUnsigned: true)
!204 = !DIEnumerator(name: "NDOF_BUTTON_9", value: 434, isUnsigned: true)
!205 = !DIEnumerator(name: "NDOF_BUTTON_10", value: 435, isUnsigned: true)
!206 = !DIEnumerator(name: "NDOF_BUTTON_A", value: 436, isUnsigned: true)
!207 = !DIEnumerator(name: "NDOF_BUTTON_B", value: 437, isUnsigned: true)
!208 = !DIEnumerator(name: "NDOF_BUTTON_C", value: 438, isUnsigned: true)
!209 = !DIEnumerator(name: "NDOF_LAST", value: 439, isUnsigned: true)
!210 = !DIEnumerator(name: "INPUTCHANGE", value: 259, isUnsigned: true)
!211 = !DIEnumerator(name: "WINDEACTIVATE", value: 260, isUnsigned: true)
!212 = !DIEnumerator(name: "TIMER", value: 272, isUnsigned: true)
!213 = !DIEnumerator(name: "TIMER0", value: 273, isUnsigned: true)
!214 = !DIEnumerator(name: "TIMER1", value: 274, isUnsigned: true)
!215 = !DIEnumerator(name: "TIMER2", value: 275, isUnsigned: true)
!216 = !DIEnumerator(name: "TIMERJOBS", value: 276, isUnsigned: true)
!217 = !DIEnumerator(name: "TIMERAUTOSAVE", value: 277, isUnsigned: true)
!218 = !DIEnumerator(name: "TIMERREPORT", value: 278, isUnsigned: true)
!219 = !DIEnumerator(name: "TIMERREGION", value: 279, isUnsigned: true)
!220 = !DIEnumerator(name: "TIMERF", value: 287, isUnsigned: true)
!221 = !DIEnumerator(name: "EVT_ACTIONZONE_AREA", value: 20480, isUnsigned: true)
!222 = !DIEnumerator(name: "EVT_ACTIONZONE_REGION", value: 20481, isUnsigned: true)
!223 = !DIEnumerator(name: "EVT_ACTIONZONE_FULLSCREEN", value: 20482, isUnsigned: true)
!224 = !DIEnumerator(name: "EVT_TWEAK_L", value: 20483, isUnsigned: true)
!225 = !DIEnumerator(name: "EVT_TWEAK_M", value: 20484, isUnsigned: true)
!226 = !DIEnumerator(name: "EVT_TWEAK_R", value: 20485, isUnsigned: true)
!227 = !DIEnumerator(name: "EVT_TWEAK_A", value: 20486, isUnsigned: true)
!228 = !DIEnumerator(name: "EVT_TWEAK_S", value: 20487, isUnsigned: true)
!229 = !DIEnumerator(name: "EVT_GESTURE", value: 20496, isUnsigned: true)
!230 = !DIEnumerator(name: "EVT_FILESELECT", value: 20512, isUnsigned: true)
!231 = !DIEnumerator(name: "EVT_BUT_OPEN", value: 20513, isUnsigned: true)
!232 = !DIEnumerator(name: "EVT_MODAL_MAP", value: 20514, isUnsigned: true)
!233 = !DIEnumerator(name: "EVT_DROP", value: 20515, isUnsigned: true)
!234 = !DIEnumerator(name: "EVT_BUT_CANCEL", value: 20516, isUnsigned: true)
!235 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 59, baseType: !35, size: 32, elements: !236)
!236 = !{!237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255}
!237 = !DIEnumerator(name: "FLY_MODAL_CANCEL", value: 1, isUnsigned: true)
!238 = !DIEnumerator(name: "FLY_MODAL_CONFIRM", value: 2, isUnsigned: true)
!239 = !DIEnumerator(name: "FLY_MODAL_ACCELERATE", value: 3, isUnsigned: true)
!240 = !DIEnumerator(name: "FLY_MODAL_DECELERATE", value: 4, isUnsigned: true)
!241 = !DIEnumerator(name: "FLY_MODAL_PAN_ENABLE", value: 5, isUnsigned: true)
!242 = !DIEnumerator(name: "FLY_MODAL_PAN_DISABLE", value: 6, isUnsigned: true)
!243 = !DIEnumerator(name: "FLY_MODAL_DIR_FORWARD", value: 7, isUnsigned: true)
!244 = !DIEnumerator(name: "FLY_MODAL_DIR_BACKWARD", value: 8, isUnsigned: true)
!245 = !DIEnumerator(name: "FLY_MODAL_DIR_LEFT", value: 9, isUnsigned: true)
!246 = !DIEnumerator(name: "FLY_MODAL_DIR_RIGHT", value: 10, isUnsigned: true)
!247 = !DIEnumerator(name: "FLY_MODAL_DIR_UP", value: 11, isUnsigned: true)
!248 = !DIEnumerator(name: "FLY_MODAL_DIR_DOWN", value: 12, isUnsigned: true)
!249 = !DIEnumerator(name: "FLY_MODAL_AXIS_LOCK_X", value: 13, isUnsigned: true)
!250 = !DIEnumerator(name: "FLY_MODAL_AXIS_LOCK_Z", value: 14, isUnsigned: true)
!251 = !DIEnumerator(name: "FLY_MODAL_PRECISION_ENABLE", value: 15, isUnsigned: true)
!252 = !DIEnumerator(name: "FLY_MODAL_PRECISION_DISABLE", value: 16, isUnsigned: true)
!253 = !DIEnumerator(name: "FLY_MODAL_FREELOOK_ENABLE", value: 17, isUnsigned: true)
!254 = !DIEnumerator(name: "FLY_MODAL_FREELOOK_DISABLE", value: 18, isUnsigned: true)
!255 = !DIEnumerator(name: "FLY_MODAL_SPEED", value: 19, isUnsigned: true)
!256 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !257, line: 470, baseType: !35, size: 32, elements: !258)
!257 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!258 = !{!259, !260, !261, !262, !263}
!259 = !DIEnumerator(name: "P_NOT_STARTED", value: 0, isUnsigned: true)
!260 = !DIEnumerator(name: "P_STARTING", value: 1, isUnsigned: true)
!261 = !DIEnumerator(name: "P_IN_PROGRESS", value: 2, isUnsigned: true)
!262 = !DIEnumerator(name: "P_FINISHING", value: 3, isUnsigned: true)
!263 = !DIEnumerator(name: "P_FINISHED", value: 4, isUnsigned: true)
!264 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eFlyPanState", file: !3, line: 82, baseType: !35, size: 32, elements: !265)
!265 = !{!266, !267, !268}
!266 = !DIEnumerator(name: "FLY_AXISLOCK_STATE_OFF", value: 0, isUnsigned: true)
!267 = !DIEnumerator(name: "FLY_AXISLOCK_STATE_IDLE", value: 1, isUnsigned: true)
!268 = !DIEnumerator(name: "FLY_AXISLOCK_STATE_ACTIVE", value: 2, isUnsigned: true)
!269 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !8, line: 351, baseType: !35, size: 32, elements: !270)
!270 = !{!271, !272, !273, !274, !275, !276}
!271 = !DIEnumerator(name: "OPERATOR_RUNNING_MODAL", value: 1, isUnsigned: true)
!272 = !DIEnumerator(name: "OPERATOR_CANCELLED", value: 2, isUnsigned: true)
!273 = !DIEnumerator(name: "OPERATOR_FINISHED", value: 4, isUnsigned: true)
!274 = !DIEnumerator(name: "OPERATOR_PASS_THROUGH", value: 8, isUnsigned: true)
!275 = !DIEnumerator(name: "OPERATOR_HANDLED", value: 16, isUnsigned: true)
!276 = !DIEnumerator(name: "OPERATOR_INTERFACE", value: 32, isUnsigned: true)
!277 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ReportType", file: !8, line: 67, baseType: !35, size: 32, elements: !278)
!278 = !{!279, !280, !281, !282, !283, !284, !285, !286, !287}
!279 = !DIEnumerator(name: "RPT_DEBUG", value: 1, isUnsigned: true)
!280 = !DIEnumerator(name: "RPT_INFO", value: 2, isUnsigned: true)
!281 = !DIEnumerator(name: "RPT_OPERATOR", value: 4, isUnsigned: true)
!282 = !DIEnumerator(name: "RPT_PROPERTY", value: 8, isUnsigned: true)
!283 = !DIEnumerator(name: "RPT_WARNING", value: 16, isUnsigned: true)
!284 = !DIEnumerator(name: "RPT_ERROR", value: 32, isUnsigned: true)
!285 = !DIEnumerator(name: "RPT_ERROR_INVALID_INPUT", value: 64, isUnsigned: true)
!286 = !DIEnumerator(name: "RPT_ERROR_INVALID_CONTEXT", value: 128, isUnsigned: true)
!287 = !DIEnumerator(name: "RPT_ERROR_OUT_OF_MEMORY", value: 256, isUnsigned: true)
!288 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 309, baseType: !35, size: 32, elements: !289)
!289 = !{!290, !291, !292}
!290 = !DIEnumerator(name: "FLY_RUNNING", value: 0, isUnsigned: true)
!291 = !DIEnumerator(name: "FLY_CANCEL", value: 1, isUnsigned: true)
!292 = !DIEnumerator(name: "FLY_CONFIRM", value: 2, isUnsigned: true)
!293 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eUserpref_UI_Flag", file: !294, line: 630, baseType: !29, size: 32, elements: !295)
!294 = !DIFile(filename: "blender/source/blender/makesdna/DNA_userdef_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!295 = !{!296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323}
!296 = !DIEnumerator(name: "USER_WHEELZOOMDIR", value: 4)
!297 = !DIEnumerator(name: "USER_FILTERFILEEXTS", value: 8)
!298 = !DIEnumerator(name: "USER_DRAWVIEWINFO", value: 16)
!299 = !DIEnumerator(name: "USER_PLAINMENUS", value: 32)
!300 = !DIEnumerator(name: "USER_ALLWINCODECS", value: 256)
!301 = !DIEnumerator(name: "USER_MENUOPENAUTO", value: 512)
!302 = !DIEnumerator(name: "USER_ZBUF_CURSOR", value: 1024)
!303 = !DIEnumerator(name: "USER_AUTOPERSP", value: 2048)
!304 = !DIEnumerator(name: "USER_LOCKAROUND", value: 4096)
!305 = !DIEnumerator(name: "USER_GLOBALUNDO", value: 8192)
!306 = !DIEnumerator(name: "USER_ORBIT_SELECTION", value: 16384)
!307 = !DIEnumerator(name: "USER_ZBUF_ORBIT", value: 32768)
!308 = !DIEnumerator(name: "USER_HIDE_DOT", value: 65536)
!309 = !DIEnumerator(name: "USER_SHOW_ROTVIEWICON", value: 131072)
!310 = !DIEnumerator(name: "USER_SHOW_VIEWPORTNAME", value: 262144)
!311 = !DIEnumerator(name: "USER_CAM_LOCK_NO_PARENT", value: 524288)
!312 = !DIEnumerator(name: "USER_ZOOM_TO_MOUSEPOS", value: 1048576)
!313 = !DIEnumerator(name: "USER_SHOW_FPS", value: 2097152)
!314 = !DIEnumerator(name: "USER_MMB_PASTE", value: 4194304)
!315 = !DIEnumerator(name: "USER_MENUFIXEDORDER", value: 8388608)
!316 = !DIEnumerator(name: "USER_CONTINUOUS_MOUSE", value: 16777216)
!317 = !DIEnumerator(name: "USER_ZOOM_INVERT", value: 33554432)
!318 = !DIEnumerator(name: "USER_ZOOM_HORIZ", value: 67108864)
!319 = !DIEnumerator(name: "USER_SPLASH_DISABLE", value: 134217728)
!320 = !DIEnumerator(name: "USER_HIDE_RECENT", value: 268435456)
!321 = !DIEnumerator(name: "USER_SHOW_THUMBNAILS", value: 536870912)
!322 = !DIEnumerator(name: "USER_QUIT_PROMPT", value: 1073741824)
!323 = !DIEnumerator(name: "USER_HIDE_SYSTEM_BOOKMARKS", value: -2147483648)
!324 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !325, line: 54, baseType: !35, size: 32, elements: !326)
!325 = !DIFile(filename: "blender/source/blender/editors/include/UI_resources.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!326 = !{!327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519}
!327 = !DIEnumerator(name: "TH_REDALERT", value: 0, isUnsigned: true)
!328 = !DIEnumerator(name: "TH_THEMEUI", value: 1, isUnsigned: true)
!329 = !DIEnumerator(name: "TH_BACK", value: 2, isUnsigned: true)
!330 = !DIEnumerator(name: "TH_TEXT", value: 3, isUnsigned: true)
!331 = !DIEnumerator(name: "TH_TEXT_HI", value: 4, isUnsigned: true)
!332 = !DIEnumerator(name: "TH_TITLE", value: 5, isUnsigned: true)
!333 = !DIEnumerator(name: "TH_TAB_ACTIVE", value: 6, isUnsigned: true)
!334 = !DIEnumerator(name: "TH_TAB_INACTIVE", value: 7, isUnsigned: true)
!335 = !DIEnumerator(name: "TH_TAB_BACK", value: 8, isUnsigned: true)
!336 = !DIEnumerator(name: "TH_TAB_OUTLINE", value: 9, isUnsigned: true)
!337 = !DIEnumerator(name: "TH_HEADER", value: 10, isUnsigned: true)
!338 = !DIEnumerator(name: "TH_HEADERDESEL", value: 11, isUnsigned: true)
!339 = !DIEnumerator(name: "TH_HEADER_TEXT", value: 12, isUnsigned: true)
!340 = !DIEnumerator(name: "TH_HEADER_TEXT_HI", value: 13, isUnsigned: true)
!341 = !DIEnumerator(name: "TH_PANEL_HEADER", value: 14, isUnsigned: true)
!342 = !DIEnumerator(name: "TH_PANEL_BACK", value: 15, isUnsigned: true)
!343 = !DIEnumerator(name: "TH_PANEL_SHOW_HEADER", value: 16, isUnsigned: true)
!344 = !DIEnumerator(name: "TH_PANEL_SHOW_BACK", value: 17, isUnsigned: true)
!345 = !DIEnumerator(name: "TH_BUTBACK", value: 18, isUnsigned: true)
!346 = !DIEnumerator(name: "TH_BUTBACK_TEXT", value: 19, isUnsigned: true)
!347 = !DIEnumerator(name: "TH_BUTBACK_TEXT_HI", value: 20, isUnsigned: true)
!348 = !DIEnumerator(name: "TH_SHADE1", value: 21, isUnsigned: true)
!349 = !DIEnumerator(name: "TH_SHADE2", value: 22, isUnsigned: true)
!350 = !DIEnumerator(name: "TH_HILITE", value: 23, isUnsigned: true)
!351 = !DIEnumerator(name: "TH_GRID", value: 24, isUnsigned: true)
!352 = !DIEnumerator(name: "TH_WIRE", value: 25, isUnsigned: true)
!353 = !DIEnumerator(name: "TH_WIRE_INNER", value: 26, isUnsigned: true)
!354 = !DIEnumerator(name: "TH_WIRE_EDIT", value: 27, isUnsigned: true)
!355 = !DIEnumerator(name: "TH_SELECT", value: 28, isUnsigned: true)
!356 = !DIEnumerator(name: "TH_ACTIVE", value: 29, isUnsigned: true)
!357 = !DIEnumerator(name: "TH_GROUP", value: 30, isUnsigned: true)
!358 = !DIEnumerator(name: "TH_GROUP_ACTIVE", value: 31, isUnsigned: true)
!359 = !DIEnumerator(name: "TH_TRANSFORM", value: 32, isUnsigned: true)
!360 = !DIEnumerator(name: "TH_VERTEX", value: 33, isUnsigned: true)
!361 = !DIEnumerator(name: "TH_VERTEX_SELECT", value: 34, isUnsigned: true)
!362 = !DIEnumerator(name: "TH_VERTEX_UNREFERENCED", value: 35, isUnsigned: true)
!363 = !DIEnumerator(name: "TH_VERTEX_SIZE", value: 36, isUnsigned: true)
!364 = !DIEnumerator(name: "TH_OUTLINE_WIDTH", value: 37, isUnsigned: true)
!365 = !DIEnumerator(name: "TH_EDGE", value: 38, isUnsigned: true)
!366 = !DIEnumerator(name: "TH_EDGE_SELECT", value: 39, isUnsigned: true)
!367 = !DIEnumerator(name: "TH_EDGE_SEAM", value: 40, isUnsigned: true)
!368 = !DIEnumerator(name: "TH_EDGE_FACESEL", value: 41, isUnsigned: true)
!369 = !DIEnumerator(name: "TH_FACE", value: 42, isUnsigned: true)
!370 = !DIEnumerator(name: "TH_FACE_SELECT", value: 43, isUnsigned: true)
!371 = !DIEnumerator(name: "TH_NORMAL", value: 44, isUnsigned: true)
!372 = !DIEnumerator(name: "TH_VNORMAL", value: 45, isUnsigned: true)
!373 = !DIEnumerator(name: "TH_LNORMAL", value: 46, isUnsigned: true)
!374 = !DIEnumerator(name: "TH_FACE_DOT", value: 47, isUnsigned: true)
!375 = !DIEnumerator(name: "TH_FACEDOT_SIZE", value: 48, isUnsigned: true)
!376 = !DIEnumerator(name: "TH_CFRAME", value: 49, isUnsigned: true)
!377 = !DIEnumerator(name: "TH_NURB_ULINE", value: 50, isUnsigned: true)
!378 = !DIEnumerator(name: "TH_NURB_VLINE", value: 51, isUnsigned: true)
!379 = !DIEnumerator(name: "TH_NURB_SEL_ULINE", value: 52, isUnsigned: true)
!380 = !DIEnumerator(name: "TH_NURB_SEL_VLINE", value: 53, isUnsigned: true)
!381 = !DIEnumerator(name: "TH_HANDLE_FREE", value: 54, isUnsigned: true)
!382 = !DIEnumerator(name: "TH_HANDLE_AUTO", value: 55, isUnsigned: true)
!383 = !DIEnumerator(name: "TH_HANDLE_VECT", value: 56, isUnsigned: true)
!384 = !DIEnumerator(name: "TH_HANDLE_ALIGN", value: 57, isUnsigned: true)
!385 = !DIEnumerator(name: "TH_HANDLE_AUTOCLAMP", value: 58, isUnsigned: true)
!386 = !DIEnumerator(name: "TH_HANDLE_SEL_FREE", value: 59, isUnsigned: true)
!387 = !DIEnumerator(name: "TH_HANDLE_SEL_AUTO", value: 60, isUnsigned: true)
!388 = !DIEnumerator(name: "TH_HANDLE_SEL_VECT", value: 61, isUnsigned: true)
!389 = !DIEnumerator(name: "TH_HANDLE_SEL_ALIGN", value: 62, isUnsigned: true)
!390 = !DIEnumerator(name: "TH_HANDLE_SEL_AUTOCLAMP", value: 63, isUnsigned: true)
!391 = !DIEnumerator(name: "TH_ACTIVE_SPLINE", value: 64, isUnsigned: true)
!392 = !DIEnumerator(name: "TH_ACTIVE_VERT", value: 65, isUnsigned: true)
!393 = !DIEnumerator(name: "TH_SYNTAX_B", value: 66, isUnsigned: true)
!394 = !DIEnumerator(name: "TH_SYNTAX_V", value: 67, isUnsigned: true)
!395 = !DIEnumerator(name: "TH_SYNTAX_R", value: 68, isUnsigned: true)
!396 = !DIEnumerator(name: "TH_SYNTAX_C", value: 69, isUnsigned: true)
!397 = !DIEnumerator(name: "TH_SYNTAX_L", value: 70, isUnsigned: true)
!398 = !DIEnumerator(name: "TH_SYNTAX_D", value: 71, isUnsigned: true)
!399 = !DIEnumerator(name: "TH_SYNTAX_N", value: 72, isUnsigned: true)
!400 = !DIEnumerator(name: "TH_SYNTAX_S", value: 73, isUnsigned: true)
!401 = !DIEnumerator(name: "TH_BONE_SOLID", value: 74, isUnsigned: true)
!402 = !DIEnumerator(name: "TH_BONE_POSE", value: 75, isUnsigned: true)
!403 = !DIEnumerator(name: "TH_BONE_POSE_ACTIVE", value: 76, isUnsigned: true)
!404 = !DIEnumerator(name: "TH_STRIP", value: 77, isUnsigned: true)
!405 = !DIEnumerator(name: "TH_STRIP_SELECT", value: 78, isUnsigned: true)
!406 = !DIEnumerator(name: "TH_KEYTYPE_KEYFRAME", value: 79, isUnsigned: true)
!407 = !DIEnumerator(name: "TH_KEYTYPE_KEYFRAME_SELECT", value: 80, isUnsigned: true)
!408 = !DIEnumerator(name: "TH_KEYTYPE_EXTREME", value: 81, isUnsigned: true)
!409 = !DIEnumerator(name: "TH_KEYTYPE_EXTREME_SELECT", value: 82, isUnsigned: true)
!410 = !DIEnumerator(name: "TH_KEYTYPE_BREAKDOWN", value: 83, isUnsigned: true)
!411 = !DIEnumerator(name: "TH_KEYTYPE_BREAKDOWN_SELECT", value: 84, isUnsigned: true)
!412 = !DIEnumerator(name: "TH_KEYTYPE_JITTER", value: 85, isUnsigned: true)
!413 = !DIEnumerator(name: "TH_KEYTYPE_JITTER_SELECT", value: 86, isUnsigned: true)
!414 = !DIEnumerator(name: "TH_KEYBORDER", value: 87, isUnsigned: true)
!415 = !DIEnumerator(name: "TH_KEYBORDER_SELECT", value: 88, isUnsigned: true)
!416 = !DIEnumerator(name: "TH_LAMP", value: 89, isUnsigned: true)
!417 = !DIEnumerator(name: "TH_SPEAKER", value: 90, isUnsigned: true)
!418 = !DIEnumerator(name: "TH_CAMERA", value: 91, isUnsigned: true)
!419 = !DIEnumerator(name: "TH_EMPTY", value: 92, isUnsigned: true)
!420 = !DIEnumerator(name: "TH_NODE", value: 93, isUnsigned: true)
!421 = !DIEnumerator(name: "TH_NODE_INPUT", value: 94, isUnsigned: true)
!422 = !DIEnumerator(name: "TH_NODE_OUTPUT", value: 95, isUnsigned: true)
!423 = !DIEnumerator(name: "TH_NODE_COLOR", value: 96, isUnsigned: true)
!424 = !DIEnumerator(name: "TH_NODE_FILTER", value: 97, isUnsigned: true)
!425 = !DIEnumerator(name: "TH_NODE_VECTOR", value: 98, isUnsigned: true)
!426 = !DIEnumerator(name: "TH_NODE_TEXTURE", value: 99, isUnsigned: true)
!427 = !DIEnumerator(name: "TH_NODE_PATTERN", value: 100, isUnsigned: true)
!428 = !DIEnumerator(name: "TH_NODE_SCRIPT", value: 101, isUnsigned: true)
!429 = !DIEnumerator(name: "TH_NODE_LAYOUT", value: 102, isUnsigned: true)
!430 = !DIEnumerator(name: "TH_NODE_SHADER", value: 103, isUnsigned: true)
!431 = !DIEnumerator(name: "TH_NODE_INTERFACE", value: 104, isUnsigned: true)
!432 = !DIEnumerator(name: "TH_NODE_CONVERTOR", value: 105, isUnsigned: true)
!433 = !DIEnumerator(name: "TH_NODE_GROUP", value: 106, isUnsigned: true)
!434 = !DIEnumerator(name: "TH_NODE_FRAME", value: 107, isUnsigned: true)
!435 = !DIEnumerator(name: "TH_NODE_MATTE", value: 108, isUnsigned: true)
!436 = !DIEnumerator(name: "TH_NODE_DISTORT", value: 109, isUnsigned: true)
!437 = !DIEnumerator(name: "TH_CONSOLE_OUTPUT", value: 110, isUnsigned: true)
!438 = !DIEnumerator(name: "TH_CONSOLE_INPUT", value: 111, isUnsigned: true)
!439 = !DIEnumerator(name: "TH_CONSOLE_INFO", value: 112, isUnsigned: true)
!440 = !DIEnumerator(name: "TH_CONSOLE_ERROR", value: 113, isUnsigned: true)
!441 = !DIEnumerator(name: "TH_CONSOLE_CURSOR", value: 114, isUnsigned: true)
!442 = !DIEnumerator(name: "TH_CONSOLE_SELECT", value: 115, isUnsigned: true)
!443 = !DIEnumerator(name: "TH_SEQ_MOVIE", value: 116, isUnsigned: true)
!444 = !DIEnumerator(name: "TH_SEQ_MOVIECLIP", value: 117, isUnsigned: true)
!445 = !DIEnumerator(name: "TH_SEQ_MASK", value: 118, isUnsigned: true)
!446 = !DIEnumerator(name: "TH_SEQ_IMAGE", value: 119, isUnsigned: true)
!447 = !DIEnumerator(name: "TH_SEQ_SCENE", value: 120, isUnsigned: true)
!448 = !DIEnumerator(name: "TH_SEQ_AUDIO", value: 121, isUnsigned: true)
!449 = !DIEnumerator(name: "TH_SEQ_EFFECT", value: 122, isUnsigned: true)
!450 = !DIEnumerator(name: "TH_SEQ_TRANSITION", value: 123, isUnsigned: true)
!451 = !DIEnumerator(name: "TH_SEQ_META", value: 124, isUnsigned: true)
!452 = !DIEnumerator(name: "TH_SEQ_PREVIEW", value: 125, isUnsigned: true)
!453 = !DIEnumerator(name: "TH_EDGE_SHARP", value: 126, isUnsigned: true)
!454 = !DIEnumerator(name: "TH_EDITMESH_ACTIVE", value: 127, isUnsigned: true)
!455 = !DIEnumerator(name: "TH_HANDLE_VERTEX", value: 128, isUnsigned: true)
!456 = !DIEnumerator(name: "TH_HANDLE_VERTEX_SELECT", value: 129, isUnsigned: true)
!457 = !DIEnumerator(name: "TH_HANDLE_VERTEX_SIZE", value: 130, isUnsigned: true)
!458 = !DIEnumerator(name: "TH_DOPESHEET_CHANNELOB", value: 131, isUnsigned: true)
!459 = !DIEnumerator(name: "TH_DOPESHEET_CHANNELSUBOB", value: 132, isUnsigned: true)
!460 = !DIEnumerator(name: "TH_PREVIEW_BACK", value: 133, isUnsigned: true)
!461 = !DIEnumerator(name: "TH_EDGE_CREASE", value: 134, isUnsigned: true)
!462 = !DIEnumerator(name: "TH_DRAWEXTRA_EDGELEN", value: 135, isUnsigned: true)
!463 = !DIEnumerator(name: "TH_DRAWEXTRA_EDGEANG", value: 136, isUnsigned: true)
!464 = !DIEnumerator(name: "TH_DRAWEXTRA_FACEAREA", value: 137, isUnsigned: true)
!465 = !DIEnumerator(name: "TH_DRAWEXTRA_FACEANG", value: 138, isUnsigned: true)
!466 = !DIEnumerator(name: "TH_NODE_CURVING", value: 139, isUnsigned: true)
!467 = !DIEnumerator(name: "TH_MARKER_OUTLINE", value: 140, isUnsigned: true)
!468 = !DIEnumerator(name: "TH_MARKER", value: 141, isUnsigned: true)
!469 = !DIEnumerator(name: "TH_ACT_MARKER", value: 142, isUnsigned: true)
!470 = !DIEnumerator(name: "TH_SEL_MARKER", value: 143, isUnsigned: true)
!471 = !DIEnumerator(name: "TH_BUNDLE_SOLID", value: 144, isUnsigned: true)
!472 = !DIEnumerator(name: "TH_DIS_MARKER", value: 145, isUnsigned: true)
!473 = !DIEnumerator(name: "TH_PATH_BEFORE", value: 146, isUnsigned: true)
!474 = !DIEnumerator(name: "TH_PATH_AFTER", value: 147, isUnsigned: true)
!475 = !DIEnumerator(name: "TH_CAMERA_PATH", value: 148, isUnsigned: true)
!476 = !DIEnumerator(name: "TH_LOCK_MARKER", value: 149, isUnsigned: true)
!477 = !DIEnumerator(name: "TH_STITCH_PREVIEW_FACE", value: 150, isUnsigned: true)
!478 = !DIEnumerator(name: "TH_STITCH_PREVIEW_EDGE", value: 151, isUnsigned: true)
!479 = !DIEnumerator(name: "TH_STITCH_PREVIEW_VERT", value: 152, isUnsigned: true)
!480 = !DIEnumerator(name: "TH_STITCH_PREVIEW_STITCHABLE", value: 153, isUnsigned: true)
!481 = !DIEnumerator(name: "TH_STITCH_PREVIEW_UNSTITCHABLE", value: 154, isUnsigned: true)
!482 = !DIEnumerator(name: "TH_STITCH_PREVIEW_ACTIVE", value: 155, isUnsigned: true)
!483 = !DIEnumerator(name: "TH_PAINT_CURVE_HANDLE", value: 156, isUnsigned: true)
!484 = !DIEnumerator(name: "TH_PAINT_CURVE_PIVOT", value: 157, isUnsigned: true)
!485 = !DIEnumerator(name: "TH_UV_SHADOW", value: 158, isUnsigned: true)
!486 = !DIEnumerator(name: "TH_UV_OTHERS", value: 159, isUnsigned: true)
!487 = !DIEnumerator(name: "TH_FREESTYLE_EDGE_MARK", value: 160, isUnsigned: true)
!488 = !DIEnumerator(name: "TH_FREESTYLE_FACE_MARK", value: 161, isUnsigned: true)
!489 = !DIEnumerator(name: "TH_MATCH", value: 162, isUnsigned: true)
!490 = !DIEnumerator(name: "TH_SELECT_HIGHLIGHT", value: 163, isUnsigned: true)
!491 = !DIEnumerator(name: "TH_SKIN_ROOT", value: 164, isUnsigned: true)
!492 = !DIEnumerator(name: "TH_ANIM_ACTIVE", value: 165, isUnsigned: true)
!493 = !DIEnumerator(name: "TH_ANIM_INACTIVE", value: 166, isUnsigned: true)
!494 = !DIEnumerator(name: "TH_NLA_TWEAK", value: 167, isUnsigned: true)
!495 = !DIEnumerator(name: "TH_NLA_TWEAK_DUPLI", value: 168, isUnsigned: true)
!496 = !DIEnumerator(name: "TH_NLA_TRANSITION", value: 169, isUnsigned: true)
!497 = !DIEnumerator(name: "TH_NLA_TRANSITION_SEL", value: 170, isUnsigned: true)
!498 = !DIEnumerator(name: "TH_NLA_META", value: 171, isUnsigned: true)
!499 = !DIEnumerator(name: "TH_NLA_META_SEL", value: 172, isUnsigned: true)
!500 = !DIEnumerator(name: "TH_NLA_SOUND", value: 173, isUnsigned: true)
!501 = !DIEnumerator(name: "TH_NLA_SOUND_SEL", value: 174, isUnsigned: true)
!502 = !DIEnumerator(name: "TH_EMBOSS", value: 175, isUnsigned: true)
!503 = !DIEnumerator(name: "TH_AXIS_X", value: 176, isUnsigned: true)
!504 = !DIEnumerator(name: "TH_AXIS_Y", value: 177, isUnsigned: true)
!505 = !DIEnumerator(name: "TH_AXIS_Z", value: 178, isUnsigned: true)
!506 = !DIEnumerator(name: "TH_LOW_GRAD", value: 179, isUnsigned: true)
!507 = !DIEnumerator(name: "TH_HIGH_GRAD", value: 180, isUnsigned: true)
!508 = !DIEnumerator(name: "TH_SHOW_BACK_GRAD", value: 181, isUnsigned: true)
!509 = !DIEnumerator(name: "TH_INFO_SELECTED", value: 182, isUnsigned: true)
!510 = !DIEnumerator(name: "TH_INFO_SELECTED_TEXT", value: 183, isUnsigned: true)
!511 = !DIEnumerator(name: "TH_INFO_ERROR", value: 184, isUnsigned: true)
!512 = !DIEnumerator(name: "TH_INFO_ERROR_TEXT", value: 185, isUnsigned: true)
!513 = !DIEnumerator(name: "TH_INFO_WARNING", value: 186, isUnsigned: true)
!514 = !DIEnumerator(name: "TH_INFO_WARNING_TEXT", value: 187, isUnsigned: true)
!515 = !DIEnumerator(name: "TH_INFO_INFO", value: 188, isUnsigned: true)
!516 = !DIEnumerator(name: "TH_INFO_INFO_TEXT", value: 189, isUnsigned: true)
!517 = !DIEnumerator(name: "TH_INFO_DEBUG", value: 190, isUnsigned: true)
!518 = !DIEnumerator(name: "TH_INFO_DEBUG_TEXT", value: 191, isUnsigned: true)
!519 = !DIEnumerator(name: "TH_VIEW_OVERLAY", value: 192, isUnsigned: true)
!520 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !521, line: 648, baseType: !35, size: 32, elements: !522)
!521 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!522 = !{!523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536}
!523 = !DIEnumerator(name: "OB_LOCK_LOCX", value: 1, isUnsigned: true)
!524 = !DIEnumerator(name: "OB_LOCK_LOCY", value: 2, isUnsigned: true)
!525 = !DIEnumerator(name: "OB_LOCK_LOCZ", value: 4, isUnsigned: true)
!526 = !DIEnumerator(name: "OB_LOCK_LOC", value: 7, isUnsigned: true)
!527 = !DIEnumerator(name: "OB_LOCK_ROTX", value: 8, isUnsigned: true)
!528 = !DIEnumerator(name: "OB_LOCK_ROTY", value: 16, isUnsigned: true)
!529 = !DIEnumerator(name: "OB_LOCK_ROTZ", value: 32, isUnsigned: true)
!530 = !DIEnumerator(name: "OB_LOCK_ROT", value: 56, isUnsigned: true)
!531 = !DIEnumerator(name: "OB_LOCK_SCALEX", value: 64, isUnsigned: true)
!532 = !DIEnumerator(name: "OB_LOCK_SCALEY", value: 128, isUnsigned: true)
!533 = !DIEnumerator(name: "OB_LOCK_SCALEZ", value: 256, isUnsigned: true)
!534 = !DIEnumerator(name: "OB_LOCK_SCALE", value: 448, isUnsigned: true)
!535 = !DIEnumerator(name: "OB_LOCK_ROTW", value: 512, isUnsigned: true)
!536 = !DIEnumerator(name: "OB_LOCK_ROT4D", value: 1024, isUnsigned: true)
!537 = !{!26, !538}
!538 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!539 = !{!0}
!540 = !{}
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !542, size: 6080, elements: !553)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "EnumPropertyItem", file: !543, line: 308, baseType: !544)
!543 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EnumPropertyItem", file: !543, line: 302, size: 320, elements: !545)
!545 = !{!546, !547, !550, !551, !552}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !544, file: !543, line: 303, baseType: !29, size: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !544, file: !543, line: 304, baseType: !548, size: 64, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !544, file: !543, line: 305, baseType: !29, size: 32, offset: 128)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !544, file: !543, line: 306, baseType: !548, size: 64, offset: 192)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !544, file: !543, line: 307, baseType: !548, size: 64, offset: 256)
!553 = !{!554}
!554 = !DISubrange(count: 19)
!555 = !{i32 7, !"Dwarf Version", i32 4}
!556 = !{i32 2, !"Debug Info Version", i32 3}
!557 = !{i32 1, !"wchar_size", i32 4}
!558 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!559 = !DILocalVariable(name: "keyconf", arg: 1, scope: !2, file: !3, line: 95, type: !6)
!560 = !DILocation(line: 95, column: 36, scope: !2)
!561 = !DILocalVariable(name: "keymap", scope: !2, file: !3, line: 124, type: !562)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmKeyMap", file: !8, line: 297, baseType: !564)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmKeyMap", file: !8, line: 281, size: 1088, elements: !565)
!565 = !{!566, !568, !569, !570, !571, !572, !574, !575, !576, !577, !583}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !564, file: !8, line: 282, baseType: !567, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !564, file: !8, line: 282, baseType: !567, size: 64, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !564, file: !8, line: 284, baseType: !21, size: 128, offset: 128)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "diff_items", scope: !564, file: !8, line: 285, baseType: !21, size: 128, offset: 256)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !564, file: !8, line: 287, baseType: !15, size: 512, offset: 384)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "spaceid", scope: !564, file: !8, line: 288, baseType: !573, size: 16, offset: 896)
!573 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "regionid", scope: !564, file: !8, line: 289, baseType: !573, size: 16, offset: 912)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !564, file: !8, line: 291, baseType: !573, size: 16, offset: 928)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "kmi_id", scope: !564, file: !8, line: 292, baseType: !573, size: 16, offset: 944)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !564, file: !8, line: 295, baseType: !578, size: 64, offset: 960)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{!29, !581}
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !543, line: 44, flags: DIFlagFwdDecl)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "modal_items", scope: !564, file: !8, line: 296, baseType: !26, size: 64, offset: 1024)
!584 = !DILocation(line: 124, column: 12, scope: !2)
!585 = !DILocation(line: 124, column: 40, scope: !2)
!586 = !DILocation(line: 124, column: 21, scope: !2)
!587 = !DILocation(line: 127, column: 6, scope: !588)
!588 = distinct !DILexicalBlock(scope: !2, file: !3, line: 127, column: 6)
!589 = !DILocation(line: 127, column: 13, scope: !588)
!590 = !DILocation(line: 127, column: 16, scope: !588)
!591 = !DILocation(line: 127, column: 24, scope: !588)
!592 = !DILocation(line: 127, column: 6, scope: !2)
!593 = !DILocation(line: 128, column: 3, scope: !588)
!594 = !DILocation(line: 130, column: 30, scope: !2)
!595 = !DILocation(line: 130, column: 11, scope: !2)
!596 = !DILocation(line: 130, column: 9, scope: !2)
!597 = !DILocation(line: 133, column: 26, scope: !2)
!598 = !DILocation(line: 133, column: 2, scope: !2)
!599 = !DILocation(line: 134, column: 26, scope: !2)
!600 = !DILocation(line: 134, column: 2, scope: !2)
!601 = !DILocation(line: 136, column: 26, scope: !2)
!602 = !DILocation(line: 136, column: 2, scope: !2)
!603 = !DILocation(line: 137, column: 26, scope: !2)
!604 = !DILocation(line: 137, column: 2, scope: !2)
!605 = !DILocation(line: 138, column: 26, scope: !2)
!606 = !DILocation(line: 138, column: 2, scope: !2)
!607 = !DILocation(line: 139, column: 26, scope: !2)
!608 = !DILocation(line: 139, column: 2, scope: !2)
!609 = !DILocation(line: 141, column: 26, scope: !2)
!610 = !DILocation(line: 141, column: 2, scope: !2)
!611 = !DILocation(line: 142, column: 26, scope: !2)
!612 = !DILocation(line: 142, column: 2, scope: !2)
!613 = !DILocation(line: 143, column: 26, scope: !2)
!614 = !DILocation(line: 143, column: 2, scope: !2)
!615 = !DILocation(line: 144, column: 26, scope: !2)
!616 = !DILocation(line: 144, column: 2, scope: !2)
!617 = !DILocation(line: 146, column: 26, scope: !2)
!618 = !DILocation(line: 146, column: 2, scope: !2)
!619 = !DILocation(line: 148, column: 26, scope: !2)
!620 = !DILocation(line: 148, column: 2, scope: !2)
!621 = !DILocation(line: 150, column: 26, scope: !2)
!622 = !DILocation(line: 150, column: 2, scope: !2)
!623 = !DILocation(line: 153, column: 26, scope: !2)
!624 = !DILocation(line: 153, column: 2, scope: !2)
!625 = !DILocation(line: 154, column: 26, scope: !2)
!626 = !DILocation(line: 154, column: 2, scope: !2)
!627 = !DILocation(line: 155, column: 26, scope: !2)
!628 = !DILocation(line: 155, column: 2, scope: !2)
!629 = !DILocation(line: 156, column: 26, scope: !2)
!630 = !DILocation(line: 156, column: 2, scope: !2)
!631 = !DILocation(line: 157, column: 26, scope: !2)
!632 = !DILocation(line: 157, column: 2, scope: !2)
!633 = !DILocation(line: 158, column: 26, scope: !2)
!634 = !DILocation(line: 158, column: 2, scope: !2)
!635 = !DILocation(line: 161, column: 26, scope: !2)
!636 = !DILocation(line: 161, column: 2, scope: !2)
!637 = !DILocation(line: 162, column: 26, scope: !2)
!638 = !DILocation(line: 162, column: 2, scope: !2)
!639 = !DILocation(line: 164, column: 26, scope: !2)
!640 = !DILocation(line: 164, column: 2, scope: !2)
!641 = !DILocation(line: 165, column: 26, scope: !2)
!642 = !DILocation(line: 165, column: 2, scope: !2)
!643 = !DILocation(line: 166, column: 26, scope: !2)
!644 = !DILocation(line: 166, column: 2, scope: !2)
!645 = !DILocation(line: 167, column: 26, scope: !2)
!646 = !DILocation(line: 167, column: 2, scope: !2)
!647 = !DILocation(line: 169, column: 26, scope: !2)
!648 = !DILocation(line: 169, column: 2, scope: !2)
!649 = !DILocation(line: 170, column: 26, scope: !2)
!650 = !DILocation(line: 170, column: 2, scope: !2)
!651 = !DILocation(line: 172, column: 26, scope: !2)
!652 = !DILocation(line: 172, column: 2, scope: !2)
!653 = !DILocation(line: 173, column: 26, scope: !2)
!654 = !DILocation(line: 173, column: 2, scope: !2)
!655 = !DILocation(line: 176, column: 26, scope: !2)
!656 = !DILocation(line: 176, column: 2, scope: !2)
!657 = !DILocation(line: 177, column: 26, scope: !2)
!658 = !DILocation(line: 177, column: 2, scope: !2)
!659 = !DILocation(line: 179, column: 26, scope: !2)
!660 = !DILocation(line: 179, column: 2, scope: !2)
!661 = !DILocation(line: 180, column: 26, scope: !2)
!662 = !DILocation(line: 180, column: 2, scope: !2)
!663 = !DILocation(line: 183, column: 24, scope: !2)
!664 = !DILocation(line: 183, column: 2, scope: !2)
!665 = !DILocation(line: 184, column: 1, scope: !2)
!666 = distinct !DISubprogram(name: "VIEW3D_OT_fly", scope: !3, file: !3, line: 1044, type: !667, scopeLine: 1045, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !31, retainedNodes: !540)
!667 = !DISubroutineType(types: !668)
!668 = !{null, !669}
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorType", file: !257, line: 568, baseType: !671)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !257, line: 508, size: 1536, elements: !672)
!672 = !{!673, !674, !675, !676, !677, !2371, !2375, !2381, !2385, !2386, !2387, !2388, !2389, !2390, !2394, !2395, !2396, !2397, !2401, !2427}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !671, file: !257, line: 509, baseType: !548, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !671, file: !257, line: 510, baseType: !548, size: 64, offset: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !671, file: !257, line: 511, baseType: !548, size: 64, offset: 128)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !671, file: !257, line: 512, baseType: !548, size: 64, offset: 192)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !671, file: !257, line: 518, baseType: !678, size: 64, offset: 256)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DISubroutineType(types: !680)
!680 = !{!29, !581, !681}
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !8, line: 328, size: 1344, elements: !683)
!683 = !{!684, !685, !686, !687, !711, !713, !714, !715, !727, !2364, !2365, !2366, !2369, !2370}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !682, file: !8, line: 329, baseType: !681, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !682, file: !8, line: 329, baseType: !681, size: 64, offset: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !682, file: !8, line: 332, baseType: !15, size: 512, offset: 128)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !682, file: !8, line: 333, baseType: !688, size: 64, offset: 640)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !690, line: 75, baseType: !691)
!690 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !690, line: 62, size: 1024, elements: !692)
!692 = !{!693, !695, !696, !697, !698, !699, !700, !701, !709, !710}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !691, file: !690, line: 63, baseType: !694, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !691, file: !690, line: 63, baseType: !694, size: 64, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !691, file: !690, line: 64, baseType: !16, size: 8, offset: 128)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !691, file: !690, line: 64, baseType: !16, size: 8, offset: 136)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !691, file: !690, line: 65, baseType: !573, size: 16, offset: 144)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !691, file: !690, line: 66, baseType: !15, size: 512, offset: 160)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !691, file: !690, line: 67, baseType: !29, size: 32, offset: 672)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !691, file: !690, line: 69, baseType: !702, size: 256, offset: 704)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !690, line: 60, baseType: !703)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !690, line: 48, size: 256, elements: !704)
!704 = !{!705, !706, !707, !708}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !703, file: !690, line: 49, baseType: !26, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !703, file: !690, line: 58, baseType: !21, size: 128, offset: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !703, file: !690, line: 59, baseType: !29, size: 32, offset: 192)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !703, file: !690, line: 59, baseType: !29, size: 32, offset: 224)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !691, file: !690, line: 70, baseType: !29, size: 32, offset: 960)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !691, file: !690, line: 74, baseType: !29, size: 32, offset: 992)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !682, file: !8, line: 336, baseType: !712, size: 64, offset: 704)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !682, file: !8, line: 337, baseType: !26, size: 64, offset: 768)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !682, file: !8, line: 338, baseType: !26, size: 64, offset: 832)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !682, file: !8, line: 340, baseType: !716, size: 64, offset: 896)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !543, line: 55, size: 192, elements: !718)
!718 = !{!719, !723, !726}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !717, file: !543, line: 58, baseType: !720, size: 64)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !717, file: !543, line: 56, size: 64, elements: !721)
!721 = !{!722}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !720, file: !543, line: 57, baseType: !26, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !717, file: !543, line: 60, baseType: !724, size: 64, offset: 64)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !543, line: 41, flags: DIFlagFwdDecl)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !717, file: !543, line: 61, baseType: !26, size: 64, offset: 128)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !682, file: !8, line: 341, baseType: !728, size: 64, offset: 960)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !8, line: 106, size: 320, elements: !730)
!730 = !{!731, !732, !733, !734, !735, !736}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !729, file: !8, line: 107, baseType: !21, size: 128)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !729, file: !8, line: 108, baseType: !29, size: 32, offset: 128)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !729, file: !8, line: 109, baseType: !29, size: 32, offset: 160)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !729, file: !8, line: 110, baseType: !29, size: 32, offset: 192)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !729, file: !8, line: 110, baseType: !29, size: 32, offset: 224)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !729, file: !8, line: 111, baseType: !737, size: 64, offset: 256)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !257, line: 490, size: 768, elements: !739)
!739 = !{!740, !741, !742, !2355, !2356, !2357, !2358, !2359, !2360, !2361, !2362, !2363}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !738, file: !257, line: 491, baseType: !737, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !738, file: !257, line: 491, baseType: !737, size: 64, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !738, file: !257, line: 493, baseType: !743, size: 64, offset: 128)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !8, line: 169, size: 2048, elements: !745)
!745 = !{!746, !747, !748, !749, !2272, !2273, !2274, !2275, !2276, !2277, !2278, !2279, !2280, !2281, !2282, !2283, !2284, !2285, !2286, !2287, !2288, !2289, !2330, !2333, !2347, !2348, !2349, !2350, !2351, !2352, !2353, !2354}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !744, file: !8, line: 170, baseType: !743, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !744, file: !8, line: 170, baseType: !743, size: 64, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !744, file: !8, line: 172, baseType: !26, size: 64, offset: 128)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !744, file: !8, line: 174, baseType: !750, size: 64, offset: 192)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !752, line: 49, size: 1984, elements: !753)
!752 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!753 = !{!754, !790, !791, !792, !793, !794, !2255, !2256, !2257, !2258, !2259, !2260, !2261, !2262, !2263, !2264, !2265, !2266, !2267, !2268, !2269, !2270, !2271}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !751, file: !752, line: 50, baseType: !755, size: 960)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !690, line: 130, baseType: !756)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !690, line: 117, size: 960, elements: !757)
!757 = !{!758, !759, !760, !762, !781, !785, !786, !787, !788, !789}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !756, file: !690, line: 118, baseType: !26, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !756, file: !690, line: 118, baseType: !26, size: 64, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !756, file: !690, line: 119, baseType: !761, size: 64, offset: 128)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !756, file: !690, line: 120, baseType: !763, size: 64, offset: 192)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !690, line: 136, size: 17600, elements: !765)
!765 = !{!766, !767, !769, !772, !776, !777, !778}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !764, file: !690, line: 137, baseType: !755, size: 960)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !764, file: !690, line: 138, baseType: !768, size: 64, offset: 960)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !764, file: !690, line: 139, baseType: !770, size: 64, offset: 1024)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !690, line: 43, flags: DIFlagFwdDecl)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !764, file: !690, line: 140, baseType: !773, size: 8192, offset: 1088)
!773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 8192, elements: !774)
!774 = !{!775}
!775 = !DISubrange(count: 1024)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !764, file: !690, line: 141, baseType: !773, size: 8192, offset: 9280)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !764, file: !690, line: 148, baseType: !763, size: 64, offset: 17472)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !764, file: !690, line: 150, baseType: !779, size: 64, offset: 17536)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !690, line: 45, flags: DIFlagFwdDecl)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !756, file: !690, line: 121, baseType: !782, size: 528, offset: 256)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 528, elements: !783)
!783 = !{!784}
!784 = !DISubrange(count: 66)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !756, file: !690, line: 126, baseType: !573, size: 16, offset: 784)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !756, file: !690, line: 127, baseType: !29, size: 32, offset: 800)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !756, file: !690, line: 128, baseType: !29, size: 32, offset: 832)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !756, file: !690, line: 128, baseType: !29, size: 32, offset: 864)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !756, file: !690, line: 129, baseType: !688, size: 64, offset: 896)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !751, file: !752, line: 52, baseType: !21, size: 128, offset: 960)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !751, file: !752, line: 53, baseType: !21, size: 128, offset: 1088)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !751, file: !752, line: 54, baseType: !21, size: 128, offset: 1216)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !751, file: !752, line: 55, baseType: !21, size: 128, offset: 1344)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !751, file: !752, line: 57, baseType: !795, size: 64, offset: 1472)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !797, line: 1216, size: 39680, elements: !798)
!797 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!798 = !{!799, !800, !804, !1094, !1097, !1098, !1099, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1125, !1196, !1624, !1839, !1842, !2130, !2142, !2143, !2144, !2145, !2146, !2147, !2148, !2149, !2152, !2153, !2154, !2155, !2156, !2164, !2231, !2238, !2239, !2246, !2247, !2248, !2249, !2250, !2251, !2252}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !796, file: !797, line: 1217, baseType: !755, size: 960)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !796, file: !797, line: 1218, baseType: !801, size: 64, offset: 960)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !803, line: 45, flags: DIFlagFwdDecl)
!803 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!804 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !796, file: !797, line: 1220, baseType: !805, size: 64, offset: 1024)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !521, line: 115, size: 11392, elements: !807)
!807 = !{!808, !809, !810, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !827, !838, !852, !853, !896, !897, !900, !901, !917, !918, !919, !920, !921, !922, !923, !927, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !943, !944, !945, !946, !947, !948, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1019, !1022, !1025, !1026, !1027, !1028, !1029, !1032, !1035, !1038, !1039, !1045, !1046, !1047, !1048, !1049, !1050, !1052, !1055, !1058, !1062, !1082, !1083}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !806, file: !521, line: 116, baseType: !755, size: 960)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !806, file: !521, line: 117, baseType: !801, size: 64, offset: 960)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !806, file: !521, line: 119, baseType: !811, size: 64, offset: 1024)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !521, line: 57, flags: DIFlagFwdDecl)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !806, file: !521, line: 121, baseType: !573, size: 16, offset: 1088)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !806, file: !521, line: 121, baseType: !573, size: 16, offset: 1104)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !806, file: !521, line: 122, baseType: !29, size: 32, offset: 1120)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !806, file: !521, line: 122, baseType: !29, size: 32, offset: 1152)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !806, file: !521, line: 122, baseType: !29, size: 32, offset: 1184)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !806, file: !521, line: 123, baseType: !15, size: 512, offset: 1216)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !806, file: !521, line: 124, baseType: !805, size: 64, offset: 1728)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !806, file: !521, line: 124, baseType: !805, size: 64, offset: 1792)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !806, file: !521, line: 127, baseType: !805, size: 64, offset: 1856)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !806, file: !521, line: 127, baseType: !805, size: 64, offset: 1920)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !806, file: !521, line: 127, baseType: !805, size: 64, offset: 1984)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !806, file: !521, line: 128, baseType: !825, size: 64, offset: 2048)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !803, line: 46, flags: DIFlagFwdDecl)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !806, file: !521, line: 130, baseType: !828, size: 64, offset: 2112)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !521, line: 97, size: 832, elements: !830)
!830 = !{!831, !836, !837}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !829, file: !521, line: 98, baseType: !832, size: 768)
!832 = !DICompositeType(tag: DW_TAG_array_type, baseType: !538, size: 768, elements: !833)
!833 = !{!834, !835}
!834 = !DISubrange(count: 8)
!835 = !DISubrange(count: 3)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !829, file: !521, line: 99, baseType: !29, size: 32, offset: 768)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !829, file: !521, line: 99, baseType: !29, size: 32, offset: 800)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !806, file: !521, line: 131, baseType: !839, size: 64, offset: 2176)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !841, line: 486, size: 1600, elements: !842)
!841 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!842 = !{!843, !844, !845, !846, !847, !848, !849, !850, !851}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !840, file: !841, line: 487, baseType: !755, size: 960)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !840, file: !841, line: 489, baseType: !21, size: 128, offset: 960)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !840, file: !841, line: 490, baseType: !21, size: 128, offset: 1088)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !840, file: !841, line: 491, baseType: !21, size: 128, offset: 1216)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !840, file: !841, line: 492, baseType: !21, size: 128, offset: 1344)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !840, file: !841, line: 494, baseType: !29, size: 32, offset: 1472)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !840, file: !841, line: 495, baseType: !29, size: 32, offset: 1504)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !840, file: !841, line: 497, baseType: !29, size: 32, offset: 1536)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !840, file: !841, line: 498, baseType: !29, size: 32, offset: 1568)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !806, file: !521, line: 132, baseType: !839, size: 64, offset: 2240)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !806, file: !521, line: 133, baseType: !854, size: 64, offset: 2304)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !841, line: 334, size: 1728, elements: !856)
!856 = !{!857, !858, !861, !862, !863, !864, !865, !866, !869, !870, !871, !872, !873, !874, !875, !895}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !855, file: !841, line: 335, baseType: !21, size: 128)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !855, file: !841, line: 336, baseType: !859, size: 64, offset: 128)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !841, line: 47, flags: DIFlagFwdDecl)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !855, file: !841, line: 338, baseType: !573, size: 16, offset: 192)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !855, file: !841, line: 338, baseType: !573, size: 16, offset: 208)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !855, file: !841, line: 339, baseType: !35, size: 32, offset: 224)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !855, file: !841, line: 340, baseType: !29, size: 32, offset: 256)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !855, file: !841, line: 342, baseType: !538, size: 32, offset: 288)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !855, file: !841, line: 343, baseType: !867, size: 96, offset: 320)
!867 = !DICompositeType(tag: DW_TAG_array_type, baseType: !538, size: 96, elements: !868)
!868 = !{!835}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !855, file: !841, line: 344, baseType: !867, size: 96, offset: 416)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !855, file: !841, line: 347, baseType: !21, size: 128, offset: 512)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !855, file: !841, line: 349, baseType: !29, size: 32, offset: 640)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !855, file: !841, line: 350, baseType: !29, size: 32, offset: 672)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !855, file: !841, line: 351, baseType: !26, size: 64, offset: 704)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !855, file: !841, line: 352, baseType: !26, size: 64, offset: 768)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !855, file: !841, line: 354, baseType: !876, size: 384, offset: 832)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !841, line: 116, baseType: !877)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !841, line: 94, size: 384, elements: !878)
!878 = !{!879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !877, file: !841, line: 96, baseType: !29, size: 32)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !877, file: !841, line: 96, baseType: !29, size: 32, offset: 32)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !877, file: !841, line: 97, baseType: !29, size: 32, offset: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !877, file: !841, line: 97, baseType: !29, size: 32, offset: 96)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !877, file: !841, line: 99, baseType: !573, size: 16, offset: 128)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !877, file: !841, line: 100, baseType: !573, size: 16, offset: 144)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !877, file: !841, line: 102, baseType: !573, size: 16, offset: 160)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !877, file: !841, line: 105, baseType: !573, size: 16, offset: 176)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !877, file: !841, line: 108, baseType: !573, size: 16, offset: 192)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !877, file: !841, line: 109, baseType: !573, size: 16, offset: 208)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !877, file: !841, line: 111, baseType: !573, size: 16, offset: 224)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !877, file: !841, line: 112, baseType: !573, size: 16, offset: 240)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !877, file: !841, line: 114, baseType: !29, size: 32, offset: 256)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !877, file: !841, line: 114, baseType: !29, size: 32, offset: 288)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !877, file: !841, line: 115, baseType: !29, size: 32, offset: 320)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !877, file: !841, line: 115, baseType: !29, size: 32, offset: 352)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !855, file: !841, line: 355, baseType: !15, size: 512, offset: 1216)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !806, file: !521, line: 134, baseType: !26, size: 64, offset: 2368)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !806, file: !521, line: 136, baseType: !898, size: 64, offset: 2432)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !521, line: 58, flags: DIFlagFwdDecl)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !806, file: !521, line: 138, baseType: !876, size: 384, offset: 2496)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !806, file: !521, line: 139, baseType: !902, size: 64, offset: 2880)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !841, line: 80, baseType: !904)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !841, line: 72, size: 192, elements: !905)
!905 = !{!906, !913, !914, !915, !916}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !904, file: !841, line: 73, baseType: !907, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !841, line: 59, baseType: !909)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !841, line: 56, size: 128, elements: !910)
!910 = !{!911, !912}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !909, file: !841, line: 57, baseType: !867, size: 96)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !909, file: !841, line: 58, baseType: !29, size: 32, offset: 96)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !904, file: !841, line: 74, baseType: !29, size: 32, offset: 64)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !904, file: !841, line: 76, baseType: !29, size: 32, offset: 96)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !904, file: !841, line: 77, baseType: !29, size: 32, offset: 128)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !904, file: !841, line: 79, baseType: !29, size: 32, offset: 160)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !806, file: !521, line: 141, baseType: !21, size: 128, offset: 2944)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !806, file: !521, line: 142, baseType: !21, size: 128, offset: 3072)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !806, file: !521, line: 143, baseType: !21, size: 128, offset: 3200)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !806, file: !521, line: 144, baseType: !21, size: 128, offset: 3328)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !806, file: !521, line: 146, baseType: !29, size: 32, offset: 3456)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !806, file: !521, line: 147, baseType: !29, size: 32, offset: 3488)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !806, file: !521, line: 150, baseType: !924, size: 64, offset: 3520)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !521, line: 50, flags: DIFlagFwdDecl)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !806, file: !521, line: 151, baseType: !928, size: 64, offset: 3584)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !806, file: !521, line: 152, baseType: !29, size: 32, offset: 3648)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !806, file: !521, line: 153, baseType: !29, size: 32, offset: 3680)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !806, file: !521, line: 156, baseType: !867, size: 96, offset: 3712)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !806, file: !521, line: 156, baseType: !867, size: 96, offset: 3808)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !806, file: !521, line: 156, baseType: !867, size: 96, offset: 3904)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !806, file: !521, line: 157, baseType: !867, size: 96, offset: 4000)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !806, file: !521, line: 158, baseType: !867, size: 96, offset: 4096)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !806, file: !521, line: 159, baseType: !867, size: 96, offset: 4192)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !806, file: !521, line: 160, baseType: !867, size: 96, offset: 4288)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !806, file: !521, line: 160, baseType: !867, size: 96, offset: 4384)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !806, file: !521, line: 161, baseType: !940, size: 128, offset: 4480)
!940 = !DICompositeType(tag: DW_TAG_array_type, baseType: !538, size: 128, elements: !941)
!941 = !{!942}
!942 = !DISubrange(count: 4)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !806, file: !521, line: 161, baseType: !940, size: 128, offset: 4608)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !806, file: !521, line: 162, baseType: !867, size: 96, offset: 4736)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !806, file: !521, line: 162, baseType: !867, size: 96, offset: 4832)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !806, file: !521, line: 163, baseType: !538, size: 32, offset: 4928)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !806, file: !521, line: 163, baseType: !538, size: 32, offset: 4960)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !806, file: !521, line: 164, baseType: !949, size: 512, offset: 4992)
!949 = !DICompositeType(tag: DW_TAG_array_type, baseType: !538, size: 512, elements: !950)
!950 = !{!942, !942}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !806, file: !521, line: 165, baseType: !949, size: 512, offset: 5504)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !806, file: !521, line: 166, baseType: !949, size: 512, offset: 6016)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !806, file: !521, line: 167, baseType: !949, size: 512, offset: 6528)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !806, file: !521, line: 176, baseType: !949, size: 512, offset: 7040)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !806, file: !521, line: 178, baseType: !35, size: 32, offset: 7552)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !806, file: !521, line: 180, baseType: !573, size: 16, offset: 7584)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !806, file: !521, line: 181, baseType: !573, size: 16, offset: 7600)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !806, file: !521, line: 183, baseType: !573, size: 16, offset: 7616)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !806, file: !521, line: 183, baseType: !573, size: 16, offset: 7632)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !806, file: !521, line: 184, baseType: !573, size: 16, offset: 7648)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !806, file: !521, line: 184, baseType: !573, size: 16, offset: 7664)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !806, file: !521, line: 185, baseType: !573, size: 16, offset: 7680)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !806, file: !521, line: 186, baseType: !573, size: 16, offset: 7696)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !806, file: !521, line: 187, baseType: !573, size: 16, offset: 7712)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !806, file: !521, line: 188, baseType: !16, size: 8, offset: 7728)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !806, file: !521, line: 189, baseType: !16, size: 8, offset: 7736)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !806, file: !521, line: 192, baseType: !29, size: 32, offset: 7744)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !806, file: !521, line: 192, baseType: !29, size: 32, offset: 7776)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !806, file: !521, line: 192, baseType: !29, size: 32, offset: 7808)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !806, file: !521, line: 192, baseType: !29, size: 32, offset: 7840)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !806, file: !521, line: 194, baseType: !29, size: 32, offset: 7872)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !806, file: !521, line: 202, baseType: !538, size: 32, offset: 7904)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !806, file: !521, line: 202, baseType: !538, size: 32, offset: 7936)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !806, file: !521, line: 202, baseType: !538, size: 32, offset: 7968)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !806, file: !521, line: 211, baseType: !538, size: 32, offset: 8000)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !806, file: !521, line: 212, baseType: !538, size: 32, offset: 8032)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !806, file: !521, line: 213, baseType: !538, size: 32, offset: 8064)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !806, file: !521, line: 214, baseType: !538, size: 32, offset: 8096)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !806, file: !521, line: 215, baseType: !538, size: 32, offset: 8128)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !806, file: !521, line: 216, baseType: !538, size: 32, offset: 8160)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !806, file: !521, line: 219, baseType: !538, size: 32, offset: 8192)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !806, file: !521, line: 220, baseType: !538, size: 32, offset: 8224)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !806, file: !521, line: 221, baseType: !538, size: 32, offset: 8256)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !806, file: !521, line: 224, baseType: !985, size: 16, offset: 8288)
!985 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !806, file: !521, line: 224, baseType: !985, size: 16, offset: 8304)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !806, file: !521, line: 226, baseType: !573, size: 16, offset: 8320)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !806, file: !521, line: 228, baseType: !16, size: 8, offset: 8336)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !806, file: !521, line: 229, baseType: !16, size: 8, offset: 8344)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !806, file: !521, line: 231, baseType: !573, size: 16, offset: 8352)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !806, file: !521, line: 232, baseType: !16, size: 8, offset: 8368)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !806, file: !521, line: 233, baseType: !16, size: 8, offset: 8376)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !806, file: !521, line: 234, baseType: !538, size: 32, offset: 8384)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !806, file: !521, line: 235, baseType: !538, size: 32, offset: 8416)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !806, file: !521, line: 237, baseType: !21, size: 128, offset: 8448)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !806, file: !521, line: 238, baseType: !21, size: 128, offset: 8576)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !806, file: !521, line: 239, baseType: !21, size: 128, offset: 8704)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !806, file: !521, line: 240, baseType: !21, size: 128, offset: 8832)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !806, file: !521, line: 242, baseType: !538, size: 32, offset: 8960)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !806, file: !521, line: 244, baseType: !573, size: 16, offset: 8992)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !806, file: !521, line: 245, baseType: !985, size: 16, offset: 9008)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !806, file: !521, line: 246, baseType: !940, size: 128, offset: 9024)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !806, file: !521, line: 248, baseType: !29, size: 32, offset: 9152)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !806, file: !521, line: 249, baseType: !29, size: 32, offset: 9184)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !806, file: !521, line: 251, baseType: !1006, size: 64, offset: 9216)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !521, line: 251, flags: DIFlagFwdDecl)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !806, file: !521, line: 253, baseType: !16, size: 8, offset: 9280)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !806, file: !521, line: 254, baseType: !16, size: 8, offset: 9288)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !806, file: !521, line: 255, baseType: !573, size: 16, offset: 9296)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !806, file: !521, line: 256, baseType: !867, size: 96, offset: 9312)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !806, file: !521, line: 258, baseType: !21, size: 128, offset: 9408)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !806, file: !521, line: 259, baseType: !21, size: 128, offset: 9536)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !806, file: !521, line: 260, baseType: !21, size: 128, offset: 9664)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !806, file: !521, line: 261, baseType: !21, size: 128, offset: 9792)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !806, file: !521, line: 263, baseType: !1017, size: 64, offset: 9920)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !521, line: 52, flags: DIFlagFwdDecl)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !806, file: !521, line: 264, baseType: !1020, size: 64, offset: 9984)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !521, line: 53, flags: DIFlagFwdDecl)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !806, file: !521, line: 265, baseType: !1023, size: 64, offset: 10048)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !841, line: 46, flags: DIFlagFwdDecl)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !806, file: !521, line: 267, baseType: !16, size: 8, offset: 10112)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !806, file: !521, line: 268, baseType: !16, size: 8, offset: 10120)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !806, file: !521, line: 269, baseType: !573, size: 16, offset: 10128)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !806, file: !521, line: 270, baseType: !538, size: 32, offset: 10144)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !806, file: !521, line: 272, baseType: !1030, size: 64, offset: 10176)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !521, line: 54, flags: DIFlagFwdDecl)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !806, file: !521, line: 275, baseType: !1033, size: 64, offset: 10240)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64)
!1034 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !521, line: 275, flags: DIFlagFwdDecl)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !806, file: !521, line: 277, baseType: !1036, size: 64, offset: 10304)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !521, line: 56, flags: DIFlagFwdDecl)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !806, file: !521, line: 277, baseType: !1036, size: 64, offset: 10368)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !806, file: !521, line: 278, baseType: !1040, size: 64, offset: 10432)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1041, line: 27, baseType: !1042)
!1041 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !1043, line: 45, baseType: !1044)
!1043 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!1044 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !806, file: !521, line: 279, baseType: !1040, size: 64, offset: 10496)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !806, file: !521, line: 280, baseType: !35, size: 32, offset: 10560)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !806, file: !521, line: 281, baseType: !35, size: 32, offset: 10592)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !806, file: !521, line: 283, baseType: !21, size: 128, offset: 10624)
