; ModuleID = 'blender/source/blender/blenkernel/intern/mesh_validate.c'
source_filename = "blender/source/blender/blenkernel/intern/mesh_validate.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Mesh = type { %struct.ID, %struct.AnimData*, %struct.BoundBox*, %struct.Ipo*, %struct.Key*, %struct.Material**, %struct.MSelect*, %struct.MPoly*, %struct.MTexPoly*, %struct.MLoop*, %struct.MLoopUV*, %struct.MLoopCol*, %struct.MFace*, %struct.MTFace*, %struct.TFace*, %struct.MVert*, %struct.MEdge*, %struct.MDeformVert*, %struct.MCol*, %struct.Mesh*, %struct.BMEditMesh*, %struct.CustomData, %struct.CustomData, %struct.CustomData, %struct.CustomData, %struct.CustomData, i32, i32, i32, i32, i32, i32, i32, [3 x float], [3 x float], [3 x float], i32, i16, i16, float, i32, i8, i8, i8, i8, i8, i8, i16, %struct.Multires* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.FileData = type opaque
%struct.PackedFile = type opaque
%struct.IDProperty = type { %struct.IDProperty*, %struct.IDProperty*, i8, i8, i16, [64 x i8], i32, %struct.IDPropertyData, i32, i32 }
%struct.IDPropertyData = type { i8*, %struct.ListBase, i32, i32 }
%struct.ListBase = type { i8*, i8* }
%struct.AnimData = type opaque

!27 = !DIEnumerator(name: "CD_ORCO", value: 14, isUnsigned: true)
!28 = !DIEnumerator(name: "CD_MTEXPOLY", value: 15, isUnsigned: true)
!29 = !DIEnumerator(name: "CD_MLOOPUV", value: 16, isUnsigned: true)
!30 = !DIEnumerator(name: "CD_MLOOPCOL", value: 17, isUnsigned: true)
!31 = !DIEnumerator(name: "CD_TANGENT", value: 18, isUnsigned: true)
!32 = !DIEnumerator(name: "CD_MDISPS", value: 19, isUnsigned: true)
!33 = !DIEnumerator(name: "CD_PREVIEW_MCOL", value: 20, isUnsigned: true)
!34 = !DIEnumerator(name: "CD_ID_MCOL", value: 21, isUnsigned: true)
!35 = !DIEnumerator(name: "CD_TEXTURE_MCOL", value: 22, isUnsigned: true)
!36 = !DIEnumerator(name: "CD_CLOTH_ORCO", value: 23, isUnsigned: true)
!37 = !DIEnumerator(name: "CD_RECAST", value: 24, isUnsigned: true)
!38 = !DIEnumerator(name: "CD_MPOLY", value: 25, isUnsigned: true)
!39 = !DIEnumerator(name: "CD_MLOOP", value: 26, isUnsigned: true)
!40 = !DIEnumerator(name: "CD_SHAPE_KEYINDEX", value: 27, isUnsigned: true)
!41 = !DIEnumerator(name: "CD_SHAPEKEY", value: 28, isUnsigned: true)
!42 = !DIEnumerator(name: "CD_BWEIGHT", value: 29, isUnsigned: true)
!43 = !DIEnumerator(name: "CD_CREASE", value: 30, isUnsigned: true)
!44 = !DIEnumerator(name: "CD_ORIGSPACE_MLOOP", value: 31, isUnsigned: true)
!45 = !DIEnumerator(name: "CD_PREVIEW_MLOOPCOL", value: 32, isUnsigned: true)
!46 = !DIEnumerator(name: "CD_BM_ELEM_PYPTR", value: 33, isUnsigned: true)
!47 = !DIEnumerator(name: "CD_PAINT_MASK", value: 34, isUnsigned: true)
!48 = !DIEnumerator(name: "CD_GRID_PAINT_MASK", value: 35, isUnsigned: true)
!49 = !DIEnumerator(name: "CD_MVERT_SKIN", value: 36, isUnsigned: true)
!50 = !DIEnumerator(name: "CD_FREESTYLE_EDGE", value: 37, isUnsigned: true)
!51 = !DIEnumerator(name: "CD_FREESTYLE_FACE", value: 38, isUnsigned: true)
!52 = !DIEnumerator(name: "CD_MLOOPTANGENT", value: 39, isUnsigned: true)
!53 = !DIEnumerator(name: "CD_TESSLOOPNORMAL", value: 40, isUnsigned: true)
!54 = !DIEnumerator(name: "CD_NUMTYPES", value: 41, isUnsigned: true)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !56, line: 519, baseType: !5, size: 32, elements: !57)
!56 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!57 = !{!58, !59, !60, !61}
!58 = !DIEnumerator(name: "OB_RECALC_OB", value: 1, isUnsigned: true)
!59 = !DIEnumerator(name: "OB_RECALC_DATA", value: 2, isUnsigned: true)
!60 = !DIEnumerator(name: "OB_RECALC_TIME", value: 4, isUnsigned: true)
!61 = !DIEnumerator(name: "OB_RECALC_ALL", value: 7, isUnsigned: true)
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 313, baseType: !5, size: 32, elements: !63)
!63 = !{!64, !65, !66, !67, !68, !69}
!64 = !DIEnumerator(name: "ME_EDGEDRAW", value: 2, isUnsigned: true)
!65 = !DIEnumerator(name: "ME_SEAM", value: 4, isUnsigned: true)
!66 = !DIEnumerator(name: "ME_EDGERENDER", value: 32, isUnsigned: true)
!67 = !DIEnumerator(name: "ME_LOOSEEDGE", value: 128, isUnsigned: true)
!68 = !DIEnumerator(name: "ME_EDGE_TMP_TAG", value: 256, isUnsigned: true)
!69 = !DIEnumerator(name: "ME_SHARP", value: 512, isUnsigned: true)
!70 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 332, baseType: !5, size: 32, elements: !71)
!71 = !{!72, !73, !74, !75, !76}
!72 = !DIEnumerator(name: "ME_V1V2", value: 1, isUnsigned: true)
!73 = !DIEnumerator(name: "ME_V2V3", value: 2, isUnsigned: true)
!74 = !DIEnumerator(name: "ME_V3V1", value: 4, isUnsigned: true)
!75 = !DIEnumerator(name: "ME_V3V4", value: 4, isUnsigned: true)
!76 = !DIEnumerator(name: "ME_V4V1", value: 8, isUnsigned: true)
!77 = !{!78, !79, !82, !83, !89, !90, !96, !5, !97}
!78 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !80, line: 87, baseType: !81)
!80 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!81 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !86, line: 27, baseType: !87)
!86 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !88, line: 44, baseType: !81)
!88 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataMask", file: !91, line: 48, baseType: !92)
!91 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_customdata.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !93, line: 27, baseType: !94)
!93 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !88, line: 45, baseType: !95)
!95 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !80, line: 90, baseType: !95)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_eh_Entry", file: !99, line: 77, size: 192, elements: !100)
!99 = !DIFile(filename: "blender/source/blender/blenlib/BLI_edgehash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!100 = !{!101, !102, !103, !104}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !98, file: !99, line: 77, baseType: !82, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "v0", scope: !98, file: !99, line: 77, baseType: !5, size: 32, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !98, file: !99, line: 77, baseType: !5, size: 32, offset: 96)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !98, file: !99, line: 77, baseType: !82, size: 64, offset: 128)
!105 = !{i32 7, !"Dwarf Version", i32 4}
!106 = !{i32 2, !"Debug Info Version", i32 3}
!107 = !{i32 1, !"wchar_size", i32 4}
!108 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!109 = distinct !DISubprogram(name: "BKE_mesh_validate_arrays", scope: !1, file: !1, line: 215, type: !110, scopeLine: 224, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !522)
!110 = !DISubroutineType(types: !111)
!111 = !{!112, !113, !493, !5, !510, !5, !512, !5, !514, !5, !516, !5, !518, !520, !520, !521}
!112 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mesh", file: !115, line: 133, baseType: !116)
!115 = !DIFile(filename: "blender/source/blender/makesdna/DNA_mesh_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mesh", file: !115, line: 58, size: 11008, elements: !117)
!117 = !{!118, !188, !191, !203, !206, !209, !213, !219, !228, !324, !330, !337, !345, !356, !369, !382, !393, !402, !414, !422, !424, !427, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !116, file: !115, line: 59, baseType: !119, size: 960)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !120, line: 130, baseType: !121)
!120 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !120, line: 117, size: 960, elements: !122)
!122 = !{!123, !124, !125, !127, !147, !151, !153, !154, !155, !156}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !121, file: !120, line: 118, baseType: !82, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !121, file: !120, line: 118, baseType: !82, size: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !121, file: !120, line: 119, baseType: !126, size: 64, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !121, file: !120, line: 120, baseType: !128, size: 64, offset: 192)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !120, line: 136, size: 17600, elements: !130)
!130 = !{!131, !132, !134, !137, !142, !143, !144}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !129, file: !120, line: 137, baseType: !119, size: 960)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !129, file: !120, line: 138, baseType: !133, size: 64, offset: 960)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !129, file: !120, line: 139, baseType: !135, size: 64, offset: 1024)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !120, line: 43, flags: DIFlagFwdDecl)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !129, file: !120, line: 140, baseType: !138, size: 8192, offset: 1088)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 8192, elements: !140)
!139 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!140 = !{!141}
!141 = !DISubrange(count: 1024)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !129, file: !120, line: 141, baseType: !138, size: 8192, offset: 9280)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !129, file: !120, line: 148, baseType: !128, size: 64, offset: 17472)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !129, file: !120, line: 150, baseType: !145, size: 64, offset: 17536)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !120, line: 45, flags: DIFlagFwdDecl)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !121, file: !120, line: 121, baseType: !148, size: 528, offset: 256)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 528, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 66)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !121, file: !120, line: 126, baseType: !152, size: 16, offset: 784)
!152 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !121, file: !120, line: 127, baseType: !78, size: 32, offset: 800)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !121, file: !120, line: 128, baseType: !78, size: 32, offset: 832)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !121, file: !120, line: 128, baseType: !78, size: 32, offset: 864)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !121, file: !120, line: 129, baseType: !157, size: 64, offset: 896)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !120, line: 75, baseType: !159)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !120, line: 62, size: 1024, elements: !160)
!160 = !{!161, !163, !164, !165, !166, !167, !171, !172, !186, !187}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !159, file: !120, line: 63, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !159, file: !120, line: 63, baseType: !162, size: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !159, file: !120, line: 64, baseType: !139, size: 8, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !159, file: !120, line: 64, baseType: !139, size: 8, offset: 136)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !159, file: !120, line: 65, baseType: !152, size: 16, offset: 144)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !159, file: !120, line: 66, baseType: !168, size: 512, offset: 160)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 512, elements: !169)
!169 = !{!170}
!170 = !DISubrange(count: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !159, file: !120, line: 67, baseType: !78, size: 32, offset: 672)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !159, file: !120, line: 69, baseType: !173, size: 256, offset: 704)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !120, line: 60, baseType: !174)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !120, line: 48, size: 256, elements: !175)
!175 = !{!176, !177, !184, !185}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !174, file: !120, line: 49, baseType: !82, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !174, file: !120, line: 58, baseType: !178, size: 128, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !179, line: 71, baseType: !180)
!179 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !179, line: 69, size: 128, elements: !181)
!181 = !{!182, !183}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !180, file: !179, line: 70, baseType: !82, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !180, file: !179, line: 70, baseType: !82, size: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !174, file: !120, line: 59, baseType: !78, size: 32, offset: 192)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !174, file: !120, line: 59, baseType: !78, size: 32, offset: 224)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !159, file: !120, line: 70, baseType: !78, size: 32, offset: 960)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !159, file: !120, line: 74, baseType: !78, size: 32, offset: 992)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !116, file: !115, line: 60, baseType: !189, size: 64, offset: 960)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !115, line: 39, flags: DIFlagFwdDecl)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !116, file: !115, line: 62, baseType: !192, size: 64, offset: 1024)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !56, line: 97, size: 832, elements: !194)
!194 = !{!195, !201, !202}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !193, file: !56, line: 98, baseType: !196, size: 768)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 768, elements: !198)
!197 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!198 = !{!199, !200}
!199 = !DISubrange(count: 8)
!200 = !DISubrange(count: 3)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !193, file: !56, line: 99, baseType: !78, size: 32, offset: 768)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !193, file: !56, line: 99, baseType: !78, size: 32, offset: 800)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !116, file: !115, line: 64, baseType: !204, size: 64, offset: 1088)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !115, line: 41, flags: DIFlagFwdDecl)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !116, file: !115, line: 65, baseType: !207, size: 64, offset: 1152)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "Key", file: !115, line: 42, flags: DIFlagFwdDecl)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !116, file: !115, line: 66, baseType: !210, size: 64, offset: 1216)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !115, line: 53, flags: DIFlagFwdDecl)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mselect", scope: !116, file: !115, line: 67, baseType: !214, size: 64, offset: 1280)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MSelect", file: !4, line: 154, size: 64, elements: !216)
!216 = !{!217, !218}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !215, file: !4, line: 155, baseType: !78, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !215, file: !4, line: 156, baseType: !78, size: 32, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "mpoly", scope: !116, file: !115, line: 71, baseType: !220, size: 64, offset: 1344)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !4, line: 79, size: 96, elements: !222)
!222 = !{!223, !224, !225, !226, !227}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !221, file: !4, line: 81, baseType: !78, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !221, file: !4, line: 82, baseType: !78, size: 32, offset: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !221, file: !4, line: 83, baseType: !152, size: 16, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !221, file: !4, line: 84, baseType: !139, size: 8, offset: 80)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !221, file: !4, line: 84, baseType: !139, size: 8, offset: 88)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "mtpoly", scope: !116, file: !115, line: 72, baseType: !229, size: 64, offset: 1408)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTexPoly", file: !4, line: 93, size: 128, elements: !231)
!231 = !{!232, !319, !320, !321, !322, !323}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !230, file: !4, line: 94, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !235, line: 77, size: 15424, elements: !236)
!235 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!236 = !{!237, !238, !239, !242, !245, !248, !251, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !270, !271, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !300, !301, !302, !308, !309, !313}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !234, file: !235, line: 78, baseType: !119, size: 960)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !234, file: !235, line: 80, baseType: !138, size: 8192, offset: 960)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !234, file: !235, line: 82, baseType: !240, size: 64, offset: 9152)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !235, line: 43, flags: DIFlagFwdDecl)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !234, file: !235, line: 83, baseType: !243, size: 64, offset: 9216)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !120, line: 46, flags: DIFlagFwdDecl)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !234, file: !235, line: 86, baseType: !246, size: 64, offset: 9280)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !235, line: 41, flags: DIFlagFwdDecl)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !234, file: !235, line: 87, baseType: !249, size: 64, offset: 9344)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !235, line: 44, flags: DIFlagFwdDecl)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !234, file: !235, line: 89, baseType: !252, size: 512, offset: 9408)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 512, elements: !253)
!253 = !{!199}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !234, file: !235, line: 90, baseType: !152, size: 16, offset: 9920)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !234, file: !235, line: 90, baseType: !152, size: 16, offset: 9936)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !234, file: !235, line: 92, baseType: !152, size: 16, offset: 9952)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !234, file: !235, line: 92, baseType: !152, size: 16, offset: 9968)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !234, file: !235, line: 93, baseType: !152, size: 16, offset: 9984)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !234, file: !235, line: 93, baseType: !152, size: 16, offset: 10000)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !234, file: !235, line: 94, baseType: !78, size: 32, offset: 10016)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !234, file: !235, line: 97, baseType: !152, size: 16, offset: 10048)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !234, file: !235, line: 97, baseType: !152, size: 16, offset: 10064)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !234, file: !235, line: 98, baseType: !152, size: 16, offset: 10080)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !234, file: !235, line: 98, baseType: !152, size: 16, offset: 10096)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !234, file: !235, line: 99, baseType: !152, size: 16, offset: 10112)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !234, file: !235, line: 99, baseType: !152, size: 16, offset: 10128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !234, file: !235, line: 100, baseType: !5, size: 32, offset: 10144)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !234, file: !235, line: 101, baseType: !269, size: 64, offset: 10176)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !234, file: !235, line: 103, baseType: !145, size: 64, offset: 10240)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !234, file: !235, line: 104, baseType: !272, size: 64, offset: 10304)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !120, line: 159, size: 448, elements: !274)
!274 = !{!275, !279, !280, !282, !283, !285}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !273, file: !120, line: 161, baseType: !276, size: 64)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 2)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !273, file: !120, line: 162, baseType: !276, size: 64, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !273, file: !120, line: 163, baseType: !281, size: 32, offset: 128)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 32, elements: !277)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !273, file: !120, line: 164, baseType: !281, size: 32, offset: 160)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !273, file: !120, line: 165, baseType: !284, size: 128, offset: 192)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !269, size: 128, elements: !277)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !273, file: !120, line: 166, baseType: !286, size: 128, offset: 320)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 128, elements: !277)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !234, file: !235, line: 107, baseType: !197, size: 32, offset: 10368)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !234, file: !235, line: 108, baseType: !78, size: 32, offset: 10400)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !234, file: !235, line: 109, baseType: !152, size: 16, offset: 10432)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !234, file: !235, line: 110, baseType: !152, size: 16, offset: 10448)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !234, file: !235, line: 113, baseType: !78, size: 32, offset: 10464)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !234, file: !235, line: 113, baseType: !78, size: 32, offset: 10496)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !234, file: !235, line: 114, baseType: !139, size: 8, offset: 10528)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !234, file: !235, line: 114, baseType: !139, size: 8, offset: 10536)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !234, file: !235, line: 115, baseType: !152, size: 16, offset: 10544)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !234, file: !235, line: 116, baseType: !297, size: 128, offset: 10560)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 128, elements: !298)
!298 = !{!299}
!299 = !DISubrange(count: 4)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !234, file: !235, line: 119, baseType: !197, size: 32, offset: 10688)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !234, file: !235, line: 119, baseType: !197, size: 32, offset: 10720)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !234, file: !235, line: 122, baseType: !303, size: 512, offset: 10752)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !304, line: 182, baseType: !305)
!304 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !304, line: 180, size: 512, elements: !306)
!306 = !{!307}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !305, file: !304, line: 181, baseType: !168, size: 512)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !234, file: !235, line: 123, baseType: !139, size: 8, offset: 11264)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !234, file: !235, line: 125, baseType: !310, size: 56, offset: 11272)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 56, elements: !311)
!311 = !{!312}
!312 = !DISubrange(count: 7)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !234, file: !235, line: 126, baseType: !314, size: 4096, offset: 11328)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !315, size: 4096, elements: !253)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !235, line: 69, baseType: !316)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !235, line: 67, size: 512, elements: !317)
!317 = !{!318}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !316, file: !235, line: 68, baseType: !168, size: 512)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !230, file: !4, line: 95, baseType: !139, size: 8, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !230, file: !4, line: 95, baseType: !139, size: 8, offset: 72)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !230, file: !4, line: 96, baseType: !152, size: 16, offset: 80)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !230, file: !4, line: 96, baseType: !152, size: 16, offset: 96)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !230, file: !4, line: 96, baseType: !152, size: 16, offset: 112)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "mloop", scope: !116, file: !115, line: 73, baseType: !325, size: 64, offset: 1472)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !4, line: 88, size: 64, elements: !327)
!327 = !{!328, !329}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !326, file: !4, line: 89, baseType: !5, size: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !326, file: !4, line: 90, baseType: !5, size: 32, offset: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "mloopuv", scope: !116, file: !115, line: 74, baseType: !331, size: 64, offset: 1536)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoopUV", file: !4, line: 109, size: 96, elements: !333)
!333 = !{!334, !336}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !332, file: !4, line: 110, baseType: !335, size: 64)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 64, elements: !277)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !332, file: !4, line: 111, baseType: !78, size: 32, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "mloopcol", scope: !116, file: !115, line: 75, baseType: !338, size: 64, offset: 1600)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoopCol", file: !4, line: 129, size: 32, elements: !340)
!340 = !{!341, !342, !343, !344}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !339, file: !4, line: 130, baseType: !139, size: 8)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !339, file: !4, line: 130, baseType: !139, size: 8, offset: 8)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !339, file: !4, line: 130, baseType: !139, size: 8, offset: 16)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !339, file: !4, line: 130, baseType: !139, size: 8, offset: 24)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "mface", scope: !116, file: !115, line: 80, baseType: !346, size: 64, offset: 1664)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !4, line: 42, size: 160, elements: !348)
!348 = !{!349, !350, !351, !352, !353, !354, !355}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !347, file: !4, line: 43, baseType: !5, size: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !347, file: !4, line: 43, baseType: !5, size: 32, offset: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !347, file: !4, line: 43, baseType: !5, size: 32, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !347, file: !4, line: 43, baseType: !5, size: 32, offset: 96)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !347, file: !4, line: 44, baseType: !152, size: 16, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !347, file: !4, line: 45, baseType: !139, size: 8, offset: 144)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !347, file: !4, line: 45, baseType: !139, size: 8, offset: 152)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "mtface", scope: !116, file: !115, line: 81, baseType: !357, size: 64, offset: 1728)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !4, line: 160, size: 384, elements: !359)
!359 = !{!360, !363, !364, !365, !366, !367, !368}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !358, file: !4, line: 161, baseType: !361, size: 256)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 256, elements: !362)
!362 = !{!299, !278}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !358, file: !4, line: 162, baseType: !233, size: 64, offset: 256)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !358, file: !4, line: 163, baseType: !139, size: 8, offset: 320)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !358, file: !4, line: 163, baseType: !139, size: 8, offset: 328)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !358, file: !4, line: 164, baseType: !152, size: 16, offset: 336)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !358, file: !4, line: 164, baseType: !152, size: 16, offset: 352)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !358, file: !4, line: 164, baseType: !152, size: 16, offset: 368)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "tface", scope: !116, file: !115, line: 82, baseType: !370, size: 64, offset: 1792)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TFace", file: !115, line: 136, size: 512, elements: !372)
!372 = !{!373, !374, !375, !377, !378, !379, !380, !381}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !371, file: !115, line: 137, baseType: !82, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !371, file: !115, line: 138, baseType: !361, size: 256, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !371, file: !115, line: 139, baseType: !376, size: 128, offset: 320)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 128, elements: !298)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !371, file: !115, line: 140, baseType: !139, size: 8, offset: 448)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !371, file: !115, line: 140, baseType: !139, size: 8, offset: 456)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !371, file: !115, line: 141, baseType: !152, size: 16, offset: 464)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !371, file: !115, line: 141, baseType: !152, size: 16, offset: 480)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !371, file: !115, line: 141, baseType: !152, size: 16, offset: 496)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "mvert", scope: !116, file: !115, line: 83, baseType: !383, size: 64, offset: 1856)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !4, line: 65, size: 160, elements: !385)
!385 = !{!386, !389, !391, !392}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !384, file: !4, line: 66, baseType: !387, size: 96)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 96, elements: !388)
!388 = !{!200}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !384, file: !4, line: 67, baseType: !390, size: 48, offset: 96)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 48, elements: !388)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !384, file: !4, line: 68, baseType: !139, size: 8, offset: 144)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !384, file: !4, line: 68, baseType: !139, size: 8, offset: 152)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "medge", scope: !116, file: !115, line: 84, baseType: !394, size: 64, offset: 1920)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !4, line: 48, size: 96, elements: !396)
!396 = !{!397, !398, !399, !400, !401}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !395, file: !4, line: 49, baseType: !5, size: 32)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !395, file: !4, line: 49, baseType: !5, size: 32, offset: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !395, file: !4, line: 50, baseType: !139, size: 8, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !395, file: !4, line: 50, baseType: !139, size: 8, offset: 72)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !395, file: !4, line: 51, baseType: !152, size: 16, offset: 80)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "dvert", scope: !116, file: !115, line: 85, baseType: !403, size: 64, offset: 1984)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !4, line: 59, size: 128, elements: !405)
!405 = !{!406, !412, !413}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "dw", scope: !404, file: !4, line: 60, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformWeight", file: !4, line: 54, size: 64, elements: !409)
!409 = !{!410, !411}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "def_nr", scope: !408, file: !4, line: 55, baseType: !78, size: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !408, file: !4, line: 56, baseType: !197, size: 32, offset: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "totweight", scope: !404, file: !4, line: 61, baseType: !78, size: 32, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !404, file: !4, line: 62, baseType: !78, size: 32, offset: 96)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "mcol", scope: !116, file: !115, line: 89, baseType: !415, size: 64, offset: 2048)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MCol", file: !4, line: 74, size: 32, elements: !417)
!417 = !{!418, !419, !420, !421}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !416, file: !4, line: 75, baseType: !139, size: 8)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !416, file: !4, line: 75, baseType: !139, size: 8, offset: 8)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !416, file: !4, line: 75, baseType: !139, size: 8, offset: 16)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !416, file: !4, line: 75, baseType: !139, size: 8, offset: 24)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "texcomesh", scope: !116, file: !115, line: 90, baseType: !423, size: 64, offset: 2112)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "edit_btmesh", scope: !116, file: !115, line: 93, baseType: !425, size: 64, offset: 2176)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMEditMesh", file: !115, line: 93, flags: DIFlagFwdDecl)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !116, file: !115, line: 95, baseType: !428, size: 1600, offset: 2240)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !12, line: 64, size: 1600, elements: !429)
!429 = !{!430, !445, !449, !450, !451, !452, !455}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !428, file: !12, line: 65, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !12, line: 53, baseType: !433)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !12, line: 42, size: 832, elements: !434)
!434 = !{!435, !436, !437, !438, !439, !440, !441, !442, !443, !444}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !433, file: !12, line: 43, baseType: !78, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !433, file: !12, line: 44, baseType: !78, size: 32, offset: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !433, file: !12, line: 45, baseType: !78, size: 32, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !433, file: !12, line: 46, baseType: !78, size: 32, offset: 96)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !433, file: !12, line: 47, baseType: !78, size: 32, offset: 128)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !433, file: !12, line: 48, baseType: !78, size: 32, offset: 160)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !433, file: !12, line: 49, baseType: !78, size: 32, offset: 192)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !433, file: !12, line: 50, baseType: !78, size: 32, offset: 224)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !433, file: !12, line: 51, baseType: !168, size: 512, offset: 256)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !433, file: !12, line: 52, baseType: !82, size: 64, offset: 768)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !428, file: !12, line: 66, baseType: !446, size: 1312, offset: 64)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 1312, elements: !447)
!447 = !{!448}
!448 = !DISubrange(count: 41)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !428, file: !12, line: 69, baseType: !78, size: 32, offset: 1376)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !428, file: !12, line: 69, baseType: !78, size: 32, offset: 1408)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !428, file: !12, line: 70, baseType: !78, size: 32, offset: 1440)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !428, file: !12, line: 71, baseType: !453, size: 64, offset: 1472)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !12, line: 71, flags: DIFlagFwdDecl)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !428, file: !12, line: 72, baseType: !456, size: 64, offset: 1536)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !12, line: 59, baseType: !458)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !12, line: 57, size: 8192, elements: !459)
!459 = !{!460}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !458, file: !12, line: 58, baseType: !138, size: 8192)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !116, file: !115, line: 95, baseType: !428, size: 1600, offset: 3840)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "fdata", scope: !116, file: !115, line: 95, baseType: !428, size: 1600, offset: 5440)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !116, file: !115, line: 98, baseType: !428, size: 1600, offset: 7040)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !116, file: !115, line: 98, baseType: !428, size: 1600, offset: 8640)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !116, file: !115, line: 101, baseType: !78, size: 32, offset: 10240)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !116, file: !115, line: 101, baseType: !78, size: 32, offset: 10272)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !116, file: !115, line: 101, baseType: !78, size: 32, offset: 10304)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "totselect", scope: !116, file: !115, line: 101, baseType: !78, size: 32, offset: 10336)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "totpoly", scope: !116, file: !115, line: 104, baseType: !78, size: 32, offset: 10368)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !116, file: !115, line: 104, baseType: !78, size: 32, offset: 10400)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !116, file: !115, line: 111, baseType: !78, size: 32, offset: 10432)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !116, file: !115, line: 114, baseType: !387, size: 96, offset: 10464)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !116, file: !115, line: 115, baseType: !387, size: 96, offset: 10560)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !116, file: !115, line: 116, baseType: !387, size: 96, offset: 10656)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "drawflag", scope: !116, file: !115, line: 118, baseType: !78, size: 32, offset: 10752)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "texflag", scope: !116, file: !115, line: 119, baseType: !152, size: 16, offset: 10784)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !116, file: !115, line: 119, baseType: !152, size: 16, offset: 10800)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !116, file: !115, line: 120, baseType: !197, size: 32, offset: 10816)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !116, file: !115, line: 121, baseType: !78, size: 32, offset: 10848)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !116, file: !115, line: 124, baseType: !139, size: 8, offset: 10880)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !116, file: !115, line: 124, baseType: !139, size: 8, offset: 10888)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "subdiv", scope: !116, file: !115, line: 126, baseType: !139, size: 8, offset: 10896)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "subdivr", scope: !116, file: !115, line: 126, baseType: !139, size: 8, offset: 10904)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "subsurftype", scope: !116, file: !115, line: 127, baseType: !139, size: 8, offset: 10912)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "editflag", scope: !116, file: !115, line: 128, baseType: !139, size: 8, offset: 10920)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !116, file: !115, line: 130, baseType: !152, size: 16, offset: 10928)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "mr", scope: !116, file: !115, line: 132, baseType: !488, size: 64, offset: 10944)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Multires", file: !4, line: 233, size: 3584, elements: !490)
!490 = !{!491, !492, !495, !496, !497, !498, !499, !500, !501, !502, !503, !505, !506, !508}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !489, file: !4, line: 234, baseType: !178, size: 128)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "verts", scope: !489, file: !4, line: 235, baseType: !493, size: 64, offset: 128)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "MVert", file: !4, line: 69, baseType: !384)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "level_count", scope: !489, file: !4, line: 237, baseType: !112, size: 8, offset: 192)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !489, file: !4, line: 237, baseType: !112, size: 8, offset: 200)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "newlvl", scope: !489, file: !4, line: 237, baseType: !112, size: 8, offset: 208)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "edgelvl", scope: !489, file: !4, line: 237, baseType: !112, size: 8, offset: 216)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "pinlvl", scope: !489, file: !4, line: 237, baseType: !112, size: 8, offset: 224)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "renderlvl", scope: !489, file: !4, line: 237, baseType: !112, size: 8, offset: 232)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "use_col", scope: !489, file: !4, line: 238, baseType: !112, size: 8, offset: 240)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !489, file: !4, line: 238, baseType: !112, size: 8, offset: 248)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !489, file: !4, line: 241, baseType: !504, size: 1600, offset: 256)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !12, line: 73, baseType: !428)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "fdata", scope: !489, file: !4, line: 242, baseType: !504, size: 1600, offset: 1856)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "edge_flags", scope: !489, file: !4, line: 243, baseType: !507, size: 64, offset: 3456)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "edge_creases", scope: !489, file: !4, line: 244, baseType: !509, size: 64, offset: 3520)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "MEdge", file: !4, line: 52, baseType: !395)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "MFace", file: !4, line: 46, baseType: !347)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "MLoop", file: !4, line: 91, baseType: !326)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPoly", file: !4, line: 85, baseType: !221)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "MDeformVert", file: !4, line: 63, baseType: !404)
!520 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !112)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!522 = !{}
!523 = !DILocalVariable(name: "mesh", arg: 1, scope: !109, file: !1, line: 215, type: !113)
!524 = !DILocation(line: 215, column: 37, scope: !109)
!525 = !DILocalVariable(name: "mverts", arg: 2, scope: !109, file: !1, line: 216, type: !493)
!526 = !DILocation(line: 216, column: 38, scope: !109)
!527 = !DILocalVariable(name: "totvert", arg: 3, scope: !109, file: !1, line: 216, type: !5)
!528 = !DILocation(line: 216, column: 59, scope: !109)
!529 = !DILocalVariable(name: "medges", arg: 4, scope: !109, file: !1, line: 217, type: !510)
!530 = !DILocation(line: 217, column: 38, scope: !109)
!531 = !DILocalVariable(name: "totedge", arg: 5, scope: !109, file: !1, line: 217, type: !5)
!532 = !DILocation(line: 217, column: 59, scope: !109)
!533 = !DILocalVariable(name: "mfaces", arg: 6, scope: !109, file: !1, line: 218, type: !512)
!534 = !DILocation(line: 218, column: 38, scope: !109)
!535 = !DILocalVariable(name: "totface", arg: 7, scope: !109, file: !1, line: 218, type: !5)
!536 = !DILocation(line: 218, column: 59, scope: !109)
!537 = !DILocalVariable(name: "mloops", arg: 8, scope: !109, file: !1, line: 219, type: !514)
!538 = !DILocation(line: 219, column: 38, scope: !109)
!539 = !DILocalVariable(name: "totloop", arg: 9, scope: !109, file: !1, line: 219, type: !5)
!540 = !DILocation(line: 219, column: 59, scope: !109)
!541 = !DILocalVariable(name: "mpolys", arg: 10, scope: !109, file: !1, line: 220, type: !516)
!542 = !DILocation(line: 220, column: 38, scope: !109)
!543 = !DILocalVariable(name: "totpoly", arg: 11, scope: !109, file: !1, line: 220, type: !5)
!544 = !DILocation(line: 220, column: 59, scope: !109)
!545 = !DILocalVariable(name: "dverts", arg: 12, scope: !109, file: !1, line: 221, type: !518)
!546 = !DILocation(line: 221, column: 44, scope: !109)
!547 = !DILocalVariable(name: "do_verbose", arg: 13, scope: !109, file: !1, line: 222, type: !520)
!548 = !DILocation(line: 222, column: 42, scope: !109)
!549 = !DILocalVariable(name: "do_fixes", arg: 14, scope: !109, file: !1, line: 222, type: !520)
!550 = !DILocation(line: 222, column: 65, scope: !109)
!551 = !DILocalVariable(name: "r_changed", arg: 15, scope: !109, file: !1, line: 223, type: !521)
!552 = !DILocation(line: 223, column: 37, scope: !109)
!553 = !DILocalVariable(name: "mv", scope: !109, file: !1, line: 231, type: !493)
!554 = !DILocation(line: 231, column: 9, scope: !109)
!555 = !DILocation(line: 231, column: 14, scope: !109)
!556 = !DILocalVariable(name: "me", scope: !109, file: !1, line: 232, type: !510)
!557 = !DILocation(line: 232, column: 9, scope: !109)
!558 = !DILocalVariable(name: "ml", scope: !109, file: !1, line: 233, type: !514)
!559 = !DILocation(line: 233, column: 9, scope: !109)
!560 = !DILocalVariable(name: "mp", scope: !109, file: !1, line: 234, type: !516)
!561 = !DILocation(line: 234, column: 9, scope: !109)
!562 = !DILocalVariable(name: "i", scope: !109, file: !1, line: 235, type: !5)
!563 = !DILocation(line: 235, column: 15, scope: !109)
!564 = !DILocalVariable(name: "j", scope: !109, file: !1, line: 235, type: !5)
!565 = !DILocation(line: 235, column: 18, scope: !109)
!566 = !DILocalVariable(name: "v", scope: !109, file: !1, line: 236, type: !89)
!567 = !DILocation(line: 236, column: 7, scope: !109)
!568 = !DILocalVariable(name: "is_valid", scope: !109, file: !1, line: 238, type: !112)
!569 = !DILocation(line: 238, column: 7, scope: !109)
!570 = !DILocalVariable(name: "do_edge_free", scope: !109, file: !1, line: 240, type: !112)
!571 = !DILocation(line: 240, column: 7, scope: !109)
!572 = !DILocalVariable(name: "do_face_free", scope: !109, file: !1, line: 241, type: !112)
!573 = !DILocation(line: 241, column: 7, scope: !109)
!574 = !DILocalVariable(name: "do_polyloop_free", scope: !109, file: !1, line: 242, type: !112)
!575 = !DILocation(line: 242, column: 7, scope: !109)
!576 = !DILocalVariable(name: "verts_fixed", scope: !109, file: !1, line: 244, type: !112)
!577 = !DILocation(line: 244, column: 7, scope: !109)
!578 = !DILocalVariable(name: "vert_weights_fixed", scope: !109, file: !1, line: 245, type: !112)
!579 = !DILocation(line: 245, column: 7, scope: !109)
!580 = !DILocalVariable(name: "msel_fixed", scope: !109, file: !1, line: 246, type: !112)
!581 = !DILocation(line: 246, column: 7, scope: !109)
!582 = !DILocalVariable(name: "do_edge_recalc", scope: !109, file: !1, line: 248, type: !112)
!583 = !DILocation(line: 248, column: 7, scope: !109)
!584 = !DILocalVariable(name: "edge_hash", scope: !109, file: !1, line: 250, type: !585)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "EdgeHash", file: !99, line: 35, baseType: !587)
!587 = !DICompositeType(tag: DW_TAG_structure_type, name: "EdgeHash", file: !99, line: 34, flags: DIFlagFwdDecl)
!588 = !DILocation(line: 250, column: 12, scope: !109)
!589 = !DILocation(line: 250, column: 54, scope: !109)
!590 = !DILocation(line: 250, column: 24, scope: !109)
!591 = !DILocation(line: 254, column: 2, scope: !109)
!592 = !DILocation(line: 257, column: 6, scope: !593)
!593 = distinct !DILexicalBlock(scope: !109, file: !1, line: 257, column: 6)
!594 = !DILocation(line: 257, column: 14, scope: !593)
!595 = !DILocation(line: 257, column: 19, scope: !593)
!596 = !DILocation(line: 257, column: 22, scope: !593)
!597 = !DILocation(line: 257, column: 30, scope: !593)
!598 = !DILocation(line: 257, column: 6, scope: !109)
!599 = !DILocation(line: 258, column: 3, scope: !600)
!600 = distinct !DILexicalBlock(scope: !593, file: !1, line: 257, column: 36)
!601 = !DILocation(line: 259, column: 20, scope: !600)
!602 = !DILocation(line: 259, column: 18, scope: !600)
!603 = !DILocation(line: 260, column: 2, scope: !600)
!604 = !DILocation(line: 262, column: 9, scope: !605)
!605 = distinct !DILexicalBlock(scope: !109, file: !1, line: 262, column: 2)
!606 = !DILocation(line: 262, column: 7, scope: !605)
!607 = !DILocation(line: 262, column: 14, scope: !608)
!608 = distinct !DILexicalBlock(scope: !605, file: !1, line: 262, column: 2)
!609 = !DILocation(line: 262, column: 18, scope: !608)
!610 = !DILocation(line: 262, column: 16, scope: !608)
!611 = !DILocation(line: 262, column: 2, scope: !605)
!612 = !DILocalVariable(name: "fix_normal", scope: !613, file: !1, line: 263, type: !112)
!613 = distinct !DILexicalBlock(scope: !608, file: !1, line: 262, column: 38)
!614 = !DILocation(line: 263, column: 8, scope: !613)
!615 = !DILocation(line: 265, column: 10, scope: !616)
!616 = distinct !DILexicalBlock(scope: !613, file: !1, line: 265, column: 3)
!617 = !DILocation(line: 265, column: 8, scope: !616)
!618 = !DILocation(line: 265, column: 15, scope: !619)
!619 = distinct !DILexicalBlock(scope: !616, file: !1, line: 265, column: 3)
!620 = !DILocation(line: 265, column: 17, scope: !619)
!621 = !DILocation(line: 265, column: 3, scope: !616)
!622 = !DILocation(line: 269, column: 9, scope: !623)
!623 = distinct !DILexicalBlock(scope: !624, file: !1, line: 269, column: 8)
!624 = distinct !DILexicalBlock(scope: !619, file: !1, line: 265, column: 27)
!625 = !DILocation(line: 269, column: 8, scope: !624)
!626 = !DILocation(line: 271, column: 5, scope: !627)
!627 = distinct !DILexicalBlock(scope: !623, file: !1, line: 269, column: 30)
!628 = !DILocation(line: 273, column: 9, scope: !629)
!629 = distinct !DILexicalBlock(scope: !627, file: !1, line: 273, column: 9)
!630 = !DILocation(line: 273, column: 9, scope: !627)
!631 = !DILocation(line: 274, column: 14, scope: !632)
!632 = distinct !DILexicalBlock(scope: !629, file: !1, line: 273, column: 19)
!633 = !DILocation(line: 274, column: 18, scope: !632)
!634 = !DILocation(line: 274, column: 6, scope: !632)
!635 = !DILocation(line: 276, column: 18, scope: !632)
!636 = !DILocation(line: 277, column: 5, scope: !632)
!637 = !DILocation(line: 278, column: 4, scope: !627)
!638 = !DILocation(line: 280, column: 8, scope: !639)
!639 = distinct !DILexicalBlock(scope: !624, file: !1, line: 280, column: 8)
!640 = !DILocation(line: 280, column: 12, scope: !639)
!641 = !DILocation(line: 280, column: 15, scope: !639)
!642 = !DILocation(line: 280, column: 18, scope: !639)
!643 = !DILocation(line: 280, column: 8, scope: !624)
!644 = !DILocation(line: 281, column: 16, scope: !639)
!645 = !DILocation(line: 281, column: 5, scope: !639)
!646 = !DILocation(line: 282, column: 3, scope: !624)
!647 = !DILocation(line: 265, column: 23, scope: !619)
!648 = !DILocation(line: 265, column: 3, scope: !619)
!649 = distinct !{!649, !621, !650}
!650 = !DILocation(line: 282, column: 3, scope: !616)
!651 = !DILocation(line: 284, column: 7, scope: !652)
!652 = distinct !DILexicalBlock(scope: !613, file: !1, line: 284, column: 7)
!653 = !DILocation(line: 284, column: 7, scope: !613)
!654 = !DILocation(line: 285, column: 4, scope: !655)
!655 = distinct !DILexicalBlock(scope: !652, file: !1, line: 284, column: 19)
!656 = !DILocation(line: 286, column: 8, scope: !657)
!657 = distinct !DILexicalBlock(scope: !655, file: !1, line: 286, column: 8)
!658 = !DILocation(line: 286, column: 8, scope: !655)
!659 = !DILocation(line: 287, column: 5, scope: !660)
!660 = distinct !DILexicalBlock(scope: !657, file: !1, line: 286, column: 18)
!661 = !DILocation(line: 287, column: 9, scope: !660)
!662 = !DILocation(line: 287, column: 15, scope: !660)
!663 = !DILocation(line: 288, column: 17, scope: !660)
!664 = !DILocation(line: 289, column: 4, scope: !660)
!665 = !DILocation(line: 290, column: 3, scope: !655)
!666 = !DILocation(line: 291, column: 2, scope: !613)
!667 = !DILocation(line: 262, column: 28, scope: !608)
!668 = !DILocation(line: 262, column: 34, scope: !608)
!669 = !DILocation(line: 262, column: 2, scope: !608)
!670 = distinct !{!670, !611, !671}
!671 = !DILocation(line: 291, column: 2, scope: !605)
!672 = !DILocation(line: 293, column: 9, scope: !673)
!673 = distinct !DILexicalBlock(scope: !109, file: !1, line: 293, column: 2)
!674 = !DILocation(line: 293, column: 19, scope: !673)
!675 = !DILocation(line: 293, column: 17, scope: !673)
!676 = !DILocation(line: 293, column: 7, scope: !673)
!677 = !DILocation(line: 293, column: 27, scope: !678)
!678 = distinct !DILexicalBlock(scope: !673, file: !1, line: 293, column: 2)
!679 = !DILocation(line: 293, column: 31, scope: !678)
!680 = !DILocation(line: 293, column: 29, scope: !678)
!681 = !DILocation(line: 293, column: 2, scope: !673)
!682 = !DILocalVariable(name: "remove", scope: !683, file: !1, line: 294, type: !112)
!683 = distinct !DILexicalBlock(scope: !678, file: !1, line: 293, column: 51)
!684 = !DILocation(line: 294, column: 8, scope: !683)
!685 = !DILocation(line: 295, column: 7, scope: !686)
!686 = distinct !DILexicalBlock(scope: !683, file: !1, line: 295, column: 7)
!687 = !DILocation(line: 295, column: 11, scope: !686)
!688 = !DILocation(line: 295, column: 17, scope: !686)
!689 = !DILocation(line: 295, column: 21, scope: !686)
!690 = !DILocation(line: 295, column: 14, scope: !686)
!691 = !DILocation(line: 295, column: 7, scope: !683)
!692 = !DILocation(line: 296, column: 4, scope: !693)
!693 = distinct !DILexicalBlock(scope: !686, file: !1, line: 295, column: 25)
!694 = !DILocation(line: 297, column: 13, scope: !693)
!695 = !DILocation(line: 297, column: 11, scope: !693)
!696 = !DILocation(line: 298, column: 3, scope: !693)
!697 = !DILocation(line: 299, column: 7, scope: !698)
!698 = distinct !DILexicalBlock(scope: !683, file: !1, line: 299, column: 7)
!699 = !DILocation(line: 299, column: 11, scope: !698)
!700 = !DILocation(line: 299, column: 17, scope: !698)
!701 = !DILocation(line: 299, column: 14, scope: !698)
!702 = !DILocation(line: 299, column: 7, scope: !683)
!703 = !DILocation(line: 300, column: 4, scope: !704)
!704 = distinct !DILexicalBlock(scope: !698, file: !1, line: 299, column: 26)
!705 = !DILocation(line: 301, column: 13, scope: !704)
!706 = !DILocation(line: 301, column: 11, scope: !704)
!707 = !DILocation(line: 302, column: 3, scope: !704)
!708 = !DILocation(line: 303, column: 7, scope: !709)
!709 = distinct !DILexicalBlock(scope: !683, file: !1, line: 303, column: 7)
!710 = !DILocation(line: 303, column: 11, scope: !709)
!711 = !DILocation(line: 303, column: 17, scope: !709)
!712 = !DILocation(line: 303, column: 14, scope: !709)
!713 = !DILocation(line: 303, column: 7, scope: !683)
!714 = !DILocation(line: 304, column: 4, scope: !715)
!715 = distinct !DILexicalBlock(scope: !709, file: !1, line: 303, column: 26)
!716 = !DILocation(line: 305, column: 13, scope: !715)
!717 = !DILocation(line: 305, column: 11, scope: !715)
!718 = !DILocation(line: 306, column: 3, scope: !715)
!719 = !DILocation(line: 308, column: 27, scope: !720)
!720 = distinct !DILexicalBlock(scope: !683, file: !1, line: 308, column: 7)
!721 = !DILocation(line: 308, column: 38, scope: !720)
!722 = !DILocation(line: 308, column: 42, scope: !720)
!723 = !DILocation(line: 308, column: 46, scope: !720)
!724 = !DILocation(line: 308, column: 50, scope: !720)
!725 = !DILocation(line: 308, column: 7, scope: !720)
!726 = !DILocation(line: 308, column: 7, scope: !683)
!727 = !DILocation(line: 309, column: 4, scope: !728)
!728 = distinct !DILexicalBlock(scope: !720, file: !1, line: 308, column: 55)
!729 = !DILocation(line: 311, column: 13, scope: !728)
!730 = !DILocation(line: 311, column: 11, scope: !728)
!731 = !DILocation(line: 312, column: 3, scope: !728)
!732 = !DILocation(line: 314, column: 7, scope: !733)
!733 = distinct !DILexicalBlock(scope: !683, file: !1, line: 314, column: 7)
!734 = !DILocation(line: 314, column: 14, scope: !733)
!735 = !DILocation(line: 314, column: 7, scope: !683)
!736 = !DILocation(line: 315, column: 24, scope: !737)
!737 = distinct !DILexicalBlock(scope: !733, file: !1, line: 314, column: 24)
!738 = !DILocation(line: 315, column: 35, scope: !737)
!739 = !DILocation(line: 315, column: 39, scope: !737)
!740 = !DILocation(line: 315, column: 43, scope: !737)
!741 = !DILocation(line: 315, column: 47, scope: !737)
!742 = !DILocation(line: 315, column: 51, scope: !737)
!743 = !DILocation(line: 315, column: 4, scope: !737)
!744 = !DILocation(line: 316, column: 3, scope: !737)
!745 = !DILocation(line: 318, column: 4, scope: !746)
!746 = distinct !DILexicalBlock(scope: !747, file: !1, line: 318, column: 4)
!747 = distinct !DILexicalBlock(scope: !733, file: !1, line: 317, column: 8)
!748 = !DILocation(line: 320, column: 2, scope: !683)
!749 = !DILocation(line: 293, column: 41, scope: !678)
!750 = !DILocation(line: 293, column: 47, scope: !678)
!751 = !DILocation(line: 293, column: 2, scope: !678)
!752 = distinct !{!752, !681, !753}
!753 = !DILocation(line: 320, column: 2, scope: !673)
!754 = !DILocation(line: 322, column: 6, scope: !755)
!755 = distinct !DILexicalBlock(scope: !109, file: !1, line: 322, column: 6)
!756 = !DILocation(line: 322, column: 13, scope: !755)
!757 = !DILocation(line: 322, column: 17, scope: !755)
!758 = !DILocation(line: 322, column: 6, scope: !109)
!759 = !DILocalVariable(name: "mf", scope: !760, file: !1, line: 336, type: !512)
!760 = distinct !DILexicalBlock(scope: !755, file: !1, line: 322, column: 25)
!761 = !DILocation(line: 336, column: 10, scope: !760)
!762 = !DILocalVariable(name: "mf_prev", scope: !760, file: !1, line: 337, type: !512)
!763 = !DILocation(line: 337, column: 10, scope: !760)
!764 = !DILocalVariable(name: "sort_faces", scope: !760, file: !1, line: 339, type: !765)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "SortFace", file: !1, line: 67, baseType: !767)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SortFace", file: !1, line: 64, size: 320, elements: !768)
!768 = !{!769, !779}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "es", scope: !767, file: !1, line: 65, baseType: !770, size: 256)
!770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !771, size: 256, elements: !298)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "EdgeUUID", file: !1, line: 62, baseType: !772)
!772 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !1, line: 59, size: 64, elements: !773)
!773 = !{!774, !778}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "verts", scope: !772, file: !1, line: 60, baseType: !775, size: 64)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !776, size: 64, elements: !277)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !93, line: 26, baseType: !777)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !88, line: 42, baseType: !5)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "edval", scope: !772, file: !1, line: 61, baseType: !85, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !767, file: !1, line: 66, baseType: !5, size: 32, offset: 256)
!780 = !DILocation(line: 339, column: 13, scope: !760)
!781 = !DILocation(line: 339, column: 26, scope: !760)
!782 = !DILocation(line: 339, column: 57, scope: !760)
!783 = !DILocation(line: 339, column: 55, scope: !760)
!784 = !DILocalVariable(name: "sf", scope: !760, file: !1, line: 340, type: !765)
!785 = !DILocation(line: 340, column: 13, scope: !760)
!786 = !DILocalVariable(name: "sf_prev", scope: !760, file: !1, line: 341, type: !765)
!787 = !DILocation(line: 341, column: 13, scope: !760)
!788 = !DILocalVariable(name: "totsortface", scope: !760, file: !1, line: 342, type: !5)
!789 = !DILocation(line: 342, column: 16, scope: !760)
!790 = !DILocation(line: 344, column: 3, scope: !760)
!791 = !DILocation(line: 346, column: 10, scope: !792)
!792 = distinct !DILexicalBlock(scope: !760, file: !1, line: 346, column: 3)
!793 = !DILocation(line: 346, column: 20, scope: !792)
!794 = !DILocation(line: 346, column: 18, scope: !792)
!795 = !DILocation(line: 346, column: 33, scope: !792)
!796 = !DILocation(line: 346, column: 31, scope: !792)
!797 = !DILocation(line: 346, column: 8, scope: !792)
!798 = !DILocation(line: 346, column: 45, scope: !799)
!799 = distinct !DILexicalBlock(scope: !792, file: !1, line: 346, column: 3)
!800 = !DILocation(line: 346, column: 49, scope: !799)
!801 = !DILocation(line: 346, column: 47, scope: !799)
!802 = !DILocation(line: 346, column: 3, scope: !792)
!803 = !DILocalVariable(name: "remove", scope: !804, file: !1, line: 347, type: !112)
!804 = distinct !DILexicalBlock(scope: !799, file: !1, line: 346, column: 69)
!805 = !DILocation(line: 347, column: 9, scope: !804)
!806 = !DILocalVariable(name: "fidx", scope: !804, file: !1, line: 348, type: !78)
!807 = !DILocation(line: 348, column: 8, scope: !804)
!808 = !DILocalVariable(name: "fv", scope: !804, file: !1, line: 349, type: !376)
!809 = !DILocation(line: 349, column: 17, scope: !804)
!810 = !DILocation(line: 351, column: 11, scope: !804)
!811 = !DILocation(line: 351, column: 15, scope: !804)
!812 = !DILocation(line: 351, column: 9, scope: !804)
!813 = !DILocation(line: 352, column: 4, scope: !804)
!814 = !DILocation(line: 353, column: 20, scope: !815)
!815 = distinct !DILexicalBlock(scope: !804, file: !1, line: 352, column: 7)
!816 = !DILocation(line: 353, column: 24, scope: !815)
!817 = !DILocation(line: 353, column: 30, scope: !815)
!818 = !DILocation(line: 353, column: 28, scope: !815)
!819 = !DILocation(line: 353, column: 16, scope: !815)
!820 = !DILocation(line: 353, column: 8, scope: !815)
!821 = !DILocation(line: 353, column: 5, scope: !815)
!822 = !DILocation(line: 353, column: 14, scope: !815)
!823 = !DILocation(line: 354, column: 12, scope: !824)
!824 = distinct !DILexicalBlock(scope: !815, file: !1, line: 354, column: 9)
!825 = !DILocation(line: 354, column: 9, scope: !824)
!826 = !DILocation(line: 354, column: 21, scope: !824)
!827 = !DILocation(line: 354, column: 18, scope: !824)
!828 = !DILocation(line: 354, column: 9, scope: !815)
!829 = !DILocation(line: 355, column: 6, scope: !830)
!830 = distinct !DILexicalBlock(scope: !824, file: !1, line: 354, column: 30)
!831 = !DILocation(line: 356, column: 15, scope: !830)
!832 = !DILocation(line: 356, column: 13, scope: !830)
!833 = !DILocation(line: 357, column: 5, scope: !830)
!834 = !DILocation(line: 358, column: 4, scope: !815)
!835 = !DILocation(line: 358, column: 17, scope: !804)
!836 = distinct !{!836, !813, !837}
!837 = !DILocation(line: 358, column: 19, scope: !804)
!838 = !DILocation(line: 360, column: 8, scope: !839)
!839 = distinct !DILexicalBlock(scope: !804, file: !1, line: 360, column: 8)
!840 = !DILocation(line: 360, column: 15, scope: !839)
!841 = !DILocation(line: 360, column: 8, scope: !804)
!842 = !DILocation(line: 361, column: 9, scope: !843)
!843 = distinct !DILexicalBlock(scope: !844, file: !1, line: 361, column: 9)
!844 = distinct !DILexicalBlock(scope: !839, file: !1, line: 360, column: 25)
!845 = !DILocation(line: 361, column: 13, scope: !843)
!846 = !DILocation(line: 361, column: 9, scope: !844)
!847 = !DILocation(line: 362, column: 6, scope: !848)
!848 = distinct !DILexicalBlock(scope: !849, file: !1, line: 362, column: 6)
!849 = distinct !DILexicalBlock(scope: !843, file: !1, line: 361, column: 17)
!850 = !DILocation(line: 362, column: 6, scope: !849)
!851 = !DILocation(line: 362, column: 6, scope: !852)
!852 = distinct !DILexicalBlock(scope: !848, file: !1, line: 362, column: 6)
!853 = !DILocation(line: 363, column: 6, scope: !854)
!854 = distinct !DILexicalBlock(scope: !849, file: !1, line: 363, column: 6)
!855 = !DILocation(line: 363, column: 6, scope: !849)
!856 = !DILocation(line: 363, column: 6, scope: !857)
!857 = distinct !DILexicalBlock(scope: !854, file: !1, line: 363, column: 6)
!858 = !DILocation(line: 364, column: 6, scope: !859)
!859 = distinct !DILexicalBlock(scope: !849, file: !1, line: 364, column: 6)
!860 = !DILocation(line: 364, column: 6, scope: !849)
!861 = !DILocation(line: 364, column: 6, scope: !862)
!862 = distinct !DILexicalBlock(scope: !859, file: !1, line: 364, column: 6)
!863 = !DILocation(line: 366, column: 6, scope: !864)
!864 = distinct !DILexicalBlock(scope: !849, file: !1, line: 366, column: 6)
!865 = !DILocation(line: 366, column: 6, scope: !849)
!866 = !DILocation(line: 366, column: 6, scope: !867)
!867 = distinct !DILexicalBlock(scope: !864, file: !1, line: 366, column: 6)
!868 = !DILocation(line: 367, column: 6, scope: !869)
!869 = distinct !DILexicalBlock(scope: !849, file: !1, line: 367, column: 6)
!870 = !DILocation(line: 367, column: 6, scope: !849)
!871 = !DILocation(line: 367, column: 6, scope: !872)
!872 = distinct !DILexicalBlock(scope: !869, file: !1, line: 367, column: 6)
!873 = !DILocation(line: 369, column: 6, scope: !874)
!874 = distinct !DILexicalBlock(scope: !849, file: !1, line: 369, column: 6)
!875 = !DILocation(line: 369, column: 6, scope: !849)
!876 = !DILocation(line: 369, column: 6, scope: !877)
!877 = distinct !DILexicalBlock(scope: !874, file: !1, line: 369, column: 6)
!878 = !DILocation(line: 370, column: 5, scope: !849)
!879 = !DILocation(line: 372, column: 6, scope: !880)
!880 = distinct !DILexicalBlock(scope: !881, file: !1, line: 372, column: 6)
!881 = distinct !DILexicalBlock(scope: !843, file: !1, line: 371, column: 10)
!882 = !DILocation(line: 372, column: 6, scope: !881)
!883 = !DILocation(line: 372, column: 6, scope: !884)
!884 = distinct !DILexicalBlock(scope: !880, file: !1, line: 372, column: 6)
!885 = !DILocation(line: 373, column: 6, scope: !886)
!886 = distinct !DILexicalBlock(scope: !881, file: !1, line: 373, column: 6)
!887 = !DILocation(line: 373, column: 6, scope: !881)
!888 = !DILocation(line: 373, column: 6, scope: !889)
!889 = distinct !DILexicalBlock(scope: !886, file: !1, line: 373, column: 6)
!890 = !DILocation(line: 375, column: 6, scope: !891)
!891 = distinct !DILexicalBlock(scope: !881, file: !1, line: 375, column: 6)
!892 = !DILocation(line: 375, column: 6, scope: !881)
!893 = !DILocation(line: 375, column: 6, scope: !894)
!894 = distinct !DILexicalBlock(scope: !891, file: !1, line: 375, column: 6)
!895 = !DILocation(line: 378, column: 9, scope: !896)
!896 = distinct !DILexicalBlock(scope: !844, file: !1, line: 378, column: 9)
!897 = !DILocation(line: 378, column: 16, scope: !896)
!898 = !DILocation(line: 378, column: 9, scope: !844)
!899 = !DILocation(line: 379, column: 10, scope: !900)
!900 = distinct !DILexicalBlock(scope: !901, file: !1, line: 379, column: 10)
!901 = distinct !DILexicalBlock(scope: !896, file: !1, line: 378, column: 26)
!902 = !DILocation(line: 379, column: 10, scope: !901)
!903 = !DILocation(line: 380, column: 11, scope: !904)
!904 = distinct !DILexicalBlock(scope: !905, file: !1, line: 380, column: 11)
!905 = distinct !DILexicalBlock(scope: !900, file: !1, line: 379, column: 19)
!906 = !DILocation(line: 380, column: 15, scope: !904)
!907 = !DILocation(line: 380, column: 11, scope: !905)
!908 = !DILocation(line: 381, column: 8, scope: !909)
!909 = distinct !DILexicalBlock(scope: !910, file: !1, line: 381, column: 8)
!910 = distinct !DILexicalBlock(scope: !904, file: !1, line: 380, column: 19)
!911 = !DILocation(line: 381, column: 8, scope: !910)
!912 = !DILocation(line: 381, column: 8, scope: !913)
!913 = distinct !DILexicalBlock(scope: !909, file: !1, line: 381, column: 8)
!914 = !DILocation(line: 382, column: 8, scope: !915)
!915 = distinct !DILexicalBlock(scope: !910, file: !1, line: 382, column: 8)
!916 = !DILocation(line: 382, column: 8, scope: !910)
!917 = !DILocation(line: 382, column: 8, scope: !918)
!918 = distinct !DILexicalBlock(scope: !915, file: !1, line: 382, column: 8)
!919 = !DILocation(line: 383, column: 8, scope: !920)
!920 = distinct !DILexicalBlock(scope: !910, file: !1, line: 383, column: 8)
!921 = !DILocation(line: 383, column: 8, scope: !910)
!922 = !DILocation(line: 383, column: 8, scope: !923)
!923 = distinct !DILexicalBlock(scope: !920, file: !1, line: 383, column: 8)
!924 = !DILocation(line: 384, column: 8, scope: !925)
!925 = distinct !DILexicalBlock(scope: !910, file: !1, line: 384, column: 8)
!926 = !DILocation(line: 384, column: 8, scope: !910)
!927 = !DILocation(line: 384, column: 8, scope: !928)
!928 = distinct !DILexicalBlock(scope: !925, file: !1, line: 384, column: 8)
!929 = !DILocation(line: 385, column: 7, scope: !910)
!930 = !DILocation(line: 387, column: 8, scope: !931)
!931 = distinct !DILexicalBlock(scope: !932, file: !1, line: 387, column: 8)
!932 = distinct !DILexicalBlock(scope: !904, file: !1, line: 386, column: 12)
!933 = !DILocation(line: 387, column: 8, scope: !932)
!934 = !DILocation(line: 387, column: 8, scope: !935)
!935 = distinct !DILexicalBlock(scope: !931, file: !1, line: 387, column: 8)
!936 = !DILocation(line: 388, column: 8, scope: !937)
!937 = distinct !DILexicalBlock(scope: !932, file: !1, line: 388, column: 8)
!938 = !DILocation(line: 388, column: 8, scope: !932)
!939 = !DILocation(line: 388, column: 8, scope: !940)
!940 = distinct !DILexicalBlock(scope: !937, file: !1, line: 388, column: 8)
!941 = !DILocation(line: 389, column: 8, scope: !942)
!942 = distinct !DILexicalBlock(scope: !932, file: !1, line: 389, column: 8)
!943 = !DILocation(line: 389, column: 8, scope: !932)
!944 = !DILocation(line: 389, column: 8, scope: !945)
!945 = distinct !DILexicalBlock(scope: !942, file: !1, line: 389, column: 8)
!946 = !DILocation(line: 391, column: 6, scope: !905)
!947 = !DILocation(line: 393, column: 18, scope: !901)
!948 = !DILocation(line: 393, column: 6, scope: !901)
!949 = !DILocation(line: 393, column: 10, scope: !901)
!950 = !DILocation(line: 393, column: 16, scope: !901)
!951 = !DILocation(line: 395, column: 10, scope: !952)
!952 = distinct !DILexicalBlock(scope: !901, file: !1, line: 395, column: 10)
!953 = !DILocation(line: 395, column: 14, scope: !952)
!954 = !DILocation(line: 395, column: 10, scope: !901)
!955 = !DILocation(line: 396, column: 34, scope: !956)
!956 = distinct !DILexicalBlock(scope: !952, file: !1, line: 395, column: 18)
!957 = !DILocation(line: 396, column: 38, scope: !956)
!958 = !DILocation(line: 396, column: 42, scope: !956)
!959 = !DILocation(line: 396, column: 7, scope: !956)
!960 = !DILocation(line: 398, column: 13, scope: !956)
!961 = !DILocation(line: 398, column: 17, scope: !956)
!962 = !DILocation(line: 398, column: 7, scope: !956)
!963 = !DILocation(line: 399, column: 6, scope: !956)
!964 = !DILocation(line: 401, column: 33, scope: !965)
!965 = distinct !DILexicalBlock(scope: !952, file: !1, line: 400, column: 11)
!966 = !DILocation(line: 401, column: 37, scope: !965)
!967 = !DILocation(line: 401, column: 41, scope: !965)
!968 = !DILocation(line: 401, column: 7, scope: !965)
!969 = !DILocation(line: 402, column: 13, scope: !965)
!970 = !DILocation(line: 402, column: 17, scope: !965)
!971 = !DILocation(line: 402, column: 7, scope: !965)
!972 = !DILocation(line: 405, column: 17, scope: !901)
!973 = !DILocation(line: 406, column: 8, scope: !901)
!974 = !DILocation(line: 407, column: 5, scope: !901)
!975 = !DILocation(line: 408, column: 4, scope: !844)
!976 = !DILocation(line: 410, column: 8, scope: !977)
!977 = distinct !DILexicalBlock(scope: !804, file: !1, line: 410, column: 8)
!978 = !DILocation(line: 410, column: 8, scope: !804)
!979 = !DILocation(line: 411, column: 5, scope: !980)
!980 = distinct !DILexicalBlock(scope: !981, file: !1, line: 411, column: 5)
!981 = distinct !DILexicalBlock(scope: !977, file: !1, line: 410, column: 16)
!982 = !DILocation(line: 412, column: 4, scope: !981)
!983 = !DILocation(line: 413, column: 3, scope: !804)
!984 = !DILocation(line: 346, column: 59, scope: !799)
!985 = !DILocation(line: 346, column: 65, scope: !799)
!986 = !DILocation(line: 346, column: 3, scope: !799)
!987 = distinct !{!987, !802, !988}
!988 = !DILocation(line: 413, column: 3, scope: !792)
!989 = !DILocation(line: 415, column: 9, scope: !760)
!990 = !DILocation(line: 415, column: 21, scope: !760)
!991 = !DILocation(line: 415, column: 3, scope: !760)
!992 = !DILocation(line: 417, column: 8, scope: !760)
!993 = !DILocation(line: 417, column: 6, scope: !760)
!994 = !DILocation(line: 418, column: 13, scope: !760)
!995 = !DILocation(line: 418, column: 11, scope: !760)
!996 = !DILocation(line: 419, column: 5, scope: !760)
!997 = !DILocation(line: 421, column: 10, scope: !998)
!998 = distinct !DILexicalBlock(scope: !760, file: !1, line: 421, column: 3)
!999 = !DILocation(line: 421, column: 8, scope: !998)
!1000 = !DILocation(line: 421, column: 15, scope: !1001)
!1001 = distinct !DILexicalBlock(scope: !998, file: !1, line: 421, column: 3)
!1002 = !DILocation(line: 421, column: 19, scope: !1001)
!1003 = !DILocation(line: 421, column: 17, scope: !1001)
!1004 = !DILocation(line: 421, column: 3, scope: !998)
!1005 = !DILocalVariable(name: "remove", scope: !1006, file: !1, line: 422, type: !112)
!1006 = distinct !DILexicalBlock(scope: !1001, file: !1, line: 421, column: 43)
!1007 = !DILocation(line: 422, column: 9, scope: !1006)
!1008 = !DILocation(line: 425, column: 15, scope: !1009)
!1009 = distinct !DILexicalBlock(scope: !1006, file: !1, line: 425, column: 8)
!1010 = !DILocation(line: 425, column: 19, scope: !1009)
!1011 = !DILocation(line: 425, column: 23, scope: !1009)
!1012 = !DILocation(line: 425, column: 32, scope: !1009)
!1013 = !DILocation(line: 425, column: 8, scope: !1009)
!1014 = !DILocation(line: 425, column: 57, scope: !1009)
!1015 = !DILocation(line: 425, column: 8, scope: !1006)
!1016 = !DILocation(line: 426, column: 10, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !1009, file: !1, line: 425, column: 63)
!1018 = !DILocation(line: 426, column: 19, scope: !1017)
!1019 = !DILocation(line: 426, column: 23, scope: !1017)
!1020 = !DILocation(line: 426, column: 17, scope: !1017)
!1021 = !DILocation(line: 426, column: 8, scope: !1017)
!1022 = !DILocation(line: 428, column: 9, scope: !1023)
!1023 = distinct !DILexicalBlock(scope: !1017, file: !1, line: 428, column: 9)
!1024 = !DILocation(line: 428, column: 9, scope: !1017)
!1025 = !DILocation(line: 429, column: 16, scope: !1026)
!1026 = distinct !DILexicalBlock(scope: !1023, file: !1, line: 428, column: 21)
!1027 = !DILocation(line: 429, column: 25, scope: !1026)
!1028 = !DILocation(line: 429, column: 34, scope: !1026)
!1029 = !DILocation(line: 429, column: 23, scope: !1026)
!1030 = !DILocation(line: 429, column: 14, scope: !1026)
!1031 = !DILocation(line: 431, column: 10, scope: !1032)
!1032 = distinct !DILexicalBlock(scope: !1026, file: !1, line: 431, column: 10)
!1033 = !DILocation(line: 431, column: 14, scope: !1032)
!1034 = !DILocation(line: 431, column: 10, scope: !1026)
!1035 = !DILocation(line: 432, column: 7, scope: !1036)
!1036 = distinct !DILexicalBlock(scope: !1032, file: !1, line: 431, column: 18)
!1037 = !DILocation(line: 435, column: 6, scope: !1036)
!1038 = !DILocation(line: 437, column: 7, scope: !1039)
!1039 = distinct !DILexicalBlock(scope: !1032, file: !1, line: 436, column: 11)
!1040 = !DILocation(line: 441, column: 5, scope: !1026)
!1041 = !DILocation(line: 443, column: 14, scope: !1017)
!1042 = !DILocation(line: 443, column: 12, scope: !1017)
!1043 = !DILocation(line: 444, column: 4, scope: !1017)
!1044 = !DILocation(line: 446, column: 15, scope: !1045)
!1045 = distinct !DILexicalBlock(scope: !1009, file: !1, line: 445, column: 9)
!1046 = !DILocation(line: 446, column: 13, scope: !1045)
!1047 = !DILocation(line: 449, column: 8, scope: !1048)
!1048 = distinct !DILexicalBlock(scope: !1006, file: !1, line: 449, column: 8)
!1049 = !DILocation(line: 449, column: 8, scope: !1006)
!1050 = !DILocation(line: 450, column: 5, scope: !1051)
!1051 = distinct !DILexicalBlock(scope: !1052, file: !1, line: 450, column: 5)
!1052 = distinct !DILexicalBlock(scope: !1048, file: !1, line: 449, column: 16)
!1053 = !DILocation(line: 451, column: 4, scope: !1052)
!1054 = !DILocation(line: 452, column: 3, scope: !1006)
!1055 = !DILocation(line: 421, column: 33, scope: !1001)
!1056 = !DILocation(line: 421, column: 39, scope: !1001)
!1057 = !DILocation(line: 421, column: 3, scope: !1001)
!1058 = distinct !{!1058, !1004, !1059}
!1059 = !DILocation(line: 452, column: 3, scope: !998)
!1060 = !DILocation(line: 454, column: 3, scope: !760)
!1061 = !DILocation(line: 454, column: 13, scope: !760)
!1062 = !DILocation(line: 459, column: 2, scope: !760)
!1063 = !DILocalVariable(name: "sort_polys", scope: !1064, file: !1, line: 476, type: !1065)
!1064 = distinct !DILexicalBlock(scope: !109, file: !1, line: 475, column: 2)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1066 = !DIDerivedType(tag: DW_TAG_typedef, name: "SortPoly", file: !1, line: 77, baseType: !1067)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SortPoly", file: !1, line: 71, size: 192, elements: !1068)
!1068 = !{!1069, !1070, !1071, !1072, !1073}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "verts", scope: !1067, file: !1, line: 72, baseType: !89, size: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "numverts", scope: !1067, file: !1, line: 73, baseType: !78, size: 32, offset: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !1067, file: !1, line: 74, baseType: !78, size: 32, offset: 96)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1067, file: !1, line: 75, baseType: !5, size: 32, offset: 128)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "invalid", scope: !1067, file: !1, line: 76, baseType: !112, size: 8, offset: 160)
!1074 = !DILocation(line: 476, column: 13, scope: !1064)
!1075 = !DILocation(line: 476, column: 26, scope: !1064)
!1076 = !DILocation(line: 476, column: 57, scope: !1064)
!1077 = !DILocation(line: 476, column: 55, scope: !1064)
!1078 = !DILocalVariable(name: "prev_sp", scope: !1064, file: !1, line: 477, type: !1065)
!1079 = !DILocation(line: 477, column: 13, scope: !1064)
!1080 = !DILocalVariable(name: "sp", scope: !1064, file: !1, line: 477, type: !1065)
!1081 = !DILocation(line: 477, column: 23, scope: !1064)
!1082 = !DILocation(line: 477, column: 28, scope: !1064)
!1083 = !DILocalVariable(name: "prev_end", scope: !1064, file: !1, line: 478, type: !78)
!1084 = !DILocation(line: 478, column: 7, scope: !1064)
!1085 = !DILocation(line: 479, column: 10, scope: !1086)
!1086 = distinct !DILexicalBlock(scope: !1064, file: !1, line: 479, column: 3)
!1087 = !DILocation(line: 479, column: 20, scope: !1086)
!1088 = !DILocation(line: 479, column: 18, scope: !1086)
!1089 = !DILocation(line: 479, column: 8, scope: !1086)
!1090 = !DILocation(line: 479, column: 28, scope: !1091)
!1091 = distinct !DILexicalBlock(scope: !1086, file: !1, line: 479, column: 3)
!1092 = !DILocation(line: 479, column: 32, scope: !1091)
!1093 = !DILocation(line: 479, column: 30, scope: !1091)
!1094 = !DILocation(line: 479, column: 3, scope: !1086)
!1095 = !DILocation(line: 480, column: 16, scope: !1096)
!1096 = distinct !DILexicalBlock(scope: !1091, file: !1, line: 479, column: 58)
!1097 = !DILocation(line: 480, column: 4, scope: !1096)
!1098 = !DILocation(line: 480, column: 8, scope: !1096)
!1099 = !DILocation(line: 480, column: 14, scope: !1096)
!1100 = !DILocation(line: 482, column: 8, scope: !1101)
!1101 = distinct !DILexicalBlock(scope: !1096, file: !1, line: 482, column: 8)
!1102 = !DILocation(line: 482, column: 12, scope: !1101)
!1103 = !DILocation(line: 482, column: 22, scope: !1101)
!1104 = !DILocation(line: 482, column: 26, scope: !1101)
!1105 = !DILocation(line: 482, column: 29, scope: !1101)
!1106 = !DILocation(line: 482, column: 33, scope: !1101)
!1107 = !DILocation(line: 482, column: 41, scope: !1101)
!1108 = !DILocation(line: 482, column: 8, scope: !1096)
!1109 = !DILocation(line: 484, column: 5, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !1101, file: !1, line: 482, column: 46)
!1111 = !DILocation(line: 486, column: 5, scope: !1110)
!1112 = !DILocation(line: 486, column: 9, scope: !1110)
!1113 = !DILocation(line: 486, column: 17, scope: !1110)
!1114 = !DILocation(line: 487, column: 4, scope: !1110)
!1115 = !DILocation(line: 488, column: 13, scope: !1116)
!1116 = distinct !DILexicalBlock(scope: !1101, file: !1, line: 488, column: 13)
!1117 = !DILocation(line: 488, column: 17, scope: !1116)
!1118 = !DILocation(line: 488, column: 29, scope: !1116)
!1119 = !DILocation(line: 488, column: 33, scope: !1116)
!1120 = !DILocation(line: 488, column: 27, scope: !1116)
!1121 = !DILocation(line: 488, column: 43, scope: !1116)
!1122 = !DILocation(line: 488, column: 41, scope: !1116)
!1123 = !DILocation(line: 488, column: 13, scope: !1101)
!1124 = !DILocation(line: 490, column: 5, scope: !1125)
!1125 = distinct !DILexicalBlock(scope: !1116, file: !1, line: 488, column: 52)
!1126 = !DILocation(line: 492, column: 5, scope: !1125)
!1127 = !DILocation(line: 492, column: 9, scope: !1125)
!1128 = !DILocation(line: 492, column: 17, scope: !1125)
!1129 = !DILocation(line: 493, column: 4, scope: !1125)
!1130 = !DILocalVariable(name: "v1", scope: !1131, file: !1, line: 496, type: !78)
!1131 = distinct !DILexicalBlock(scope: !1116, file: !1, line: 494, column: 9)
!1132 = !DILocation(line: 496, column: 9, scope: !1131)
!1133 = !DILocalVariable(name: "v2", scope: !1131, file: !1, line: 496, type: !78)
!1134 = !DILocation(line: 496, column: 13, scope: !1131)
!1135 = !DILocation(line: 497, column: 5, scope: !1131)
!1136 = !DILocation(line: 497, column: 9, scope: !1131)
!1137 = !DILocation(line: 497, column: 17, scope: !1131)
!1138 = !DILocation(line: 498, column: 21, scope: !1131)
!1139 = !DILocation(line: 498, column: 47, scope: !1131)
!1140 = !DILocation(line: 498, column: 51, scope: !1131)
!1141 = !DILocation(line: 498, column: 45, scope: !1131)
!1142 = !DILocation(line: 498, column: 19, scope: !1131)
!1143 = !DILocation(line: 498, column: 5, scope: !1131)
!1144 = !DILocation(line: 498, column: 9, scope: !1131)
!1145 = !DILocation(line: 498, column: 15, scope: !1131)
!1146 = !DILocation(line: 499, column: 20, scope: !1131)
!1147 = !DILocation(line: 499, column: 24, scope: !1131)
!1148 = !DILocation(line: 499, column: 5, scope: !1131)
!1149 = !DILocation(line: 499, column: 9, scope: !1131)
!1150 = !DILocation(line: 499, column: 18, scope: !1131)
!1151 = !DILocation(line: 500, column: 21, scope: !1131)
!1152 = !DILocation(line: 500, column: 25, scope: !1131)
!1153 = !DILocation(line: 500, column: 5, scope: !1131)
!1154 = !DILocation(line: 500, column: 9, scope: !1131)
!1155 = !DILocation(line: 500, column: 19, scope: !1131)
!1156 = !DILocation(line: 503, column: 12, scope: !1157)
!1157 = distinct !DILexicalBlock(scope: !1131, file: !1, line: 503, column: 5)
!1158 = !DILocation(line: 503, column: 23, scope: !1157)
!1159 = !DILocation(line: 503, column: 30, scope: !1157)
!1160 = !DILocation(line: 503, column: 34, scope: !1157)
!1161 = !DILocation(line: 503, column: 20, scope: !1157)
!1162 = !DILocation(line: 503, column: 10, scope: !1157)
!1163 = !DILocation(line: 503, column: 46, scope: !1164)
!1164 = distinct !DILexicalBlock(scope: !1157, file: !1, line: 503, column: 5)
!1165 = !DILocation(line: 503, column: 50, scope: !1164)
!1166 = !DILocation(line: 503, column: 54, scope: !1164)
!1167 = !DILocation(line: 503, column: 48, scope: !1164)
!1168 = !DILocation(line: 503, column: 5, scope: !1157)
!1169 = !DILocation(line: 504, column: 10, scope: !1170)
!1170 = distinct !DILexicalBlock(scope: !1171, file: !1, line: 504, column: 10)
!1171 = distinct !DILexicalBlock(scope: !1164, file: !1, line: 503, column: 79)
!1172 = !DILocation(line: 504, column: 14, scope: !1170)
!1173 = !DILocation(line: 504, column: 19, scope: !1170)
!1174 = !DILocation(line: 504, column: 16, scope: !1170)
!1175 = !DILocation(line: 504, column: 10, scope: !1171)
!1176 = !DILocation(line: 506, column: 7, scope: !1177)
!1177 = distinct !DILexicalBlock(scope: !1170, file: !1, line: 504, column: 28)
!1178 = !DILocation(line: 507, column: 7, scope: !1177)
!1179 = !DILocation(line: 507, column: 11, scope: !1177)
!1180 = !DILocation(line: 507, column: 19, scope: !1177)
!1181 = !DILocation(line: 508, column: 6, scope: !1177)
!1182 = !DILocation(line: 510, column: 7, scope: !1183)
!1183 = distinct !DILexicalBlock(scope: !1170, file: !1, line: 509, column: 11)
!1184 = !DILocation(line: 510, column: 14, scope: !1183)
!1185 = !DILocation(line: 510, column: 18, scope: !1183)
!1186 = !DILocation(line: 510, column: 21, scope: !1183)
!1187 = !DILocation(line: 510, column: 26, scope: !1183)
!1188 = !DILocation(line: 512, column: 11, scope: !1171)
!1189 = !DILocation(line: 512, column: 15, scope: !1171)
!1190 = !DILocation(line: 512, column: 7, scope: !1171)
!1191 = !DILocation(line: 512, column: 9, scope: !1171)
!1192 = !DILocation(line: 513, column: 5, scope: !1171)
!1193 = !DILocation(line: 503, column: 64, scope: !1164)
!1194 = !DILocation(line: 503, column: 70, scope: !1164)
!1195 = !DILocation(line: 503, column: 75, scope: !1164)
!1196 = !DILocation(line: 503, column: 5, scope: !1164)
!1197 = distinct !{!1197, !1168, !1198}
!1198 = !DILocation(line: 513, column: 5, scope: !1157)
!1199 = !DILocation(line: 516, column: 10, scope: !1200)
!1200 = distinct !DILexicalBlock(scope: !1131, file: !1, line: 516, column: 9)
!1201 = !DILocation(line: 516, column: 14, scope: !1200)
!1202 = !DILocation(line: 516, column: 9, scope: !1131)
!1203 = !DILocation(line: 517, column: 10, scope: !1204)
!1204 = distinct !DILexicalBlock(scope: !1200, file: !1, line: 516, column: 23)
!1205 = !DILocation(line: 517, column: 14, scope: !1204)
!1206 = !DILocation(line: 517, column: 8, scope: !1204)
!1207 = !DILocation(line: 518, column: 13, scope: !1208)
!1208 = distinct !DILexicalBlock(scope: !1204, file: !1, line: 518, column: 6)
!1209 = !DILocation(line: 518, column: 11, scope: !1208)
!1210 = !DILocation(line: 518, column: 18, scope: !1211)
!1211 = distinct !DILexicalBlock(scope: !1208, file: !1, line: 518, column: 6)
!1212 = !DILocation(line: 518, column: 22, scope: !1211)
!1213 = !DILocation(line: 518, column: 26, scope: !1211)
!1214 = !DILocation(line: 518, column: 20, scope: !1211)
!1215 = !DILocation(line: 518, column: 6, scope: !1208)
!1216 = !DILocation(line: 519, column: 12, scope: !1217)
!1217 = distinct !DILexicalBlock(scope: !1218, file: !1, line: 519, column: 11)
!1218 = distinct !DILexicalBlock(scope: !1211, file: !1, line: 518, column: 45)
!1219 = !DILocation(line: 519, column: 20, scope: !1217)
!1220 = !DILocation(line: 519, column: 19, scope: !1217)
!1221 = !DILocation(line: 519, column: 23, scope: !1217)
!1222 = !DILocation(line: 519, column: 28, scope: !1217)
!1223 = !DILocation(line: 519, column: 47, scope: !1217)
!1224 = !DILocation(line: 519, column: 11, scope: !1218)
!1225 = !DILocation(line: 520, column: 8, scope: !1226)
!1226 = distinct !DILexicalBlock(scope: !1217, file: !1, line: 519, column: 53)
!1227 = !DILocation(line: 521, column: 8, scope: !1226)
!1228 = !DILocation(line: 521, column: 12, scope: !1226)
!1229 = !DILocation(line: 521, column: 20, scope: !1226)
!1230 = !DILocation(line: 522, column: 7, scope: !1226)
!1231 = !DILocation(line: 523, column: 7, scope: !1218)
!1232 = !DILocation(line: 523, column: 15, scope: !1218)
!1233 = !DILocation(line: 523, column: 14, scope: !1218)
!1234 = !DILocation(line: 523, column: 18, scope: !1218)
!1235 = !DILocation(line: 523, column: 23, scope: !1218)
!1236 = !DILocation(line: 524, column: 6, scope: !1218)
!1237 = !DILocation(line: 518, column: 36, scope: !1211)
!1238 = !DILocation(line: 518, column: 41, scope: !1211)
!1239 = !DILocation(line: 518, column: 6, scope: !1211)
!1240 = distinct !{!1240, !1215, !1241}
!1241 = !DILocation(line: 524, column: 6, scope: !1208)
!1242 = !DILocation(line: 525, column: 5, scope: !1204)
!1243 = !DILocation(line: 527, column: 9, scope: !1244)
!1244 = distinct !DILexicalBlock(scope: !1131, file: !1, line: 527, column: 9)
!1245 = !DILocation(line: 527, column: 13, scope: !1244)
!1246 = !DILocation(line: 527, column: 9, scope: !1131)
!1247 = !DILocation(line: 528, column: 6, scope: !1244)
!1248 = !DILocation(line: 531, column: 12, scope: !1249)
!1249 = distinct !DILexicalBlock(scope: !1131, file: !1, line: 531, column: 5)
!1250 = !DILocation(line: 531, column: 23, scope: !1249)
!1251 = !DILocation(line: 531, column: 30, scope: !1249)
!1252 = !DILocation(line: 531, column: 34, scope: !1249)
!1253 = !DILocation(line: 531, column: 20, scope: !1249)
!1254 = !DILocation(line: 531, column: 10, scope: !1249)
!1255 = !DILocation(line: 531, column: 46, scope: !1256)
!1256 = distinct !DILexicalBlock(scope: !1249, file: !1, line: 531, column: 5)
!1257 = !DILocation(line: 531, column: 50, scope: !1256)
!1258 = !DILocation(line: 531, column: 54, scope: !1256)
!1259 = !DILocation(line: 531, column: 48, scope: !1256)
!1260 = !DILocation(line: 531, column: 5, scope: !1249)
!1261 = !DILocation(line: 532, column: 11, scope: !1262)
!1262 = distinct !DILexicalBlock(scope: !1256, file: !1, line: 531, column: 74)
!1263 = !DILocation(line: 532, column: 15, scope: !1262)
!1264 = !DILocation(line: 532, column: 9, scope: !1262)
!1265 = !DILocation(line: 533, column: 11, scope: !1262)
