; ModuleID = 'blender/source/blender/editors/animation/anim_channels_defines.c'
source_filename = "blender/source/blender/editors/animation/anim_channels_defines.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.bAnimChannelType = type { i8*, i32, void (%struct.bAnimContext*, %struct.bAnimListElem*, float*)*, void (%struct.bAnimContext*, %struct.bAnimListElem*, float, float)*, i16 (%struct.bAnimContext*, %struct.bAnimListElem*)*, i16 (%struct.bAnimContext*, %struct.bAnimListElem*)*, void (%struct.bAnimListElem*, i8*)*, i8 (%struct.bAnimListElem*, %struct.PointerRNA*, %struct.PropertyRNA**)*, i32 (%struct.bAnimListElem*)*, i8 (%struct.bAnimContext*, %struct.bAnimListElem*, i32)*, i32 (%struct.bAnimContext*, i32, i8*)*, i8* (%struct.bAnimListElem*, i32, i16*)* }
%struct.bAnimContext = type { i8*, i16, i16, i16, i16, %struct.ScrArea*, %struct.SpaceLink*, %struct.ARegion*, %struct.bDopeSheet*, %struct.Scene*, %struct.Object*, %struct.ListBase*, %struct.ReportList* }
%struct.ScrArea = type { %struct.ScrArea*, %struct.ScrArea*, %struct.ScrVert*, %struct.ScrVert*, %struct.ScrVert*, %struct.ScrVert*, %struct.bScreen*, %struct.rcti, i8, i8, i16, i16, i16, i16, i16, i16, i8, i8, %struct.SpaceType*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase }
%struct.ScrVert = type { %struct.ScrVert*, %struct.ScrVert*, %struct.ScrVert*, %struct.vec2s, i16, i16 }

!1337 = !DIEnumerator(name: "KEYBLOCK_SEL", value: 2, isUnsigned: true)
!1338 = !DIEnumerator(name: "KEYBLOCK_LOCKED", value: 4, isUnsigned: true)
!1339 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1340, line: 233, baseType: !13, size: 32, elements: !1341)
!1340 = !DIFile(filename: "blender/source/blender/makesdna/DNA_mask_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1341 = !{!1342}
!1342 = !DIEnumerator(name: "MASK_ANIMF_EXPAND", value: 16, isUnsigned: true)
!1343 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1340, line: 217, baseType: !13, size: 32, elements: !1344)
!1344 = !{!1345, !1346, !1347, !1348}
!1345 = !DIEnumerator(name: "MASK_LAYERFLAG_LOCKED", value: 16, isUnsigned: true)
!1346 = !DIEnumerator(name: "MASK_LAYERFLAG_SELECT", value: 32, isUnsigned: true)
!1347 = !DIEnumerator(name: "MASK_LAYERFLAG_FILL_DISCRETE", value: 64, isUnsigned: true)
!1348 = !DIEnumerator(name: "MASK_LAYERFLAG_FILL_OVERLAP", value: 128, isUnsigned: true)
!1349 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNlaTrack_Flag", file: !285, line: 685, baseType: !13, size: 32, elements: !1350)
!1350 = !{!1351, !1352, !1353, !1354, !1355, !1356}
!1351 = !DIEnumerator(name: "NLATRACK_ACTIVE", value: 1, isUnsigned: true)
!1352 = !DIEnumerator(name: "NLATRACK_SELECTED", value: 2, isUnsigned: true)
!1353 = !DIEnumerator(name: "NLATRACK_MUTED", value: 4, isUnsigned: true)
!1354 = !DIEnumerator(name: "NLATRACK_SOLO", value: 8, isUnsigned: true)
!1355 = !DIEnumerator(name: "NLATRACK_PROTECTED", value: 16, isUnsigned: true)
!1356 = !DIEnumerator(name: "NLATRACK_DISABLED", value: 1024, isUnsigned: true)
!1357 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eAnim_KeyType", file: !6, line: 179, baseType: !13, size: 32, elements: !1358)
!1358 = !{!1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368}
!1359 = !DIEnumerator(name: "ALE_NONE", value: 0, isUnsigned: true)
!1360 = !DIEnumerator(name: "ALE_FCURVE", value: 1, isUnsigned: true)
!1361 = !DIEnumerator(name: "ALE_GPFRAME", value: 2, isUnsigned: true)
!1362 = !DIEnumerator(name: "ALE_MASKLAY", value: 3, isUnsigned: true)
!1363 = !DIEnumerator(name: "ALE_NLASTRIP", value: 4, isUnsigned: true)
!1364 = !DIEnumerator(name: "ALE_ALL", value: 5, isUnsigned: true)
!1365 = !DIEnumerator(name: "ALE_SCE", value: 6, isUnsigned: true)
!1366 = !DIEnumerator(name: "ALE_OB", value: 7, isUnsigned: true)
!1367 = !DIEnumerator(name: "ALE_ACT", value: 8, isUnsigned: true)
!1368 = !DIEnumerator(name: "ALE_GROUP", value: 9, isUnsigned: true)
!1369 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eAnimFilter_Flags", file: !6, line: 210, baseType: !7, size: 32, elements: !1370)
!1370 = !{!1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384}
!1371 = !DIEnumerator(name: "ANIMFILTER_DATA_VISIBLE", value: 1)
!1372 = !DIEnumerator(name: "ANIMFILTER_LIST_VISIBLE", value: 2)
!1373 = !DIEnumerator(name: "ANIMFILTER_CURVE_VISIBLE", value: 4)
!1374 = !DIEnumerator(name: "ANIMFILTER_LIST_CHANNELS", value: 8)
!1375 = !DIEnumerator(name: "ANIMFILTER_ACTIVE", value: 16)
!1376 = !DIEnumerator(name: "ANIMFILTER_ACTGROUPED", value: 32)
!1377 = !DIEnumerator(name: "ANIMFILTER_SEL", value: 64)
!1378 = !DIEnumerator(name: "ANIMFILTER_UNSEL", value: 128)
!1379 = !DIEnumerator(name: "ANIMFILTER_FOREDIT", value: 256)
!1380 = !DIEnumerator(name: "ANIMFILTER_SELEDIT", value: 512)
!1381 = !DIEnumerator(name: "ANIMFILTER_ANIMDATA", value: 1024)
!1382 = !DIEnumerator(name: "ANIMFILTER_NODUPLIS", value: 2048)
!1383 = !DIEnumerator(name: "ANIMFILTER_TMP_PEEK", value: 1073741824)
!1384 = !DIEnumerator(name: "ANIMFILTER_TMP_IGNORE_ONLYSEL", value: -2147483648)
!1385 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eInsertKeyFlags", file: !285, line: 788, baseType: !13, size: 32, elements: !1386)
!1386 = !{!1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394}
!1387 = !DIEnumerator(name: "INSERTKEY_NEEDED", value: 1, isUnsigned: true)
!1388 = !DIEnumerator(name: "INSERTKEY_MATRIX", value: 2, isUnsigned: true)
!1389 = !DIEnumerator(name: "INSERTKEY_FAST", value: 4, isUnsigned: true)
!1390 = !DIEnumerator(name: "INSERTKEY_FASTR", value: 8, isUnsigned: true)
!1391 = !DIEnumerator(name: "INSERTKEY_REPLACE", value: 16, isUnsigned: true)
!1392 = !DIEnumerator(name: "INSERTKEY_XYZ2RGB", value: 32, isUnsigned: true)
!1393 = !DIEnumerator(name: "INSERTKEY_NO_USERPREF", value: 64, isUnsigned: true)
!1394 = !DIEnumerator(name: "INSERTKEY_OVERWRITE_FULL", value: 128, isUnsigned: true)
!1395 = !{!1396, !1397, !1398, !1400, !1402, !1455, !1508, !3795, !7, !3816, !3836, !3855, !1612, !3963, !3965, !1410, !1399, !3967, !1671, !3969, !3971, !3973, !4053, !4077, !4179, !4181, !4368, !4417, !4484, !4611, !4613, !4662, !4712, !4732, !4734, !4758, !4760, !4818, !4829, !4832, !4848}
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!1398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1399, size: 64)
!1399 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1401, size: 64)
!1401 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1403, size: 64)
!1403 = !DIDerivedType(tag: DW_TAG_typedef, name: "FCurve", file: !285, line: 463, baseType: !1404)
!1404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FCurve", file: !285, line: 433, size: 896, elements: !1405)
!1405 = !{!1406, !1408, !1409, !1443, !1459, !1460, !1485, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1506, !1507}
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1404, file: !285, line: 434, baseType: !1407, size: 64)
!1407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1404, size: 64)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1404, file: !285, line: 434, baseType: !1407, size: 64, offset: 64)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "grp", scope: !1404, file: !285, line: 437, baseType: !1410, size: 64, offset: 128)
!1410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1411, size: 64)
!1411 = !DIDerivedType(tag: DW_TAG_typedef, name: "bActionGroup", file: !298, line: 450, baseType: !1412)
!1412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bActionGroup", file: !298, line: 440, size: 960, elements: !1413)
!1413 = !{!1414, !1416, !1417, !1424, !1425, !1426, !1430}
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1412, file: !298, line: 441, baseType: !1415, size: 64)
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1412, size: 64)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1412, file: !298, line: 441, baseType: !1415, size: 64, offset: 64)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1412, file: !298, line: 443, baseType: !1418, size: 128, offset: 128)
!1418 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !1419, line: 71, baseType: !1420)
!1419 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !1419, line: 69, size: 128, elements: !1421)
!1421 = !{!1422, !1423}
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1420, file: !1419, line: 70, baseType: !1396, size: 64)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1420, file: !1419, line: 70, baseType: !1396, size: 64, offset: 64)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1412, file: !298, line: 445, baseType: !7, size: 32, offset: 256)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "customCol", scope: !1412, file: !298, line: 446, baseType: !7, size: 32, offset: 288)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1412, file: !298, line: 447, baseType: !1427, size: 512, offset: 320)
!1427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1401, size: 512, elements: !1428)
!1428 = !{!1429}
!1429 = !DISubrange(count: 64)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !1412, file: !298, line: 449, baseType: !1431, size: 128, offset: 832)
!1431 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThemeWireColor", file: !1432, line: 347, baseType: !1433)
!1432 = !DIFile(filename: "blender/source/blender/makesdna/DNA_userdef_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ThemeWireColor", file: !1432, line: 340, size: 128, elements: !1434)
!1434 = !{!1435, !1439, !1440, !1441, !1442}
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "solid", scope: !1433, file: !1432, line: 341, baseType: !1436, size: 32)
!1436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1401, size: 32, elements: !1437)
!1437 = !{!1438}
!1438 = !DISubrange(count: 4)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "select", scope: !1433, file: !1432, line: 342, baseType: !1436, size: 32, offset: 32)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !1433, file: !1432, line: 343, baseType: !1436, size: 32, offset: 64)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1433, file: !1432, line: 345, baseType: !1399, size: 16, offset: 96)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1433, file: !1432, line: 346, baseType: !1399, size: 16, offset: 112)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "driver", scope: !1404, file: !285, line: 440, baseType: !1444, size: 64, offset: 192)
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1445, size: 64)
!1445 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelDriver", file: !285, line: 386, baseType: !1446)
!1446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ChannelDriver", file: !285, line: 371, size: 2368, elements: !1447)
!1447 = !{!1448, !1449, !1453, !1454, !1456, !1457, !1458}
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "variables", scope: !1446, file: !285, line: 372, baseType: !1418, size: 128)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "expression", scope: !1446, file: !285, line: 377, baseType: !1450, size: 2048, offset: 128)
!1450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1401, size: 2048, elements: !1451)
!1451 = !{!1452}
!1452 = !DISubrange(count: 256)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "expr_comp", scope: !1446, file: !285, line: 378, baseType: !1396, size: 64, offset: 2176)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "curval", scope: !1446, file: !285, line: 380, baseType: !1455, size: 32, offset: 2240)
!1455 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !1446, file: !285, line: 381, baseType: !1455, size: 32, offset: 2272)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1446, file: !285, line: 384, baseType: !7, size: 32, offset: 2304)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1446, file: !285, line: 385, baseType: !7, size: 32, offset: 2336)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !1404, file: !285, line: 442, baseType: !1418, size: 128, offset: 256)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "bezt", scope: !1404, file: !285, line: 445, baseType: !1461, size: 64, offset: 384)
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64)
!1462 = !DIDerivedType(tag: DW_TAG_typedef, name: "BezTriple", file: !1463, line: 133, baseType: !1464)
!1463 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BezTriple", file: !1463, line: 117, size: 576, elements: !1465)
!1465 = !{!1466, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484}
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1464, file: !1463, line: 118, baseType: !1467, size: 288)
!1467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1455, size: 288, elements: !1468)
!1468 = !{!1469, !1469}
!1469 = !DISubrange(count: 3)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "alfa", scope: !1464, file: !1463, line: 119, baseType: !1455, size: 32, offset: 288)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !1464, file: !1463, line: 119, baseType: !1455, size: 32, offset: 320)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !1464, file: !1463, line: 119, baseType: !1455, size: 32, offset: 352)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1464, file: !1463, line: 121, baseType: !1401, size: 8, offset: 384)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "h1", scope: !1464, file: !1463, line: 123, baseType: !1401, size: 8, offset: 392)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "h2", scope: !1464, file: !1463, line: 123, baseType: !1401, size: 8, offset: 400)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "f1", scope: !1464, file: !1463, line: 124, baseType: !1401, size: 8, offset: 408)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "f2", scope: !1464, file: !1463, line: 124, baseType: !1401, size: 8, offset: 416)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "f3", scope: !1464, file: !1463, line: 124, baseType: !1401, size: 8, offset: 424)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "hide", scope: !1464, file: !1463, line: 126, baseType: !1401, size: 8, offset: 432)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "easing", scope: !1464, file: !1463, line: 128, baseType: !1401, size: 8, offset: 440)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !1464, file: !1463, line: 129, baseType: !1455, size: 32, offset: 448)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "amplitude", scope: !1464, file: !1463, line: 130, baseType: !1455, size: 32, offset: 480)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !1464, file: !1463, line: 130, baseType: !1455, size: 32, offset: 512)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1464, file: !1463, line: 132, baseType: !1436, size: 32, offset: 544)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "fpt", scope: !1404, file: !285, line: 446, baseType: !1486, size: 64, offset: 448)
!1486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1487, size: 64)
!1487 = !DIDerivedType(tag: DW_TAG_typedef, name: "FPoint", file: !285, line: 430, baseType: !1488)
!1488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FPoint", file: !285, line: 426, size: 128, elements: !1489)
!1489 = !{!1490, !1494, !1495}
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1488, file: !285, line: 427, baseType: !1491, size: 64)
!1491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1455, size: 64, elements: !1492)
!1492 = !{!1493}
!1493 = !DISubrange(count: 2)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1488, file: !285, line: 428, baseType: !7, size: 32, offset: 64)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1488, file: !285, line: 429, baseType: !7, size: 32, offset: 96)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !1404, file: !285, line: 447, baseType: !13, size: 32, offset: 512)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "curval", scope: !1404, file: !285, line: 450, baseType: !1455, size: 32, offset: 544)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1404, file: !285, line: 451, baseType: !1399, size: 16, offset: 576)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !1404, file: !285, line: 452, baseType: !1399, size: 16, offset: 592)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "array_index", scope: !1404, file: !285, line: 455, baseType: !7, size: 32, offset: 608)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "rna_path", scope: !1404, file: !285, line: 456, baseType: !1400, size: 64, offset: 640)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !1404, file: !285, line: 459, baseType: !7, size: 32, offset: 704)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !1404, file: !285, line: 460, baseType: !1504, size: 96, offset: 736)
!1504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1455, size: 96, elements: !1505)
!1505 = !{!1469}
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "prev_norm_factor", scope: !1404, file: !285, line: 462, baseType: !1455, size: 32, offset: 832)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1404, file: !285, line: 462, baseType: !1455, size: 32, offset: 864)
!1508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1509, size: 64)
!1509 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceAction", file: !298, line: 605, baseType: !1510)
!1510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceAction", file: !298, line: 589, size: 2752, elements: !1511)
!1511 = !{!1512, !1525, !1526, !1527, !1528, !1529, !1530, !3778, !3779, !3791, !3792, !3793, !3794}
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1510, file: !298, line: 590, baseType: !1513, size: 64)
!1513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1514, size: 64)
!1514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !64, line: 85, size: 448, elements: !1515)
!1515 = !{!1516, !1517, !1518, !1519, !1520, !1521}
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1514, file: !64, line: 86, baseType: !1513, size: 64)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1514, file: !64, line: 86, baseType: !1513, size: 64, offset: 64)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !1514, file: !64, line: 87, baseType: !1418, size: 128, offset: 128)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !1514, file: !64, line: 88, baseType: !7, size: 32, offset: 256)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !1514, file: !64, line: 89, baseType: !1455, size: 32, offset: 288)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !1514, file: !64, line: 90, baseType: !1522, size: 128, offset: 320)
!1522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1399, size: 128, elements: !1523)
!1523 = !{!1524}
!1524 = !DISubrange(count: 8)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1510, file: !298, line: 590, baseType: !1513, size: 64, offset: 64)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !1510, file: !298, line: 591, baseType: !1418, size: 128, offset: 128)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !1510, file: !298, line: 592, baseType: !7, size: 32, offset: 256)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !1510, file: !298, line: 593, baseType: !1455, size: 32, offset: 288)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !1510, file: !298, line: 595, baseType: !1522, size: 128, offset: 320)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !1510, file: !298, line: 597, baseType: !1531, size: 1280, offset: 448)
!1531 = !DIDerivedType(tag: DW_TAG_typedef, name: "View2D", file: !1532, line: 71, baseType: !1533)
!1532 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view2d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View2D", file: !1532, line: 40, size: 1280, elements: !1534)
!1534 = !{!1535, !1544, !1545, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1573, !1574, !1575, !1578}
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !1533, file: !1532, line: 41, baseType: !1536, size: 128)
!1536 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !1537, line: 95, baseType: !1538)
!1537 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !1537, line: 92, size: 128, elements: !1539)
!1539 = !{!1540, !1541, !1542, !1543}
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1538, file: !1537, line: 93, baseType: !1455, size: 32)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1538, file: !1537, line: 93, baseType: !1455, size: 32, offset: 32)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1538, file: !1537, line: 94, baseType: !1455, size: 32, offset: 64)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1538, file: !1537, line: 94, baseType: !1455, size: 32, offset: 96)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !1533, file: !1532, line: 41, baseType: !1536, size: 128, offset: 128)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "vert", scope: !1533, file: !1532, line: 42, baseType: !1546, size: 128, offset: 256)
!1546 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !1537, line: 89, baseType: !1547)
!1547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !1537, line: 86, size: 128, elements: !1548)
!1548 = !{!1549, !1550, !1551, !1552}
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1547, file: !1537, line: 87, baseType: !7, size: 32)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1547, file: !1537, line: 87, baseType: !7, size: 32, offset: 32)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1547, file: !1537, line: 88, baseType: !7, size: 32, offset: 64)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1547, file: !1537, line: 88, baseType: !7, size: 32, offset: 96)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "hor", scope: !1533, file: !1532, line: 42, baseType: !1546, size: 128, offset: 384)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !1533, file: !1532, line: 43, baseType: !1546, size: 128, offset: 512)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1533, file: !1532, line: 45, baseType: !1491, size: 64, offset: 640)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1533, file: !1532, line: 45, baseType: !1491, size: 64, offset: 704)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "minzoom", scope: !1533, file: !1532, line: 46, baseType: !1455, size: 32, offset: 768)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "maxzoom", scope: !1533, file: !1532, line: 46, baseType: !1455, size: 32, offset: 800)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !1533, file: !1532, line: 48, baseType: !1399, size: 16, offset: 832)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_ui", scope: !1533, file: !1532, line: 49, baseType: !1399, size: 16, offset: 848)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "keeptot", scope: !1533, file: !1532, line: 51, baseType: !1399, size: 16, offset: 864)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "keepzoom", scope: !1533, file: !1532, line: 52, baseType: !1399, size: 16, offset: 880)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "keepofs", scope: !1533, file: !1532, line: 53, baseType: !1399, size: 16, offset: 896)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1533, file: !1532, line: 55, baseType: !1399, size: 16, offset: 912)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1533, file: !1532, line: 56, baseType: !1399, size: 16, offset: 928)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !1533, file: !1532, line: 58, baseType: !1399, size: 16, offset: 944)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !1533, file: !1532, line: 58, baseType: !1399, size: 16, offset: 960)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "oldwinx", scope: !1533, file: !1532, line: 59, baseType: !1399, size: 16, offset: 976)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "oldwiny", scope: !1533, file: !1532, line: 59, baseType: !1399, size: 16, offset: 992)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !1533, file: !1532, line: 61, baseType: !1399, size: 16, offset: 1008)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "tab_offset", scope: !1533, file: !1532, line: 63, baseType: !1572, size: 64, offset: 1024)
!1572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1455, size: 64)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "tab_num", scope: !1533, file: !1532, line: 64, baseType: !7, size: 32, offset: 1088)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "tab_cur", scope: !1533, file: !1532, line: 65, baseType: !7, size: 32, offset: 1120)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "sms", scope: !1533, file: !1532, line: 68, baseType: !1576, size: 64, offset: 1152)
!1576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1577, size: 64)
!1577 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmoothView2DStore", file: !1532, line: 68, flags: DIFlagFwdDecl)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_timer", scope: !1533, file: !1532, line: 69, baseType: !1579, size: 64, offset: 1216)
!1579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1580, size: 64)
!1580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !387, line: 490, size: 768, elements: !1581)
!1581 = !{!1582, !1583, !1584, !3769, !3770, !3771, !3772, !3773, !3774, !3775, !3776, !3777}
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1580, file: !387, line: 491, baseType: !1579, size: 64)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1580, file: !387, line: 491, baseType: !1579, size: 64, offset: 64)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !1580, file: !387, line: 493, baseType: !1585, size: 64, offset: 128)
!1585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1586, size: 64)
!1586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !1587, line: 169, size: 2048, elements: !1588)
!1587 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1588 = !{!1589, !1590, !1591, !1592, !3684, !3685, !3686, !3687, !3688, !3689, !3690, !3691, !3692, !3693, !3694, !3695, !3696, !3697, !3698, !3699, !3700, !3701, !3744, !3747, !3761, !3762, !3763, !3764, !3765, !3766, !3767, !3768}
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1586, file: !1587, line: 170, baseType: !1585, size: 64)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1586, file: !1587, line: 170, baseType: !1585, size: 64, offset: 64)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !1586, file: !1587, line: 172, baseType: !1396, size: 64, offset: 128)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !1586, file: !1587, line: 174, baseType: !1593, size: 64, offset: 192)
!1593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1594, size: 64)
!1594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !1595, line: 49, size: 1984, elements: !1596)
!1595 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1596 = !{!1597, !1656, !1657, !1658, !1659, !1660, !3667, !3668, !3669, !3670, !3671, !3672, !3673, !3674, !3675, !3676, !3677, !3678, !3679, !3680, !3681, !3682, !3683}
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1594, file: !1595, line: 50, baseType: !1598, size: 960)
!1598 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !1599, line: 130, baseType: !1600)
!1599 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !1599, line: 117, size: 960, elements: !1601)
!1601 = !{!1602, !1603, !1604, !1606, !1625, !1629, !1630, !1631, !1632, !1633}
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1600, file: !1599, line: 118, baseType: !1396, size: 64)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1600, file: !1599, line: 118, baseType: !1396, size: 64, offset: 64)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !1600, file: !1599, line: 119, baseType: !1605, size: 64, offset: 128)
!1605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1600, size: 64)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1600, file: !1599, line: 120, baseType: !1607, size: 64, offset: 192)
!1607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1608, size: 64)
!1608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !1599, line: 136, size: 17600, elements: !1609)
!1609 = !{!1610, !1611, !1613, !1616, !1620, !1621, !1622}
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1608, file: !1599, line: 137, baseType: !1598, size: 960)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !1608, file: !1599, line: 138, baseType: !1612, size: 64, offset: 960)
!1612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1598, size: 64)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !1608, file: !1599, line: 139, baseType: !1614, size: 64, offset: 1024)
!1614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1615, size: 64)
!1615 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !1599, line: 43, flags: DIFlagFwdDecl)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1608, file: !1599, line: 140, baseType: !1617, size: 8192, offset: 1088)
!1617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1401, size: 8192, elements: !1618)
!1618 = !{!1619}
!1619 = !DISubrange(count: 1024)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !1608, file: !1599, line: 141, baseType: !1617, size: 8192, offset: 9280)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1608, file: !1599, line: 148, baseType: !1607, size: 64, offset: 17472)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1608, file: !1599, line: 150, baseType: !1623, size: 64, offset: 17536)
!1623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1624, size: 64)
!1624 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !1599, line: 45, flags: DIFlagFwdDecl)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1600, file: !1599, line: 121, baseType: !1626, size: 528, offset: 256)
!1626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1401, size: 528, elements: !1627)
!1627 = !{!1628}
!1628 = !DISubrange(count: 66)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1600, file: !1599, line: 126, baseType: !1399, size: 16, offset: 784)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1600, file: !1599, line: 127, baseType: !7, size: 32, offset: 800)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !1600, file: !1599, line: 128, baseType: !7, size: 32, offset: 832)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1600, file: !1599, line: 128, baseType: !7, size: 32, offset: 864)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1600, file: !1599, line: 129, baseType: !1634, size: 64, offset: 896)
!1634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1635, size: 64)
!1635 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !1599, line: 75, baseType: !1636)
!1636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !1599, line: 62, size: 1024, elements: !1637)
!1637 = !{!1638, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1654, !1655}
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1636, file: !1599, line: 63, baseType: !1639, size: 64)
!1639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1636, size: 64)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1636, file: !1599, line: 63, baseType: !1639, size: 64, offset: 64)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1636, file: !1599, line: 64, baseType: !1401, size: 8, offset: 128)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1636, file: !1599, line: 64, baseType: !1401, size: 8, offset: 136)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1636, file: !1599, line: 65, baseType: !1399, size: 16, offset: 144)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1636, file: !1599, line: 66, baseType: !1427, size: 512, offset: 160)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !1636, file: !1599, line: 67, baseType: !7, size: 32, offset: 672)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1636, file: !1599, line: 69, baseType: !1647, size: 256, offset: 704)
!1647 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !1599, line: 60, baseType: !1648)
!1648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !1599, line: 48, size: 256, elements: !1649)
!1649 = !{!1650, !1651, !1652, !1653}
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1648, file: !1599, line: 49, baseType: !1396, size: 64)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !1648, file: !1599, line: 58, baseType: !1418, size: 128, offset: 64)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1648, file: !1599, line: 59, baseType: !7, size: 32, offset: 192)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !1648, file: !1599, line: 59, baseType: !7, size: 32, offset: 224)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1636, file: !1599, line: 70, baseType: !7, size: 32, offset: 960)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !1636, file: !1599, line: 74, baseType: !7, size: 32, offset: 992)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !1594, file: !1595, line: 52, baseType: !1418, size: 128, offset: 960)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !1594, file: !1595, line: 53, baseType: !1418, size: 128, offset: 1088)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !1594, file: !1595, line: 54, baseType: !1418, size: 128, offset: 1216)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !1594, file: !1595, line: 55, baseType: !1418, size: 128, offset: 1344)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1594, file: !1595, line: 57, baseType: !1661, size: 64, offset: 1472)
!1661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1662, size: 64)
!1662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !1663, line: 1216, size: 39680, elements: !1664)
!1663 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1664 = !{!1665, !1666, !1734, !2626, !2707, !2708, !2709, !2721, !2722, !2723, !2724, !2725, !2726, !2727, !2728, !2729, !2730, !2731, !2732, !2733, !3087, !3301, !3304, !3543, !3555, !3556, !3557, !3558, !3559, !3560, !3561, !3562, !3565, !3566, !3567, !3568, !3569, !3577, !3643, !3650, !3651, !3658, !3659, !3660, !3661, !3662, !3663, !3664}
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1662, file: !1663, line: 1217, baseType: !1598, size: 960)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1662, file: !1663, line: 1218, baseType: !1667, size: 64, offset: 960)
!1667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1668, size: 64)
!1668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !285, line: 838, size: 768, elements: !1669)
!1669 = !{!1670, !1684, !1685, !1695, !1696, !1727, !1728, !1729, !1730, !1731, !1732, !1733}
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !1668, file: !285, line: 840, baseType: !1671, size: 64)
!1671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1672, size: 64)
!1672 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !298, line: 499, baseType: !1673)
!1673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !298, line: 486, size: 1600, elements: !1674)
!1674 = !{!1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683}
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1673, file: !298, line: 487, baseType: !1598, size: 960)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !1673, file: !298, line: 489, baseType: !1418, size: 128, offset: 960)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !1673, file: !298, line: 490, baseType: !1418, size: 128, offset: 1088)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !1673, file: !298, line: 491, baseType: !1418, size: 128, offset: 1216)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1673, file: !298, line: 492, baseType: !1418, size: 128, offset: 1344)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1673, file: !298, line: 494, baseType: !7, size: 32, offset: 1472)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !1673, file: !298, line: 495, baseType: !7, size: 32, offset: 1504)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !1673, file: !298, line: 497, baseType: !7, size: 32, offset: 1536)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1673, file: !298, line: 498, baseType: !7, size: 32, offset: 1568)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !1668, file: !285, line: 844, baseType: !1671, size: 64, offset: 64)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !1668, file: !285, line: 848, baseType: !1686, size: 64, offset: 128)
!1686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1687, size: 64)
!1687 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !285, line: 549, baseType: !1688)
!1688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !285, line: 544, size: 320, elements: !1689)
!1689 = !{!1690, !1692, !1693, !1694}
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1688, file: !285, line: 545, baseType: !1691, size: 64)
!1691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1688, size: 64)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1688, file: !285, line: 545, baseType: !1691, size: 64, offset: 64)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !1688, file: !285, line: 547, baseType: !1671, size: 64, offset: 128)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !1688, file: !285, line: 548, baseType: !1418, size: 128, offset: 192)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !1668, file: !285, line: 851, baseType: !1418, size: 128, offset: 192)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !1668, file: !285, line: 853, baseType: !1697, size: 64, offset: 320)
!1697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1698, size: 64)
!1698 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !285, line: 594, baseType: !1699)
!1699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !285, line: 561, size: 1664, elements: !1700)
!1700 = !{!1701, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726}
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1699, file: !285, line: 562, baseType: !1702, size: 64)
!1702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1699, size: 64)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1699, file: !285, line: 562, baseType: !1702, size: 64, offset: 64)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !1699, file: !285, line: 564, baseType: !1418, size: 128, offset: 128)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !1699, file: !285, line: 565, baseType: !1671, size: 64, offset: 256)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !1699, file: !285, line: 566, baseType: !1686, size: 64, offset: 320)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !1699, file: !285, line: 568, baseType: !1418, size: 128, offset: 384)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !1699, file: !285, line: 569, baseType: !1418, size: 128, offset: 512)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1699, file: !285, line: 571, baseType: !1427, size: 512, offset: 640)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !1699, file: !285, line: 573, baseType: !1455, size: 32, offset: 1152)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "strip_time", scope: !1699, file: !285, line: 574, baseType: !1455, size: 32, offset: 1184)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1699, file: !285, line: 576, baseType: !1455, size: 32, offset: 1216)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !1699, file: !285, line: 576, baseType: !1455, size: 32, offset: 1248)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "actstart", scope: !1699, file: !285, line: 577, baseType: !1455, size: 32, offset: 1280)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "actend", scope: !1699, file: !285, line: 577, baseType: !1455, size: 32, offset: 1312)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !1699, file: !285, line: 579, baseType: !1455, size: 32, offset: 1344)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1699, file: !285, line: 580, baseType: !1455, size: 32, offset: 1376)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !1699, file: !285, line: 582, baseType: !1455, size: 32, offset: 1408)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !1699, file: !285, line: 582, baseType: !1455, size: 32, offset: 1440)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "blendmode", scope: !1699, file: !285, line: 583, baseType: !1399, size: 16, offset: 1472)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "extendmode", scope: !1699, file: !285, line: 585, baseType: !1399, size: 16, offset: 1488)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1699, file: !285, line: 586, baseType: !1399, size: 16, offset: 1504)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1699, file: !285, line: 588, baseType: !1399, size: 16, offset: 1520)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handle", scope: !1699, file: !285, line: 590, baseType: !1396, size: 64, offset: 1536)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1699, file: !285, line: 592, baseType: !7, size: 32, offset: 1600)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1699, file: !285, line: 593, baseType: !7, size: 32, offset: 1632)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "drivers", scope: !1668, file: !285, line: 858, baseType: !1418, size: 128, offset: 384)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "overrides", scope: !1668, file: !285, line: 859, baseType: !1418, size: 128, offset: 512)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1668, file: !285, line: 862, baseType: !7, size: 32, offset: 640)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !1668, file: !285, line: 863, baseType: !7, size: 32, offset: 672)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "act_blendmode", scope: !1668, file: !285, line: 866, baseType: !1399, size: 16, offset: 704)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "act_extendmode", scope: !1668, file: !285, line: 867, baseType: !1399, size: 16, offset: 720)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "act_influence", scope: !1668, file: !285, line: 868, baseType: !1455, size: 32, offset: 736)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1662, file: !1663, line: 1220, baseType: !1735, size: 64, offset: 1024)
!1735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1736, size: 64)
!1736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !1263, line: 115, size: 11392, elements: !1737)
!1737 = !{!1738, !1739, !1740, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1758, !1767, !1769, !1770, !1811, !1812, !1823, !1824, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !2468, !2469, !2470, !2471, !2472, !2473, !2474, !2475, !2476, !2477, !2478, !2479, !2480, !2481, !2482, !2483, !2484, !2485, !2486, !2487, !2488, !2489, !2490, !2491, !2492, !2493, !2494, !2495, !2496, !2497, !2498, !2499, !2500, !2501, !2502, !2503, !2504, !2505, !2506, !2507, !2508, !2509, !2510, !2511, !2512, !2513, !2514, !2515, !2516, !2517, !2518, !2519, !2521, !2522, !2523, !2524, !2525, !2526, !2527, !2528, !2529, !2530, !2531, !2532, !2533, !2534, !2535, !2536, !2537, !2538, !2539, !2540, !2543, !2544, !2545, !2546, !2547, !2548, !2549, !2550, !2551, !2554, !2557, !2558, !2559, !2560, !2561, !2562, !2565, !2587, !2590, !2591, !2597, !2598, !2599, !2600, !2601, !2602, !2604, !2607, !2610, !2611, !2614, !2615}
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1736, file: !1263, line: 116, baseType: !1598, size: 960)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1736, file: !1263, line: 117, baseType: !1667, size: 64, offset: 960)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !1736, file: !1263, line: 119, baseType: !1741, size: 64, offset: 1024)
!1741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1742, size: 64)
!1742 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !1263, line: 57, flags: DIFlagFwdDecl)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1736, file: !1263, line: 121, baseType: !1399, size: 16, offset: 1088)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !1736, file: !1263, line: 121, baseType: !1399, size: 16, offset: 1104)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !1736, file: !1263, line: 122, baseType: !7, size: 32, offset: 1120)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !1736, file: !1263, line: 122, baseType: !7, size: 32, offset: 1152)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !1736, file: !1263, line: 122, baseType: !7, size: 32, offset: 1184)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !1736, file: !1263, line: 123, baseType: !1427, size: 512, offset: 1216)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1736, file: !1263, line: 124, baseType: !1735, size: 64, offset: 1728)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !1736, file: !1263, line: 124, baseType: !1735, size: 64, offset: 1792)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1736, file: !1263, line: 127, baseType: !1735, size: 64, offset: 1856)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !1736, file: !1263, line: 127, baseType: !1735, size: 64, offset: 1920)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !1736, file: !1263, line: 127, baseType: !1735, size: 64, offset: 1984)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1736, file: !1263, line: 128, baseType: !1755, size: 64, offset: 2048)
!1755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1756, size: 64)
!1756 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !1757, line: 46, flags: DIFlagFwdDecl)
!1757 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1736, file: !1263, line: 130, baseType: !1759, size: 64, offset: 2112)
!1759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1760, size: 64)
!1760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !1263, line: 97, size: 832, elements: !1761)
!1761 = !{!1762, !1765, !1766}
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1760, file: !1263, line: 98, baseType: !1763, size: 768)
!1763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1455, size: 768, elements: !1764)
!1764 = !{!1524, !1469}
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1760, file: !1263, line: 99, baseType: !7, size: 32, offset: 768)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1760, file: !1263, line: 99, baseType: !7, size: 32, offset: 800)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !1736, file: !1263, line: 131, baseType: !1768, size: 64, offset: 2176)
!1768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1673, size: 64)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !1736, file: !1263, line: 132, baseType: !1768, size: 64, offset: 2240)
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !1736, file: !1263, line: 133, baseType: !1771, size: 64, offset: 2304)
!1771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1772, size: 64)
!1772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !298, line: 334, size: 1728, elements: !1773)
!1773 = !{!1774, !1775, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1810}
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !1772, file: !298, line: 335, baseType: !1418, size: 128)
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !1772, file: !298, line: 336, baseType: !1776, size: 64, offset: 128)
!1776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1777, size: 64)
!1777 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !298, line: 47, flags: DIFlagFwdDecl)
!1778 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1772, file: !298, line: 338, baseType: !1399, size: 16, offset: 192)
!1779 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1772, file: !298, line: 338, baseType: !1399, size: 16, offset: 208)
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !1772, file: !298, line: 339, baseType: !13, size: 32, offset: 224)
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1772, file: !298, line: 340, baseType: !7, size: 32, offset: 256)
!1782 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !1772, file: !298, line: 342, baseType: !1455, size: 32, offset: 288)
!1783 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !1772, file: !298, line: 343, baseType: !1504, size: 96, offset: 320)
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !1772, file: !298, line: 344, baseType: !1504, size: 96, offset: 416)
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !1772, file: !298, line: 347, baseType: !1418, size: 128, offset: 512)
!1786 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !1772, file: !298, line: 349, baseType: !7, size: 32, offset: 640)
!1787 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !1772, file: !298, line: 350, baseType: !7, size: 32, offset: 672)
!1788 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !1772, file: !298, line: 351, baseType: !1396, size: 64, offset: 704)
!1789 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !1772, file: !298, line: 352, baseType: !1396, size: 64, offset: 768)
!1790 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !1772, file: !298, line: 354, baseType: !1791, size: 384, offset: 832)
!1791 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !298, line: 116, baseType: !1792)
!1792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !298, line: 94, size: 384, elements: !1793)
!1793 = !{!1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809}
!1794 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !1792, file: !298, line: 96, baseType: !7, size: 32)
!1795 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !1792, file: !298, line: 96, baseType: !7, size: 32, offset: 32)
!1796 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !1792, file: !298, line: 97, baseType: !7, size: 32, offset: 64)
!1797 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !1792, file: !298, line: 97, baseType: !7, size: 32, offset: 96)
!1798 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !1792, file: !298, line: 99, baseType: !1399, size: 16, offset: 128)
!1799 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !1792, file: !298, line: 100, baseType: !1399, size: 16, offset: 144)
!1800 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !1792, file: !298, line: 102, baseType: !1399, size: 16, offset: 160)
!1801 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !1792, file: !298, line: 105, baseType: !1399, size: 16, offset: 176)
!1802 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !1792, file: !298, line: 108, baseType: !1399, size: 16, offset: 192)
!1803 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !1792, file: !298, line: 109, baseType: !1399, size: 16, offset: 208)
!1804 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !1792, file: !298, line: 111, baseType: !1399, size: 16, offset: 224)
!1805 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !1792, file: !298, line: 112, baseType: !1399, size: 16, offset: 240)
!1806 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !1792, file: !298, line: 114, baseType: !7, size: 32, offset: 256)
!1807 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !1792, file: !298, line: 114, baseType: !7, size: 32, offset: 288)
!1808 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !1792, file: !298, line: 115, baseType: !7, size: 32, offset: 320)
!1809 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !1792, file: !298, line: 115, baseType: !7, size: 32, offset: 352)
!1810 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !1772, file: !298, line: 355, baseType: !1427, size: 512, offset: 1216)
!1811 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1736, file: !1263, line: 134, baseType: !1396, size: 64, offset: 2368)
!1812 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1736, file: !1263, line: 136, baseType: !1813, size: 64, offset: 2432)
!1813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1814, size: 64)
!1814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !1815, line: 130, size: 1216, elements: !1816)
!1815 = !DIFile(filename: "blender/source/blender/makesdna/DNA_gpencil_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1816 = !{!1817, !1818, !1819, !1820, !1821, !1822}
!1817 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1814, file: !1815, line: 131, baseType: !1598, size: 960)
!1818 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !1814, file: !1815, line: 134, baseType: !1418, size: 128, offset: 960)
!1819 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1814, file: !1815, line: 135, baseType: !7, size: 32, offset: 1088)
!1820 = !DIDerivedType(tag: DW_TAG_member, name: "sbuffer_size", scope: !1814, file: !1815, line: 141, baseType: !1399, size: 16, offset: 1120)
!1821 = !DIDerivedType(tag: DW_TAG_member, name: "sbuffer_sflag", scope: !1814, file: !1815, line: 142, baseType: !1399, size: 16, offset: 1136)
!1822 = !DIDerivedType(tag: DW_TAG_member, name: "sbuffer", scope: !1814, file: !1815, line: 143, baseType: !1396, size: 64, offset: 1152)
!1823 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !1736, file: !1263, line: 138, baseType: !1791, size: 384, offset: 2496)
!1824 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !1736, file: !1263, line: 139, baseType: !1825, size: 64, offset: 2880)
!1825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1826, size: 64)
!1826 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !298, line: 80, baseType: !1827)
!1827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !298, line: 72, size: 192, elements: !1828)
!1828 = !{!1829, !1836, !1837, !1838, !1839}
!1829 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !1827, file: !298, line: 73, baseType: !1830, size: 64)
!1830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1831, size: 64)
!1831 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !298, line: 59, baseType: !1832)
!1832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !298, line: 56, size: 128, elements: !1833)
!1833 = !{!1834, !1835}
!1834 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !1832, file: !298, line: 57, baseType: !1504, size: 96)
!1835 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1832, file: !298, line: 58, baseType: !7, size: 32, offset: 96)
!1836 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1827, file: !298, line: 74, baseType: !7, size: 32, offset: 64)
!1837 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1827, file: !298, line: 76, baseType: !7, size: 32, offset: 96)
!1838 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1827, file: !298, line: 77, baseType: !7, size: 32, offset: 128)
!1839 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1827, file: !298, line: 79, baseType: !7, size: 32, offset: 160)
!1840 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !1736, file: !1263, line: 141, baseType: !1418, size: 128, offset: 2944)
!1841 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !1736, file: !1263, line: 142, baseType: !1418, size: 128, offset: 3072)
!1842 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !1736, file: !1263, line: 143, baseType: !1418, size: 128, offset: 3200)
!1843 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !1736, file: !1263, line: 144, baseType: !1418, size: 128, offset: 3328)
!1844 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1736, file: !1263, line: 146, baseType: !7, size: 32, offset: 3456)
!1845 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !1736, file: !1263, line: 147, baseType: !7, size: 32, offset: 3488)
!1846 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1736, file: !1263, line: 150, baseType: !1847, size: 64, offset: 3520)
!1847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1848, size: 64)
!1848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1849, size: 64)
!1849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !1850, line: 93, size: 7552, elements: !1851)
!1850 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1851 = !{!1852, !1853, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1878, !1879, !1900, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1918, !1919, !1920, !1921, !1922, !1923, !1924, !1925, !1926, !1927, !1928, !1929, !1930, !1931, !1932, !1933, !1934, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1951, !1952, !1953, !1954, !1955, !1956, !1957, !1958, !1959, !1960, !1961, !1962, !1963, !1964, !1965, !1967, !1968, !1969, !1970, !1971, !1997, !1998, !1999, !2000, !2001, !2002, !2003, !2004, !2005, !2006, !2425, !2426, !2427, !2430, !2431, !2432, !2433, !2434, !2435, !2436, !2437, !2438, !2439, !2440, !2441, !2442, !2443, !2444, !2445, !2446, !2447, !2448, !2449, !2450, !2451, !2452, !2453, !2454, !2455, !2456, !2457, !2458, !2459, !2467}
!1852 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1849, file: !1850, line: 94, baseType: !1598, size: 960)
!1853 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1849, file: !1850, line: 95, baseType: !1667, size: 64, offset: 960)
!1854 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !1849, file: !1850, line: 97, baseType: !1399, size: 16, offset: 1024)
!1855 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1849, file: !1850, line: 97, baseType: !1399, size: 16, offset: 1040)
!1856 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1849, file: !1850, line: 99, baseType: !1455, size: 32, offset: 1056)
!1857 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1849, file: !1850, line: 99, baseType: !1455, size: 32, offset: 1088)
!1858 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !1849, file: !1850, line: 99, baseType: !1455, size: 32, offset: 1120)
!1859 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !1849, file: !1850, line: 100, baseType: !1455, size: 32, offset: 1152)
!1860 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !1849, file: !1850, line: 100, baseType: !1455, size: 32, offset: 1184)
!1861 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !1849, file: !1850, line: 100, baseType: !1455, size: 32, offset: 1216)
!1862 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !1849, file: !1850, line: 101, baseType: !1455, size: 32, offset: 1248)
!1863 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !1849, file: !1850, line: 101, baseType: !1455, size: 32, offset: 1280)
!1864 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !1849, file: !1850, line: 101, baseType: !1455, size: 32, offset: 1312)
!1865 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !1849, file: !1850, line: 102, baseType: !1455, size: 32, offset: 1344)
!1866 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !1849, file: !1850, line: 102, baseType: !1455, size: 32, offset: 1376)
!1867 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !1849, file: !1850, line: 102, baseType: !1455, size: 32, offset: 1408)
!1868 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !1849, file: !1850, line: 103, baseType: !1455, size: 32, offset: 1440)
!1869 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !1849, file: !1850, line: 103, baseType: !1455, size: 32, offset: 1472)
!1870 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !1849, file: !1850, line: 103, baseType: !1455, size: 32, offset: 1504)
!1871 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !1849, file: !1850, line: 103, baseType: !1455, size: 32, offset: 1536)
!1872 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !1849, file: !1850, line: 103, baseType: !1455, size: 32, offset: 1568)
!1873 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !1849, file: !1850, line: 104, baseType: !1455, size: 32, offset: 1600)
!1874 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !1849, file: !1850, line: 104, baseType: !1455, size: 32, offset: 1632)
!1875 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !1849, file: !1850, line: 104, baseType: !1455, size: 32, offset: 1664)
!1876 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !1849, file: !1850, line: 104, baseType: !1455, size: 32, offset: 1696)
!1877 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !1849, file: !1850, line: 104, baseType: !1455, size: 32, offset: 1728)
!1878 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !1849, file: !1850, line: 105, baseType: !1455, size: 32, offset: 1760)
!1879 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !1849, file: !1850, line: 108, baseType: !1880, size: 704, offset: 1792)
!1880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !1850, line: 53, size: 704, elements: !1881)
!1881 = !{!1882, !1883, !1884, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1892, !1893, !1894, !1895, !1896, !1897, !1898, !1899}
!1882 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !1880, file: !1850, line: 54, baseType: !1455, size: 32)
!1883 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !1880, file: !1850, line: 55, baseType: !1455, size: 32, offset: 32)
!1884 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !1880, file: !1850, line: 56, baseType: !1455, size: 32, offset: 64)
!1885 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !1880, file: !1850, line: 57, baseType: !1455, size: 32, offset: 96)
!1886 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !1880, file: !1850, line: 59, baseType: !1504, size: 96, offset: 128)
!1887 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !1880, file: !1850, line: 60, baseType: !1504, size: 96, offset: 224)
!1888 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !1880, file: !1850, line: 61, baseType: !1504, size: 96, offset: 320)
!1889 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !1880, file: !1850, line: 63, baseType: !1455, size: 32, offset: 416)
!1890 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !1880, file: !1850, line: 64, baseType: !1455, size: 32, offset: 448)
!1891 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !1880, file: !1850, line: 65, baseType: !1455, size: 32, offset: 480)
!1892 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !1880, file: !1850, line: 67, baseType: !1399, size: 16, offset: 512)
!1893 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !1880, file: !1850, line: 68, baseType: !1399, size: 16, offset: 528)
!1894 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !1880, file: !1850, line: 69, baseType: !1399, size: 16, offset: 544)
!1895 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !1880, file: !1850, line: 70, baseType: !1399, size: 16, offset: 560)
!1896 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !1880, file: !1850, line: 72, baseType: !1455, size: 32, offset: 576)
!1897 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !1880, file: !1850, line: 73, baseType: !1455, size: 32, offset: 608)
!1898 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !1880, file: !1850, line: 74, baseType: !1455, size: 32, offset: 640)
!1899 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !1880, file: !1850, line: 75, baseType: !1455, size: 32, offset: 672)
!1900 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !1849, file: !1850, line: 109, baseType: !1901, size: 128, offset: 2496)
!1901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !1850, line: 79, size: 128, elements: !1902)
!1902 = !{!1903, !1904, !1905, !1906}
!1903 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1901, file: !1850, line: 80, baseType: !7, size: 32)
!1904 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !1901, file: !1850, line: 81, baseType: !7, size: 32, offset: 32)
!1905 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !1901, file: !1850, line: 82, baseType: !7, size: 32, offset: 64)
!1906 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1901, file: !1850, line: 83, baseType: !7, size: 32, offset: 96)
!1907 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !1849, file: !1850, line: 111, baseType: !1455, size: 32, offset: 2624)
!1908 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !1849, file: !1850, line: 111, baseType: !1455, size: 32, offset: 2656)
!1909 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !1849, file: !1850, line: 112, baseType: !1455, size: 32, offset: 2688)
!1910 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !1849, file: !1850, line: 112, baseType: !1455, size: 32, offset: 2720)
!1911 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1849, file: !1850, line: 113, baseType: !1455, size: 32, offset: 2752)
!1912 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !1849, file: !1850, line: 114, baseType: !1455, size: 32, offset: 2784)
!1913 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !1849, file: !1850, line: 114, baseType: !1455, size: 32, offset: 2816)
!1914 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !1849, file: !1850, line: 115, baseType: !1399, size: 16, offset: 2848)
!1915 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !1849, file: !1850, line: 115, baseType: !1399, size: 16, offset: 2864)
!1916 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !1849, file: !1850, line: 116, baseType: !1399, size: 16, offset: 2880)
!1917 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !1849, file: !1850, line: 117, baseType: !1401, size: 8, offset: 2896)
!1918 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !1849, file: !1850, line: 117, baseType: !1401, size: 8, offset: 2904)
!1919 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !1849, file: !1850, line: 119, baseType: !1455, size: 32, offset: 2912)
!1920 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !1849, file: !1850, line: 119, baseType: !1455, size: 32, offset: 2944)
!1921 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !1849, file: !1850, line: 120, baseType: !1399, size: 16, offset: 2976)
!1922 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !1849, file: !1850, line: 120, baseType: !1399, size: 16, offset: 2992)
!1923 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !1849, file: !1850, line: 121, baseType: !1455, size: 32, offset: 3008)
!1924 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !1849, file: !1850, line: 121, baseType: !1455, size: 32, offset: 3040)
!1925 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !1849, file: !1850, line: 122, baseType: !1455, size: 32, offset: 3072)
!1926 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !1849, file: !1850, line: 123, baseType: !1455, size: 32, offset: 3104)
!1927 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !1849, file: !1850, line: 124, baseType: !1399, size: 16, offset: 3136)
!1928 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !1849, file: !1850, line: 125, baseType: !1399, size: 16, offset: 3152)
!1929 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1849, file: !1850, line: 127, baseType: !7, size: 32, offset: 3168)
!1930 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !1849, file: !1850, line: 127, baseType: !7, size: 32, offset: 3200)
!1931 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !1849, file: !1850, line: 128, baseType: !7, size: 32, offset: 3232)
!1932 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !1849, file: !1850, line: 128, baseType: !7, size: 32, offset: 3264)
!1933 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !1849, file: !1850, line: 129, baseType: !1399, size: 16, offset: 3296)
!1934 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !1849, file: !1850, line: 129, baseType: !1399, size: 16, offset: 3312)
!1935 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !1849, file: !1850, line: 129, baseType: !1399, size: 16, offset: 3328)
!1936 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !1849, file: !1850, line: 129, baseType: !1399, size: 16, offset: 3344)
!1937 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !1849, file: !1850, line: 130, baseType: !1455, size: 32, offset: 3360)
!1938 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !1849, file: !1850, line: 130, baseType: !1455, size: 32, offset: 3392)
!1939 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !1849, file: !1850, line: 130, baseType: !1455, size: 32, offset: 3424)
!1940 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !1849, file: !1850, line: 130, baseType: !1455, size: 32, offset: 3456)
!1941 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !1849, file: !1850, line: 131, baseType: !1455, size: 32, offset: 3488)
!1942 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !1849, file: !1850, line: 131, baseType: !1455, size: 32, offset: 3520)
!1943 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !1849, file: !1850, line: 131, baseType: !1455, size: 32, offset: 3552)
!1944 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !1849, file: !1850, line: 131, baseType: !1455, size: 32, offset: 3584)
!1945 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !1849, file: !1850, line: 132, baseType: !1455, size: 32, offset: 3616)
!1946 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !1849, file: !1850, line: 132, baseType: !1455, size: 32, offset: 3648)
!1947 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !1849, file: !1850, line: 133, baseType: !1427, size: 512, offset: 3680)
!1948 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !1849, file: !1850, line: 135, baseType: !1455, size: 32, offset: 4192)
!1949 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !1849, file: !1850, line: 136, baseType: !1455, size: 32, offset: 4224)
!1950 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !1849, file: !1850, line: 137, baseType: !1455, size: 32, offset: 4256)
!1951 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !1849, file: !1850, line: 138, baseType: !7, size: 32, offset: 4288)
!1952 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !1849, file: !1850, line: 141, baseType: !1401, size: 8, offset: 4320)
!1953 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !1849, file: !1850, line: 141, baseType: !1401, size: 8, offset: 4328)
!1954 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !1849, file: !1850, line: 141, baseType: !1401, size: 8, offset: 4336)
!1955 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !1849, file: !1850, line: 141, baseType: !1401, size: 8, offset: 4344)
!1956 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !1849, file: !1850, line: 142, baseType: !1399, size: 16, offset: 4352)
!1957 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !1849, file: !1850, line: 142, baseType: !1399, size: 16, offset: 4368)
!1958 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !1849, file: !1850, line: 142, baseType: !1399, size: 16, offset: 4384)
!1959 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !1849, file: !1850, line: 145, baseType: !1401, size: 8, offset: 4400)
!1960 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1849, file: !1850, line: 145, baseType: !1401, size: 8, offset: 4408)
!1961 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !1849, file: !1850, line: 148, baseType: !1399, size: 16, offset: 4416)
!1962 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !1849, file: !1850, line: 148, baseType: !1399, size: 16, offset: 4432)
!1963 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !1849, file: !1850, line: 149, baseType: !1455, size: 32, offset: 4448)
!1964 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !1849, file: !1850, line: 149, baseType: !1455, size: 32, offset: 4480)
!1965 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !1849, file: !1850, line: 152, baseType: !1966, size: 128, offset: 4512)
!1966 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1455, size: 128, elements: !1437)
!1967 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !1849, file: !1850, line: 153, baseType: !1455, size: 32, offset: 4640)
!1968 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !1849, file: !1850, line: 154, baseType: !1455, size: 32, offset: 4672)
!1969 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !1849, file: !1850, line: 157, baseType: !1399, size: 16, offset: 4704)
!1970 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !1849, file: !1850, line: 157, baseType: !1399, size: 16, offset: 4720)
!1971 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !1849, file: !1850, line: 160, baseType: !1972, size: 64, offset: 4736)
!1972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1973, size: 64)
!1973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !1757, line: 113, size: 6208, elements: !1974)
!1974 = !{!1975, !1976, !1977, !1978, !1979, !1980, !1984}
!1975 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !1973, file: !1757, line: 114, baseType: !1399, size: 16)
!1976 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !1973, file: !1757, line: 114, baseType: !1399, size: 16, offset: 16)
!1977 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !1973, file: !1757, line: 115, baseType: !1401, size: 8, offset: 32)
!1978 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !1973, file: !1757, line: 115, baseType: !1401, size: 8, offset: 40)
!1979 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !1973, file: !1757, line: 116, baseType: !1401, size: 8, offset: 48)
!1980 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1973, file: !1757, line: 117, baseType: !1981, size: 8, offset: 56)
!1981 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1401, size: 8, elements: !1982)
!1982 = !{!1983}
!1983 = !DISubrange(count: 1)
!1984 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1973, file: !1757, line: 119, baseType: !1985, size: 6144, offset: 64)
!1985 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1986, size: 6144, elements: !1995)
!1986 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !1757, line: 109, baseType: !1987)
!1987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !1757, line: 106, size: 192, elements: !1988)
!1988 = !{!1989, !1990, !1991, !1992, !1993, !1994}
!1989 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1987, file: !1757, line: 107, baseType: !1455, size: 32)
!1990 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1987, file: !1757, line: 107, baseType: !1455, size: 32, offset: 32)
!1991 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !1987, file: !1757, line: 107, baseType: !1455, size: 32, offset: 64)
!1992 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1987, file: !1757, line: 107, baseType: !1455, size: 32, offset: 96)
!1993 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1987, file: !1757, line: 107, baseType: !1455, size: 32, offset: 128)
!1994 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !1987, file: !1757, line: 108, baseType: !7, size: 32, offset: 160)
!1995 = !{!1996}
!1996 = !DISubrange(count: 32)
!1997 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !1849, file: !1850, line: 161, baseType: !1972, size: 64, offset: 4800)
!1998 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !1849, file: !1850, line: 162, baseType: !1401, size: 8, offset: 4864)
!1999 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !1849, file: !1850, line: 162, baseType: !1401, size: 8, offset: 4872)
!2000 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !1849, file: !1850, line: 163, baseType: !1401, size: 8, offset: 4880)
!2001 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !1849, file: !1850, line: 163, baseType: !1401, size: 8, offset: 4888)
!2002 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !1849, file: !1850, line: 164, baseType: !1399, size: 16, offset: 4896)
!2003 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !1849, file: !1850, line: 164, baseType: !1399, size: 16, offset: 4912)
!2004 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !1849, file: !1850, line: 165, baseType: !1455, size: 32, offset: 4928)
!2005 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !1849, file: !1850, line: 165, baseType: !1455, size: 32, offset: 4960)
!2006 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !1849, file: !1850, line: 167, baseType: !2007, size: 1152, offset: 4992)
!2007 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2008, size: 1152, elements: !2423)
!2008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2009, size: 64)
!2009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !1757, line: 57, size: 2496, elements: !2010)
!2010 = !{!2011, !2012, !2013, !2014, !2015, !2016, !2364, !2365, !2366, !2367, !2368, !2369, !2370, !2371, !2372, !2373, !2374, !2375, !2376, !2377, !2378, !2379, !2380, !2381, !2382, !2383, !2384, !2385, !2386, !2387, !2388, !2389, !2390, !2391, !2392, !2393, !2394, !2395, !2396, !2397, !2398, !2399, !2400, !2401, !2402, !2403, !2404, !2405, !2406, !2407, !2408, !2409, !2410, !2411, !2412, !2413, !2414, !2415, !2416, !2417, !2418, !2419, !2420, !2421, !2422}
!2011 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !2009, file: !1757, line: 59, baseType: !1399, size: 16)
!2012 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !2009, file: !1757, line: 59, baseType: !1399, size: 16, offset: 16)
!2013 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !2009, file: !1757, line: 59, baseType: !1399, size: 16, offset: 32)
!2014 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !2009, file: !1757, line: 59, baseType: !1399, size: 16, offset: 48)
!2015 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !2009, file: !1757, line: 60, baseType: !1735, size: 64, offset: 64)
!2016 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !2009, file: !1757, line: 61, baseType: !2017, size: 64, offset: 128)
!2017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2018, size: 64)
!2018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !1757, line: 202, size: 3328, elements: !2019)
!2019 = !{!2020, !2021, !2022, !2023, !2024, !2025, !2026, !2027, !2028, !2029, !2030, !2031, !2032, !2033, !2034, !2035, !2036, !2037, !2038, !2039, !2040, !2041, !2042, !2043, !2044, !2045, !2046, !2047, !2048, !2049, !2050, !2051, !2052, !2053, !2054, !2055, !2056, !2057, !2058, !2059, !2060, !2061, !2062, !2063, !2064, !2065, !2066, !2067, !2068, !2069, !2070, !2071, !2089, !2154, !2155, !2235, !2236, !2264, !2265, !2333, !2354, !2362, !2363}
!2020 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !2018, file: !1757, line: 203, baseType: !1598, size: 960)
!2021 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !2018, file: !1757, line: 204, baseType: !1667, size: 64, offset: 960)
!2022 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !2018, file: !1757, line: 206, baseType: !1455, size: 32, offset: 1024)
!2023 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !2018, file: !1757, line: 206, baseType: !1455, size: 32, offset: 1056)
!2024 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !2018, file: !1757, line: 207, baseType: !1455, size: 32, offset: 1088)
!2025 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !2018, file: !1757, line: 207, baseType: !1455, size: 32, offset: 1120)
!2026 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !2018, file: !1757, line: 207, baseType: !1455, size: 32, offset: 1152)
!2027 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !2018, file: !1757, line: 207, baseType: !1455, size: 32, offset: 1184)
!2028 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !2018, file: !1757, line: 207, baseType: !1455, size: 32, offset: 1216)
!2029 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !2018, file: !1757, line: 207, baseType: !1455, size: 32, offset: 1248)
!2030 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !2018, file: !1757, line: 208, baseType: !1455, size: 32, offset: 1280)
!2031 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !2018, file: !1757, line: 208, baseType: !1455, size: 32, offset: 1312)
!2032 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !2018, file: !1757, line: 211, baseType: !1455, size: 32, offset: 1344)
!2033 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !2018, file: !1757, line: 211, baseType: !1455, size: 32, offset: 1376)
!2034 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !2018, file: !1757, line: 211, baseType: !1455, size: 32, offset: 1408)
!2035 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !2018, file: !1757, line: 211, baseType: !1455, size: 32, offset: 1440)
!2036 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !2018, file: !1757, line: 211, baseType: !1455, size: 32, offset: 1472)
!2037 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !2018, file: !1757, line: 214, baseType: !1455, size: 32, offset: 1504)
!2038 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !2018, file: !1757, line: 214, baseType: !1455, size: 32, offset: 1536)
!2039 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !2018, file: !1757, line: 217, baseType: !1455, size: 32, offset: 1568)
!2040 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !2018, file: !1757, line: 218, baseType: !1455, size: 32, offset: 1600)
!2041 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !2018, file: !1757, line: 219, baseType: !1455, size: 32, offset: 1632)
!2042 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !2018, file: !1757, line: 220, baseType: !1455, size: 32, offset: 1664)
!2043 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !2018, file: !1757, line: 221, baseType: !1455, size: 32, offset: 1696)
!2044 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !2018, file: !1757, line: 222, baseType: !1399, size: 16, offset: 1728)
!2045 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !2018, file: !1757, line: 222, baseType: !1399, size: 16, offset: 1744)
!2046 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !2018, file: !1757, line: 224, baseType: !1399, size: 16, offset: 1760)
!2047 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !2018, file: !1757, line: 224, baseType: !1399, size: 16, offset: 1776)
!2048 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !2018, file: !1757, line: 227, baseType: !1399, size: 16, offset: 1792)
!2049 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !2018, file: !1757, line: 227, baseType: !1399, size: 16, offset: 1808)
!2050 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !2018, file: !1757, line: 229, baseType: !1399, size: 16, offset: 1824)
!2051 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !2018, file: !1757, line: 229, baseType: !1399, size: 16, offset: 1840)
!2052 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !2018, file: !1757, line: 230, baseType: !1399, size: 16, offset: 1856)
!2053 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !2018, file: !1757, line: 230, baseType: !1399, size: 16, offset: 1872)
!2054 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !2018, file: !1757, line: 232, baseType: !1455, size: 32, offset: 1888)
!2055 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !2018, file: !1757, line: 232, baseType: !1455, size: 32, offset: 1920)
!2056 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !2018, file: !1757, line: 232, baseType: !1455, size: 32, offset: 1952)
!2057 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !2018, file: !1757, line: 232, baseType: !1455, size: 32, offset: 1984)
!2058 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !2018, file: !1757, line: 233, baseType: !7, size: 32, offset: 2016)
!2059 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !2018, file: !1757, line: 234, baseType: !7, size: 32, offset: 2048)
!2060 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !2018, file: !1757, line: 235, baseType: !1399, size: 16, offset: 2080)
!2061 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !2018, file: !1757, line: 235, baseType: !1399, size: 16, offset: 2096)
!2062 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !2018, file: !1757, line: 236, baseType: !1399, size: 16, offset: 2112)
!2063 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !2018, file: !1757, line: 239, baseType: !1399, size: 16, offset: 2128)
!2064 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !2018, file: !1757, line: 240, baseType: !7, size: 32, offset: 2144)
!2065 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !2018, file: !1757, line: 241, baseType: !7, size: 32, offset: 2176)
!2066 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2018, file: !1757, line: 241, baseType: !7, size: 32, offset: 2208)
!2067 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !2018, file: !1757, line: 241, baseType: !7, size: 32, offset: 2240)
!2068 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !2018, file: !1757, line: 243, baseType: !1455, size: 32, offset: 2272)
!2069 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !2018, file: !1757, line: 243, baseType: !1455, size: 32, offset: 2304)
!2070 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !2018, file: !1757, line: 244, baseType: !1455, size: 32, offset: 2336)
!2071 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !2018, file: !1757, line: 246, baseType: !2072, size: 320, offset: 2368)
!2072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !2073, line: 50, size: 320, elements: !2074)
!2073 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2074 = !{!2075, !2076, !2077, !2078, !2079, !2080, !2081, !2082, !2083, !2084, !2085, !2086, !2087, !2088}
!2075 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !2072, file: !2073, line: 51, baseType: !1661, size: 64)
!2076 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !2072, file: !2073, line: 53, baseType: !7, size: 32, offset: 64)
!2077 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !2072, file: !2073, line: 54, baseType: !7, size: 32, offset: 96)
!2078 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2072, file: !2073, line: 55, baseType: !7, size: 32, offset: 128)
!2079 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !2072, file: !2073, line: 55, baseType: !7, size: 32, offset: 160)
!2080 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !2072, file: !2073, line: 56, baseType: !1401, size: 8, offset: 192)
!2081 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !2072, file: !2073, line: 56, baseType: !1401, size: 8, offset: 200)
!2082 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !2072, file: !2073, line: 57, baseType: !1401, size: 8, offset: 208)
!2083 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !2072, file: !2073, line: 57, baseType: !1401, size: 8, offset: 216)
!2084 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !2072, file: !2073, line: 59, baseType: !1399, size: 16, offset: 224)
!2085 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !2072, file: !2073, line: 59, baseType: !1399, size: 16, offset: 240)
!2086 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !2072, file: !2073, line: 59, baseType: !1399, size: 16, offset: 256)
!2087 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !2072, file: !2073, line: 61, baseType: !1399, size: 16, offset: 272)
!2088 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !2072, file: !2073, line: 63, baseType: !7, size: 32, offset: 288)
!2089 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !2018, file: !1757, line: 248, baseType: !2090, size: 64, offset: 2688)
!2090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2091, size: 64)
!2091 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !2092, line: 328, size: 3456, elements: !2093)
!2092 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2093 = !{!2094, !2095, !2096, !2099, !2100, !2103, !2104, !2105, !2106, !2107, !2108, !2109, !2110, !2111, !2112, !2113, !2114, !2115, !2116, !2117, !2118, !2119, !2120, !2121, !2122, !2125, !2130, !2131, !2134, !2138, !2142, !2146, !2150, !2151, !2152, !2153}
!2094 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !2091, file: !2092, line: 329, baseType: !1598, size: 960)
!2095 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !2091, file: !2092, line: 330, baseType: !1667, size: 64, offset: 960)
!2096 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !2091, file: !2092, line: 332, baseType: !2097, size: 64, offset: 1024)
!2097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2098, size: 64)
!2098 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !2092, line: 332, flags: DIFlagFwdDecl)
!2099 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !2091, file: !2092, line: 333, baseType: !1427, size: 512, offset: 1088)
!2100 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !2091, file: !2092, line: 335, baseType: !2101, size: 64, offset: 1600)
!2101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2102, size: 64)
!2102 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !2092, line: 335, flags: DIFlagFwdDecl)
!2103 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !2091, file: !2092, line: 337, baseType: !1813, size: 64, offset: 1664)
!2104 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !2091, file: !2092, line: 338, baseType: !1491, size: 64, offset: 1728)
!2105 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !2091, file: !2092, line: 340, baseType: !1418, size: 128, offset: 1792)
!2106 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !2091, file: !2092, line: 340, baseType: !1418, size: 128, offset: 1920)
!2107 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !2091, file: !2092, line: 342, baseType: !7, size: 32, offset: 2048)
!2108 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !2091, file: !2092, line: 342, baseType: !7, size: 32, offset: 2080)
!2109 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !2091, file: !2092, line: 343, baseType: !7, size: 32, offset: 2112)
!2110 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !2091, file: !2092, line: 345, baseType: !7, size: 32, offset: 2144)
!2111 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !2091, file: !2092, line: 346, baseType: !7, size: 32, offset: 2176)
!2112 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !2091, file: !2092, line: 347, baseType: !1399, size: 16, offset: 2208)
!2113 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !2091, file: !2092, line: 348, baseType: !1399, size: 16, offset: 2224)
!2114 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !2091, file: !2092, line: 349, baseType: !7, size: 32, offset: 2240)
!2115 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !2091, file: !2092, line: 351, baseType: !7, size: 32, offset: 2272)
!2116 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !2091, file: !2092, line: 353, baseType: !1399, size: 16, offset: 2304)
!2117 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !2091, file: !2092, line: 354, baseType: !1399, size: 16, offset: 2320)
!2118 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !2091, file: !2092, line: 355, baseType: !7, size: 32, offset: 2336)
!2119 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !2091, file: !2092, line: 357, baseType: !1536, size: 128, offset: 2368)
!2120 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !2091, file: !2092, line: 363, baseType: !1418, size: 128, offset: 2496)
!2121 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !2091, file: !2092, line: 363, baseType: !1418, size: 128, offset: 2624)
!2122 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !2091, file: !2092, line: 368, baseType: !2123, size: 64, offset: 2752)
!2123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2124, size: 64)
