; ModuleID = 'blender/source/blender/editors/space_graph/graph_edit.c'
source_filename = "blender/source/blender/editors/space_graph/graph_edit.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type opaque
%struct.ListBase = type { i8*, i8* }
%struct.bAnimContext = type { i8*, i16, i16, i16, i16, %struct.ScrArea*, %struct.SpaceLink*, %struct.ARegion*, %struct.bDopeSheet*, %struct.Scene*, %struct.Object*, %struct.ListBase*, %struct.ReportList* }
%struct.ScrArea = type { %struct.ScrArea*, %struct.ScrArea*, %struct.ScrVert*, %struct.ScrVert*, %struct.ScrVert*, %struct.ScrVert*, %struct.bScreen*, %struct.rcti, i8, i8, i16, i16, i16, i16, i16, i16, i8, i8, %struct.SpaceType*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase }
%struct.ScrVert = type { %struct.ScrVert*, %struct.ScrVert*, %struct.ScrVert*, %struct.vec2s, i16, i16 }
%struct.vec2s = type { i16, i16 }
%struct.bScreen = type { %struct.ID, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.Scene*, %struct.Scene*, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, %struct.wmTimer*, i8* }

!137 = !DIEnumerator(name: "RPT_ERROR_INVALID_CONTEXT", value: 128, isUnsigned: true)
!138 = !DIEnumerator(name: "RPT_ERROR_OUT_OF_MEMORY", value: 256, isUnsigned: true)
!139 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eFCurve_Flags", file: !140, line: 467, baseType: !25, size: 32, elements: !141)
!140 = !DIFile(filename: "blender/source/blender/makesdna/DNA_anim_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!141 = !{!142, !143, !144, !145, !146, !147, !148, !149, !150, !151}
!142 = !DIEnumerator(name: "FCURVE_VISIBLE", value: 1, isUnsigned: true)
!143 = !DIEnumerator(name: "FCURVE_SELECTED", value: 2, isUnsigned: true)
!144 = !DIEnumerator(name: "FCURVE_ACTIVE", value: 4, isUnsigned: true)
!145 = !DIEnumerator(name: "FCURVE_PROTECTED", value: 8, isUnsigned: true)
!146 = !DIEnumerator(name: "FCURVE_MUTED", value: 16, isUnsigned: true)
!147 = !DIEnumerator(name: "FCURVE_AUTO_HANDLES", value: 32, isUnsigned: true)
!148 = !DIEnumerator(name: "FCURVE_DISABLED", value: 1024, isUnsigned: true)
!149 = !DIEnumerator(name: "FCURVE_INT_VALUES", value: 2048, isUnsigned: true)
!150 = !DIEnumerator(name: "FCURVE_DISCRETE_VALUES", value: 4096, isUnsigned: true)
!151 = !DIEnumerator(name: "FCURVE_TAGGED", value: 32768, isUnsigned: true)
!152 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eFMI_Action_Types", file: !153, line: 147, baseType: !25, size: 32, elements: !154)
!153 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_fcurve.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!154 = !{!155, !156, !157, !158}
!155 = !DIEnumerator(name: "FMI_TYPE_EXTRAPOLATION", value: 0, isUnsigned: true)
!156 = !DIEnumerator(name: "FMI_TYPE_INTERPOLATION", value: 1, isUnsigned: true)
!157 = !DIEnumerator(name: "FMI_TYPE_REPLACE_VALUES", value: 2, isUnsigned: true)
!158 = !DIEnumerator(name: "FMI_TYPE_GENERATE_CURVE", value: 3, isUnsigned: true)
!159 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eFModifier_Types", file: !140, line: 72, baseType: !25, size: 32, elements: !160)
!160 = !{!161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171}
!161 = !DIEnumerator(name: "FMODIFIER_TYPE_NULL", value: 0, isUnsigned: true)
!162 = !DIEnumerator(name: "FMODIFIER_TYPE_GENERATOR", value: 1, isUnsigned: true)
!163 = !DIEnumerator(name: "FMODIFIER_TYPE_FN_GENERATOR", value: 2, isUnsigned: true)
!164 = !DIEnumerator(name: "FMODIFIER_TYPE_ENVELOPE", value: 3, isUnsigned: true)
!165 = !DIEnumerator(name: "FMODIFIER_TYPE_CYCLES", value: 4, isUnsigned: true)
!166 = !DIEnumerator(name: "FMODIFIER_TYPE_NOISE", value: 5, isUnsigned: true)
!167 = !DIEnumerator(name: "FMODIFIER_TYPE_FILTER", value: 6, isUnsigned: true)
!168 = !DIEnumerator(name: "FMODIFIER_TYPE_PYTHON", value: 7, isUnsigned: true)
!169 = !DIEnumerator(name: "FMODIFIER_TYPE_LIMITS", value: 8, isUnsigned: true)
!170 = !DIEnumerator(name: "FMODIFIER_TYPE_STEPPED", value: 9, isUnsigned: true)
!171 = !DIEnumerator(name: "FMODIFIER_NUM_TYPES", value: 10, isUnsigned: true)
!172 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eEditKeyframes_Validate", file: !31, line: 53, baseType: !25, size: 32, elements: !173)
!173 = !{!174, !175, !176, !177, !178, !179, !180}
!174 = !DIEnumerator(name: "BEZT_OK_FRAME", value: 1, isUnsigned: true)
!175 = !DIEnumerator(name: "BEZT_OK_FRAMERANGE", value: 2, isUnsigned: true)
!176 = !DIEnumerator(name: "BEZT_OK_SELECTED", value: 3, isUnsigned: true)
!177 = !DIEnumerator(name: "BEZT_OK_VALUE", value: 4, isUnsigned: true)
!178 = !DIEnumerator(name: "BEZT_OK_VALUERANGE", value: 5, isUnsigned: true)
!179 = !DIEnumerator(name: "BEZT_OK_REGION", value: 6, isUnsigned: true)
!180 = !DIEnumerator(name: "BEZT_OK_REGION_LASSO", value: 7, isUnsigned: true)
!181 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eGraphKeys_Snap_Mode", file: !182, line: 124, baseType: !25, size: 32, elements: !183)
!182 = !DIFile(filename: "blender/source/blender/editors/space_graph/graph_intern.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!183 = !{!184, !185, !186, !187, !188, !189}
!184 = !DIEnumerator(name: "GRAPHKEYS_SNAP_CFRA", value: 1, isUnsigned: true)
!185 = !DIEnumerator(name: "GRAPHKEYS_SNAP_NEAREST_FRAME", value: 2, isUnsigned: true)
!186 = !DIEnumerator(name: "GRAPHKEYS_SNAP_NEAREST_SECOND", value: 3, isUnsigned: true)
!187 = !DIEnumerator(name: "GRAPHKEYS_SNAP_NEAREST_MARKER", value: 4, isUnsigned: true)
!188 = !DIEnumerator(name: "GRAPHKEYS_SNAP_HORIZONTAL", value: 5, isUnsigned: true)
!189 = !DIEnumerator(name: "GRAPHKEYS_SNAP_VALUE", value: 6, isUnsigned: true)
!190 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eGraphKeys_Mirror_Mode", file: !182, line: 136, baseType: !25, size: 32, elements: !191)
!191 = !{!192, !193, !194, !195, !196}
!192 = !DIEnumerator(name: "GRAPHKEYS_MIRROR_CFRA", value: 1, isUnsigned: true)
!193 = !DIEnumerator(name: "GRAPHKEYS_MIRROR_YAXIS", value: 2, isUnsigned: true)
!194 = !DIEnumerator(name: "GRAPHKEYS_MIRROR_XAXIS", value: 3, isUnsigned: true)
!195 = !DIEnumerator(name: "GRAPHKEYS_MIRROR_MARKER", value: 4, isUnsigned: true)
!196 = !DIEnumerator(name: "GRAPHKEYS_MIRROR_VALUE", value: 5, isUnsigned: true)
!197 = !{!198, !255, !220, !7, !309}
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "FCurve", file: !140, line: 463, baseType: !200)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FCurve", file: !140, line: 433, size: 896, elements: !201)
!201 = !{!202, !204, !205, !243, !259, !260, !285, !296, !297, !298, !299, !300, !301, !303, !304, !307, !308}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !200, file: !140, line: 434, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !200, file: !140, line: 434, baseType: !203, size: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "grp", scope: !200, file: !140, line: 437, baseType: !206, size: 64, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "bActionGroup", file: !208, line: 450, baseType: !209)
!208 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bActionGroup", file: !208, line: 440, size: 960, elements: !210)
!210 = !{!211, !213, !214, !222, !223, !224, !229}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !209, file: !208, line: 441, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !209, file: !208, line: 441, baseType: !212, size: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !209, file: !208, line: 443, baseType: !215, size: 128, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !216, line: 71, baseType: !217)
!216 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !216, line: 69, size: 128, elements: !218)
!218 = !{!219, !221}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !217, file: !216, line: 70, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !217, file: !216, line: 70, baseType: !220, size: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !209, file: !208, line: 445, baseType: !7, size: 32, offset: 256)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "customCol", scope: !209, file: !208, line: 446, baseType: !7, size: 32, offset: 288)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !209, file: !208, line: 447, baseType: !225, size: 512, offset: 320)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 512, elements: !227)
!226 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!227 = !{!228}
!228 = !DISubrange(count: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !209, file: !208, line: 449, baseType: !230, size: 128, offset: 832)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThemeWireColor", file: !231, line: 347, baseType: !232)
!231 = !DIFile(filename: "blender/source/blender/makesdna/DNA_userdef_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ThemeWireColor", file: !231, line: 340, size: 128, elements: !233)
!233 = !{!234, !238, !239, !240, !242}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "solid", scope: !232, file: !231, line: 341, baseType: !235, size: 32)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 32, elements: !236)
!236 = !{!237}
!237 = !DISubrange(count: 4)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "select", scope: !232, file: !231, line: 342, baseType: !235, size: 32, offset: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !232, file: !231, line: 343, baseType: !235, size: 32, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !232, file: !231, line: 345, baseType: !241, size: 16, offset: 96)
!241 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !232, file: !231, line: 346, baseType: !241, size: 16, offset: 112)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "driver", scope: !200, file: !140, line: 440, baseType: !244, size: 64, offset: 192)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelDriver", file: !140, line: 386, baseType: !246)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ChannelDriver", file: !140, line: 371, size: 2368, elements: !247)
!247 = !{!248, !249, !253, !254, !256, !257, !258}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "variables", scope: !246, file: !140, line: 372, baseType: !215, size: 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "expression", scope: !246, file: !140, line: 377, baseType: !250, size: 2048, offset: 128)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 2048, elements: !251)
!251 = !{!252}
!252 = !DISubrange(count: 256)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "expr_comp", scope: !246, file: !140, line: 378, baseType: !220, size: 64, offset: 2176)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "curval", scope: !246, file: !140, line: 380, baseType: !255, size: 32, offset: 2240)
!255 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !246, file: !140, line: 381, baseType: !255, size: 32, offset: 2272)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !246, file: !140, line: 384, baseType: !7, size: 32, offset: 2304)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !246, file: !140, line: 385, baseType: !7, size: 32, offset: 2336)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !200, file: !140, line: 442, baseType: !215, size: 128, offset: 256)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "bezt", scope: !200, file: !140, line: 445, baseType: !261, size: 64, offset: 384)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "BezTriple", file: !263, line: 133, baseType: !264)
!263 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BezTriple", file: !263, line: 117, size: 576, elements: !265)
!265 = !{!266, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !264, file: !263, line: 118, baseType: !267, size: 288)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 288, elements: !268)
!268 = !{!269, !269}
!269 = !DISubrange(count: 3)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "alfa", scope: !264, file: !263, line: 119, baseType: !255, size: 32, offset: 288)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !264, file: !263, line: 119, baseType: !255, size: 32, offset: 320)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !264, file: !263, line: 119, baseType: !255, size: 32, offset: 352)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !264, file: !263, line: 121, baseType: !226, size: 8, offset: 384)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "h1", scope: !264, file: !263, line: 123, baseType: !226, size: 8, offset: 392)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "h2", scope: !264, file: !263, line: 123, baseType: !226, size: 8, offset: 400)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "f1", scope: !264, file: !263, line: 124, baseType: !226, size: 8, offset: 408)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "f2", scope: !264, file: !263, line: 124, baseType: !226, size: 8, offset: 416)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "f3", scope: !264, file: !263, line: 124, baseType: !226, size: 8, offset: 424)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "hide", scope: !264, file: !263, line: 126, baseType: !226, size: 8, offset: 432)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "easing", scope: !264, file: !263, line: 128, baseType: !226, size: 8, offset: 440)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !264, file: !263, line: 129, baseType: !255, size: 32, offset: 448)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "amplitude", scope: !264, file: !263, line: 130, baseType: !255, size: 32, offset: 480)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !264, file: !263, line: 130, baseType: !255, size: 32, offset: 512)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !264, file: !263, line: 132, baseType: !235, size: 32, offset: 544)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "fpt", scope: !200, file: !140, line: 446, baseType: !286, size: 64, offset: 448)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "FPoint", file: !140, line: 430, baseType: !288)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FPoint", file: !140, line: 426, size: 128, elements: !289)
!289 = !{!290, !294, !295}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !288, file: !140, line: 427, baseType: !291, size: 64)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 64, elements: !292)
!292 = !{!293}
!293 = !DISubrange(count: 2)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !288, file: !140, line: 428, baseType: !7, size: 32, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !288, file: !140, line: 429, baseType: !7, size: 32, offset: 96)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !200, file: !140, line: 447, baseType: !25, size: 32, offset: 512)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "curval", scope: !200, file: !140, line: 450, baseType: !255, size: 32, offset: 544)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !200, file: !140, line: 451, baseType: !241, size: 16, offset: 576)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !200, file: !140, line: 452, baseType: !241, size: 16, offset: 592)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "array_index", scope: !200, file: !140, line: 455, baseType: !7, size: 32, offset: 608)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "rna_path", scope: !200, file: !140, line: 456, baseType: !302, size: 64, offset: 640)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !200, file: !140, line: 459, baseType: !7, size: 32, offset: 704)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !200, file: !140, line: 460, baseType: !305, size: 96, offset: 736)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 96, elements: !306)
!306 = !{!269}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "prev_norm_factor", scope: !200, file: !140, line: 462, baseType: !255, size: 32, offset: 832)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !200, file: !140, line: 462, baseType: !255, size: 32, offset: 864)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceIpo", file: !79, line: 334, baseType: !311)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceIpo", file: !79, line: 315, size: 2048, elements: !312)
!312 = !{!313, !328, !329, !330, !331, !332, !333, !1812, !1826, !1827, !1828, !1829, !1830, !1831}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !311, file: !79, line: 316, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceLink", file: !79, line: 91, baseType: !316)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !79, line: 85, size: 448, elements: !317)
!317 = !{!318, !320, !321, !322, !323, !324}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !316, file: !79, line: 86, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !316, file: !79, line: 86, baseType: !319, size: 64, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !316, file: !79, line: 87, baseType: !215, size: 128, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !316, file: !79, line: 88, baseType: !7, size: 32, offset: 256)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !316, file: !79, line: 89, baseType: !255, size: 32, offset: 288)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !316, file: !79, line: 90, baseType: !325, size: 128, offset: 320)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 128, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 8)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !311, file: !79, line: 316, baseType: !314, size: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !311, file: !79, line: 317, baseType: !215, size: 128, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !311, file: !79, line: 318, baseType: !7, size: 32, offset: 256)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !311, file: !79, line: 319, baseType: !255, size: 32, offset: 288)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !311, file: !79, line: 320, baseType: !325, size: 128, offset: 320)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !311, file: !79, line: 322, baseType: !334, size: 1280, offset: 448)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "View2D", file: !335, line: 71, baseType: !336)
!335 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view2d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View2D", file: !335, line: 40, size: 1280, elements: !337)
!337 = !{!338, !347, !348, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !376, !377, !378, !381}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !336, file: !335, line: 41, baseType: !339, size: 128)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !340, line: 95, baseType: !341)
!340 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !340, line: 92, size: 128, elements: !342)
!342 = !{!343, !344, !345, !346}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !341, file: !340, line: 93, baseType: !255, size: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !341, file: !340, line: 93, baseType: !255, size: 32, offset: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !341, file: !340, line: 94, baseType: !255, size: 32, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !341, file: !340, line: 94, baseType: !255, size: 32, offset: 96)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !336, file: !335, line: 41, baseType: !339, size: 128, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "vert", scope: !336, file: !335, line: 42, baseType: !349, size: 128, offset: 256)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !340, line: 89, baseType: !350)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !340, line: 86, size: 128, elements: !351)
!351 = !{!352, !353, !354, !355}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !350, file: !340, line: 87, baseType: !7, size: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !350, file: !340, line: 87, baseType: !7, size: 32, offset: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !350, file: !340, line: 88, baseType: !7, size: 32, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !350, file: !340, line: 88, baseType: !7, size: 32, offset: 96)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "hor", scope: !336, file: !335, line: 42, baseType: !349, size: 128, offset: 384)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !336, file: !335, line: 43, baseType: !349, size: 128, offset: 512)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !336, file: !335, line: 45, baseType: !291, size: 64, offset: 640)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !336, file: !335, line: 45, baseType: !291, size: 64, offset: 704)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "minzoom", scope: !336, file: !335, line: 46, baseType: !255, size: 32, offset: 768)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "maxzoom", scope: !336, file: !335, line: 46, baseType: !255, size: 32, offset: 800)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !336, file: !335, line: 48, baseType: !241, size: 16, offset: 832)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_ui", scope: !336, file: !335, line: 49, baseType: !241, size: 16, offset: 848)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "keeptot", scope: !336, file: !335, line: 51, baseType: !241, size: 16, offset: 864)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "keepzoom", scope: !336, file: !335, line: 52, baseType: !241, size: 16, offset: 880)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "keepofs", scope: !336, file: !335, line: 53, baseType: !241, size: 16, offset: 896)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !336, file: !335, line: 55, baseType: !241, size: 16, offset: 912)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !336, file: !335, line: 56, baseType: !241, size: 16, offset: 928)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !336, file: !335, line: 58, baseType: !241, size: 16, offset: 944)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !336, file: !335, line: 58, baseType: !241, size: 16, offset: 960)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "oldwinx", scope: !336, file: !335, line: 59, baseType: !241, size: 16, offset: 976)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "oldwiny", scope: !336, file: !335, line: 59, baseType: !241, size: 16, offset: 992)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !336, file: !335, line: 61, baseType: !241, size: 16, offset: 1008)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "tab_offset", scope: !336, file: !335, line: 63, baseType: !375, size: 64, offset: 1024)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "tab_num", scope: !336, file: !335, line: 64, baseType: !7, size: 32, offset: 1088)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "tab_cur", scope: !336, file: !335, line: 65, baseType: !7, size: 32, offset: 1120)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "sms", scope: !336, file: !335, line: 68, baseType: !379, size: 64, offset: 1152)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmoothView2DStore", file: !335, line: 68, flags: DIFlagFwdDecl)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_timer", scope: !336, file: !335, line: 69, baseType: !382, size: 64, offset: 1216)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !384, line: 490, size: 768, elements: !385)
!384 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!385 = !{!386, !387, !388, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !383, file: !384, line: 491, baseType: !382, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !383, file: !384, line: 491, baseType: !382, size: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !383, file: !384, line: 493, baseType: !389, size: 64, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !106, line: 169, size: 2048, elements: !391)
!391 = !{!392, !393, !394, !395, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1778, !1781, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !390, file: !106, line: 170, baseType: !389, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !390, file: !106, line: 170, baseType: !389, size: 64, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !390, file: !106, line: 172, baseType: !220, size: 64, offset: 128)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !390, file: !106, line: 174, baseType: !396, size: 64, offset: 192)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !398, line: 49, size: 1984, elements: !399)
!398 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!399 = !{!400, !459, !460, !461, !462, !463, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !397, file: !398, line: 50, baseType: !401, size: 960)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !402, line: 130, baseType: !403)
!402 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !402, line: 117, size: 960, elements: !404)
!404 = !{!405, !406, !407, !409, !428, !432, !433, !434, !435, !436}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !403, file: !402, line: 118, baseType: !220, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !403, file: !402, line: 118, baseType: !220, size: 64, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !403, file: !402, line: 119, baseType: !408, size: 64, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !403, file: !402, line: 120, baseType: !410, size: 64, offset: 192)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !402, line: 136, size: 17600, elements: !412)
!412 = !{!413, !414, !416, !419, !423, !424, !425}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !411, file: !402, line: 137, baseType: !401, size: 960)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !411, file: !402, line: 138, baseType: !415, size: 64, offset: 960)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !411, file: !402, line: 139, baseType: !417, size: 64, offset: 1024)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !402, line: 43, flags: DIFlagFwdDecl)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !411, file: !402, line: 140, baseType: !420, size: 8192, offset: 1088)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 8192, elements: !421)
!421 = !{!422}
!422 = !DISubrange(count: 1024)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !411, file: !402, line: 141, baseType: !420, size: 8192, offset: 9280)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !411, file: !402, line: 148, baseType: !410, size: 64, offset: 17472)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !411, file: !402, line: 150, baseType: !426, size: 64, offset: 17536)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !402, line: 45, flags: DIFlagFwdDecl)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !403, file: !402, line: 121, baseType: !429, size: 528, offset: 256)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 528, elements: !430)
!430 = !{!431}
!431 = !DISubrange(count: 66)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !403, file: !402, line: 126, baseType: !241, size: 16, offset: 784)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !403, file: !402, line: 127, baseType: !7, size: 32, offset: 800)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !403, file: !402, line: 128, baseType: !7, size: 32, offset: 832)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !403, file: !402, line: 128, baseType: !7, size: 32, offset: 864)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !403, file: !402, line: 129, baseType: !437, size: 64, offset: 896)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !402, line: 75, baseType: !439)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !402, line: 62, size: 1024, elements: !440)
!440 = !{!441, !443, !444, !445, !446, !447, !448, !449, !457, !458}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !439, file: !402, line: 63, baseType: !442, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !439, file: !402, line: 63, baseType: !442, size: 64, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !439, file: !402, line: 64, baseType: !226, size: 8, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !439, file: !402, line: 64, baseType: !226, size: 8, offset: 136)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !439, file: !402, line: 65, baseType: !241, size: 16, offset: 144)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !439, file: !402, line: 66, baseType: !225, size: 512, offset: 160)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !439, file: !402, line: 67, baseType: !7, size: 32, offset: 672)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !439, file: !402, line: 69, baseType: !450, size: 256, offset: 704)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !402, line: 60, baseType: !451)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !402, line: 48, size: 256, elements: !452)
!452 = !{!453, !454, !455, !456}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !451, file: !402, line: 49, baseType: !220, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !451, file: !402, line: 58, baseType: !215, size: 128, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !451, file: !402, line: 59, baseType: !7, size: 32, offset: 192)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !451, file: !402, line: 59, baseType: !7, size: 32, offset: 224)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !439, file: !402, line: 70, baseType: !7, size: 32, offset: 960)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !439, file: !402, line: 74, baseType: !7, size: 32, offset: 992)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !397, file: !398, line: 52, baseType: !215, size: 128, offset: 960)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !397, file: !398, line: 53, baseType: !215, size: 128, offset: 1088)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !397, file: !398, line: 54, baseType: !215, size: 128, offset: 1216)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !397, file: !398, line: 55, baseType: !215, size: 128, offset: 1344)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !397, file: !398, line: 57, baseType: !464, size: 64, offset: 1472)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !466, line: 1216, size: 39680, elements: !467)
!466 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!467 = !{!468, !469, !537, !541, !544, !545, !546, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !572, !641, !1072, !1287, !1290, !1571, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1593, !1594, !1595, !1596, !1597, !1605, !1672, !1679, !1680, !1687, !1688, !1694, !1695, !1696, !1697, !1698}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !465, file: !466, line: 1217, baseType: !401, size: 960)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !465, file: !466, line: 1218, baseType: !470, size: 64, offset: 960)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !140, line: 838, size: 768, elements: !472)
!472 = !{!473, !487, !488, !498, !499, !530, !531, !532, !533, !534, !535, !536}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !471, file: !140, line: 840, baseType: !474, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !208, line: 499, baseType: !476)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !208, line: 486, size: 1600, elements: !477)
!477 = !{!478, !479, !480, !481, !482, !483, !484, !485, !486}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !476, file: !208, line: 487, baseType: !401, size: 960)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !476, file: !208, line: 489, baseType: !215, size: 128, offset: 960)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !476, file: !208, line: 490, baseType: !215, size: 128, offset: 1088)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !476, file: !208, line: 491, baseType: !215, size: 128, offset: 1216)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !476, file: !208, line: 492, baseType: !215, size: 128, offset: 1344)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !476, file: !208, line: 494, baseType: !7, size: 32, offset: 1472)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !476, file: !208, line: 495, baseType: !7, size: 32, offset: 1504)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !476, file: !208, line: 497, baseType: !7, size: 32, offset: 1536)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !476, file: !208, line: 498, baseType: !7, size: 32, offset: 1568)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !471, file: !140, line: 844, baseType: !474, size: 64, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !471, file: !140, line: 848, baseType: !489, size: 64, offset: 128)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !140, line: 549, baseType: !491)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !140, line: 544, size: 320, elements: !492)
!492 = !{!493, !495, !496, !497}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !491, file: !140, line: 545, baseType: !494, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !491, file: !140, line: 545, baseType: !494, size: 64, offset: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !491, file: !140, line: 547, baseType: !474, size: 64, offset: 128)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !491, file: !140, line: 548, baseType: !215, size: 128, offset: 192)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !471, file: !140, line: 851, baseType: !215, size: 128, offset: 192)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !471, file: !140, line: 853, baseType: !500, size: 64, offset: 320)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !140, line: 594, baseType: !502)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !140, line: 561, size: 1664, elements: !503)
!503 = !{!504, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !502, file: !140, line: 562, baseType: !505, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !502, file: !140, line: 562, baseType: !505, size: 64, offset: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !502, file: !140, line: 564, baseType: !215, size: 128, offset: 128)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !502, file: !140, line: 565, baseType: !474, size: 64, offset: 256)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !502, file: !140, line: 566, baseType: !489, size: 64, offset: 320)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !502, file: !140, line: 568, baseType: !215, size: 128, offset: 384)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !502, file: !140, line: 569, baseType: !215, size: 128, offset: 512)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !502, file: !140, line: 571, baseType: !225, size: 512, offset: 640)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !502, file: !140, line: 573, baseType: !255, size: 32, offset: 1152)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "strip_time", scope: !502, file: !140, line: 574, baseType: !255, size: 32, offset: 1184)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !502, file: !140, line: 576, baseType: !255, size: 32, offset: 1216)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !502, file: !140, line: 576, baseType: !255, size: 32, offset: 1248)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "actstart", scope: !502, file: !140, line: 577, baseType: !255, size: 32, offset: 1280)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "actend", scope: !502, file: !140, line: 577, baseType: !255, size: 32, offset: 1312)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !502, file: !140, line: 579, baseType: !255, size: 32, offset: 1344)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !502, file: !140, line: 580, baseType: !255, size: 32, offset: 1376)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !502, file: !140, line: 582, baseType: !255, size: 32, offset: 1408)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !502, file: !140, line: 582, baseType: !255, size: 32, offset: 1440)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "blendmode", scope: !502, file: !140, line: 583, baseType: !241, size: 16, offset: 1472)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "extendmode", scope: !502, file: !140, line: 585, baseType: !241, size: 16, offset: 1488)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !502, file: !140, line: 586, baseType: !241, size: 16, offset: 1504)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !502, file: !140, line: 588, baseType: !241, size: 16, offset: 1520)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handle", scope: !502, file: !140, line: 590, baseType: !220, size: 64, offset: 1536)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !502, file: !140, line: 592, baseType: !7, size: 32, offset: 1600)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !502, file: !140, line: 593, baseType: !7, size: 32, offset: 1632)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "drivers", scope: !471, file: !140, line: 858, baseType: !215, size: 128, offset: 384)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "overrides", scope: !471, file: !140, line: 859, baseType: !215, size: 128, offset: 512)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !471, file: !140, line: 862, baseType: !7, size: 32, offset: 640)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !471, file: !140, line: 863, baseType: !7, size: 32, offset: 672)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "act_blendmode", scope: !471, file: !140, line: 866, baseType: !241, size: 16, offset: 704)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "act_extendmode", scope: !471, file: !140, line: 867, baseType: !241, size: 16, offset: 720)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "act_influence", scope: !471, file: !140, line: 868, baseType: !255, size: 32, offset: 736)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !465, file: !466, line: 1220, baseType: !538, size: 64, offset: 1024)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !540, line: 49, flags: DIFlagFwdDecl)
!540 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!541 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !465, file: !466, line: 1221, baseType: !542, size: 64, offset: 1088)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !466, line: 52, flags: DIFlagFwdDecl)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !465, file: !466, line: 1223, baseType: !464, size: 64, offset: 1152)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !465, file: !466, line: 1225, baseType: !215, size: 128, offset: 1216)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !465, file: !466, line: 1226, baseType: !547, size: 64, offset: 1344)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !466, line: 69, size: 320, elements: !549)
!549 = !{!550, !551, !552, !553, !554, !555, !556, !557}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !548, file: !466, line: 70, baseType: !547, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !548, file: !466, line: 70, baseType: !547, size: 64, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !548, file: !466, line: 71, baseType: !25, size: 32, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !548, file: !466, line: 71, baseType: !25, size: 32, offset: 160)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !548, file: !466, line: 72, baseType: !7, size: 32, offset: 192)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !548, file: !466, line: 73, baseType: !241, size: 16, offset: 224)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !548, file: !466, line: 73, baseType: !241, size: 16, offset: 240)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !548, file: !466, line: 74, baseType: !538, size: 64, offset: 256)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !465, file: !466, line: 1227, baseType: !538, size: 64, offset: 1408)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !465, file: !466, line: 1229, baseType: !305, size: 96, offset: 1472)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !465, file: !466, line: 1230, baseType: !305, size: 96, offset: 1568)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !465, file: !466, line: 1231, baseType: !305, size: 96, offset: 1664)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !465, file: !466, line: 1231, baseType: !305, size: 96, offset: 1760)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !465, file: !466, line: 1233, baseType: !25, size: 32, offset: 1856)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !465, file: !466, line: 1234, baseType: !7, size: 32, offset: 1888)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !465, file: !466, line: 1235, baseType: !25, size: 32, offset: 1920)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !465, file: !466, line: 1237, baseType: !241, size: 16, offset: 1952)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !465, file: !466, line: 1239, baseType: !226, size: 8, offset: 1968)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !465, file: !466, line: 1240, baseType: !569, size: 8, offset: 1976)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 8, elements: !570)
!570 = !{!571}
!571 = !DISubrange(count: 1)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !465, file: !466, line: 1242, baseType: !573, size: 64, offset: 1984)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !575, line: 328, size: 3456, elements: !576)
!575 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!576 = !{!577, !578, !579, !583, !584, !588, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !612, !617, !618, !621, !625, !629, !633, !637, !638, !639, !640}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !574, file: !575, line: 329, baseType: !401, size: 960)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !574, file: !575, line: 330, baseType: !470, size: 64, offset: 960)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !574, file: !575, line: 332, baseType: !580, size: 64, offset: 1024)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !582, line: 32, flags: DIFlagFwdDecl)
!582 = !DIFile(filename: "blender/source/blender/makesrna/RNA_enum_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!583 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !574, file: !575, line: 333, baseType: !225, size: 512, offset: 1088)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !574, file: !575, line: 335, baseType: !585, size: 64, offset: 1600)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !587, line: 41, flags: DIFlagFwdDecl)
!587 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!588 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !574, file: !575, line: 337, baseType: !589, size: 64, offset: 1664)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !466, line: 61, flags: DIFlagFwdDecl)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !574, file: !575, line: 338, baseType: !291, size: 64, offset: 1728)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !574, file: !575, line: 340, baseType: !215, size: 128, offset: 1792)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !574, file: !575, line: 340, baseType: !215, size: 128, offset: 1920)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !574, file: !575, line: 342, baseType: !7, size: 32, offset: 2048)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !574, file: !575, line: 342, baseType: !7, size: 32, offset: 2080)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !574, file: !575, line: 343, baseType: !7, size: 32, offset: 2112)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !574, file: !575, line: 345, baseType: !7, size: 32, offset: 2144)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !574, file: !575, line: 346, baseType: !7, size: 32, offset: 2176)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !574, file: !575, line: 347, baseType: !241, size: 16, offset: 2208)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !574, file: !575, line: 348, baseType: !241, size: 16, offset: 2224)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !574, file: !575, line: 349, baseType: !7, size: 32, offset: 2240)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !574, file: !575, line: 351, baseType: !7, size: 32, offset: 2272)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !574, file: !575, line: 353, baseType: !241, size: 16, offset: 2304)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !574, file: !575, line: 354, baseType: !241, size: 16, offset: 2320)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !574, file: !575, line: 355, baseType: !7, size: 32, offset: 2336)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !574, file: !575, line: 357, baseType: !339, size: 128, offset: 2368)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !574, file: !575, line: 363, baseType: !215, size: 128, offset: 2496)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !574, file: !575, line: 363, baseType: !215, size: 128, offset: 2624)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !574, file: !575, line: 368, baseType: !610, size: 64, offset: 2752)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !575, line: 48, flags: DIFlagFwdDecl)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !574, file: !575, line: 372, baseType: !613, size: 32, offset: 2816)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !575, line: 274, baseType: !614)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !575, line: 271, size: 32, elements: !615)
!615 = !{!616}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !614, file: !575, line: 273, baseType: !25, size: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !574, file: !575, line: 373, baseType: !7, size: 32, offset: 2848)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !574, file: !575, line: 382, baseType: !619, size: 64, offset: 2880)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !575, line: 46, flags: DIFlagFwdDecl)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !574, file: !575, line: 385, baseType: !622, size: 64, offset: 2944)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DISubroutineType(types: !624)
!624 = !{null, !220, !255}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !574, file: !575, line: 386, baseType: !626, size: 64, offset: 3008)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DISubroutineType(types: !628)
!628 = !{null, !220, !302}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !574, file: !575, line: 387, baseType: !630, size: 64, offset: 3072)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DISubroutineType(types: !632)
!632 = !{!7, !220}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !574, file: !575, line: 388, baseType: !634, size: 64, offset: 3136)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{null, !220}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !574, file: !575, line: 389, baseType: !220, size: 64, offset: 3200)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !574, file: !575, line: 389, baseType: !220, size: 64, offset: 3264)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !574, file: !575, line: 389, baseType: !220, size: 64, offset: 3328)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !574, file: !575, line: 389, baseType: !220, size: 64, offset: 3392)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !465, file: !466, line: 1244, baseType: !642, size: 64, offset: 2048)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !644, line: 200, size: 17024, elements: !645)
!644 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!645 = !{!646, !648, !649, !650, !1065, !1066, !1067, !1068, !1069, !1070, !1071}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !643, file: !644, line: 201, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !643, file: !644, line: 202, baseType: !215, size: 128, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !643, file: !644, line: 203, baseType: !215, size: 128, offset: 192)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !643, file: !644, line: 206, baseType: !651, size: 64, offset: 320)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !644, line: 190, baseType: !653)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !644, line: 126, size: 2816, elements: !654)
!654 = !{!655, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !751, !754, !755, !756, !1036, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1064}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !653, file: !644, line: 127, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !653, file: !644, line: 127, baseType: !656, size: 64, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !653, file: !644, line: 128, baseType: !220, size: 64, offset: 128)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !653, file: !644, line: 129, baseType: !220, size: 64, offset: 192)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !653, file: !644, line: 130, baseType: !225, size: 512, offset: 256)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !653, file: !644, line: 132, baseType: !7, size: 32, offset: 768)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !653, file: !644, line: 132, baseType: !7, size: 32, offset: 800)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !653, file: !644, line: 133, baseType: !7, size: 32, offset: 832)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !653, file: !644, line: 134, baseType: !7, size: 32, offset: 864)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !653, file: !644, line: 134, baseType: !7, size: 32, offset: 896)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !653, file: !644, line: 134, baseType: !7, size: 32, offset: 928)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !653, file: !644, line: 135, baseType: !7, size: 32, offset: 960)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !653, file: !644, line: 135, baseType: !7, size: 32, offset: 992)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !653, file: !644, line: 136, baseType: !7, size: 32, offset: 1024)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !653, file: !644, line: 136, baseType: !7, size: 32, offset: 1056)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !653, file: !644, line: 137, baseType: !7, size: 32, offset: 1088)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !653, file: !644, line: 137, baseType: !7, size: 32, offset: 1120)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !653, file: !644, line: 138, baseType: !255, size: 32, offset: 1152)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !653, file: !644, line: 139, baseType: !255, size: 32, offset: 1184)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !653, file: !644, line: 139, baseType: !255, size: 32, offset: 1216)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !653, file: !644, line: 141, baseType: !241, size: 16, offset: 1248)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !653, file: !644, line: 142, baseType: !241, size: 16, offset: 1264)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !653, file: !644, line: 143, baseType: !7, size: 32, offset: 1280)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !653, file: !644, line: 144, baseType: !7, size: 32, offset: 1312)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !653, file: !644, line: 146, baseType: !681, size: 64, offset: 1344)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !644, line: 114, baseType: !683)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !644, line: 99, size: 7232, elements: !684)
!684 = !{!685, !687, !688, !689, !690, !691, !692, !700, !704, !719, !728, !735, !745}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !683, file: !644, line: 100, baseType: !686, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !683, file: !644, line: 100, baseType: !686, size: 64, offset: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !683, file: !644, line: 101, baseType: !7, size: 32, offset: 128)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !683, file: !644, line: 101, baseType: !7, size: 32, offset: 160)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !683, file: !644, line: 102, baseType: !7, size: 32, offset: 192)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !683, file: !644, line: 102, baseType: !7, size: 32, offset: 224)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !683, file: !644, line: 103, baseType: !693, size: 64, offset: 256)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !644, line: 59, baseType: !695)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !644, line: 56, size: 2112, elements: !696)
!696 = !{!697, !698, !699}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !695, file: !644, line: 57, baseType: !250, size: 2048)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !695, file: !644, line: 58, baseType: !7, size: 32, offset: 2048)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !695, file: !644, line: 58, baseType: !7, size: 32, offset: 2080)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !683, file: !644, line: 106, baseType: !701, size: 6144, offset: 320)
!701 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 6144, elements: !702)
!702 = !{!703}
!703 = !DISubrange(count: 768)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !683, file: !644, line: 107, baseType: !705, size: 64, offset: 6464)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !644, line: 97, baseType: !707)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !644, line: 83, size: 8320, elements: !708)
!708 = !{!709, !710, !711, !715, !716, !717, !718}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !707, file: !644, line: 84, baseType: !701, size: 6144)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !707, file: !644, line: 87, baseType: !250, size: 2048, offset: 6144)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !707, file: !644, line: 88, baseType: !712, size: 64, offset: 8192)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !714, line: 41, flags: DIFlagFwdDecl)
!714 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!715 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !707, file: !644, line: 90, baseType: !241, size: 16, offset: 8256)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !707, file: !644, line: 92, baseType: !241, size: 16, offset: 8272)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !707, file: !644, line: 93, baseType: !241, size: 16, offset: 8288)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !707, file: !644, line: 95, baseType: !241, size: 16, offset: 8304)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !683, file: !644, line: 108, baseType: !720, size: 64, offset: 6528)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !644, line: 66, baseType: !722)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !644, line: 61, size: 128, elements: !723)
!723 = !{!724, !725, !726, !727}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !722, file: !644, line: 62, baseType: !7, size: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !722, file: !644, line: 63, baseType: !7, size: 32, offset: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !722, file: !644, line: 64, baseType: !7, size: 32, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !722, file: !644, line: 65, baseType: !7, size: 32, offset: 96)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !683, file: !644, line: 109, baseType: !729, size: 64, offset: 6592)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !644, line: 71, baseType: !731)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !644, line: 68, size: 64, elements: !732)
!732 = !{!733, !734}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !731, file: !644, line: 69, baseType: !7, size: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !731, file: !644, line: 70, baseType: !7, size: 32, offset: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !683, file: !644, line: 110, baseType: !736, size: 64, offset: 6656)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !644, line: 81, baseType: !738)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !644, line: 73, size: 352, elements: !739)
!739 = !{!740, !741, !742, !743, !744}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !738, file: !644, line: 74, baseType: !305, size: 96)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !738, file: !644, line: 75, baseType: !305, size: 96, offset: 96)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !738, file: !644, line: 76, baseType: !305, size: 96, offset: 192)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !738, file: !644, line: 77, baseType: !7, size: 32, offset: 288)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !738, file: !644, line: 78, baseType: !7, size: 32, offset: 320)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !683, file: !644, line: 113, baseType: !746, size: 512, offset: 6720)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !747, line: 182, baseType: !748)
!747 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !747, line: 180, size: 512, elements: !749)
!749 = !{!750}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !748, file: !747, line: 181, baseType: !225, size: 512)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !653, file: !644, line: 148, baseType: !752, size: 64, offset: 1408)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !540, line: 46, flags: DIFlagFwdDecl)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !653, file: !644, line: 151, baseType: !464, size: 64, offset: 1472)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !653, file: !644, line: 152, baseType: !538, size: 64, offset: 1536)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !653, file: !644, line: 153, baseType: !757, size: 64, offset: 1600)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !759, line: 64, size: 19136, elements: !760)
!759 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!760 = !{!761, !762, !763, !764, !765, !766, !768, !769, !770, !771, !774, !775, !1022, !1023, !1031, !1032, !1033, !1034, !1035}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !758, file: !759, line: 65, baseType: !401, size: 960)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !758, file: !759, line: 66, baseType: !470, size: 64, offset: 960)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !758, file: !759, line: 68, baseType: !420, size: 8192, offset: 1024)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !758, file: !759, line: 70, baseType: !7, size: 32, offset: 9216)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !758, file: !759, line: 71, baseType: !7, size: 32, offset: 9248)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !758, file: !759, line: 72, baseType: !767, size: 64, offset: 9280)
!767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !292)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !758, file: !759, line: 74, baseType: !255, size: 32, offset: 9344)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !758, file: !759, line: 74, baseType: !255, size: 32, offset: 9376)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !758, file: !759, line: 76, baseType: !712, size: 64, offset: 9408)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !758, file: !759, line: 77, baseType: !772, size: 64, offset: 9472)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !759, line: 77, flags: DIFlagFwdDecl)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !758, file: !759, line: 78, baseType: !589, size: 64, offset: 9536)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !758, file: !759, line: 80, baseType: !776, size: 2624, offset: 9600)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !777, line: 340, size: 2624, elements: !778)
!777 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!778 = !{!779, !807, !825, !826, !827, !844, !902, !903, !1002, !1003, !1004, !1005, !1011}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !776, file: !777, line: 341, baseType: !780, size: 576)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !777, line: 251, baseType: !781)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !777, line: 207, size: 576, elements: !782)
!782 = !{!783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !781, file: !777, line: 208, baseType: !7, size: 32)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !781, file: !777, line: 211, baseType: !241, size: 16, offset: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !781, file: !777, line: 212, baseType: !241, size: 16, offset: 48)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !781, file: !777, line: 213, baseType: !255, size: 32, offset: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !781, file: !777, line: 214, baseType: !241, size: 16, offset: 96)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !781, file: !777, line: 215, baseType: !241, size: 16, offset: 112)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !781, file: !777, line: 216, baseType: !241, size: 16, offset: 128)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !781, file: !777, line: 217, baseType: !241, size: 16, offset: 144)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !781, file: !777, line: 218, baseType: !241, size: 16, offset: 160)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !781, file: !777, line: 219, baseType: !241, size: 16, offset: 176)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !781, file: !777, line: 220, baseType: !255, size: 32, offset: 192)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !781, file: !777, line: 222, baseType: !241, size: 16, offset: 224)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !781, file: !777, line: 225, baseType: !241, size: 16, offset: 240)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !781, file: !777, line: 228, baseType: !7, size: 32, offset: 256)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !781, file: !777, line: 229, baseType: !7, size: 32, offset: 288)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !781, file: !777, line: 233, baseType: !7, size: 32, offset: 320)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !781, file: !777, line: 236, baseType: !241, size: 16, offset: 352)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !781, file: !777, line: 236, baseType: !241, size: 16, offset: 368)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !781, file: !777, line: 241, baseType: !255, size: 32, offset: 384)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !781, file: !777, line: 244, baseType: !7, size: 32, offset: 416)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !781, file: !777, line: 244, baseType: !7, size: 32, offset: 448)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !781, file: !777, line: 245, baseType: !255, size: 32, offset: 480)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !781, file: !777, line: 248, baseType: !255, size: 32, offset: 512)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !781, file: !777, line: 250, baseType: !7, size: 32, offset: 544)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !776, file: !777, line: 342, baseType: !808, size: 448, offset: 576)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !777, line: 79, baseType: !809)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !777, line: 61, size: 448, elements: !810)
!810 = !{!811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !809, file: !777, line: 62, baseType: !220, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !809, file: !777, line: 64, baseType: !241, size: 16, offset: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !809, file: !777, line: 65, baseType: !241, size: 16, offset: 80)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !809, file: !777, line: 67, baseType: !255, size: 32, offset: 96)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !809, file: !777, line: 68, baseType: !255, size: 32, offset: 128)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !809, file: !777, line: 69, baseType: !255, size: 32, offset: 160)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !809, file: !777, line: 70, baseType: !241, size: 16, offset: 192)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !809, file: !777, line: 71, baseType: !241, size: 16, offset: 208)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !809, file: !777, line: 72, baseType: !291, size: 64, offset: 224)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !809, file: !777, line: 75, baseType: !255, size: 32, offset: 288)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !809, file: !777, line: 75, baseType: !255, size: 32, offset: 320)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !809, file: !777, line: 75, baseType: !255, size: 32, offset: 352)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !809, file: !777, line: 78, baseType: !255, size: 32, offset: 384)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !809, file: !777, line: 78, baseType: !255, size: 32, offset: 416)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !776, file: !777, line: 343, baseType: !215, size: 128, offset: 1024)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !776, file: !777, line: 344, baseType: !215, size: 128, offset: 1152)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !776, file: !777, line: 345, baseType: !828, size: 192, offset: 1280)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !777, line: 278, baseType: !829)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !777, line: 270, size: 192, elements: !830)
!830 = !{!831, !832, !833, !834, !835}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !829, file: !777, line: 271, baseType: !7, size: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !829, file: !777, line: 273, baseType: !255, size: 32, offset: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !829, file: !777, line: 275, baseType: !7, size: 32, offset: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !829, file: !777, line: 276, baseType: !7, size: 32, offset: 96)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !829, file: !777, line: 277, baseType: !836, size: 64, offset: 128)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !777, line: 55, size: 576, elements: !838)
!838 = !{!839, !840, !841}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !837, file: !777, line: 56, baseType: !7, size: 32)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !837, file: !777, line: 57, baseType: !255, size: 32, offset: 32)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !837, file: !777, line: 58, baseType: !842, size: 512, offset: 64)
!842 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 512, elements: !843)
!843 = !{!237, !237}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !776, file: !777, line: 346, baseType: !845, size: 384, offset: 1472)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !777, line: 268, baseType: !846)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !777, line: 253, size: 384, elements: !847)
!847 = !{!848, !849, !850, !851, !852, !896, !897, !898, !899, !900, !901}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !846, file: !777, line: 254, baseType: !7, size: 32)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !846, file: !777, line: 255, baseType: !7, size: 32, offset: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !846, file: !777, line: 255, baseType: !7, size: 32, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !846, file: !777, line: 258, baseType: !255, size: 32, offset: 96)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !846, file: !777, line: 259, baseType: !853, size: 64, offset: 128)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !777, line: 164, baseType: !855)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !777, line: 108, size: 1664, elements: !856)
!856 = !{!857, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !855, file: !777, line: 109, baseType: !858, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !855, file: !777, line: 109, baseType: !858, size: 64, offset: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !855, file: !777, line: 111, baseType: !225, size: 512, offset: 128)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !855, file: !777, line: 119, baseType: !291, size: 64, offset: 640)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !855, file: !777, line: 119, baseType: !291, size: 64, offset: 704)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !855, file: !777, line: 125, baseType: !291, size: 64, offset: 768)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !855, file: !777, line: 125, baseType: !291, size: 64, offset: 832)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !855, file: !777, line: 127, baseType: !291, size: 64, offset: 896)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !855, file: !777, line: 130, baseType: !7, size: 32, offset: 960)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !855, file: !777, line: 131, baseType: !7, size: 32, offset: 992)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !855, file: !777, line: 132, baseType: !869, size: 64, offset: 1024)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !777, line: 106, baseType: !871)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !777, line: 81, size: 512, elements: !872)
!872 = !{!873, !874, !877, !878, !879, !880}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !871, file: !777, line: 82, baseType: !291, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !871, file: !777, line: 97, baseType: !875, size: 256, offset: 64)
!875 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 256, elements: !876)
!876 = !{!237, !293}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !871, file: !777, line: 102, baseType: !291, size: 64, offset: 320)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !871, file: !777, line: 102, baseType: !291, size: 64, offset: 384)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !871, file: !777, line: 104, baseType: !7, size: 32, offset: 448)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !871, file: !777, line: 105, baseType: !7, size: 32, offset: 480)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !855, file: !777, line: 135, baseType: !305, size: 96, offset: 1088)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !855, file: !777, line: 136, baseType: !255, size: 32, offset: 1184)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !855, file: !777, line: 139, baseType: !7, size: 32, offset: 1216)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !855, file: !777, line: 139, baseType: !7, size: 32, offset: 1248)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !855, file: !777, line: 139, baseType: !7, size: 32, offset: 1280)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !855, file: !777, line: 140, baseType: !305, size: 96, offset: 1312)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !855, file: !777, line: 143, baseType: !241, size: 16, offset: 1408)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !855, file: !777, line: 144, baseType: !241, size: 16, offset: 1424)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !855, file: !777, line: 145, baseType: !241, size: 16, offset: 1440)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !855, file: !777, line: 148, baseType: !241, size: 16, offset: 1456)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !855, file: !777, line: 149, baseType: !7, size: 32, offset: 1472)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !855, file: !777, line: 150, baseType: !255, size: 32, offset: 1504)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !855, file: !777, line: 152, baseType: !589, size: 64, offset: 1536)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !855, file: !777, line: 163, baseType: !255, size: 32, offset: 1600)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !855, file: !777, line: 163, baseType: !255, size: 32, offset: 1632)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !846, file: !777, line: 261, baseType: !255, size: 32, offset: 192)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !846, file: !777, line: 261, baseType: !255, size: 32, offset: 224)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !846, file: !777, line: 261, baseType: !255, size: 32, offset: 256)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !846, file: !777, line: 263, baseType: !7, size: 32, offset: 288)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !846, file: !777, line: 266, baseType: !7, size: 32, offset: 320)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !846, file: !777, line: 267, baseType: !255, size: 32, offset: 352)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !776, file: !777, line: 347, baseType: !853, size: 64, offset: 1856)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !776, file: !777, line: 348, baseType: !904, size: 64, offset: 1920)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !777, line: 205, baseType: !906)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !777, line: 186, size: 1024, elements: !907)
!907 = !{!908, !910, !911, !912, !914, !915, !916, !924, !925, !926, !1000, !1001}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !906, file: !777, line: 187, baseType: !909, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !906, file: !777, line: 187, baseType: !909, size: 64, offset: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !906, file: !777, line: 189, baseType: !225, size: 512, offset: 128)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !906, file: !777, line: 191, baseType: !913, size: 64, offset: 640)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !906, file: !777, line: 193, baseType: !7, size: 32, offset: 704)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !906, file: !777, line: 193, baseType: !7, size: 32, offset: 736)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !906, file: !777, line: 195, baseType: !917, size: 64, offset: 768)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !777, line: 184, baseType: !919)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !777, line: 166, size: 320, elements: !920)
!920 = !{!921, !922, !923}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !919, file: !777, line: 180, baseType: !875, size: 256)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !919, file: !777, line: 182, baseType: !7, size: 32, offset: 256)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !919, file: !777, line: 183, baseType: !7, size: 32, offset: 288)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !906, file: !777, line: 196, baseType: !7, size: 32, offset: 832)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !906, file: !777, line: 198, baseType: !7, size: 32, offset: 864)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !906, file: !777, line: 200, baseType: !927, size: 64, offset: 896)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !714, line: 77, size: 15424, elements: !929)
!929 = !{!930, !931, !932, !935, !938, !939, !942, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !960, !961, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !986, !987, !988, !989, !990, !994}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !928, file: !714, line: 78, baseType: !401, size: 960)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !928, file: !714, line: 80, baseType: !420, size: 8192, offset: 960)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !928, file: !714, line: 82, baseType: !933, size: 64, offset: 9152)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !714, line: 43, flags: DIFlagFwdDecl)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !928, file: !714, line: 83, baseType: !936, size: 64, offset: 9216)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !402, line: 46, flags: DIFlagFwdDecl)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !928, file: !714, line: 86, baseType: !712, size: 64, offset: 9280)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !928, file: !714, line: 87, baseType: !940, size: 64, offset: 9344)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !714, line: 44, flags: DIFlagFwdDecl)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !928, file: !714, line: 89, baseType: !943, size: 512, offset: 9408)
!943 = !DICompositeType(tag: DW_TAG_array_type, baseType: !940, size: 512, elements: !326)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !928, file: !714, line: 90, baseType: !241, size: 16, offset: 9920)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !928, file: !714, line: 90, baseType: !241, size: 16, offset: 9936)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !928, file: !714, line: 92, baseType: !241, size: 16, offset: 9952)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !928, file: !714, line: 92, baseType: !241, size: 16, offset: 9968)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !928, file: !714, line: 93, baseType: !241, size: 16, offset: 9984)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !928, file: !714, line: 93, baseType: !241, size: 16, offset: 10000)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !928, file: !714, line: 94, baseType: !7, size: 32, offset: 10016)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !928, file: !714, line: 97, baseType: !241, size: 16, offset: 10048)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !928, file: !714, line: 97, baseType: !241, size: 16, offset: 10064)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !928, file: !714, line: 98, baseType: !241, size: 16, offset: 10080)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !928, file: !714, line: 98, baseType: !241, size: 16, offset: 10096)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !928, file: !714, line: 99, baseType: !241, size: 16, offset: 10112)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !928, file: !714, line: 99, baseType: !241, size: 16, offset: 10128)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !928, file: !714, line: 100, baseType: !25, size: 32, offset: 10144)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !928, file: !714, line: 101, baseType: !959, size: 64, offset: 10176)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !928, file: !714, line: 103, baseType: !426, size: 64, offset: 10240)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !928, file: !714, line: 104, baseType: !962, size: 64, offset: 10304)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !402, line: 159, size: 448, elements: !964)
!964 = !{!965, !967, !968, !970, !971, !973}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !963, file: !402, line: 161, baseType: !966, size: 64)
!966 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 64, elements: !292)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !963, file: !402, line: 162, baseType: !966, size: 64, offset: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !963, file: !402, line: 163, baseType: !969, size: 32, offset: 128)
!969 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 32, elements: !292)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !963, file: !402, line: 164, baseType: !969, size: 32, offset: 160)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !963, file: !402, line: 165, baseType: !972, size: 128, offset: 192)
!972 = !DICompositeType(tag: DW_TAG_array_type, baseType: !959, size: 128, elements: !292)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !963, file: !402, line: 166, baseType: !974, size: 128, offset: 320)
!974 = !DICompositeType(tag: DW_TAG_array_type, baseType: !936, size: 128, elements: !292)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !928, file: !714, line: 107, baseType: !255, size: 32, offset: 10368)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !928, file: !714, line: 108, baseType: !7, size: 32, offset: 10400)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !928, file: !714, line: 109, baseType: !241, size: 16, offset: 10432)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !928, file: !714, line: 110, baseType: !241, size: 16, offset: 10448)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !928, file: !714, line: 113, baseType: !7, size: 32, offset: 10464)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !928, file: !714, line: 113, baseType: !7, size: 32, offset: 10496)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !928, file: !714, line: 114, baseType: !226, size: 8, offset: 10528)
