; ModuleID = 'blender/source/blender/blenkernel/intern/pbvh_bmesh.c'
source_filename = "blender/source/blender/blenkernel/intern/pbvh_bmesh.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PBVHNode = type { %struct.GPU_PBVH_Buffers*, %struct.BB, %struct.BB, i32, i32*, i32, i32*, i32, i32, [4 x i32]*, i16, float, float*, i32, %struct.PBVHProxyNode*, %struct.GSet*, %struct.GSet*, %struct.GSet*, [3 x float]*, [3 x i32]*, i32 }
%struct.GPU_PBVH_Buffers = type opaque
%struct.BB = type { [3 x float], [3 x float] }
%struct.PBVHProxyNode = type { [3 x float]* }
%struct.GSet = type opaque
%struct.GSetIterator = type { %struct.GHashIterator }
%struct.GHashIterator = type { %struct.GHash*, %struct.Entry*, i32 }
%struct.GHash = type opaque
%struct.Entry = type opaque
%struct.BMFace = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMLoop*, i32, [3 x float], i16 }
%struct.BMHeader = type { i8*, i32, i8, i8, i8 }
%struct.BMFlagLayer = type { i16 }
%struct.BMLoop = type { %struct.BMHeader, %struct.BMVert*, %struct.BMEdge*, %struct.BMFace*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop* }
%struct.BMVert = type { %struct.BMHeader, %struct.BMFlagLayer*, [3 x float], [3 x float], %struct.BMEdge* }
%struct.BMEdge = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMVert*, %struct.BMVert*, %struct.BMLoop*, %struct.BMDiskLink, %struct.BMDiskLink }

!96 = !{!97, !98, !99}
!97 = !DIEnumerator(name: "BLI_BUFFER_NOP", value: 0, isUnsigned: true)
!98 = !DIEnumerator(name: "BLI_BUFFER_USE_STATIC", value: 1, isUnsigned: true)
!99 = !DIEnumerator(name: "BLI_BUFFER_USE_CALLOC", value: 2, isUnsigned: true)
!100 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !101, line: 76, baseType: !5, size: 32, elements: !102)
!101 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!102 = !{!103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143}
!103 = !DIEnumerator(name: "CD_MVERT", value: 0, isUnsigned: true)
!104 = !DIEnumerator(name: "CD_MSTICKY", value: 1, isUnsigned: true)
!105 = !DIEnumerator(name: "CD_MDEFORMVERT", value: 2, isUnsigned: true)
!106 = !DIEnumerator(name: "CD_MEDGE", value: 3, isUnsigned: true)
!107 = !DIEnumerator(name: "CD_MFACE", value: 4, isUnsigned: true)
!108 = !DIEnumerator(name: "CD_MTFACE", value: 5, isUnsigned: true)
!109 = !DIEnumerator(name: "CD_MCOL", value: 6, isUnsigned: true)
!110 = !DIEnumerator(name: "CD_ORIGINDEX", value: 7, isUnsigned: true)
!111 = !DIEnumerator(name: "CD_NORMAL", value: 8, isUnsigned: true)
!112 = !DIEnumerator(name: "CD_PROP_FLT", value: 10, isUnsigned: true)
!113 = !DIEnumerator(name: "CD_PROP_INT", value: 11, isUnsigned: true)
!114 = !DIEnumerator(name: "CD_PROP_STR", value: 12, isUnsigned: true)
!115 = !DIEnumerator(name: "CD_ORIGSPACE", value: 13, isUnsigned: true)
!116 = !DIEnumerator(name: "CD_ORCO", value: 14, isUnsigned: true)
!117 = !DIEnumerator(name: "CD_MTEXPOLY", value: 15, isUnsigned: true)
!118 = !DIEnumerator(name: "CD_MLOOPUV", value: 16, isUnsigned: true)
!119 = !DIEnumerator(name: "CD_MLOOPCOL", value: 17, isUnsigned: true)
!120 = !DIEnumerator(name: "CD_TANGENT", value: 18, isUnsigned: true)
!121 = !DIEnumerator(name: "CD_MDISPS", value: 19, isUnsigned: true)
!122 = !DIEnumerator(name: "CD_PREVIEW_MCOL", value: 20, isUnsigned: true)
!123 = !DIEnumerator(name: "CD_ID_MCOL", value: 21, isUnsigned: true)
!124 = !DIEnumerator(name: "CD_TEXTURE_MCOL", value: 22, isUnsigned: true)
!125 = !DIEnumerator(name: "CD_CLOTH_ORCO", value: 23, isUnsigned: true)
!126 = !DIEnumerator(name: "CD_RECAST", value: 24, isUnsigned: true)
!127 = !DIEnumerator(name: "CD_MPOLY", value: 25, isUnsigned: true)
!128 = !DIEnumerator(name: "CD_MLOOP", value: 26, isUnsigned: true)
!129 = !DIEnumerator(name: "CD_SHAPE_KEYINDEX", value: 27, isUnsigned: true)
!130 = !DIEnumerator(name: "CD_SHAPEKEY", value: 28, isUnsigned: true)
!131 = !DIEnumerator(name: "CD_BWEIGHT", value: 29, isUnsigned: true)
!132 = !DIEnumerator(name: "CD_CREASE", value: 30, isUnsigned: true)
!133 = !DIEnumerator(name: "CD_ORIGSPACE_MLOOP", value: 31, isUnsigned: true)
!134 = !DIEnumerator(name: "CD_PREVIEW_MLOOPCOL", value: 32, isUnsigned: true)
!135 = !DIEnumerator(name: "CD_BM_ELEM_PYPTR", value: 33, isUnsigned: true)
!136 = !DIEnumerator(name: "CD_PAINT_MASK", value: 34, isUnsigned: true)
!137 = !DIEnumerator(name: "CD_GRID_PAINT_MASK", value: 35, isUnsigned: true)
!138 = !DIEnumerator(name: "CD_MVERT_SKIN", value: 36, isUnsigned: true)
!139 = !DIEnumerator(name: "CD_FREESTYLE_EDGE", value: 37, isUnsigned: true)
!140 = !DIEnumerator(name: "CD_FREESTYLE_FACE", value: 38, isUnsigned: true)
!141 = !DIEnumerator(name: "CD_MLOOPTANGENT", value: 39, isUnsigned: true)
!142 = !DIEnumerator(name: "CD_TESSLOOPNORMAL", value: 40, isUnsigned: true)
!143 = !DIEnumerator(name: "CD_NUMTYPES", value: 41, isUnsigned: true)
!144 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !145, line: 83, baseType: !5, size: 32, elements: !146)
!145 = !DIFile(filename: "blender/source/blender/blenlib/BLI_mempool.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!146 = !{!147, !148}
!147 = !DIEnumerator(name: "BLI_MEMPOOL_NOP", value: 0, isUnsigned: true)
!148 = !DIEnumerator(name: "BLI_MEMPOOL_ALLOW_ITER", value: 1, isUnsigned: true)
!149 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMCreateFlag", file: !150, line: 33, baseType: !5, size: 32, elements: !151)
!150 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_core.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!151 = !{!152, !153, !154}
!152 = !DIEnumerator(name: "BM_CREATE_NOP", value: 0, isUnsigned: true)
!153 = !DIEnumerator(name: "BM_CREATE_NO_DOUBLE", value: 2, isUnsigned: true)
!154 = !DIEnumerator(name: "BM_CREATE_SKIP_CD", value: 4, isUnsigned: true)
!155 = !{!156, !157, !163, !170, !176, !178, !180, !181, !185, !189, !253, !255, !237, !257, !263, !264, !265, !270}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashIterator", file: !159, line: 54, baseType: !160)
!159 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GHashIterator", file: !159, line: 50, size: 192, elements: !161)
!161 = !{!162, !166, !169}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "gh", scope: !160, file: !159, line: 51, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !159, line: 48, baseType: !165)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !159, line: 48, flags: DIFlagFwdDecl)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "curEntry", scope: !160, file: !159, line: 52, baseType: !167, size: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry", file: !159, line: 52, flags: DIFlagFwdDecl)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "curBucket", scope: !160, file: !159, line: 53, baseType: !5, size: 32, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_gh_Entry", file: !159, line: 94, size: 192, elements: !172)
!172 = !{!173, !174, !175}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !171, file: !159, line: 94, baseType: !156, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !171, file: !159, line: 94, baseType: !156, size: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !171, file: !159, line: 94, baseType: !156, size: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !74, line: 79, baseType: !73)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !74, line: 158, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{null, !156}
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !74, line: 159, baseType: !186)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{!156, !156}
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !17, line: 103, baseType: !191)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !17, line: 90, size: 448, elements: !192)
!192 = !{!193, !202, !208, !213, !214}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !191, file: !17, line: 91, baseType: !194, size: 128)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !17, line: 82, baseType: !195)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !17, line: 64, size: 128, elements: !196)
!196 = !{!197, !198, !199, !200, !201}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !195, file: !17, line: 65, baseType: !156, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !195, file: !17, line: 66, baseType: !177, size: 32, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !195, file: !17, line: 73, baseType: !179, size: 8, offset: 96)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !195, file: !17, line: 74, baseType: !179, size: 8, offset: 104)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !195, file: !17, line: 80, baseType: !179, size: 8, offset: 112)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !191, file: !17, line: 92, baseType: !203, size: 64, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !17, line: 180, size: 16, elements: !205)
!205 = !{!206}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !204, file: !17, line: 181, baseType: !207, size: 16)
!207 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !191, file: !17, line: 94, baseType: !209, size: 96, offset: 192)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 96, elements: !211)
!210 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!211 = !{!212}
!212 = !DISubrange(count: 3)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !191, file: !17, line: 95, baseType: !209, size: 96, offset: 288)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !191, file: !17, line: 102, baseType: !215, size: 64, offset: 384)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !17, line: 110, size: 640, elements: !217)
!217 = !{!218, !219, !220, !222, !223, !246, !252}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !216, file: !17, line: 111, baseType: !194, size: 128)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !216, file: !17, line: 112, baseType: !203, size: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !216, file: !17, line: 114, baseType: !221, size: 64, offset: 192)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !216, file: !17, line: 114, baseType: !221, size: 64, offset: 256)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !216, file: !17, line: 118, baseType: !224, size: 64, offset: 320)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !17, line: 125, size: 576, elements: !226)
!226 = !{!227, !228, !229, !230, !242, !243, !244, !245}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !225, file: !17, line: 126, baseType: !194, size: 128)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !225, file: !17, line: 129, baseType: !221, size: 64, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !225, file: !17, line: 130, baseType: !215, size: 64, offset: 192)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !225, file: !17, line: 131, baseType: !231, size: 64, offset: 256)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !17, line: 164, size: 448, elements: !233)
!233 = !{!234, !235, !236, !239, !240, !241}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !232, file: !17, line: 165, baseType: !194, size: 128)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !232, file: !17, line: 166, baseType: !203, size: 64, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !232, file: !17, line: 172, baseType: !237, size: 64, offset: 192)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !17, line: 140, baseType: !225)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !232, file: !17, line: 174, baseType: !177, size: 32, offset: 256)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !232, file: !17, line: 175, baseType: !209, size: 96, offset: 288)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !232, file: !17, line: 176, baseType: !207, size: 16, offset: 384)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !225, file: !17, line: 135, baseType: !224, size: 64, offset: 320)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !225, file: !17, line: 135, baseType: !224, size: 64, offset: 384)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !225, file: !17, line: 139, baseType: !224, size: 64, offset: 448)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !225, file: !17, line: 139, baseType: !224, size: 64, offset: 512)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !216, file: !17, line: 122, baseType: !247, size: 128, offset: 384)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !17, line: 108, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !17, line: 106, size: 128, elements: !249)
!249 = !{!250, !251}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !248, file: !17, line: 107, baseType: !215, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !248, file: !17, line: 107, baseType: !215, size: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !216, file: !17, line: 122, baseType: !247, size: 128, offset: 512)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !17, line: 123, baseType: !216)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !17, line: 178, baseType: !232)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "BB", file: !32, line: 31, baseType: !259)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !32, line: 29, size: 192, elements: !260)
!260 = !{!261, !262}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "bmin", scope: !259, file: !32, line: 30, baseType: !209, size: 96)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "bmax", scope: !259, file: !32, line: 30, baseType: !209, size: 96, offset: 96)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMElem", file: !17, line: 154, baseType: !267)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMElem", file: !17, line: 152, size: 128, elements: !268)
!268 = !{!269}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !267, file: !17, line: 153, baseType: !194, size: 128)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!271 = !{i32 7, !"Dwarf Version", i32 4}
!272 = !{i32 2, !"Debug Info Version", i32 3}
!273 = !{i32 1, !"wchar_size", i32 4}
!274 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!275 = distinct !DISubprogram(name: "pbvh_bmesh_node_raycast", scope: !1, file: !1, line: 1078, type: !276, scopeLine: 1081, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !325)
!276 = !DISubroutineType(types: !277)
!277 = !{!278, !279, !323, !323, !263, !278}
!278 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "PBVHNode", file: !4, line: 47, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PBVHNode", file: !32, line: 40, size: 1472, elements: !282)
!282 = !{!283, !287, !288, !289, !290, !291, !292, !293, !294, !295, !300, !302, !303, !304, !305, !312, !316, !317, !318, !319, !322}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buffers", scope: !281, file: !32, line: 42, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPU_PBVH_Buffers", file: !286, line: 168, flags: DIFlagFwdDecl)
!286 = !DIFile(filename: "blender/source/blender/gpu/GPU_buffers.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!287 = !DIDerivedType(tag: DW_TAG_member, name: "vb", scope: !281, file: !32, line: 45, baseType: !258, size: 192, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "orig_vb", scope: !281, file: !32, line: 46, baseType: !258, size: 192, offset: 256)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "children_offset", scope: !281, file: !32, line: 50, baseType: !177, size: 32, offset: 448)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "prim_indices", scope: !281, file: !32, line: 57, baseType: !176, size: 64, offset: 512)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "totprim", scope: !281, file: !32, line: 58, baseType: !5, size: 32, offset: 576)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "vert_indices", scope: !281, file: !32, line: 79, baseType: !176, size: 64, offset: 640)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "uniq_verts", scope: !281, file: !32, line: 80, baseType: !5, size: 32, offset: 704)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "face_verts", scope: !281, file: !32, line: 80, baseType: !5, size: 32, offset: 736)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "face_vert_indices", scope: !281, file: !32, line: 91, baseType: !296, size: 64, offset: 768)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 128, elements: !298)
!298 = !{!299}
!299 = !DISubrange(count: 4)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !281, file: !32, line: 95, baseType: !301, size: 16, offset: 832, flags: DIFlagBitField, extraData: i64 832)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "PBVHNodeFlags", file: !4, line: 165, baseType: !3)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "tmin", scope: !281, file: !32, line: 98, baseType: !210, size: 32, offset: 864)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "layer_disp", scope: !281, file: !32, line: 101, baseType: !263, size: 64, offset: 896)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_count", scope: !281, file: !32, line: 103, baseType: !177, size: 32, offset: 960)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "proxies", scope: !281, file: !32, line: 104, baseType: !306, size: 64, offset: 1024)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "PBVHProxyNode", file: !4, line: 51, baseType: !308)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 49, size: 64, elements: !309)
!309 = !{!310}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !308, file: !4, line: 50, baseType: !311, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "bm_faces", scope: !281, file: !32, line: 107, baseType: !313, size: 64, offset: 1088)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSet", file: !159, line: 176, baseType: !315)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "GSet", file: !159, line: 176, flags: DIFlagFwdDecl)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "bm_unique_verts", scope: !281, file: !32, line: 108, baseType: !313, size: 64, offset: 1152)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "bm_other_verts", scope: !281, file: !32, line: 109, baseType: !313, size: 64, offset: 1216)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "bm_orco", scope: !281, file: !32, line: 110, baseType: !311, size: 64, offset: 1280)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "bm_ortri", scope: !281, file: !32, line: 111, baseType: !320, size: 64, offset: 1344)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 96, elements: !211)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "bm_tot_ortri", scope: !281, file: !32, line: 112, baseType: !177, size: 32, offset: 1408)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !210)
!325 = !{}
!326 = !DILocalVariable(name: "node", arg: 1, scope: !275, file: !1, line: 1078, type: !279)
!327 = !DILocation(line: 1078, column: 40, scope: !275)
!328 = !DILocalVariable(name: "ray_start", arg: 2, scope: !275, file: !1, line: 1078, type: !323)
!329 = !DILocation(line: 1078, column: 58, scope: !275)
!330 = !DILocalVariable(name: "ray_normal", arg: 3, scope: !275, file: !1, line: 1079, type: !323)
!331 = !DILocation(line: 1079, column: 41, scope: !275)
!332 = !DILocalVariable(name: "dist", arg: 4, scope: !275, file: !1, line: 1079, type: !263)
!333 = !DILocation(line: 1079, column: 63, scope: !275)
!334 = !DILocalVariable(name: "use_original", arg: 5, scope: !275, file: !1, line: 1080, type: !278)
!335 = !DILocation(line: 1080, column: 34, scope: !275)
!336 = !DILocalVariable(name: "hit", scope: !275, file: !1, line: 1082, type: !278)
!337 = !DILocation(line: 1082, column: 7, scope: !275)
!338 = !DILocation(line: 1084, column: 6, scope: !339)
!339 = distinct !DILexicalBlock(scope: !275, file: !1, line: 1084, column: 6)
!340 = !DILocation(line: 1084, column: 19, scope: !339)
!341 = !DILocation(line: 1084, column: 22, scope: !339)
!342 = !DILocation(line: 1084, column: 28, scope: !339)
!343 = !DILocation(line: 1084, column: 6, scope: !275)
!344 = !DILocalVariable(name: "i", scope: !345, file: !1, line: 1085, type: !177)
!345 = distinct !DILexicalBlock(scope: !339, file: !1, line: 1084, column: 42)
!346 = !DILocation(line: 1085, column: 7, scope: !345)
!347 = !DILocation(line: 1086, column: 10, scope: !348)
!348 = distinct !DILexicalBlock(scope: !345, file: !1, line: 1086, column: 3)
!349 = !DILocation(line: 1086, column: 8, scope: !348)
!350 = !DILocation(line: 1086, column: 15, scope: !351)
!351 = distinct !DILexicalBlock(scope: !348, file: !1, line: 1086, column: 3)
!352 = !DILocation(line: 1086, column: 19, scope: !351)
!353 = !DILocation(line: 1086, column: 25, scope: !351)
!354 = !DILocation(line: 1086, column: 17, scope: !351)
!355 = !DILocation(line: 1086, column: 3, scope: !348)
!356 = !DILocalVariable(name: "t", scope: !357, file: !1, line: 1087, type: !358)
!357 = distinct !DILexicalBlock(scope: !351, file: !1, line: 1086, column: 44)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !177)
!360 = !DILocation(line: 1087, column: 15, scope: !357)
!361 = !DILocation(line: 1087, column: 19, scope: !357)
!362 = !DILocation(line: 1087, column: 25, scope: !357)
!363 = !DILocation(line: 1087, column: 34, scope: !357)
!364 = !DILocation(line: 1088, column: 33, scope: !357)
!365 = !DILocation(line: 1088, column: 44, scope: !357)
!366 = !DILocation(line: 1089, column: 33, scope: !357)
!367 = !DILocation(line: 1089, column: 39, scope: !357)
!368 = !DILocation(line: 1089, column: 47, scope: !357)
!369 = !DILocation(line: 1090, column: 33, scope: !357)
!370 = !DILocation(line: 1090, column: 39, scope: !357)
!371 = !DILocation(line: 1090, column: 47, scope: !357)
!372 = !DILocation(line: 1091, column: 33, scope: !357)
!373 = !DILocation(line: 1091, column: 39, scope: !357)
!374 = !DILocation(line: 1091, column: 47, scope: !357)
!375 = !DILocation(line: 1092, column: 39, scope: !357)
!376 = !DILocation(line: 1088, column: 11, scope: !357)
!377 = !DILocation(line: 1088, column: 8, scope: !357)
!378 = !DILocation(line: 1093, column: 3, scope: !357)
!379 = !DILocation(line: 1086, column: 40, scope: !351)
!380 = !DILocation(line: 1086, column: 3, scope: !351)
!381 = distinct !{!381, !355, !382}
!382 = !DILocation(line: 1093, column: 3, scope: !348)
!383 = !DILocation(line: 1094, column: 2, scope: !345)
!384 = !DILocalVariable(name: "gs_iter", scope: !385, file: !1, line: 1096, type: !386)
!385 = distinct !DILexicalBlock(scope: !339, file: !1, line: 1095, column: 7)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSetIterator", file: !159, line: 189, baseType: !387)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GSetIterator", file: !159, line: 183, size: 192, elements: !388)
!388 = !{!389}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_ghi", scope: !387, file: !159, line: 184, baseType: !158, size: 192)
!390 = !DILocation(line: 1096, column: 16, scope: !385)
!391 = !DILocation(line: 1098, column: 3, scope: !392)
!392 = distinct !DILexicalBlock(scope: !385, file: !1, line: 1098, column: 3)
!393 = !DILocation(line: 1098, column: 3, scope: !394)
!394 = distinct !DILexicalBlock(scope: !392, file: !1, line: 1098, column: 3)
!395 = !DILocalVariable(name: "f", scope: !396, file: !1, line: 1099, type: !255)
!396 = distinct !DILexicalBlock(scope: !394, file: !1, line: 1098, column: 39)
!397 = !DILocation(line: 1099, column: 12, scope: !396)
!398 = !DILocation(line: 1099, column: 16, scope: !396)
!399 = !DILocation(line: 1102, column: 9, scope: !400)
!400 = distinct !DILexicalBlock(scope: !396, file: !1, line: 1102, column: 8)
!401 = !DILocation(line: 1102, column: 8, scope: !396)
!402 = !DILocalVariable(name: "v_tri", scope: !403, file: !1, line: 1103, type: !404)
!403 = distinct !DILexicalBlock(scope: !400, file: !1, line: 1102, column: 47)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 192, elements: !211)
!405 = !DILocation(line: 1103, column: 13, scope: !403)
!406 = !DILocation(line: 1105, column: 31, scope: !403)
!407 = !DILocation(line: 1105, column: 34, scope: !403)
!408 = !DILocation(line: 1105, column: 5, scope: !403)
!409 = !DILocation(line: 1106, column: 34, scope: !403)
!410 = !DILocation(line: 1106, column: 45, scope: !403)
!411 = !DILocation(line: 1107, column: 34, scope: !403)
!412 = !DILocation(line: 1107, column: 44, scope: !403)
!413 = !DILocation(line: 1108, column: 34, scope: !403)
!414 = !DILocation(line: 1108, column: 44, scope: !403)
!415 = !DILocation(line: 1109, column: 34, scope: !403)
!416 = !DILocation(line: 1109, column: 44, scope: !403)
!417 = !DILocation(line: 1110, column: 40, scope: !403)
!418 = !DILocation(line: 1106, column: 12, scope: !403)
!419 = !DILocation(line: 1106, column: 9, scope: !403)
!420 = !DILocation(line: 1111, column: 4, scope: !403)
!421 = !DILocation(line: 1112, column: 3, scope: !396)
!422 = distinct !{!422, !391, !423}
!423 = !DILocation(line: 1112, column: 3, scope: !392)
!424 = !DILocation(line: 1115, column: 9, scope: !275)
!425 = !DILocation(line: 1115, column: 2, scope: !275)
!426 = distinct !DISubprogram(name: "BLI_gsetIterator_init", scope: !159, file: !159, line: 216, type: !427, scopeLine: 216, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !325)
!427 = !DISubroutineType(types: !428)
!428 = !{null, !429, !313}
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!430 = !DILocalVariable(name: "gsi", arg: 1, scope: !426, file: !159, line: 216, type: !429)
!431 = !DILocation(line: 216, column: 53, scope: !426)
!432 = !DILocalVariable(name: "gs", arg: 2, scope: !426, file: !159, line: 216, type: !313)
!433 = !DILocation(line: 216, column: 64, scope: !426)
!434 = !DILocation(line: 216, column: 110, scope: !426)
!435 = !DILocation(line: 216, column: 93, scope: !426)
!436 = !DILocation(line: 216, column: 124, scope: !426)
!437 = !DILocation(line: 216, column: 115, scope: !426)
!438 = !DILocation(line: 216, column: 70, scope: !426)
!439 = !DILocation(line: 216, column: 129, scope: !426)
!440 = distinct !DISubprogram(name: "BLI_gsetIterator_done", scope: !159, file: !159, line: 220, type: !441, scopeLine: 220, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !325)
!441 = !DISubroutineType(types: !442)
!442 = !{!278, !429}
!443 = !DILocalVariable(name: "gsi", arg: 1, scope: !440, file: !159, line: 220, type: !429)
!444 = !DILocation(line: 220, column: 53, scope: !440)
!445 = !DILocation(line: 220, column: 107, scope: !440)
!446 = !DILocation(line: 220, column: 90, scope: !440)
!447 = !DILocation(line: 220, column: 67, scope: !440)
!448 = !DILocation(line: 220, column: 60, scope: !440)
!449 = distinct !DISubprogram(name: "BLI_gsetIterator_getKey", scope: !159, file: !159, line: 218, type: !450, scopeLine: 218, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !325)
!450 = !DISubroutineType(types: !451)
!451 = !{!156, !429}
!452 = !DILocalVariable(name: "gsi", arg: 1, scope: !449, file: !159, line: 218, type: !429)
!453 = !DILocation(line: 218, column: 56, scope: !449)
!454 = !DILocation(line: 218, column: 112, scope: !449)
!455 = !DILocation(line: 218, column: 95, scope: !449)
!456 = !DILocation(line: 218, column: 70, scope: !449)
!457 = !DILocation(line: 218, column: 63, scope: !449)
!458 = distinct !DISubprogram(name: "_bm_elem_flag_test", scope: !459, file: !459, line: 42, type: !460, scopeLine: 43, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !325)
!459 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_inline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!460 = !DISubroutineType(types: !461)
!461 = !{!179, !462, !464}
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !194)
!464 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !179)
!465 = !DILocalVariable(name: "head", arg: 1, scope: !458, file: !459, line: 42, type: !462)
!466 = !DILocation(line: 42, column: 52, scope: !458)
!467 = !DILocalVariable(name: "hflag", arg: 2, scope: !458, file: !459, line: 42, type: !464)
!468 = !DILocation(line: 42, column: 69, scope: !458)
!469 = !DILocation(line: 44, column: 9, scope: !458)
!470 = !DILocation(line: 44, column: 15, scope: !458)
!471 = !DILocation(line: 44, column: 23, scope: !458)
!472 = !DILocation(line: 44, column: 21, scope: !458)
!473 = !DILocation(line: 44, column: 2, scope: !458)
!474 = distinct !DISubprogram(name: "BLI_gsetIterator_step", scope: !159, file: !159, line: 219, type: !475, scopeLine: 219, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !325)
!475 = !DISubroutineType(types: !476)
!476 = !{null, !429}
!477 = !DILocalVariable(name: "gsi", arg: 1, scope: !474, file: !159, line: 219, type: !429)
!478 = !DILocation(line: 219, column: 53, scope: !474)
!479 = !DILocation(line: 219, column: 100, scope: !474)
!480 = !DILocation(line: 219, column: 83, scope: !474)
!481 = !DILocation(line: 219, column: 60, scope: !474)
!482 = !DILocation(line: 219, column: 106, scope: !474)
!483 = distinct !DISubprogram(name: "BKE_pbvh_bmesh_node_raycast_detail", scope: !1, file: !1, line: 1118, type: !484, scopeLine: 1122, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !325)
!484 = !DISubroutineType(types: !485)
!485 = !{!278, !279, !323, !323, !263, !263}
!486 = !DILocalVariable(name: "node", arg: 1, scope: !483, file: !1, line: 1119, type: !279)
!487 = !DILocation(line: 1119, column: 19, scope: !483)
!488 = !DILocalVariable(name: "ray_start", arg: 2, scope: !483, file: !1, line: 1120, type: !323)
!489 = !DILocation(line: 1120, column: 21, scope: !483)
!490 = !DILocalVariable(name: "ray_normal", arg: 3, scope: !483, file: !1, line: 1120, type: !323)
!491 = !DILocation(line: 1120, column: 47, scope: !483)
!492 = !DILocalVariable(name: "detail", arg: 4, scope: !483, file: !1, line: 1121, type: !263)
!493 = !DILocation(line: 1121, column: 16, scope: !483)
!494 = !DILocalVariable(name: "dist", arg: 5, scope: !483, file: !1, line: 1121, type: !263)
!495 = !DILocation(line: 1121, column: 31, scope: !483)
!496 = !DILocalVariable(name: "gs_iter", scope: !483, file: !1, line: 1123, type: !386)
!497 = !DILocation(line: 1123, column: 15, scope: !483)
!498 = !DILocalVariable(name: "hit", scope: !483, file: !1, line: 1124, type: !278)
!499 = !DILocation(line: 1124, column: 7, scope: !483)
!500 = !DILocalVariable(name: "f_hit", scope: !483, file: !1, line: 1125, type: !255)
!501 = !DILocation(line: 1125, column: 10, scope: !483)
!502 = !DILocation(line: 1127, column: 6, scope: !503)
!503 = distinct !DILexicalBlock(scope: !483, file: !1, line: 1127, column: 6)
!504 = !DILocation(line: 1127, column: 12, scope: !503)
!505 = !DILocation(line: 1127, column: 17, scope: !503)
!506 = !DILocation(line: 1127, column: 6, scope: !483)
!507 = !DILocation(line: 1128, column: 3, scope: !503)
!508 = !DILocation(line: 1130, column: 2, scope: !509)
!509 = distinct !DILexicalBlock(scope: !483, file: !1, line: 1130, column: 2)
!510 = !DILocation(line: 1130, column: 2, scope: !511)
!511 = distinct !DILexicalBlock(scope: !509, file: !1, line: 1130, column: 2)
!512 = !DILocalVariable(name: "f", scope: !513, file: !1, line: 1131, type: !255)
!513 = distinct !DILexicalBlock(scope: !511, file: !1, line: 1130, column: 38)
!514 = !DILocation(line: 1131, column: 11, scope: !513)
!515 = !DILocation(line: 1131, column: 15, scope: !513)
!516 = !DILocation(line: 1134, column: 8, scope: !517)
!517 = distinct !DILexicalBlock(scope: !513, file: !1, line: 1134, column: 7)
!518 = !DILocation(line: 1134, column: 7, scope: !513)
!519 = !DILocalVariable(name: "v_tri", scope: !520, file: !1, line: 1135, type: !404)
!520 = distinct !DILexicalBlock(scope: !517, file: !1, line: 1134, column: 46)
!521 = !DILocation(line: 1135, column: 12, scope: !520)
!522 = !DILocalVariable(name: "hit_local", scope: !520, file: !1, line: 1136, type: !278)
!523 = !DILocation(line: 1136, column: 9, scope: !520)
!524 = !DILocation(line: 1137, column: 30, scope: !520)
!525 = !DILocation(line: 1137, column: 33, scope: !520)
!526 = !DILocation(line: 1137, column: 4, scope: !520)
!527 = !DILocation(line: 1139, column: 12, scope: !520)
!528 = !DILocation(line: 1139, column: 23, scope: !520)
!529 = !DILocation(line: 1140, column: 12, scope: !520)
!530 = !DILocation(line: 1140, column: 22, scope: !520)
!531 = !DILocation(line: 1141, column: 12, scope: !520)
!532 = !DILocation(line: 1141, column: 22, scope: !520)
!533 = !DILocation(line: 1142, column: 12, scope: !520)
!534 = !DILocation(line: 1142, column: 22, scope: !520)
!535 = !DILocation(line: 1143, column: 18, scope: !520)
!536 = !DILocation(line: 1138, column: 16, scope: !520)
!537 = !DILocation(line: 1138, column: 14, scope: !520)
!538 = !DILocation(line: 1145, column: 8, scope: !539)
!539 = distinct !DILexicalBlock(scope: !520, file: !1, line: 1145, column: 8)
!540 = !DILocation(line: 1145, column: 8, scope: !520)
!541 = !DILocation(line: 1146, column: 13, scope: !542)
!542 = distinct !DILexicalBlock(scope: !539, file: !1, line: 1145, column: 19)
!543 = !DILocation(line: 1146, column: 11, scope: !542)
!544 = !DILocation(line: 1147, column: 9, scope: !542)
!545 = !DILocation(line: 1148, column: 4, scope: !542)
!546 = !DILocation(line: 1149, column: 3, scope: !520)
!547 = !DILocation(line: 1150, column: 2, scope: !513)
!548 = distinct !{!548, !508, !549}
!549 = !DILocation(line: 1150, column: 2, scope: !509)
!550 = !DILocation(line: 1152, column: 6, scope: !551)
!551 = distinct !DILexicalBlock(scope: !483, file: !1, line: 1152, column: 6)
!552 = !DILocation(line: 1152, column: 6, scope: !483)
!553 = !DILocalVariable(name: "len1", scope: !554, file: !1, line: 1153, type: !210)
!554 = distinct !DILexicalBlock(scope: !551, file: !1, line: 1152, column: 11)
!555 = !DILocation(line: 1153, column: 9, scope: !554)
!556 = !DILocalVariable(name: "len2", scope: !554, file: !1, line: 1153, type: !210)
!557 = !DILocation(line: 1153, column: 15, scope: !554)
!558 = !DILocalVariable(name: "len3", scope: !554, file: !1, line: 1153, type: !210)
!559 = !DILocation(line: 1153, column: 21, scope: !554)
!560 = !DILocalVariable(name: "v_tri", scope: !554, file: !1, line: 1154, type: !404)
!561 = !DILocation(line: 1154, column: 11, scope: !554)
!562 = !DILocation(line: 1155, column: 29, scope: !554)
!563 = !DILocation(line: 1155, column: 36, scope: !554)
!564 = !DILocation(line: 1155, column: 3, scope: !554)
!565 = !DILocation(line: 1156, column: 27, scope: !554)
!566 = !DILocation(line: 1156, column: 37, scope: !554)
!567 = !DILocation(line: 1156, column: 41, scope: !554)
!568 = !DILocation(line: 1156, column: 51, scope: !554)
!569 = !DILocation(line: 1156, column: 10, scope: !554)
!570 = !DILocation(line: 1156, column: 8, scope: !554)
!571 = !DILocation(line: 1157, column: 27, scope: !554)
!572 = !DILocation(line: 1157, column: 37, scope: !554)
!573 = !DILocation(line: 1157, column: 41, scope: !554)
!574 = !DILocation(line: 1157, column: 51, scope: !554)
!575 = !DILocation(line: 1157, column: 10, scope: !554)
!576 = !DILocation(line: 1157, column: 8, scope: !554)
!577 = !DILocation(line: 1158, column: 27, scope: !554)
!578 = !DILocation(line: 1158, column: 37, scope: !554)
!579 = !DILocation(line: 1158, column: 41, scope: !554)
!580 = !DILocation(line: 1158, column: 51, scope: !554)
!581 = !DILocation(line: 1158, column: 10, scope: !554)
!582 = !DILocation(line: 1158, column: 8, scope: !554)
!583 = !DILocation(line: 1161, column: 27, scope: !554)
!584 = !DILocation(line: 1161, column: 33, scope: !554)
!585 = !DILocation(line: 1161, column: 39, scope: !554)
!586 = !DILocation(line: 1161, column: 19, scope: !554)
!587 = !DILocation(line: 1161, column: 13, scope: !554)
!588 = !DILocation(line: 1161, column: 4, scope: !554)
!589 = !DILocation(line: 1161, column: 11, scope: !554)
!590 = !DILocation(line: 1162, column: 2, scope: !554)
!591 = !DILocation(line: 1164, column: 9, scope: !483)
!592 = !DILocation(line: 1164, column: 2, scope: !483)
!593 = !DILocation(line: 1165, column: 1, scope: !483)
!594 = distinct !DISubprogram(name: "len_squared_v3v3", scope: !595, file: !595, line: 727, type: !596, scopeLine: 728, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !325)
!595 = !DIFile(filename: "blender/source/blender/blenlib/intern/math_vector_inline.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!596 = !DISubroutineType(types: !597)
!597 = !{!210, !323, !323}
!598 = !DILocalVariable(name: "a", arg: 1, scope: !594, file: !595, line: 727, type: !323)
!599 = !DILocation(line: 727, column: 44, scope: !594)
!600 = !DILocalVariable(name: "b", arg: 2, scope: !594, file: !595, line: 727, type: !323)
!601 = !DILocation(line: 727, column: 62, scope: !594)
!602 = !DILocalVariable(name: "d", scope: !594, file: !595, line: 729, type: !209)
!603 = !DILocation(line: 729, column: 8, scope: !594)
!604 = !DILocation(line: 731, column: 14, scope: !594)
!605 = !DILocation(line: 731, column: 17, scope: !594)
!606 = !DILocation(line: 731, column: 20, scope: !594)
!607 = !DILocation(line: 731, column: 2, scope: !594)
!608 = !DILocation(line: 732, column: 18, scope: !594)
!609 = !DILocation(line: 732, column: 21, scope: !594)
!610 = !DILocation(line: 732, column: 9, scope: !594)
!611 = !DILocation(line: 732, column: 2, scope: !594)
!612 = distinct !DISubprogram(name: "max_fff", scope: !613, file: !613, line: 224, type: !614, scopeLine: 225, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !325)
!613 = !DIFile(filename: "blender/source/blender/blenlib/intern/math_base_inline.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!614 = !DISubroutineType(types: !615)
!615 = !{!210, !210, !210, !210}
!616 = !DILocalVariable(name: "a", arg: 1, scope: !612, file: !613, line: 224, type: !210)
!617 = !DILocation(line: 224, column: 29, scope: !612)
!618 = !DILocalVariable(name: "b", arg: 2, scope: !612, file: !613, line: 224, type: !210)
!619 = !DILocation(line: 224, column: 38, scope: !612)
!620 = !DILocalVariable(name: "c", arg: 3, scope: !612, file: !613, line: 224, type: !210)
!621 = !DILocation(line: 224, column: 47, scope: !612)
!622 = !DILocation(line: 226, column: 23, scope: !612)
!623 = !DILocation(line: 226, column: 26, scope: !612)
!624 = !DILocation(line: 226, column: 16, scope: !612)
!625 = !DILocation(line: 226, column: 30, scope: !612)
!626 = !DILocation(line: 226, column: 9, scope: !612)
!627 = !DILocation(line: 226, column: 2, scope: !612)
!628 = distinct !DISubprogram(name: "pbvh_bmesh_normals_update", scope: !1, file: !1, line: 1168, type: !629, scopeLine: 1169, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !325)
!629 = !DISubroutineType(types: !630)
!630 = !{null, !631, !177}
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!632 = !DILocalVariable(name: "nodes", arg: 1, scope: !628, file: !1, line: 1168, type: !631)
!633 = !DILocation(line: 1168, column: 43, scope: !628)
!634 = !DILocalVariable(name: "totnode", arg: 2, scope: !628, file: !1, line: 1168, type: !177)
!635 = !DILocation(line: 1168, column: 54, scope: !628)
!636 = !DILocalVariable(name: "n", scope: !628, file: !1, line: 1170, type: !177)
!637 = !DILocation(line: 1170, column: 6, scope: !628)
!638 = !DILocation(line: 1172, column: 9, scope: !639)
!639 = distinct !DILexicalBlock(scope: !628, file: !1, line: 1172, column: 2)
!640 = !DILocation(line: 1172, column: 7, scope: !639)
!641 = !DILocation(line: 1172, column: 14, scope: !642)
!642 = distinct !DILexicalBlock(scope: !639, file: !1, line: 1172, column: 2)
!643 = !DILocation(line: 1172, column: 18, scope: !642)
!644 = !DILocation(line: 1172, column: 16, scope: !642)
!645 = !DILocation(line: 1172, column: 2, scope: !639)
!646 = !DILocalVariable(name: "node", scope: !647, file: !1, line: 1173, type: !279)
!647 = distinct !DILexicalBlock(scope: !642, file: !1, line: 1172, column: 32)
!648 = !DILocation(line: 1173, column: 13, scope: !647)
!649 = !DILocation(line: 1173, column: 20, scope: !647)
!650 = !DILocation(line: 1173, column: 26, scope: !647)
!651 = !DILocation(line: 1175, column: 7, scope: !652)
!652 = distinct !DILexicalBlock(scope: !647, file: !1, line: 1175, column: 7)
!653 = !DILocation(line: 1175, column: 13, scope: !652)
!654 = !DILocation(line: 1175, column: 18, scope: !652)
!655 = !DILocation(line: 1175, column: 7, scope: !647)
!656 = !DILocalVariable(name: "gs_iter", scope: !657, file: !1, line: 1176, type: !386)
!657 = distinct !DILexicalBlock(scope: !652, file: !1, line: 1175, column: 40)
!658 = !DILocation(line: 1176, column: 17, scope: !657)
!659 = !DILocation(line: 1178, column: 4, scope: !660)
!660 = distinct !DILexicalBlock(scope: !657, file: !1, line: 1178, column: 4)
!661 = !DILocation(line: 1178, column: 4, scope: !662)
!662 = distinct !DILexicalBlock(scope: !660, file: !1, line: 1178, column: 4)
!663 = !DILocation(line: 1179, column: 27, scope: !664)
!664 = distinct !DILexicalBlock(scope: !662, file: !1, line: 1178, column: 40)
!665 = !DILocation(line: 1179, column: 5, scope: !664)
!666 = !DILocation(line: 1180, column: 4, scope: !664)
!667 = distinct !{!667, !659, !668}
!668 = !DILocation(line: 1180, column: 4, scope: !660)
!669 = !DILocation(line: 1181, column: 4, scope: !670)
!670 = distinct !DILexicalBlock(scope: !657, file: !1, line: 1181, column: 4)
!671 = !DILocation(line: 1181, column: 4, scope: !672)
!672 = distinct !DILexicalBlock(scope: !670, file: !1, line: 1181, column: 4)
!673 = !DILocation(line: 1182, column: 27, scope: !674)
!674 = distinct !DILexicalBlock(scope: !672, file: !1, line: 1181, column: 47)
!675 = !DILocation(line: 1182, column: 5, scope: !674)
!676 = !DILocation(line: 1183, column: 4, scope: !674)
!677 = distinct !{!677, !669, !678}
!678 = !DILocation(line: 1183, column: 4, scope: !670)
!679 = !DILocation(line: 1185, column: 4, scope: !680)
!680 = distinct !DILexicalBlock(scope: !657, file: !1, line: 1185, column: 4)
!681 = !DILocation(line: 1185, column: 4, scope: !682)
!682 = distinct !DILexicalBlock(scope: !680, file: !1, line: 1185, column: 4)
!683 = !DILocation(line: 1186, column: 27, scope: !684)
!684 = distinct !DILexicalBlock(scope: !682, file: !1, line: 1185, column: 46)
!685 = !DILocation(line: 1186, column: 5, scope: !684)
!686 = !DILocation(line: 1187, column: 4, scope: !684)
!687 = distinct !{!687, !679, !688}
!688 = !DILocation(line: 1187, column: 4, scope: !680)
!689 = !DILocation(line: 1188, column: 4, scope: !657)
!690 = !DILocation(line: 1188, column: 10, scope: !657)
!691 = !DILocation(line: 1188, column: 15, scope: !657)
!692 = !DILocation(line: 1189, column: 3, scope: !657)
!693 = !DILocation(line: 1190, column: 2, scope: !647)
!694 = !DILocation(line: 1172, column: 28, scope: !642)
!695 = !DILocation(line: 1172, column: 2, scope: !642)
!696 = distinct !{!696, !645, !697}
!697 = !DILocation(line: 1190, column: 2, scope: !639)
!698 = !DILocation(line: 1191, column: 1, scope: !628)
!699 = distinct !DISubprogram(name: "BKE_pbvh_build_bmesh", scope: !1, file: !1, line: 1216, type: !700, scopeLine: 1218, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !325)
!700 = !DISubroutineType(types: !701)
!701 = !{null, !702, !830, !278, !930, !359, !359}
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "PBVH", file: !4, line: 46, baseType: !704)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !32, line: 121, size: 1664, elements: !705)
!705 = !{!706, !708, !710, !711, !712, !713, !714, !715, !716, !717, !728, !740, !782, !797, !802, !810, !812, !820, !821, !826, !827, !828, !829, !923, !924, !925, !926, !927}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !704, file: !32, line: 122, baseType: !707, size: 32)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "PBVHType", file: !4, line: 122, baseType: !26)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !704, file: !32, line: 123, baseType: !709, size: 32, offset: 32)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "PBVHFlags", file: !32, line: 117, baseType: !31)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !704, file: !32, line: 125, baseType: !279, size: 64, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "node_mem_count", scope: !704, file: !32, line: 126, baseType: !177, size: 32, offset: 128)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "totnode", scope: !704, file: !32, line: 126, baseType: !177, size: 32, offset: 160)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "prim_indices", scope: !704, file: !32, line: 128, baseType: !176, size: 64, offset: 192)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "totprim", scope: !704, file: !32, line: 129, baseType: !177, size: 32, offset: 256)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !704, file: !32, line: 130, baseType: !177, size: 32, offset: 288)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "leaf_limit", scope: !704, file: !32, line: 132, baseType: !177, size: 32, offset: 320)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "verts", scope: !704, file: !32, line: 135, baseType: !718, size: 64, offset: 384)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "MVert", file: !720, line: 69, baseType: !721)
!720 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !720, line: 65, size: 160, elements: !722)
!722 = !{!723, !724, !726, !727}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !721, file: !720, line: 66, baseType: !209, size: 96)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !721, file: !720, line: 67, baseType: !725, size: 48, offset: 96)
!725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 48, elements: !211)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !721, file: !720, line: 68, baseType: !179, size: 8, offset: 144)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !721, file: !720, line: 68, baseType: !179, size: 8, offset: 152)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "faces", scope: !704, file: !32, line: 136, baseType: !729, size: 64, offset: 448)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "MFace", file: !720, line: 46, baseType: !731)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !720, line: 42, size: 160, elements: !732)
!732 = !{!733, !734, !735, !736, !737, !738, !739}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !731, file: !720, line: 43, baseType: !5, size: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !731, file: !720, line: 43, baseType: !5, size: 32, offset: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !731, file: !720, line: 43, baseType: !5, size: 32, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !731, file: !720, line: 43, baseType: !5, size: 32, offset: 96)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !731, file: !720, line: 44, baseType: !207, size: 16, offset: 128)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !731, file: !720, line: 45, baseType: !179, size: 8, offset: 144)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !731, file: !720, line: 45, baseType: !179, size: 8, offset: 152)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !704, file: !32, line: 137, baseType: !741, size: 64, offset: 512)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !101, line: 73, baseType: !743)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !101, line: 64, size: 1600, elements: !744)
!744 = !{!745, !763, !767, !768, !769, !770, !773}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !743, file: !101, line: 65, baseType: !746, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !101, line: 53, baseType: !748)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !101, line: 42, size: 832, elements: !749)
!749 = !{!750, !751, !752, !753, !754, !755, !756, !757, !758, !762}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !748, file: !101, line: 43, baseType: !177, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !748, file: !101, line: 44, baseType: !177, size: 32, offset: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !748, file: !101, line: 45, baseType: !177, size: 32, offset: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !748, file: !101, line: 46, baseType: !177, size: 32, offset: 96)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !748, file: !101, line: 47, baseType: !177, size: 32, offset: 128)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !748, file: !101, line: 48, baseType: !177, size: 32, offset: 160)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !748, file: !101, line: 49, baseType: !177, size: 32, offset: 192)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !748, file: !101, line: 50, baseType: !177, size: 32, offset: 224)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !748, file: !101, line: 51, baseType: !759, size: 512, offset: 256)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 512, elements: !760)
!760 = !{!761}
!761 = !DISubrange(count: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !748, file: !101, line: 52, baseType: !156, size: 64, offset: 768)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !743, file: !101, line: 66, baseType: !764, size: 1312, offset: 64)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 1312, elements: !765)
!765 = !{!766}
!766 = !DISubrange(count: 41)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !743, file: !101, line: 69, baseType: !177, size: 32, offset: 1376)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !743, file: !101, line: 69, baseType: !177, size: 32, offset: 1408)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !743, file: !101, line: 70, baseType: !177, size: 32, offset: 1440)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !743, file: !101, line: 71, baseType: !771, size: 64, offset: 1472)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !101, line: 71, flags: DIFlagFwdDecl)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !743, file: !101, line: 72, baseType: !774, size: 64, offset: 1536)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !101, line: 59, baseType: !776)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !101, line: 57, size: 8192, elements: !777)
!777 = !{!778}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !776, file: !101, line: 58, baseType: !779, size: 8192)
!779 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 8192, elements: !780)
!780 = !{!781}
!781 = !DISubrange(count: 1024)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "gridkey", scope: !704, file: !32, line: 140, baseType: !783, size: 320, offset: 576)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "CCGKey", file: !784, line: 78, baseType: !785)
!784 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_ccg.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CCGKey", file: !784, line: 53, size: 320, elements: !786)
!786 = !{!787, !788, !789, !790, !791, !792, !793, !794, !795, !796}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !785, file: !784, line: 54, baseType: !177, size: 32)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "elem_size", scope: !785, file: !784, line: 58, baseType: !177, size: 32, offset: 32)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "grid_size", scope: !785, file: !784, line: 61, baseType: !177, size: 32, offset: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "grid_area", scope: !785, file: !784, line: 63, baseType: !177, size: 32, offset: 96)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "grid_bytes", scope: !785, file: !784, line: 65, baseType: !177, size: 32, offset: 128)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "normal_offset", scope: !785, file: !784, line: 69, baseType: !177, size: 32, offset: 160)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "mask_offset", scope: !785, file: !784, line: 73, baseType: !177, size: 32, offset: 192)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "num_layers", scope: !785, file: !784, line: 75, baseType: !177, size: 32, offset: 224)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "has_normals", scope: !785, file: !784, line: 76, baseType: !177, size: 32, offset: 256)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "has_mask", scope: !785, file: !784, line: 77, baseType: !177, size: 32, offset: 288)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "grids", scope: !704, file: !32, line: 141, baseType: !798, size: 64, offset: 896)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "CCGElem", file: !784, line: 51, baseType: !801)
!801 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !784, line: 51, flags: DIFlagFwdDecl)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "gridadj", scope: !704, file: !32, line: 142, baseType: !803, size: 64, offset: 960)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGridAdjacency", file: !805, line: 120, baseType: !806)
!805 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_DerivedMesh.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMGridAdjacency", file: !805, line: 117, size: 256, elements: !807)
!807 = !{!808, !809}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !806, file: !805, line: 118, baseType: !297, size: 128)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !806, file: !805, line: 119, baseType: !297, size: 128, offset: 128)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "gridfaces", scope: !704, file: !32, line: 143, baseType: !811, size: 64, offset: 1024)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "grid_flag_mats", scope: !704, file: !32, line: 144, baseType: !813, size: 64, offset: 1088)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !815)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFlagMat", file: !805, line: 126, baseType: !816)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMFlagMat", file: !805, line: 123, size: 32, elements: !817)
!817 = !{!818, !819}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !816, file: !805, line: 124, baseType: !207, size: 16)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !816, file: !805, line: 125, baseType: !179, size: 8, offset: 16)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "totgrid", scope: !704, file: !32, line: 145, baseType: !177, size: 32, offset: 1152)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "grid_hidden", scope: !704, file: !32, line: 146, baseType: !822, size: 64, offset: 1216)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_bitmap", file: !825, line: 33, baseType: !5)
!825 = !DIFile(filename: "blender/source/blender/blenlib/BLI_bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!826 = !DIDerivedType(tag: DW_TAG_member, name: "vert_bitmap", scope: !704, file: !32, line: 150, baseType: !823, size: 64, offset: 1280)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "deformed", scope: !704, file: !32, line: 157, baseType: !278, size: 8, offset: 1344)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "show_diffuse_color", scope: !704, file: !32, line: 159, baseType: !278, size: 8, offset: 1352)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "bm", scope: !704, file: !32, line: 162, baseType: !830, size: 64, offset: 1408)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !17, line: 246, baseType: !832)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !17, line: 186, size: 8064, elements: !833)
!833 = !{!834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !849, !851, !852, !853, !854, !855, !856, !857, !858, !859, !905, !906, !907, !908, !909, !910, !911, !912, !913, !920, !921, !922}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !832, file: !17, line: 187, baseType: !177, size: 32)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !832, file: !17, line: 187, baseType: !177, size: 32, offset: 32)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !832, file: !17, line: 187, baseType: !177, size: 32, offset: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !832, file: !17, line: 187, baseType: !177, size: 32, offset: 96)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !832, file: !17, line: 188, baseType: !177, size: 32, offset: 128)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !832, file: !17, line: 188, baseType: !177, size: 32, offset: 160)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !832, file: !17, line: 188, baseType: !177, size: 32, offset: 192)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !832, file: !17, line: 193, baseType: !179, size: 8, offset: 224)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !832, file: !17, line: 197, baseType: !179, size: 8, offset: 232)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !832, file: !17, line: 201, baseType: !771, size: 64, offset: 256)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !832, file: !17, line: 201, baseType: !771, size: 64, offset: 320)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !832, file: !17, line: 201, baseType: !771, size: 64, offset: 384)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !832, file: !17, line: 201, baseType: !771, size: 64, offset: 448)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !832, file: !17, line: 208, baseType: !848, size: 64, offset: 512)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !832, file: !17, line: 209, baseType: !850, size: 64, offset: 576)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !832, file: !17, line: 210, baseType: !264, size: 64, offset: 640)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !832, file: !17, line: 213, baseType: !177, size: 32, offset: 704)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !832, file: !17, line: 214, baseType: !177, size: 32, offset: 736)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !832, file: !17, line: 215, baseType: !177, size: 32, offset: 768)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !832, file: !17, line: 218, baseType: !771, size: 64, offset: 832)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !832, file: !17, line: 218, baseType: !771, size: 64, offset: 896)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !832, file: !17, line: 218, baseType: !771, size: 64, offset: 960)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !832, file: !17, line: 220, baseType: !177, size: 32, offset: 1024)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !832, file: !17, line: 221, baseType: !860, size: 64, offset: 1088)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !36, line: 190, size: 10496, elements: !862)
!862 = !{!863, !893, !894, !898, !901, !902, !904}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !861, file: !36, line: 191, baseType: !864, size: 5120)
!864 = !DICompositeType(tag: DW_TAG_array_type, baseType: !865, size: 5120, elements: !891)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !36, line: 147, size: 320, elements: !866)
!866 = !{!867, !869, !871, !881, !882}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !865, file: !36, line: 148, baseType: !868, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !865, file: !36, line: 149, baseType: !870, size: 32, offset: 64)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !36, line: 112, baseType: !35)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !865, file: !36, line: 150, baseType: !872, size: 32, offset: 96)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !36, line: 142, baseType: !873)
!873 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !36, line: 138, size: 32, elements: !874)
!874 = !{!875, !877, !879}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !873, file: !36, line: 139, baseType: !876, size: 32)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !36, line: 122, baseType: !46)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !873, file: !36, line: 140, baseType: !878, size: 32)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !36, line: 136, baseType: !52)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !873, file: !36, line: 141, baseType: !880, size: 32)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !36, line: 130, baseType: !58)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !865, file: !36, line: 152, baseType: !177, size: 32, offset: 128)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !865, file: !36, line: 162, baseType: !883, size: 128, offset: 192)
!883 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !865, file: !36, line: 155, size: 128, elements: !884)
!884 = !{!885, !886, !887, !888, !889, !890}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !883, file: !36, line: 156, baseType: !177, size: 32)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !883, file: !36, line: 157, baseType: !210, size: 32)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !883, file: !36, line: 158, baseType: !156, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !883, file: !36, line: 159, baseType: !209, size: 96)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !883, file: !36, line: 160, baseType: !811, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !883, file: !36, line: 161, baseType: !163, size: 64)
!891 = !{!892}
!892 = !DISubrange(count: 16)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !861, file: !36, line: 192, baseType: !864, size: 5120, offset: 5120)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !861, file: !36, line: 193, baseType: !895, size: 64, offset: 10240)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DISubroutineType(types: !897)
!897 = !{null, !830, !860}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !861, file: !36, line: 194, baseType: !899, size: 64, offset: 10304)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !36, line: 194, flags: DIFlagFwdDecl)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !861, file: !36, line: 195, baseType: !177, size: 32, offset: 10368)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !861, file: !36, line: 196, baseType: !903, size: 32, offset: 10400)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !36, line: 188, baseType: !66)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !861, file: !36, line: 197, baseType: !177, size: 32, offset: 10432)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !832, file: !17, line: 223, baseType: !742, size: 1600, offset: 1152)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !832, file: !17, line: 223, baseType: !742, size: 1600, offset: 2752)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !832, file: !17, line: 223, baseType: !742, size: 1600, offset: 4352)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !832, file: !17, line: 223, baseType: !742, size: 1600, offset: 5952)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !832, file: !17, line: 233, baseType: !207, size: 16, offset: 7552)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !832, file: !17, line: 236, baseType: !177, size: 32, offset: 7584)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !832, file: !17, line: 238, baseType: !177, size: 32, offset: 7616)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !832, file: !17, line: 238, baseType: !177, size: 32, offset: 7648)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !832, file: !17, line: 239, baseType: !914, size: 128, offset: 7680)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !915, line: 71, baseType: !916)
!915 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !915, line: 69, size: 128, elements: !917)
!917 = !{!918, !919}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !916, file: !915, line: 70, baseType: !156, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !916, file: !915, line: 70, baseType: !156, size: 64, offset: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !832, file: !17, line: 241, baseType: !255, size: 64, offset: 7808)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !832, file: !17, line: 243, baseType: !914, size: 128, offset: 7872)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !832, file: !17, line: 245, baseType: !156, size: 64, offset: 8000)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "bm_max_edge_len", scope: !704, file: !32, line: 163, baseType: !210, size: 32, offset: 1472)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "bm_min_edge_len", scope: !704, file: !32, line: 164, baseType: !210, size: 32, offset: 1504)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "cd_vert_node_offset", scope: !704, file: !32, line: 165, baseType: !177, size: 32, offset: 1536)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "cd_face_node_offset", scope: !704, file: !32, line: 166, baseType: !177, size: 32, offset: 1568)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "bm_log", scope: !704, file: !32, line: 168, baseType: !928, size: 64, offset: 1600)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMLog", file: !4, line: 44, flags: DIFlagFwdDecl)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLog", file: !932, line: 33, baseType: !929)
!932 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_log.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!933 = !DILocalVariable(name: "bvh", arg: 1, scope: !699, file: !1, line: 1216, type: !702)
!934 = !DILocation(line: 1216, column: 33, scope: !699)
!935 = !DILocalVariable(name: "bm", arg: 2, scope: !699, file: !1, line: 1216, type: !830)
!936 = !DILocation(line: 1216, column: 45, scope: !699)
!937 = !DILocalVariable(name: "smooth_shading", arg: 3, scope: !699, file: !1, line: 1216, type: !278)
!938 = !DILocation(line: 1216, column: 54, scope: !699)
!939 = !DILocalVariable(name: "log", arg: 4, scope: !699, file: !1, line: 1216, type: !930)
!940 = !DILocation(line: 1216, column: 77, scope: !699)
!941 = !DILocalVariable(name: "cd_vert_node_offset", arg: 5, scope: !699, file: !1, line: 1217, type: !359)
!942 = !DILocation(line: 1217, column: 37, scope: !699)
!943 = !DILocalVariable(name: "cd_face_node_offset", arg: 6, scope: !699, file: !1, line: 1217, type: !359)
!944 = !DILocation(line: 1217, column: 68, scope: !699)
!945 = !DILocalVariable(name: "iter", scope: !699, file: !1, line: 1219, type: !946)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter", file: !74, line: 186, baseType: !947)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter", file: !74, line: 164, size: 512, elements: !948)
!948 = !{!949, !1028, !1029, !1030, !1031}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !947, file: !74, line: 179, baseType: !950, size: 320)
!950 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !947, file: !74, line: 166, size: 320, elements: !951)
!951 = !{!952, !966, !972, !980, !988, !994, !1000, !1006, !1010, !1016, !1022}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "elem_of_mesh", scope: !950, file: !74, line: 167, baseType: !953, size: 192)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__elem_of_mesh", file: !74, line: 113, size: 192, elements: !954)
!954 = !{!955}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "pooliter", scope: !953, file: !74, line: 114, baseType: !956, size: 192)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool_iter", file: !145, line: 80, baseType: !957)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_iter", file: !145, line: 76, size: 192, elements: !958)
!958 = !{!959, !962, !965}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !957, file: !145, line: 77, baseType: !960, size: 64)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool", file: !145, line: 47, baseType: !772)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "curchunk", scope: !957, file: !145, line: 78, baseType: !963, size: 64, offset: 64)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_chunk", file: !145, line: 45, flags: DIFlagFwdDecl)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "curindex", scope: !957, file: !145, line: 79, baseType: !5, size: 32, offset: 128)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_vert", scope: !950, file: !74, line: 169, baseType: !967, size: 192)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_vert", file: !74, line: 116, size: 192, elements: !968)
!968 = !{!969, !970, !971}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !967, file: !74, line: 117, baseType: !189, size: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !967, file: !74, line: 118, baseType: !253, size: 64, offset: 64)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !967, file: !74, line: 118, baseType: !253, size: 64, offset: 128)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_vert", scope: !950, file: !74, line: 170, baseType: !973, size: 320)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_vert", file: !74, line: 120, size: 320, elements: !974)
!974 = !{!975, !976, !977, !978, !979}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !973, file: !74, line: 121, baseType: !189, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !973, file: !74, line: 122, baseType: !237, size: 64, offset: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !973, file: !74, line: 122, baseType: !237, size: 64, offset: 128)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !973, file: !74, line: 123, baseType: !253, size: 64, offset: 192)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !973, file: !74, line: 123, baseType: !253, size: 64, offset: 256)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_vert", scope: !950, file: !74, line: 171, baseType: !981, size: 320)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_vert", file: !74, line: 125, size: 320, elements: !982)
!982 = !{!983, !984, !985, !986, !987}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !981, file: !74, line: 126, baseType: !189, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !981, file: !74, line: 127, baseType: !237, size: 64, offset: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !981, file: !74, line: 127, baseType: !237, size: 64, offset: 128)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !981, file: !74, line: 128, baseType: !253, size: 64, offset: 192)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !981, file: !74, line: 128, baseType: !253, size: 64, offset: 256)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_edge", scope: !950, file: !74, line: 172, baseType: !989, size: 192)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_edge", file: !74, line: 130, size: 192, elements: !990)
!990 = !{!991, !992, !993}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !989, file: !74, line: 131, baseType: !253, size: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !989, file: !74, line: 132, baseType: !237, size: 64, offset: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !989, file: !74, line: 132, baseType: !237, size: 64, offset: 128)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_loop", scope: !950, file: !74, line: 173, baseType: !995, size: 192)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_loop", file: !74, line: 134, size: 192, elements: !996)
!996 = !{!997, !998, !999}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !995, file: !74, line: 135, baseType: !237, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !995, file: !74, line: 136, baseType: !237, size: 64, offset: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !995, file: !74, line: 136, baseType: !237, size: 64, offset: 128)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_edge", scope: !950, file: !74, line: 174, baseType: !1001, size: 192)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_edge", file: !74, line: 138, size: 192, elements: !1002)
!1002 = !{!1003, !1004, !1005}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !1001, file: !74, line: 139, baseType: !253, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !1001, file: !74, line: 140, baseType: !237, size: 64, offset: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !1001, file: !74, line: 140, baseType: !237, size: 64, offset: 128)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_edge", scope: !950, file: !74, line: 175, baseType: !1007, size: 64)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_edge", file: !74, line: 142, size: 64, elements: !1008)
!1008 = !{!1009}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !1007, file: !74, line: 143, baseType: !253, size: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_face", scope: !950, file: !74, line: 176, baseType: !1011, size: 192)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_face", file: !74, line: 145, size: 192, elements: !1012)
!1012 = !{!1013, !1014, !1015}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !1011, file: !74, line: 146, baseType: !255, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !1011, file: !74, line: 147, baseType: !237, size: 64, offset: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !1011, file: !74, line: 147, baseType: !237, size: 64, offset: 128)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_face", scope: !950, file: !74, line: 177, baseType: !1017, size: 192)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_face", file: !74, line: 149, size: 192, elements: !1018)
!1018 = !{!1019, !1020, !1021}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !1017, file: !74, line: 150, baseType: !255, size: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !1017, file: !74, line: 151, baseType: !237, size: 64, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !1017, file: !74, line: 151, baseType: !237, size: 64, offset: 128)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_face", scope: !950, file: !74, line: 178, baseType: !1023, size: 192)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_face", file: !74, line: 153, size: 192, elements: !1024)
!1024 = !{!1025, !1026, !1027}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !1023, file: !74, line: 154, baseType: !255, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !1023, file: !74, line: 155, baseType: !237, size: 64, offset: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !1023, file: !74, line: 155, baseType: !237, size: 64, offset: 128)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !947, file: !74, line: 181, baseType: !181, size: 64, offset: 320)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !947, file: !74, line: 182, baseType: !185, size: 64, offset: 384)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !947, file: !74, line: 184, baseType: !177, size: 32, offset: 448)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !947, file: !74, line: 185, baseType: !179, size: 8, offset: 480)
!1032 = !DILocation(line: 1219, column: 9, scope: !699)
!1033 = !DILocalVariable(name: "f", scope: !699, file: !1, line: 1220, type: !255)
!1034 = !DILocation(line: 1220, column: 10, scope: !699)
!1035 = !DILocalVariable(name: "n", scope: !699, file: !1, line: 1221, type: !279)
!1036 = !DILocation(line: 1221, column: 12, scope: !699)
!1037 = !DILocalVariable(name: "node_index", scope: !699, file: !1, line: 1222, type: !177)
!1038 = !DILocation(line: 1222, column: 6, scope: !699)
!1039 = !DILocation(line: 1224, column: 29, scope: !699)
!1040 = !DILocation(line: 1224, column: 2, scope: !699)
!1041 = !DILocation(line: 1224, column: 7, scope: !699)
!1042 = !DILocation(line: 1224, column: 27, scope: !699)
!1043 = !DILocation(line: 1225, column: 29, scope: !699)
!1044 = !DILocation(line: 1225, column: 2, scope: !699)
!1045 = !DILocation(line: 1225, column: 7, scope: !699)
!1046 = !DILocation(line: 1225, column: 27, scope: !699)
!1047 = !DILocation(line: 1226, column: 12, scope: !699)
!1048 = !DILocation(line: 1226, column: 2, scope: !699)
!1049 = !DILocation(line: 1226, column: 7, scope: !699)
!1050 = !DILocation(line: 1226, column: 10, scope: !699)
!1051 = !DILocation(line: 1228, column: 33, scope: !699)
!1052 = !DILocation(line: 1228, column: 2, scope: !699)
!1053 = !DILocation(line: 1230, column: 2, scope: !699)
!1054 = !DILocation(line: 1230, column: 7, scope: !699)
!1055 = !DILocation(line: 1230, column: 12, scope: !699)
!1056 = !DILocation(line: 1231, column: 16, scope: !699)
!1057 = !DILocation(line: 1231, column: 2, scope: !699)
!1058 = !DILocation(line: 1231, column: 7, scope: !699)
!1059 = !DILocation(line: 1231, column: 14, scope: !699)
!1060 = !DILocation(line: 1234, column: 2, scope: !699)
!1061 = !DILocation(line: 1234, column: 7, scope: !699)
!1062 = !DILocation(line: 1234, column: 18, scope: !699)
!1063 = !DILocation(line: 1236, column: 6, scope: !1064)
!1064 = distinct !DILexicalBlock(scope: !699, file: !1, line: 1236, column: 6)
!1065 = !DILocation(line: 1236, column: 6, scope: !699)
!1066 = !DILocation(line: 1237, column: 3, scope: !1064)
!1067 = !DILocation(line: 1237, column: 8, scope: !1064)
!1068 = !DILocation(line: 1237, column: 14, scope: !1064)
!1069 = !DILocation(line: 1239, column: 31, scope: !699)
!1070 = !DILocation(line: 1239, column: 2, scope: !699)
!1071 = !DILocation(line: 1242, column: 19, scope: !699)
!1072 = !DILocation(line: 1242, column: 6, scope: !699)
!1073 = !DILocation(line: 1242, column: 11, scope: !699)
!1074 = !DILocation(line: 1242, column: 17, scope: !699)
!1075 = !DILocation(line: 1242, column: 4, scope: !699)
!1076 = !DILocation(line: 1243, column: 2, scope: !699)
!1077 = !DILocation(line: 1243, column: 7, scope: !699)
!1078 = !DILocation(line: 1243, column: 15, scope: !699)
!1079 = !DILocation(line: 1244, column: 2, scope: !699)
!1080 = !DILocation(line: 1244, column: 5, scope: !699)
!1081 = !DILocation(line: 1244, column: 10, scope: !699)
!1082 = !DILocation(line: 1245, column: 48, scope: !699)
!1083 = !DILocation(line: 1245, column: 53, scope: !699)
!1084 = !DILocation(line: 1245, column: 57, scope: !699)
!1085 = !DILocation(line: 1245, column: 16, scope: !699)
!1086 = !DILocation(line: 1245, column: 2, scope: !699)
!1087 = !DILocation(line: 1245, column: 5, scope: !699)
!1088 = !DILocation(line: 1245, column: 14, scope: !699)
!1089 = !DILocation(line: 1246, column: 2, scope: !1090)
!1090 = distinct !DILexicalBlock(scope: !699, file: !1, line: 1246, column: 2)
!1091 = !DILocation(line: 1246, column: 2, scope: !1092)
!1092 = distinct !DILexicalBlock(scope: !1090, file: !1, line: 1246, column: 2)
!1093 = !DILocation(line: 1247, column: 19, scope: !1094)
!1094 = distinct !DILexicalBlock(scope: !1092, file: !1, line: 1246, column: 53)
!1095 = !DILocation(line: 1247, column: 22, scope: !1094)
!1096 = !DILocation(line: 1247, column: 32, scope: !1094)
!1097 = !DILocation(line: 1247, column: 3, scope: !1094)
!1098 = !DILocation(line: 1248, column: 2, scope: !1094)
!1099 = distinct !{!1099, !1089, !1100}
!1100 = !DILocation(line: 1248, column: 2, scope: !1090)
!1101 = !DILocation(line: 1252, column: 36, scope: !1102)
!1102 = distinct !DILexicalBlock(scope: !699, file: !1, line: 1252, column: 6)
!1103 = !DILocation(line: 1252, column: 41, scope: !1102)
!1104 = !DILocation(line: 1252, column: 7, scope: !1102)
!1105 = !DILocation(line: 1252, column: 6, scope: !699)
!1106 = !DILocation(line: 1253, column: 28, scope: !1102)
!1107 = !DILocation(line: 1253, column: 36, scope: !1102)
!1108 = !DILocation(line: 1253, column: 57, scope: !1102)
!1109 = !DILocation(line: 1253, column: 3, scope: !1102)
!1110 = !DILocation(line: 1254, column: 1, scope: !699)
!1111 = distinct !DISubprogram(name: "BKE_pbvh_bmesh_detail_size_set", scope: !1, file: !1, line: 1403, type: !1112, scopeLine: 1404, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !325)
!1112 = !DISubroutineType(types: !1113)
!1113 = !{null, !702, !210}
!1114 = !DILocalVariable(name: "bvh", arg: 1, scope: !1111, file: !1, line: 1403, type: !702)
!1115 = !DILocation(line: 1403, column: 43, scope: !1111)
!1116 = !DILocalVariable(name: "detail_size", arg: 2, scope: !1111, file: !1, line: 1403, type: !210)
!1117 = !DILocation(line: 1403, column: 54, scope: !1111)
!1118 = !DILocation(line: 1405, column: 25, scope: !1111)
!1119 = !DILocation(line: 1405, column: 2, scope: !1111)
!1120 = !DILocation(line: 1405, column: 7, scope: !1111)
!1121 = !DILocation(line: 1405, column: 23, scope: !1111)
!1122 = !DILocation(line: 1406, column: 25, scope: !1111)
!1123 = !DILocation(line: 1406, column: 30, scope: !1111)
!1124 = !DILocation(line: 1406, column: 46, scope: !1111)
!1125 = !DILocation(line: 1406, column: 2, scope: !1111)
!1126 = !DILocation(line: 1406, column: 7, scope: !1111)
!1127 = !DILocation(line: 1406, column: 23, scope: !1111)
!1128 = !DILocation(line: 1407, column: 1, scope: !1111)
!1129 = distinct !DISubprogram(name: "pbvh_bmesh_node_layers_reset", scope: !1, file: !1, line: 1195, type: !1130, scopeLine: 1196, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !325)
!1130 = !DISubroutineType(types: !1131)
!1131 = !{null, !702}
!1132 = !DILocalVariable(name: "bvh", arg: 1, scope: !1129, file: !1, line: 1195, type: !702)
!1133 = !DILocation(line: 1195, column: 48, scope: !1129)
!1134 = !DILocalVariable(name: "f", scope: !1129, file: !1, line: 1197, type: !255)
!1135 = !DILocation(line: 1197, column: 10, scope: !1129)
!1136 = !DILocalVariable(name: "v", scope: !1129, file: !1, line: 1198, type: !189)
!1137 = !DILocation(line: 1198, column: 10, scope: !1129)
!1138 = !DILocalVariable(name: "iter", scope: !1129, file: !1, line: 1199, type: !946)
!1139 = !DILocation(line: 1199, column: 9, scope: !1129)
!1140 = !DILocalVariable(name: "bm", scope: !1129, file: !1, line: 1200, type: !830)
!1141 = !DILocation(line: 1200, column: 9, scope: !1129)
!1142 = !DILocation(line: 1200, column: 14, scope: !1129)
!1143 = !DILocation(line: 1200, column: 19, scope: !1129)
!1144 = !DILocalVariable(name: "cd_vert_node_offset", scope: !1129, file: !1, line: 1201, type: !177)
!1145 = !DILocation(line: 1201, column: 6, scope: !1129)
!1146 = !DILocation(line: 1201, column: 28, scope: !1129)
!1147 = !DILocation(line: 1201, column: 33, scope: !1129)
!1148 = !DILocalVariable(name: "cd_face_node_offset", scope: !1129, file: !1, line: 1202, type: !177)
!1149 = !DILocation(line: 1202, column: 6, scope: !1129)
!1150 = !DILocation(line: 1202, column: 28, scope: !1129)
!1151 = !DILocation(line: 1202, column: 33, scope: !1129)
!1152 = !DILocation(line: 1205, column: 2, scope: !1153)
!1153 = distinct !DILexicalBlock(scope: !1129, file: !1, line: 1205, column: 2)
!1154 = !DILocation(line: 1205, column: 2, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !1153, file: !1, line: 1205, column: 2)
!1156 = !DILocalVariable(name: "non_const", scope: !1157, file: !1, line: 1206, type: !156)
!1157 = distinct !DILexicalBlock(scope: !1158, file: !1, line: 1206, column: 3)
!1158 = distinct !DILexicalBlock(scope: !1159, file: !1, line: 1206, column: 3)
!1159 = distinct !DILexicalBlock(scope: !1155, file: !1, line: 1205, column: 47)
!1160 = !DILocation(line: 1206, column: 3, scope: !1157)
!1161 = !DILocation(line: 1206, column: 3, scope: !1158)
!1162 = !DILocation(line: 1207, column: 2, scope: !1159)
!1163 = distinct !{!1163, !1152, !1164}
!1164 = !DILocation(line: 1207, column: 2, scope: !1153)
!1165 = !DILocation(line: 1209, column: 2, scope: !1166)
!1166 = distinct !DILexicalBlock(scope: !1129, file: !1, line: 1209, column: 2)
!1167 = !DILocation(line: 1209, column: 2, scope: !1168)
!1168 = distinct !DILexicalBlock(scope: !1166, file: !1, line: 1209, column: 2)
!1169 = !DILocalVariable(name: "non_const", scope: !1170, file: !1, line: 1210, type: !156)
!1170 = distinct !DILexicalBlock(scope: !1171, file: !1, line: 1210, column: 3)
!1171 = distinct !DILexicalBlock(scope: !1172, file: !1, line: 1210, column: 3)
!1172 = distinct !DILexicalBlock(scope: !1168, file: !1, line: 1209, column: 47)
!1173 = !DILocation(line: 1210, column: 3, scope: !1170)
!1174 = !DILocation(line: 1210, column: 3, scope: !1171)
!1175 = !DILocation(line: 1211, column: 2, scope: !1172)
!1176 = distinct !{!1176, !1165, !1177}
!1177 = !DILocation(line: 1211, column: 2, scope: !1166)
!1178 = !DILocation(line: 1212, column: 1, scope: !1129)
!1179 = distinct !DISubprogram(name: "BM_iter_new", scope: !1180, file: !1180, line: 172, type: !1181, scopeLine: 173, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !325)
!1180 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators_inline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1181 = !DISubroutineType(types: !1182)
!1182 = !{!156, !1183, !830, !464, !156}
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!1184 = !DILocalVariable(name: "iter", arg: 1, scope: !1179, file: !1180, line: 172, type: !1183)
!1185 = !DILocation(line: 172, column: 38, scope: !1179)
!1186 = !DILocalVariable(name: "bm", arg: 2, scope: !1179, file: !1180, line: 172, type: !830)
!1187 = !DILocation(line: 172, column: 51, scope: !1179)
!1188 = !DILocalVariable(name: "itype", arg: 3, scope: !1179, file: !1180, line: 172, type: !464)
!1189 = !DILocation(line: 172, column: 66, scope: !1179)
!1190 = !DILocalVariable(name: "data", arg: 4, scope: !1179, file: !1180, line: 172, type: !156)
!1191 = !DILocation(line: 172, column: 79, scope: !1179)
!1192 = !DILocation(line: 174, column: 6, scope: !1193)
!1193 = distinct !DILexicalBlock(scope: !1179, file: !1180, line: 174, column: 6)
!1194 = !DILocation(line: 174, column: 6, scope: !1179)
!1195 = !DILocation(line: 175, column: 23, scope: !1196)
!1196 = distinct !DILexicalBlock(scope: !1193, file: !1180, line: 174, column: 51)
!1197 = !DILocation(line: 175, column: 10, scope: !1196)
!1198 = !DILocation(line: 175, column: 3, scope: !1196)
!1199 = !DILocation(line: 178, column: 3, scope: !1200)
!1200 = distinct !DILexicalBlock(scope: !1193, file: !1180, line: 177, column: 7)
!1201 = !DILocation(line: 180, column: 1, scope: !1179)
!1202 = distinct !DISubprogram(name: "BM_iter_step", scope: !1180, file: !1180, line: 40, type: !1203, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !325)
!1203 = !DISubroutineType(types: !1204)
!1204 = !{!156, !1183}
!1205 = !DILocalVariable(name: "iter", arg: 1, scope: !1202, file: !1180, line: 40, type: !1183)
!1206 = !DILocation(line: 40, column: 39, scope: !1202)
!1207 = !DILocation(line: 42, column: 9, scope: !1202)
!1208 = !DILocation(line: 42, column: 15, scope: !1202)
!1209 = !DILocation(line: 42, column: 20, scope: !1202)
!1210 = !DILocation(line: 42, column: 2, scope: !1202)
!1211 = distinct !DISubprogram(name: "pbvh_bmesh_node_limit_ensure", scope: !1, file: !1, line: 238, type: !1212, scopeLine: 239, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !325)
!1212 = !DISubroutineType(types: !1213)
!1213 = !{!278, !702, !177}
!1214 = !DILocalVariable(name: "bvh", arg: 1, scope: !1211, file: !1, line: 238, type: !702)
!1215 = !DILocation(line: 238, column: 48, scope: !1211)
!1216 = !DILocalVariable(name: "node_index", arg: 2, scope: !1211, file: !1, line: 238, type: !177)
!1217 = !DILocation(line: 238, column: 57, scope: !1211)
!1218 = !DILocalVariable(name: "prim_bbc", scope: !1211, file: !1, line: 240, type: !163)
!1219 = !DILocation(line: 240, column: 9, scope: !1211)
!1220 = !DILocalVariable(name: "bm_faces", scope: !1211, file: !1, line: 241, type: !313)
!1221 = !DILocation(line: 241, column: 8, scope: !1211)
!1222 = !DILocalVariable(name: "bm_faces_size", scope: !1211, file: !1, line: 242, type: !177)
!1223 = !DILocation(line: 242, column: 6, scope: !1211)
!1224 = !DILocalVariable(name: "gs_iter", scope: !1211, file: !1, line: 243, type: !386)
!1225 = !DILocation(line: 243, column: 15, scope: !1211)
!1226 = !DILocalVariable(name: "bbc_array", scope: !1211, file: !1, line: 244, type: !1227)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64)
!1228 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBC", file: !32, line: 36, baseType: !1229)
!1229 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !32, line: 34, size: 288, elements: !1230)
!1230 = !{!1231, !1232, !1233}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "bmin", scope: !1229, file: !32, line: 35, baseType: !209, size: 96)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "bmax", scope: !1229, file: !32, line: 35, baseType: !209, size: 96, offset: 96)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "bcentroid", scope: !1229, file: !32, line: 35, baseType: !209, size: 96, offset: 192)
!1234 = !DILocation(line: 244, column: 7, scope: !1211)
!1235 = !DILocalVariable(name: "i", scope: !1211, file: !1, line: 245, type: !5)
!1236 = !DILocation(line: 245, column: 15, scope: !1211)
!1237 = !DILocation(line: 247, column: 13, scope: !1211)
!1238 = !DILocation(line: 247, column: 18, scope: !1211)
!1239 = !DILocation(line: 247, column: 24, scope: !1211)
!1240 = !DILocation(line: 247, column: 36, scope: !1211)
!1241 = !DILocation(line: 247, column: 11, scope: !1211)
!1242 = !DILocation(line: 248, column: 32, scope: !1211)
!1243 = !DILocation(line: 248, column: 18, scope: !1211)
!1244 = !DILocation(line: 248, column: 16, scope: !1211)
!1245 = !DILocation(line: 249, column: 6, scope: !1246)
