; ModuleID = 'blender/source/blender/modifiers/intern/MOD_meshdeform.c'
source_filename = "blender/source/blender/modifiers/intern/MOD_meshdeform.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!88 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INT", value: 67, isUnsigned: true)
!89 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_BOOL", value: 68, isUnsigned: true)
!90 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INTERNAL", value: 69, isUnsigned: true)
!91 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !61, line: 182, baseType: !7, size: 32, elements: !92)
!92 = !{!93, !94, !95, !96, !97}
!93 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NOP", value: 0, isUnsigned: true)
!94 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_UNTAN_MULTIRES", value: 1, isUnsigned: true)
!95 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NORMALS_CALC", value: 2, isUnsigned: true)
!96 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_FLUSH", value: 4, isUnsigned: true)
!97 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!98 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !99, line: 655, baseType: !7, size: 32, elements: !100)
!99 = !DIFile(filename: "blender/source/blender/makesdna/DNA_modifier_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!100 = !{!101, !102}
!101 = !DIEnumerator(name: "MOD_MDEF_INVERT_VGROUP", value: 1, isUnsigned: true)
!102 = !DIEnumerator(name: "MOD_MDEF_DYNAMIC_BIND", value: 2, isUnsigned: true)
!103 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !104, line: 76, baseType: !7, size: 32, elements: !105)
!104 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!105 = !{!106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146}
!106 = !DIEnumerator(name: "CD_MVERT", value: 0, isUnsigned: true)
!107 = !DIEnumerator(name: "CD_MSTICKY", value: 1, isUnsigned: true)
!108 = !DIEnumerator(name: "CD_MDEFORMVERT", value: 2, isUnsigned: true)
!109 = !DIEnumerator(name: "CD_MEDGE", value: 3, isUnsigned: true)
!110 = !DIEnumerator(name: "CD_MFACE", value: 4, isUnsigned: true)
!111 = !DIEnumerator(name: "CD_MTFACE", value: 5, isUnsigned: true)
!112 = !DIEnumerator(name: "CD_MCOL", value: 6, isUnsigned: true)
!113 = !DIEnumerator(name: "CD_ORIGINDEX", value: 7, isUnsigned: true)
!114 = !DIEnumerator(name: "CD_NORMAL", value: 8, isUnsigned: true)
!115 = !DIEnumerator(name: "CD_PROP_FLT", value: 10, isUnsigned: true)
!116 = !DIEnumerator(name: "CD_PROP_INT", value: 11, isUnsigned: true)
!117 = !DIEnumerator(name: "CD_PROP_STR", value: 12, isUnsigned: true)
!118 = !DIEnumerator(name: "CD_ORIGSPACE", value: 13, isUnsigned: true)
!119 = !DIEnumerator(name: "CD_ORCO", value: 14, isUnsigned: true)
!120 = !DIEnumerator(name: "CD_MTEXPOLY", value: 15, isUnsigned: true)
!121 = !DIEnumerator(name: "CD_MLOOPUV", value: 16, isUnsigned: true)
!122 = !DIEnumerator(name: "CD_MLOOPCOL", value: 17, isUnsigned: true)
!123 = !DIEnumerator(name: "CD_TANGENT", value: 18, isUnsigned: true)
!124 = !DIEnumerator(name: "CD_MDISPS", value: 19, isUnsigned: true)
!125 = !DIEnumerator(name: "CD_PREVIEW_MCOL", value: 20, isUnsigned: true)
!126 = !DIEnumerator(name: "CD_ID_MCOL", value: 21, isUnsigned: true)
!127 = !DIEnumerator(name: "CD_TEXTURE_MCOL", value: 22, isUnsigned: true)
!128 = !DIEnumerator(name: "CD_CLOTH_ORCO", value: 23, isUnsigned: true)
!129 = !DIEnumerator(name: "CD_RECAST", value: 24, isUnsigned: true)
!130 = !DIEnumerator(name: "CD_MPOLY", value: 25, isUnsigned: true)
!131 = !DIEnumerator(name: "CD_MLOOP", value: 26, isUnsigned: true)
!132 = !DIEnumerator(name: "CD_SHAPE_KEYINDEX", value: 27, isUnsigned: true)
!133 = !DIEnumerator(name: "CD_SHAPEKEY", value: 28, isUnsigned: true)
!134 = !DIEnumerator(name: "CD_BWEIGHT", value: 29, isUnsigned: true)
!135 = !DIEnumerator(name: "CD_CREASE", value: 30, isUnsigned: true)
!136 = !DIEnumerator(name: "CD_ORIGSPACE_MLOOP", value: 31, isUnsigned: true)
!137 = !DIEnumerator(name: "CD_PREVIEW_MLOOPCOL", value: 32, isUnsigned: true)
!138 = !DIEnumerator(name: "CD_BM_ELEM_PYPTR", value: 33, isUnsigned: true)
!139 = !DIEnumerator(name: "CD_PAINT_MASK", value: 34, isUnsigned: true)
!140 = !DIEnumerator(name: "CD_GRID_PAINT_MASK", value: 35, isUnsigned: true)
!141 = !DIEnumerator(name: "CD_MVERT_SKIN", value: 36, isUnsigned: true)
!142 = !DIEnumerator(name: "CD_FREESTYLE_EDGE", value: 37, isUnsigned: true)
!143 = !DIEnumerator(name: "CD_FREESTYLE_FACE", value: 38, isUnsigned: true)
!144 = !DIEnumerator(name: "CD_MLOOPTANGENT", value: 39, isUnsigned: true)
!145 = !DIEnumerator(name: "CD_TESSLOOPNORMAL", value: 40, isUnsigned: true)
!146 = !DIEnumerator(name: "CD_NUMTYPES", value: 41, isUnsigned: true)
!147 = !{!148, !771, !180, !780, !160}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "MeshDeformModifierData", file: !99, line: 653, baseType: !150)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MeshDeformModifierData", file: !99, line: 622, size: 2880, elements: !151)
!151 = !{!152, !1717, !1718, !1719, !1720, !1721, !1722, !1729, !1730, !1731, !1732, !1733, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !150, file: !99, line: 623, baseType: !153, size: 896)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierData", file: !99, line: 110, baseType: !154)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierData", file: !99, line: 99, size: 896, elements: !155)
!155 = !{!156, !158, !159, !161, !162, !163, !164, !169, !1716}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !154, file: !99, line: 100, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !154, file: !99, line: 100, baseType: !157, size: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !154, file: !99, line: 102, baseType: !160, size: 32, offset: 128)
!160 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !154, file: !99, line: 102, baseType: !160, size: 32, offset: 160)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "stackindex", scope: !154, file: !99, line: 103, baseType: !160, size: 32, offset: 192)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !154, file: !99, line: 103, baseType: !160, size: 32, offset: 224)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !154, file: !99, line: 104, baseType: !165, size: 512, offset: 256)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 512, elements: !167)
!166 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!167 = !{!168}
!168 = !DISubrange(count: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !154, file: !99, line: 107, baseType: !170, size: 64, offset: 768)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !172, line: 1216, size: 39680, elements: !173)
!172 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!173 = !{!174, !241, !245, !1018, !1021, !1022, !1023, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1049, !1052, !1055, !1279, !1282, !1582, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1612, !1613, !1614, !1615, !1616, !1624, !1690, !1697, !1698, !1705, !1708, !1709, !1710, !1711, !1712, !1713}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !171, file: !172, line: 1217, baseType: !175, size: 960)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !176, line: 130, baseType: !177)
!176 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !176, line: 117, size: 960, elements: !178)
!178 = !{!179, !181, !182, !184, !203, !207, !209, !210, !211, !212}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !177, file: !176, line: 118, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !177, file: !176, line: 118, baseType: !180, size: 64, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !177, file: !176, line: 119, baseType: !183, size: 64, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !177, file: !176, line: 120, baseType: !185, size: 64, offset: 192)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !176, line: 136, size: 17600, elements: !187)
!187 = !{!188, !189, !191, !194, !198, !199, !200}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !186, file: !176, line: 137, baseType: !175, size: 960)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !186, file: !176, line: 138, baseType: !190, size: 64, offset: 960)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !186, file: !176, line: 139, baseType: !192, size: 64, offset: 1024)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !176, line: 43, flags: DIFlagFwdDecl)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !186, file: !176, line: 140, baseType: !195, size: 8192, offset: 1088)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 8192, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 1024)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !186, file: !176, line: 141, baseType: !195, size: 8192, offset: 9280)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !186, file: !176, line: 148, baseType: !185, size: 64, offset: 17472)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !186, file: !176, line: 150, baseType: !201, size: 64, offset: 17536)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !176, line: 45, flags: DIFlagFwdDecl)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !177, file: !176, line: 121, baseType: !204, size: 528, offset: 256)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 528, elements: !205)
!205 = !{!206}
!206 = !DISubrange(count: 66)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !177, file: !176, line: 126, baseType: !208, size: 16, offset: 784)
!208 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !177, file: !176, line: 127, baseType: !160, size: 32, offset: 800)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !177, file: !176, line: 128, baseType: !160, size: 32, offset: 832)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !177, file: !176, line: 128, baseType: !160, size: 32, offset: 864)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !177, file: !176, line: 129, baseType: !213, size: 64, offset: 896)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !176, line: 75, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !176, line: 62, size: 1024, elements: !216)
!216 = !{!217, !219, !220, !221, !222, !223, !224, !225, !239, !240}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !215, file: !176, line: 63, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !215, file: !176, line: 63, baseType: !218, size: 64, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !215, file: !176, line: 64, baseType: !166, size: 8, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !215, file: !176, line: 64, baseType: !166, size: 8, offset: 136)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !215, file: !176, line: 65, baseType: !208, size: 16, offset: 144)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !215, file: !176, line: 66, baseType: !165, size: 512, offset: 160)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !215, file: !176, line: 67, baseType: !160, size: 32, offset: 672)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !215, file: !176, line: 69, baseType: !226, size: 256, offset: 704)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !176, line: 60, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !176, line: 48, size: 256, elements: !228)
!228 = !{!229, !230, !237, !238}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !227, file: !176, line: 49, baseType: !180, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !227, file: !176, line: 58, baseType: !231, size: 128, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !232, line: 71, baseType: !233)
!232 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !232, line: 69, size: 128, elements: !234)
!234 = !{!235, !236}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !233, file: !232, line: 70, baseType: !180, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !233, file: !232, line: 70, baseType: !180, size: 64, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !227, file: !176, line: 59, baseType: !160, size: 32, offset: 192)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !227, file: !176, line: 59, baseType: !160, size: 32, offset: 224)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !215, file: !176, line: 70, baseType: !160, size: 32, offset: 960)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !215, file: !176, line: 74, baseType: !160, size: 32, offset: 992)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !171, file: !172, line: 1218, baseType: !242, size: 64, offset: 960)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !244, line: 45, flags: DIFlagFwdDecl)
!244 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!245 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !171, file: !172, line: 1220, baseType: !246, size: 64, offset: 1024)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !248, line: 115, size: 11392, elements: !249)
!248 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!249 = !{!250, !251, !252, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !269, !281, !295, !296, !339, !340, !343, !344, !360, !361, !362, !363, !364, !365, !366, !370, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !386, !387, !388, !389, !390, !391, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !451, !452, !453, !454, !455, !456, !457, !458, !459, !462, !465, !468, !469, !470, !471, !472, !475, !478, !965, !966, !972, !973, !974, !975, !976, !977, !979, !982, !985, !987, !1006, !1007}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !247, file: !248, line: 116, baseType: !175, size: 960)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !247, file: !248, line: 117, baseType: !242, size: 64, offset: 960)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !247, file: !248, line: 119, baseType: !253, size: 64, offset: 1024)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !248, line: 57, flags: DIFlagFwdDecl)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !247, file: !248, line: 121, baseType: !208, size: 16, offset: 1088)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !247, file: !248, line: 121, baseType: !208, size: 16, offset: 1104)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !247, file: !248, line: 122, baseType: !160, size: 32, offset: 1120)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !247, file: !248, line: 122, baseType: !160, size: 32, offset: 1152)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !247, file: !248, line: 122, baseType: !160, size: 32, offset: 1184)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !247, file: !248, line: 123, baseType: !165, size: 512, offset: 1216)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !247, file: !248, line: 124, baseType: !246, size: 64, offset: 1728)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !247, file: !248, line: 124, baseType: !246, size: 64, offset: 1792)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !247, file: !248, line: 127, baseType: !246, size: 64, offset: 1856)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !247, file: !248, line: 127, baseType: !246, size: 64, offset: 1920)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !247, file: !248, line: 127, baseType: !246, size: 64, offset: 1984)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !247, file: !248, line: 128, baseType: !267, size: 64, offset: 2048)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !244, line: 46, flags: DIFlagFwdDecl)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !247, file: !248, line: 130, baseType: !270, size: 64, offset: 2112)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !248, line: 97, size: 832, elements: !272)
!272 = !{!273, !279, !280}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !271, file: !248, line: 98, baseType: !274, size: 768)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 768, elements: !276)
!275 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!276 = !{!277, !278}
!277 = !DISubrange(count: 8)
!278 = !DISubrange(count: 3)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !271, file: !248, line: 99, baseType: !160, size: 32, offset: 768)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !271, file: !248, line: 99, baseType: !160, size: 32, offset: 800)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !247, file: !248, line: 131, baseType: !282, size: 64, offset: 2176)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !284, line: 486, size: 1600, elements: !285)
!284 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!285 = !{!286, !287, !288, !289, !290, !291, !292, !293, !294}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !283, file: !284, line: 487, baseType: !175, size: 960)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !283, file: !284, line: 489, baseType: !231, size: 128, offset: 960)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !283, file: !284, line: 490, baseType: !231, size: 128, offset: 1088)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !283, file: !284, line: 491, baseType: !231, size: 128, offset: 1216)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !283, file: !284, line: 492, baseType: !231, size: 128, offset: 1344)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !283, file: !284, line: 494, baseType: !160, size: 32, offset: 1472)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !283, file: !284, line: 495, baseType: !160, size: 32, offset: 1504)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !283, file: !284, line: 497, baseType: !160, size: 32, offset: 1536)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !283, file: !284, line: 498, baseType: !160, size: 32, offset: 1568)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !247, file: !248, line: 132, baseType: !282, size: 64, offset: 2240)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !247, file: !248, line: 133, baseType: !297, size: 64, offset: 2304)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !284, line: 334, size: 1728, elements: !299)
!299 = !{!300, !301, !304, !305, !306, !307, !308, !309, !312, !313, !314, !315, !316, !317, !318, !338}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !298, file: !284, line: 335, baseType: !231, size: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !298, file: !284, line: 336, baseType: !302, size: 64, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !284, line: 47, flags: DIFlagFwdDecl)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !298, file: !284, line: 338, baseType: !208, size: 16, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !298, file: !284, line: 338, baseType: !208, size: 16, offset: 208)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !298, file: !284, line: 339, baseType: !7, size: 32, offset: 224)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !298, file: !284, line: 340, baseType: !160, size: 32, offset: 256)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !298, file: !284, line: 342, baseType: !275, size: 32, offset: 288)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !298, file: !284, line: 343, baseType: !310, size: 96, offset: 320)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 96, elements: !311)
!311 = !{!278}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !298, file: !284, line: 344, baseType: !310, size: 96, offset: 416)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !298, file: !284, line: 347, baseType: !231, size: 128, offset: 512)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !298, file: !284, line: 349, baseType: !160, size: 32, offset: 640)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !298, file: !284, line: 350, baseType: !160, size: 32, offset: 672)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !298, file: !284, line: 351, baseType: !180, size: 64, offset: 704)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !298, file: !284, line: 352, baseType: !180, size: 64, offset: 768)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !298, file: !284, line: 354, baseType: !319, size: 384, offset: 832)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !284, line: 116, baseType: !320)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !284, line: 94, size: 384, elements: !321)
!321 = !{!322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !320, file: !284, line: 96, baseType: !160, size: 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !320, file: !284, line: 96, baseType: !160, size: 32, offset: 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !320, file: !284, line: 97, baseType: !160, size: 32, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !320, file: !284, line: 97, baseType: !160, size: 32, offset: 96)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !320, file: !284, line: 99, baseType: !208, size: 16, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !320, file: !284, line: 100, baseType: !208, size: 16, offset: 144)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !320, file: !284, line: 102, baseType: !208, size: 16, offset: 160)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !320, file: !284, line: 105, baseType: !208, size: 16, offset: 176)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !320, file: !284, line: 108, baseType: !208, size: 16, offset: 192)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !320, file: !284, line: 109, baseType: !208, size: 16, offset: 208)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !320, file: !284, line: 111, baseType: !208, size: 16, offset: 224)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !320, file: !284, line: 112, baseType: !208, size: 16, offset: 240)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !320, file: !284, line: 114, baseType: !160, size: 32, offset: 256)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !320, file: !284, line: 114, baseType: !160, size: 32, offset: 288)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !320, file: !284, line: 115, baseType: !160, size: 32, offset: 320)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !320, file: !284, line: 115, baseType: !160, size: 32, offset: 352)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !298, file: !284, line: 355, baseType: !165, size: 512, offset: 1216)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !247, file: !248, line: 134, baseType: !180, size: 64, offset: 2368)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !247, file: !248, line: 136, baseType: !341, size: 64, offset: 2432)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !248, line: 58, flags: DIFlagFwdDecl)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !247, file: !248, line: 138, baseType: !319, size: 384, offset: 2496)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !247, file: !248, line: 139, baseType: !345, size: 64, offset: 2880)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !284, line: 80, baseType: !347)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !284, line: 72, size: 192, elements: !348)
!348 = !{!349, !356, !357, !358, !359}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !347, file: !284, line: 73, baseType: !350, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !284, line: 59, baseType: !352)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !284, line: 56, size: 128, elements: !353)
!353 = !{!354, !355}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !352, file: !284, line: 57, baseType: !310, size: 96)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !352, file: !284, line: 58, baseType: !160, size: 32, offset: 96)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !347, file: !284, line: 74, baseType: !160, size: 32, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !347, file: !284, line: 76, baseType: !160, size: 32, offset: 96)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !347, file: !284, line: 77, baseType: !160, size: 32, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !347, file: !284, line: 79, baseType: !160, size: 32, offset: 160)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !247, file: !248, line: 141, baseType: !231, size: 128, offset: 2944)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !247, file: !248, line: 142, baseType: !231, size: 128, offset: 3072)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !247, file: !248, line: 143, baseType: !231, size: 128, offset: 3200)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !247, file: !248, line: 144, baseType: !231, size: 128, offset: 3328)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !247, file: !248, line: 146, baseType: !160, size: 32, offset: 3456)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !247, file: !248, line: 147, baseType: !160, size: 32, offset: 3488)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !247, file: !248, line: 150, baseType: !367, size: 64, offset: 3520)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !248, line: 50, flags: DIFlagFwdDecl)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !247, file: !248, line: 151, baseType: !371, size: 64, offset: 3584)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !247, file: !248, line: 152, baseType: !160, size: 32, offset: 3648)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !247, file: !248, line: 153, baseType: !160, size: 32, offset: 3680)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !247, file: !248, line: 156, baseType: !310, size: 96, offset: 3712)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !247, file: !248, line: 156, baseType: !310, size: 96, offset: 3808)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !247, file: !248, line: 156, baseType: !310, size: 96, offset: 3904)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !247, file: !248, line: 157, baseType: !310, size: 96, offset: 4000)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !247, file: !248, line: 158, baseType: !310, size: 96, offset: 4096)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !247, file: !248, line: 159, baseType: !310, size: 96, offset: 4192)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !247, file: !248, line: 160, baseType: !310, size: 96, offset: 4288)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !247, file: !248, line: 160, baseType: !310, size: 96, offset: 4384)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !247, file: !248, line: 161, baseType: !383, size: 128, offset: 4480)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 128, elements: !384)
!384 = !{!385}
!385 = !DISubrange(count: 4)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !247, file: !248, line: 161, baseType: !383, size: 128, offset: 4608)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !247, file: !248, line: 162, baseType: !310, size: 96, offset: 4736)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !247, file: !248, line: 162, baseType: !310, size: 96, offset: 4832)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !247, file: !248, line: 163, baseType: !275, size: 32, offset: 4928)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !247, file: !248, line: 163, baseType: !275, size: 32, offset: 4960)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !247, file: !248, line: 164, baseType: !392, size: 512, offset: 4992)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 512, elements: !393)
!393 = !{!385, !385}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !247, file: !248, line: 165, baseType: !392, size: 512, offset: 5504)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !247, file: !248, line: 166, baseType: !392, size: 512, offset: 6016)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !247, file: !248, line: 167, baseType: !392, size: 512, offset: 6528)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !247, file: !248, line: 176, baseType: !392, size: 512, offset: 7040)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !247, file: !248, line: 178, baseType: !7, size: 32, offset: 7552)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !247, file: !248, line: 180, baseType: !208, size: 16, offset: 7584)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !247, file: !248, line: 181, baseType: !208, size: 16, offset: 7600)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !247, file: !248, line: 183, baseType: !208, size: 16, offset: 7616)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !247, file: !248, line: 183, baseType: !208, size: 16, offset: 7632)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !247, file: !248, line: 184, baseType: !208, size: 16, offset: 7648)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !247, file: !248, line: 184, baseType: !208, size: 16, offset: 7664)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !247, file: !248, line: 185, baseType: !208, size: 16, offset: 7680)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !247, file: !248, line: 186, baseType: !208, size: 16, offset: 7696)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !247, file: !248, line: 187, baseType: !208, size: 16, offset: 7712)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !247, file: !248, line: 188, baseType: !166, size: 8, offset: 7728)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !247, file: !248, line: 189, baseType: !166, size: 8, offset: 7736)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !247, file: !248, line: 192, baseType: !160, size: 32, offset: 7744)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !247, file: !248, line: 192, baseType: !160, size: 32, offset: 7776)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !247, file: !248, line: 192, baseType: !160, size: 32, offset: 7808)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !247, file: !248, line: 192, baseType: !160, size: 32, offset: 7840)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !247, file: !248, line: 194, baseType: !160, size: 32, offset: 7872)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !247, file: !248, line: 202, baseType: !275, size: 32, offset: 7904)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !247, file: !248, line: 202, baseType: !275, size: 32, offset: 7936)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !247, file: !248, line: 202, baseType: !275, size: 32, offset: 7968)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !247, file: !248, line: 211, baseType: !275, size: 32, offset: 8000)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !247, file: !248, line: 212, baseType: !275, size: 32, offset: 8032)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !247, file: !248, line: 213, baseType: !275, size: 32, offset: 8064)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !247, file: !248, line: 214, baseType: !275, size: 32, offset: 8096)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !247, file: !248, line: 215, baseType: !275, size: 32, offset: 8128)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !247, file: !248, line: 216, baseType: !275, size: 32, offset: 8160)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !247, file: !248, line: 219, baseType: !275, size: 32, offset: 8192)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !247, file: !248, line: 220, baseType: !275, size: 32, offset: 8224)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !247, file: !248, line: 221, baseType: !275, size: 32, offset: 8256)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !247, file: !248, line: 224, baseType: !428, size: 16, offset: 8288)
!428 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !247, file: !248, line: 224, baseType: !428, size: 16, offset: 8304)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !247, file: !248, line: 226, baseType: !208, size: 16, offset: 8320)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !247, file: !248, line: 228, baseType: !166, size: 8, offset: 8336)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !247, file: !248, line: 229, baseType: !166, size: 8, offset: 8344)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !247, file: !248, line: 231, baseType: !208, size: 16, offset: 8352)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !247, file: !248, line: 232, baseType: !166, size: 8, offset: 8368)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !247, file: !248, line: 233, baseType: !166, size: 8, offset: 8376)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !247, file: !248, line: 234, baseType: !275, size: 32, offset: 8384)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !247, file: !248, line: 235, baseType: !275, size: 32, offset: 8416)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !247, file: !248, line: 237, baseType: !231, size: 128, offset: 8448)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !247, file: !248, line: 238, baseType: !231, size: 128, offset: 8576)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !247, file: !248, line: 239, baseType: !231, size: 128, offset: 8704)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !247, file: !248, line: 240, baseType: !231, size: 128, offset: 8832)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !247, file: !248, line: 242, baseType: !275, size: 32, offset: 8960)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !247, file: !248, line: 244, baseType: !208, size: 16, offset: 8992)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !247, file: !248, line: 245, baseType: !428, size: 16, offset: 9008)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !247, file: !248, line: 246, baseType: !383, size: 128, offset: 9024)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !247, file: !248, line: 248, baseType: !160, size: 32, offset: 9152)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !247, file: !248, line: 249, baseType: !160, size: 32, offset: 9184)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !247, file: !248, line: 251, baseType: !449, size: 64, offset: 9216)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !248, line: 251, flags: DIFlagFwdDecl)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !247, file: !248, line: 253, baseType: !166, size: 8, offset: 9280)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !247, file: !248, line: 254, baseType: !166, size: 8, offset: 9288)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !247, file: !248, line: 255, baseType: !208, size: 16, offset: 9296)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !247, file: !248, line: 256, baseType: !310, size: 96, offset: 9312)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !247, file: !248, line: 258, baseType: !231, size: 128, offset: 9408)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !247, file: !248, line: 259, baseType: !231, size: 128, offset: 9536)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !247, file: !248, line: 260, baseType: !231, size: 128, offset: 9664)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !247, file: !248, line: 261, baseType: !231, size: 128, offset: 9792)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !247, file: !248, line: 263, baseType: !460, size: 64, offset: 9920)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !248, line: 52, flags: DIFlagFwdDecl)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !247, file: !248, line: 264, baseType: !463, size: 64, offset: 9984)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !248, line: 53, flags: DIFlagFwdDecl)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !247, file: !248, line: 265, baseType: !466, size: 64, offset: 10048)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !284, line: 46, flags: DIFlagFwdDecl)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !247, file: !248, line: 267, baseType: !166, size: 8, offset: 10112)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !247, file: !248, line: 268, baseType: !166, size: 8, offset: 10120)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !247, file: !248, line: 269, baseType: !208, size: 16, offset: 10128)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !247, file: !248, line: 270, baseType: !275, size: 32, offset: 10144)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !247, file: !248, line: 272, baseType: !473, size: 64, offset: 10176)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !248, line: 54, flags: DIFlagFwdDecl)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !247, file: !248, line: 275, baseType: !476, size: 64, offset: 10240)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !248, line: 275, flags: DIFlagFwdDecl)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !247, file: !248, line: 277, baseType: !479, size: 64, offset: 10304)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !6, line: 178, size: 13504, elements: !481)
!481 = !{!482, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !533, !536, !538, !539, !541, !542, !543, !544, !550, !555, !556, !560, !561, !562, !563, !564, !577, !589, !603, !607, !611, !615, !624, !636, !640, !644, !648, !652, !656, !657, !658, !659, !660, !661, !665, !666, !667, !668, !672, !673, !674, !675, !676, !681, !682, !683, !684, !685, !689, !690, !691, !692, !693, !700, !711, !716, !722, !732, !738, !749, !756, !763, !767, !772, !776, !781, !782, !783, !790, !796, !797, !798, !803, !804, !813, !922, !926, !934, !938, !942, !946, !954, !964}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !480, file: !6, line: 180, baseType: !483, size: 1600)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !104, line: 73, baseType: !484)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !104, line: 64, size: 1600, elements: !485)
!485 = !{!486, !501, !505, !506, !507, !508, !511}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !484, file: !104, line: 65, baseType: !487, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !104, line: 53, baseType: !489)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !104, line: 42, size: 832, elements: !490)
!490 = !{!491, !492, !493, !494, !495, !496, !497, !498, !499, !500}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !489, file: !104, line: 43, baseType: !160, size: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !489, file: !104, line: 44, baseType: !160, size: 32, offset: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !489, file: !104, line: 45, baseType: !160, size: 32, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !489, file: !104, line: 46, baseType: !160, size: 32, offset: 96)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !489, file: !104, line: 47, baseType: !160, size: 32, offset: 128)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !489, file: !104, line: 48, baseType: !160, size: 32, offset: 160)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !489, file: !104, line: 49, baseType: !160, size: 32, offset: 192)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !489, file: !104, line: 50, baseType: !160, size: 32, offset: 224)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !489, file: !104, line: 51, baseType: !165, size: 512, offset: 256)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !489, file: !104, line: 52, baseType: !180, size: 64, offset: 768)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !484, file: !104, line: 66, baseType: !502, size: 1312, offset: 64)
!502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 1312, elements: !503)
!503 = !{!504}
!504 = !DISubrange(count: 41)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !484, file: !104, line: 69, baseType: !160, size: 32, offset: 1376)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !484, file: !104, line: 69, baseType: !160, size: 32, offset: 1408)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !484, file: !104, line: 70, baseType: !160, size: 32, offset: 1440)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !484, file: !104, line: 71, baseType: !509, size: 64, offset: 1472)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !104, line: 71, flags: DIFlagFwdDecl)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !484, file: !104, line: 72, baseType: !512, size: 64, offset: 1536)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !104, line: 59, baseType: !514)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !104, line: 57, size: 8192, elements: !515)
!515 = !{!516}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !514, file: !104, line: 58, baseType: !195, size: 8192)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !480, file: !6, line: 180, baseType: !483, size: 1600, offset: 1600)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !480, file: !6, line: 180, baseType: !483, size: 1600, offset: 3200)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !480, file: !6, line: 180, baseType: !483, size: 1600, offset: 4800)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !480, file: !6, line: 180, baseType: !483, size: 1600, offset: 6400)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !480, file: !6, line: 181, baseType: !160, size: 32, offset: 8000)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !480, file: !6, line: 181, baseType: !160, size: 32, offset: 8032)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !480, file: !6, line: 181, baseType: !160, size: 32, offset: 8064)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !480, file: !6, line: 181, baseType: !160, size: 32, offset: 8096)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !480, file: !6, line: 181, baseType: !160, size: 32, offset: 8128)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !480, file: !6, line: 182, baseType: !160, size: 32, offset: 8160)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !480, file: !6, line: 183, baseType: !160, size: 32, offset: 8192)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !480, file: !6, line: 184, baseType: !529, size: 64, offset: 8256)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !530, line: 124, baseType: !531)
!530 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !530, line: 124, flags: DIFlagFwdDecl)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !480, file: !6, line: 185, baseType: !534, size: 64, offset: 8320)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !6, line: 97, flags: DIFlagFwdDecl)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !480, file: !6, line: 186, baseType: !537, size: 32, offset: 8384)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !6, line: 132, baseType: !5)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !480, file: !6, line: 187, baseType: !275, size: 32, offset: 8416)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !480, file: !6, line: 188, baseType: !540, size: 32, offset: 8448)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !6, line: 175, baseType: !12)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !480, file: !6, line: 189, baseType: !160, size: 32, offset: 8480)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !480, file: !6, line: 190, baseType: !367, size: 64, offset: 8512)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !480, file: !6, line: 193, baseType: !166, size: 8, offset: 8576)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !480, file: !6, line: 196, baseType: !545, size: 64, offset: 8640)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DISubroutineType(types: !547)
!547 = !{null, !548}
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !6, line: 177, baseType: !480)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !480, file: !6, line: 199, baseType: !551, size: 64, offset: 8704)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DISubroutineType(types: !553)
!553 = !{null, !548, !554}
!554 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !275)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !480, file: !6, line: 202, baseType: !545, size: 64, offset: 8768)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !480, file: !6, line: 207, baseType: !557, size: 64, offset: 8832)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DISubroutineType(types: !559)
!559 = !{!160, !548}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !480, file: !6, line: 208, baseType: !557, size: 64, offset: 8896)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !480, file: !6, line: 209, baseType: !557, size: 64, offset: 8960)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !480, file: !6, line: 210, baseType: !557, size: 64, offset: 9024)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !480, file: !6, line: 211, baseType: !557, size: 64, offset: 9088)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !480, file: !6, line: 218, baseType: !565, size: 64, offset: 9152)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DISubroutineType(types: !567)
!567 = !{null, !548, !160, !568}
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !570, line: 65, size: 160, elements: !571)
!570 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!571 = !{!572, !573, !575, !576}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !569, file: !570, line: 66, baseType: !310, size: 96)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !569, file: !570, line: 67, baseType: !574, size: 48, offset: 96)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 48, elements: !311)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !569, file: !570, line: 68, baseType: !166, size: 8, offset: 144)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !569, file: !570, line: 68, baseType: !166, size: 8, offset: 152)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !480, file: !6, line: 219, baseType: !578, size: 64, offset: 9216)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{null, !548, !160, !581}
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !570, line: 48, size: 96, elements: !583)
!583 = !{!584, !585, !586, !587, !588}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !582, file: !570, line: 49, baseType: !7, size: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !582, file: !570, line: 49, baseType: !7, size: 32, offset: 32)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !582, file: !570, line: 50, baseType: !166, size: 8, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !582, file: !570, line: 50, baseType: !166, size: 8, offset: 72)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !582, file: !570, line: 51, baseType: !208, size: 16, offset: 80)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !480, file: !6, line: 220, baseType: !590, size: 64, offset: 9280)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{null, !548, !160, !593}
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !570, line: 42, size: 160, elements: !595)
!595 = !{!596, !597, !598, !599, !600, !601, !602}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !594, file: !570, line: 43, baseType: !7, size: 32)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !594, file: !570, line: 43, baseType: !7, size: 32, offset: 32)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !594, file: !570, line: 43, baseType: !7, size: 32, offset: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !594, file: !570, line: 43, baseType: !7, size: 32, offset: 96)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !594, file: !570, line: 44, baseType: !208, size: 16, offset: 128)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !594, file: !570, line: 45, baseType: !166, size: 8, offset: 144)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !594, file: !570, line: 45, baseType: !166, size: 8, offset: 152)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !480, file: !6, line: 227, baseType: !604, size: 64, offset: 9344)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{!568, !548}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !480, file: !6, line: 228, baseType: !608, size: 64, offset: 9408)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{!581, !548}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !480, file: !6, line: 229, baseType: !612, size: 64, offset: 9472)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DISubroutineType(types: !614)
!614 = !{!593, !548}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !480, file: !6, line: 230, baseType: !616, size: 64, offset: 9536)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DISubroutineType(types: !618)
!618 = !{!619, !548}
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !570, line: 88, size: 64, elements: !621)
!621 = !{!622, !623}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !620, file: !570, line: 89, baseType: !7, size: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !620, file: !570, line: 90, baseType: !7, size: 32, offset: 32)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !480, file: !6, line: 231, baseType: !625, size: 64, offset: 9600)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{!628, !548}
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !570, line: 79, size: 96, elements: !630)
!630 = !{!631, !632, !633, !634, !635}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !629, file: !570, line: 81, baseType: !160, size: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !629, file: !570, line: 82, baseType: !160, size: 32, offset: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !629, file: !570, line: 83, baseType: !208, size: 16, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !629, file: !570, line: 84, baseType: !166, size: 8, offset: 80)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !629, file: !570, line: 84, baseType: !166, size: 8, offset: 88)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !480, file: !6, line: 236, baseType: !637, size: 64, offset: 9664)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DISubroutineType(types: !639)
!639 = !{null, !548, !568}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !480, file: !6, line: 237, baseType: !641, size: 64, offset: 9728)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DISubroutineType(types: !643)
!643 = !{null, !548, !581}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !480, file: !6, line: 238, baseType: !645, size: 64, offset: 9792)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DISubroutineType(types: !647)
!647 = !{null, !548, !593}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !480, file: !6, line: 239, baseType: !649, size: 64, offset: 9856)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DISubroutineType(types: !651)
!651 = !{null, !548, !619}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !480, file: !6, line: 240, baseType: !653, size: 64, offset: 9920)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DISubroutineType(types: !655)
!655 = !{null, !548, !628}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !480, file: !6, line: 245, baseType: !604, size: 64, offset: 9984)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !480, file: !6, line: 246, baseType: !608, size: 64, offset: 10048)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !480, file: !6, line: 247, baseType: !612, size: 64, offset: 10112)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !480, file: !6, line: 248, baseType: !616, size: 64, offset: 10176)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !480, file: !6, line: 249, baseType: !625, size: 64, offset: 10240)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !480, file: !6, line: 255, baseType: !662, size: 64, offset: 10304)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DISubroutineType(types: !664)
!664 = !{!180, !548, !160, !160}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !480, file: !6, line: 256, baseType: !662, size: 64, offset: 10368)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !480, file: !6, line: 257, baseType: !662, size: 64, offset: 10432)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !480, file: !6, line: 258, baseType: !662, size: 64, offset: 10496)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !480, file: !6, line: 264, baseType: !669, size: 64, offset: 10560)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DISubroutineType(types: !671)
!671 = !{!180, !548, !160}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !480, file: !6, line: 265, baseType: !669, size: 64, offset: 10624)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !480, file: !6, line: 266, baseType: !669, size: 64, offset: 10688)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !480, file: !6, line: 267, baseType: !669, size: 64, offset: 10752)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !480, file: !6, line: 268, baseType: !669, size: 64, offset: 10816)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataLayout", scope: !480, file: !6, line: 272, baseType: !677, size: 64, offset: 10880)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DISubroutineType(types: !679)
!679 = !{!680, !548}
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataLayout", scope: !480, file: !6, line: 273, baseType: !677, size: 64, offset: 10944)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataLayout", scope: !480, file: !6, line: 274, baseType: !677, size: 64, offset: 11008)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataLayout", scope: !480, file: !6, line: 275, baseType: !677, size: 64, offset: 11072)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataLayout", scope: !480, file: !6, line: 276, baseType: !677, size: 64, offset: 11136)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromVertCData", scope: !480, file: !6, line: 279, baseType: !686, size: 64, offset: 11200)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DISubroutineType(types: !688)
!688 = !{null, !548, !160, !680, !160}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromEdgeCData", scope: !480, file: !6, line: 280, baseType: !686, size: 64, offset: 11264)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromFaceCData", scope: !480, file: !6, line: 281, baseType: !686, size: 64, offset: 11328)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "getNumGrids", scope: !480, file: !6, line: 284, baseType: !557, size: 64, offset: 11392)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "getGridSize", scope: !480, file: !6, line: 285, baseType: !557, size: 64, offset: 11456)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "getGridData", scope: !480, file: !6, line: 286, baseType: !694, size: 64, offset: 11520)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DISubroutineType(types: !696)
!696 = !{!697, !548}
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !6, line: 82, flags: DIFlagFwdDecl)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "getGridAdjacency", scope: !480, file: !6, line: 287, baseType: !701, size: 64, offset: 11584)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DISubroutineType(types: !703)
!703 = !{!704, !548}
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGridAdjacency", file: !6, line: 120, baseType: !706)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMGridAdjacency", file: !6, line: 117, size: 256, elements: !707)
!707 = !{!708, !710}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !706, file: !6, line: 118, baseType: !709, size: 128)
!709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 128, elements: !384)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !706, file: !6, line: 119, baseType: !709, size: 128, offset: 128)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "getGridOffset", scope: !480, file: !6, line: 288, baseType: !712, size: 64, offset: 11648)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DISubroutineType(types: !714)
!714 = !{!715, !548}
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "getGridKey", scope: !480, file: !6, line: 289, baseType: !717, size: 64, offset: 11712)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DISubroutineType(types: !719)
!719 = !{null, !548, !720}
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGKey", file: !6, line: 83, flags: DIFlagFwdDecl)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "getGridFlagMats", scope: !480, file: !6, line: 290, baseType: !723, size: 64, offset: 11776)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DISubroutineType(types: !725)
!725 = !{!726, !548}
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFlagMat", file: !6, line: 126, baseType: !728)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMFlagMat", file: !6, line: 123, size: 32, elements: !729)
!729 = !{!730, !731}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !728, file: !6, line: 124, baseType: !208, size: 16)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !728, file: !6, line: 125, baseType: !166, size: 8, offset: 16)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "getGridHidden", scope: !480, file: !6, line: 291, baseType: !733, size: 64, offset: 11840)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DISubroutineType(types: !735)
!735 = !{!736, !548}
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedVert", scope: !480, file: !6, line: 299, baseType: !739, size: 64, offset: 11904)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{null, !548, !742, !180, !748}
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DISubroutineType(types: !744)
!744 = !{null, !180, !160, !745, !745, !746}
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !208)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMForeachFlag", file: !6, line: 162, baseType: !17)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedEdge", scope: !480, file: !6, line: 309, baseType: !750, size: 64, offset: 11968)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DISubroutineType(types: !752)
!752 = !{null, !548, !753, !180}
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{null, !180, !160, !745, !745}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedLoop", scope: !480, file: !6, line: 317, baseType: !757, size: 64, offset: 12032)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DISubroutineType(types: !759)
!759 = !{null, !548, !760, !180, !748}
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DISubroutineType(types: !762)
!762 = !{null, !180, !160, !160, !745, !745}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedFaceCenter", scope: !480, file: !6, line: 327, baseType: !764, size: 64, offset: 12096)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DISubroutineType(types: !766)
!766 = !{null, !548, !753, !180, !748}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "getMinMax", scope: !480, file: !6, line: 337, baseType: !768, size: 64, offset: 12160)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DISubroutineType(types: !770)
!770 = !{null, !548, !771, !771}
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCo", scope: !480, file: !6, line: 344, baseType: !773, size: 64, offset: 12224)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DISubroutineType(types: !775)
!775 = !{null, !548, !160, !771}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCos", scope: !480, file: !6, line: 347, baseType: !777, size: 64, offset: 12288)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DISubroutineType(types: !779)
!779 = !{null, !548, !780}
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "getVertNo", scope: !480, file: !6, line: 350, baseType: !773, size: 64, offset: 12352)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyNo", scope: !480, file: !6, line: 351, baseType: !773, size: 64, offset: 12416)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyMap", scope: !480, file: !6, line: 355, baseType: !784, size: 64, offset: 12480)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DISubroutineType(types: !786)
!786 = !{!787, !246, !548}
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !789)
!789 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !6, line: 355, flags: DIFlagFwdDecl)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "getPBVH", scope: !480, file: !6, line: 359, baseType: !791, size: 64, offset: 12544)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DISubroutineType(types: !793)
!793 = !{!794, !246, !548}
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !6, line: 100, flags: DIFlagFwdDecl)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "drawVerts", scope: !480, file: !6, line: 364, baseType: !545, size: 64, offset: 12608)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "drawUVEdges", scope: !480, file: !6, line: 367, baseType: !545, size: 64, offset: 12672)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "drawEdges", scope: !480, file: !6, line: 373, baseType: !799, size: 64, offset: 12736)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DISubroutineType(types: !801)
!801 = !{null, !548, !802, !802}
!802 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "drawLooseEdges", scope: !480, file: !6, line: 376, baseType: !545, size: 64, offset: 12800)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesSolid", scope: !480, file: !6, line: 385, baseType: !805, size: 64, offset: 12864)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DISubroutineType(types: !807)
!807 = !{null, !548, !808, !802, !809}
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetMaterial", file: !6, line: 146, baseType: !810)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DISubroutineType(types: !812)
!812 = !{!160, !160, !180}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesTex", scope: !480, file: !6, line: 391, baseType: !814, size: 64, offset: 12928)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DISubroutineType(types: !816)
!816 = !{null, !548, !817, !917, !180, !921}
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptionsTex", file: !6, line: 150, baseType: !818)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DISubroutineType(types: !820)
!820 = !{!821, !822, !916, !160}
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawOption", file: !6, line: 143, baseType: !21)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !570, line: 160, size: 384, elements: !824)
!824 = !{!825, !829, !911, !912, !913, !914, !915}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !823, file: !570, line: 161, baseType: !826, size: 256)
!826 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 256, elements: !827)
!827 = !{!385, !828}
!828 = !DISubrange(count: 2)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !823, file: !570, line: 162, baseType: !830, size: 64, offset: 256)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !832, line: 77, size: 15424, elements: !833)
!832 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!833 = !{!834, !835, !836, !839, !842, !845, !848, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !900, !901, !905}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !831, file: !832, line: 78, baseType: !175, size: 960)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !831, file: !832, line: 80, baseType: !195, size: 8192, offset: 960)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !831, file: !832, line: 82, baseType: !837, size: 64, offset: 9152)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !832, line: 43, flags: DIFlagFwdDecl)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !831, file: !832, line: 83, baseType: !840, size: 64, offset: 9216)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !176, line: 46, flags: DIFlagFwdDecl)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !831, file: !832, line: 86, baseType: !843, size: 64, offset: 9280)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !832, line: 41, flags: DIFlagFwdDecl)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !831, file: !832, line: 87, baseType: !846, size: 64, offset: 9344)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !832, line: 44, flags: DIFlagFwdDecl)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !831, file: !832, line: 89, baseType: !849, size: 512, offset: 9408)
!849 = !DICompositeType(tag: DW_TAG_array_type, baseType: !846, size: 512, elements: !850)
!850 = !{!277}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !831, file: !832, line: 90, baseType: !208, size: 16, offset: 9920)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !831, file: !832, line: 90, baseType: !208, size: 16, offset: 9936)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !831, file: !832, line: 92, baseType: !208, size: 16, offset: 9952)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !831, file: !832, line: 92, baseType: !208, size: 16, offset: 9968)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !831, file: !832, line: 93, baseType: !208, size: 16, offset: 9984)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !831, file: !832, line: 93, baseType: !208, size: 16, offset: 10000)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !831, file: !832, line: 94, baseType: !160, size: 32, offset: 10016)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !831, file: !832, line: 97, baseType: !208, size: 16, offset: 10048)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !831, file: !832, line: 97, baseType: !208, size: 16, offset: 10064)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !831, file: !832, line: 98, baseType: !208, size: 16, offset: 10080)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !831, file: !832, line: 98, baseType: !208, size: 16, offset: 10096)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !831, file: !832, line: 99, baseType: !208, size: 16, offset: 10112)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !831, file: !832, line: 99, baseType: !208, size: 16, offset: 10128)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !831, file: !832, line: 100, baseType: !7, size: 32, offset: 10144)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !831, file: !832, line: 101, baseType: !737, size: 64, offset: 10176)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !831, file: !832, line: 103, baseType: !201, size: 64, offset: 10240)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !831, file: !832, line: 104, baseType: !868, size: 64, offset: 10304)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !176, line: 159, size: 448, elements: !870)
!870 = !{!871, !874, !875, !877, !878, !880}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !869, file: !176, line: 161, baseType: !872, size: 64)
!872 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !873)
!873 = !{!828}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !869, file: !176, line: 162, baseType: !872, size: 64, offset: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !869, file: !176, line: 163, baseType: !876, size: 32, offset: 128)
!876 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 32, elements: !873)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !869, file: !176, line: 164, baseType: !876, size: 32, offset: 160)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !869, file: !176, line: 165, baseType: !879, size: 128, offset: 192)
!879 = !DICompositeType(tag: DW_TAG_array_type, baseType: !737, size: 128, elements: !873)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !869, file: !176, line: 166, baseType: !881, size: 128, offset: 320)
!881 = !DICompositeType(tag: DW_TAG_array_type, baseType: !840, size: 128, elements: !873)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !831, file: !832, line: 107, baseType: !275, size: 32, offset: 10368)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !831, file: !832, line: 108, baseType: !160, size: 32, offset: 10400)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !831, file: !832, line: 109, baseType: !208, size: 16, offset: 10432)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !831, file: !832, line: 110, baseType: !208, size: 16, offset: 10448)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !831, file: !832, line: 113, baseType: !160, size: 32, offset: 10464)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !831, file: !832, line: 113, baseType: !160, size: 32, offset: 10496)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !831, file: !832, line: 114, baseType: !166, size: 8, offset: 10528)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !831, file: !832, line: 114, baseType: !166, size: 8, offset: 10536)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !831, file: !832, line: 115, baseType: !208, size: 16, offset: 10544)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !831, file: !832, line: 116, baseType: !383, size: 128, offset: 10560)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !831, file: !832, line: 119, baseType: !275, size: 32, offset: 10688)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !831, file: !832, line: 119, baseType: !275, size: 32, offset: 10720)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !831, file: !832, line: 122, baseType: !895, size: 512, offset: 10752)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !896, line: 182, baseType: !897)
!896 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !896, line: 180, size: 512, elements: !898)
!898 = !{!899}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !897, file: !896, line: 181, baseType: !165, size: 512)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !831, file: !832, line: 123, baseType: !166, size: 8, offset: 11264)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !831, file: !832, line: 125, baseType: !902, size: 56, offset: 11272)
!902 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 56, elements: !903)
!903 = !{!904}
!904 = !DISubrange(count: 7)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !831, file: !832, line: 126, baseType: !906, size: 4096, offset: 11328)
!906 = !DICompositeType(tag: DW_TAG_array_type, baseType: !907, size: 4096, elements: !850)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !832, line: 69, baseType: !908)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !832, line: 67, size: 512, elements: !909)
!909 = !{!910}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !908, file: !832, line: 68, baseType: !165, size: 512)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !823, file: !570, line: 163, baseType: !166, size: 8, offset: 320)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !823, file: !570, line: 163, baseType: !166, size: 8, offset: 328)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !823, file: !570, line: 164, baseType: !208, size: 16, offset: 336)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !823, file: !570, line: 164, baseType: !208, size: 16, offset: 352)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !823, file: !570, line: 164, baseType: !208, size: 16, offset: 368)
!916 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !802)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCompareDrawOptions", file: !6, line: 147, baseType: !918)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DISubroutineType(types: !920)
!920 = !{!160, !180, !160, !160}
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawFlag", file: !6, line: 157, baseType: !27)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesGLSL", scope: !480, file: !6, line: 400, baseType: !923, size: 64, offset: 12992)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DISubroutineType(types: !925)
!925 = !{null, !548, !809}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFaces", scope: !480, file: !6, line: 415, baseType: !927, size: 64, offset: 13056)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DISubroutineType(types: !929)
!929 = !{null, !548, !930, !809, !917, !180, !921}
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptions", file: !6, line: 149, baseType: !931)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DISubroutineType(types: !933)
!933 = !{!821, !180, !160}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesTex", scope: !480, file: !6, line: 425, baseType: !935, size: 64, offset: 13120)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DISubroutineType(types: !937)
!937 = !{null, !548, !930, !917, !180, !921}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesGLSL", scope: !480, file: !6, line: 435, baseType: !939, size: 64, offset: 13184)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DISubroutineType(types: !941)
!941 = !{null, !548, !809, !930, !180}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdges", scope: !480, file: !6, line: 444, baseType: !943, size: 64, offset: 13248)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DISubroutineType(types: !945)
!945 = !{null, !548, !930, !180}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdgesInterp", scope: !480, file: !6, line: 455, baseType: !947, size: 64, offset: 13312)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DISubroutineType(types: !949)
!949 = !{null, !548, !930, !950, !180}
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawInterpOptions", file: !6, line: 148, baseType: !951)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DISubroutineType(types: !953)
!953 = !{null, !180, !160, !275}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesMat", scope: !480, file: !6, line: 464, baseType: !955, size: 64, offset: 13376)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DISubroutineType(types: !957)
!957 = !{null, !548, !958, !961, !180}
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DISubroutineType(types: !960)
!960 = !{null, !180, !160, !180}
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DISubroutineType(types: !963)
!963 = !{!802, !180, !160}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !480, file: !6, line: 470, baseType: !545, size: 64, offset: 13440)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !247, file: !248, line: 277, baseType: !479, size: 64, offset: 10368)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !247, file: !248, line: 278, baseType: !967, size: 64, offset: 10432)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !968, line: 27, baseType: !969)
!968 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !970, line: 45, baseType: !971)
!970 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!971 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !247, file: !248, line: 279, baseType: !967, size: 64, offset: 10496)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !247, file: !248, line: 280, baseType: !7, size: 32, offset: 10560)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !247, file: !248, line: 281, baseType: !7, size: 32, offset: 10592)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !247, file: !248, line: 283, baseType: !231, size: 128, offset: 10624)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !247, file: !248, line: 284, baseType: !231, size: 128, offset: 10752)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !247, file: !248, line: 285, baseType: !978, size: 64, offset: 10880)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !247, file: !248, line: 287, baseType: !980, size: 64, offset: 10944)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !248, line: 59, flags: DIFlagFwdDecl)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !247, file: !248, line: 288, baseType: !983, size: 64, offset: 11008)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !248, line: 288, flags: DIFlagFwdDecl)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !247, file: !248, line: 290, baseType: !986, size: 64, offset: 11072)
!986 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 64, elements: !873)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !247, file: !248, line: 291, baseType: !988, size: 64, offset: 11136)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !832, line: 65, baseType: !990)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !832, line: 50, size: 320, elements: !991)
!991 = !{!992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !990, file: !832, line: 51, baseType: !170, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !990, file: !832, line: 53, baseType: !160, size: 32, offset: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !990, file: !832, line: 54, baseType: !160, size: 32, offset: 96)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !990, file: !832, line: 55, baseType: !160, size: 32, offset: 128)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !990, file: !832, line: 55, baseType: !160, size: 32, offset: 160)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !990, file: !832, line: 56, baseType: !166, size: 8, offset: 192)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !990, file: !832, line: 56, baseType: !166, size: 8, offset: 200)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !990, file: !832, line: 57, baseType: !166, size: 8, offset: 208)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !990, file: !832, line: 57, baseType: !166, size: 8, offset: 216)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !990, file: !832, line: 59, baseType: !208, size: 16, offset: 224)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !990, file: !832, line: 59, baseType: !208, size: 16, offset: 240)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !990, file: !832, line: 59, baseType: !208, size: 16, offset: 256)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !990, file: !832, line: 61, baseType: !208, size: 16, offset: 272)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !990, file: !832, line: 63, baseType: !160, size: 32, offset: 288)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !247, file: !248, line: 293, baseType: !231, size: 128, offset: 11200)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !247, file: !248, line: 294, baseType: !1008, size: 64, offset: 11328)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !248, line: 113, baseType: !1010)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !248, line: 108, size: 256, elements: !1011)
!1011 = !{!1012, !1014, !1015, !1016, !1017}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1010, file: !248, line: 109, baseType: !1013, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1010, file: !248, line: 109, baseType: !1013, size: 64, offset: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1010, file: !248, line: 110, baseType: !246, size: 64, offset: 128)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1010, file: !248, line: 111, baseType: !160, size: 32, offset: 192)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !1010, file: !248, line: 112, baseType: !275, size: 32, offset: 224)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !171, file: !172, line: 1221, baseType: !1019, size: 64, offset: 1088)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !172, line: 52, flags: DIFlagFwdDecl)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !171, file: !172, line: 1223, baseType: !170, size: 64, offset: 1152)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !171, file: !172, line: 1225, baseType: !231, size: 128, offset: 1216)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !171, file: !172, line: 1226, baseType: !1024, size: 64, offset: 1344)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !172, line: 69, size: 320, elements: !1026)
!1026 = !{!1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1025, file: !172, line: 70, baseType: !1024, size: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1025, file: !172, line: 70, baseType: !1024, size: 64, offset: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1025, file: !172, line: 71, baseType: !7, size: 32, offset: 128)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !1025, file: !172, line: 71, baseType: !7, size: 32, offset: 160)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1025, file: !172, line: 72, baseType: !160, size: 32, offset: 192)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !1025, file: !172, line: 73, baseType: !208, size: 16, offset: 224)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !1025, file: !172, line: 73, baseType: !208, size: 16, offset: 240)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1025, file: !172, line: 74, baseType: !246, size: 64, offset: 256)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !171, file: !172, line: 1227, baseType: !246, size: 64, offset: 1408)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !171, file: !172, line: 1229, baseType: !310, size: 96, offset: 1472)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !171, file: !172, line: 1230, baseType: !310, size: 96, offset: 1568)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !171, file: !172, line: 1231, baseType: !310, size: 96, offset: 1664)
