; ModuleID = 'blender/source/blender/modifiers/intern/MOD_particleinstance.c'
source_filename = "blender/source/blender/modifiers/intern/MOD_particleinstance.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!72 = !{!73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122}
!73 = !DIEnumerator(name: "eModifierType_None", value: 0, isUnsigned: true)
!74 = !DIEnumerator(name: "eModifierType_Subsurf", value: 1, isUnsigned: true)
!75 = !DIEnumerator(name: "eModifierType_Lattice", value: 2, isUnsigned: true)
!76 = !DIEnumerator(name: "eModifierType_Curve", value: 3, isUnsigned: true)
!77 = !DIEnumerator(name: "eModifierType_Build", value: 4, isUnsigned: true)
!78 = !DIEnumerator(name: "eModifierType_Mirror", value: 5, isUnsigned: true)
!79 = !DIEnumerator(name: "eModifierType_Decimate", value: 6, isUnsigned: true)
!80 = !DIEnumerator(name: "eModifierType_Wave", value: 7, isUnsigned: true)
!81 = !DIEnumerator(name: "eModifierType_Armature", value: 8, isUnsigned: true)
!82 = !DIEnumerator(name: "eModifierType_Hook", value: 9, isUnsigned: true)
!83 = !DIEnumerator(name: "eModifierType_Softbody", value: 10, isUnsigned: true)
!84 = !DIEnumerator(name: "eModifierType_Boolean", value: 11, isUnsigned: true)
!85 = !DIEnumerator(name: "eModifierType_Array", value: 12, isUnsigned: true)
!86 = !DIEnumerator(name: "eModifierType_EdgeSplit", value: 13, isUnsigned: true)
!87 = !DIEnumerator(name: "eModifierType_Displace", value: 14, isUnsigned: true)
!88 = !DIEnumerator(name: "eModifierType_UVProject", value: 15, isUnsigned: true)
!89 = !DIEnumerator(name: "eModifierType_Smooth", value: 16, isUnsigned: true)
!90 = !DIEnumerator(name: "eModifierType_Cast", value: 17, isUnsigned: true)
!91 = !DIEnumerator(name: "eModifierType_MeshDeform", value: 18, isUnsigned: true)
!92 = !DIEnumerator(name: "eModifierType_ParticleSystem", value: 19, isUnsigned: true)
!93 = !DIEnumerator(name: "eModifierType_ParticleInstance", value: 20, isUnsigned: true)
!94 = !DIEnumerator(name: "eModifierType_Explode", value: 21, isUnsigned: true)
!95 = !DIEnumerator(name: "eModifierType_Cloth", value: 22, isUnsigned: true)
!96 = !DIEnumerator(name: "eModifierType_Collision", value: 23, isUnsigned: true)
!97 = !DIEnumerator(name: "eModifierType_Bevel", value: 24, isUnsigned: true)
!98 = !DIEnumerator(name: "eModifierType_Shrinkwrap", value: 25, isUnsigned: true)
!99 = !DIEnumerator(name: "eModifierType_Fluidsim", value: 26, isUnsigned: true)
!100 = !DIEnumerator(name: "eModifierType_Mask", value: 27, isUnsigned: true)
!101 = !DIEnumerator(name: "eModifierType_SimpleDeform", value: 28, isUnsigned: true)
!102 = !DIEnumerator(name: "eModifierType_Multires", value: 29, isUnsigned: true)
!103 = !DIEnumerator(name: "eModifierType_Surface", value: 30, isUnsigned: true)
!104 = !DIEnumerator(name: "eModifierType_Smoke", value: 31, isUnsigned: true)
!105 = !DIEnumerator(name: "eModifierType_ShapeKey", value: 32, isUnsigned: true)
!106 = !DIEnumerator(name: "eModifierType_Solidify", value: 33, isUnsigned: true)
!107 = !DIEnumerator(name: "eModifierType_Screw", value: 34, isUnsigned: true)
!108 = !DIEnumerator(name: "eModifierType_Warp", value: 35, isUnsigned: true)
!109 = !DIEnumerator(name: "eModifierType_WeightVGEdit", value: 36, isUnsigned: true)
!110 = !DIEnumerator(name: "eModifierType_WeightVGMix", value: 37, isUnsigned: true)
!111 = !DIEnumerator(name: "eModifierType_WeightVGProximity", value: 38, isUnsigned: true)
!112 = !DIEnumerator(name: "eModifierType_Ocean", value: 39, isUnsigned: true)
!113 = !DIEnumerator(name: "eModifierType_DynamicPaint", value: 40, isUnsigned: true)
!114 = !DIEnumerator(name: "eModifierType_Remesh", value: 41, isUnsigned: true)
!115 = !DIEnumerator(name: "eModifierType_Skin", value: 42, isUnsigned: true)
!116 = !DIEnumerator(name: "eModifierType_LaplacianSmooth", value: 43, isUnsigned: true)
!117 = !DIEnumerator(name: "eModifierType_Triangulate", value: 44, isUnsigned: true)
!118 = !DIEnumerator(name: "eModifierType_UVWarp", value: 45, isUnsigned: true)
!119 = !DIEnumerator(name: "eModifierType_MeshCache", value: 46, isUnsigned: true)
!120 = !DIEnumerator(name: "eModifierType_LaplacianDeform", value: 47, isUnsigned: true)
!121 = !DIEnumerator(name: "eModifierType_Wireframe", value: 48, isUnsigned: true)
!122 = !DIEnumerator(name: "NUM_MODIFIER_TYPES", value: 49, isUnsigned: true)
!123 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ModifierMode", file: !61, line: 88, baseType: !124, size: 32, elements: !125)
!124 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!125 = !{!126, !127, !128, !129, !130, !131, !132, !133}
!126 = !DIEnumerator(name: "eModifierMode_Realtime", value: 1)
!127 = !DIEnumerator(name: "eModifierMode_Render", value: 2)
!128 = !DIEnumerator(name: "eModifierMode_Editmode", value: 4)
!129 = !DIEnumerator(name: "eModifierMode_OnCage", value: 8)
!130 = !DIEnumerator(name: "eModifierMode_Expanded", value: 16)
!131 = !DIEnumerator(name: "eModifierMode_Virtual", value: 32)
!132 = !DIEnumerator(name: "eModifierMode_ApplyOnSpline", value: 64)
!133 = !DIEnumerator(name: "eModifierMode_DisableTemporary", value: -2147483648)
!134 = !{!135, !171, !259, !2064}
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParticleInstanceModifierData", file: !61, line: 697, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleInstanceModifierData", file: !61, line: 691, size: 1088, elements: !138)
!138 = !{!139, !160, !2058, !2059, !2060, !2061, !2062, !2063}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !137, file: !61, line: 692, baseType: !140, size: 896)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierData", file: !61, line: 110, baseType: !141)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierData", file: !61, line: 99, size: 896, elements: !142)
!142 = !{!143, !145, !146, !147, !148, !149, !150, !155, !158}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !141, file: !61, line: 100, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !141, file: !61, line: 100, baseType: !144, size: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !141, file: !61, line: 102, baseType: !124, size: 32, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !141, file: !61, line: 102, baseType: !124, size: 32, offset: 160)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "stackindex", scope: !141, file: !61, line: 103, baseType: !124, size: 32, offset: 192)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !141, file: !61, line: 103, baseType: !124, size: 32, offset: 224)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !141, file: !61, line: 104, baseType: !151, size: 512, offset: 256)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 512, elements: !153)
!152 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!153 = !{!154}
!154 = !DISubrange(count: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !141, file: !61, line: 107, baseType: !156, size: 64, offset: 768)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !28, line: 89, flags: DIFlagFwdDecl)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !141, file: !61, line: 109, baseType: !159, size: 64, offset: 832)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "ob", scope: !137, file: !61, line: 694, baseType: !161, size: 64, offset: 896)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !163, line: 115, size: 11392, elements: !164)
!163 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!164 = !{!165, !232, !236, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !253, !265, !279, !280, !323, !324, !327, !328, !344, !345, !346, !347, !348, !349, !350, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !369, !370, !371, !372, !373, !374, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !466, !467, !468, !469, !470, !471, !472, !473, !474, !846, !2012, !2013, !2014, !2015, !2016, !2017, !2020, !2023, !2024, !2025, !2029, !2030, !2031, !2032, !2033, !2034, !2036, !2039, !2042, !2043, !2046, !2047}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !162, file: !163, line: 116, baseType: !166, size: 960)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !167, line: 130, baseType: !168)
!167 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !167, line: 117, size: 960, elements: !169)
!169 = !{!170, !172, !173, !175, !194, !198, !200, !201, !202, !203}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !168, file: !167, line: 118, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !168, file: !167, line: 118, baseType: !171, size: 64, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !168, file: !167, line: 119, baseType: !174, size: 64, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !168, file: !167, line: 120, baseType: !176, size: 64, offset: 192)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !167, line: 136, size: 17600, elements: !178)
!178 = !{!179, !180, !182, !185, !189, !190, !191}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !177, file: !167, line: 137, baseType: !166, size: 960)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !177, file: !167, line: 138, baseType: !181, size: 64, offset: 960)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !177, file: !167, line: 139, baseType: !183, size: 64, offset: 1024)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !167, line: 43, flags: DIFlagFwdDecl)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !177, file: !167, line: 140, baseType: !186, size: 8192, offset: 1088)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 8192, elements: !187)
!187 = !{!188}
!188 = !DISubrange(count: 1024)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !177, file: !167, line: 141, baseType: !186, size: 8192, offset: 9280)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !177, file: !167, line: 148, baseType: !176, size: 64, offset: 17472)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !177, file: !167, line: 150, baseType: !192, size: 64, offset: 17536)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !167, line: 45, flags: DIFlagFwdDecl)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !168, file: !167, line: 121, baseType: !195, size: 528, offset: 256)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 528, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 66)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !168, file: !167, line: 126, baseType: !199, size: 16, offset: 784)
!199 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !168, file: !167, line: 127, baseType: !124, size: 32, offset: 800)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !168, file: !167, line: 128, baseType: !124, size: 32, offset: 832)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !168, file: !167, line: 128, baseType: !124, size: 32, offset: 864)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !168, file: !167, line: 129, baseType: !204, size: 64, offset: 896)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !167, line: 75, baseType: !206)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !167, line: 62, size: 1024, elements: !207)
!207 = !{!208, !210, !211, !212, !213, !214, !215, !216, !230, !231}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !206, file: !167, line: 63, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !206, file: !167, line: 63, baseType: !209, size: 64, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !206, file: !167, line: 64, baseType: !152, size: 8, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !206, file: !167, line: 64, baseType: !152, size: 8, offset: 136)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !206, file: !167, line: 65, baseType: !199, size: 16, offset: 144)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !206, file: !167, line: 66, baseType: !151, size: 512, offset: 160)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !206, file: !167, line: 67, baseType: !124, size: 32, offset: 672)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !206, file: !167, line: 69, baseType: !217, size: 256, offset: 704)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !167, line: 60, baseType: !218)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !167, line: 48, size: 256, elements: !219)
!219 = !{!220, !221, !228, !229}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !218, file: !167, line: 49, baseType: !171, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !218, file: !167, line: 58, baseType: !222, size: 128, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !223, line: 71, baseType: !224)
!223 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !223, line: 69, size: 128, elements: !225)
!225 = !{!226, !227}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !224, file: !223, line: 70, baseType: !171, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !224, file: !223, line: 70, baseType: !171, size: 64, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !218, file: !167, line: 59, baseType: !124, size: 32, offset: 192)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !218, file: !167, line: 59, baseType: !124, size: 32, offset: 224)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !206, file: !167, line: 70, baseType: !124, size: 32, offset: 960)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !206, file: !167, line: 74, baseType: !124, size: 32, offset: 992)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !162, file: !163, line: 117, baseType: !233, size: 64, offset: 960)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !235, line: 39, flags: DIFlagFwdDecl)
!235 = !DIFile(filename: "blender/source/blender/makesdna/DNA_particle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!236 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !162, file: !163, line: 119, baseType: !237, size: 64, offset: 1024)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !163, line: 57, flags: DIFlagFwdDecl)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !162, file: !163, line: 121, baseType: !199, size: 16, offset: 1088)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !162, file: !163, line: 121, baseType: !199, size: 16, offset: 1104)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !162, file: !163, line: 122, baseType: !124, size: 32, offset: 1120)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !162, file: !163, line: 122, baseType: !124, size: 32, offset: 1152)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !162, file: !163, line: 122, baseType: !124, size: 32, offset: 1184)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !162, file: !163, line: 123, baseType: !151, size: 512, offset: 1216)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !162, file: !163, line: 124, baseType: !161, size: 64, offset: 1728)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !162, file: !163, line: 124, baseType: !161, size: 64, offset: 1792)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !162, file: !163, line: 127, baseType: !161, size: 64, offset: 1856)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !162, file: !163, line: 127, baseType: !161, size: 64, offset: 1920)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !162, file: !163, line: 127, baseType: !161, size: 64, offset: 1984)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !162, file: !163, line: 128, baseType: !251, size: 64, offset: 2048)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !235, line: 243, flags: DIFlagFwdDecl)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !162, file: !163, line: 130, baseType: !254, size: 64, offset: 2112)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !163, line: 97, size: 832, elements: !256)
!256 = !{!257, !263, !264}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !255, file: !163, line: 98, baseType: !258, size: 768)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 768, elements: !260)
!259 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!260 = !{!261, !262}
!261 = !DISubrange(count: 8)
!262 = !DISubrange(count: 3)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !255, file: !163, line: 99, baseType: !124, size: 32, offset: 768)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !255, file: !163, line: 99, baseType: !124, size: 32, offset: 800)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !162, file: !163, line: 131, baseType: !266, size: 64, offset: 2176)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !268, line: 486, size: 1600, elements: !269)
!268 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!269 = !{!270, !271, !272, !273, !274, !275, !276, !277, !278}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !267, file: !268, line: 487, baseType: !166, size: 960)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !267, file: !268, line: 489, baseType: !222, size: 128, offset: 960)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !267, file: !268, line: 490, baseType: !222, size: 128, offset: 1088)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !267, file: !268, line: 491, baseType: !222, size: 128, offset: 1216)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !267, file: !268, line: 492, baseType: !222, size: 128, offset: 1344)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !267, file: !268, line: 494, baseType: !124, size: 32, offset: 1472)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !267, file: !268, line: 495, baseType: !124, size: 32, offset: 1504)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !267, file: !268, line: 497, baseType: !124, size: 32, offset: 1536)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !267, file: !268, line: 498, baseType: !124, size: 32, offset: 1568)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !162, file: !163, line: 132, baseType: !266, size: 64, offset: 2240)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !162, file: !163, line: 133, baseType: !281, size: 64, offset: 2304)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !268, line: 334, size: 1728, elements: !283)
!283 = !{!284, !285, !288, !289, !290, !291, !292, !293, !296, !297, !298, !299, !300, !301, !302, !322}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !282, file: !268, line: 335, baseType: !222, size: 128)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !282, file: !268, line: 336, baseType: !286, size: 64, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !268, line: 47, flags: DIFlagFwdDecl)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !282, file: !268, line: 338, baseType: !199, size: 16, offset: 192)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !282, file: !268, line: 338, baseType: !199, size: 16, offset: 208)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !282, file: !268, line: 339, baseType: !7, size: 32, offset: 224)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !282, file: !268, line: 340, baseType: !124, size: 32, offset: 256)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !282, file: !268, line: 342, baseType: !259, size: 32, offset: 288)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !282, file: !268, line: 343, baseType: !294, size: 96, offset: 320)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 96, elements: !295)
!295 = !{!262}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !282, file: !268, line: 344, baseType: !294, size: 96, offset: 416)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !282, file: !268, line: 347, baseType: !222, size: 128, offset: 512)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !282, file: !268, line: 349, baseType: !124, size: 32, offset: 640)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !282, file: !268, line: 350, baseType: !124, size: 32, offset: 672)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !282, file: !268, line: 351, baseType: !171, size: 64, offset: 704)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !282, file: !268, line: 352, baseType: !171, size: 64, offset: 768)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !282, file: !268, line: 354, baseType: !303, size: 384, offset: 832)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !268, line: 116, baseType: !304)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !268, line: 94, size: 384, elements: !305)
!305 = !{!306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !304, file: !268, line: 96, baseType: !124, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !304, file: !268, line: 96, baseType: !124, size: 32, offset: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !304, file: !268, line: 97, baseType: !124, size: 32, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !304, file: !268, line: 97, baseType: !124, size: 32, offset: 96)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !304, file: !268, line: 99, baseType: !199, size: 16, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !304, file: !268, line: 100, baseType: !199, size: 16, offset: 144)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !304, file: !268, line: 102, baseType: !199, size: 16, offset: 160)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !304, file: !268, line: 105, baseType: !199, size: 16, offset: 176)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !304, file: !268, line: 108, baseType: !199, size: 16, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !304, file: !268, line: 109, baseType: !199, size: 16, offset: 208)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !304, file: !268, line: 111, baseType: !199, size: 16, offset: 224)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !304, file: !268, line: 112, baseType: !199, size: 16, offset: 240)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !304, file: !268, line: 114, baseType: !124, size: 32, offset: 256)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !304, file: !268, line: 114, baseType: !124, size: 32, offset: 288)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !304, file: !268, line: 115, baseType: !124, size: 32, offset: 320)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !304, file: !268, line: 115, baseType: !124, size: 32, offset: 352)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !282, file: !268, line: 355, baseType: !151, size: 512, offset: 1216)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !162, file: !163, line: 134, baseType: !171, size: 64, offset: 2368)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !162, file: !163, line: 136, baseType: !325, size: 64, offset: 2432)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !163, line: 58, flags: DIFlagFwdDecl)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !162, file: !163, line: 138, baseType: !303, size: 384, offset: 2496)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !162, file: !163, line: 139, baseType: !329, size: 64, offset: 2880)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !268, line: 80, baseType: !331)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !268, line: 72, size: 192, elements: !332)
!332 = !{!333, !340, !341, !342, !343}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !331, file: !268, line: 73, baseType: !334, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !268, line: 59, baseType: !336)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !268, line: 56, size: 128, elements: !337)
!337 = !{!338, !339}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !336, file: !268, line: 57, baseType: !294, size: 96)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !336, file: !268, line: 58, baseType: !124, size: 32, offset: 96)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !331, file: !268, line: 74, baseType: !124, size: 32, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !331, file: !268, line: 76, baseType: !124, size: 32, offset: 96)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !331, file: !268, line: 77, baseType: !124, size: 32, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !331, file: !268, line: 79, baseType: !124, size: 32, offset: 160)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !162, file: !163, line: 141, baseType: !222, size: 128, offset: 2944)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !162, file: !163, line: 142, baseType: !222, size: 128, offset: 3072)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !162, file: !163, line: 143, baseType: !222, size: 128, offset: 3200)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !162, file: !163, line: 144, baseType: !222, size: 128, offset: 3328)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !162, file: !163, line: 146, baseType: !124, size: 32, offset: 3456)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !162, file: !163, line: 147, baseType: !124, size: 32, offset: 3488)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !162, file: !163, line: 150, baseType: !351, size: 64, offset: 3520)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !28, line: 190, flags: DIFlagFwdDecl)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !162, file: !163, line: 151, baseType: !159, size: 64, offset: 3584)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !162, file: !163, line: 152, baseType: !124, size: 32, offset: 3648)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !162, file: !163, line: 153, baseType: !124, size: 32, offset: 3680)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !162, file: !163, line: 156, baseType: !294, size: 96, offset: 3712)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !162, file: !163, line: 156, baseType: !294, size: 96, offset: 3808)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !162, file: !163, line: 156, baseType: !294, size: 96, offset: 3904)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !162, file: !163, line: 157, baseType: !294, size: 96, offset: 4000)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !162, file: !163, line: 158, baseType: !294, size: 96, offset: 4096)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !162, file: !163, line: 159, baseType: !294, size: 96, offset: 4192)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !162, file: !163, line: 160, baseType: !294, size: 96, offset: 4288)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !162, file: !163, line: 160, baseType: !294, size: 96, offset: 4384)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !162, file: !163, line: 161, baseType: !366, size: 128, offset: 4480)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 128, elements: !367)
!367 = !{!368}
!368 = !DISubrange(count: 4)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !162, file: !163, line: 161, baseType: !366, size: 128, offset: 4608)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !162, file: !163, line: 162, baseType: !294, size: 96, offset: 4736)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !162, file: !163, line: 162, baseType: !294, size: 96, offset: 4832)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !162, file: !163, line: 163, baseType: !259, size: 32, offset: 4928)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !162, file: !163, line: 163, baseType: !259, size: 32, offset: 4960)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !162, file: !163, line: 164, baseType: !375, size: 512, offset: 4992)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 512, elements: !376)
!376 = !{!368, !368}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !162, file: !163, line: 165, baseType: !375, size: 512, offset: 5504)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !162, file: !163, line: 166, baseType: !375, size: 512, offset: 6016)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !162, file: !163, line: 167, baseType: !375, size: 512, offset: 6528)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !162, file: !163, line: 176, baseType: !375, size: 512, offset: 7040)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !162, file: !163, line: 178, baseType: !7, size: 32, offset: 7552)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !162, file: !163, line: 180, baseType: !199, size: 16, offset: 7584)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !162, file: !163, line: 181, baseType: !199, size: 16, offset: 7600)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !162, file: !163, line: 183, baseType: !199, size: 16, offset: 7616)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !162, file: !163, line: 183, baseType: !199, size: 16, offset: 7632)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !162, file: !163, line: 184, baseType: !199, size: 16, offset: 7648)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !162, file: !163, line: 184, baseType: !199, size: 16, offset: 7664)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !162, file: !163, line: 185, baseType: !199, size: 16, offset: 7680)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !162, file: !163, line: 186, baseType: !199, size: 16, offset: 7696)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !162, file: !163, line: 187, baseType: !199, size: 16, offset: 7712)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !162, file: !163, line: 188, baseType: !152, size: 8, offset: 7728)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !162, file: !163, line: 189, baseType: !152, size: 8, offset: 7736)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !162, file: !163, line: 192, baseType: !124, size: 32, offset: 7744)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !162, file: !163, line: 192, baseType: !124, size: 32, offset: 7776)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !162, file: !163, line: 192, baseType: !124, size: 32, offset: 7808)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !162, file: !163, line: 192, baseType: !124, size: 32, offset: 7840)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !162, file: !163, line: 194, baseType: !124, size: 32, offset: 7872)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !162, file: !163, line: 202, baseType: !259, size: 32, offset: 7904)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !162, file: !163, line: 202, baseType: !259, size: 32, offset: 7936)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !162, file: !163, line: 202, baseType: !259, size: 32, offset: 7968)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !162, file: !163, line: 211, baseType: !259, size: 32, offset: 8000)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !162, file: !163, line: 212, baseType: !259, size: 32, offset: 8032)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !162, file: !163, line: 213, baseType: !259, size: 32, offset: 8064)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !162, file: !163, line: 214, baseType: !259, size: 32, offset: 8096)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !162, file: !163, line: 215, baseType: !259, size: 32, offset: 8128)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !162, file: !163, line: 216, baseType: !259, size: 32, offset: 8160)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !162, file: !163, line: 219, baseType: !259, size: 32, offset: 8192)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !162, file: !163, line: 220, baseType: !259, size: 32, offset: 8224)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !162, file: !163, line: 221, baseType: !259, size: 32, offset: 8256)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !162, file: !163, line: 224, baseType: !411, size: 16, offset: 8288)
!411 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !162, file: !163, line: 224, baseType: !411, size: 16, offset: 8304)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !162, file: !163, line: 226, baseType: !199, size: 16, offset: 8320)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !162, file: !163, line: 228, baseType: !152, size: 8, offset: 8336)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !162, file: !163, line: 229, baseType: !152, size: 8, offset: 8344)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !162, file: !163, line: 231, baseType: !199, size: 16, offset: 8352)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !162, file: !163, line: 232, baseType: !152, size: 8, offset: 8368)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !162, file: !163, line: 233, baseType: !152, size: 8, offset: 8376)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !162, file: !163, line: 234, baseType: !259, size: 32, offset: 8384)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !162, file: !163, line: 235, baseType: !259, size: 32, offset: 8416)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !162, file: !163, line: 237, baseType: !222, size: 128, offset: 8448)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !162, file: !163, line: 238, baseType: !222, size: 128, offset: 8576)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !162, file: !163, line: 239, baseType: !222, size: 128, offset: 8704)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !162, file: !163, line: 240, baseType: !222, size: 128, offset: 8832)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !162, file: !163, line: 242, baseType: !259, size: 32, offset: 8960)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !162, file: !163, line: 244, baseType: !199, size: 16, offset: 8992)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !162, file: !163, line: 245, baseType: !411, size: 16, offset: 9008)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !162, file: !163, line: 246, baseType: !366, size: 128, offset: 9024)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !162, file: !163, line: 248, baseType: !124, size: 32, offset: 9152)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !162, file: !163, line: 249, baseType: !124, size: 32, offset: 9184)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !162, file: !163, line: 251, baseType: !432, size: 64, offset: 9216)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !434, line: 215, size: 960, elements: !435)
!434 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_force.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!435 = !{!436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !433, file: !434, line: 216, baseType: !124, size: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "linStiff", scope: !433, file: !434, line: 217, baseType: !259, size: 32, offset: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "angStiff", scope: !433, file: !434, line: 218, baseType: !259, size: 32, offset: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !433, file: !434, line: 219, baseType: !259, size: 32, offset: 96)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "viterations", scope: !433, file: !434, line: 221, baseType: !124, size: 32, offset: 128)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "piterations", scope: !433, file: !434, line: 222, baseType: !124, size: 32, offset: 160)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "diterations", scope: !433, file: !434, line: 223, baseType: !124, size: 32, offset: 192)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "citerations", scope: !433, file: !434, line: 224, baseType: !124, size: 32, offset: 224)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "kSRHR_CL", scope: !433, file: !434, line: 226, baseType: !259, size: 32, offset: 256)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "kSKHR_CL", scope: !433, file: !434, line: 227, baseType: !259, size: 32, offset: 288)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "kSSHR_CL", scope: !433, file: !434, line: 228, baseType: !259, size: 32, offset: 320)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "kSR_SPLT_CL", scope: !433, file: !434, line: 229, baseType: !259, size: 32, offset: 352)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "kSK_SPLT_CL", scope: !433, file: !434, line: 231, baseType: !259, size: 32, offset: 384)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "kSS_SPLT_CL", scope: !433, file: !434, line: 232, baseType: !259, size: 32, offset: 416)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "kVCF", scope: !433, file: !434, line: 233, baseType: !259, size: 32, offset: 448)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "kDP", scope: !433, file: !434, line: 234, baseType: !259, size: 32, offset: 480)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "kDG", scope: !433, file: !434, line: 236, baseType: !259, size: 32, offset: 512)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "kLF", scope: !433, file: !434, line: 237, baseType: !259, size: 32, offset: 544)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "kPR", scope: !433, file: !434, line: 238, baseType: !259, size: 32, offset: 576)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "kVC", scope: !433, file: !434, line: 239, baseType: !259, size: 32, offset: 608)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "kDF", scope: !433, file: !434, line: 241, baseType: !259, size: 32, offset: 640)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "kMT", scope: !433, file: !434, line: 242, baseType: !259, size: 32, offset: 672)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "kCHR", scope: !433, file: !434, line: 243, baseType: !259, size: 32, offset: 704)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "kKHR", scope: !433, file: !434, line: 244, baseType: !259, size: 32, offset: 736)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "kSHR", scope: !433, file: !434, line: 246, baseType: !259, size: 32, offset: 768)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "kAHR", scope: !433, file: !434, line: 247, baseType: !259, size: 32, offset: 800)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "collisionflags", scope: !433, file: !434, line: 248, baseType: !124, size: 32, offset: 832)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "numclusteriterations", scope: !433, file: !434, line: 249, baseType: !124, size: 32, offset: 864)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "welding", scope: !433, file: !434, line: 250, baseType: !259, size: 32, offset: 896)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !433, file: !434, line: 251, baseType: !259, size: 32, offset: 928)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !162, file: !163, line: 253, baseType: !152, size: 8, offset: 9280)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !162, file: !163, line: 254, baseType: !152, size: 8, offset: 9288)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !162, file: !163, line: 255, baseType: !199, size: 16, offset: 9296)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !162, file: !163, line: 256, baseType: !294, size: 96, offset: 9312)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !162, file: !163, line: 258, baseType: !222, size: 128, offset: 9408)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !162, file: !163, line: 259, baseType: !222, size: 128, offset: 9536)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !162, file: !163, line: 260, baseType: !222, size: 128, offset: 9664)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !162, file: !163, line: 261, baseType: !222, size: 128, offset: 9792)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !162, file: !163, line: 263, baseType: !475, size: 64, offset: 9920)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !434, line: 61, size: 1280, elements: !477)
!477 = !{!478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !839, !843, !844, !845}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !476, file: !434, line: 62, baseType: !124, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "deflect", scope: !476, file: !434, line: 63, baseType: !199, size: 16, offset: 32)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "forcefield", scope: !476, file: !434, line: 64, baseType: !199, size: 16, offset: 48)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "falloff", scope: !476, file: !434, line: 65, baseType: !199, size: 16, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !476, file: !434, line: 66, baseType: !199, size: 16, offset: 80)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "tex_mode", scope: !476, file: !434, line: 67, baseType: !199, size: 16, offset: 96)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "kink", scope: !476, file: !434, line: 68, baseType: !199, size: 16, offset: 112)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "kink_axis", scope: !476, file: !434, line: 68, baseType: !199, size: 16, offset: 128)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "zdir", scope: !476, file: !434, line: 69, baseType: !199, size: 16, offset: 144)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "f_strength", scope: !476, file: !434, line: 72, baseType: !259, size: 32, offset: 160)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "f_damp", scope: !476, file: !434, line: 73, baseType: !259, size: 32, offset: 192)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "f_flow", scope: !476, file: !434, line: 74, baseType: !259, size: 32, offset: 224)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "f_size", scope: !476, file: !434, line: 77, baseType: !259, size: 32, offset: 256)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "f_power", scope: !476, file: !434, line: 80, baseType: !259, size: 32, offset: 288)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "maxdist", scope: !476, file: !434, line: 81, baseType: !259, size: 32, offset: 320)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "mindist", scope: !476, file: !434, line: 82, baseType: !259, size: 32, offset: 352)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "f_power_r", scope: !476, file: !434, line: 83, baseType: !259, size: 32, offset: 384)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "maxrad", scope: !476, file: !434, line: 84, baseType: !259, size: 32, offset: 416)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "minrad", scope: !476, file: !434, line: 85, baseType: !259, size: 32, offset: 448)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_damp", scope: !476, file: !434, line: 88, baseType: !259, size: 32, offset: 480)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_rdamp", scope: !476, file: !434, line: 89, baseType: !259, size: 32, offset: 512)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_perm", scope: !476, file: !434, line: 90, baseType: !259, size: 32, offset: 544)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_frict", scope: !476, file: !434, line: 91, baseType: !259, size: 32, offset: 576)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_rfrict", scope: !476, file: !434, line: 92, baseType: !259, size: 32, offset: 608)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_stickness", scope: !476, file: !434, line: 93, baseType: !259, size: 32, offset: 640)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "absorption", scope: !476, file: !434, line: 95, baseType: !259, size: 32, offset: 672)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_sbdamp", scope: !476, file: !434, line: 98, baseType: !259, size: 32, offset: 704)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_sbift", scope: !476, file: !434, line: 99, baseType: !259, size: 32, offset: 736)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_sboft", scope: !476, file: !434, line: 100, baseType: !259, size: 32, offset: 768)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "clump_fac", scope: !476, file: !434, line: 103, baseType: !259, size: 32, offset: 800)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "clump_pow", scope: !476, file: !434, line: 103, baseType: !259, size: 32, offset: 832)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "kink_freq", scope: !476, file: !434, line: 104, baseType: !259, size: 32, offset: 864)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "kink_shape", scope: !476, file: !434, line: 104, baseType: !259, size: 32, offset: 896)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "kink_amp", scope: !476, file: !434, line: 104, baseType: !259, size: 32, offset: 928)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "free_end", scope: !476, file: !434, line: 104, baseType: !259, size: 32, offset: 960)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "tex_nabla", scope: !476, file: !434, line: 107, baseType: !259, size: 32, offset: 992)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !476, file: !434, line: 108, baseType: !515, size: 64, offset: 1024)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !517, line: 202, size: 3328, elements: !518)
!517 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!518 = !{!519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !588, !591, !592, !675, !701, !729, !730, !808, !829, !837, !838}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !516, file: !517, line: 203, baseType: !166, size: 960)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !516, file: !517, line: 204, baseType: !233, size: 64, offset: 960)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !516, file: !517, line: 206, baseType: !259, size: 32, offset: 1024)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !516, file: !517, line: 206, baseType: !259, size: 32, offset: 1056)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !516, file: !517, line: 207, baseType: !259, size: 32, offset: 1088)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !516, file: !517, line: 207, baseType: !259, size: 32, offset: 1120)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !516, file: !517, line: 207, baseType: !259, size: 32, offset: 1152)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !516, file: !517, line: 207, baseType: !259, size: 32, offset: 1184)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !516, file: !517, line: 207, baseType: !259, size: 32, offset: 1216)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !516, file: !517, line: 207, baseType: !259, size: 32, offset: 1248)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !516, file: !517, line: 208, baseType: !259, size: 32, offset: 1280)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !516, file: !517, line: 208, baseType: !259, size: 32, offset: 1312)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !516, file: !517, line: 211, baseType: !259, size: 32, offset: 1344)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !516, file: !517, line: 211, baseType: !259, size: 32, offset: 1376)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !516, file: !517, line: 211, baseType: !259, size: 32, offset: 1408)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !516, file: !517, line: 211, baseType: !259, size: 32, offset: 1440)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !516, file: !517, line: 211, baseType: !259, size: 32, offset: 1472)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !516, file: !517, line: 214, baseType: !259, size: 32, offset: 1504)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !516, file: !517, line: 214, baseType: !259, size: 32, offset: 1536)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !516, file: !517, line: 217, baseType: !259, size: 32, offset: 1568)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !516, file: !517, line: 218, baseType: !259, size: 32, offset: 1600)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !516, file: !517, line: 219, baseType: !259, size: 32, offset: 1632)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !516, file: !517, line: 220, baseType: !259, size: 32, offset: 1664)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !516, file: !517, line: 221, baseType: !259, size: 32, offset: 1696)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !516, file: !517, line: 222, baseType: !199, size: 16, offset: 1728)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !516, file: !517, line: 222, baseType: !199, size: 16, offset: 1744)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !516, file: !517, line: 224, baseType: !199, size: 16, offset: 1760)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !516, file: !517, line: 224, baseType: !199, size: 16, offset: 1776)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !516, file: !517, line: 227, baseType: !199, size: 16, offset: 1792)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !516, file: !517, line: 227, baseType: !199, size: 16, offset: 1808)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !516, file: !517, line: 229, baseType: !199, size: 16, offset: 1824)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !516, file: !517, line: 229, baseType: !199, size: 16, offset: 1840)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !516, file: !517, line: 230, baseType: !199, size: 16, offset: 1856)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !516, file: !517, line: 230, baseType: !199, size: 16, offset: 1872)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !516, file: !517, line: 232, baseType: !259, size: 32, offset: 1888)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !516, file: !517, line: 232, baseType: !259, size: 32, offset: 1920)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !516, file: !517, line: 232, baseType: !259, size: 32, offset: 1952)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !516, file: !517, line: 232, baseType: !259, size: 32, offset: 1984)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !516, file: !517, line: 233, baseType: !124, size: 32, offset: 2016)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !516, file: !517, line: 234, baseType: !124, size: 32, offset: 2048)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !516, file: !517, line: 235, baseType: !199, size: 16, offset: 2080)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !516, file: !517, line: 235, baseType: !199, size: 16, offset: 2096)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !516, file: !517, line: 236, baseType: !199, size: 16, offset: 2112)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !516, file: !517, line: 239, baseType: !199, size: 16, offset: 2128)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !516, file: !517, line: 240, baseType: !124, size: 32, offset: 2144)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !516, file: !517, line: 241, baseType: !124, size: 32, offset: 2176)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !516, file: !517, line: 241, baseType: !124, size: 32, offset: 2208)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !516, file: !517, line: 241, baseType: !124, size: 32, offset: 2240)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !516, file: !517, line: 243, baseType: !259, size: 32, offset: 2272)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !516, file: !517, line: 243, baseType: !259, size: 32, offset: 2304)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !516, file: !517, line: 244, baseType: !259, size: 32, offset: 2336)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !516, file: !517, line: 246, baseType: !571, size: 320, offset: 2368)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !572, line: 50, size: 320, elements: !573)
!572 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!573 = !{!574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !571, file: !572, line: 51, baseType: !156, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !571, file: !572, line: 53, baseType: !124, size: 32, offset: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !571, file: !572, line: 54, baseType: !124, size: 32, offset: 96)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !571, file: !572, line: 55, baseType: !124, size: 32, offset: 128)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !571, file: !572, line: 55, baseType: !124, size: 32, offset: 160)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !571, file: !572, line: 56, baseType: !152, size: 8, offset: 192)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !571, file: !572, line: 56, baseType: !152, size: 8, offset: 200)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !571, file: !572, line: 57, baseType: !152, size: 8, offset: 208)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !571, file: !572, line: 57, baseType: !152, size: 8, offset: 216)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !571, file: !572, line: 59, baseType: !199, size: 16, offset: 224)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !571, file: !572, line: 59, baseType: !199, size: 16, offset: 240)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !571, file: !572, line: 59, baseType: !199, size: 16, offset: 256)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !571, file: !572, line: 61, baseType: !199, size: 16, offset: 272)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !571, file: !572, line: 63, baseType: !124, size: 32, offset: 288)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !516, file: !517, line: 248, baseType: !589, size: 64, offset: 2688)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !517, line: 248, flags: DIFlagFwdDecl)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !516, file: !517, line: 249, baseType: !251, size: 64, offset: 2752)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !516, file: !517, line: 250, baseType: !593, size: 64, offset: 2816)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !572, line: 77, size: 15424, elements: !595)
!595 = !{!596, !597, !598, !601, !604, !607, !610, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !629, !630, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !664, !665, !669}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !594, file: !572, line: 78, baseType: !166, size: 960)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !594, file: !572, line: 80, baseType: !186, size: 8192, offset: 960)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !594, file: !572, line: 82, baseType: !599, size: 64, offset: 9152)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !572, line: 43, flags: DIFlagFwdDecl)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !594, file: !572, line: 83, baseType: !602, size: 64, offset: 9216)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !167, line: 46, flags: DIFlagFwdDecl)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !594, file: !572, line: 86, baseType: !605, size: 64, offset: 9280)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !572, line: 41, flags: DIFlagFwdDecl)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !594, file: !572, line: 87, baseType: !608, size: 64, offset: 9344)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !572, line: 44, flags: DIFlagFwdDecl)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !594, file: !572, line: 89, baseType: !611, size: 512, offset: 9408)
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !608, size: 512, elements: !612)
!612 = !{!261}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !594, file: !572, line: 90, baseType: !199, size: 16, offset: 9920)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !594, file: !572, line: 90, baseType: !199, size: 16, offset: 9936)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !594, file: !572, line: 92, baseType: !199, size: 16, offset: 9952)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !594, file: !572, line: 92, baseType: !199, size: 16, offset: 9968)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !594, file: !572, line: 93, baseType: !199, size: 16, offset: 9984)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !594, file: !572, line: 93, baseType: !199, size: 16, offset: 10000)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !594, file: !572, line: 94, baseType: !124, size: 32, offset: 10016)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !594, file: !572, line: 97, baseType: !199, size: 16, offset: 10048)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !594, file: !572, line: 97, baseType: !199, size: 16, offset: 10064)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !594, file: !572, line: 98, baseType: !199, size: 16, offset: 10080)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !594, file: !572, line: 98, baseType: !199, size: 16, offset: 10096)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !594, file: !572, line: 99, baseType: !199, size: 16, offset: 10112)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !594, file: !572, line: 99, baseType: !199, size: 16, offset: 10128)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !594, file: !572, line: 100, baseType: !7, size: 32, offset: 10144)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !594, file: !572, line: 101, baseType: !628, size: 64, offset: 10176)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !594, file: !572, line: 103, baseType: !192, size: 64, offset: 10240)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !594, file: !572, line: 104, baseType: !631, size: 64, offset: 10304)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !167, line: 159, size: 448, elements: !633)
!633 = !{!634, !638, !639, !641, !642, !644}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !632, file: !167, line: 161, baseType: !635, size: 64)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !636)
!636 = !{!637}
!637 = !DISubrange(count: 2)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !632, file: !167, line: 162, baseType: !635, size: 64, offset: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !632, file: !167, line: 163, baseType: !640, size: 32, offset: 128)
!640 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 32, elements: !636)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !632, file: !167, line: 164, baseType: !640, size: 32, offset: 160)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !632, file: !167, line: 165, baseType: !643, size: 128, offset: 192)
!643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !628, size: 128, elements: !636)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !632, file: !167, line: 166, baseType: !645, size: 128, offset: 320)
!645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 128, elements: !636)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !594, file: !572, line: 107, baseType: !259, size: 32, offset: 10368)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !594, file: !572, line: 108, baseType: !124, size: 32, offset: 10400)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !594, file: !572, line: 109, baseType: !199, size: 16, offset: 10432)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !594, file: !572, line: 110, baseType: !199, size: 16, offset: 10448)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !594, file: !572, line: 113, baseType: !124, size: 32, offset: 10464)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !594, file: !572, line: 113, baseType: !124, size: 32, offset: 10496)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !594, file: !572, line: 114, baseType: !152, size: 8, offset: 10528)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !594, file: !572, line: 114, baseType: !152, size: 8, offset: 10536)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !594, file: !572, line: 115, baseType: !199, size: 16, offset: 10544)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !594, file: !572, line: 116, baseType: !366, size: 128, offset: 10560)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !594, file: !572, line: 119, baseType: !259, size: 32, offset: 10688)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !594, file: !572, line: 119, baseType: !259, size: 32, offset: 10720)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !594, file: !572, line: 122, baseType: !659, size: 512, offset: 10752)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !660, line: 182, baseType: !661)
!660 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !660, line: 180, size: 512, elements: !662)
!662 = !{!663}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !661, file: !660, line: 181, baseType: !151, size: 512)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !594, file: !572, line: 123, baseType: !152, size: 8, offset: 11264)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !594, file: !572, line: 125, baseType: !666, size: 56, offset: 11272)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 56, elements: !667)
!667 = !{!668}
!668 = !DISubrange(count: 7)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !594, file: !572, line: 126, baseType: !670, size: 4096, offset: 11328)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !671, size: 4096, elements: !612)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !572, line: 69, baseType: !672)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !572, line: 67, size: 512, elements: !673)
!673 = !{!674}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !672, file: !572, line: 68, baseType: !151, size: 512)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "coba", scope: !516, file: !517, line: 251, baseType: !676, size: 64, offset: 2880)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !517, line: 113, size: 6208, elements: !678)
!678 = !{!679, !680, !681, !682, !683, !684, !688}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !677, file: !517, line: 114, baseType: !199, size: 16)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !677, file: !517, line: 114, baseType: !199, size: 16, offset: 16)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !677, file: !517, line: 115, baseType: !152, size: 8, offset: 32)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !677, file: !517, line: 115, baseType: !152, size: 8, offset: 40)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !677, file: !517, line: 116, baseType: !152, size: 8, offset: 48)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !677, file: !517, line: 117, baseType: !685, size: 8, offset: 56)
!685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 8, elements: !686)
!686 = !{!687}
!687 = !DISubrange(count: 1)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !677, file: !517, line: 119, baseType: !689, size: 6144, offset: 64)
!689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !690, size: 6144, elements: !699)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !517, line: 109, baseType: !691)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !517, line: 106, size: 192, elements: !692)
!692 = !{!693, !694, !695, !696, !697, !698}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !691, file: !517, line: 107, baseType: !259, size: 32)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !691, file: !517, line: 107, baseType: !259, size: 32, offset: 32)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !691, file: !517, line: 107, baseType: !259, size: 32, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !691, file: !517, line: 107, baseType: !259, size: 32, offset: 96)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !691, file: !517, line: 107, baseType: !259, size: 32, offset: 128)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !691, file: !517, line: 108, baseType: !124, size: 32, offset: 160)
!699 = !{!700}
!700 = !DISubrange(count: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !516, file: !517, line: 252, baseType: !702, size: 64, offset: 2944)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EnvMap", file: !517, line: 122, size: 1600, elements: !704)
!704 = !{!705, !706, !707, !713, !714, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !703, file: !517, line: 123, baseType: !161, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !703, file: !517, line: 124, baseType: !593, size: 64, offset: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "cube", scope: !703, file: !517, line: 125, baseType: !708, size: 384, offset: 128)
!708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !709, size: 384, elements: !711)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !660, line: 136, flags: DIFlagFwdDecl)
!711 = !{!712}
!712 = !DISubrange(count: 6)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !703, file: !517, line: 126, baseType: !375, size: 512, offset: 512)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "obimat", scope: !703, file: !517, line: 127, baseType: !715, size: 288, offset: 1024)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 288, elements: !716)
!716 = !{!262, !262}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !703, file: !517, line: 128, baseType: !199, size: 16, offset: 1312)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !703, file: !517, line: 128, baseType: !199, size: 16, offset: 1328)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "clipsta", scope: !703, file: !517, line: 129, baseType: !259, size: 32, offset: 1344)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "clipend", scope: !703, file: !517, line: 129, baseType: !259, size: 32, offset: 1376)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "viewscale", scope: !703, file: !517, line: 130, baseType: !259, size: 32, offset: 1408)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "notlay", scope: !703, file: !517, line: 131, baseType: !7, size: 32, offset: 1440)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "cuberes", scope: !703, file: !517, line: 132, baseType: !199, size: 16, offset: 1472)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !703, file: !517, line: 132, baseType: !199, size: 16, offset: 1488)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !703, file: !517, line: 133, baseType: !124, size: 32, offset: 1504)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !703, file: !517, line: 133, baseType: !124, size: 32, offset: 1536)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !703, file: !517, line: 134, baseType: !199, size: 16, offset: 1568)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !703, file: !517, line: 134, baseType: !199, size: 16, offset: 1584)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !516, file: !517, line: 253, baseType: !631, size: 64, offset: 3008)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !516, file: !517, line: 254, baseType: !731, size: 64, offset: 3072)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointDensity", file: !517, line: 137, size: 832, elements: !733)
!733 = !{!734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !749, !750, !751, !752, !753, !755, !756, !757, !758, !759, !760}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !732, file: !517, line: 138, baseType: !199, size: 16)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_type", scope: !732, file: !517, line: 140, baseType: !199, size: 16, offset: 16)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_softness", scope: !732, file: !517, line: 141, baseType: !259, size: 32, offset: 32)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !732, file: !517, line: 142, baseType: !259, size: 32, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !732, file: !517, line: 143, baseType: !199, size: 16, offset: 96)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "color_source", scope: !732, file: !517, line: 144, baseType: !199, size: 16, offset: 112)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "totpoints", scope: !732, file: !517, line: 145, baseType: !124, size: 32, offset: 128)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "pdpad", scope: !732, file: !517, line: 147, baseType: !124, size: 32, offset: 160)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !732, file: !517, line: 149, baseType: !161, size: 64, offset: 192)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "psys", scope: !732, file: !517, line: 150, baseType: !124, size: 32, offset: 256)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "psys_cache_space", scope: !732, file: !517, line: 151, baseType: !199, size: 16, offset: 288)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "ob_cache_space", scope: !732, file: !517, line: 152, baseType: !199, size: 16, offset: 304)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "point_tree", scope: !732, file: !517, line: 154, baseType: !171, size: 64, offset: 320)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "point_data", scope: !732, file: !517, line: 155, baseType: !748, size: 64, offset: 384)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "noise_size", scope: !732, file: !517, line: 157, baseType: !259, size: 32, offset: 448)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "noise_depth", scope: !732, file: !517, line: 158, baseType: !199, size: 16, offset: 480)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "noise_influence", scope: !732, file: !517, line: 159, baseType: !199, size: 16, offset: 496)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "noise_basis", scope: !732, file: !517, line: 160, baseType: !199, size: 16, offset: 512)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "pdpad3", scope: !732, file: !517, line: 161, baseType: !754, size: 48, offset: 528)
!754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 48, elements: !295)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "noise_fac", scope: !732, file: !517, line: 162, baseType: !259, size: 32, offset: 576)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "speed_scale", scope: !732, file: !517, line: 164, baseType: !259, size: 32, offset: 608)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_speed_scale", scope: !732, file: !517, line: 164, baseType: !259, size: 32, offset: 640)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "pdpad2", scope: !732, file: !517, line: 164, baseType: !259, size: 32, offset: 672)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "coba", scope: !732, file: !517, line: 165, baseType: !676, size: 64, offset: 704)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_curve", scope: !732, file: !517, line: 167, baseType: !761, size: 64, offset: 768)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapping", file: !660, line: 72, size: 3072, elements: !763)
!763 = !{!764, !765, !766, !767, !768, !777, !778, !804, !805, !806, !807}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !762, file: !660, line: 73, baseType: !124, size: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !762, file: !660, line: 73, baseType: !124, size: 32, offset: 32)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "preset", scope: !762, file: !660, line: 74, baseType: !124, size: 32, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !762, file: !660, line: 75, baseType: !124, size: 32, offset: 96)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !762, file: !660, line: 77, baseType: !769, size: 128, offset: 128)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !770, line: 95, baseType: !771)
!770 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !770, line: 92, size: 128, elements: !772)
!772 = !{!773, !774, !775, !776}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !771, file: !770, line: 93, baseType: !259, size: 32)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !771, file: !770, line: 93, baseType: !259, size: 32, offset: 32)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !771, file: !770, line: 94, baseType: !259, size: 32, offset: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !771, file: !770, line: 94, baseType: !259, size: 32, offset: 96)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "clipr", scope: !762, file: !660, line: 77, baseType: !769, size: 128, offset: 256)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "cm", scope: !762, file: !660, line: 79, baseType: !779, size: 2304, offset: 384)
!779 = !DICompositeType(tag: DW_TAG_array_type, baseType: !780, size: 2304, elements: !367)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMap", file: !660, line: 67, baseType: !781)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMap", file: !660, line: 55, size: 576, elements: !782)
!782 = !{!783, !784, !785, !786, !787, !788, !790, !791, !800, !801, !802, !803}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "totpoint", scope: !781, file: !660, line: 56, baseType: !199, size: 16)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !781, file: !660, line: 56, baseType: !199, size: 16, offset: 16)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !781, file: !660, line: 58, baseType: !259, size: 32, offset: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "mintable", scope: !781, file: !660, line: 59, baseType: !259, size: 32, offset: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "maxtable", scope: !781, file: !660, line: 59, baseType: !259, size: 32, offset: 96)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "ext_in", scope: !781, file: !660, line: 60, baseType: !789, size: 64, offset: 128)
!789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 64, elements: !636)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "ext_out", scope: !781, file: !660, line: 60, baseType: !789, size: 64, offset: 192)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !781, file: !660, line: 61, baseType: !792, size: 64, offset: 256)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMapPoint", file: !660, line: 47, baseType: !794)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapPoint", file: !660, line: 44, size: 96, elements: !795)
!795 = !{!796, !797, !798, !799}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !794, file: !660, line: 45, baseType: !259, size: 32)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !794, file: !660, line: 45, baseType: !259, size: 32, offset: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !794, file: !660, line: 46, baseType: !199, size: 16, offset: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "shorty", scope: !794, file: !660, line: 46, baseType: !199, size: 16, offset: 80)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !781, file: !660, line: 62, baseType: !792, size: 64, offset: 320)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "premultable", scope: !781, file: !660, line: 64, baseType: !792, size: 64, offset: 384)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_in", scope: !781, file: !660, line: 65, baseType: !789, size: 64, offset: 448)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_out", scope: !781, file: !660, line: 66, baseType: !789, size: 64, offset: 512)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "black", scope: !762, file: !660, line: 80, baseType: !294, size: 96, offset: 2688)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "white", scope: !762, file: !660, line: 80, baseType: !294, size: 96, offset: 2784)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "bwmul", scope: !762, file: !660, line: 81, baseType: !294, size: 96, offset: 2880)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "sample", scope: !762, file: !660, line: 83, baseType: !294, size: 96, offset: 2976)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "vd", scope: !516, file: !517, line: 255, baseType: !809, size: 64, offset: 3136)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VoxelData", file: !517, line: 170, size: 8704, elements: !811)
!811 = !{!812, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "resol", scope: !810, file: !517, line: 171, baseType: !813, size: 96)
!813 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 96, elements: !295)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "interp_type", scope: !810, file: !517, line: 172, baseType: !124, size: 32, offset: 96)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "file_format", scope: !810, file: !517, line: 173, baseType: !199, size: 16, offset: 128)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !810, file: !517, line: 174, baseType: !199, size: 16, offset: 144)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !810, file: !517, line: 175, baseType: !199, size: 16, offset: 160)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "smoked_type", scope: !810, file: !517, line: 176, baseType: !199, size: 16, offset: 176)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !810, file: !517, line: 177, baseType: !199, size: 16, offset: 192)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !810, file: !517, line: 178, baseType: !199, size: 16, offset: 208)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !810, file: !517, line: 179, baseType: !124, size: 32, offset: 224)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !810, file: !517, line: 181, baseType: !161, size: 64, offset: 256)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "int_multiplier", scope: !810, file: !517, line: 182, baseType: !259, size: 32, offset: 320)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "still_frame", scope: !810, file: !517, line: 183, baseType: !124, size: 32, offset: 352)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "source_path", scope: !810, file: !517, line: 184, baseType: !186, size: 8192, offset: 384)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "dataset", scope: !810, file: !517, line: 187, baseType: !748, size: 64, offset: 8576)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "cachedframe", scope: !810, file: !517, line: 188, baseType: !124, size: 32, offset: 8640)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !810, file: !517, line: 189, baseType: !124, size: 32, offset: 8672)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "ot", scope: !516, file: !517, line: 256, baseType: !830, size: 64, offset: 3200)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "OceanTex", file: !517, line: 193, size: 640, elements: !832)
!832 = !{!833, !834, !835, !836}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !831, file: !517, line: 194, baseType: !161, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "oceanmod", scope: !831, file: !517, line: 195, baseType: !151, size: 512, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !831, file: !517, line: 197, baseType: !124, size: 32, offset: 576)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !831, file: !517, line: 198, baseType: !124, size: 32, offset: 608)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !516, file: !517, line: 258, baseType: !152, size: 8, offset: 3264)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !516, file: !517, line: 259, baseType: !666, size: 56, offset: 3272)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "rng", scope: !476, file: !434, line: 111, baseType: !840, size: 64, offset: 1088)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DICompositeType(tag: DW_TAG_structure_type, name: "RNG", file: !842, line: 40, flags: DIFlagFwdDecl)
!842 = !DIFile(filename: "blender/source/blender/blenlib/BLI_rand.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!843 = !DIDerivedType(tag: DW_TAG_member, name: "f_noise", scope: !476, file: !434, line: 112, baseType: !259, size: 32, offset: 1152)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "seed", scope: !476, file: !434, line: 113, baseType: !124, size: 32, offset: 1184)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "f_source", scope: !476, file: !434, line: 115, baseType: !161, size: 64, offset: 1216)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !162, file: !163, line: 264, baseType: !847, size: 64, offset: 9984)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !434, line: 268, size: 3776, elements: !849)
!849 = !{!850, !851, !852, !855, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !907, !908, !909, !2006, !2007, !2008, !2009, !2010, !2011}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "totpoint", scope: !848, file: !434, line: 270, baseType: !124, size: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "totspring", scope: !848, file: !434, line: 270, baseType: !124, size: 32, offset: 32)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "bpoint", scope: !848, file: !434, line: 271, baseType: !853, size: 64, offset: 64)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DICompositeType(tag: DW_TAG_structure_type, name: "BodyPoint", file: !434, line: 271, flags: DIFlagFwdDecl)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "bspring", scope: !848, file: !434, line: 272, baseType: !856, size: 64, offset: 128)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DICompositeType(tag: DW_TAG_structure_type, name: "BodySpring", file: !434, line: 272, flags: DIFlagFwdDecl)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !848, file: !434, line: 273, baseType: !152, size: 8, offset: 192)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "msg_lock", scope: !848, file: !434, line: 274, baseType: !152, size: 8, offset: 200)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "msg_value", scope: !848, file: !434, line: 275, baseType: !199, size: 16, offset: 208)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "nodemass", scope: !848, file: !434, line: 280, baseType: !259, size: 32, offset: 224)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "namedVG_Mass", scope: !848, file: !434, line: 281, baseType: !151, size: 512, offset: 256)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "grav", scope: !848, file: !434, line: 285, baseType: !259, size: 32, offset: 768)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "mediafrict", scope: !848, file: !434, line: 286, baseType: !259, size: 32, offset: 800)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "rklimit", scope: !848, file: !434, line: 287, baseType: !259, size: 32, offset: 832)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "physics_speed", scope: !848, file: !434, line: 288, baseType: !259, size: 32, offset: 864)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "goalspring", scope: !848, file: !434, line: 291, baseType: !259, size: 32, offset: 896)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "goalfrict", scope: !848, file: !434, line: 292, baseType: !259, size: 32, offset: 928)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "mingoal", scope: !848, file: !434, line: 293, baseType: !259, size: 32, offset: 960)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "maxgoal", scope: !848, file: !434, line: 294, baseType: !259, size: 32, offset: 992)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "defgoal", scope: !848, file: !434, line: 295, baseType: !259, size: 32, offset: 1024)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "vertgroup", scope: !848, file: !434, line: 296, baseType: !199, size: 16, offset: 1056)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "namedVG_Softgoal", scope: !848, file: !434, line: 297, baseType: !151, size: 512, offset: 1072)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "fuzzyness", scope: !848, file: !434, line: 301, baseType: !199, size: 16, offset: 1584)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "inspring", scope: !848, file: !434, line: 304, baseType: !259, size: 32, offset: 1600)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "infrict", scope: !848, file: !434, line: 305, baseType: !259, size: 32, offset: 1632)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "namedVG_Spring_K", scope: !848, file: !434, line: 306, baseType: !151, size: 512, offset: 1664)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !848, file: !434, line: 312, baseType: !124, size: 32, offset: 2176)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "efra", scope: !848, file: !434, line: 312, baseType: !124, size: 32, offset: 2208)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !848, file: !434, line: 313, baseType: !124, size: 32, offset: 2240)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "local", scope: !848, file: !434, line: 314, baseType: !199, size: 16, offset: 2272)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "solverflags", scope: !848, file: !434, line: 314, baseType: !199, size: 16, offset: 2288)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !848, file: !434, line: 317, baseType: !884, size: 64, offset: 2304)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "SBVertex", file: !434, line: 213, baseType: !887)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SBVertex", file: !434, line: 211, size: 128, elements: !888)
!888 = !{!889}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !887, file: !434, line: 212, baseType: !366, size: 128)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "totpointkey", scope: !848, file: !434, line: 318, baseType: !124, size: 32, offset: 2368)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "totkey", scope: !848, file: !434, line: 318, baseType: !124, size: 32, offset: 2400)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "secondspring", scope: !848, file: !434, line: 320, baseType: !259, size: 32, offset: 2432)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "colball", scope: !848, file: !434, line: 323, baseType: !259, size: 32, offset: 2464)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "balldamp", scope: !848, file: !434, line: 324, baseType: !259, size: 32, offset: 2496)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "ballstiff", scope: !848, file: !434, line: 325, baseType: !259, size: 32, offset: 2528)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "sbc_mode", scope: !848, file: !434, line: 326, baseType: !199, size: 16, offset: 2560)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "aeroedge", scope: !848, file: !434, line: 327, baseType: !199, size: 16, offset: 2576)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "minloops", scope: !848, file: !434, line: 328, baseType: !199, size: 16, offset: 2592)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "maxloops", scope: !848, file: !434, line: 329, baseType: !199, size: 16, offset: 2608)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "choke", scope: !848, file: !434, line: 330, baseType: !199, size: 16, offset: 2624)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "solver_ID", scope: !848, file: !434, line: 331, baseType: !199, size: 16, offset: 2640)
