; ModuleID = 'blender/source/blender/editors/mesh/editmesh_select.c'
source_filename = "blender/source/blender/editors/mesh/editmesh_select.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BMVert = type { %struct.BMHeader, %struct.BMFlagLayer*, [3 x float], [3 x float], %struct.BMEdge* }
%struct.BMHeader = type { i8*, i32, i8, i8, i8 }
%struct.BMFlagLayer = type { i16 }
%struct.BMEdge = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMVert*, %struct.BMVert*, %struct.BMLoop*, %struct.BMDiskLink, %struct.BMDiskLink }
%struct.BMLoop = type { %struct.BMHeader, %struct.BMVert*, %struct.BMEdge*, %struct.BMFace*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop* }
%struct.BMFace = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMLoop*, i32, [3 x float], i16 }
%struct.BMDiskLink = type { %struct.BMEdge*, %struct.BMEdge* }
%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.BMEditMesh = type { %struct.BMesh*, %struct.BMEditMesh*, i32, [3 x %struct.BMLoop*]*, i32, %struct.DerivedMesh*, %struct.DerivedMesh*, i64, [4 x i8]*, i32, [4 x i8]*, i32, i16, i16, %struct.Object*, i32 }

!224 = !DIEnumerator(name: "V3D_PROJ_RET_CLIP_BB", value: 3, isUnsigned: true)
!225 = !DIEnumerator(name: "V3D_PROJ_RET_CLIP_WIN", value: 4, isUnsigned: true)
!226 = !DIEnumerator(name: "V3D_PROJ_RET_OVERFLOW", value: 5, isUnsigned: true)
!227 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !228, line: 83, baseType: !7, size: 32, elements: !229)
!228 = !DIFile(filename: "blender/source/blender/blenlib/BLI_mempool.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!229 = !{!230, !231}
!230 = !DIEnumerator(name: "BLI_MEMPOOL_NOP", value: 0, isUnsigned: true)
!231 = !DIEnumerator(name: "BLI_MEMPOOL_ALLOW_ITER", value: 1, isUnsigned: true)
!232 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !233, line: 76, baseType: !7, size: 32, elements: !234)
!233 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!234 = !{!235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275}
!235 = !DIEnumerator(name: "CD_MVERT", value: 0, isUnsigned: true)
!236 = !DIEnumerator(name: "CD_MSTICKY", value: 1, isUnsigned: true)
!237 = !DIEnumerator(name: "CD_MDEFORMVERT", value: 2, isUnsigned: true)
!238 = !DIEnumerator(name: "CD_MEDGE", value: 3, isUnsigned: true)
!239 = !DIEnumerator(name: "CD_MFACE", value: 4, isUnsigned: true)
!240 = !DIEnumerator(name: "CD_MTFACE", value: 5, isUnsigned: true)
!241 = !DIEnumerator(name: "CD_MCOL", value: 6, isUnsigned: true)
!242 = !DIEnumerator(name: "CD_ORIGINDEX", value: 7, isUnsigned: true)
!243 = !DIEnumerator(name: "CD_NORMAL", value: 8, isUnsigned: true)
!244 = !DIEnumerator(name: "CD_PROP_FLT", value: 10, isUnsigned: true)
!245 = !DIEnumerator(name: "CD_PROP_INT", value: 11, isUnsigned: true)
!246 = !DIEnumerator(name: "CD_PROP_STR", value: 12, isUnsigned: true)
!247 = !DIEnumerator(name: "CD_ORIGSPACE", value: 13, isUnsigned: true)
!248 = !DIEnumerator(name: "CD_ORCO", value: 14, isUnsigned: true)
!249 = !DIEnumerator(name: "CD_MTEXPOLY", value: 15, isUnsigned: true)
!250 = !DIEnumerator(name: "CD_MLOOPUV", value: 16, isUnsigned: true)
!251 = !DIEnumerator(name: "CD_MLOOPCOL", value: 17, isUnsigned: true)
!252 = !DIEnumerator(name: "CD_TANGENT", value: 18, isUnsigned: true)
!253 = !DIEnumerator(name: "CD_MDISPS", value: 19, isUnsigned: true)
!254 = !DIEnumerator(name: "CD_PREVIEW_MCOL", value: 20, isUnsigned: true)
!255 = !DIEnumerator(name: "CD_ID_MCOL", value: 21, isUnsigned: true)
!256 = !DIEnumerator(name: "CD_TEXTURE_MCOL", value: 22, isUnsigned: true)
!257 = !DIEnumerator(name: "CD_CLOTH_ORCO", value: 23, isUnsigned: true)
!258 = !DIEnumerator(name: "CD_RECAST", value: 24, isUnsigned: true)
!259 = !DIEnumerator(name: "CD_MPOLY", value: 25, isUnsigned: true)
!260 = !DIEnumerator(name: "CD_MLOOP", value: 26, isUnsigned: true)
!261 = !DIEnumerator(name: "CD_SHAPE_KEYINDEX", value: 27, isUnsigned: true)
!262 = !DIEnumerator(name: "CD_SHAPEKEY", value: 28, isUnsigned: true)
!263 = !DIEnumerator(name: "CD_BWEIGHT", value: 29, isUnsigned: true)
!264 = !DIEnumerator(name: "CD_CREASE", value: 30, isUnsigned: true)
!265 = !DIEnumerator(name: "CD_ORIGSPACE_MLOOP", value: 31, isUnsigned: true)
!266 = !DIEnumerator(name: "CD_PREVIEW_MLOOPCOL", value: 32, isUnsigned: true)
!267 = !DIEnumerator(name: "CD_BM_ELEM_PYPTR", value: 33, isUnsigned: true)
!268 = !DIEnumerator(name: "CD_PAINT_MASK", value: 34, isUnsigned: true)
!269 = !DIEnumerator(name: "CD_GRID_PAINT_MASK", value: 35, isUnsigned: true)
!270 = !DIEnumerator(name: "CD_MVERT_SKIN", value: 36, isUnsigned: true)
!271 = !DIEnumerator(name: "CD_FREESTYLE_EDGE", value: 37, isUnsigned: true)
!272 = !DIEnumerator(name: "CD_FREESTYLE_FACE", value: 38, isUnsigned: true)
!273 = !DIEnumerator(name: "CD_MLOOPTANGENT", value: 39, isUnsigned: true)
!274 = !DIEnumerator(name: "CD_TESSLOOPNORMAL", value: 40, isUnsigned: true)
!275 = !DIEnumerator(name: "CD_NUMTYPES", value: 41, isUnsigned: true)
!276 = !{!277, !288, !2666, !364, !2669, !2670, !2671, !620, !681, !685, !663, !304, !2675, !1037, !317, !2677, !983, !680, !2683, !726}
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mesh", file: !279, line: 133, baseType: !280)
!279 = !DIFile(filename: "blender/source/blender/makesdna/DNA_mesh_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mesh", file: !279, line: 58, size: 11008, elements: !281)
!281 = !{!282, !354, !358, !370, !373, !377, !381, !388, !397, !493, !499, !506, !514, !525, !538, !551, !562, !571, !583, !591, !593, !2618, !2619, !2620, !2621, !2622, !2623, !2624, !2625, !2626, !2627, !2628, !2629, !2630, !2631, !2632, !2633, !2634, !2635, !2636, !2637, !2638, !2639, !2640, !2641, !2642, !2643, !2644, !2645}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !280, file: !279, line: 59, baseType: !283, size: 960)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !284, line: 130, baseType: !285)
!284 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !284, line: 117, size: 960, elements: !286)
!286 = !{!287, !289, !290, !292, !312, !316, !318, !320, !321, !322}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !285, file: !284, line: 118, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !285, file: !284, line: 118, baseType: !288, size: 64, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !285, file: !284, line: 119, baseType: !291, size: 64, offset: 128)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !285, file: !284, line: 120, baseType: !293, size: 64, offset: 192)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !284, line: 136, size: 17600, elements: !295)
!295 = !{!296, !297, !299, !302, !307, !308, !309}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !294, file: !284, line: 137, baseType: !283, size: 960)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !294, file: !284, line: 138, baseType: !298, size: 64, offset: 960)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !294, file: !284, line: 139, baseType: !300, size: 64, offset: 1024)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !284, line: 43, flags: DIFlagFwdDecl)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !294, file: !284, line: 140, baseType: !303, size: 8192, offset: 1088)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !304, size: 8192, elements: !305)
!304 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!305 = !{!306}
!306 = !DISubrange(count: 1024)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !294, file: !284, line: 141, baseType: !303, size: 8192, offset: 9280)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !294, file: !284, line: 148, baseType: !293, size: 64, offset: 17472)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !294, file: !284, line: 150, baseType: !310, size: 64, offset: 17536)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !284, line: 45, flags: DIFlagFwdDecl)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !285, file: !284, line: 121, baseType: !313, size: 528, offset: 256)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !304, size: 528, elements: !314)
!314 = !{!315}
!315 = !DISubrange(count: 66)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !285, file: !284, line: 126, baseType: !317, size: 16, offset: 784)
!317 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !285, file: !284, line: 127, baseType: !319, size: 32, offset: 800)
!319 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !285, file: !284, line: 128, baseType: !319, size: 32, offset: 832)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !285, file: !284, line: 128, baseType: !319, size: 32, offset: 864)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !285, file: !284, line: 129, baseType: !323, size: 64, offset: 896)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !284, line: 75, baseType: !325)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !284, line: 62, size: 1024, elements: !326)
!326 = !{!327, !329, !330, !331, !332, !333, !337, !338, !352, !353}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !325, file: !284, line: 63, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !325, file: !284, line: 63, baseType: !328, size: 64, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !325, file: !284, line: 64, baseType: !304, size: 8, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !325, file: !284, line: 64, baseType: !304, size: 8, offset: 136)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !325, file: !284, line: 65, baseType: !317, size: 16, offset: 144)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !325, file: !284, line: 66, baseType: !334, size: 512, offset: 160)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !304, size: 512, elements: !335)
!335 = !{!336}
!336 = !DISubrange(count: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !325, file: !284, line: 67, baseType: !319, size: 32, offset: 672)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !325, file: !284, line: 69, baseType: !339, size: 256, offset: 704)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !284, line: 60, baseType: !340)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !284, line: 48, size: 256, elements: !341)
!341 = !{!342, !343, !350, !351}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !340, file: !284, line: 49, baseType: !288, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !340, file: !284, line: 58, baseType: !344, size: 128, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !345, line: 71, baseType: !346)
!345 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !345, line: 69, size: 128, elements: !347)
!347 = !{!348, !349}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !346, file: !345, line: 70, baseType: !288, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !346, file: !345, line: 70, baseType: !288, size: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !340, file: !284, line: 59, baseType: !319, size: 32, offset: 192)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !340, file: !284, line: 59, baseType: !319, size: 32, offset: 224)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !325, file: !284, line: 70, baseType: !319, size: 32, offset: 960)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !325, file: !284, line: 74, baseType: !319, size: 32, offset: 992)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !280, file: !279, line: 60, baseType: !355, size: 64, offset: 960)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !357, line: 45, flags: DIFlagFwdDecl)
!357 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!358 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !280, file: !279, line: 62, baseType: !359, size: 64, offset: 1024)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !75, line: 97, size: 832, elements: !361)
!361 = !{!362, !368, !369}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !360, file: !75, line: 98, baseType: !363, size: 768)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !364, size: 768, elements: !365)
!364 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!365 = !{!366, !367}
!366 = !DISubrange(count: 8)
!367 = !DISubrange(count: 3)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !360, file: !75, line: 99, baseType: !319, size: 32, offset: 768)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !360, file: !75, line: 99, baseType: !319, size: 32, offset: 800)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !280, file: !279, line: 64, baseType: !371, size: 64, offset: 1088)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !357, line: 46, flags: DIFlagFwdDecl)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !280, file: !279, line: 65, baseType: !374, size: 64, offset: 1152)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "Key", file: !376, line: 45, flags: DIFlagFwdDecl)
!376 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!377 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !280, file: !279, line: 66, baseType: !378, size: 64, offset: 1216)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !376, line: 46, flags: DIFlagFwdDecl)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "mselect", scope: !280, file: !279, line: 67, baseType: !382, size: 64, offset: 1280)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MSelect", file: !384, line: 154, size: 64, elements: !385)
!384 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!385 = !{!386, !387}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !383, file: !384, line: 155, baseType: !319, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !383, file: !384, line: 156, baseType: !319, size: 32, offset: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "mpoly", scope: !280, file: !279, line: 71, baseType: !389, size: 64, offset: 1344)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !384, line: 79, size: 96, elements: !391)
!391 = !{!392, !393, !394, !395, !396}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !390, file: !384, line: 81, baseType: !319, size: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !390, file: !384, line: 82, baseType: !319, size: 32, offset: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !390, file: !384, line: 83, baseType: !317, size: 16, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !390, file: !384, line: 84, baseType: !304, size: 8, offset: 80)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !390, file: !384, line: 84, baseType: !304, size: 8, offset: 88)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "mtpoly", scope: !280, file: !279, line: 72, baseType: !398, size: 64, offset: 1408)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTexPoly", file: !384, line: 93, size: 128, elements: !400)
!400 = !{!401, !488, !489, !490, !491, !492}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !399, file: !384, line: 94, baseType: !402, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !404, line: 77, size: 15424, elements: !405)
!404 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!405 = !{!406, !407, !408, !411, !414, !417, !420, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !439, !440, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !469, !470, !471, !477, !478, !482}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !403, file: !404, line: 78, baseType: !283, size: 960)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !403, file: !404, line: 80, baseType: !303, size: 8192, offset: 960)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !403, file: !404, line: 82, baseType: !409, size: 64, offset: 9152)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !404, line: 43, flags: DIFlagFwdDecl)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !403, file: !404, line: 83, baseType: !412, size: 64, offset: 9216)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !284, line: 46, flags: DIFlagFwdDecl)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !403, file: !404, line: 86, baseType: !415, size: 64, offset: 9280)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !404, line: 41, flags: DIFlagFwdDecl)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !403, file: !404, line: 87, baseType: !418, size: 64, offset: 9344)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !404, line: 44, flags: DIFlagFwdDecl)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !403, file: !404, line: 89, baseType: !421, size: 512, offset: 9408)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !418, size: 512, elements: !422)
!422 = !{!366}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !403, file: !404, line: 90, baseType: !317, size: 16, offset: 9920)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !403, file: !404, line: 90, baseType: !317, size: 16, offset: 9936)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !403, file: !404, line: 92, baseType: !317, size: 16, offset: 9952)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !403, file: !404, line: 92, baseType: !317, size: 16, offset: 9968)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !403, file: !404, line: 93, baseType: !317, size: 16, offset: 9984)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !403, file: !404, line: 93, baseType: !317, size: 16, offset: 10000)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !403, file: !404, line: 94, baseType: !319, size: 32, offset: 10016)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !403, file: !404, line: 97, baseType: !317, size: 16, offset: 10048)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !403, file: !404, line: 97, baseType: !317, size: 16, offset: 10064)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !403, file: !404, line: 98, baseType: !317, size: 16, offset: 10080)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !403, file: !404, line: 98, baseType: !317, size: 16, offset: 10096)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !403, file: !404, line: 99, baseType: !317, size: 16, offset: 10112)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !403, file: !404, line: 99, baseType: !317, size: 16, offset: 10128)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !403, file: !404, line: 100, baseType: !7, size: 32, offset: 10144)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !403, file: !404, line: 101, baseType: !438, size: 64, offset: 10176)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !403, file: !404, line: 103, baseType: !310, size: 64, offset: 10240)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !403, file: !404, line: 104, baseType: !441, size: 64, offset: 10304)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !284, line: 159, size: 448, elements: !443)
!443 = !{!444, !448, !449, !451, !452, !454}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !442, file: !284, line: 161, baseType: !445, size: 64)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !446)
!446 = !{!447}
!447 = !DISubrange(count: 2)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !442, file: !284, line: 162, baseType: !445, size: 64, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !442, file: !284, line: 163, baseType: !450, size: 32, offset: 128)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 32, elements: !446)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !442, file: !284, line: 164, baseType: !450, size: 32, offset: 160)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !442, file: !284, line: 165, baseType: !453, size: 128, offset: 192)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !438, size: 128, elements: !446)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !442, file: !284, line: 166, baseType: !455, size: 128, offset: 320)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !412, size: 128, elements: !446)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !403, file: !404, line: 107, baseType: !364, size: 32, offset: 10368)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !403, file: !404, line: 108, baseType: !319, size: 32, offset: 10400)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !403, file: !404, line: 109, baseType: !317, size: 16, offset: 10432)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !403, file: !404, line: 110, baseType: !317, size: 16, offset: 10448)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !403, file: !404, line: 113, baseType: !319, size: 32, offset: 10464)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !403, file: !404, line: 113, baseType: !319, size: 32, offset: 10496)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !403, file: !404, line: 114, baseType: !304, size: 8, offset: 10528)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !403, file: !404, line: 114, baseType: !304, size: 8, offset: 10536)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !403, file: !404, line: 115, baseType: !317, size: 16, offset: 10544)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !403, file: !404, line: 116, baseType: !466, size: 128, offset: 10560)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !364, size: 128, elements: !467)
!467 = !{!468}
!468 = !DISubrange(count: 4)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !403, file: !404, line: 119, baseType: !364, size: 32, offset: 10688)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !403, file: !404, line: 119, baseType: !364, size: 32, offset: 10720)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !403, file: !404, line: 122, baseType: !472, size: 512, offset: 10752)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !473, line: 182, baseType: !474)
!473 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !473, line: 180, size: 512, elements: !475)
!475 = !{!476}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !474, file: !473, line: 181, baseType: !334, size: 512)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !403, file: !404, line: 123, baseType: !304, size: 8, offset: 11264)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !403, file: !404, line: 125, baseType: !479, size: 56, offset: 11272)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !304, size: 56, elements: !480)
!480 = !{!481}
!481 = !DISubrange(count: 7)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !403, file: !404, line: 126, baseType: !483, size: 4096, offset: 11328)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !484, size: 4096, elements: !422)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !404, line: 69, baseType: !485)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !404, line: 67, size: 512, elements: !486)
!486 = !{!487}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !485, file: !404, line: 68, baseType: !334, size: 512)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !399, file: !384, line: 95, baseType: !304, size: 8, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !399, file: !384, line: 95, baseType: !304, size: 8, offset: 72)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !399, file: !384, line: 96, baseType: !317, size: 16, offset: 80)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !399, file: !384, line: 96, baseType: !317, size: 16, offset: 96)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !399, file: !384, line: 96, baseType: !317, size: 16, offset: 112)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "mloop", scope: !280, file: !279, line: 73, baseType: !494, size: 64, offset: 1472)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !384, line: 88, size: 64, elements: !496)
!496 = !{!497, !498}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !495, file: !384, line: 89, baseType: !7, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !495, file: !384, line: 90, baseType: !7, size: 32, offset: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "mloopuv", scope: !280, file: !279, line: 74, baseType: !500, size: 64, offset: 1536)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoopUV", file: !384, line: 109, size: 96, elements: !502)
!502 = !{!503, !505}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !501, file: !384, line: 110, baseType: !504, size: 64)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !364, size: 64, elements: !446)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !501, file: !384, line: 111, baseType: !319, size: 32, offset: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "mloopcol", scope: !280, file: !279, line: 75, baseType: !507, size: 64, offset: 1600)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoopCol", file: !384, line: 129, size: 32, elements: !509)
!509 = !{!510, !511, !512, !513}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !508, file: !384, line: 130, baseType: !304, size: 8)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !508, file: !384, line: 130, baseType: !304, size: 8, offset: 8)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !508, file: !384, line: 130, baseType: !304, size: 8, offset: 16)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !508, file: !384, line: 130, baseType: !304, size: 8, offset: 24)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "mface", scope: !280, file: !279, line: 80, baseType: !515, size: 64, offset: 1664)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !384, line: 42, size: 160, elements: !517)
!517 = !{!518, !519, !520, !521, !522, !523, !524}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !516, file: !384, line: 43, baseType: !7, size: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !516, file: !384, line: 43, baseType: !7, size: 32, offset: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !516, file: !384, line: 43, baseType: !7, size: 32, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !516, file: !384, line: 43, baseType: !7, size: 32, offset: 96)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !516, file: !384, line: 44, baseType: !317, size: 16, offset: 128)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !516, file: !384, line: 45, baseType: !304, size: 8, offset: 144)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !516, file: !384, line: 45, baseType: !304, size: 8, offset: 152)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "mtface", scope: !280, file: !279, line: 81, baseType: !526, size: 64, offset: 1728)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !384, line: 160, size: 384, elements: !528)
!528 = !{!529, !532, !533, !534, !535, !536, !537}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !527, file: !384, line: 161, baseType: !530, size: 256)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !364, size: 256, elements: !531)
!531 = !{!468, !447}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !527, file: !384, line: 162, baseType: !402, size: 64, offset: 256)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !527, file: !384, line: 163, baseType: !304, size: 8, offset: 320)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !527, file: !384, line: 163, baseType: !304, size: 8, offset: 328)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !527, file: !384, line: 164, baseType: !317, size: 16, offset: 336)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !527, file: !384, line: 164, baseType: !317, size: 16, offset: 352)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !527, file: !384, line: 164, baseType: !317, size: 16, offset: 368)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "tface", scope: !280, file: !279, line: 82, baseType: !539, size: 64, offset: 1792)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TFace", file: !279, line: 136, size: 512, elements: !541)
!541 = !{!542, !543, !544, !546, !547, !548, !549, !550}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !540, file: !279, line: 137, baseType: !288, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !540, file: !279, line: 138, baseType: !530, size: 256, offset: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !540, file: !279, line: 139, baseType: !545, size: 128, offset: 320)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128, elements: !467)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !540, file: !279, line: 140, baseType: !304, size: 8, offset: 448)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !540, file: !279, line: 140, baseType: !304, size: 8, offset: 456)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !540, file: !279, line: 141, baseType: !317, size: 16, offset: 464)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !540, file: !279, line: 141, baseType: !317, size: 16, offset: 480)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !540, file: !279, line: 141, baseType: !317, size: 16, offset: 496)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "mvert", scope: !280, file: !279, line: 83, baseType: !552, size: 64, offset: 1856)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !384, line: 65, size: 160, elements: !554)
!554 = !{!555, !558, !560, !561}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !553, file: !384, line: 66, baseType: !556, size: 96)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !364, size: 96, elements: !557)
!557 = !{!367}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !553, file: !384, line: 67, baseType: !559, size: 48, offset: 96)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 48, elements: !557)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !553, file: !384, line: 68, baseType: !304, size: 8, offset: 144)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !553, file: !384, line: 68, baseType: !304, size: 8, offset: 152)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "medge", scope: !280, file: !279, line: 84, baseType: !563, size: 64, offset: 1920)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !384, line: 48, size: 96, elements: !565)
!565 = !{!566, !567, !568, !569, !570}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !564, file: !384, line: 49, baseType: !7, size: 32)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !564, file: !384, line: 49, baseType: !7, size: 32, offset: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !564, file: !384, line: 50, baseType: !304, size: 8, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !564, file: !384, line: 50, baseType: !304, size: 8, offset: 72)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !564, file: !384, line: 51, baseType: !317, size: 16, offset: 80)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "dvert", scope: !280, file: !279, line: 85, baseType: !572, size: 64, offset: 1984)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !384, line: 59, size: 128, elements: !574)
!574 = !{!575, !581, !582}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "dw", scope: !573, file: !384, line: 60, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformWeight", file: !384, line: 54, size: 64, elements: !578)
!578 = !{!579, !580}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "def_nr", scope: !577, file: !384, line: 55, baseType: !319, size: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !577, file: !384, line: 56, baseType: !364, size: 32, offset: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "totweight", scope: !573, file: !384, line: 61, baseType: !319, size: 32, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !573, file: !384, line: 62, baseType: !319, size: 32, offset: 96)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "mcol", scope: !280, file: !279, line: 89, baseType: !584, size: 64, offset: 2048)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MCol", file: !384, line: 74, size: 32, elements: !586)
!586 = !{!587, !588, !589, !590}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !585, file: !384, line: 75, baseType: !304, size: 8)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !585, file: !384, line: 75, baseType: !304, size: 8, offset: 8)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !585, file: !384, line: 75, baseType: !304, size: 8, offset: 16)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !585, file: !384, line: 75, baseType: !304, size: 8, offset: 24)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "texcomesh", scope: !280, file: !279, line: 90, baseType: !592, size: 64, offset: 2112)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "edit_btmesh", scope: !280, file: !279, line: 93, baseType: !594, size: 64, offset: 2176)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEditMesh", file: !596, line: 54, size: 896, elements: !597)
!596 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_editmesh.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!597 = !{!598, !792, !793, !794, !797, !798, !801, !802, !810, !814, !815, !816, !817, !818, !819, !2617}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "bm", scope: !595, file: !596, line: 55, baseType: !599, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !62, line: 186, size: 8064, elements: !601)
!601 = !{!602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !615, !616, !617, !618, !679, !683, !687, !688, !689, !690, !691, !692, !693, !694, !748, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !600, file: !62, line: 187, baseType: !319, size: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !600, file: !62, line: 187, baseType: !319, size: 32, offset: 32)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !600, file: !62, line: 187, baseType: !319, size: 32, offset: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !600, file: !62, line: 187, baseType: !319, size: 32, offset: 96)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !600, file: !62, line: 188, baseType: !319, size: 32, offset: 128)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !600, file: !62, line: 188, baseType: !319, size: 32, offset: 160)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !600, file: !62, line: 188, baseType: !319, size: 32, offset: 192)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !600, file: !62, line: 193, baseType: !304, size: 8, offset: 224)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !600, file: !62, line: 197, baseType: !304, size: 8, offset: 232)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !600, file: !62, line: 201, baseType: !612, size: 64, offset: 256)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !614, line: 39, flags: DIFlagFwdDecl)
!614 = !DIFile(filename: "blender/source/blender/blenlib/BLI_linklist.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!615 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !600, file: !62, line: 201, baseType: !612, size: 64, offset: 320)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !600, file: !62, line: 201, baseType: !612, size: 64, offset: 384)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !600, file: !62, line: 201, baseType: !612, size: 64, offset: 448)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !600, file: !62, line: 208, baseType: !619, size: 64, offset: 512)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !62, line: 103, baseType: !622)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !62, line: 90, size: 448, elements: !623)
!623 = !{!624, !633, !638, !639, !640}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !622, file: !62, line: 91, baseType: !625, size: 128)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !62, line: 82, baseType: !626)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !62, line: 64, size: 128, elements: !627)
!627 = !{!628, !629, !630, !631, !632}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !626, file: !62, line: 65, baseType: !288, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !626, file: !62, line: 66, baseType: !319, size: 32, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !626, file: !62, line: 73, baseType: !304, size: 8, offset: 96)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !626, file: !62, line: 74, baseType: !304, size: 8, offset: 104)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !626, file: !62, line: 80, baseType: !304, size: 8, offset: 112)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !622, file: !62, line: 92, baseType: !634, size: 64, offset: 128)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !62, line: 180, size: 16, elements: !636)
!636 = !{!637}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !635, file: !62, line: 181, baseType: !317, size: 16)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !622, file: !62, line: 94, baseType: !556, size: 96, offset: 192)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !622, file: !62, line: 95, baseType: !556, size: 96, offset: 288)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !622, file: !62, line: 102, baseType: !641, size: 64, offset: 384)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !62, line: 110, size: 640, elements: !643)
!643 = !{!644, !645, !646, !648, !649, !672, !678}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !642, file: !62, line: 111, baseType: !625, size: 128)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !642, file: !62, line: 112, baseType: !634, size: 64, offset: 128)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !642, file: !62, line: 114, baseType: !647, size: 64, offset: 192)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !642, file: !62, line: 114, baseType: !647, size: 64, offset: 256)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !642, file: !62, line: 118, baseType: !650, size: 64, offset: 320)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !62, line: 125, size: 576, elements: !652)
!652 = !{!653, !654, !655, !656, !668, !669, !670, !671}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !651, file: !62, line: 126, baseType: !625, size: 128)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !651, file: !62, line: 129, baseType: !647, size: 64, offset: 128)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !651, file: !62, line: 130, baseType: !641, size: 64, offset: 192)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !651, file: !62, line: 131, baseType: !657, size: 64, offset: 256)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !62, line: 164, size: 448, elements: !659)
!659 = !{!660, !661, !662, !665, !666, !667}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !658, file: !62, line: 165, baseType: !625, size: 128)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !658, file: !62, line: 166, baseType: !634, size: 64, offset: 128)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !658, file: !62, line: 172, baseType: !663, size: 64, offset: 192)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !62, line: 140, baseType: !651)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !658, file: !62, line: 174, baseType: !319, size: 32, offset: 256)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !658, file: !62, line: 175, baseType: !556, size: 96, offset: 288)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !658, file: !62, line: 176, baseType: !317, size: 16, offset: 384)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !651, file: !62, line: 135, baseType: !650, size: 64, offset: 320)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !651, file: !62, line: 135, baseType: !650, size: 64, offset: 384)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !651, file: !62, line: 139, baseType: !650, size: 64, offset: 448)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !651, file: !62, line: 139, baseType: !650, size: 64, offset: 512)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !642, file: !62, line: 122, baseType: !673, size: 128, offset: 384)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !62, line: 108, baseType: !674)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !62, line: 106, size: 128, elements: !675)
!675 = !{!676, !677}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !674, file: !62, line: 107, baseType: !641, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !674, file: !62, line: 107, baseType: !641, size: 64, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !642, file: !62, line: 122, baseType: !673, size: 128, offset: 512)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !600, file: !62, line: 209, baseType: !680, size: 64, offset: 576)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !62, line: 123, baseType: !642)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !600, file: !62, line: 210, baseType: !684, size: 64, offset: 640)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !62, line: 178, baseType: !658)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !600, file: !62, line: 213, baseType: !319, size: 32, offset: 704)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !600, file: !62, line: 214, baseType: !319, size: 32, offset: 736)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !600, file: !62, line: 215, baseType: !319, size: 32, offset: 768)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !600, file: !62, line: 218, baseType: !612, size: 64, offset: 832)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !600, file: !62, line: 218, baseType: !612, size: 64, offset: 896)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !600, file: !62, line: 218, baseType: !612, size: 64, offset: 960)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !600, file: !62, line: 220, baseType: !319, size: 32, offset: 1024)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !600, file: !62, line: 221, baseType: !695, size: 64, offset: 1088)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !6, line: 190, size: 10496, elements: !697)
!697 = !{!698, !734, !735, !741, !744, !745, !747}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !696, file: !6, line: 191, baseType: !699, size: 5120)
!699 = !DICompositeType(tag: DW_TAG_array_type, baseType: !700, size: 5120, elements: !732)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !6, line: 147, size: 320, elements: !701)
!701 = !{!702, !705, !707, !717, !718}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !700, file: !6, line: 148, baseType: !703, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !304)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !700, file: !6, line: 149, baseType: !706, size: 32, offset: 64)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !6, line: 112, baseType: !5)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !700, file: !6, line: 150, baseType: !708, size: 32, offset: 96)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !6, line: 142, baseType: !709)
!709 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !6, line: 138, size: 32, elements: !710)
!710 = !{!711, !713, !715}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !709, file: !6, line: 139, baseType: !712, size: 32)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !6, line: 122, baseType: !17)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !709, file: !6, line: 140, baseType: !714, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !6, line: 136, baseType: !23)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !709, file: !6, line: 141, baseType: !716, size: 32)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !6, line: 130, baseType: !29)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !700, file: !6, line: 152, baseType: !319, size: 32, offset: 128)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !700, file: !6, line: 162, baseType: !719, size: 128, offset: 192)
!719 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !700, file: !6, line: 155, size: 128, elements: !720)
!720 = !{!721, !722, !723, !724, !725, !727}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !719, file: !6, line: 156, baseType: !319, size: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !719, file: !6, line: 157, baseType: !364, size: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !719, file: !6, line: 158, baseType: !288, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !719, file: !6, line: 159, baseType: !556, size: 96)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !719, file: !6, line: 160, baseType: !726, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !719, file: !6, line: 161, baseType: !728, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !730, line: 48, baseType: !731)
!730 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!731 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !376, line: 51, flags: DIFlagFwdDecl)
!732 = !{!733}
!733 = !DISubrange(count: 16)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !696, file: !6, line: 192, baseType: !699, size: 5120, offset: 5120)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !696, file: !6, line: 193, baseType: !736, size: 64, offset: 10240)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DISubroutineType(types: !738)
!738 = !{null, !739, !695}
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !62, line: 246, baseType: !600)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !696, file: !6, line: 194, baseType: !742, size: 64, offset: 10304)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !614, line: 38, flags: DIFlagFwdDecl)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !696, file: !6, line: 195, baseType: !319, size: 32, offset: 10368)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !696, file: !6, line: 196, baseType: !746, size: 32, offset: 10400)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !6, line: 188, baseType: !37)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !696, file: !6, line: 197, baseType: !319, size: 32, offset: 10432)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !600, file: !62, line: 223, baseType: !749, size: 1600, offset: 1152)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !233, line: 73, baseType: !750)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !233, line: 64, size: 1600, elements: !751)
!751 = !{!752, !767, !771, !772, !773, !774, !775}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !750, file: !233, line: 65, baseType: !753, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !233, line: 53, baseType: !755)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !233, line: 42, size: 832, elements: !756)
!756 = !{!757, !758, !759, !760, !761, !762, !763, !764, !765, !766}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !755, file: !233, line: 43, baseType: !319, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !755, file: !233, line: 44, baseType: !319, size: 32, offset: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !755, file: !233, line: 45, baseType: !319, size: 32, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !755, file: !233, line: 46, baseType: !319, size: 32, offset: 96)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !755, file: !233, line: 47, baseType: !319, size: 32, offset: 128)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !755, file: !233, line: 48, baseType: !319, size: 32, offset: 160)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !755, file: !233, line: 49, baseType: !319, size: 32, offset: 192)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !755, file: !233, line: 50, baseType: !319, size: 32, offset: 224)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !755, file: !233, line: 51, baseType: !334, size: 512, offset: 256)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !755, file: !233, line: 52, baseType: !288, size: 64, offset: 768)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !750, file: !233, line: 66, baseType: !768, size: 1312, offset: 64)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !319, size: 1312, elements: !769)
!769 = !{!770}
!770 = !DISubrange(count: 41)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !750, file: !233, line: 69, baseType: !319, size: 32, offset: 1376)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !750, file: !233, line: 69, baseType: !319, size: 32, offset: 1408)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !750, file: !233, line: 70, baseType: !319, size: 32, offset: 1440)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !750, file: !233, line: 71, baseType: !612, size: 64, offset: 1472)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !750, file: !233, line: 72, baseType: !776, size: 64, offset: 1536)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !233, line: 59, baseType: !778)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !233, line: 57, size: 8192, elements: !779)
!779 = !{!780}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !778, file: !233, line: 58, baseType: !303, size: 8192)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !600, file: !62, line: 223, baseType: !749, size: 1600, offset: 2752)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !600, file: !62, line: 223, baseType: !749, size: 1600, offset: 4352)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !600, file: !62, line: 223, baseType: !749, size: 1600, offset: 5952)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !600, file: !62, line: 233, baseType: !317, size: 16, offset: 7552)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !600, file: !62, line: 236, baseType: !319, size: 32, offset: 7584)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !600, file: !62, line: 238, baseType: !319, size: 32, offset: 7616)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !600, file: !62, line: 238, baseType: !319, size: 32, offset: 7648)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !600, file: !62, line: 239, baseType: !344, size: 128, offset: 7680)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !600, file: !62, line: 241, baseType: !685, size: 64, offset: 7808)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !600, file: !62, line: 243, baseType: !344, size: 128, offset: 7872)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !600, file: !62, line: 245, baseType: !288, size: 64, offset: 8000)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "emcopy", scope: !595, file: !596, line: 58, baseType: !594, size: 64, offset: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "emcopyusers", scope: !595, file: !596, line: 59, baseType: !319, size: 32, offset: 128)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "looptris", scope: !595, file: !596, line: 63, baseType: !795, size: 64, offset: 192)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !650, size: 192, elements: !557)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "tottri", scope: !595, file: !596, line: 64, baseType: !319, size: 32, offset: 256)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !595, file: !596, line: 67, baseType: !799, size: 64, offset: 320)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !596, line: 38, flags: DIFlagFwdDecl)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "derivedCage", scope: !595, file: !596, line: 67, baseType: !799, size: 64, offset: 384)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !595, file: !596, line: 68, baseType: !803, size: 64, offset: 448)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataMask", file: !804, line: 48, baseType: !805)
!804 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_customdata.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !806, line: 27, baseType: !807)
!806 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !808, line: 45, baseType: !809)
!808 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!809 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "derivedVertColor", scope: !595, file: !596, line: 69, baseType: !811, size: 64, offset: 512)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !813, size: 32, elements: !467)
!813 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "derivedVertColorLen", scope: !595, file: !596, line: 70, baseType: !319, size: 32, offset: 576)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFaceColor", scope: !595, file: !596, line: 71, baseType: !811, size: 64, offset: 640)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFaceColorLen", scope: !595, file: !596, line: 72, baseType: !319, size: 32, offset: 704)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !595, file: !596, line: 75, baseType: !317, size: 16, offset: 736)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !595, file: !596, line: 76, baseType: !317, size: 16, offset: 752)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "ob", scope: !595, file: !596, line: 79, baseType: !820, size: 64, offset: 768)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !75, line: 115, size: 11392, elements: !822)
!822 = !{!823, !824, !825, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !912, !913, !953, !954, !958, !959, !975, !976, !977, !978, !979, !980, !981, !982, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1071, !1074, !1078, !1079, !1080, !1081, !1082, !1085, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1098, !1101, !1104, !1105, !2605, !2606}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !821, file: !75, line: 116, baseType: !283, size: 960)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !821, file: !75, line: 117, baseType: !355, size: 64, offset: 960)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !821, file: !75, line: 119, baseType: !826, size: 64, offset: 1024)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !828, line: 155, size: 1856, elements: !829)
!828 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_paint.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!829 = !{!830, !833, !834, !835, !836, !837, !838, !840, !843, !845, !849, !850, !851, !852, !853, !856, !859, !860, !861, !862, !863, !867, !868, !869, !870, !871, !874, !875, !878, !881, !882, !883, !884}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "multires", scope: !827, file: !828, line: 157, baseType: !831, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DICompositeType(tag: DW_TAG_structure_type, name: "MultiresModifierData", file: !828, line: 157, flags: DIFlagFwdDecl)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "mvert", scope: !827, file: !828, line: 158, baseType: !552, size: 64, offset: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "mpoly", scope: !827, file: !828, line: 159, baseType: !389, size: 64, offset: 128)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "mloop", scope: !827, file: !828, line: 160, baseType: !494, size: 64, offset: 192)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !827, file: !828, line: 161, baseType: !319, size: 32, offset: 256)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "totpoly", scope: !827, file: !828, line: 161, baseType: !319, size: 32, offset: 288)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "face_normals", scope: !827, file: !828, line: 162, baseType: !839, size: 64, offset: 320)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "kb", scope: !827, file: !828, line: 163, baseType: !841, size: 64, offset: 384)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DICompositeType(tag: DW_TAG_structure_type, name: "KeyBlock", file: !828, line: 163, flags: DIFlagFwdDecl)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "vmask", scope: !827, file: !828, line: 164, baseType: !844, size: 64, offset: 448)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "pmap", scope: !827, file: !828, line: 167, baseType: !846, size: 64, offset: 512)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !848)
!848 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !828, line: 44, flags: DIFlagFwdDecl)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "bm", scope: !827, file: !828, line: 170, baseType: !599, size: 64, offset: 576)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "cd_vert_node_offset", scope: !827, file: !828, line: 171, baseType: !319, size: 32, offset: 640)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "cd_face_node_offset", scope: !827, file: !828, line: 172, baseType: !319, size: 32, offset: 672)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "bm_smooth_shading", scope: !827, file: !828, line: 173, baseType: !813, size: 8, offset: 704)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "bm_log", scope: !827, file: !828, line: 175, baseType: !854, size: 64, offset: 768)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMLog", file: !828, line: 175, flags: DIFlagFwdDecl)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "pbvh", scope: !827, file: !828, line: 178, baseType: !857, size: 64, offset: 832)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !828, line: 55, flags: DIFlagFwdDecl)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "show_diffuse_color", scope: !827, file: !828, line: 179, baseType: !813, size: 8, offset: 896)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers_active", scope: !827, file: !828, line: 182, baseType: !813, size: 8, offset: 904)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "orig_cos", scope: !827, file: !828, line: 183, baseType: !839, size: 64, offset: 960)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "deform_cos", scope: !827, file: !828, line: 184, baseType: !839, size: 64, offset: 1024)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "deform_imats", scope: !827, file: !828, line: 185, baseType: !864, size: 64, offset: 1088)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DICompositeType(tag: DW_TAG_array_type, baseType: !364, size: 288, elements: !866)
!866 = !{!367, !367}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "partial_redraw", scope: !827, file: !828, line: 188, baseType: !813, size: 8, offset: 1152)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_side", scope: !827, file: !828, line: 191, baseType: !7, size: 32, offset: 1184)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "texcache", scope: !827, file: !828, line: 191, baseType: !438, size: 64, offset: 1216)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_actual", scope: !827, file: !828, line: 191, baseType: !7, size: 32, offset: 1280)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "tex_pool", scope: !827, file: !828, line: 192, baseType: !872, size: 64, offset: 1344)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePool", file: !828, line: 61, flags: DIFlagFwdDecl)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "layer_co", scope: !827, file: !828, line: 195, baseType: !839, size: 64, offset: 1408)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "stroke", scope: !827, file: !828, line: 197, baseType: !876, size: 64, offset: 1472)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptStroke", file: !828, line: 197, flags: DIFlagFwdDecl)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !827, file: !828, line: 198, baseType: !879, size: 64, offset: 1536)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DICompositeType(tag: DW_TAG_structure_type, name: "StrokeCache", file: !828, line: 59, flags: DIFlagFwdDecl)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke_valid", scope: !827, file: !828, line: 201, baseType: !813, size: 8, offset: 1600)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke", scope: !827, file: !828, line: 202, baseType: !556, size: 96, offset: 1632)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_accum", scope: !827, file: !828, line: 204, baseType: !556, size: 96, offset: 1728)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_counter", scope: !827, file: !828, line: 205, baseType: !319, size: 32, offset: 1824)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !821, file: !75, line: 121, baseType: !317, size: 16, offset: 1088)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !821, file: !75, line: 121, baseType: !317, size: 16, offset: 1104)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !821, file: !75, line: 122, baseType: !319, size: 32, offset: 1120)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !821, file: !75, line: 122, baseType: !319, size: 32, offset: 1152)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !821, file: !75, line: 122, baseType: !319, size: 32, offset: 1184)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !821, file: !75, line: 123, baseType: !334, size: 512, offset: 1216)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !821, file: !75, line: 124, baseType: !820, size: 64, offset: 1728)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !821, file: !75, line: 124, baseType: !820, size: 64, offset: 1792)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !821, file: !75, line: 127, baseType: !820, size: 64, offset: 1856)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !821, file: !75, line: 127, baseType: !820, size: 64, offset: 1920)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !821, file: !75, line: 127, baseType: !820, size: 64, offset: 1984)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !821, file: !75, line: 128, baseType: !371, size: 64, offset: 2048)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !821, file: !75, line: 130, baseType: !359, size: 64, offset: 2112)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !821, file: !75, line: 131, baseType: !899, size: 64, offset: 2176)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !901, line: 486, size: 1600, elements: !902)
!901 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!902 = !{!903, !904, !905, !906, !907, !908, !909, !910, !911}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !900, file: !901, line: 487, baseType: !283, size: 960)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !900, file: !901, line: 489, baseType: !344, size: 128, offset: 960)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !900, file: !901, line: 490, baseType: !344, size: 128, offset: 1088)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !900, file: !901, line: 491, baseType: !344, size: 128, offset: 1216)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !900, file: !901, line: 492, baseType: !344, size: 128, offset: 1344)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !900, file: !901, line: 494, baseType: !319, size: 32, offset: 1472)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !900, file: !901, line: 495, baseType: !319, size: 32, offset: 1504)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !900, file: !901, line: 497, baseType: !319, size: 32, offset: 1536)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !900, file: !901, line: 498, baseType: !319, size: 32, offset: 1568)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !821, file: !75, line: 132, baseType: !899, size: 64, offset: 2240)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !821, file: !75, line: 133, baseType: !914, size: 64, offset: 2304)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !901, line: 334, size: 1728, elements: !916)
!916 = !{!917, !918, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !952}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !915, file: !901, line: 335, baseType: !344, size: 128)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !915, file: !901, line: 336, baseType: !919, size: 64, offset: 128)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !915, file: !901, line: 338, baseType: !317, size: 16, offset: 192)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !915, file: !901, line: 338, baseType: !317, size: 16, offset: 208)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !915, file: !901, line: 339, baseType: !7, size: 32, offset: 224)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !915, file: !901, line: 340, baseType: !319, size: 32, offset: 256)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !915, file: !901, line: 342, baseType: !364, size: 32, offset: 288)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !915, file: !901, line: 343, baseType: !556, size: 96, offset: 320)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !915, file: !901, line: 344, baseType: !556, size: 96, offset: 416)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !915, file: !901, line: 347, baseType: !344, size: 128, offset: 512)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !915, file: !901, line: 349, baseType: !319, size: 32, offset: 640)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !915, file: !901, line: 350, baseType: !319, size: 32, offset: 672)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !915, file: !901, line: 351, baseType: !288, size: 64, offset: 704)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !915, file: !901, line: 352, baseType: !288, size: 64, offset: 768)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !915, file: !901, line: 354, baseType: !933, size: 384, offset: 832)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !901, line: 116, baseType: !934)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !901, line: 94, size: 384, elements: !935)
!935 = !{!936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !934, file: !901, line: 96, baseType: !319, size: 32)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !934, file: !901, line: 96, baseType: !319, size: 32, offset: 32)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !934, file: !901, line: 97, baseType: !319, size: 32, offset: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !934, file: !901, line: 97, baseType: !319, size: 32, offset: 96)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !934, file: !901, line: 99, baseType: !317, size: 16, offset: 128)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !934, file: !901, line: 100, baseType: !317, size: 16, offset: 144)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !934, file: !901, line: 102, baseType: !317, size: 16, offset: 160)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !934, file: !901, line: 105, baseType: !317, size: 16, offset: 176)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !934, file: !901, line: 108, baseType: !317, size: 16, offset: 192)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !934, file: !901, line: 109, baseType: !317, size: 16, offset: 208)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !934, file: !901, line: 111, baseType: !317, size: 16, offset: 224)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !934, file: !901, line: 112, baseType: !317, size: 16, offset: 240)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !934, file: !901, line: 114, baseType: !319, size: 32, offset: 256)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !934, file: !901, line: 114, baseType: !319, size: 32, offset: 288)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !934, file: !901, line: 115, baseType: !319, size: 32, offset: 320)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !934, file: !901, line: 115, baseType: !319, size: 32, offset: 352)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !915, file: !901, line: 355, baseType: !334, size: 512, offset: 1216)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !821, file: !75, line: 134, baseType: !288, size: 64, offset: 2368)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !821, file: !75, line: 136, baseType: !955, size: 64, offset: 2432)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !957, line: 45, flags: DIFlagFwdDecl)
!957 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!958 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !821, file: !75, line: 138, baseType: !933, size: 384, offset: 2496)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !821, file: !75, line: 139, baseType: !960, size: 64, offset: 2880)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !901, line: 80, baseType: !962)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !901, line: 72, size: 192, elements: !963)
!963 = !{!964, !971, !972, !973, !974}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !962, file: !901, line: 73, baseType: !965, size: 64)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !901, line: 59, baseType: !967)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !901, line: 56, size: 128, elements: !968)
!968 = !{!969, !970}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !967, file: !901, line: 57, baseType: !556, size: 96)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !967, file: !901, line: 58, baseType: !319, size: 32, offset: 96)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !962, file: !901, line: 74, baseType: !319, size: 32, offset: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !962, file: !901, line: 76, baseType: !319, size: 32, offset: 96)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !962, file: !901, line: 77, baseType: !319, size: 32, offset: 128)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !962, file: !901, line: 79, baseType: !319, size: 32, offset: 160)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !821, file: !75, line: 141, baseType: !344, size: 128, offset: 2944)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !821, file: !75, line: 142, baseType: !344, size: 128, offset: 3072)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !821, file: !75, line: 143, baseType: !344, size: 128, offset: 3200)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !821, file: !75, line: 144, baseType: !344, size: 128, offset: 3328)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !821, file: !75, line: 146, baseType: !319, size: 32, offset: 3456)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !821, file: !75, line: 147, baseType: !319, size: 32, offset: 3488)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !821, file: !75, line: 150, baseType: !378, size: 64, offset: 3520)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !821, file: !75, line: 151, baseType: !983, size: 64, offset: 3584)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !821, file: !75, line: 152, baseType: !319, size: 32, offset: 3648)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !821, file: !75, line: 153, baseType: !319, size: 32, offset: 3680)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !821, file: !75, line: 156, baseType: !556, size: 96, offset: 3712)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !821, file: !75, line: 156, baseType: !556, size: 96, offset: 3808)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !821, file: !75, line: 156, baseType: !556, size: 96, offset: 3904)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !821, file: !75, line: 157, baseType: !556, size: 96, offset: 4000)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !821, file: !75, line: 158, baseType: !556, size: 96, offset: 4096)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !821, file: !75, line: 159, baseType: !556, size: 96, offset: 4192)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !821, file: !75, line: 160, baseType: !556, size: 96, offset: 4288)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !821, file: !75, line: 160, baseType: !556, size: 96, offset: 4384)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !821, file: !75, line: 161, baseType: !466, size: 128, offset: 4480)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !821, file: !75, line: 161, baseType: !466, size: 128, offset: 4608)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !821, file: !75, line: 162, baseType: !556, size: 96, offset: 4736)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !821, file: !75, line: 162, baseType: !556, size: 96, offset: 4832)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !821, file: !75, line: 163, baseType: !364, size: 32, offset: 4928)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !821, file: !75, line: 163, baseType: !364, size: 32, offset: 4960)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !821, file: !75, line: 164, baseType: !1001, size: 512, offset: 4992)
!1001 = !DICompositeType(tag: DW_TAG_array_type, baseType: !364, size: 512, elements: !1002)
!1002 = !{!468, !468}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !821, file: !75, line: 165, baseType: !1001, size: 512, offset: 5504)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !821, file: !75, line: 166, baseType: !1001, size: 512, offset: 6016)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !821, file: !75, line: 167, baseType: !1001, size: 512, offset: 6528)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !821, file: !75, line: 176, baseType: !1001, size: 512, offset: 7040)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !821, file: !75, line: 178, baseType: !7, size: 32, offset: 7552)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !821, file: !75, line: 180, baseType: !317, size: 16, offset: 7584)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !821, file: !75, line: 181, baseType: !317, size: 16, offset: 7600)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !821, file: !75, line: 183, baseType: !317, size: 16, offset: 7616)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !821, file: !75, line: 183, baseType: !317, size: 16, offset: 7632)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !821, file: !75, line: 184, baseType: !317, size: 16, offset: 7648)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !821, file: !75, line: 184, baseType: !317, size: 16, offset: 7664)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !821, file: !75, line: 185, baseType: !317, size: 16, offset: 7680)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !821, file: !75, line: 186, baseType: !317, size: 16, offset: 7696)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !821, file: !75, line: 187, baseType: !317, size: 16, offset: 7712)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !821, file: !75, line: 188, baseType: !304, size: 8, offset: 7728)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !821, file: !75, line: 189, baseType: !304, size: 8, offset: 7736)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !821, file: !75, line: 192, baseType: !319, size: 32, offset: 7744)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !821, file: !75, line: 192, baseType: !319, size: 32, offset: 7776)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !821, file: !75, line: 192, baseType: !319, size: 32, offset: 7808)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !821, file: !75, line: 192, baseType: !319, size: 32, offset: 7840)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !821, file: !75, line: 194, baseType: !319, size: 32, offset: 7872)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !821, file: !75, line: 202, baseType: !364, size: 32, offset: 7904)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !821, file: !75, line: 202, baseType: !364, size: 32, offset: 7936)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !821, file: !75, line: 202, baseType: !364, size: 32, offset: 7968)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !821, file: !75, line: 211, baseType: !364, size: 32, offset: 8000)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !821, file: !75, line: 212, baseType: !364, size: 32, offset: 8032)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !821, file: !75, line: 213, baseType: !364, size: 32, offset: 8064)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !821, file: !75, line: 214, baseType: !364, size: 32, offset: 8096)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !821, file: !75, line: 215, baseType: !364, size: 32, offset: 8128)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !821, file: !75, line: 216, baseType: !364, size: 32, offset: 8160)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !821, file: !75, line: 219, baseType: !364, size: 32, offset: 8192)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !821, file: !75, line: 220, baseType: !364, size: 32, offset: 8224)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !821, file: !75, line: 221, baseType: !364, size: 32, offset: 8256)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !821, file: !75, line: 224, baseType: !1037, size: 16, offset: 8288)
!1037 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !821, file: !75, line: 224, baseType: !1037, size: 16, offset: 8304)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !821, file: !75, line: 226, baseType: !317, size: 16, offset: 8320)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !821, file: !75, line: 228, baseType: !304, size: 8, offset: 8336)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !821, file: !75, line: 229, baseType: !304, size: 8, offset: 8344)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !821, file: !75, line: 231, baseType: !317, size: 16, offset: 8352)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !821, file: !75, line: 232, baseType: !304, size: 8, offset: 8368)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !821, file: !75, line: 233, baseType: !304, size: 8, offset: 8376)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !821, file: !75, line: 234, baseType: !364, size: 32, offset: 8384)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !821, file: !75, line: 235, baseType: !364, size: 32, offset: 8416)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !821, file: !75, line: 237, baseType: !344, size: 128, offset: 8448)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !821, file: !75, line: 238, baseType: !344, size: 128, offset: 8576)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !821, file: !75, line: 239, baseType: !344, size: 128, offset: 8704)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !821, file: !75, line: 240, baseType: !344, size: 128, offset: 8832)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !821, file: !75, line: 242, baseType: !364, size: 32, offset: 8960)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !821, file: !75, line: 244, baseType: !317, size: 16, offset: 8992)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !821, file: !75, line: 245, baseType: !1037, size: 16, offset: 9008)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !821, file: !75, line: 246, baseType: !466, size: 128, offset: 9024)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !821, file: !75, line: 248, baseType: !319, size: 32, offset: 9152)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !821, file: !75, line: 249, baseType: !319, size: 32, offset: 9184)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !821, file: !75, line: 251, baseType: !1058, size: 64, offset: 9216)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !75, line: 251, flags: DIFlagFwdDecl)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !821, file: !75, line: 253, baseType: !304, size: 8, offset: 9280)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !821, file: !75, line: 254, baseType: !304, size: 8, offset: 9288)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !821, file: !75, line: 255, baseType: !317, size: 16, offset: 9296)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !821, file: !75, line: 256, baseType: !556, size: 96, offset: 9312)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !821, file: !75, line: 258, baseType: !344, size: 128, offset: 9408)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !821, file: !75, line: 259, baseType: !344, size: 128, offset: 9536)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !821, file: !75, line: 260, baseType: !344, size: 128, offset: 9664)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !821, file: !75, line: 261, baseType: !344, size: 128, offset: 9792)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !821, file: !75, line: 263, baseType: !1069, size: 64, offset: 9920)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !75, line: 52, flags: DIFlagFwdDecl)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !821, file: !75, line: 264, baseType: !1072, size: 64, offset: 9984)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !75, line: 53, flags: DIFlagFwdDecl)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !821, file: !75, line: 265, baseType: !1075, size: 64, offset: 10048)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64)
!1076 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !1077, line: 43, flags: DIFlagFwdDecl)
!1077 = !DIFile(filename: "blender/source/blender/makesdna/DNA_freestyle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !821, file: !75, line: 267, baseType: !304, size: 8, offset: 10112)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !821, file: !75, line: 268, baseType: !304, size: 8, offset: 10120)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !821, file: !75, line: 269, baseType: !317, size: 16, offset: 10128)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !821, file: !75, line: 270, baseType: !364, size: 32, offset: 10144)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !821, file: !75, line: 272, baseType: !1083, size: 64, offset: 10176)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64)
!1084 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !75, line: 54, flags: DIFlagFwdDecl)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !821, file: !75, line: 275, baseType: !1086, size: 64, offset: 10240)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64)
