; ModuleID = 'blender/source/blender/modifiers/intern/MOD_solidify.c'
source_filename = "blender/source/blender/modifiers/intern/MOD_solidify.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!61 = !DIFile(filename: "blender/source/blender/makesdna/DNA_modifier_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!62 = !{!63, !64, !65, !66, !67, !68, !69}
!63 = !DIEnumerator(name: "MOD_SOLIDIFY_RIM", value: 1, isUnsigned: true)
!64 = !DIEnumerator(name: "MOD_SOLIDIFY_EVEN", value: 2, isUnsigned: true)
!65 = !DIEnumerator(name: "MOD_SOLIDIFY_NORMAL_CALC", value: 4, isUnsigned: true)
!66 = !DIEnumerator(name: "MOD_SOLIDIFY_VGROUP_INV", value: 8, isUnsigned: true)
!67 = !DIEnumerator(name: "MOD_SOLIDIFY_RIM_MATERIAL", value: 16, isUnsigned: true)
!68 = !DIEnumerator(name: "MOD_SOLIDIFY_FLIP", value: 32, isUnsigned: true)
!69 = !DIEnumerator(name: "MOD_SOLIDIFY_NOSHELL", value: 64, isUnsigned: true)
!70 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !71, line: 313, baseType: !7, size: 32, elements: !72)
!71 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!72 = !{!73, !74, !75, !76, !77, !78}
!73 = !DIEnumerator(name: "ME_EDGEDRAW", value: 2, isUnsigned: true)
!74 = !DIEnumerator(name: "ME_SEAM", value: 4, isUnsigned: true)
!75 = !DIEnumerator(name: "ME_EDGERENDER", value: 32, isUnsigned: true)
!76 = !DIEnumerator(name: "ME_LOOSEEDGE", value: 128, isUnsigned: true)
!77 = !DIEnumerator(name: "ME_EDGE_TMP_TAG", value: 256, isUnsigned: true)
!78 = !DIEnumerator(name: "ME_SHARP", value: 512, isUnsigned: true)
!79 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !80, line: 76, baseType: !7, size: 32, elements: !81)
!80 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!81 = !{!82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122}
!82 = !DIEnumerator(name: "CD_MVERT", value: 0, isUnsigned: true)
!83 = !DIEnumerator(name: "CD_MSTICKY", value: 1, isUnsigned: true)
!84 = !DIEnumerator(name: "CD_MDEFORMVERT", value: 2, isUnsigned: true)
!85 = !DIEnumerator(name: "CD_MEDGE", value: 3, isUnsigned: true)
!86 = !DIEnumerator(name: "CD_MFACE", value: 4, isUnsigned: true)
!87 = !DIEnumerator(name: "CD_MTFACE", value: 5, isUnsigned: true)
!88 = !DIEnumerator(name: "CD_MCOL", value: 6, isUnsigned: true)
!89 = !DIEnumerator(name: "CD_ORIGINDEX", value: 7, isUnsigned: true)
!90 = !DIEnumerator(name: "CD_NORMAL", value: 8, isUnsigned: true)
!91 = !DIEnumerator(name: "CD_PROP_FLT", value: 10, isUnsigned: true)
!92 = !DIEnumerator(name: "CD_PROP_INT", value: 11, isUnsigned: true)
!93 = !DIEnumerator(name: "CD_PROP_STR", value: 12, isUnsigned: true)
!94 = !DIEnumerator(name: "CD_ORIGSPACE", value: 13, isUnsigned: true)
!95 = !DIEnumerator(name: "CD_ORCO", value: 14, isUnsigned: true)
!96 = !DIEnumerator(name: "CD_MTEXPOLY", value: 15, isUnsigned: true)
!97 = !DIEnumerator(name: "CD_MLOOPUV", value: 16, isUnsigned: true)
!98 = !DIEnumerator(name: "CD_MLOOPCOL", value: 17, isUnsigned: true)
!99 = !DIEnumerator(name: "CD_TANGENT", value: 18, isUnsigned: true)
!100 = !DIEnumerator(name: "CD_MDISPS", value: 19, isUnsigned: true)
!101 = !DIEnumerator(name: "CD_PREVIEW_MCOL", value: 20, isUnsigned: true)
!102 = !DIEnumerator(name: "CD_ID_MCOL", value: 21, isUnsigned: true)
!103 = !DIEnumerator(name: "CD_TEXTURE_MCOL", value: 22, isUnsigned: true)
!104 = !DIEnumerator(name: "CD_CLOTH_ORCO", value: 23, isUnsigned: true)
!105 = !DIEnumerator(name: "CD_RECAST", value: 24, isUnsigned: true)
!106 = !DIEnumerator(name: "CD_MPOLY", value: 25, isUnsigned: true)
!107 = !DIEnumerator(name: "CD_MLOOP", value: 26, isUnsigned: true)
!108 = !DIEnumerator(name: "CD_SHAPE_KEYINDEX", value: 27, isUnsigned: true)
!109 = !DIEnumerator(name: "CD_SHAPEKEY", value: 28, isUnsigned: true)
!110 = !DIEnumerator(name: "CD_BWEIGHT", value: 29, isUnsigned: true)
!111 = !DIEnumerator(name: "CD_CREASE", value: 30, isUnsigned: true)
!112 = !DIEnumerator(name: "CD_ORIGSPACE_MLOOP", value: 31, isUnsigned: true)
!113 = !DIEnumerator(name: "CD_PREVIEW_MLOOPCOL", value: 32, isUnsigned: true)
!114 = !DIEnumerator(name: "CD_BM_ELEM_PYPTR", value: 33, isUnsigned: true)
!115 = !DIEnumerator(name: "CD_PAINT_MASK", value: 34, isUnsigned: true)
!116 = !DIEnumerator(name: "CD_GRID_PAINT_MASK", value: 35, isUnsigned: true)
!117 = !DIEnumerator(name: "CD_MVERT_SKIN", value: 36, isUnsigned: true)
!118 = !DIEnumerator(name: "CD_FREESTYLE_EDGE", value: 37, isUnsigned: true)
!119 = !DIEnumerator(name: "CD_FREESTYLE_FACE", value: 38, isUnsigned: true)
!120 = !DIEnumerator(name: "CD_MLOOPTANGENT", value: 39, isUnsigned: true)
!121 = !DIEnumerator(name: "CD_TESSLOOPNORMAL", value: 40, isUnsigned: true)
!122 = !DIEnumerator(name: "CD_NUMTYPES", value: 41, isUnsigned: true)
!123 = !{!124, !7, !164, !136, !167, !170, !152, !162}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "SolidifyModifierData", file: !61, line: 834, baseType: !126)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SolidifyModifierData", file: !61, line: 818, size: 1728, elements: !127)
!127 = !{!128, !150, !151, !153, !154, !155, !156, !157, !158, !159, !160, !161, !163}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !126, file: !61, line: 819, baseType: !129, size: 896)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierData", file: !61, line: 110, baseType: !130)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierData", file: !61, line: 99, size: 896, elements: !131)
!131 = !{!132, !134, !135, !137, !138, !139, !140, !145, !148}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !130, file: !61, line: 100, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !130, file: !61, line: 100, baseType: !133, size: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !130, file: !61, line: 102, baseType: !136, size: 32, offset: 128)
!136 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !130, file: !61, line: 102, baseType: !136, size: 32, offset: 160)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "stackindex", scope: !130, file: !61, line: 103, baseType: !136, size: 32, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !130, file: !61, line: 103, baseType: !136, size: 32, offset: 224)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !130, file: !61, line: 104, baseType: !141, size: 512, offset: 256)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 512, elements: !143)
!142 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!143 = !{!144}
!144 = !DISubrange(count: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !130, file: !61, line: 107, baseType: !146, size: 64, offset: 768)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !28, line: 89, flags: DIFlagFwdDecl)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !130, file: !61, line: 109, baseType: !149, size: 64, offset: 832)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "defgrp_name", scope: !126, file: !61, line: 821, baseType: !141, size: 512, offset: 896)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !126, file: !61, line: 822, baseType: !152, size: 32, offset: 1408)
!152 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "offset_fac", scope: !126, file: !61, line: 823, baseType: !152, size: 32, offset: 1440)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "offset_fac_vg", scope: !126, file: !61, line: 825, baseType: !152, size: 32, offset: 1472)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "offset_clamp", scope: !126, file: !61, line: 826, baseType: !152, size: 32, offset: 1504)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !126, file: !61, line: 827, baseType: !152, size: 32, offset: 1536)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "crease_inner", scope: !126, file: !61, line: 828, baseType: !152, size: 32, offset: 1568)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "crease_outer", scope: !126, file: !61, line: 829, baseType: !152, size: 32, offset: 1600)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "crease_rim", scope: !126, file: !61, line: 830, baseType: !152, size: 32, offset: 1632)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !126, file: !61, line: 831, baseType: !136, size: 32, offset: 1664)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "mat_ofs", scope: !126, file: !61, line: 832, baseType: !162, size: 16, offset: 1696)
!162 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "mat_ofs_rim", scope: !126, file: !61, line: 833, baseType: !162, size: 16, offset: 1712)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !165, line: 46, baseType: !166)
!165 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!166 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_bitmap", file: !169, line: 33, baseType: !7)
!169 = !DIFile(filename: "blender/source/blender/blenlib/BLI_bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!171 = !{!0}
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierTypeInfo", file: !6, line: 309, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierTypeInfo", file: !6, line: 121, size: 1728, elements: !174)
!174 = !{!175, !179, !180, !181, !183, !185, !189, !1030, !1037, !1043, !1047, !1051, !1055, !1059, !1065, !1066, !1070, !1078, !1082, !1083, !1092, !1101}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !173, file: !6, line: 123, baseType: !176, size: 256)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 256, elements: !177)
!177 = !{!178}
!178 = !DISubrange(count: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "structName", scope: !173, file: !6, line: 128, baseType: !176, size: 256, offset: 256)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "structSize", scope: !173, file: !6, line: 131, baseType: !136, size: 32, offset: 512)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !173, file: !6, line: 133, baseType: !182, size: 32, offset: 544)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierTypeType", file: !6, line: 71, baseType: !5)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !173, file: !6, line: 134, baseType: !184, size: 32, offset: 576)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierTypeFlag", file: !6, line: 104, baseType: !15)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "copyData", scope: !173, file: !6, line: 142, baseType: !186, size: 64, offset: 640)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{null, !133, !133}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "deformVerts", scope: !173, file: !6, line: 151, baseType: !190, size: 64, offset: 704)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{null, !133, !193, !492, !792, !136, !1029}
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !195, line: 115, size: 11392, elements: !196)
!195 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!196 = !{!197, !262, !266, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !283, !294, !308, !309, !352, !353, !356, !357, !373, !374, !375, !376, !377, !378, !379, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !398, !399, !400, !401, !402, !403, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !463, !464, !465, !466, !467, !468, !469, !470, !471, !475, !478, !481, !482, !483, !484, !485, !488, !491, !977, !978, !983, !984, !985, !986, !987, !988, !990, !993, !996, !998, !1017, !1018}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !194, file: !195, line: 116, baseType: !198, size: 960)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !199, line: 130, baseType: !200)
!199 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !199, line: 117, size: 960, elements: !201)
!201 = !{!202, !203, !204, !206, !225, !229, !230, !231, !232, !233}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !200, file: !199, line: 118, baseType: !170, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !200, file: !199, line: 118, baseType: !170, size: 64, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !200, file: !199, line: 119, baseType: !205, size: 64, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !200, file: !199, line: 120, baseType: !207, size: 64, offset: 192)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !199, line: 136, size: 17600, elements: !209)
!209 = !{!210, !211, !213, !216, !220, !221, !222}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !208, file: !199, line: 137, baseType: !198, size: 960)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !208, file: !199, line: 138, baseType: !212, size: 64, offset: 960)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !208, file: !199, line: 139, baseType: !214, size: 64, offset: 1024)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !199, line: 43, flags: DIFlagFwdDecl)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !208, file: !199, line: 140, baseType: !217, size: 8192, offset: 1088)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 8192, elements: !218)
!218 = !{!219}
!219 = !DISubrange(count: 1024)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !208, file: !199, line: 141, baseType: !217, size: 8192, offset: 9280)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !208, file: !199, line: 148, baseType: !207, size: 64, offset: 17472)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !208, file: !199, line: 150, baseType: !223, size: 64, offset: 17536)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !199, line: 45, flags: DIFlagFwdDecl)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !200, file: !199, line: 121, baseType: !226, size: 528, offset: 256)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 528, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 66)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !200, file: !199, line: 126, baseType: !162, size: 16, offset: 784)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !200, file: !199, line: 127, baseType: !136, size: 32, offset: 800)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !200, file: !199, line: 128, baseType: !136, size: 32, offset: 832)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !200, file: !199, line: 128, baseType: !136, size: 32, offset: 864)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !200, file: !199, line: 129, baseType: !234, size: 64, offset: 896)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !199, line: 75, baseType: !236)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !199, line: 62, size: 1024, elements: !237)
!237 = !{!238, !240, !241, !242, !243, !244, !245, !246, !260, !261}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !236, file: !199, line: 63, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !236, file: !199, line: 63, baseType: !239, size: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !236, file: !199, line: 64, baseType: !142, size: 8, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !236, file: !199, line: 64, baseType: !142, size: 8, offset: 136)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !236, file: !199, line: 65, baseType: !162, size: 16, offset: 144)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !236, file: !199, line: 66, baseType: !141, size: 512, offset: 160)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !236, file: !199, line: 67, baseType: !136, size: 32, offset: 672)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !236, file: !199, line: 69, baseType: !247, size: 256, offset: 704)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !199, line: 60, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !199, line: 48, size: 256, elements: !249)
!249 = !{!250, !251, !258, !259}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !248, file: !199, line: 49, baseType: !170, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !248, file: !199, line: 58, baseType: !252, size: 128, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !253, line: 71, baseType: !254)
!253 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !253, line: 69, size: 128, elements: !255)
!255 = !{!256, !257}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !254, file: !253, line: 70, baseType: !170, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !254, file: !253, line: 70, baseType: !170, size: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !248, file: !199, line: 59, baseType: !136, size: 32, offset: 192)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !248, file: !199, line: 59, baseType: !136, size: 32, offset: 224)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !236, file: !199, line: 70, baseType: !136, size: 32, offset: 960)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !236, file: !199, line: 74, baseType: !136, size: 32, offset: 992)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !194, file: !195, line: 117, baseType: !263, size: 64, offset: 960)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !265, line: 39, flags: DIFlagFwdDecl)
!265 = !DIFile(filename: "blender/source/blender/makesdna/DNA_mesh_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!266 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !194, file: !195, line: 119, baseType: !267, size: 64, offset: 1024)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !195, line: 57, flags: DIFlagFwdDecl)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !194, file: !195, line: 121, baseType: !162, size: 16, offset: 1088)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !194, file: !195, line: 121, baseType: !162, size: 16, offset: 1104)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !194, file: !195, line: 122, baseType: !136, size: 32, offset: 1120)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !194, file: !195, line: 122, baseType: !136, size: 32, offset: 1152)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !194, file: !195, line: 122, baseType: !136, size: 32, offset: 1184)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !194, file: !195, line: 123, baseType: !141, size: 512, offset: 1216)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !194, file: !195, line: 124, baseType: !193, size: 64, offset: 1728)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !194, file: !195, line: 124, baseType: !193, size: 64, offset: 1792)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !194, file: !195, line: 127, baseType: !193, size: 64, offset: 1856)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !194, file: !195, line: 127, baseType: !193, size: 64, offset: 1920)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !194, file: !195, line: 127, baseType: !193, size: 64, offset: 1984)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !194, file: !195, line: 128, baseType: !281, size: 64, offset: 2048)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !265, line: 41, flags: DIFlagFwdDecl)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !194, file: !195, line: 130, baseType: !284, size: 64, offset: 2112)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !195, line: 97, size: 832, elements: !286)
!286 = !{!287, !292, !293}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !285, file: !195, line: 98, baseType: !288, size: 768)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 768, elements: !289)
!289 = !{!290, !291}
!290 = !DISubrange(count: 8)
!291 = !DISubrange(count: 3)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !285, file: !195, line: 99, baseType: !136, size: 32, offset: 768)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !285, file: !195, line: 99, baseType: !136, size: 32, offset: 800)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !194, file: !195, line: 131, baseType: !295, size: 64, offset: 2176)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !297, line: 486, size: 1600, elements: !298)
!297 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!298 = !{!299, !300, !301, !302, !303, !304, !305, !306, !307}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !296, file: !297, line: 487, baseType: !198, size: 960)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !296, file: !297, line: 489, baseType: !252, size: 128, offset: 960)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !296, file: !297, line: 490, baseType: !252, size: 128, offset: 1088)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !296, file: !297, line: 491, baseType: !252, size: 128, offset: 1216)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !296, file: !297, line: 492, baseType: !252, size: 128, offset: 1344)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !296, file: !297, line: 494, baseType: !136, size: 32, offset: 1472)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !296, file: !297, line: 495, baseType: !136, size: 32, offset: 1504)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !296, file: !297, line: 497, baseType: !136, size: 32, offset: 1536)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !296, file: !297, line: 498, baseType: !136, size: 32, offset: 1568)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !194, file: !195, line: 132, baseType: !295, size: 64, offset: 2240)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !194, file: !195, line: 133, baseType: !310, size: 64, offset: 2304)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !297, line: 334, size: 1728, elements: !312)
!312 = !{!313, !314, !317, !318, !319, !320, !321, !322, !325, !326, !327, !328, !329, !330, !331, !351}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !311, file: !297, line: 335, baseType: !252, size: 128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !311, file: !297, line: 336, baseType: !315, size: 64, offset: 128)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !297, line: 47, flags: DIFlagFwdDecl)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !311, file: !297, line: 338, baseType: !162, size: 16, offset: 192)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !311, file: !297, line: 338, baseType: !162, size: 16, offset: 208)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !311, file: !297, line: 339, baseType: !7, size: 32, offset: 224)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !311, file: !297, line: 340, baseType: !136, size: 32, offset: 256)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !311, file: !297, line: 342, baseType: !152, size: 32, offset: 288)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !311, file: !297, line: 343, baseType: !323, size: 96, offset: 320)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 96, elements: !324)
!324 = !{!291}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !311, file: !297, line: 344, baseType: !323, size: 96, offset: 416)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !311, file: !297, line: 347, baseType: !252, size: 128, offset: 512)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !311, file: !297, line: 349, baseType: !136, size: 32, offset: 640)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !311, file: !297, line: 350, baseType: !136, size: 32, offset: 672)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !311, file: !297, line: 351, baseType: !170, size: 64, offset: 704)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !311, file: !297, line: 352, baseType: !170, size: 64, offset: 768)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !311, file: !297, line: 354, baseType: !332, size: 384, offset: 832)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !297, line: 116, baseType: !333)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !297, line: 94, size: 384, elements: !334)
!334 = !{!335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !333, file: !297, line: 96, baseType: !136, size: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !333, file: !297, line: 96, baseType: !136, size: 32, offset: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !333, file: !297, line: 97, baseType: !136, size: 32, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !333, file: !297, line: 97, baseType: !136, size: 32, offset: 96)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !333, file: !297, line: 99, baseType: !162, size: 16, offset: 128)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !333, file: !297, line: 100, baseType: !162, size: 16, offset: 144)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !333, file: !297, line: 102, baseType: !162, size: 16, offset: 160)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !333, file: !297, line: 105, baseType: !162, size: 16, offset: 176)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !333, file: !297, line: 108, baseType: !162, size: 16, offset: 192)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !333, file: !297, line: 109, baseType: !162, size: 16, offset: 208)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !333, file: !297, line: 111, baseType: !162, size: 16, offset: 224)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !333, file: !297, line: 112, baseType: !162, size: 16, offset: 240)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !333, file: !297, line: 114, baseType: !136, size: 32, offset: 256)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !333, file: !297, line: 114, baseType: !136, size: 32, offset: 288)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !333, file: !297, line: 115, baseType: !136, size: 32, offset: 320)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !333, file: !297, line: 115, baseType: !136, size: 32, offset: 352)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !311, file: !297, line: 355, baseType: !141, size: 512, offset: 1216)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !194, file: !195, line: 134, baseType: !170, size: 64, offset: 2368)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !194, file: !195, line: 136, baseType: !354, size: 64, offset: 2432)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !195, line: 58, flags: DIFlagFwdDecl)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !194, file: !195, line: 138, baseType: !332, size: 384, offset: 2496)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !194, file: !195, line: 139, baseType: !358, size: 64, offset: 2880)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !297, line: 80, baseType: !360)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !297, line: 72, size: 192, elements: !361)
!361 = !{!362, !369, !370, !371, !372}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !360, file: !297, line: 73, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !297, line: 59, baseType: !365)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !297, line: 56, size: 128, elements: !366)
!366 = !{!367, !368}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !365, file: !297, line: 57, baseType: !323, size: 96)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !365, file: !297, line: 58, baseType: !136, size: 32, offset: 96)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !360, file: !297, line: 74, baseType: !136, size: 32, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !360, file: !297, line: 76, baseType: !136, size: 32, offset: 96)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !360, file: !297, line: 77, baseType: !136, size: 32, offset: 128)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !360, file: !297, line: 79, baseType: !136, size: 32, offset: 160)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !194, file: !195, line: 141, baseType: !252, size: 128, offset: 2944)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !194, file: !195, line: 142, baseType: !252, size: 128, offset: 3072)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !194, file: !195, line: 143, baseType: !252, size: 128, offset: 3200)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !194, file: !195, line: 144, baseType: !252, size: 128, offset: 3328)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !194, file: !195, line: 146, baseType: !136, size: 32, offset: 3456)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !194, file: !195, line: 147, baseType: !136, size: 32, offset: 3488)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !194, file: !195, line: 150, baseType: !380, size: 64, offset: 3520)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !265, line: 53, flags: DIFlagFwdDecl)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !194, file: !195, line: 151, baseType: !149, size: 64, offset: 3584)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !194, file: !195, line: 152, baseType: !136, size: 32, offset: 3648)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !194, file: !195, line: 153, baseType: !136, size: 32, offset: 3680)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !194, file: !195, line: 156, baseType: !323, size: 96, offset: 3712)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !194, file: !195, line: 156, baseType: !323, size: 96, offset: 3808)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !194, file: !195, line: 156, baseType: !323, size: 96, offset: 3904)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !194, file: !195, line: 157, baseType: !323, size: 96, offset: 4000)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !194, file: !195, line: 158, baseType: !323, size: 96, offset: 4096)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !194, file: !195, line: 159, baseType: !323, size: 96, offset: 4192)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !194, file: !195, line: 160, baseType: !323, size: 96, offset: 4288)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !194, file: !195, line: 160, baseType: !323, size: 96, offset: 4384)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !194, file: !195, line: 161, baseType: !395, size: 128, offset: 4480)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 128, elements: !396)
!396 = !{!397}
!397 = !DISubrange(count: 4)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !194, file: !195, line: 161, baseType: !395, size: 128, offset: 4608)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !194, file: !195, line: 162, baseType: !323, size: 96, offset: 4736)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !194, file: !195, line: 162, baseType: !323, size: 96, offset: 4832)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !194, file: !195, line: 163, baseType: !152, size: 32, offset: 4928)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !194, file: !195, line: 163, baseType: !152, size: 32, offset: 4960)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !194, file: !195, line: 164, baseType: !404, size: 512, offset: 4992)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 512, elements: !405)
!405 = !{!397, !397}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !194, file: !195, line: 165, baseType: !404, size: 512, offset: 5504)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !194, file: !195, line: 166, baseType: !404, size: 512, offset: 6016)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !194, file: !195, line: 167, baseType: !404, size: 512, offset: 6528)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !194, file: !195, line: 176, baseType: !404, size: 512, offset: 7040)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !194, file: !195, line: 178, baseType: !7, size: 32, offset: 7552)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !194, file: !195, line: 180, baseType: !162, size: 16, offset: 7584)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !194, file: !195, line: 181, baseType: !162, size: 16, offset: 7600)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !194, file: !195, line: 183, baseType: !162, size: 16, offset: 7616)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !194, file: !195, line: 183, baseType: !162, size: 16, offset: 7632)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !194, file: !195, line: 184, baseType: !162, size: 16, offset: 7648)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !194, file: !195, line: 184, baseType: !162, size: 16, offset: 7664)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !194, file: !195, line: 185, baseType: !162, size: 16, offset: 7680)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !194, file: !195, line: 186, baseType: !162, size: 16, offset: 7696)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !194, file: !195, line: 187, baseType: !162, size: 16, offset: 7712)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !194, file: !195, line: 188, baseType: !142, size: 8, offset: 7728)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !194, file: !195, line: 189, baseType: !142, size: 8, offset: 7736)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !194, file: !195, line: 192, baseType: !136, size: 32, offset: 7744)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !194, file: !195, line: 192, baseType: !136, size: 32, offset: 7776)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !194, file: !195, line: 192, baseType: !136, size: 32, offset: 7808)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !194, file: !195, line: 192, baseType: !136, size: 32, offset: 7840)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !194, file: !195, line: 194, baseType: !136, size: 32, offset: 7872)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !194, file: !195, line: 202, baseType: !152, size: 32, offset: 7904)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !194, file: !195, line: 202, baseType: !152, size: 32, offset: 7936)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !194, file: !195, line: 202, baseType: !152, size: 32, offset: 7968)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !194, file: !195, line: 211, baseType: !152, size: 32, offset: 8000)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !194, file: !195, line: 212, baseType: !152, size: 32, offset: 8032)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !194, file: !195, line: 213, baseType: !152, size: 32, offset: 8064)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !194, file: !195, line: 214, baseType: !152, size: 32, offset: 8096)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !194, file: !195, line: 215, baseType: !152, size: 32, offset: 8128)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !194, file: !195, line: 216, baseType: !152, size: 32, offset: 8160)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !194, file: !195, line: 219, baseType: !152, size: 32, offset: 8192)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !194, file: !195, line: 220, baseType: !152, size: 32, offset: 8224)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !194, file: !195, line: 221, baseType: !152, size: 32, offset: 8256)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !194, file: !195, line: 224, baseType: !440, size: 16, offset: 8288)
!440 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !194, file: !195, line: 224, baseType: !440, size: 16, offset: 8304)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !194, file: !195, line: 226, baseType: !162, size: 16, offset: 8320)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !194, file: !195, line: 228, baseType: !142, size: 8, offset: 8336)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !194, file: !195, line: 229, baseType: !142, size: 8, offset: 8344)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !194, file: !195, line: 231, baseType: !162, size: 16, offset: 8352)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !194, file: !195, line: 232, baseType: !142, size: 8, offset: 8368)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !194, file: !195, line: 233, baseType: !142, size: 8, offset: 8376)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !194, file: !195, line: 234, baseType: !152, size: 32, offset: 8384)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !194, file: !195, line: 235, baseType: !152, size: 32, offset: 8416)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !194, file: !195, line: 237, baseType: !252, size: 128, offset: 8448)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !194, file: !195, line: 238, baseType: !252, size: 128, offset: 8576)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !194, file: !195, line: 239, baseType: !252, size: 128, offset: 8704)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !194, file: !195, line: 240, baseType: !252, size: 128, offset: 8832)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !194, file: !195, line: 242, baseType: !152, size: 32, offset: 8960)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !194, file: !195, line: 244, baseType: !162, size: 16, offset: 8992)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !194, file: !195, line: 245, baseType: !440, size: 16, offset: 9008)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !194, file: !195, line: 246, baseType: !395, size: 128, offset: 9024)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !194, file: !195, line: 248, baseType: !136, size: 32, offset: 9152)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !194, file: !195, line: 249, baseType: !136, size: 32, offset: 9184)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !194, file: !195, line: 251, baseType: !461, size: 64, offset: 9216)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !195, line: 251, flags: DIFlagFwdDecl)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !194, file: !195, line: 253, baseType: !142, size: 8, offset: 9280)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !194, file: !195, line: 254, baseType: !142, size: 8, offset: 9288)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !194, file: !195, line: 255, baseType: !162, size: 16, offset: 9296)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !194, file: !195, line: 256, baseType: !323, size: 96, offset: 9312)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !194, file: !195, line: 258, baseType: !252, size: 128, offset: 9408)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !194, file: !195, line: 259, baseType: !252, size: 128, offset: 9536)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !194, file: !195, line: 260, baseType: !252, size: 128, offset: 9664)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !194, file: !195, line: 261, baseType: !252, size: 128, offset: 9792)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !194, file: !195, line: 263, baseType: !472, size: 64, offset: 9920)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !474, line: 244, flags: DIFlagFwdDecl)
!474 = !DIFile(filename: "blender/source/blender/makesdna/DNA_particle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!475 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !194, file: !195, line: 264, baseType: !476, size: 64, offset: 9984)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !195, line: 53, flags: DIFlagFwdDecl)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !194, file: !195, line: 265, baseType: !479, size: 64, offset: 10048)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !474, line: 238, flags: DIFlagFwdDecl)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !194, file: !195, line: 267, baseType: !142, size: 8, offset: 10112)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !194, file: !195, line: 268, baseType: !142, size: 8, offset: 10120)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !194, file: !195, line: 269, baseType: !162, size: 16, offset: 10128)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !194, file: !195, line: 270, baseType: !152, size: 32, offset: 10144)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !194, file: !195, line: 272, baseType: !486, size: 64, offset: 10176)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !195, line: 54, flags: DIFlagFwdDecl)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !194, file: !195, line: 275, baseType: !489, size: 64, offset: 10240)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !195, line: 275, flags: DIFlagFwdDecl)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !194, file: !195, line: 277, baseType: !492, size: 64, offset: 10304)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !28, line: 178, size: 13504, elements: !494)
!494 = !{!495, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !546, !549, !551, !552, !554, !555, !556, !557, !563, !568, !569, !573, !574, !575, !576, !577, !589, !601, !615, !619, !623, !627, !636, !648, !652, !656, !660, !664, !668, !669, !670, !671, !672, !673, !677, !678, !679, !680, !684, !685, !686, !687, !688, !693, !694, !695, !696, !697, !701, !702, !703, !704, !705, !712, !723, !728, !734, !744, !750, !761, !768, !775, !779, !784, !788, !793, !794, !795, !802, !808, !809, !810, !815, !816, !825, !934, !938, !946, !950, !954, !958, !966, !976}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !493, file: !28, line: 180, baseType: !496, size: 1600)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !80, line: 73, baseType: !497)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !80, line: 64, size: 1600, elements: !498)
!498 = !{!499, !514, !518, !519, !520, !521, !524}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !497, file: !80, line: 65, baseType: !500, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !80, line: 53, baseType: !502)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !80, line: 42, size: 832, elements: !503)
!503 = !{!504, !505, !506, !507, !508, !509, !510, !511, !512, !513}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !502, file: !80, line: 43, baseType: !136, size: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !502, file: !80, line: 44, baseType: !136, size: 32, offset: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !502, file: !80, line: 45, baseType: !136, size: 32, offset: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !502, file: !80, line: 46, baseType: !136, size: 32, offset: 96)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !502, file: !80, line: 47, baseType: !136, size: 32, offset: 128)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !502, file: !80, line: 48, baseType: !136, size: 32, offset: 160)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !502, file: !80, line: 49, baseType: !136, size: 32, offset: 192)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !502, file: !80, line: 50, baseType: !136, size: 32, offset: 224)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !502, file: !80, line: 51, baseType: !141, size: 512, offset: 256)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !502, file: !80, line: 52, baseType: !170, size: 64, offset: 768)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !497, file: !80, line: 66, baseType: !515, size: 1312, offset: 64)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 1312, elements: !516)
!516 = !{!517}
!517 = !DISubrange(count: 41)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !497, file: !80, line: 69, baseType: !136, size: 32, offset: 1376)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !497, file: !80, line: 69, baseType: !136, size: 32, offset: 1408)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !497, file: !80, line: 70, baseType: !136, size: 32, offset: 1440)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !497, file: !80, line: 71, baseType: !522, size: 64, offset: 1472)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !80, line: 71, flags: DIFlagFwdDecl)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !497, file: !80, line: 72, baseType: !525, size: 64, offset: 1536)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !80, line: 59, baseType: !527)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !80, line: 57, size: 8192, elements: !528)
!528 = !{!529}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !527, file: !80, line: 58, baseType: !217, size: 8192)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !493, file: !28, line: 180, baseType: !496, size: 1600, offset: 1600)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !493, file: !28, line: 180, baseType: !496, size: 1600, offset: 3200)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !493, file: !28, line: 180, baseType: !496, size: 1600, offset: 4800)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !493, file: !28, line: 180, baseType: !496, size: 1600, offset: 6400)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !493, file: !28, line: 181, baseType: !136, size: 32, offset: 8000)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !493, file: !28, line: 181, baseType: !136, size: 32, offset: 8032)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !493, file: !28, line: 181, baseType: !136, size: 32, offset: 8064)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !493, file: !28, line: 181, baseType: !136, size: 32, offset: 8096)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !493, file: !28, line: 181, baseType: !136, size: 32, offset: 8128)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !493, file: !28, line: 182, baseType: !136, size: 32, offset: 8160)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !493, file: !28, line: 183, baseType: !136, size: 32, offset: 8192)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !493, file: !28, line: 184, baseType: !542, size: 64, offset: 8256)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !543, line: 124, baseType: !544)
!543 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !543, line: 124, flags: DIFlagFwdDecl)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !493, file: !28, line: 185, baseType: !547, size: 64, offset: 8320)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !28, line: 97, flags: DIFlagFwdDecl)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !493, file: !28, line: 186, baseType: !550, size: 32, offset: 8384)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !28, line: 132, baseType: !27)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !493, file: !28, line: 187, baseType: !152, size: 32, offset: 8416)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !493, file: !28, line: 188, baseType: !553, size: 32, offset: 8448)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !28, line: 175, baseType: !33)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !493, file: !28, line: 189, baseType: !136, size: 32, offset: 8480)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !493, file: !28, line: 190, baseType: !380, size: 64, offset: 8512)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !493, file: !28, line: 193, baseType: !142, size: 8, offset: 8576)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !493, file: !28, line: 196, baseType: !558, size: 64, offset: 8640)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DISubroutineType(types: !560)
!560 = !{null, !561}
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !28, line: 177, baseType: !493)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !493, file: !28, line: 199, baseType: !564, size: 64, offset: 8704)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DISubroutineType(types: !566)
!566 = !{null, !561, !567}
!567 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !152)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !493, file: !28, line: 202, baseType: !558, size: 64, offset: 8768)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !493, file: !28, line: 207, baseType: !570, size: 64, offset: 8832)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DISubroutineType(types: !572)
!572 = !{!136, !561}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !493, file: !28, line: 208, baseType: !570, size: 64, offset: 8896)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !493, file: !28, line: 209, baseType: !570, size: 64, offset: 8960)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !493, file: !28, line: 210, baseType: !570, size: 64, offset: 9024)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !493, file: !28, line: 211, baseType: !570, size: 64, offset: 9088)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !493, file: !28, line: 218, baseType: !578, size: 64, offset: 9152)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{null, !561, !136, !581}
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !71, line: 65, size: 160, elements: !583)
!583 = !{!584, !585, !587, !588}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !582, file: !71, line: 66, baseType: !323, size: 96)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !582, file: !71, line: 67, baseType: !586, size: 48, offset: 96)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !162, size: 48, elements: !324)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !582, file: !71, line: 68, baseType: !142, size: 8, offset: 144)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !582, file: !71, line: 68, baseType: !142, size: 8, offset: 152)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !493, file: !28, line: 219, baseType: !590, size: 64, offset: 9216)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{null, !561, !136, !593}
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !71, line: 48, size: 96, elements: !595)
!595 = !{!596, !597, !598, !599, !600}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !594, file: !71, line: 49, baseType: !7, size: 32)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !594, file: !71, line: 49, baseType: !7, size: 32, offset: 32)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !594, file: !71, line: 50, baseType: !142, size: 8, offset: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !594, file: !71, line: 50, baseType: !142, size: 8, offset: 72)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !594, file: !71, line: 51, baseType: !162, size: 16, offset: 80)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !493, file: !28, line: 220, baseType: !602, size: 64, offset: 9280)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DISubroutineType(types: !604)
!604 = !{null, !561, !136, !605}
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !71, line: 42, size: 160, elements: !607)
!607 = !{!608, !609, !610, !611, !612, !613, !614}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !606, file: !71, line: 43, baseType: !7, size: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !606, file: !71, line: 43, baseType: !7, size: 32, offset: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !606, file: !71, line: 43, baseType: !7, size: 32, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !606, file: !71, line: 43, baseType: !7, size: 32, offset: 96)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !606, file: !71, line: 44, baseType: !162, size: 16, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !606, file: !71, line: 45, baseType: !142, size: 8, offset: 144)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !606, file: !71, line: 45, baseType: !142, size: 8, offset: 152)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !493, file: !28, line: 227, baseType: !616, size: 64, offset: 9344)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DISubroutineType(types: !618)
!618 = !{!581, !561}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !493, file: !28, line: 228, baseType: !620, size: 64, offset: 9408)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{!593, !561}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !493, file: !28, line: 229, baseType: !624, size: 64, offset: 9472)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DISubroutineType(types: !626)
!626 = !{!605, !561}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !493, file: !28, line: 230, baseType: !628, size: 64, offset: 9536)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DISubroutineType(types: !630)
!630 = !{!631, !561}
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !71, line: 88, size: 64, elements: !633)
!633 = !{!634, !635}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !632, file: !71, line: 89, baseType: !7, size: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !632, file: !71, line: 90, baseType: !7, size: 32, offset: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !493, file: !28, line: 231, baseType: !637, size: 64, offset: 9600)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DISubroutineType(types: !639)
!639 = !{!640, !561}
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !71, line: 79, size: 96, elements: !642)
!642 = !{!643, !644, !645, !646, !647}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !641, file: !71, line: 81, baseType: !136, size: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !641, file: !71, line: 82, baseType: !136, size: 32, offset: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !641, file: !71, line: 83, baseType: !162, size: 16, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !641, file: !71, line: 84, baseType: !142, size: 8, offset: 80)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !641, file: !71, line: 84, baseType: !142, size: 8, offset: 88)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !493, file: !28, line: 236, baseType: !649, size: 64, offset: 9664)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DISubroutineType(types: !651)
!651 = !{null, !561, !581}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !493, file: !28, line: 237, baseType: !653, size: 64, offset: 9728)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DISubroutineType(types: !655)
!655 = !{null, !561, !593}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !493, file: !28, line: 238, baseType: !657, size: 64, offset: 9792)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DISubroutineType(types: !659)
!659 = !{null, !561, !605}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !493, file: !28, line: 239, baseType: !661, size: 64, offset: 9856)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{null, !561, !631}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !493, file: !28, line: 240, baseType: !665, size: 64, offset: 9920)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{null, !561, !640}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !493, file: !28, line: 245, baseType: !616, size: 64, offset: 9984)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !493, file: !28, line: 246, baseType: !620, size: 64, offset: 10048)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !493, file: !28, line: 247, baseType: !624, size: 64, offset: 10112)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !493, file: !28, line: 248, baseType: !628, size: 64, offset: 10176)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !493, file: !28, line: 249, baseType: !637, size: 64, offset: 10240)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !493, file: !28, line: 255, baseType: !674, size: 64, offset: 10304)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DISubroutineType(types: !676)
!676 = !{!170, !561, !136, !136}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !493, file: !28, line: 256, baseType: !674, size: 64, offset: 10368)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !493, file: !28, line: 257, baseType: !674, size: 64, offset: 10432)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !493, file: !28, line: 258, baseType: !674, size: 64, offset: 10496)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !493, file: !28, line: 264, baseType: !681, size: 64, offset: 10560)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DISubroutineType(types: !683)
!683 = !{!170, !561, !136}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !493, file: !28, line: 265, baseType: !681, size: 64, offset: 10624)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !493, file: !28, line: 266, baseType: !681, size: 64, offset: 10688)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !493, file: !28, line: 267, baseType: !681, size: 64, offset: 10752)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !493, file: !28, line: 268, baseType: !681, size: 64, offset: 10816)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataLayout", scope: !493, file: !28, line: 272, baseType: !689, size: 64, offset: 10880)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DISubroutineType(types: !691)
!691 = !{!692, !561}
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataLayout", scope: !493, file: !28, line: 273, baseType: !689, size: 64, offset: 10944)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataLayout", scope: !493, file: !28, line: 274, baseType: !689, size: 64, offset: 11008)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataLayout", scope: !493, file: !28, line: 275, baseType: !689, size: 64, offset: 11072)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataLayout", scope: !493, file: !28, line: 276, baseType: !689, size: 64, offset: 11136)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromVertCData", scope: !493, file: !28, line: 279, baseType: !698, size: 64, offset: 11200)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DISubroutineType(types: !700)
!700 = !{null, !561, !136, !692, !136}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromEdgeCData", scope: !493, file: !28, line: 280, baseType: !698, size: 64, offset: 11264)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromFaceCData", scope: !493, file: !28, line: 281, baseType: !698, size: 64, offset: 11328)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "getNumGrids", scope: !493, file: !28, line: 284, baseType: !570, size: 64, offset: 11392)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "getGridSize", scope: !493, file: !28, line: 285, baseType: !570, size: 64, offset: 11456)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "getGridData", scope: !493, file: !28, line: 286, baseType: !706, size: 64, offset: 11520)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{!709, !561}
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !28, line: 82, flags: DIFlagFwdDecl)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "getGridAdjacency", scope: !493, file: !28, line: 287, baseType: !713, size: 64, offset: 11584)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DISubroutineType(types: !715)
!715 = !{!716, !561}
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGridAdjacency", file: !28, line: 120, baseType: !718)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMGridAdjacency", file: !28, line: 117, size: 256, elements: !719)
!719 = !{!720, !722}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !718, file: !28, line: 118, baseType: !721, size: 128)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 128, elements: !396)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !718, file: !28, line: 119, baseType: !721, size: 128, offset: 128)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "getGridOffset", scope: !493, file: !28, line: 288, baseType: !724, size: 64, offset: 11648)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DISubroutineType(types: !726)
!726 = !{!727, !561}
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "getGridKey", scope: !493, file: !28, line: 289, baseType: !729, size: 64, offset: 11712)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DISubroutineType(types: !731)
!731 = !{null, !561, !732}
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGKey", file: !28, line: 83, flags: DIFlagFwdDecl)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "getGridFlagMats", scope: !493, file: !28, line: 290, baseType: !735, size: 64, offset: 11776)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DISubroutineType(types: !737)
!737 = !{!738, !561}
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFlagMat", file: !28, line: 126, baseType: !740)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMFlagMat", file: !28, line: 123, size: 32, elements: !741)
!741 = !{!742, !743}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !740, file: !28, line: 124, baseType: !162, size: 16)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !740, file: !28, line: 125, baseType: !142, size: 8, offset: 16)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "getGridHidden", scope: !493, file: !28, line: 291, baseType: !745, size: 64, offset: 11840)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DISubroutineType(types: !747)
!747 = !{!748, !561}
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedVert", scope: !493, file: !28, line: 299, baseType: !751, size: 64, offset: 11904)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{null, !561, !754, !170, !760}
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DISubroutineType(types: !756)
!756 = !{null, !170, !136, !757, !757, !758}
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !162)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMForeachFlag", file: !28, line: 162, baseType: !38)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedEdge", scope: !493, file: !28, line: 309, baseType: !762, size: 64, offset: 11968)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DISubroutineType(types: !764)
!764 = !{null, !561, !765, !170}
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{null, !170, !136, !757, !757}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedLoop", scope: !493, file: !28, line: 317, baseType: !769, size: 64, offset: 12032)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DISubroutineType(types: !771)
!771 = !{null, !561, !772, !170, !760}
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DISubroutineType(types: !774)
!774 = !{null, !170, !136, !136, !757, !757}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedFaceCenter", scope: !493, file: !28, line: 327, baseType: !776, size: 64, offset: 12096)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DISubroutineType(types: !778)
!778 = !{null, !561, !765, !170, !760}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "getMinMax", scope: !493, file: !28, line: 337, baseType: !780, size: 64, offset: 12160)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DISubroutineType(types: !782)
!782 = !{null, !561, !783, !783}
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCo", scope: !493, file: !28, line: 344, baseType: !785, size: 64, offset: 12224)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DISubroutineType(types: !787)
!787 = !{null, !561, !136, !783}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCos", scope: !493, file: !28, line: 347, baseType: !789, size: 64, offset: 12288)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DISubroutineType(types: !791)
!791 = !{null, !561, !792}
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "getVertNo", scope: !493, file: !28, line: 350, baseType: !785, size: 64, offset: 12352)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyNo", scope: !493, file: !28, line: 351, baseType: !785, size: 64, offset: 12416)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyMap", scope: !493, file: !28, line: 355, baseType: !796, size: 64, offset: 12480)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DISubroutineType(types: !798)
!798 = !{!799, !193, !561}
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !801)
!801 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !28, line: 355, flags: DIFlagFwdDecl)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "getPBVH", scope: !493, file: !28, line: 359, baseType: !803, size: 64, offset: 12544)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DISubroutineType(types: !805)
!805 = !{!806, !193, !561}
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !28, line: 100, flags: DIFlagFwdDecl)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "drawVerts", scope: !493, file: !28, line: 364, baseType: !558, size: 64, offset: 12608)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "drawUVEdges", scope: !493, file: !28, line: 367, baseType: !558, size: 64, offset: 12672)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "drawEdges", scope: !493, file: !28, line: 373, baseType: !811, size: 64, offset: 12736)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DISubroutineType(types: !813)
!813 = !{null, !561, !814, !814}
!814 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "drawLooseEdges", scope: !493, file: !28, line: 376, baseType: !558, size: 64, offset: 12800)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesSolid", scope: !493, file: !28, line: 385, baseType: !817, size: 64, offset: 12864)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DISubroutineType(types: !819)
!819 = !{null, !561, !820, !814, !821}
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetMaterial", file: !28, line: 146, baseType: !822)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DISubroutineType(types: !824)
!824 = !{!136, !136, !170}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesTex", scope: !493, file: !28, line: 391, baseType: !826, size: 64, offset: 12928)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DISubroutineType(types: !828)
!828 = !{null, !561, !829, !929, !170, !933}
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptionsTex", file: !28, line: 150, baseType: !830)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DISubroutineType(types: !832)
!832 = !{!833, !834, !928, !136}
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawOption", file: !28, line: 143, baseType: !42)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !71, line: 160, size: 384, elements: !836)
!836 = !{!837, !841, !923, !924, !925, !926, !927}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !835, file: !71, line: 161, baseType: !838, size: 256)
!838 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 256, elements: !839)
!839 = !{!397, !840}
!840 = !DISubrange(count: 2)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !835, file: !71, line: 162, baseType: !842, size: 64, offset: 256)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !844, line: 77, size: 15424, elements: !845)
!844 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!845 = !{!846, !847, !848, !851, !854, !857, !860, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !912, !913, !917}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !843, file: !844, line: 78, baseType: !198, size: 960)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !843, file: !844, line: 80, baseType: !217, size: 8192, offset: 960)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !843, file: !844, line: 82, baseType: !849, size: 64, offset: 9152)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !844, line: 43, flags: DIFlagFwdDecl)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !843, file: !844, line: 83, baseType: !852, size: 64, offset: 9216)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !199, line: 46, flags: DIFlagFwdDecl)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !843, file: !844, line: 86, baseType: !855, size: 64, offset: 9280)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !844, line: 41, flags: DIFlagFwdDecl)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !843, file: !844, line: 87, baseType: !858, size: 64, offset: 9344)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !844, line: 44, flags: DIFlagFwdDecl)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !843, file: !844, line: 89, baseType: !861, size: 512, offset: 9408)
!861 = !DICompositeType(tag: DW_TAG_array_type, baseType: !858, size: 512, elements: !862)
!862 = !{!290}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !843, file: !844, line: 90, baseType: !162, size: 16, offset: 9920)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !843, file: !844, line: 90, baseType: !162, size: 16, offset: 9936)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !843, file: !844, line: 92, baseType: !162, size: 16, offset: 9952)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !843, file: !844, line: 92, baseType: !162, size: 16, offset: 9968)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !843, file: !844, line: 93, baseType: !162, size: 16, offset: 9984)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !843, file: !844, line: 93, baseType: !162, size: 16, offset: 10000)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !843, file: !844, line: 94, baseType: !136, size: 32, offset: 10016)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !843, file: !844, line: 97, baseType: !162, size: 16, offset: 10048)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !843, file: !844, line: 97, baseType: !162, size: 16, offset: 10064)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !843, file: !844, line: 98, baseType: !162, size: 16, offset: 10080)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !843, file: !844, line: 98, baseType: !162, size: 16, offset: 10096)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !843, file: !844, line: 99, baseType: !162, size: 16, offset: 10112)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !843, file: !844, line: 99, baseType: !162, size: 16, offset: 10128)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !843, file: !844, line: 100, baseType: !7, size: 32, offset: 10144)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !843, file: !844, line: 101, baseType: !749, size: 64, offset: 10176)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !843, file: !844, line: 103, baseType: !223, size: 64, offset: 10240)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !843, file: !844, line: 104, baseType: !880, size: 64, offset: 10304)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !199, line: 159, size: 448, elements: !882)
!882 = !{!883, !886, !887, !889, !890, !892}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !881, file: !199, line: 161, baseType: !884, size: 64)
!884 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !885)
!885 = !{!840}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !881, file: !199, line: 162, baseType: !884, size: 64, offset: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !881, file: !199, line: 163, baseType: !888, size: 32, offset: 128)
!888 = !DICompositeType(tag: DW_TAG_array_type, baseType: !162, size: 32, elements: !885)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !881, file: !199, line: 164, baseType: !888, size: 32, offset: 160)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !881, file: !199, line: 165, baseType: !891, size: 128, offset: 192)
!891 = !DICompositeType(tag: DW_TAG_array_type, baseType: !749, size: 128, elements: !885)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !881, file: !199, line: 166, baseType: !893, size: 128, offset: 320)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !852, size: 128, elements: !885)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !843, file: !844, line: 107, baseType: !152, size: 32, offset: 10368)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !843, file: !844, line: 108, baseType: !136, size: 32, offset: 10400)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !843, file: !844, line: 109, baseType: !162, size: 16, offset: 10432)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !843, file: !844, line: 110, baseType: !162, size: 16, offset: 10448)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !843, file: !844, line: 113, baseType: !136, size: 32, offset: 10464)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !843, file: !844, line: 113, baseType: !136, size: 32, offset: 10496)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !843, file: !844, line: 114, baseType: !142, size: 8, offset: 10528)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !843, file: !844, line: 114, baseType: !142, size: 8, offset: 10536)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !843, file: !844, line: 115, baseType: !162, size: 16, offset: 10544)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !843, file: !844, line: 116, baseType: !395, size: 128, offset: 10560)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !843, file: !844, line: 119, baseType: !152, size: 32, offset: 10688)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !843, file: !844, line: 119, baseType: !152, size: 32, offset: 10720)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !843, file: !844, line: 122, baseType: !907, size: 512, offset: 10752)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !908, line: 182, baseType: !909)
!908 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !908, line: 180, size: 512, elements: !910)
!910 = !{!911}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !909, file: !908, line: 181, baseType: !141, size: 512)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !843, file: !844, line: 123, baseType: !142, size: 8, offset: 11264)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !843, file: !844, line: 125, baseType: !914, size: 56, offset: 11272)
!914 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 56, elements: !915)
!915 = !{!916}
!916 = !DISubrange(count: 7)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !843, file: !844, line: 126, baseType: !918, size: 4096, offset: 11328)
!918 = !DICompositeType(tag: DW_TAG_array_type, baseType: !919, size: 4096, elements: !862)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !844, line: 69, baseType: !920)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !844, line: 67, size: 512, elements: !921)
!921 = !{!922}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !920, file: !844, line: 68, baseType: !141, size: 512)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !835, file: !71, line: 163, baseType: !142, size: 8, offset: 320)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !835, file: !71, line: 163, baseType: !142, size: 8, offset: 328)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !835, file: !71, line: 164, baseType: !162, size: 16, offset: 336)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !835, file: !71, line: 164, baseType: !162, size: 16, offset: 352)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !835, file: !71, line: 164, baseType: !162, size: 16, offset: 368)
!928 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !814)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCompareDrawOptions", file: !28, line: 147, baseType: !930)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DISubroutineType(types: !932)
!932 = !{!136, !170, !136, !136}
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawFlag", file: !28, line: 157, baseType: !48)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesGLSL", scope: !493, file: !28, line: 400, baseType: !935, size: 64, offset: 12992)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DISubroutineType(types: !937)
!937 = !{null, !561, !821}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFaces", scope: !493, file: !28, line: 415, baseType: !939, size: 64, offset: 13056)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DISubroutineType(types: !941)
!941 = !{null, !561, !942, !821, !929, !170, !933}
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptions", file: !28, line: 149, baseType: !943)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DISubroutineType(types: !945)
!945 = !{!833, !170, !136}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesTex", scope: !493, file: !28, line: 425, baseType: !947, size: 64, offset: 13120)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DISubroutineType(types: !949)
!949 = !{null, !561, !942, !929, !170, !933}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesGLSL", scope: !493, file: !28, line: 435, baseType: !951, size: 64, offset: 13184)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DISubroutineType(types: !953)
!953 = !{null, !561, !821, !942, !170}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdges", scope: !493, file: !28, line: 444, baseType: !955, size: 64, offset: 13248)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DISubroutineType(types: !957)
!957 = !{null, !561, !942, !170}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdgesInterp", scope: !493, file: !28, line: 455, baseType: !959, size: 64, offset: 13312)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DISubroutineType(types: !961)
!961 = !{null, !561, !942, !962, !170}
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawInterpOptions", file: !28, line: 148, baseType: !963)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DISubroutineType(types: !965)
!965 = !{null, !170, !136, !152}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesMat", scope: !493, file: !28, line: 464, baseType: !967, size: 64, offset: 13376)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DISubroutineType(types: !969)
!969 = !{null, !561, !970, !973, !170}
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{null, !170, !136, !170}
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DISubroutineType(types: !975)
!975 = !{!814, !170, !136}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !493, file: !28, line: 470, baseType: !558, size: 64, offset: 13440)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !194, file: !195, line: 277, baseType: !492, size: 64, offset: 10368)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !194, file: !195, line: 278, baseType: !979, size: 64, offset: 10432)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !980, line: 27, baseType: !981)
!980 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !982, line: 45, baseType: !166)
!982 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!983 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !194, file: !195, line: 279, baseType: !979, size: 64, offset: 10496)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !194, file: !195, line: 280, baseType: !7, size: 32, offset: 10560)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !194, file: !195, line: 281, baseType: !7, size: 32, offset: 10592)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !194, file: !195, line: 283, baseType: !252, size: 128, offset: 10624)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !194, file: !195, line: 284, baseType: !252, size: 128, offset: 10752)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !194, file: !195, line: 285, baseType: !989, size: 64, offset: 10880)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !194, file: !195, line: 287, baseType: !991, size: 64, offset: 10944)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!992 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !195, line: 59, flags: DIFlagFwdDecl)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !194, file: !195, line: 288, baseType: !994, size: 64, offset: 11008)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !195, line: 288, flags: DIFlagFwdDecl)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !194, file: !195, line: 290, baseType: !997, size: 64, offset: 11072)
!997 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 64, elements: !885)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !194, file: !195, line: 291, baseType: !999, size: 64, offset: 11136)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !844, line: 65, baseType: !1001)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !844, line: 50, size: 320, elements: !1002)
!1002 = !{!1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1001, file: !844, line: 51, baseType: !146, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1001, file: !844, line: 53, baseType: !136, size: 32, offset: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !1001, file: !844, line: 54, baseType: !136, size: 32, offset: 96)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1001, file: !844, line: 55, baseType: !136, size: 32, offset: 128)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !1001, file: !844, line: 55, baseType: !136, size: 32, offset: 160)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !1001, file: !844, line: 56, baseType: !142, size: 8, offset: 192)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !1001, file: !844, line: 56, baseType: !142, size: 8, offset: 200)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1001, file: !844, line: 57, baseType: !142, size: 8, offset: 208)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1001, file: !844, line: 57, baseType: !142, size: 8, offset: 216)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !1001, file: !844, line: 59, baseType: !162, size: 16, offset: 224)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !1001, file: !844, line: 59, baseType: !162, size: 16, offset: 240)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !1001, file: !844, line: 59, baseType: !162, size: 16, offset: 256)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1001, file: !844, line: 61, baseType: !162, size: 16, offset: 272)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1001, file: !844, line: 63, baseType: !136, size: 32, offset: 288)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !194, file: !195, line: 293, baseType: !252, size: 128, offset: 11200)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !194, file: !195, line: 294, baseType: !1019, size: 64, offset: 11328)
