; ModuleID = 'blender/source/blender/bmesh/operators/bmo_triangulate.c'
source_filename = "blender/source/blender/bmesh/operators/bmo_triangulate.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BMesh = type { i32, i32, i32, i32, i32, i32, i32, i8, i8, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BMVert**, %struct.BMEdge**, %struct.BMFace**, i32, i32, i32, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, i32, %struct.BMOperator*, %struct.CustomData, %struct.CustomData, %struct.CustomData, %struct.CustomData, i16, i32, i32, i32, %struct.ListBase, %struct.BMFace*, %struct.ListBase, i8* }
%struct.BMVert = type { %struct.BMHeader, %struct.BMFlagLayer*, [3 x float], [3 x float], %struct.BMEdge* }
%struct.BMHeader = type { i8*, i32, i8, i8, i8 }
%struct.BMFlagLayer = type { i16 }
%struct.BMEdge = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMVert*, %struct.BMVert*, %struct.BMLoop*, %struct.BMDiskLink, %struct.BMDiskLink }
%struct.BMLoop = type { %struct.BMHeader, %struct.BMVert*, %struct.BMEdge*, %struct.BMFace*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop* }
%struct.BMDiskLink = type { %struct.BMEdge*, %struct.BMEdge* }
%struct.BLI_mempool = type opaque
%struct.CustomData = type { %struct.CustomDataLayer*, [41 x i32], i32, i32, i32, %struct.BLI_mempool*, %struct.CustomDataExternal* }

!37 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NOP", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_UNTAN_MULTIRES", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NORMALS_CALC", value: 2, isUnsigned: true)
!40 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_FLUSH", value: 4, isUnsigned: true)
!41 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 249, baseType: !5, size: 32, elements: !44)
!43 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!44 = !{!45, !46, !47, !48}
!45 = !DIEnumerator(name: "BM_VERT", value: 1, isUnsigned: true)
!46 = !DIEnumerator(name: "BM_EDGE", value: 2, isUnsigned: true)
!47 = !DIEnumerator(name: "BM_LOOP", value: 4, isUnsigned: true)
!48 = !DIEnumerator(name: "BM_FACE", value: 8, isUnsigned: true)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 260, baseType: !5, size: 32, elements: !50)
!50 = !{!51, !52, !53, !54, !55, !56, !57}
!51 = !DIEnumerator(name: "BM_ELEM_SELECT", value: 1, isUnsigned: true)
!52 = !DIEnumerator(name: "BM_ELEM_HIDDEN", value: 2, isUnsigned: true)
!53 = !DIEnumerator(name: "BM_ELEM_SEAM", value: 4, isUnsigned: true)
!54 = !DIEnumerator(name: "BM_ELEM_SMOOTH", value: 8, isUnsigned: true)
!55 = !DIEnumerator(name: "BM_ELEM_TAG", value: 16, isUnsigned: true)
!56 = !DIEnumerator(name: "BM_ELEM_DRAW", value: 32, isUnsigned: true)
!57 = !DIEnumerator(name: "BM_ELEM_INTERNAL_TAG", value: 128, isUnsigned: true)
!58 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !59, line: 103, baseType: !5, size: 32, elements: !60)
!59 = !DIFile(filename: "blender/source/blender/blenlib/BLI_scanfill.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!60 = !{!61, !62, !63, !64, !65}
!61 = !DIEnumerator(name: "BLI_SCANFILL_CALC_QUADTRI_FASTPATH", value: 1, isUnsigned: true)
!62 = !DIEnumerator(name: "BLI_SCANFILL_CALC_REMOVE_DOUBLES", value: 2, isUnsigned: true)
!63 = !DIEnumerator(name: "BLI_SCANFILL_CALC_POLYS", value: 4, isUnsigned: true)
!64 = !DIEnumerator(name: "BLI_SCANFILL_CALC_HOLES", value: 8, isUnsigned: true)
!65 = !DIEnumerator(name: "BLI_SCANFILL_CALC_LOOSE", value: 16, isUnsigned: true)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BMIterType", file: !67, line: 57, baseType: !5, size: 32, elements: !68)
!67 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!68 = !{!69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82}
!69 = !DIEnumerator(name: "BM_VERTS_OF_MESH", value: 1, isUnsigned: true)
!70 = !DIEnumerator(name: "BM_EDGES_OF_MESH", value: 2, isUnsigned: true)
!71 = !DIEnumerator(name: "BM_FACES_OF_MESH", value: 3, isUnsigned: true)
!72 = !DIEnumerator(name: "BM_EDGES_OF_VERT", value: 4, isUnsigned: true)
!73 = !DIEnumerator(name: "BM_FACES_OF_VERT", value: 5, isUnsigned: true)
!74 = !DIEnumerator(name: "BM_LOOPS_OF_VERT", value: 6, isUnsigned: true)
!75 = !DIEnumerator(name: "BM_VERTS_OF_EDGE", value: 7, isUnsigned: true)
!76 = !DIEnumerator(name: "BM_FACES_OF_EDGE", value: 8, isUnsigned: true)
!77 = !DIEnumerator(name: "BM_VERTS_OF_FACE", value: 9, isUnsigned: true)
!78 = !DIEnumerator(name: "BM_EDGES_OF_FACE", value: 10, isUnsigned: true)
!79 = !DIEnumerator(name: "BM_LOOPS_OF_FACE", value: 11, isUnsigned: true)
!80 = !DIEnumerator(name: "BM_ALL_LOOPS_OF_FACE", value: 12, isUnsigned: true)
!81 = !DIEnumerator(name: "BM_LOOPS_OF_LOOP", value: 13, isUnsigned: true)
!82 = !DIEnumerator(name: "BM_LOOPS_OF_EDGE", value: 14, isUnsigned: true)
!83 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMCreateFlag", file: !84, line: 33, baseType: !5, size: 32, elements: !85)
!84 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_core.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!85 = !{!86, !87, !88}
!86 = !DIEnumerator(name: "BM_CREATE_NOP", value: 0, isUnsigned: true)
!87 = !DIEnumerator(name: "BM_CREATE_NO_DOUBLE", value: 2, isUnsigned: true)
!88 = !DIEnumerator(name: "BM_CREATE_SKIP_CD", value: 4, isUnsigned: true)
!89 = !{!90, !91, !92, !96, !100, !166, !168, !150}
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !67, line: 79, baseType: !66)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !67, line: 158, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{null, !90}
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !67, line: 159, baseType: !97)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DISubroutineType(types: !99)
!99 = !{!90, !90}
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !43, line: 103, baseType: !102)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !43, line: 90, size: 448, elements: !103)
!103 = !{!104, !115, !121, !126, !127}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !102, file: !43, line: 91, baseType: !105, size: 128)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !43, line: 82, baseType: !106)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !43, line: 64, size: 128, elements: !107)
!107 = !{!108, !109, !111, !113, !114}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !106, file: !43, line: 65, baseType: !90, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !106, file: !43, line: 66, baseType: !110, size: 32, offset: 64)
!110 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !106, file: !43, line: 73, baseType: !112, size: 8, offset: 96)
!112 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !106, file: !43, line: 74, baseType: !112, size: 8, offset: 104)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !106, file: !43, line: 80, baseType: !112, size: 8, offset: 112)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !102, file: !43, line: 92, baseType: !116, size: 64, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !43, line: 180, size: 16, elements: !118)
!118 = !{!119}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !117, file: !43, line: 181, baseType: !120, size: 16)
!120 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !102, file: !43, line: 94, baseType: !122, size: 96, offset: 192)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 96, elements: !124)
!123 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!124 = !{!125}
!125 = !DISubrange(count: 3)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !102, file: !43, line: 95, baseType: !122, size: 96, offset: 288)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !102, file: !43, line: 102, baseType: !128, size: 64, offset: 384)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !43, line: 110, size: 640, elements: !130)
!130 = !{!131, !132, !133, !135, !136, !159, !165}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !129, file: !43, line: 111, baseType: !105, size: 128)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !129, file: !43, line: 112, baseType: !116, size: 64, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !129, file: !43, line: 114, baseType: !134, size: 64, offset: 192)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !129, file: !43, line: 114, baseType: !134, size: 64, offset: 256)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !129, file: !43, line: 118, baseType: !137, size: 64, offset: 320)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !43, line: 125, size: 576, elements: !139)
!139 = !{!140, !141, !142, !143, !155, !156, !157, !158}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !138, file: !43, line: 126, baseType: !105, size: 128)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !138, file: !43, line: 129, baseType: !134, size: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !138, file: !43, line: 130, baseType: !128, size: 64, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !138, file: !43, line: 131, baseType: !144, size: 64, offset: 256)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !43, line: 164, size: 448, elements: !146)
!146 = !{!147, !148, !149, !152, !153, !154}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !145, file: !43, line: 165, baseType: !105, size: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !145, file: !43, line: 166, baseType: !116, size: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !145, file: !43, line: 172, baseType: !150, size: 64, offset: 192)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !43, line: 140, baseType: !138)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !145, file: !43, line: 174, baseType: !110, size: 32, offset: 256)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !145, file: !43, line: 175, baseType: !122, size: 96, offset: 288)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !145, file: !43, line: 176, baseType: !120, size: 16, offset: 384)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !138, file: !43, line: 135, baseType: !137, size: 64, offset: 320)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !138, file: !43, line: 135, baseType: !137, size: 64, offset: 384)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !138, file: !43, line: 139, baseType: !137, size: 64, offset: 448)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !138, file: !43, line: 139, baseType: !137, size: 64, offset: 512)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !129, file: !43, line: 122, baseType: !160, size: 128, offset: 384)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !43, line: 108, baseType: !161)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !43, line: 106, size: 128, elements: !162)
!162 = !{!163, !164}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !161, file: !43, line: 107, baseType: !128, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !161, file: !43, line: 107, baseType: !128, size: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !129, file: !43, line: 122, baseType: !160, size: 128, offset: 512)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !43, line: 123, baseType: !129)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !43, line: 178, baseType: !145)
!170 = !{i32 7, !"Dwarf Version", i32 4}
!171 = !{i32 2, !"Debug Info Version", i32 3}
!172 = !{i32 1, !"wchar_size", i32 4}
!173 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!174 = distinct !DISubprogram(name: "bmo_triangulate_exec", scope: !1, file: !1, line: 45, type: !175, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !320)
!175 = !DISubroutineType(types: !176)
!176 = !{null, !177, !318}
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !43, line: 246, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !43, line: 186, size: 8064, elements: !180)
!180 = !{!181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !194, !195, !196, !197, !199, !201, !203, !204, !205, !206, !207, !208, !209, !210, !262, !301, !302, !303, !304, !305, !306, !307, !308, !315, !316, !317}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !179, file: !43, line: 187, baseType: !110, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !179, file: !43, line: 187, baseType: !110, size: 32, offset: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !179, file: !43, line: 187, baseType: !110, size: 32, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !179, file: !43, line: 187, baseType: !110, size: 32, offset: 96)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !179, file: !43, line: 188, baseType: !110, size: 32, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !179, file: !43, line: 188, baseType: !110, size: 32, offset: 160)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !179, file: !43, line: 188, baseType: !110, size: 32, offset: 192)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !179, file: !43, line: 193, baseType: !112, size: 8, offset: 224)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !179, file: !43, line: 197, baseType: !112, size: 8, offset: 232)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !179, file: !43, line: 201, baseType: !191, size: 64, offset: 256)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !193, line: 71, flags: DIFlagFwdDecl)
!193 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!194 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !179, file: !43, line: 201, baseType: !191, size: 64, offset: 320)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !179, file: !43, line: 201, baseType: !191, size: 64, offset: 384)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !179, file: !43, line: 201, baseType: !191, size: 64, offset: 448)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !179, file: !43, line: 208, baseType: !198, size: 64, offset: 512)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !179, file: !43, line: 209, baseType: !200, size: 64, offset: 576)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !179, file: !43, line: 210, baseType: !202, size: 64, offset: 640)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !179, file: !43, line: 213, baseType: !110, size: 32, offset: 704)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !179, file: !43, line: 214, baseType: !110, size: 32, offset: 736)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !179, file: !43, line: 215, baseType: !110, size: 32, offset: 768)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !179, file: !43, line: 218, baseType: !191, size: 64, offset: 832)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !179, file: !43, line: 218, baseType: !191, size: 64, offset: 896)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !179, file: !43, line: 218, baseType: !191, size: 64, offset: 960)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !179, file: !43, line: 220, baseType: !110, size: 32, offset: 1024)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !179, file: !43, line: 221, baseType: !211, size: 64, offset: 1088)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !4, line: 190, size: 10496, elements: !213)
!213 = !{!214, !250, !251, !255, !258, !259, !261}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !212, file: !4, line: 191, baseType: !215, size: 5120)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !216, size: 5120, elements: !248)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !4, line: 147, size: 320, elements: !217)
!217 = !{!218, !221, !223, !233, !234}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !216, file: !4, line: 148, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !112)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !216, file: !4, line: 149, baseType: !222, size: 32, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !4, line: 112, baseType: !3)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !216, file: !4, line: 150, baseType: !224, size: 32, offset: 96)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !4, line: 142, baseType: !225)
!225 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !4, line: 138, size: 32, elements: !226)
!226 = !{!227, !229, !231}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !225, file: !4, line: 139, baseType: !228, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !4, line: 122, baseType: !15)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !225, file: !4, line: 140, baseType: !230, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !4, line: 136, baseType: !21)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !225, file: !4, line: 141, baseType: !232, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !4, line: 130, baseType: !27)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !216, file: !4, line: 152, baseType: !110, size: 32, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !216, file: !4, line: 162, baseType: !235, size: 128, offset: 192)
!235 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !216, file: !4, line: 155, size: 128, elements: !236)
!236 = !{!237, !238, !239, !240, !241, !243}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !235, file: !4, line: 156, baseType: !110, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !235, file: !4, line: 157, baseType: !123, size: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !235, file: !4, line: 158, baseType: !90, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !235, file: !4, line: 159, baseType: !122, size: 96)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !235, file: !4, line: 160, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !235, file: !4, line: 161, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !246, line: 48, baseType: !247)
!246 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !246, line: 48, flags: DIFlagFwdDecl)
!248 = !{!249}
!249 = !DISubrange(count: 16)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !212, file: !4, line: 192, baseType: !215, size: 5120, offset: 5120)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !212, file: !4, line: 193, baseType: !252, size: 64, offset: 10240)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DISubroutineType(types: !254)
!254 = !{null, !177, !211}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !212, file: !4, line: 194, baseType: !256, size: 64, offset: 10304)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !59, line: 54, flags: DIFlagFwdDecl)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !212, file: !4, line: 195, baseType: !110, size: 32, offset: 10368)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !212, file: !4, line: 196, baseType: !260, size: 32, offset: 10400)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !4, line: 188, baseType: !35)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !212, file: !4, line: 197, baseType: !110, size: 32, offset: 10432)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !179, file: !43, line: 223, baseType: !263, size: 1600, offset: 1152)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !193, line: 73, baseType: !264)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !193, line: 64, size: 1600, elements: !265)
!265 = !{!266, !284, !288, !289, !290, !291, !292}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !264, file: !193, line: 65, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !193, line: 53, baseType: !269)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !193, line: 42, size: 832, elements: !270)
!270 = !{!271, !272, !273, !274, !275, !276, !277, !278, !279, !283}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !269, file: !193, line: 43, baseType: !110, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !269, file: !193, line: 44, baseType: !110, size: 32, offset: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !269, file: !193, line: 45, baseType: !110, size: 32, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !269, file: !193, line: 46, baseType: !110, size: 32, offset: 96)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !269, file: !193, line: 47, baseType: !110, size: 32, offset: 128)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !269, file: !193, line: 48, baseType: !110, size: 32, offset: 160)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !269, file: !193, line: 49, baseType: !110, size: 32, offset: 192)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !269, file: !193, line: 50, baseType: !110, size: 32, offset: 224)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !269, file: !193, line: 51, baseType: !280, size: 512, offset: 256)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 512, elements: !281)
!281 = !{!282}
!282 = !DISubrange(count: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !269, file: !193, line: 52, baseType: !90, size: 64, offset: 768)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !264, file: !193, line: 66, baseType: !285, size: 1312, offset: 64)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 1312, elements: !286)
!286 = !{!287}
!287 = !DISubrange(count: 41)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !264, file: !193, line: 69, baseType: !110, size: 32, offset: 1376)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !264, file: !193, line: 69, baseType: !110, size: 32, offset: 1408)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !264, file: !193, line: 70, baseType: !110, size: 32, offset: 1440)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !264, file: !193, line: 71, baseType: !191, size: 64, offset: 1472)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !264, file: !193, line: 72, baseType: !293, size: 64, offset: 1536)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !193, line: 59, baseType: !295)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !193, line: 57, size: 8192, elements: !296)
!296 = !{!297}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !295, file: !193, line: 58, baseType: !298, size: 8192)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 8192, elements: !299)
!299 = !{!300}
!300 = !DISubrange(count: 1024)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !179, file: !43, line: 223, baseType: !263, size: 1600, offset: 2752)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !179, file: !43, line: 223, baseType: !263, size: 1600, offset: 4352)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !179, file: !43, line: 223, baseType: !263, size: 1600, offset: 5952)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !179, file: !43, line: 233, baseType: !120, size: 16, offset: 7552)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !179, file: !43, line: 236, baseType: !110, size: 32, offset: 7584)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !179, file: !43, line: 238, baseType: !110, size: 32, offset: 7616)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !179, file: !43, line: 238, baseType: !110, size: 32, offset: 7648)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !179, file: !43, line: 239, baseType: !309, size: 128, offset: 7680)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !310, line: 71, baseType: !311)
!310 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !310, line: 69, size: 128, elements: !312)
!312 = !{!313, !314}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !311, file: !310, line: 70, baseType: !90, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !311, file: !310, line: 70, baseType: !90, size: 64, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !179, file: !43, line: 241, baseType: !168, size: 64, offset: 7808)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !179, file: !43, line: 243, baseType: !309, size: 128, offset: 7872)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !179, file: !43, line: 245, baseType: !90, size: 64, offset: 8000)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOperator", file: !4, line: 198, baseType: !212)
!320 = !{}
!321 = !DILocalVariable(name: "bm", arg: 1, scope: !174, file: !1, line: 45, type: !177)
!322 = !DILocation(line: 45, column: 34, scope: !174)
!323 = !DILocalVariable(name: "op", arg: 2, scope: !174, file: !1, line: 45, type: !318)
!324 = !DILocation(line: 45, column: 50, scope: !174)
!325 = !DILocalVariable(name: "quad_method", scope: !174, file: !1, line: 47, type: !326)
!326 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!327 = !DILocation(line: 47, column: 12, scope: !174)
!328 = !DILocation(line: 47, column: 43, scope: !174)
!329 = !DILocation(line: 47, column: 47, scope: !174)
!330 = !DILocation(line: 47, column: 26, scope: !174)
!331 = !DILocalVariable(name: "ngon_method", scope: !174, file: !1, line: 48, type: !326)
!332 = !DILocation(line: 48, column: 12, scope: !174)
!333 = !DILocation(line: 48, column: 43, scope: !174)
!334 = !DILocation(line: 48, column: 47, scope: !174)
!335 = !DILocation(line: 48, column: 26, scope: !174)
!336 = !DILocalVariable(name: "slot_facemap_out", scope: !174, file: !1, line: 50, type: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpSlot", file: !4, line: 163, baseType: !216)
!339 = !DILocation(line: 50, column: 12, scope: !174)
!340 = !DILocation(line: 50, column: 44, scope: !174)
!341 = !DILocation(line: 50, column: 48, scope: !174)
!342 = !DILocation(line: 50, column: 31, scope: !174)
!343 = !DILocation(line: 52, column: 33, scope: !174)
!344 = !DILocation(line: 52, column: 2, scope: !174)
!345 = !DILocation(line: 53, column: 31, scope: !174)
!346 = !DILocation(line: 53, column: 35, scope: !174)
!347 = !DILocation(line: 53, column: 39, scope: !174)
!348 = !DILocation(line: 53, column: 2, scope: !174)
!349 = !DILocation(line: 55, column: 22, scope: !174)
!350 = !DILocation(line: 55, column: 26, scope: !174)
!351 = !DILocation(line: 55, column: 39, scope: !174)
!352 = !DILocation(line: 55, column: 58, scope: !174)
!353 = !DILocation(line: 55, column: 62, scope: !174)
!354 = !DILocation(line: 55, column: 2, scope: !174)
!355 = !DILocation(line: 57, column: 37, scope: !174)
!356 = !DILocation(line: 57, column: 41, scope: !174)
!357 = !DILocation(line: 57, column: 45, scope: !174)
!358 = !DILocation(line: 57, column: 49, scope: !174)
!359 = !DILocation(line: 57, column: 2, scope: !174)
!360 = !DILocation(line: 58, column: 37, scope: !174)
!361 = !DILocation(line: 58, column: 41, scope: !174)
!362 = !DILocation(line: 58, column: 45, scope: !174)
!363 = !DILocation(line: 58, column: 49, scope: !174)
!364 = !DILocation(line: 58, column: 2, scope: !174)
!365 = !DILocation(line: 59, column: 1, scope: !174)
!366 = distinct !DISubprogram(name: "bmo_triangle_fill_exec", scope: !1, file: !1, line: 66, type: !175, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !320)
!367 = !DILocalVariable(name: "bm", arg: 1, scope: !366, file: !1, line: 66, type: !177)
!368 = !DILocation(line: 66, column: 36, scope: !366)
!369 = !DILocalVariable(name: "op", arg: 2, scope: !366, file: !1, line: 66, type: !318)
!370 = !DILocation(line: 66, column: 52, scope: !366)
!371 = !DILocalVariable(name: "use_beauty", scope: !366, file: !1, line: 68, type: !372)
!372 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !373)
!373 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!374 = !DILocation(line: 68, column: 13, scope: !366)
!375 = !DILocation(line: 68, column: 44, scope: !366)
!376 = !DILocation(line: 68, column: 48, scope: !366)
!377 = !DILocation(line: 68, column: 26, scope: !366)
!378 = !DILocalVariable(name: "use_dissolve", scope: !366, file: !1, line: 69, type: !372)
!379 = !DILocation(line: 69, column: 13, scope: !366)
!380 = !DILocation(line: 69, column: 46, scope: !366)
!381 = !DILocation(line: 69, column: 50, scope: !366)
!382 = !DILocation(line: 69, column: 28, scope: !366)
!383 = !DILocalVariable(name: "siter", scope: !366, file: !1, line: 70, type: !384)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOIter", file: !4, line: 463, baseType: !385)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOIter", file: !4, line: 457, size: 448, elements: !386)
!386 = !{!387, !388, !389, !398, !399}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !385, file: !4, line: 458, baseType: !337, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !385, file: !4, line: 459, baseType: !110, size: 32, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "giter", scope: !385, file: !4, line: 460, baseType: !390, size: 192, offset: 128)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashIterator", file: !246, line: 54, baseType: !391)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GHashIterator", file: !246, line: 50, size: 192, elements: !392)
!392 = !{!393, !394, !397}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "gh", scope: !391, file: !246, line: 51, baseType: !244, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "curEntry", scope: !391, file: !246, line: 52, baseType: !395, size: 64, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry", file: !246, line: 52, flags: DIFlagFwdDecl)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "curBucket", scope: !391, file: !246, line: 53, baseType: !5, size: 32, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !385, file: !4, line: 461, baseType: !242, size: 64, offset: 320)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "restrictmask", scope: !385, file: !4, line: 462, baseType: !112, size: 8, offset: 384)
!400 = !DILocation(line: 70, column: 10, scope: !366)
!401 = !DILocalVariable(name: "e", scope: !366, file: !1, line: 71, type: !166)
!402 = !DILocation(line: 71, column: 10, scope: !366)
!403 = !DILocalVariable(name: "sf_ctx", scope: !366, file: !1, line: 72, type: !404)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScanFillContext", file: !59, line: 55, baseType: !405)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScanFillContext", file: !59, line: 44, size: 512, elements: !406)
!406 = !{!407, !408, !409, !410, !412}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "fillvertbase", scope: !405, file: !59, line: 45, baseType: !309, size: 128)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "filledgebase", scope: !405, file: !59, line: 46, baseType: !309, size: 128, offset: 128)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "fillfacebase", scope: !405, file: !59, line: 47, baseType: !309, size: 128, offset: 256)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "poly_nr", scope: !405, file: !59, line: 51, baseType: !411, size: 16, offset: 384)
!411 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !405, file: !59, line: 54, baseType: !256, size: 64, offset: 448)
!413 = !DILocation(line: 72, column: 18, scope: !366)
!414 = !DILocalVariable(name: "sf_tri", scope: !366, file: !1, line: 74, type: !415)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScanFillFace", file: !59, line: 97, baseType: !417)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScanFillFace", file: !59, line: 94, size: 320, elements: !418)
!418 = !{!419, !421, !422, !445, !446}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !417, file: !59, line: 95, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !417, file: !59, line: 95, baseType: !420, size: 64, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !417, file: !59, line: 96, baseType: !423, size: 64, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScanFillVert", file: !59, line: 66, size: 448, elements: !425)
!425 = !{!426, !427, !428, !435, !436, !440, !441, !442, !443, !444}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !424, file: !59, line: 67, baseType: !423, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !424, file: !59, line: 67, baseType: !423, size: 64, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !424, file: !59, line: 73, baseType: !429, size: 64, offset: 128)
!429 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !424, file: !59, line: 68, size: 64, elements: !430)
!430 = !{!431, !432, !433, !434}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !429, file: !59, line: 69, baseType: !423, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !429, file: !59, line: 70, baseType: !90, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !429, file: !59, line: 71, baseType: !110, size: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !429, file: !59, line: 72, baseType: !5, size: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !424, file: !59, line: 74, baseType: !122, size: 96, offset: 192)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "xy", scope: !424, file: !59, line: 75, baseType: !437, size: 64, offset: 288)
!437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 64, elements: !438)
!438 = !{!439}
!439 = !DISubrange(count: 2)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "keyindex", scope: !424, file: !59, line: 76, baseType: !5, size: 32, offset: 352)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "poly_nr", scope: !424, file: !59, line: 77, baseType: !411, size: 16, offset: 384)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "edge_tot", scope: !424, file: !59, line: 78, baseType: !373, size: 8, offset: 400)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !424, file: !59, line: 79, baseType: !5, size: 4, offset: 408, flags: DIFlagBitField, extraData: i64 408)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "user_flag", scope: !424, file: !59, line: 80, baseType: !5, size: 4, offset: 412, flags: DIFlagBitField, extraData: i64 408)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !417, file: !59, line: 96, baseType: !423, size: 64, offset: 192)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !417, file: !59, line: 96, baseType: !423, size: 64, offset: 256)
!447 = !DILocation(line: 74, column: 16, scope: !366)
!448 = !DILocalVariable(name: "sf_vert_map", scope: !366, file: !1, line: 75, type: !244)
!449 = !DILocation(line: 75, column: 9, scope: !366)
!450 = !DILocalVariable(name: "normal", scope: !366, file: !1, line: 76, type: !122)
!451 = !DILocation(line: 76, column: 8, scope: !366)
!452 = !DILocalVariable(name: "scanfill_flag", scope: !366, file: !1, line: 77, type: !326)
!453 = !DILocation(line: 77, column: 12, scope: !366)
!454 = !DILocalVariable(name: "calc_winding", scope: !366, file: !1, line: 78, type: !373)
!455 = !DILocation(line: 78, column: 7, scope: !366)
!456 = !DILocation(line: 80, column: 69, scope: !366)
!457 = !DILocation(line: 80, column: 73, scope: !366)
!458 = !DILocation(line: 80, column: 47, scope: !366)
!459 = !DILocation(line: 80, column: 16, scope: !366)
!460 = !DILocation(line: 80, column: 14, scope: !366)
!461 = !DILocation(line: 82, column: 19, scope: !366)
!462 = !DILocation(line: 82, column: 23, scope: !366)
!463 = !DILocation(line: 82, column: 43, scope: !366)
!464 = !DILocation(line: 82, column: 2, scope: !366)
!465 = !DILocation(line: 84, column: 2, scope: !366)
!466 = !DILocation(line: 86, column: 2, scope: !467)
!467 = distinct !DILexicalBlock(scope: !366, file: !1, line: 86, column: 2)
!468 = !DILocation(line: 86, column: 2, scope: !469)
!469 = distinct !DILexicalBlock(scope: !467, file: !1, line: 86, column: 2)
!470 = !DILocalVariable(name: "sf_verts", scope: !471, file: !1, line: 87, type: !472)
!471 = distinct !DILexicalBlock(scope: !469, file: !1, line: 86, column: 55)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !473, size: 128, elements: !438)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScanFillVert", file: !59, line: 81, baseType: !424)
!475 = !DILocation(line: 87, column: 17, scope: !471)
!476 = !DILocalVariable(name: "e_verts", scope: !471, file: !1, line: 88, type: !198)
!477 = !DILocation(line: 88, column: 12, scope: !471)
!478 = !DILocation(line: 88, column: 23, scope: !471)
!479 = !DILocation(line: 88, column: 26, scope: !471)
!480 = !DILocalVariable(name: "i", scope: !471, file: !1, line: 89, type: !5)
!481 = !DILocation(line: 89, column: 16, scope: !471)
!482 = !DILocation(line: 91, column: 3, scope: !471)
!483 = !DILocation(line: 93, column: 19, scope: !471)
!484 = !DILocation(line: 93, column: 32, scope: !471)
!485 = !DILocation(line: 93, column: 55, scope: !471)
!486 = !DILocation(line: 93, column: 35, scope: !471)
!487 = !DILocation(line: 93, column: 18, scope: !471)
!488 = !DILocation(line: 93, column: 16, scope: !471)
!489 = !DILocation(line: 95, column: 10, scope: !490)
!490 = distinct !DILexicalBlock(scope: !471, file: !1, line: 95, column: 3)
!491 = !DILocation(line: 95, column: 8, scope: !490)
!492 = !DILocation(line: 95, column: 15, scope: !493)
!493 = distinct !DILexicalBlock(scope: !490, file: !1, line: 95, column: 3)
!494 = !DILocation(line: 95, column: 17, scope: !493)
!495 = !DILocation(line: 95, column: 3, scope: !490)
!496 = !DILocation(line: 96, column: 40, scope: !497)
!497 = distinct !DILexicalBlock(scope: !498, file: !1, line: 96, column: 8)
!498 = distinct !DILexicalBlock(scope: !493, file: !1, line: 95, column: 27)
!499 = !DILocation(line: 96, column: 53, scope: !497)
!500 = !DILocation(line: 96, column: 61, scope: !497)
!501 = !DILocation(line: 96, column: 23, scope: !497)
!502 = !DILocation(line: 96, column: 18, scope: !497)
!503 = !DILocation(line: 96, column: 9, scope: !497)
!504 = !DILocation(line: 96, column: 21, scope: !497)
!505 = !DILocation(line: 96, column: 66, scope: !497)
!506 = !DILocation(line: 96, column: 8, scope: !498)
!507 = !DILocation(line: 97, column: 50, scope: !508)
!508 = distinct !DILexicalBlock(scope: !497, file: !1, line: 96, column: 75)
!509 = !DILocation(line: 97, column: 58, scope: !508)
!510 = !DILocation(line: 97, column: 62, scope: !508)
!511 = !DILocation(line: 97, column: 19, scope: !508)
!512 = !DILocation(line: 97, column: 14, scope: !508)
!513 = !DILocation(line: 97, column: 5, scope: !508)
!514 = !DILocation(line: 97, column: 17, scope: !508)
!515 = !DILocation(line: 98, column: 26, scope: !508)
!516 = !DILocation(line: 98, column: 34, scope: !508)
!517 = !DILocation(line: 98, column: 14, scope: !508)
!518 = !DILocation(line: 98, column: 5, scope: !508)
!519 = !DILocation(line: 98, column: 18, scope: !508)
!520 = !DILocation(line: 98, column: 22, scope: !508)
!521 = !DILocation(line: 98, column: 24, scope: !508)
!522 = !DILocation(line: 99, column: 22, scope: !508)
!523 = !DILocation(line: 99, column: 35, scope: !508)
!524 = !DILocation(line: 99, column: 43, scope: !508)
!525 = !DILocation(line: 99, column: 56, scope: !508)
!526 = !DILocation(line: 99, column: 47, scope: !508)
!527 = !DILocation(line: 99, column: 5, scope: !508)
!528 = !DILocation(line: 100, column: 4, scope: !508)
!529 = !DILocation(line: 101, column: 3, scope: !498)
!530 = !DILocation(line: 95, column: 23, scope: !493)
!531 = !DILocation(line: 95, column: 3, scope: !493)
!532 = distinct !{!532, !495, !533}
!533 = !DILocation(line: 101, column: 3, scope: !490)
!534 = !DILocation(line: 103, column: 50, scope: !471)
!535 = !DILocation(line: 103, column: 19, scope: !471)
!536 = !DILocation(line: 105, column: 2, scope: !471)
!537 = distinct !{!537, !466, !538}
!538 = !DILocation(line: 105, column: 2, scope: !467)
!539 = !DILocation(line: 106, column: 17, scope: !366)
!540 = !DILocation(line: 106, column: 2, scope: !366)
!541 = !DILocation(line: 109, column: 17, scope: !542)
!542 = distinct !DILexicalBlock(scope: !366, file: !1, line: 109, column: 6)
!543 = !DILocation(line: 109, column: 6, scope: !542)
!544 = !DILocation(line: 109, column: 6, scope: !366)
!545 = !DILocalVariable(name: "sf_vert", scope: !546, file: !1, line: 112, type: !473)
!546 = distinct !DILexicalBlock(scope: !542, file: !1, line: 109, column: 26)
!547 = !DILocation(line: 112, column: 17, scope: !546)
!548 = !DILocalVariable(name: "nors", scope: !546, file: !1, line: 113, type: !549)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SortNormal", file: !1, line: 61, size: 128, elements: !551)
!551 = !{!552, !553}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !550, file: !1, line: 62, baseType: !123, size: 32)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !550, file: !1, line: 63, baseType: !122, size: 96, offset: 32)
!554 = !DILocation(line: 113, column: 22, scope: !546)
!555 = !DILocalVariable(name: "nors_tot", scope: !546, file: !1, line: 114, type: !556)
!556 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!557 = !DILocation(line: 114, column: 22, scope: !546)
!558 = !DILocation(line: 114, column: 48, scope: !546)
!559 = !DILocation(line: 114, column: 33, scope: !546)
!560 = !DILocalVariable(name: "i", scope: !546, file: !1, line: 115, type: !5)
!561 = !DILocation(line: 115, column: 16, scope: !546)
!562 = !DILocalVariable(name: "is_degenerate", scope: !546, file: !1, line: 116, type: !373)
!563 = !DILocation(line: 116, column: 8, scope: !546)
!564 = !DILocation(line: 118, column: 10, scope: !546)
!565 = !DILocation(line: 118, column: 38, scope: !546)
!566 = !DILocation(line: 118, column: 36, scope: !546)
!567 = !DILocation(line: 118, column: 8, scope: !546)
!568 = !DILocation(line: 120, column: 25, scope: !569)
!569 = distinct !DILexicalBlock(scope: !546, file: !1, line: 120, column: 3)
!570 = !DILocation(line: 120, column: 38, scope: !569)
!571 = !DILocation(line: 120, column: 18, scope: !569)
!572 = !DILocation(line: 120, column: 16, scope: !569)
!573 = !DILocation(line: 120, column: 47, scope: !569)
!574 = !DILocation(line: 120, column: 8, scope: !569)
!575 = !DILocation(line: 120, column: 52, scope: !576)
!576 = distinct !DILexicalBlock(scope: !569, file: !1, line: 120, column: 3)
!577 = !DILocation(line: 120, column: 3, scope: !569)
!578 = !DILocalVariable(name: "v", scope: !579, file: !1, line: 121, type: !100)
!579 = distinct !DILexicalBlock(scope: !576, file: !1, line: 120, column: 91)
!580 = !DILocation(line: 121, column: 12, scope: !579)
!581 = !DILocation(line: 121, column: 16, scope: !579)
!582 = !DILocation(line: 121, column: 25, scope: !579)
!583 = !DILocation(line: 121, column: 29, scope: !579)
!584 = !DILocalVariable(name: "eiter", scope: !579, file: !1, line: 122, type: !585)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter", file: !67, line: 186, baseType: !586)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter", file: !67, line: 164, size: 512, elements: !587)
!587 = !{!588, !668, !669, !670, !671}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !586, file: !67, line: 179, baseType: !589, size: 320)
!589 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !586, file: !67, line: 166, size: 320, elements: !590)
!590 = !{!591, !606, !612, !620, !628, !634, !640, !646, !650, !656, !662}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "elem_of_mesh", scope: !589, file: !67, line: 167, baseType: !592, size: 192)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__elem_of_mesh", file: !67, line: 113, size: 192, elements: !593)
!593 = !{!594}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "pooliter", scope: !592, file: !67, line: 114, baseType: !595, size: 192)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool_iter", file: !596, line: 80, baseType: !597)
!596 = !DIFile(filename: "blender/source/blender/blenlib/BLI_mempool.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_iter", file: !596, line: 76, size: 192, elements: !598)
!598 = !{!599, !602, !605}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !597, file: !596, line: 77, baseType: !600, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool", file: !596, line: 47, baseType: !192)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "curchunk", scope: !597, file: !596, line: 78, baseType: !603, size: 64, offset: 64)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_chunk", file: !596, line: 45, flags: DIFlagFwdDecl)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "curindex", scope: !597, file: !596, line: 79, baseType: !5, size: 32, offset: 128)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_vert", scope: !589, file: !67, line: 169, baseType: !607, size: 192)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_vert", file: !67, line: 116, size: 192, elements: !608)
!608 = !{!609, !610, !611}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !607, file: !67, line: 117, baseType: !100, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !607, file: !67, line: 118, baseType: !166, size: 64, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !607, file: !67, line: 118, baseType: !166, size: 64, offset: 128)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_vert", scope: !589, file: !67, line: 170, baseType: !613, size: 320)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_vert", file: !67, line: 120, size: 320, elements: !614)
!614 = !{!615, !616, !617, !618, !619}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !613, file: !67, line: 121, baseType: !100, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !613, file: !67, line: 122, baseType: !150, size: 64, offset: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !613, file: !67, line: 122, baseType: !150, size: 64, offset: 128)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !613, file: !67, line: 123, baseType: !166, size: 64, offset: 192)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !613, file: !67, line: 123, baseType: !166, size: 64, offset: 256)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_vert", scope: !589, file: !67, line: 171, baseType: !621, size: 320)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_vert", file: !67, line: 125, size: 320, elements: !622)
!622 = !{!623, !624, !625, !626, !627}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !621, file: !67, line: 126, baseType: !100, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !621, file: !67, line: 127, baseType: !150, size: 64, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !621, file: !67, line: 127, baseType: !150, size: 64, offset: 128)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !621, file: !67, line: 128, baseType: !166, size: 64, offset: 192)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !621, file: !67, line: 128, baseType: !166, size: 64, offset: 256)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_edge", scope: !589, file: !67, line: 172, baseType: !629, size: 192)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_edge", file: !67, line: 130, size: 192, elements: !630)
!630 = !{!631, !632, !633}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !629, file: !67, line: 131, baseType: !166, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !629, file: !67, line: 132, baseType: !150, size: 64, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !629, file: !67, line: 132, baseType: !150, size: 64, offset: 128)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_loop", scope: !589, file: !67, line: 173, baseType: !635, size: 192)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_loop", file: !67, line: 134, size: 192, elements: !636)
!636 = !{!637, !638, !639}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !635, file: !67, line: 135, baseType: !150, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !635, file: !67, line: 136, baseType: !150, size: 64, offset: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !635, file: !67, line: 136, baseType: !150, size: 64, offset: 128)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_edge", scope: !589, file: !67, line: 174, baseType: !641, size: 192)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_edge", file: !67, line: 138, size: 192, elements: !642)
!642 = !{!643, !644, !645}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !641, file: !67, line: 139, baseType: !166, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !641, file: !67, line: 140, baseType: !150, size: 64, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !641, file: !67, line: 140, baseType: !150, size: 64, offset: 128)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_edge", scope: !589, file: !67, line: 175, baseType: !647, size: 64)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_edge", file: !67, line: 142, size: 64, elements: !648)
!648 = !{!649}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !647, file: !67, line: 143, baseType: !166, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_face", scope: !589, file: !67, line: 176, baseType: !651, size: 192)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_face", file: !67, line: 145, size: 192, elements: !652)
!652 = !{!653, !654, !655}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !651, file: !67, line: 146, baseType: !168, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !651, file: !67, line: 147, baseType: !150, size: 64, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !651, file: !67, line: 147, baseType: !150, size: 64, offset: 128)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_face", scope: !589, file: !67, line: 177, baseType: !657, size: 192)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_face", file: !67, line: 149, size: 192, elements: !658)
!658 = !{!659, !660, !661}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !657, file: !67, line: 150, baseType: !168, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !657, file: !67, line: 151, baseType: !150, size: 64, offset: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !657, file: !67, line: 151, baseType: !150, size: 64, offset: 128)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_face", scope: !589, file: !67, line: 178, baseType: !663, size: 192)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_face", file: !67, line: 153, size: 192, elements: !664)
!664 = !{!665, !666, !667}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !663, file: !67, line: 154, baseType: !168, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !663, file: !67, line: 155, baseType: !150, size: 64, offset: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !663, file: !67, line: 155, baseType: !150, size: 64, offset: 128)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !586, file: !67, line: 181, baseType: !92, size: 64, offset: 320)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !586, file: !67, line: 182, baseType: !96, size: 64, offset: 384)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !586, file: !67, line: 184, baseType: !110, size: 32, offset: 448)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !586, file: !67, line: 185, baseType: !112, size: 8, offset: 480)
!672 = !DILocation(line: 122, column: 11, scope: !579)
!673 = !DILocalVariable(name: "e", scope: !579, file: !1, line: 123, type: !166)
!674 = !DILocation(line: 123, column: 12, scope: !579)
!675 = !DILocalVariable(name: "e_pair", scope: !579, file: !1, line: 123, type: !676)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 128, elements: !438)
!677 = !DILocation(line: 123, column: 16, scope: !579)
!678 = !DILocalVariable(name: "e_index", scope: !579, file: !1, line: 124, type: !5)
!679 = !DILocation(line: 124, column: 17, scope: !579)
!680 = !DILocation(line: 126, column: 4, scope: !579)
!681 = !DILocation(line: 126, column: 9, scope: !579)
!682 = !DILocation(line: 126, column: 12, scope: !579)
!683 = !DILocation(line: 126, column: 18, scope: !579)
!684 = !DILocation(line: 129, column: 14, scope: !579)
!685 = !DILocation(line: 129, column: 22, scope: !579)
!686 = !DILocation(line: 129, column: 25, scope: !579)
!687 = !DILocation(line: 129, column: 4, scope: !579)
!688 = !DILocation(line: 131, column: 4, scope: !689)
!689 = distinct !DILexicalBlock(scope: !579, file: !1, line: 131, column: 4)
!690 = !DILocation(line: 131, column: 4, scope: !691)
!691 = distinct !DILexicalBlock(scope: !689, file: !1, line: 131, column: 4)
!692 = !DILocation(line: 132, column: 9, scope: !693)
!693 = distinct !DILexicalBlock(scope: !694, file: !1, line: 132, column: 9)
!694 = distinct !DILexicalBlock(scope: !691, file: !1, line: 131, column: 50)
!695 = !DILocation(line: 132, column: 9, scope: !694)
!696 = !DILocation(line: 133, column: 10, scope: !697)
!697 = distinct !DILexicalBlock(scope: !698, file: !1, line: 133, column: 10)
!698 = distinct !DILexicalBlock(scope: !693, file: !1, line: 132, column: 47)
!699 = !DILocation(line: 133, column: 18, scope: !697)
!700 = !DILocation(line: 133, column: 10, scope: !698)
!701 = !DILocation(line: 134, column: 15, scope: !702)
!702 = distinct !DILexicalBlock(scope: !697, file: !1, line: 133, column: 24)
!703 = !DILocation(line: 135, column: 7, scope: !702)
!704 = !DILocation(line: 137, column: 26, scope: !698)
!705 = !DILocation(line: 137, column: 20, scope: !698)
!706 = !DILocation(line: 137, column: 6, scope: !698)
!707 = !DILocation(line: 137, column: 24, scope: !698)
!708 = !DILocation(line: 138, column: 5, scope: !698)
!709 = !DILocation(line: 139, column: 4, scope: !694)
!710 = distinct !{!710, !688, !711}
!711 = !DILocation(line: 139, column: 4, scope: !689)
!712 = !DILocation(line: 141, column: 8, scope: !713)
!713 = distinct !DILexicalBlock(scope: !579, file: !1, line: 141, column: 8)
!714 = !DILocation(line: 141, column: 16, scope: !713)
!715 = !DILocation(line: 141, column: 8, scope: !579)
!716 = !DILocalVariable(name: "dir_a", scope: !717, file: !1, line: 142, type: !122)
!717 = distinct !DILexicalBlock(scope: !713, file: !1, line: 141, column: 22)
!718 = !DILocation(line: 142, column: 11, scope: !717)
!719 = !DILocalVariable(name: "dir_b", scope: !717, file: !1, line: 142, type: !122)
!720 = !DILocation(line: 142, column: 21, scope: !717)
!721 = !DILocation(line: 144, column: 19, scope: !717)
!722 = !DILocation(line: 146, column: 17, scope: !717)
!723 = !DILocation(line: 146, column: 24, scope: !717)
!724 = !DILocation(line: 146, column: 27, scope: !717)
!725 = !DILocation(line: 146, column: 50, scope: !717)
!726 = !DILocation(line: 146, column: 61, scope: !717)
!727 = !DILocation(line: 146, column: 31, scope: !717)
!728 = !DILocation(line: 146, column: 65, scope: !717)
!729 = !DILocation(line: 146, column: 5, scope: !717)
!730 = !DILocation(line: 147, column: 17, scope: !717)
!731 = !DILocation(line: 147, column: 24, scope: !717)
!732 = !DILocation(line: 147, column: 27, scope: !717)
!733 = !DILocation(line: 147, column: 50, scope: !717)
!734 = !DILocation(line: 147, column: 61, scope: !717)
!735 = !DILocation(line: 147, column: 31, scope: !717)
