; ModuleID = 'blender/source/blender/bmesh/operators/bmo_fill_grid.c'
source_filename = "blender/source/blender/bmesh/operators/bmo_fill_grid.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BMesh = type { i32, i32, i32, i32, i32, i32, i32, i8, i8, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BMVert**, %struct.BMEdge**, %struct.BMFace**, i32, i32, i32, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, i32, %struct.BMOperator*, %struct.CustomData, %struct.CustomData, %struct.CustomData, %struct.CustomData, i16, i32, i32, i32, %struct.ListBase, %struct.BMFace*, %struct.ListBase, i8* }
%struct.BMVert = type { %struct.BMHeader, %struct.BMFlagLayer*, [3 x float], [3 x float], %struct.BMEdge* }
%struct.BMHeader = type { i8*, i32, i8, i8, i8 }
%struct.BMFlagLayer = type { i16 }
%struct.BMEdge = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMVert*, %struct.BMVert*, %struct.BMLoop*, %struct.BMDiskLink, %struct.BMDiskLink }
%struct.BMLoop = type { %struct.BMHeader, %struct.BMVert*, %struct.BMEdge*, %struct.BMFace*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop* }
%struct.BMDiskLink = type { %struct.BMEdge*, %struct.BMEdge* }
%struct.BLI_mempool = type opaque
%struct.CustomData = type { %struct.CustomDataLayer*, [41 x i32], i32, i32, i32, %struct.BLI_mempool*, %struct.CustomDataExternal* }

!18 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_EDGE", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_FACE", value: 8, isUnsigned: true)
!20 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_IS_SINGLE", value: 16, isUnsigned: true)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Ptr", file: !4, line: 131, baseType: !5, size: 32, elements: !22)
!22 = !{!23, !24, !25, !26}
!23 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_BMESH", value: 100, isUnsigned: true)
!24 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_SCENE", value: 101, isUnsigned: true)
!25 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_OBJECT", value: 102, isUnsigned: true)
!26 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_MESH", value: 103, isUnsigned: true)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Map", file: !4, line: 123, baseType: !5, size: 32, elements: !28)
!28 = !{!29, !30, !31, !32, !33, !34}
!29 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_EMPTY", value: 64, isUnsigned: true)
!30 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_ELEM", value: 65, isUnsigned: true)
!31 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_FLT", value: 66, isUnsigned: true)
!32 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INT", value: 67, isUnsigned: true)
!33 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_BOOL", value: 68, isUnsigned: true)
!34 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INTERNAL", value: 69, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 182, baseType: !5, size: 32, elements: !36)
!36 = !{!37, !38, !39, !40, !41}
!37 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NOP", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_UNTAN_MULTIRES", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NORMALS_CALC", value: 2, isUnsigned: true)
!40 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_FLUSH", value: 4, isUnsigned: true)
!41 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 249, baseType: !5, size: 32, elements: !44)
!43 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!44 = !{!45, !46, !47, !48}
!45 = !DIEnumerator(name: "BM_VERT", value: 1, isUnsigned: true)
!46 = !DIEnumerator(name: "BM_EDGE", value: 2, isUnsigned: true)
!47 = !DIEnumerator(name: "BM_LOOP", value: 4, isUnsigned: true)
!48 = !DIEnumerator(name: "BM_FACE", value: 8, isUnsigned: true)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !50, line: 62, baseType: !5, size: 32, elements: !51)
!50 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_error.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!51 = !{!52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62}
!52 = !DIEnumerator(name: "BMERR_SELF_INTERSECTING", value: 1, isUnsigned: true)
!53 = !DIEnumerator(name: "BMERR_DISSOLVEDISK_FAILED", value: 2, isUnsigned: true)
!54 = !DIEnumerator(name: "BMERR_CONNECTVERT_FAILED", value: 3, isUnsigned: true)
!55 = !DIEnumerator(name: "BMERR_WALKER_FAILED", value: 4, isUnsigned: true)
!56 = !DIEnumerator(name: "BMERR_DISSOLVEFACES_FAILED", value: 5, isUnsigned: true)
!57 = !DIEnumerator(name: "BMERR_TESSELLATION", value: 6, isUnsigned: true)
!58 = !DIEnumerator(name: "BMERR_NONMANIFOLD", value: 7, isUnsigned: true)
!59 = !DIEnumerator(name: "BMERR_INVALID_SELECTION", value: 8, isUnsigned: true)
!60 = !DIEnumerator(name: "BMERR_MESH_ERROR", value: 9, isUnsigned: true)
!61 = !DIEnumerator(name: "BMERR_CONVEX_HULL_FAILED", value: 10, isUnsigned: true)
!62 = !DIEnumerator(name: "BMERR_TOTAL", value: 11, isUnsigned: true)
!63 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 260, baseType: !5, size: 32, elements: !64)
!64 = !{!65, !66, !67, !68, !69, !70, !71}
!65 = !DIEnumerator(name: "BM_ELEM_SELECT", value: 1, isUnsigned: true)
!66 = !DIEnumerator(name: "BM_ELEM_HIDDEN", value: 2, isUnsigned: true)
!67 = !DIEnumerator(name: "BM_ELEM_SEAM", value: 4, isUnsigned: true)
!68 = !DIEnumerator(name: "BM_ELEM_SMOOTH", value: 8, isUnsigned: true)
!69 = !DIEnumerator(name: "BM_ELEM_TAG", value: 16, isUnsigned: true)
!70 = !DIEnumerator(name: "BM_ELEM_DRAW", value: 32, isUnsigned: true)
!71 = !DIEnumerator(name: "BM_ELEM_INTERNAL_TAG", value: 128, isUnsigned: true)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMCreateFlag", file: !73, line: 33, baseType: !5, size: 32, elements: !74)
!73 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_core.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!74 = !{!75, !76, !77}
!75 = !DIEnumerator(name: "BM_CREATE_NOP", value: 0, isUnsigned: true)
!76 = !DIEnumerator(name: "BM_CREATE_NO_DOUBLE", value: 2, isUnsigned: true)
!77 = !DIEnumerator(name: "BM_CREATE_SKIP_CD", value: 4, isUnsigned: true)
!78 = !{!79, !80, !81, !90, !5, !299, !134}
!79 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "LinkData", file: !83, line: 66, baseType: !84)
!83 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LinkData", file: !83, line: 63, size: 192, elements: !85)
!85 = !{!86, !88, !89}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !84, file: !83, line: 64, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !84, file: !83, line: 64, baseType: !87, size: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !84, file: !83, line: 65, baseType: !80, size: 64, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !43, line: 246, baseType: !92)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !43, line: 186, size: 8064, elements: !93)
!93 = !{!94, !96, !97, !98, !99, !100, !101, !102, !104, !105, !109, !110, !111, !112, !177, !181, !185, !186, !187, !188, !189, !190, !191, !192, !244, !283, !284, !285, !286, !287, !288, !289, !290, !296, !297, !298}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !92, file: !43, line: 187, baseType: !95, size: 32)
!95 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !92, file: !43, line: 187, baseType: !95, size: 32, offset: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !92, file: !43, line: 187, baseType: !95, size: 32, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !92, file: !43, line: 187, baseType: !95, size: 32, offset: 96)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !92, file: !43, line: 188, baseType: !95, size: 32, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !92, file: !43, line: 188, baseType: !95, size: 32, offset: 160)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !92, file: !43, line: 188, baseType: !95, size: 32, offset: 192)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !92, file: !43, line: 193, baseType: !103, size: 8, offset: 224)
!103 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !92, file: !43, line: 197, baseType: !103, size: 8, offset: 232)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !92, file: !43, line: 201, baseType: !106, size: 64, offset: 256)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !108, line: 71, flags: DIFlagFwdDecl)
!108 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!109 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !92, file: !43, line: 201, baseType: !106, size: 64, offset: 320)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !92, file: !43, line: 201, baseType: !106, size: 64, offset: 384)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !92, file: !43, line: 201, baseType: !106, size: 64, offset: 448)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !92, file: !43, line: 208, baseType: !113, size: 64, offset: 512)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !43, line: 103, baseType: !116)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !43, line: 90, size: 448, elements: !117)
!117 = !{!118, !127, !132, !137, !138}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !116, file: !43, line: 91, baseType: !119, size: 128)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !43, line: 82, baseType: !120)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !43, line: 64, size: 128, elements: !121)
!121 = !{!122, !123, !124, !125, !126}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !120, file: !43, line: 65, baseType: !80, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !120, file: !43, line: 66, baseType: !95, size: 32, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !120, file: !43, line: 73, baseType: !103, size: 8, offset: 96)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !120, file: !43, line: 74, baseType: !103, size: 8, offset: 104)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !120, file: !43, line: 80, baseType: !103, size: 8, offset: 112)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !116, file: !43, line: 92, baseType: !128, size: 64, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !43, line: 180, size: 16, elements: !130)
!130 = !{!131}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !129, file: !43, line: 181, baseType: !79, size: 16)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !116, file: !43, line: 94, baseType: !133, size: 96, offset: 192)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 96, elements: !135)
!134 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!135 = !{!136}
!136 = !DISubrange(count: 3)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !116, file: !43, line: 95, baseType: !133, size: 96, offset: 288)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !116, file: !43, line: 102, baseType: !139, size: 64, offset: 384)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !43, line: 110, size: 640, elements: !141)
!141 = !{!142, !143, !144, !146, !147, !170, !176}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !140, file: !43, line: 111, baseType: !119, size: 128)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !140, file: !43, line: 112, baseType: !128, size: 64, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !140, file: !43, line: 114, baseType: !145, size: 64, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !140, file: !43, line: 114, baseType: !145, size: 64, offset: 256)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !140, file: !43, line: 118, baseType: !148, size: 64, offset: 320)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !43, line: 125, size: 576, elements: !150)
!150 = !{!151, !152, !153, !154, !166, !167, !168, !169}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !149, file: !43, line: 126, baseType: !119, size: 128)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !149, file: !43, line: 129, baseType: !145, size: 64, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !149, file: !43, line: 130, baseType: !139, size: 64, offset: 192)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !149, file: !43, line: 131, baseType: !155, size: 64, offset: 256)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !43, line: 164, size: 448, elements: !157)
!157 = !{!158, !159, !160, !163, !164, !165}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !156, file: !43, line: 165, baseType: !119, size: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !156, file: !43, line: 166, baseType: !128, size: 64, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !156, file: !43, line: 172, baseType: !161, size: 64, offset: 192)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !43, line: 140, baseType: !149)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !156, file: !43, line: 174, baseType: !95, size: 32, offset: 256)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !156, file: !43, line: 175, baseType: !133, size: 96, offset: 288)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !156, file: !43, line: 176, baseType: !79, size: 16, offset: 384)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !149, file: !43, line: 135, baseType: !148, size: 64, offset: 320)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !149, file: !43, line: 135, baseType: !148, size: 64, offset: 384)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !149, file: !43, line: 139, baseType: !148, size: 64, offset: 448)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !149, file: !43, line: 139, baseType: !148, size: 64, offset: 512)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !140, file: !43, line: 122, baseType: !171, size: 128, offset: 384)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !43, line: 108, baseType: !172)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !43, line: 106, size: 128, elements: !173)
!173 = !{!174, !175}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !172, file: !43, line: 107, baseType: !139, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !172, file: !43, line: 107, baseType: !139, size: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !140, file: !43, line: 122, baseType: !171, size: 128, offset: 512)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !92, file: !43, line: 209, baseType: !178, size: 64, offset: 576)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !43, line: 123, baseType: !140)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !92, file: !43, line: 210, baseType: !182, size: 64, offset: 640)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !43, line: 178, baseType: !156)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !92, file: !43, line: 213, baseType: !95, size: 32, offset: 704)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !92, file: !43, line: 214, baseType: !95, size: 32, offset: 736)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !92, file: !43, line: 215, baseType: !95, size: 32, offset: 768)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !92, file: !43, line: 218, baseType: !106, size: 64, offset: 832)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !92, file: !43, line: 218, baseType: !106, size: 64, offset: 896)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !92, file: !43, line: 218, baseType: !106, size: 64, offset: 960)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !92, file: !43, line: 220, baseType: !95, size: 32, offset: 1024)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !92, file: !43, line: 221, baseType: !193, size: 64, offset: 1088)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !4, line: 190, size: 10496, elements: !195)
!195 = !{!196, !232, !233, !237, !240, !241, !243}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !194, file: !4, line: 191, baseType: !197, size: 5120)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 5120, elements: !230)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !4, line: 147, size: 320, elements: !199)
!199 = !{!200, !203, !205, !215, !216}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !198, file: !4, line: 148, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !198, file: !4, line: 149, baseType: !204, size: 32, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !4, line: 112, baseType: !3)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !198, file: !4, line: 150, baseType: !206, size: 32, offset: 96)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !4, line: 142, baseType: !207)
!207 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !4, line: 138, size: 32, elements: !208)
!208 = !{!209, !211, !213}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !207, file: !4, line: 139, baseType: !210, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !4, line: 122, baseType: !15)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !207, file: !4, line: 140, baseType: !212, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !4, line: 136, baseType: !21)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !207, file: !4, line: 141, baseType: !214, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !4, line: 130, baseType: !27)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !198, file: !4, line: 152, baseType: !95, size: 32, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !198, file: !4, line: 162, baseType: !217, size: 128, offset: 192)
!217 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !198, file: !4, line: 155, size: 128, elements: !218)
!218 = !{!219, !220, !221, !222, !223, !225}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !217, file: !4, line: 156, baseType: !95, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !217, file: !4, line: 157, baseType: !134, size: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !217, file: !4, line: 158, baseType: !80, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !217, file: !4, line: 159, baseType: !133, size: 96)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !217, file: !4, line: 160, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !217, file: !4, line: 161, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !228, line: 48, baseType: !229)
!228 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !228, line: 48, flags: DIFlagFwdDecl)
!230 = !{!231}
!231 = !DISubrange(count: 16)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !194, file: !4, line: 192, baseType: !197, size: 5120, offset: 5120)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !194, file: !4, line: 193, baseType: !234, size: 64, offset: 10240)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{null, !90, !193}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !194, file: !4, line: 194, baseType: !238, size: 64, offset: 10304)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !4, line: 194, flags: DIFlagFwdDecl)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !194, file: !4, line: 195, baseType: !95, size: 32, offset: 10368)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !194, file: !4, line: 196, baseType: !242, size: 32, offset: 10400)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !4, line: 188, baseType: !35)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !194, file: !4, line: 197, baseType: !95, size: 32, offset: 10432)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !92, file: !43, line: 223, baseType: !245, size: 1600, offset: 1152)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !108, line: 73, baseType: !246)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !108, line: 64, size: 1600, elements: !247)
!247 = !{!248, !266, !270, !271, !272, !273, !274}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !246, file: !108, line: 65, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !108, line: 53, baseType: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !108, line: 42, size: 832, elements: !252)
!252 = !{!253, !254, !255, !256, !257, !258, !259, !260, !261, !265}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !251, file: !108, line: 43, baseType: !95, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !251, file: !108, line: 44, baseType: !95, size: 32, offset: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !251, file: !108, line: 45, baseType: !95, size: 32, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !251, file: !108, line: 46, baseType: !95, size: 32, offset: 96)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !251, file: !108, line: 47, baseType: !95, size: 32, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !251, file: !108, line: 48, baseType: !95, size: 32, offset: 160)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !251, file: !108, line: 49, baseType: !95, size: 32, offset: 192)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !251, file: !108, line: 50, baseType: !95, size: 32, offset: 224)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !251, file: !108, line: 51, baseType: !262, size: 512, offset: 256)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 512, elements: !263)
!263 = !{!264}
!264 = !DISubrange(count: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !251, file: !108, line: 52, baseType: !80, size: 64, offset: 768)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !246, file: !108, line: 66, baseType: !267, size: 1312, offset: 64)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 1312, elements: !268)
!268 = !{!269}
!269 = !DISubrange(count: 41)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !246, file: !108, line: 69, baseType: !95, size: 32, offset: 1376)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !246, file: !108, line: 69, baseType: !95, size: 32, offset: 1408)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !246, file: !108, line: 70, baseType: !95, size: 32, offset: 1440)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !246, file: !108, line: 71, baseType: !106, size: 64, offset: 1472)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !246, file: !108, line: 72, baseType: !275, size: 64, offset: 1536)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !108, line: 59, baseType: !277)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !108, line: 57, size: 8192, elements: !278)
!278 = !{!279}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !277, file: !108, line: 58, baseType: !280, size: 8192)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 8192, elements: !281)
!281 = !{!282}
!282 = !DISubrange(count: 1024)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !92, file: !43, line: 223, baseType: !245, size: 1600, offset: 2752)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !92, file: !43, line: 223, baseType: !245, size: 1600, offset: 4352)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !92, file: !43, line: 223, baseType: !245, size: 1600, offset: 5952)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !92, file: !43, line: 233, baseType: !79, size: 16, offset: 7552)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !92, file: !43, line: 236, baseType: !95, size: 32, offset: 7584)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !92, file: !43, line: 238, baseType: !95, size: 32, offset: 7616)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !92, file: !43, line: 238, baseType: !95, size: 32, offset: 7648)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !92, file: !43, line: 239, baseType: !291, size: 128, offset: 7680)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !83, line: 71, baseType: !292)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !83, line: 69, size: 128, elements: !293)
!293 = !{!294, !295}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !292, file: !83, line: 70, baseType: !80, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !292, file: !83, line: 70, baseType: !80, size: 64, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !92, file: !43, line: 241, baseType: !183, size: 64, offset: 7808)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !92, file: !43, line: 243, baseType: !291, size: 128, offset: 7872)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !92, file: !43, line: 245, baseType: !80, size: 64, offset: 8000)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !300, line: 46, baseType: !301)
!300 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!301 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!302 = !{i32 7, !"Dwarf Version", i32 4}
!303 = !{i32 2, !"Debug Info Version", i32 3}
!304 = !{i32 1, !"wchar_size", i32 4}
!305 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!306 = distinct !DISubprogram(name: "bmo_grid_fill_exec", scope: !1, file: !1, line: 584, type: !307, scopeLine: 585, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !311)
!307 = !DISubroutineType(types: !308)
!308 = !{null, !90, !309}
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOperator", file: !4, line: 198, baseType: !194)
!311 = !{}
!312 = !DILocalVariable(name: "bm", arg: 1, scope: !306, file: !1, line: 584, type: !90)
!313 = !DILocation(line: 584, column: 32, scope: !306)
!314 = !DILocalVariable(name: "op", arg: 2, scope: !306, file: !1, line: 584, type: !309)
!315 = !DILocation(line: 584, column: 48, scope: !306)
!316 = !DILocalVariable(name: "eloops", scope: !306, file: !1, line: 586, type: !291)
!317 = !DILocation(line: 586, column: 11, scope: !306)
!318 = !DILocalVariable(name: "eloops_rail", scope: !306, file: !1, line: 587, type: !291)
!319 = !DILocation(line: 587, column: 11, scope: !306)
!320 = !DILocalVariable(name: "estore_a", scope: !306, file: !1, line: 588, type: !321)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdgeLoopStore", file: !323, line: 32, flags: DIFlagFwdDecl)
!323 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_edgeloop.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!324 = !DILocation(line: 588, column: 26, scope: !306)
!325 = !DILocalVariable(name: "estore_b", scope: !306, file: !1, line: 588, type: !321)
!326 = !DILocation(line: 588, column: 37, scope: !306)
!327 = !DILocalVariable(name: "estore_rail_a", scope: !306, file: !1, line: 589, type: !321)
!328 = !DILocation(line: 589, column: 26, scope: !306)
!329 = !DILocalVariable(name: "estore_rail_b", scope: !306, file: !1, line: 589, type: !321)
!330 = !DILocation(line: 589, column: 42, scope: !306)
!331 = !DILocalVariable(name: "v_a_first", scope: !306, file: !1, line: 590, type: !114)
!332 = !DILocation(line: 590, column: 10, scope: !306)
!333 = !DILocalVariable(name: "v_a_last", scope: !306, file: !1, line: 590, type: !114)
!334 = !DILocation(line: 590, column: 22, scope: !306)
!335 = !DILocalVariable(name: "v_b_first", scope: !306, file: !1, line: 591, type: !114)
!336 = !DILocation(line: 591, column: 10, scope: !306)
!337 = !DILocalVariable(name: "v_b_last", scope: !306, file: !1, line: 591, type: !114)
!338 = !DILocation(line: 591, column: 22, scope: !306)
!339 = !DILocalVariable(name: "mat_nr", scope: !306, file: !1, line: 592, type: !340)
!340 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!341 = !DILocation(line: 592, column: 14, scope: !306)
!342 = !DILocation(line: 592, column: 47, scope: !306)
!343 = !DILocation(line: 592, column: 51, scope: !306)
!344 = !DILocation(line: 592, column: 30, scope: !306)
!345 = !DILocation(line: 592, column: 23, scope: !306)
!346 = !DILocalVariable(name: "use_smooth", scope: !306, file: !1, line: 593, type: !347)
!347 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !348)
!348 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
