; ModuleID = 'blender/source/blender/blenkernel/intern/action.c'
source_filename = "blender/source/blender/blenkernel/intern/action.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }

!142 = !DIEnumerator(name: "BONE_NO_DEFORM", value: 4096, isUnsigned: true)
!143 = !DIEnumerator(name: "BONE_UNKEYED", value: 8192, isUnsigned: true)
!144 = !DIEnumerator(name: "BONE_HINGE_CHILD_TRANSFORM", value: 16384, isUnsigned: true)
!145 = !DIEnumerator(name: "BONE_NO_SCALE", value: 32768, isUnsigned: true)
!146 = !DIEnumerator(name: "BONE_HIDDEN_PG", value: 65536, isUnsigned: true)
!147 = !DIEnumerator(name: "BONE_DRAWWIRE", value: 131072, isUnsigned: true)
!148 = !DIEnumerator(name: "BONE_NO_CYCLICOFFSET", value: 262144, isUnsigned: true)
!149 = !DIEnumerator(name: "BONE_EDITMODE_LOCKED", value: 524288, isUnsigned: true)
!150 = !DIEnumerator(name: "BONE_TRANSFORM_CHILD", value: 1048576, isUnsigned: true)
!151 = !DIEnumerator(name: "BONE_UNSELECTABLE", value: 2097152, isUnsigned: true)
!152 = !DIEnumerator(name: "BONE_NO_LOCAL_LOCATION", value: 4194304, isUnsigned: true)
!153 = !DIEnumerator(name: "BONE_RELATIVE_PARENTING", value: 8388608, isUnsigned: true)
!154 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eFMod_Limit_Flags", file: !155, line: 218, baseType: !18, size: 32, elements: !156)
!155 = !DIFile(filename: "blender/source/blender/makesdna/DNA_anim_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!156 = !{!157, !158, !159, !160}
!157 = !DIEnumerator(name: "FCM_LIMIT_XMIN", value: 1, isUnsigned: true)
!158 = !DIEnumerator(name: "FCM_LIMIT_XMAX", value: 2, isUnsigned: true)
!159 = !DIEnumerator(name: "FCM_LIMIT_YMIN", value: 4, isUnsigned: true)
!160 = !DIEnumerator(name: "FCM_LIMIT_YMAX", value: 8, isUnsigned: true)
!161 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eFMod_Cycling_Modes", file: !155, line: 195, baseType: !18, size: 32, elements: !162)
!162 = !{!163, !164, !165, !166}
!163 = !DIEnumerator(name: "FCM_EXTRAPOLATE_NONE", value: 0, isUnsigned: true)
!164 = !DIEnumerator(name: "FCM_EXTRAPOLATE_CYCLIC", value: 1, isUnsigned: true)
!165 = !DIEnumerator(name: "FCM_EXTRAPOLATE_CYCLIC_OFFSET", value: 2, isUnsigned: true)
!166 = !DIEnumerator(name: "FCM_EXTRAPOLATE_MIRROR", value: 3, isUnsigned: true)
!167 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eAction_TransformFlags", file: !168, line: 77, baseType: !18, size: 32, elements: !169)
!168 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_action.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!169 = !{!170, !171, !172, !173, !174, !175}
!170 = !DIEnumerator(name: "ACT_TRANS_LOC", value: 1, isUnsigned: true)
!171 = !DIEnumerator(name: "ACT_TRANS_ROT", value: 2, isUnsigned: true)
!172 = !DIEnumerator(name: "ACT_TRANS_SCALE", value: 4, isUnsigned: true)
!173 = !DIEnumerator(name: "ACT_TRANS_PROP", value: 8, isUnsigned: true)
!174 = !DIEnumerator(name: "ACT_TRANS_ONLY", value: 7, isUnsigned: true)
!175 = !DIEnumerator(name: "ACT_TRANS_ALL", value: 15, isUnsigned: true)
!176 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ePchan_Flag", file: !4, line: 247, baseType: !18, size: 32, elements: !177)
!177 = !{!178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193}
!178 = !DIEnumerator(name: "POSE_LOC", value: 1, isUnsigned: true)
!179 = !DIEnumerator(name: "POSE_ROT", value: 2, isUnsigned: true)
!180 = !DIEnumerator(name: "POSE_SIZE", value: 4, isUnsigned: true)
!181 = !DIEnumerator(name: "POSE_IK_MAT", value: 8, isUnsigned: true)
!182 = !DIEnumerator(name: "POSE_UNUSED2", value: 16, isUnsigned: true)
!183 = !DIEnumerator(name: "POSE_UNUSED3", value: 32, isUnsigned: true)
!184 = !DIEnumerator(name: "POSE_UNUSED4", value: 64, isUnsigned: true)
!185 = !DIEnumerator(name: "POSE_UNUSED5", value: 128, isUnsigned: true)
!186 = !DIEnumerator(name: "POSE_HAS_IK", value: 256, isUnsigned: true)
!187 = !DIEnumerator(name: "POSE_CHAIN", value: 512, isUnsigned: true)
!188 = !DIEnumerator(name: "POSE_DONE", value: 1024, isUnsigned: true)
!189 = !DIEnumerator(name: "POSE_KEY", value: 2048, isUnsigned: true)
!190 = !DIEnumerator(name: "POSE_STRIDE", value: 4096, isUnsigned: true)
!191 = !DIEnumerator(name: "POSE_IKTREE", value: 8192, isUnsigned: true)
!192 = !DIEnumerator(name: "POSE_HAS_IKS", value: 16384, isUnsigned: true)
!193 = !DIEnumerator(name: "POSE_IKSPLINE", value: 32768, isUnsigned: true)
!194 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eAnimData_Recalc", file: !155, line: 899, baseType: !18, size: 32, elements: !195)
!195 = !{!196, !197, !198}
!196 = !DIEnumerator(name: "ADT_RECALC_DRIVERS", value: 1, isUnsigned: true)
!197 = !DIEnumerator(name: "ADT_RECALC_ANIM", value: 2, isUnsigned: true)
!198 = !DIEnumerator(name: "ADT_RECALC_ALL", value: 3, isUnsigned: true)
!199 = !{!200, !201, !257, !1407, !1417, !1424, !280, !1432, !1440}
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "bPose", file: !4, line: 356, baseType: !203)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !4, line: 334, size: 1728, elements: !204)
!204 = !{!205, !212, !215, !217, !218, !219, !220, !222, !226, !227, !228, !229, !230, !231, !232, !252}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !203, file: !4, line: 335, baseType: !206, size: 128)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !207, line: 71, baseType: !208)
!207 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !207, line: 69, size: 128, elements: !209)
!209 = !{!210, !211}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !208, file: !207, line: 70, baseType: !200, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !208, file: !207, line: 70, baseType: !200, size: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !203, file: !4, line: 336, baseType: !213, size: 64, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !4, line: 47, flags: DIFlagFwdDecl)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !203, file: !4, line: 338, baseType: !216, size: 16, offset: 192)
!216 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !203, file: !4, line: 338, baseType: !216, size: 16, offset: 208)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !203, file: !4, line: 339, baseType: !18, size: 32, offset: 224)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !203, file: !4, line: 340, baseType: !5, size: 32, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !203, file: !4, line: 342, baseType: !221, size: 32, offset: 288)
!221 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !203, file: !4, line: 343, baseType: !223, size: 96, offset: 320)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 96, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 3)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !203, file: !4, line: 344, baseType: !223, size: 96, offset: 416)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !203, file: !4, line: 347, baseType: !206, size: 128, offset: 512)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !203, file: !4, line: 349, baseType: !5, size: 32, offset: 640)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !203, file: !4, line: 350, baseType: !5, size: 32, offset: 672)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !203, file: !4, line: 351, baseType: !200, size: 64, offset: 704)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !203, file: !4, line: 352, baseType: !200, size: 64, offset: 768)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !203, file: !4, line: 354, baseType: !233, size: 384, offset: 832)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !4, line: 116, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !4, line: 94, size: 384, elements: !235)
!235 = !{!236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !234, file: !4, line: 96, baseType: !5, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !234, file: !4, line: 96, baseType: !5, size: 32, offset: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !234, file: !4, line: 97, baseType: !5, size: 32, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !234, file: !4, line: 97, baseType: !5, size: 32, offset: 96)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !234, file: !4, line: 99, baseType: !216, size: 16, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !234, file: !4, line: 100, baseType: !216, size: 16, offset: 144)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !234, file: !4, line: 102, baseType: !216, size: 16, offset: 160)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !234, file: !4, line: 105, baseType: !216, size: 16, offset: 176)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !234, file: !4, line: 108, baseType: !216, size: 16, offset: 192)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !234, file: !4, line: 109, baseType: !216, size: 16, offset: 208)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !234, file: !4, line: 111, baseType: !216, size: 16, offset: 224)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !234, file: !4, line: 112, baseType: !216, size: 16, offset: 240)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !234, file: !4, line: 114, baseType: !5, size: 32, offset: 256)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !234, file: !4, line: 114, baseType: !5, size: 32, offset: 288)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !234, file: !4, line: 115, baseType: !5, size: 32, offset: 320)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !234, file: !4, line: 115, baseType: !5, size: 32, offset: 352)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !203, file: !4, line: 355, baseType: !253, size: 512, offset: 1216)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 512, elements: !255)
!254 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!255 = !{!256}
!256 = !DISubrange(count: 64)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "bKinematicConstraint", file: !58, line: 151, baseType: !259)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bKinematicConstraint", file: !58, line: 135, size: 1472, elements: !260)
!260 = !{!261, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "tar", scope: !259, file: !58, line: 136, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !17, line: 115, size: 11392, elements: !264)
!264 = !{!265, !324, !392, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !410, !420, !422, !423, !425, !426, !430, !431, !447, !448, !449, !450, !451, !452, !453, !458, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !474, !475, !476, !477, !478, !479, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !539, !540, !541, !542, !543, !544, !545, !546, !547, !550, !553, !556, !557, !558, !559, !560, !563, !566, !569, !570, !576, !577, !578, !579, !580, !581, !583, !586, !589, !593, !1381, !1382}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !263, file: !17, line: 116, baseType: !266, size: 960)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !267, line: 130, baseType: !268)
!267 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !267, line: 117, size: 960, elements: !269)
!269 = !{!270, !271, !272, !274, !293, !297, !298, !299, !300, !301}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !268, file: !267, line: 118, baseType: !200, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !268, file: !267, line: 118, baseType: !200, size: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !268, file: !267, line: 119, baseType: !273, size: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !268, file: !267, line: 120, baseType: !275, size: 64, offset: 192)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !267, line: 136, size: 17600, elements: !277)
!277 = !{!278, !279, !281, !284, !288, !289, !290}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !276, file: !267, line: 137, baseType: !266, size: 960)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !276, file: !267, line: 138, baseType: !280, size: 64, offset: 960)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !276, file: !267, line: 139, baseType: !282, size: 64, offset: 1024)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !267, line: 43, flags: DIFlagFwdDecl)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !276, file: !267, line: 140, baseType: !285, size: 8192, offset: 1088)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 8192, elements: !286)
!286 = !{!287}
!287 = !DISubrange(count: 1024)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !276, file: !267, line: 141, baseType: !285, size: 8192, offset: 9280)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !276, file: !267, line: 148, baseType: !275, size: 64, offset: 17472)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !276, file: !267, line: 150, baseType: !291, size: 64, offset: 17536)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !267, line: 45, flags: DIFlagFwdDecl)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !268, file: !267, line: 121, baseType: !294, size: 528, offset: 256)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 528, elements: !295)
!295 = !{!296}
!296 = !DISubrange(count: 66)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !268, file: !267, line: 126, baseType: !216, size: 16, offset: 784)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !268, file: !267, line: 127, baseType: !5, size: 32, offset: 800)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !268, file: !267, line: 128, baseType: !5, size: 32, offset: 832)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !268, file: !267, line: 128, baseType: !5, size: 32, offset: 864)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !268, file: !267, line: 129, baseType: !302, size: 64, offset: 896)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !267, line: 75, baseType: !304)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !267, line: 62, size: 1024, elements: !305)
!305 = !{!306, !308, !309, !310, !311, !312, !313, !314, !322, !323}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !304, file: !267, line: 63, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !304, file: !267, line: 63, baseType: !307, size: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !304, file: !267, line: 64, baseType: !254, size: 8, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !304, file: !267, line: 64, baseType: !254, size: 8, offset: 136)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !304, file: !267, line: 65, baseType: !216, size: 16, offset: 144)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !304, file: !267, line: 66, baseType: !253, size: 512, offset: 160)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !304, file: !267, line: 67, baseType: !5, size: 32, offset: 672)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !304, file: !267, line: 69, baseType: !315, size: 256, offset: 704)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !267, line: 60, baseType: !316)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !267, line: 48, size: 256, elements: !317)
!317 = !{!318, !319, !320, !321}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !316, file: !267, line: 49, baseType: !200, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !316, file: !267, line: 58, baseType: !206, size: 128, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !316, file: !267, line: 59, baseType: !5, size: 32, offset: 192)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !316, file: !267, line: 59, baseType: !5, size: 32, offset: 224)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !304, file: !267, line: 70, baseType: !5, size: 32, offset: 960)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !304, file: !267, line: 74, baseType: !5, size: 32, offset: 992)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !263, file: !17, line: 117, baseType: !325, size: 64, offset: 960)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !155, line: 838, size: 768, elements: !327)
!327 = !{!328, !342, !343, !353, !354, !385, !386, !387, !388, !389, !390, !391}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !326, file: !155, line: 840, baseType: !329, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !4, line: 499, baseType: !331)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !4, line: 486, size: 1600, elements: !332)
!332 = !{!333, !334, !335, !336, !337, !338, !339, !340, !341}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !331, file: !4, line: 487, baseType: !266, size: 960)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !331, file: !4, line: 489, baseType: !206, size: 128, offset: 960)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !331, file: !4, line: 490, baseType: !206, size: 128, offset: 1088)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !331, file: !4, line: 491, baseType: !206, size: 128, offset: 1216)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !331, file: !4, line: 492, baseType: !206, size: 128, offset: 1344)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !331, file: !4, line: 494, baseType: !5, size: 32, offset: 1472)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !331, file: !4, line: 495, baseType: !5, size: 32, offset: 1504)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !331, file: !4, line: 497, baseType: !5, size: 32, offset: 1536)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !331, file: !4, line: 498, baseType: !5, size: 32, offset: 1568)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !326, file: !155, line: 844, baseType: !329, size: 64, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !326, file: !155, line: 848, baseType: !344, size: 64, offset: 128)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !155, line: 549, baseType: !346)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !155, line: 544, size: 320, elements: !347)
!347 = !{!348, !350, !351, !352}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !346, file: !155, line: 545, baseType: !349, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !346, file: !155, line: 545, baseType: !349, size: 64, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !346, file: !155, line: 547, baseType: !329, size: 64, offset: 128)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !346, file: !155, line: 548, baseType: !206, size: 128, offset: 192)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !326, file: !155, line: 851, baseType: !206, size: 128, offset: 192)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !326, file: !155, line: 853, baseType: !355, size: 64, offset: 320)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !155, line: 594, baseType: !357)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !155, line: 561, size: 1664, elements: !358)
!358 = !{!359, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !357, file: !155, line: 562, baseType: !360, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !357, file: !155, line: 562, baseType: !360, size: 64, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !357, file: !155, line: 564, baseType: !206, size: 128, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !357, file: !155, line: 565, baseType: !329, size: 64, offset: 256)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !357, file: !155, line: 566, baseType: !344, size: 64, offset: 320)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !357, file: !155, line: 568, baseType: !206, size: 128, offset: 384)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !357, file: !155, line: 569, baseType: !206, size: 128, offset: 512)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !357, file: !155, line: 571, baseType: !253, size: 512, offset: 640)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !357, file: !155, line: 573, baseType: !221, size: 32, offset: 1152)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "strip_time", scope: !357, file: !155, line: 574, baseType: !221, size: 32, offset: 1184)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !357, file: !155, line: 576, baseType: !221, size: 32, offset: 1216)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !357, file: !155, line: 576, baseType: !221, size: 32, offset: 1248)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "actstart", scope: !357, file: !155, line: 577, baseType: !221, size: 32, offset: 1280)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "actend", scope: !357, file: !155, line: 577, baseType: !221, size: 32, offset: 1312)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !357, file: !155, line: 579, baseType: !221, size: 32, offset: 1344)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !357, file: !155, line: 580, baseType: !221, size: 32, offset: 1376)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !357, file: !155, line: 582, baseType: !221, size: 32, offset: 1408)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !357, file: !155, line: 582, baseType: !221, size: 32, offset: 1440)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "blendmode", scope: !357, file: !155, line: 583, baseType: !216, size: 16, offset: 1472)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "extendmode", scope: !357, file: !155, line: 585, baseType: !216, size: 16, offset: 1488)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !357, file: !155, line: 586, baseType: !216, size: 16, offset: 1504)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !357, file: !155, line: 588, baseType: !216, size: 16, offset: 1520)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handle", scope: !357, file: !155, line: 590, baseType: !200, size: 64, offset: 1536)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !357, file: !155, line: 592, baseType: !5, size: 32, offset: 1600)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !357, file: !155, line: 593, baseType: !5, size: 32, offset: 1632)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "drivers", scope: !326, file: !155, line: 858, baseType: !206, size: 128, offset: 384)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "overrides", scope: !326, file: !155, line: 859, baseType: !206, size: 128, offset: 512)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !326, file: !155, line: 862, baseType: !5, size: 32, offset: 640)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !326, file: !155, line: 863, baseType: !5, size: 32, offset: 672)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "act_blendmode", scope: !326, file: !155, line: 866, baseType: !216, size: 16, offset: 704)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "act_extendmode", scope: !326, file: !155, line: 867, baseType: !216, size: 16, offset: 720)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "act_influence", scope: !326, file: !155, line: 868, baseType: !221, size: 32, offset: 736)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !263, file: !17, line: 119, baseType: !393, size: 64, offset: 1024)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !17, line: 57, flags: DIFlagFwdDecl)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !263, file: !17, line: 121, baseType: !216, size: 16, offset: 1088)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !263, file: !17, line: 121, baseType: !216, size: 16, offset: 1104)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !263, file: !17, line: 122, baseType: !5, size: 32, offset: 1120)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !263, file: !17, line: 122, baseType: !5, size: 32, offset: 1152)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !263, file: !17, line: 122, baseType: !5, size: 32, offset: 1184)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !263, file: !17, line: 123, baseType: !253, size: 512, offset: 1216)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !263, file: !17, line: 124, baseType: !262, size: 64, offset: 1728)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !263, file: !17, line: 124, baseType: !262, size: 64, offset: 1792)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !263, file: !17, line: 127, baseType: !262, size: 64, offset: 1856)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !263, file: !17, line: 127, baseType: !262, size: 64, offset: 1920)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !263, file: !17, line: 127, baseType: !262, size: 64, offset: 1984)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !263, file: !17, line: 128, baseType: !407, size: 64, offset: 2048)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !409, line: 46, flags: DIFlagFwdDecl)
!409 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!410 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !263, file: !17, line: 130, baseType: !411, size: 64, offset: 2112)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !17, line: 97, size: 832, elements: !413)
!413 = !{!414, !418, !419}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !412, file: !17, line: 98, baseType: !415, size: 768)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 768, elements: !416)
!416 = !{!417, !225}
!417 = !DISubrange(count: 8)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !412, file: !17, line: 99, baseType: !5, size: 32, offset: 768)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !412, file: !17, line: 99, baseType: !5, size: 32, offset: 800)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !263, file: !17, line: 131, baseType: !421, size: 64, offset: 2176)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !263, file: !17, line: 132, baseType: !421, size: 64, offset: 2240)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !263, file: !17, line: 133, baseType: !424, size: 64, offset: 2304)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !263, file: !17, line: 134, baseType: !200, size: 64, offset: 2368)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !263, file: !17, line: 136, baseType: !427, size: 64, offset: 2432)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !429, line: 61, flags: DIFlagFwdDecl)
!429 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!430 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !263, file: !17, line: 138, baseType: !233, size: 384, offset: 2496)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !263, file: !17, line: 139, baseType: !432, size: 64, offset: 2880)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !4, line: 80, baseType: !434)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !4, line: 72, size: 192, elements: !435)
!435 = !{!436, !443, !444, !445, !446}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !434, file: !4, line: 73, baseType: !437, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !4, line: 59, baseType: !439)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !4, line: 56, size: 128, elements: !440)
!440 = !{!441, !442}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !439, file: !4, line: 57, baseType: !223, size: 96)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !439, file: !4, line: 58, baseType: !5, size: 32, offset: 96)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !434, file: !4, line: 74, baseType: !5, size: 32, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !434, file: !4, line: 76, baseType: !5, size: 32, offset: 96)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !434, file: !4, line: 77, baseType: !5, size: 32, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !434, file: !4, line: 79, baseType: !5, size: 32, offset: 160)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !263, file: !17, line: 141, baseType: !206, size: 128, offset: 2944)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !263, file: !17, line: 142, baseType: !206, size: 128, offset: 3072)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !263, file: !17, line: 143, baseType: !206, size: 128, offset: 3200)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !263, file: !17, line: 144, baseType: !206, size: 128, offset: 3328)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !263, file: !17, line: 146, baseType: !5, size: 32, offset: 3456)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !263, file: !17, line: 147, baseType: !5, size: 32, offset: 3488)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !263, file: !17, line: 150, baseType: !454, size: 64, offset: 3520)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !457, line: 46, flags: DIFlagFwdDecl)
!457 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!458 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !263, file: !17, line: 151, baseType: !459, size: 64, offset: 3584)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !263, file: !17, line: 152, baseType: !5, size: 32, offset: 3648)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !263, file: !17, line: 153, baseType: !5, size: 32, offset: 3680)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !263, file: !17, line: 156, baseType: !223, size: 96, offset: 3712)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !263, file: !17, line: 156, baseType: !223, size: 96, offset: 3808)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !263, file: !17, line: 156, baseType: !223, size: 96, offset: 3904)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !263, file: !17, line: 157, baseType: !223, size: 96, offset: 4000)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !263, file: !17, line: 158, baseType: !223, size: 96, offset: 4096)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !263, file: !17, line: 159, baseType: !223, size: 96, offset: 4192)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !263, file: !17, line: 160, baseType: !223, size: 96, offset: 4288)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !263, file: !17, line: 160, baseType: !223, size: 96, offset: 4384)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !263, file: !17, line: 161, baseType: !471, size: 128, offset: 4480)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 128, elements: !472)
!472 = !{!473}
!473 = !DISubrange(count: 4)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !263, file: !17, line: 161, baseType: !471, size: 128, offset: 4608)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !263, file: !17, line: 162, baseType: !223, size: 96, offset: 4736)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !263, file: !17, line: 162, baseType: !223, size: 96, offset: 4832)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !263, file: !17, line: 163, baseType: !221, size: 32, offset: 4928)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !263, file: !17, line: 163, baseType: !221, size: 32, offset: 4960)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !263, file: !17, line: 164, baseType: !480, size: 512, offset: 4992)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 512, elements: !481)
!481 = !{!473, !473}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !263, file: !17, line: 165, baseType: !480, size: 512, offset: 5504)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !263, file: !17, line: 166, baseType: !480, size: 512, offset: 6016)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !263, file: !17, line: 167, baseType: !480, size: 512, offset: 6528)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !263, file: !17, line: 176, baseType: !480, size: 512, offset: 7040)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !263, file: !17, line: 178, baseType: !18, size: 32, offset: 7552)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !263, file: !17, line: 180, baseType: !216, size: 16, offset: 7584)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !263, file: !17, line: 181, baseType: !216, size: 16, offset: 7600)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !263, file: !17, line: 183, baseType: !216, size: 16, offset: 7616)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !263, file: !17, line: 183, baseType: !216, size: 16, offset: 7632)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !263, file: !17, line: 184, baseType: !216, size: 16, offset: 7648)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !263, file: !17, line: 184, baseType: !216, size: 16, offset: 7664)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !263, file: !17, line: 185, baseType: !216, size: 16, offset: 7680)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !263, file: !17, line: 186, baseType: !216, size: 16, offset: 7696)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !263, file: !17, line: 187, baseType: !216, size: 16, offset: 7712)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !263, file: !17, line: 188, baseType: !254, size: 8, offset: 7728)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !263, file: !17, line: 189, baseType: !254, size: 8, offset: 7736)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !263, file: !17, line: 192, baseType: !5, size: 32, offset: 7744)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !263, file: !17, line: 192, baseType: !5, size: 32, offset: 7776)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !263, file: !17, line: 192, baseType: !5, size: 32, offset: 7808)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !263, file: !17, line: 192, baseType: !5, size: 32, offset: 7840)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !263, file: !17, line: 194, baseType: !5, size: 32, offset: 7872)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !263, file: !17, line: 202, baseType: !221, size: 32, offset: 7904)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !263, file: !17, line: 202, baseType: !221, size: 32, offset: 7936)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !263, file: !17, line: 202, baseType: !221, size: 32, offset: 7968)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !263, file: !17, line: 211, baseType: !221, size: 32, offset: 8000)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !263, file: !17, line: 212, baseType: !221, size: 32, offset: 8032)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !263, file: !17, line: 213, baseType: !221, size: 32, offset: 8064)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !263, file: !17, line: 214, baseType: !221, size: 32, offset: 8096)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !263, file: !17, line: 215, baseType: !221, size: 32, offset: 8128)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !263, file: !17, line: 216, baseType: !221, size: 32, offset: 8160)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !263, file: !17, line: 219, baseType: !221, size: 32, offset: 8192)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !263, file: !17, line: 220, baseType: !221, size: 32, offset: 8224)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !263, file: !17, line: 221, baseType: !221, size: 32, offset: 8256)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !263, file: !17, line: 224, baseType: !516, size: 16, offset: 8288)
!516 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !263, file: !17, line: 224, baseType: !516, size: 16, offset: 8304)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !263, file: !17, line: 226, baseType: !216, size: 16, offset: 8320)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !263, file: !17, line: 228, baseType: !254, size: 8, offset: 8336)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !263, file: !17, line: 229, baseType: !254, size: 8, offset: 8344)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !263, file: !17, line: 231, baseType: !216, size: 16, offset: 8352)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !263, file: !17, line: 232, baseType: !254, size: 8, offset: 8368)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !263, file: !17, line: 233, baseType: !254, size: 8, offset: 8376)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !263, file: !17, line: 234, baseType: !221, size: 32, offset: 8384)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !263, file: !17, line: 235, baseType: !221, size: 32, offset: 8416)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !263, file: !17, line: 237, baseType: !206, size: 128, offset: 8448)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !263, file: !17, line: 238, baseType: !206, size: 128, offset: 8576)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !263, file: !17, line: 239, baseType: !206, size: 128, offset: 8704)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !263, file: !17, line: 240, baseType: !206, size: 128, offset: 8832)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !263, file: !17, line: 242, baseType: !221, size: 32, offset: 8960)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !263, file: !17, line: 244, baseType: !216, size: 16, offset: 8992)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !263, file: !17, line: 245, baseType: !516, size: 16, offset: 9008)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !263, file: !17, line: 246, baseType: !471, size: 128, offset: 9024)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !263, file: !17, line: 248, baseType: !5, size: 32, offset: 9152)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !263, file: !17, line: 249, baseType: !5, size: 32, offset: 9184)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !263, file: !17, line: 251, baseType: !537, size: 64, offset: 9216)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !17, line: 251, flags: DIFlagFwdDecl)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !263, file: !17, line: 253, baseType: !254, size: 8, offset: 9280)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !263, file: !17, line: 254, baseType: !254, size: 8, offset: 9288)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !263, file: !17, line: 255, baseType: !216, size: 16, offset: 9296)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !263, file: !17, line: 256, baseType: !223, size: 96, offset: 9312)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !263, file: !17, line: 258, baseType: !206, size: 128, offset: 9408)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !263, file: !17, line: 259, baseType: !206, size: 128, offset: 9536)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !263, file: !17, line: 260, baseType: !206, size: 128, offset: 9664)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !263, file: !17, line: 261, baseType: !206, size: 128, offset: 9792)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !263, file: !17, line: 263, baseType: !548, size: 64, offset: 9920)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !17, line: 52, flags: DIFlagFwdDecl)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !263, file: !17, line: 264, baseType: !551, size: 64, offset: 9984)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !17, line: 53, flags: DIFlagFwdDecl)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !263, file: !17, line: 265, baseType: !554, size: 64, offset: 10048)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !4, line: 46, flags: DIFlagFwdDecl)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !263, file: !17, line: 267, baseType: !254, size: 8, offset: 10112)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !263, file: !17, line: 268, baseType: !254, size: 8, offset: 10120)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !263, file: !17, line: 269, baseType: !216, size: 16, offset: 10128)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !263, file: !17, line: 270, baseType: !221, size: 32, offset: 10144)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !263, file: !17, line: 272, baseType: !561, size: 64, offset: 10176)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !17, line: 54, flags: DIFlagFwdDecl)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !263, file: !17, line: 275, baseType: !564, size: 64, offset: 10240)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !17, line: 275, flags: DIFlagFwdDecl)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !263, file: !17, line: 277, baseType: !567, size: 64, offset: 10304)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !17, line: 56, flags: DIFlagFwdDecl)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !263, file: !17, line: 277, baseType: !567, size: 64, offset: 10368)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !263, file: !17, line: 278, baseType: !571, size: 64, offset: 10432)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !572, line: 27, baseType: !573)
!572 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !574, line: 45, baseType: !575)
!574 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!575 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !263, file: !17, line: 279, baseType: !571, size: 64, offset: 10496)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !263, file: !17, line: 280, baseType: !18, size: 32, offset: 10560)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !263, file: !17, line: 281, baseType: !18, size: 32, offset: 10592)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !263, file: !17, line: 283, baseType: !206, size: 128, offset: 10624)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !263, file: !17, line: 284, baseType: !206, size: 128, offset: 10752)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !263, file: !17, line: 285, baseType: !582, size: 64, offset: 10880)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !263, file: !17, line: 287, baseType: !584, size: 64, offset: 10944)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !17, line: 59, flags: DIFlagFwdDecl)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !263, file: !17, line: 288, baseType: !587, size: 64, offset: 11008)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !17, line: 288, flags: DIFlagFwdDecl)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !263, file: !17, line: 290, baseType: !590, size: 64, offset: 11072)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 64, elements: !591)
!591 = !{!592}
!592 = !DISubrange(count: 2)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !263, file: !17, line: 291, baseType: !594, size: 64, offset: 11136)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !596, line: 65, baseType: !597)
!596 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !596, line: 50, size: 320, elements: !598)
!598 = !{!599, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !597, file: !596, line: 51, baseType: !600, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !429, line: 1216, size: 39680, elements: !602)
!602 = !{!603, !604, !605, !606, !609, !610, !611, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !637, !640, !643, !939, !942, !1241, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1263, !1264, !1265, !1266, !1267, !1275, !1342, !1349, !1350, !1357, !1360, !1361, !1362, !1363, !1364, !1365}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !601, file: !429, line: 1217, baseType: !266, size: 960)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !601, file: !429, line: 1218, baseType: !325, size: 64, offset: 960)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !601, file: !429, line: 1220, baseType: !262, size: 64, offset: 1024)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !601, file: !429, line: 1221, baseType: !607, size: 64, offset: 1088)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !429, line: 52, flags: DIFlagFwdDecl)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !601, file: !429, line: 1223, baseType: !600, size: 64, offset: 1152)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !601, file: !429, line: 1225, baseType: !206, size: 128, offset: 1216)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !601, file: !429, line: 1226, baseType: !612, size: 64, offset: 1344)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !429, line: 69, size: 320, elements: !614)
!614 = !{!615, !616, !617, !618, !619, !620, !621, !622}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !613, file: !429, line: 70, baseType: !612, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !613, file: !429, line: 70, baseType: !612, size: 64, offset: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !613, file: !429, line: 71, baseType: !18, size: 32, offset: 128)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !613, file: !429, line: 71, baseType: !18, size: 32, offset: 160)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !613, file: !429, line: 72, baseType: !5, size: 32, offset: 192)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !613, file: !429, line: 73, baseType: !216, size: 16, offset: 224)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !613, file: !429, line: 73, baseType: !216, size: 16, offset: 240)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !613, file: !429, line: 74, baseType: !262, size: 64, offset: 256)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !601, file: !429, line: 1227, baseType: !262, size: 64, offset: 1408)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !601, file: !429, line: 1229, baseType: !223, size: 96, offset: 1472)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !601, file: !429, line: 1230, baseType: !223, size: 96, offset: 1568)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !601, file: !429, line: 1231, baseType: !223, size: 96, offset: 1664)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !601, file: !429, line: 1231, baseType: !223, size: 96, offset: 1760)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !601, file: !429, line: 1233, baseType: !18, size: 32, offset: 1856)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !601, file: !429, line: 1234, baseType: !5, size: 32, offset: 1888)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !601, file: !429, line: 1235, baseType: !18, size: 32, offset: 1920)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !601, file: !429, line: 1237, baseType: !216, size: 16, offset: 1952)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !601, file: !429, line: 1239, baseType: !254, size: 8, offset: 1968)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !601, file: !429, line: 1240, baseType: !634, size: 8, offset: 1976)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 8, elements: !635)
!635 = !{!636}
!636 = !DISubrange(count: 1)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !601, file: !429, line: 1242, baseType: !638, size: 64, offset: 1984)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !409, line: 248, flags: DIFlagFwdDecl)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !601, file: !429, line: 1244, baseType: !641, size: 64, offset: 2048)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !429, line: 59, flags: DIFlagFwdDecl)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !601, file: !429, line: 1246, baseType: !644, size: 64, offset: 2112)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !429, line: 1067, size: 5184, elements: !646)
!646 = !{!647, !678, !679, !694, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !716, !811, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !860, !861, !862, !863, !864, !865, !866, !867, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !922}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !645, file: !429, line: 1068, baseType: !648, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !429, line: 934, baseType: !650)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !429, line: 925, size: 576, elements: !651)
!651 = !{!652, !669, !670, !671, !672, !674, !677}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !650, file: !429, line: 926, baseType: !653, size: 320)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !429, line: 830, baseType: !654)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !429, line: 813, size: 320, elements: !655)
!655 = !{!656, !659, !662, !663, !666, !667, !668}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !654, file: !429, line: 814, baseType: !657, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !429, line: 51, flags: DIFlagFwdDecl)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !654, file: !429, line: 815, baseType: !660, size: 64, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !429, line: 815, flags: DIFlagFwdDecl)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !654, file: !429, line: 818, baseType: !200, size: 64, offset: 128)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !654, file: !429, line: 819, baseType: !664, size: 32, offset: 192)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !665, size: 32, elements: !472)
!665 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !654, file: !429, line: 822, baseType: !5, size: 32, offset: 224)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !654, file: !429, line: 826, baseType: !5, size: 32, offset: 256)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !654, file: !429, line: 829, baseType: !5, size: 32, offset: 288)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !650, file: !429, line: 928, baseType: !216, size: 16, offset: 320)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !650, file: !429, line: 928, baseType: !216, size: 16, offset: 336)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !650, file: !429, line: 929, baseType: !5, size: 32, offset: 352)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !650, file: !429, line: 930, baseType: !673, size: 64, offset: 384)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !650, file: !429, line: 931, baseType: !675, size: 64, offset: 448)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !429, line: 931, flags: DIFlagFwdDecl)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !650, file: !429, line: 933, baseType: !200, size: 64, offset: 512)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !645, file: !429, line: 1069, baseType: !648, size: 64, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !645, file: !429, line: 1070, baseType: !680, size: 64, offset: 128)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !429, line: 916, baseType: !682)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !429, line: 891, size: 704, elements: !683)
!683 = !{!684, !685, !686, !688, !689, !690, !691, !692, !693}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !682, file: !429, line: 892, baseType: !653, size: 320)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !682, file: !429, line: 896, baseType: !5, size: 32, offset: 320)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !682, file: !429, line: 900, baseType: !687, size: 96, offset: 352)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 96, elements: !224)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !682, file: !429, line: 903, baseType: !221, size: 32, offset: 448)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !682, file: !429, line: 906, baseType: !5, size: 32, offset: 480)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !682, file: !429, line: 909, baseType: !221, size: 32, offset: 512)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !682, file: !429, line: 912, baseType: !221, size: 32, offset: 544)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !682, file: !429, line: 914, baseType: !262, size: 64, offset: 576)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !682, file: !429, line: 915, baseType: !200, size: 64, offset: 640)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !645, file: !429, line: 1071, baseType: !695, size: 64, offset: 192)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !429, line: 920, baseType: !697)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !429, line: 918, size: 320, elements: !698)
!698 = !{!699}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !697, file: !429, line: 919, baseType: !653, size: 320)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !645, file: !429, line: 1075, baseType: !221, size: 32, offset: 256)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !645, file: !429, line: 1077, baseType: !221, size: 32, offset: 288)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !645, file: !429, line: 1078, baseType: !221, size: 32, offset: 320)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !645, file: !429, line: 1079, baseType: !216, size: 16, offset: 352)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !645, file: !429, line: 1082, baseType: !216, size: 16, offset: 368)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !645, file: !429, line: 1085, baseType: !254, size: 8, offset: 384)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !645, file: !429, line: 1086, baseType: !254, size: 8, offset: 392)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !645, file: !429, line: 1087, baseType: !254, size: 8, offset: 400)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !645, file: !429, line: 1088, baseType: !254, size: 8, offset: 408)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !645, file: !429, line: 1090, baseType: !221, size: 32, offset: 416)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !645, file: !429, line: 1093, baseType: !216, size: 16, offset: 448)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !645, file: !429, line: 1096, baseType: !254, size: 8, offset: 464)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !645, file: !429, line: 1098, baseType: !713, size: 40, offset: 472)
!713 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 40, elements: !714)
!714 = !{!715}
!715 = !DISubrange(count: 5)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !645, file: !429, line: 1101, baseType: !717, size: 832, offset: 512)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !429, line: 836, size: 832, elements: !718)
!718 = !{!719, !720, !721, !722, !723, !724, !726, !727, !728, !807, !808, !809, !810}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !717, file: !429, line: 837, baseType: !653, size: 320)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !717, file: !429, line: 839, baseType: !216, size: 16, offset: 320)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !717, file: !429, line: 839, baseType: !216, size: 16, offset: 336)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !717, file: !429, line: 842, baseType: !216, size: 16, offset: 352)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !717, file: !429, line: 842, baseType: !216, size: 16, offset: 368)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !717, file: !429, line: 843, baseType: !725, size: 32, offset: 384)
!725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !216, size: 32, elements: !591)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !717, file: !429, line: 845, baseType: !5, size: 32, offset: 416)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !717, file: !429, line: 847, baseType: !200, size: 64, offset: 448)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !717, file: !429, line: 848, baseType: !729, size: 64, offset: 512)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !596, line: 77, size: 15424, elements: !731)
!731 = !{!732, !733, !734, !737, !740, !743, !746, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !796, !797, !801}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !730, file: !596, line: 78, baseType: !266, size: 960)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !730, file: !596, line: 80, baseType: !285, size: 8192, offset: 960)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !730, file: !596, line: 82, baseType: !735, size: 64, offset: 9152)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !596, line: 43, flags: DIFlagFwdDecl)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !730, file: !596, line: 83, baseType: !738, size: 64, offset: 9216)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !267, line: 46, flags: DIFlagFwdDecl)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !730, file: !596, line: 86, baseType: !741, size: 64, offset: 9280)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !596, line: 41, flags: DIFlagFwdDecl)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !730, file: !596, line: 87, baseType: !744, size: 64, offset: 9344)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !596, line: 44, flags: DIFlagFwdDecl)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !730, file: !596, line: 89, baseType: !747, size: 512, offset: 9408)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !744, size: 512, elements: !748)
!748 = !{!417}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !730, file: !596, line: 90, baseType: !216, size: 16, offset: 9920)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !730, file: !596, line: 90, baseType: !216, size: 16, offset: 9936)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !730, file: !596, line: 92, baseType: !216, size: 16, offset: 9952)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !730, file: !596, line: 92, baseType: !216, size: 16, offset: 9968)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !730, file: !596, line: 93, baseType: !216, size: 16, offset: 9984)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !730, file: !596, line: 93, baseType: !216, size: 16, offset: 10000)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !730, file: !596, line: 94, baseType: !5, size: 32, offset: 10016)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !730, file: !596, line: 97, baseType: !216, size: 16, offset: 10048)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !730, file: !596, line: 97, baseType: !216, size: 16, offset: 10064)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !730, file: !596, line: 98, baseType: !216, size: 16, offset: 10080)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !730, file: !596, line: 98, baseType: !216, size: 16, offset: 10096)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !730, file: !596, line: 99, baseType: !216, size: 16, offset: 10112)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !730, file: !596, line: 99, baseType: !216, size: 16, offset: 10128)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !730, file: !596, line: 100, baseType: !18, size: 32, offset: 10144)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !730, file: !596, line: 101, baseType: !673, size: 64, offset: 10176)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !730, file: !596, line: 103, baseType: !291, size: 64, offset: 10240)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !730, file: !596, line: 104, baseType: !766, size: 64, offset: 10304)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !267, line: 159, size: 448, elements: !768)
!768 = !{!769, !771, !772, !773, !774, !776}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !767, file: !267, line: 161, baseType: !770, size: 64)
!770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 64, elements: !591)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !767, file: !267, line: 162, baseType: !770, size: 64, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !767, file: !267, line: 163, baseType: !725, size: 32, offset: 128)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !767, file: !267, line: 164, baseType: !725, size: 32, offset: 160)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !767, file: !267, line: 165, baseType: !775, size: 128, offset: 192)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !673, size: 128, elements: !591)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !767, file: !267, line: 166, baseType: !777, size: 128, offset: 320)
!777 = !DICompositeType(tag: DW_TAG_array_type, baseType: !738, size: 128, elements: !591)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !730, file: !596, line: 107, baseType: !221, size: 32, offset: 10368)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !730, file: !596, line: 108, baseType: !5, size: 32, offset: 10400)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !730, file: !596, line: 109, baseType: !216, size: 16, offset: 10432)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !730, file: !596, line: 110, baseType: !216, size: 16, offset: 10448)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !730, file: !596, line: 113, baseType: !5, size: 32, offset: 10464)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !730, file: !596, line: 113, baseType: !5, size: 32, offset: 10496)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !730, file: !596, line: 114, baseType: !254, size: 8, offset: 10528)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !730, file: !596, line: 114, baseType: !254, size: 8, offset: 10536)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !730, file: !596, line: 115, baseType: !216, size: 16, offset: 10544)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !730, file: !596, line: 116, baseType: !471, size: 128, offset: 10560)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !730, file: !596, line: 119, baseType: !221, size: 32, offset: 10688)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !730, file: !596, line: 119, baseType: !221, size: 32, offset: 10720)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !730, file: !596, line: 122, baseType: !791, size: 512, offset: 10752)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !792, line: 182, baseType: !793)
!792 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !792, line: 180, size: 512, elements: !794)
!794 = !{!795}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !793, file: !792, line: 181, baseType: !253, size: 512)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !730, file: !596, line: 123, baseType: !254, size: 8, offset: 11264)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !730, file: !596, line: 125, baseType: !798, size: 56, offset: 11272)
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 56, elements: !799)
!799 = !{!800}
!800 = !DISubrange(count: 7)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !730, file: !596, line: 126, baseType: !802, size: 4096, offset: 11328)
!802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !803, size: 4096, elements: !748)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !596, line: 69, baseType: !804)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !596, line: 67, size: 512, elements: !805)
!805 = !{!806}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !804, file: !596, line: 68, baseType: !253, size: 512)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !717, file: !429, line: 849, baseType: !729, size: 64, offset: 576)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "canvas", scope: !717, file: !429, line: 850, baseType: !729, size: 64, offset: 640)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "stencil_col", scope: !717, file: !429, line: 851, baseType: !223, size: 96, offset: 704)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !717, file: !429, line: 852, baseType: !221, size: 32, offset: 800)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !645, file: !429, line: 1104, baseType: !812, size: 1344, offset: 1344)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleEditSettings", file: !429, line: 867, size: 1344, elements: !813)
!813 = !{!814, !815, !816, !817, !818, !829, !830, !831, !832, !833, !834, !835, !836, !837}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !812, file: !429, line: 868, baseType: !216, size: 16)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "totrekey", scope: !812, file: !429, line: 869, baseType: !216, size: 16, offset: 16)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "totaddkey", scope: !812, file: !429, line: 870, baseType: !216, size: 16, offset: 32)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "brushtype", scope: !812, file: !429, line: 871, baseType: !216, size: 16, offset: 48)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !812, file: !429, line: 873, baseType: !819, size: 896, offset: 64)
!819 = !DICompositeType(tag: DW_TAG_array_type, baseType: !820, size: 896, elements: !799)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParticleBrushData", file: !429, line: 864, baseType: !821)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleBrushData", file: !429, line: 859, size: 128, elements: !822)
!822 = !{!823, !824, !825, !826, !827, !828}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !821, file: !429, line: 860, baseType: !216, size: 16)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !821, file: !429, line: 861, baseType: !216, size: 16, offset: 16)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !821, file: !429, line: 861, baseType: !216, size: 16, offset: 32)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !821, file: !429, line: 861, baseType: !216, size: 16, offset: 48)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !821, file: !429, line: 862, baseType: !5, size: 32, offset: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !821, file: !429, line: 863, baseType: !221, size: 32, offset: 96)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !812, file: !429, line: 874, baseType: !200, size: 64, offset: 960)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "emitterdist", scope: !812, file: !429, line: 876, baseType: !221, size: 32, offset: 1024)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !812, file: !429, line: 876, baseType: !221, size: 32, offset: 1056)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !812, file: !429, line: 878, baseType: !5, size: 32, offset: 1088)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "edittype", scope: !812, file: !429, line: 879, baseType: !5, size: 32, offset: 1120)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "draw_step", scope: !812, file: !429, line: 881, baseType: !5, size: 32, offset: 1152)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "fade_frames", scope: !812, file: !429, line: 881, baseType: !5, size: 32, offset: 1184)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !812, file: !429, line: 883, baseType: !600, size: 64, offset: 1216)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !812, file: !429, line: 884, baseType: !262, size: 64, offset: 1280)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_size", scope: !645, file: !429, line: 1107, baseType: !221, size: 32, offset: 2688)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "select_thresh", scope: !645, file: !429, line: 1110, baseType: !221, size: 32, offset: 2720)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_mode", scope: !645, file: !429, line: 1113, baseType: !216, size: 16, offset: 2752)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_flag", scope: !645, file: !429, line: 1113, baseType: !216, size: 16, offset: 2768)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "multires_subdiv_type", scope: !645, file: !429, line: 1116, baseType: !254, size: 8, offset: 2784)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !645, file: !429, line: 1117, baseType: !634, size: 8, offset: 2792)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_resolution", scope: !645, file: !429, line: 1120, baseType: !216, size: 16, offset: 2800)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_internal", scope: !645, file: !429, line: 1121, baseType: !221, size: 32, offset: 2816)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_external", scope: !645, file: !429, line: 1122, baseType: !221, size: 32, offset: 2848)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_ratio", scope: !645, file: !429, line: 1123, baseType: !221, size: 32, offset: 2880)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_limit", scope: !645, file: !429, line: 1124, baseType: !221, size: 32, offset: 2912)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_angle_limit", scope: !645, file: !429, line: 1125, baseType: !221, size: 32, offset: 2944)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_correlation_limit", scope: !645, file: !429, line: 1126, baseType: !221, size: 32, offset: 2976)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_symmetry_limit", scope: !645, file: !429, line: 1127, baseType: !221, size: 32, offset: 3008)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_angle_weight", scope: !645, file: !429, line: 1128, baseType: !221, size: 32, offset: 3040)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_length_weight", scope: !645, file: !429, line: 1129, baseType: !221, size: 32, offset: 3072)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_distance_weight", scope: !645, file: !429, line: 1130, baseType: !221, size: 32, offset: 3104)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_options", scope: !645, file: !429, line: 1131, baseType: !216, size: 16, offset: 3136)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro", scope: !645, file: !429, line: 1132, baseType: !254, size: 8, offset: 3152)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro_passes", scope: !645, file: !429, line: 1133, baseType: !254, size: 8, offset: 3160)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivisions", scope: !645, file: !429, line: 1134, baseType: !859, size: 24, offset: 3168)
!859 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 24, elements: !224)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_multi_level", scope: !645, file: !429, line: 1135, baseType: !254, size: 8, offset: 3192)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_template", scope: !645, file: !429, line: 1138, baseType: !262, size: 64, offset: 3200)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching", scope: !645, file: !429, line: 1139, baseType: !254, size: 8, offset: 3264)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching_convert", scope: !645, file: !429, line: 1140, baseType: !254, size: 8, offset: 3272)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivision_number", scope: !645, file: !429, line: 1141, baseType: !254, size: 8, offset: 3280)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_options", scope: !645, file: !429, line: 1142, baseType: !254, size: 8, offset: 3288)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_roll", scope: !645, file: !429, line: 1143, baseType: !254, size: 8, offset: 3296)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_side_string", scope: !645, file: !429, line: 1144, baseType: !868, size: 64, offset: 3304)
!868 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 64, elements: !748)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_num_string", scope: !645, file: !429, line: 1145, baseType: !868, size: 64, offset: 3368)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode", scope: !645, file: !429, line: 1148, baseType: !254, size: 8, offset: 3432)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode_live_unwrap", scope: !645, file: !429, line: 1149, baseType: !254, size: 8, offset: 3440)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "snap_mode", scope: !645, file: !429, line: 1152, baseType: !254, size: 8, offset: 3448)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "snap_node_mode", scope: !645, file: !429, line: 1152, baseType: !254, size: 8, offset: 3456)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "snap_uv_mode", scope: !645, file: !429, line: 1153, baseType: !254, size: 8, offset: 3464)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "snap_flag", scope: !645, file: !429, line: 1154, baseType: !216, size: 16, offset: 3472)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "snap_target", scope: !645, file: !429, line: 1154, baseType: !216, size: 16, offset: 3488)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "proportional", scope: !645, file: !429, line: 1155, baseType: !216, size: 16, offset: 3504)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "prop_mode", scope: !645, file: !429, line: 1155, baseType: !216, size: 16, offset: 3520)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_objects", scope: !645, file: !429, line: 1156, baseType: !254, size: 8, offset: 3536)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_mask", scope: !645, file: !429, line: 1157, baseType: !254, size: 8, offset: 3544)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "auto_normalize", scope: !645, file: !429, line: 1159, baseType: !254, size: 8, offset: 3552)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "multipaint", scope: !645, file: !429, line: 1160, baseType: !254, size: 8, offset: 3560)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "weightuser", scope: !645, file: !429, line: 1161, baseType: !254, size: 8, offset: 3568)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "vgroupsubset", scope: !645, file: !429, line: 1162, baseType: !254, size: 8, offset: 3576)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "use_uv_sculpt", scope: !645, file: !429, line: 1165, baseType: !5, size: 32, offset: 3584)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "uv_sculpt_settings", scope: !645, file: !429, line: 1166, baseType: !5, size: 32, offset: 3616)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "uv_sculpt_tool", scope: !645, file: !429, line: 1167, baseType: !5, size: 32, offset: 3648)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "uv_relax_method", scope: !645, file: !429, line: 1168, baseType: !5, size: 32, offset: 3680)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_settings", scope: !645, file: !429, line: 1171, baseType: !216, size: 16, offset: 3712)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "pad5", scope: !645, file: !429, line: 1171, baseType: !216, size: 16, offset: 3728)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_size", scope: !645, file: !429, line: 1172, baseType: !5, size: 32, offset: 3744)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_unprojected_radius", scope: !645, file: !429, line: 1173, baseType: !221, size: 32, offset: 3776)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_alpha", scope: !645, file: !429, line: 1174, baseType: !221, size: 32, offset: 3808)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "unified_paint_settings", scope: !645, file: !429, line: 1177, baseType: !895, size: 1024, offset: 3840)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UnifiedPaintSettings", file: !429, line: 963, size: 1024, elements: !896)
!896 = !{!897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !920, !921}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !895, file: !429, line: 965, baseType: !5, size: 32)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "unprojected_radius", scope: !895, file: !429, line: 968, baseType: !221, size: 32, offset: 32)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !895, file: !429, line: 971, baseType: !221, size: 32, offset: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !895, file: !429, line: 974, baseType: !221, size: 32, offset: 96)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "rgb", scope: !895, file: !429, line: 977, baseType: !223, size: 96, offset: 128)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "secondary_rgb", scope: !895, file: !429, line: 979, baseType: !223, size: 96, offset: 224)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !895, file: !429, line: 982, baseType: !5, size: 32, offset: 320)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "last_rake", scope: !895, file: !429, line: 987, baseType: !590, size: 64, offset: 352)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "brush_rotation", scope: !895, file: !429, line: 989, baseType: !221, size: 32, offset: 416)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "draw_anchored", scope: !895, file: !429, line: 994, baseType: !5, size: 32, offset: 448)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "anchored_size", scope: !895, file: !429, line: 995, baseType: !5, size: 32, offset: 480)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "draw_inverted", scope: !895, file: !429, line: 997, baseType: !254, size: 8, offset: 512)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !895, file: !429, line: 998, baseType: !798, size: 56, offset: 520)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "overlap_factor", scope: !895, file: !429, line: 1000, baseType: !221, size: 32, offset: 576)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "anchored_initial_mouse", scope: !895, file: !429, line: 1003, baseType: !590, size: 64, offset: 608)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "stroke_active", scope: !895, file: !429, line: 1006, baseType: !5, size: 32, offset: 672)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "size_pressure_value", scope: !895, file: !429, line: 1009, baseType: !221, size: 32, offset: 704)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "tex_mouse", scope: !895, file: !429, line: 1012, baseType: !590, size: 64, offset: 736)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "mask_tex_mouse", scope: !895, file: !429, line: 1015, baseType: !590, size: 64, offset: 800)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "do_linear_conversion", scope: !895, file: !429, line: 1018, baseType: !5, size: 32, offset: 864)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !895, file: !429, line: 1019, baseType: !918, size: 64, offset: 896)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !429, line: 63, flags: DIFlagFwdDecl)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_radius", scope: !895, file: !429, line: 1023, baseType: !221, size: 32, offset: 960)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "pad4", scope: !895, file: !429, line: 1024, baseType: !5, size: 32, offset: 992)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "statvis", scope: !645, file: !429, line: 1179, baseType: !923, size: 320, offset: 4864)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MeshStatVis", file: !429, line: 1043, size: 320, elements: !924)
!924 = !{!925, !926, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !923, file: !429, line: 1044, baseType: !254, size: 8)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "_pad1", scope: !923, file: !429, line: 1045, baseType: !927, size: 16, offset: 8)
!927 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 16, elements: !591)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_axis", scope: !923, file: !429, line: 1048, baseType: !254, size: 8, offset: 24)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_min", scope: !923, file: !429, line: 1049, baseType: !221, size: 32, offset: 32)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_max", scope: !923, file: !429, line: 1049, baseType: !221, size: 32, offset: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_min", scope: !923, file: !429, line: 1052, baseType: !221, size: 32, offset: 96)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_max", scope: !923, file: !429, line: 1052, baseType: !221, size: 32, offset: 128)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_samples", scope: !923, file: !429, line: 1053, baseType: !254, size: 8, offset: 160)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "_pad2", scope: !923, file: !429, line: 1054, baseType: !859, size: 24, offset: 168)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "distort_min", scope: !923, file: !429, line: 1057, baseType: !221, size: 32, offset: 192)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "distort_max", scope: !923, file: !429, line: 1057, baseType: !221, size: 32, offset: 224)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "sharp_min", scope: !923, file: !429, line: 1060, baseType: !221, size: 32, offset: 256)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "sharp_max", scope: !923, file: !429, line: 1060, baseType: !221, size: 32, offset: 288)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !601, file: !429, line: 1247, baseType: !940, size: 64, offset: 2176)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DICompositeType(tag: DW_TAG_structure_type, name: "SceneStats", file: !429, line: 60, flags: DIFlagFwdDecl)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !601, file: !429, line: 1251, baseType: !943, size: 31872, offset: 2240)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderData", file: !429, line: 403, size: 31872, elements: !944)
!944 = !{!945, !1028, !1048, !1057, !1077, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1217, !1218, !1219, !1223, !1239, !1240}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "im_format", scope: !943, file: !429, line: 404, baseType: !946, size: 1984)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageFormatData", file: !429, line: 259, size: 1984, elements: !947)
!947 = !{!948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !965, !1023}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "imtype", scope: !946, file: !429, line: 260, baseType: !254, size: 8)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !946, file: !429, line: 263, baseType: !254, size: 8, offset: 8)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !946, file: !429, line: 266, baseType: !254, size: 8, offset: 16)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !946, file: !429, line: 267, baseType: !254, size: 8, offset: 24)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !946, file: !429, line: 269, baseType: !254, size: 8, offset: 32)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "compress", scope: !946, file: !429, line: 270, baseType: !254, size: 8, offset: 40)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "exr_codec", scope: !946, file: !429, line: 276, baseType: !254, size: 8, offset: 48)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_flag", scope: !946, file: !429, line: 279, baseType: !254, size: 8, offset: 56)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_white", scope: !946, file: !429, line: 280, baseType: !216, size: 16, offset: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_black", scope: !946, file: !429, line: 280, baseType: !216, size: 16, offset: 80)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_gamma", scope: !946, file: !429, line: 281, baseType: !221, size: 32, offset: 96)
