; ModuleID = 'blender/source/blender/editors/space_sequencer/sequencer_draw.c'
source_filename = "blender/source/blender/editors/space_sequencer/sequencer_draw.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }

!282 = !DIEnumerator(name: "V2D_GRID_CLAMP", value: 1, isUnsigned: true)
!283 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !284, line: 404, baseType: !7, size: 32, elements: !285)
!284 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!285 = !{!286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311}
!286 = !DIEnumerator(name: "SEQ_TYPE_IMAGE", value: 0, isUnsigned: true)
!287 = !DIEnumerator(name: "SEQ_TYPE_META", value: 1, isUnsigned: true)
!288 = !DIEnumerator(name: "SEQ_TYPE_SCENE", value: 2, isUnsigned: true)
!289 = !DIEnumerator(name: "SEQ_TYPE_MOVIE", value: 3, isUnsigned: true)
!290 = !DIEnumerator(name: "SEQ_TYPE_SOUND_RAM", value: 4, isUnsigned: true)
!291 = !DIEnumerator(name: "SEQ_TYPE_SOUND_HD", value: 5, isUnsigned: true)
!292 = !DIEnumerator(name: "SEQ_TYPE_MOVIECLIP", value: 6, isUnsigned: true)
!293 = !DIEnumerator(name: "SEQ_TYPE_MASK", value: 7, isUnsigned: true)
!294 = !DIEnumerator(name: "SEQ_TYPE_EFFECT", value: 8, isUnsigned: true)
!295 = !DIEnumerator(name: "SEQ_TYPE_CROSS", value: 8, isUnsigned: true)
!296 = !DIEnumerator(name: "SEQ_TYPE_ADD", value: 9, isUnsigned: true)
!297 = !DIEnumerator(name: "SEQ_TYPE_SUB", value: 10, isUnsigned: true)
!298 = !DIEnumerator(name: "SEQ_TYPE_ALPHAOVER", value: 11, isUnsigned: true)
!299 = !DIEnumerator(name: "SEQ_TYPE_ALPHAUNDER", value: 12, isUnsigned: true)
!300 = !DIEnumerator(name: "SEQ_TYPE_GAMCROSS", value: 13, isUnsigned: true)
!301 = !DIEnumerator(name: "SEQ_TYPE_MUL", value: 14, isUnsigned: true)
!302 = !DIEnumerator(name: "SEQ_TYPE_OVERDROP", value: 15, isUnsigned: true)
!303 = !DIEnumerator(name: "SEQ_TYPE_WIPE", value: 25, isUnsigned: true)
!304 = !DIEnumerator(name: "SEQ_TYPE_GLOW", value: 26, isUnsigned: true)
!305 = !DIEnumerator(name: "SEQ_TYPE_TRANSFORM", value: 27, isUnsigned: true)
!306 = !DIEnumerator(name: "SEQ_TYPE_COLOR", value: 28, isUnsigned: true)
!307 = !DIEnumerator(name: "SEQ_TYPE_SPEED", value: 29, isUnsigned: true)
!308 = !DIEnumerator(name: "SEQ_TYPE_MULTICAM", value: 30, isUnsigned: true)
!309 = !DIEnumerator(name: "SEQ_TYPE_ADJUSTMENT", value: 31, isUnsigned: true)
!310 = !DIEnumerator(name: "SEQ_TYPE_GAUSSIAN_BLUR", value: 40, isUnsigned: true)
!311 = !DIEnumerator(name: "SEQ_TYPE_EFFECT_MAX", value: 40, isUnsigned: true)
!312 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !284, line: 335, baseType: !313, size: 32, elements: !314)
!313 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!314 = !{!315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340}
!315 = !DIEnumerator(name: "SEQ_LEFTSEL", value: 2)
!316 = !DIEnumerator(name: "SEQ_RIGHTSEL", value: 4)
!317 = !DIEnumerator(name: "SEQ_OVERLAP", value: 8)
!318 = !DIEnumerator(name: "SEQ_FILTERY", value: 16)
!319 = !DIEnumerator(name: "SEQ_MUTE", value: 32)
!320 = !DIEnumerator(name: "SEQ_MAKE_PREMUL", value: 64)
!321 = !DIEnumerator(name: "SEQ_REVERSE_FRAMES", value: 128)
!322 = !DIEnumerator(name: "SEQ_IPO_FRAME_LOCKED", value: 256)
!323 = !DIEnumerator(name: "SEQ_EFFECT_NOT_LOADED", value: 512)
!324 = !DIEnumerator(name: "SEQ_FLAG_DELETE", value: 1024)
!325 = !DIEnumerator(name: "SEQ_FLIPX", value: 2048)
!326 = !DIEnumerator(name: "SEQ_FLIPY", value: 4096)
!327 = !DIEnumerator(name: "SEQ_MAKE_FLOAT", value: 8192)
!328 = !DIEnumerator(name: "SEQ_LOCK", value: 16384)
!329 = !DIEnumerator(name: "SEQ_USE_PROXY", value: 32768)
!330 = !DIEnumerator(name: "SEQ_USE_TRANSFORM", value: 65536)
!331 = !DIEnumerator(name: "SEQ_USE_CROP", value: 131072)
!332 = !DIEnumerator(name: "SEQ_USE_PROXY_CUSTOM_DIR", value: 524288)
!333 = !DIEnumerator(name: "SEQ_USE_PROXY_CUSTOM_FILE", value: 2097152)
!334 = !DIEnumerator(name: "SEQ_USE_EFFECT_DEFAULT_FADE", value: 4194304)
!335 = !DIEnumerator(name: "SEQ_USE_LINEAR_MODIFIERS", value: 8388608)
!336 = !DIEnumerator(name: "SEQ_AUDIO_VOLUME_ANIMATED", value: 16777216)
!337 = !DIEnumerator(name: "SEQ_AUDIO_PITCH_ANIMATED", value: 33554432)
!338 = !DIEnumerator(name: "SEQ_AUDIO_PAN_ANIMATED", value: 67108864)
!339 = !DIEnumerator(name: "SEQ_AUDIO_DRAW_WAVEFORM", value: 134217728)
!340 = !DIEnumerator(name: "SEQ_INVALID_EFFECT", value: -2147483648)
!341 = !{!342, !343, !344, !346, !313, !349, !350, !352, !361, !362}
!342 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "GLuint", file: !348, line: 272, baseType: !7)
!348 = !DIFile(filename: "blender/extern/glew/include/GL/glew.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!349 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "GLubyte", file: !348, line: 278, baseType: !345)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "SolidColorVars", file: !284, line: 244, baseType: !354)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SolidColorVars", file: !284, line: 241, size: 128, elements: !355)
!355 = !{!356, !360}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !354, file: !284, line: 242, baseType: !357, size: 96)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 96, elements: !358)
!358 = !{!359}
!359 = !DISubrange(count: 3)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !354, file: !284, line: 243, baseType: !342, size: 32, offset: 96)
!361 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !364, line: 130, baseType: !365)
!364 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !364, line: 117, size: 960, elements: !366)
!366 = !{!367, !368, !369, !371, !389, !393, !395, !396, !397, !398}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !365, file: !364, line: 118, baseType: !343, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !365, file: !364, line: 118, baseType: !343, size: 64, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !365, file: !364, line: 119, baseType: !370, size: 64, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !365, file: !364, line: 120, baseType: !372, size: 64, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !364, line: 136, size: 17600, elements: !374)
!374 = !{!375, !376, !377, !380, !384, !385, !386}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !373, file: !364, line: 137, baseType: !363, size: 960)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !373, file: !364, line: 138, baseType: !362, size: 64, offset: 960)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !373, file: !364, line: 139, baseType: !378, size: 64, offset: 1024)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !364, line: 43, flags: DIFlagFwdDecl)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !373, file: !364, line: 140, baseType: !381, size: 8192, offset: 1088)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 8192, elements: !382)
!382 = !{!383}
!383 = !DISubrange(count: 1024)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !373, file: !364, line: 141, baseType: !381, size: 8192, offset: 9280)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !373, file: !364, line: 148, baseType: !372, size: 64, offset: 17472)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !373, file: !364, line: 150, baseType: !387, size: 64, offset: 17536)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !364, line: 45, flags: DIFlagFwdDecl)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !365, file: !364, line: 121, baseType: !390, size: 528, offset: 256)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 528, elements: !391)
!391 = !{!392}
!392 = !DISubrange(count: 66)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !365, file: !364, line: 126, baseType: !394, size: 16, offset: 784)
!394 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !365, file: !364, line: 127, baseType: !313, size: 32, offset: 800)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !365, file: !364, line: 128, baseType: !313, size: 32, offset: 832)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !365, file: !364, line: 128, baseType: !313, size: 32, offset: 864)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !365, file: !364, line: 129, baseType: !399, size: 64, offset: 896)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !364, line: 75, baseType: !401)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !364, line: 62, size: 1024, elements: !402)
!402 = !{!403, !405, !406, !407, !408, !409, !413, !414, !428, !429}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !401, file: !364, line: 63, baseType: !404, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !401, file: !364, line: 63, baseType: !404, size: 64, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !401, file: !364, line: 64, baseType: !349, size: 8, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !401, file: !364, line: 64, baseType: !349, size: 8, offset: 136)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !401, file: !364, line: 65, baseType: !394, size: 16, offset: 144)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !401, file: !364, line: 66, baseType: !410, size: 512, offset: 160)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 512, elements: !411)
!411 = !{!412}
!412 = !DISubrange(count: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !401, file: !364, line: 67, baseType: !313, size: 32, offset: 672)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !401, file: !364, line: 69, baseType: !415, size: 256, offset: 704)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !364, line: 60, baseType: !416)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !364, line: 48, size: 256, elements: !417)
!417 = !{!418, !419, !426, !427}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !416, file: !364, line: 49, baseType: !343, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !416, file: !364, line: 58, baseType: !420, size: 128, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !421, line: 71, baseType: !422)
!421 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !421, line: 69, size: 128, elements: !423)
!423 = !{!424, !425}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !422, file: !421, line: 70, baseType: !343, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !422, file: !421, line: 70, baseType: !343, size: 64, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !416, file: !364, line: 59, baseType: !313, size: 32, offset: 192)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !416, file: !364, line: 59, baseType: !313, size: 32, offset: 224)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !401, file: !364, line: 70, baseType: !313, size: 32, offset: 960)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !401, file: !364, line: 74, baseType: !313, size: 32, offset: 992)
!430 = !{!0}
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !284, line: 190, baseType: !433)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !284, line: 126, size: 2816, elements: !434)
!434 = !{!435, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !534, !538, !1597, !1598, !1599, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !433, file: !284, line: 127, baseType: !436, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !433, file: !284, line: 127, baseType: !436, size: 64, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !433, file: !284, line: 128, baseType: !343, size: 64, offset: 128)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !433, file: !284, line: 129, baseType: !343, size: 64, offset: 192)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !433, file: !284, line: 130, baseType: !410, size: 512, offset: 256)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !433, file: !284, line: 132, baseType: !313, size: 32, offset: 768)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !433, file: !284, line: 132, baseType: !313, size: 32, offset: 800)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !433, file: !284, line: 133, baseType: !313, size: 32, offset: 832)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !433, file: !284, line: 134, baseType: !313, size: 32, offset: 864)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !433, file: !284, line: 134, baseType: !313, size: 32, offset: 896)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !433, file: !284, line: 134, baseType: !313, size: 32, offset: 928)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !433, file: !284, line: 135, baseType: !313, size: 32, offset: 960)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !433, file: !284, line: 135, baseType: !313, size: 32, offset: 992)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !433, file: !284, line: 136, baseType: !313, size: 32, offset: 1024)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !433, file: !284, line: 136, baseType: !313, size: 32, offset: 1056)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !433, file: !284, line: 137, baseType: !313, size: 32, offset: 1088)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !433, file: !284, line: 137, baseType: !313, size: 32, offset: 1120)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !433, file: !284, line: 138, baseType: !342, size: 32, offset: 1152)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !433, file: !284, line: 139, baseType: !342, size: 32, offset: 1184)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !433, file: !284, line: 139, baseType: !342, size: 32, offset: 1216)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !433, file: !284, line: 141, baseType: !394, size: 16, offset: 1248)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !433, file: !284, line: 142, baseType: !394, size: 16, offset: 1264)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !433, file: !284, line: 143, baseType: !313, size: 32, offset: 1280)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !433, file: !284, line: 144, baseType: !313, size: 32, offset: 1312)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !433, file: !284, line: 146, baseType: !461, size: 64, offset: 1344)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !284, line: 114, baseType: !463)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !284, line: 99, size: 7232, elements: !464)
!464 = !{!465, !467, !468, !469, !470, !471, !472, !483, !487, !502, !511, !518, !528}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !463, file: !284, line: 100, baseType: !466, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !463, file: !284, line: 100, baseType: !466, size: 64, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !463, file: !284, line: 101, baseType: !313, size: 32, offset: 128)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !463, file: !284, line: 101, baseType: !313, size: 32, offset: 160)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !463, file: !284, line: 102, baseType: !313, size: 32, offset: 192)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !463, file: !284, line: 102, baseType: !313, size: 32, offset: 224)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !463, file: !284, line: 103, baseType: !473, size: 64, offset: 256)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !284, line: 59, baseType: !475)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !284, line: 56, size: 2112, elements: !476)
!476 = !{!477, !481, !482}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !475, file: !284, line: 57, baseType: !478, size: 2048)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 2048, elements: !479)
!479 = !{!480}
!480 = !DISubrange(count: 256)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !475, file: !284, line: 58, baseType: !313, size: 32, offset: 2048)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !475, file: !284, line: 58, baseType: !313, size: 32, offset: 2080)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !463, file: !284, line: 106, baseType: !484, size: 6144, offset: 320)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 6144, elements: !485)
!485 = !{!486}
!486 = !DISubrange(count: 768)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !463, file: !284, line: 107, baseType: !488, size: 64, offset: 6464)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !284, line: 97, baseType: !490)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !284, line: 83, size: 8320, elements: !491)
!491 = !{!492, !493, !494, !498, !499, !500, !501}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !490, file: !284, line: 84, baseType: !484, size: 6144)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !490, file: !284, line: 87, baseType: !478, size: 2048, offset: 6144)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !490, file: !284, line: 88, baseType: !495, size: 64, offset: 8192)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !497, line: 41, flags: DIFlagFwdDecl)
!497 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!498 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !490, file: !284, line: 90, baseType: !394, size: 16, offset: 8256)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !490, file: !284, line: 92, baseType: !394, size: 16, offset: 8272)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !490, file: !284, line: 93, baseType: !394, size: 16, offset: 8288)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !490, file: !284, line: 95, baseType: !394, size: 16, offset: 8304)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !463, file: !284, line: 108, baseType: !503, size: 64, offset: 6528)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !284, line: 66, baseType: !505)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !284, line: 61, size: 128, elements: !506)
!506 = !{!507, !508, !509, !510}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !505, file: !284, line: 62, baseType: !313, size: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !505, file: !284, line: 63, baseType: !313, size: 32, offset: 32)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !505, file: !284, line: 64, baseType: !313, size: 32, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !505, file: !284, line: 65, baseType: !313, size: 32, offset: 96)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !463, file: !284, line: 109, baseType: !512, size: 64, offset: 6592)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !284, line: 71, baseType: !514)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !284, line: 68, size: 64, elements: !515)
!515 = !{!516, !517}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !514, file: !284, line: 69, baseType: !313, size: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !514, file: !284, line: 70, baseType: !313, size: 32, offset: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !463, file: !284, line: 110, baseType: !519, size: 64, offset: 6656)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !284, line: 81, baseType: !521)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !284, line: 73, size: 352, elements: !522)
!522 = !{!523, !524, !525, !526, !527}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !521, file: !284, line: 74, baseType: !357, size: 96)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !521, file: !284, line: 75, baseType: !357, size: 96, offset: 96)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !521, file: !284, line: 76, baseType: !357, size: 96, offset: 192)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !521, file: !284, line: 77, baseType: !313, size: 32, offset: 288)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !521, file: !284, line: 78, baseType: !313, size: 32, offset: 320)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !463, file: !284, line: 113, baseType: !529, size: 512, offset: 6720)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !530, line: 182, baseType: !531)
!530 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !530, line: 180, size: 512, elements: !532)
!532 = !{!533}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !531, file: !530, line: 181, baseType: !410, size: 512)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !433, file: !284, line: 148, baseType: !535, size: 64, offset: 1408)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !537, line: 44, flags: DIFlagFwdDecl)
!537 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!538 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !433, file: !284, line: 151, baseType: !539, size: 64, offset: 1472)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !541, line: 1216, size: 39680, elements: !542)
!541 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!542 = !{!543, !544, !547, !550, !553, !554, !555, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !581, !660, !676, !969, !972, !1261, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1283, !1284, !1285, !1286, !1287, !1295, !1362, !1369, !1370, !1377, !1584, !1590, !1591, !1592, !1593, !1594}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !540, file: !541, line: 1217, baseType: !363, size: 960)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !540, file: !541, line: 1218, baseType: !545, size: 64, offset: 960)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !541, line: 58, flags: DIFlagFwdDecl)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !540, file: !541, line: 1220, baseType: !548, size: 64, offset: 1024)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !541, line: 50, flags: DIFlagFwdDecl)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !540, file: !541, line: 1221, baseType: !551, size: 64, offset: 1088)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !541, line: 52, flags: DIFlagFwdDecl)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !540, file: !541, line: 1223, baseType: !539, size: 64, offset: 1152)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !540, file: !541, line: 1225, baseType: !420, size: 128, offset: 1216)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !540, file: !541, line: 1226, baseType: !556, size: 64, offset: 1344)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !541, line: 69, size: 320, elements: !558)
!558 = !{!559, !560, !561, !562, !563, !564, !565, !566}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !557, file: !541, line: 70, baseType: !556, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !557, file: !541, line: 70, baseType: !556, size: 64, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !557, file: !541, line: 71, baseType: !7, size: 32, offset: 128)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !557, file: !541, line: 71, baseType: !7, size: 32, offset: 160)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !557, file: !541, line: 72, baseType: !313, size: 32, offset: 192)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !557, file: !541, line: 73, baseType: !394, size: 16, offset: 224)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !557, file: !541, line: 73, baseType: !394, size: 16, offset: 240)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !557, file: !541, line: 74, baseType: !548, size: 64, offset: 256)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !540, file: !541, line: 1227, baseType: !548, size: 64, offset: 1408)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !540, file: !541, line: 1229, baseType: !357, size: 96, offset: 1472)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !540, file: !541, line: 1230, baseType: !357, size: 96, offset: 1568)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !540, file: !541, line: 1231, baseType: !357, size: 96, offset: 1664)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !540, file: !541, line: 1231, baseType: !357, size: 96, offset: 1760)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !540, file: !541, line: 1233, baseType: !7, size: 32, offset: 1856)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !540, file: !541, line: 1234, baseType: !313, size: 32, offset: 1888)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !540, file: !541, line: 1235, baseType: !7, size: 32, offset: 1920)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !540, file: !541, line: 1237, baseType: !394, size: 16, offset: 1952)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !540, file: !541, line: 1239, baseType: !349, size: 8, offset: 1968)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !540, file: !541, line: 1240, baseType: !578, size: 8, offset: 1976)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 8, elements: !579)
!579 = !{!580}
!580 = !DISubrange(count: 1)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !540, file: !541, line: 1242, baseType: !582, size: 64, offset: 1984)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !584, line: 328, size: 3456, elements: !585)
!584 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!585 = !{!586, !587, !588, !591, !592, !595, !598, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !625, !626, !627, !630, !635, !636, !639, !643, !648, !652, !656, !657, !658, !659}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !583, file: !584, line: 329, baseType: !363, size: 960)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !583, file: !584, line: 330, baseType: !545, size: 64, offset: 960)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !583, file: !584, line: 332, baseType: !589, size: 64, offset: 1024)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !584, line: 332, flags: DIFlagFwdDecl)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !583, file: !584, line: 333, baseType: !410, size: 512, offset: 1088)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !583, file: !584, line: 335, baseType: !593, size: 64, offset: 1600)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !584, line: 335, flags: DIFlagFwdDecl)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !583, file: !584, line: 337, baseType: !596, size: 64, offset: 1664)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !541, line: 61, flags: DIFlagFwdDecl)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !583, file: !584, line: 338, baseType: !599, size: 64, offset: 1728)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 64, elements: !600)
!600 = !{!601}
!601 = !DISubrange(count: 2)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !583, file: !584, line: 340, baseType: !420, size: 128, offset: 1792)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !583, file: !584, line: 340, baseType: !420, size: 128, offset: 1920)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !583, file: !584, line: 342, baseType: !313, size: 32, offset: 2048)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !583, file: !584, line: 342, baseType: !313, size: 32, offset: 2080)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !583, file: !584, line: 343, baseType: !313, size: 32, offset: 2112)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !583, file: !584, line: 345, baseType: !313, size: 32, offset: 2144)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !583, file: !584, line: 346, baseType: !313, size: 32, offset: 2176)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !583, file: !584, line: 347, baseType: !394, size: 16, offset: 2208)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !583, file: !584, line: 348, baseType: !394, size: 16, offset: 2224)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !583, file: !584, line: 349, baseType: !313, size: 32, offset: 2240)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !583, file: !584, line: 351, baseType: !313, size: 32, offset: 2272)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !583, file: !584, line: 353, baseType: !394, size: 16, offset: 2304)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !583, file: !584, line: 354, baseType: !394, size: 16, offset: 2320)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !583, file: !584, line: 355, baseType: !313, size: 32, offset: 2336)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !583, file: !584, line: 357, baseType: !617, size: 128, offset: 2368)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !618, line: 95, baseType: !619)
!618 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !618, line: 92, size: 128, elements: !620)
!620 = !{!621, !622, !623, !624}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !619, file: !618, line: 93, baseType: !342, size: 32)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !619, file: !618, line: 93, baseType: !342, size: 32, offset: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !619, file: !618, line: 94, baseType: !342, size: 32, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !619, file: !618, line: 94, baseType: !342, size: 32, offset: 96)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !583, file: !584, line: 363, baseType: !420, size: 128, offset: 2496)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !583, file: !584, line: 363, baseType: !420, size: 128, offset: 2624)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !583, file: !584, line: 368, baseType: !628, size: 64, offset: 2752)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !584, line: 48, flags: DIFlagFwdDecl)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !583, file: !584, line: 372, baseType: !631, size: 32, offset: 2816)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !584, line: 274, baseType: !632)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !584, line: 271, size: 32, elements: !633)
!633 = !{!634}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !632, file: !584, line: 273, baseType: !7, size: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !583, file: !584, line: 373, baseType: !313, size: 32, offset: 2848)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !583, file: !584, line: 382, baseType: !637, size: 64, offset: 2880)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !584, line: 46, flags: DIFlagFwdDecl)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !583, file: !584, line: 385, baseType: !640, size: 64, offset: 2944)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DISubroutineType(types: !642)
!642 = !{null, !343, !342}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !583, file: !584, line: 386, baseType: !644, size: 64, offset: 3008)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DISubroutineType(types: !646)
!646 = !{null, !343, !647}
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !583, file: !584, line: 387, baseType: !649, size: 64, offset: 3072)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DISubroutineType(types: !651)
!651 = !{!313, !343}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !583, file: !584, line: 388, baseType: !653, size: 64, offset: 3136)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DISubroutineType(types: !655)
!655 = !{null, !343}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !583, file: !584, line: 389, baseType: !343, size: 64, offset: 3200)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !583, file: !584, line: 389, baseType: !343, size: 64, offset: 3264)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !583, file: !584, line: 389, baseType: !343, size: 64, offset: 3328)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !583, file: !584, line: 389, baseType: !343, size: 64, offset: 3392)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !540, file: !541, line: 1244, baseType: !661, size: 64, offset: 2048)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !284, line: 200, size: 17024, elements: !663)
!663 = !{!664, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !662, file: !284, line: 201, baseType: !665, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !662, file: !284, line: 202, baseType: !420, size: 128, offset: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !662, file: !284, line: 203, baseType: !420, size: 128, offset: 192)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !662, file: !284, line: 206, baseType: !431, size: 64, offset: 320)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "act_imagedir", scope: !662, file: !284, line: 207, baseType: !381, size: 8192, offset: 384)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "act_sounddir", scope: !662, file: !284, line: 208, baseType: !381, size: 8192, offset: 8576)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "over_ofs", scope: !662, file: !284, line: 210, baseType: !313, size: 32, offset: 16768)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "over_cfra", scope: !662, file: !284, line: 210, baseType: !313, size: 32, offset: 16800)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "over_flag", scope: !662, file: !284, line: 211, baseType: !313, size: 32, offset: 16832)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !662, file: !284, line: 211, baseType: !313, size: 32, offset: 16864)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "over_border", scope: !662, file: !284, line: 212, baseType: !617, size: 128, offset: 16896)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !540, file: !541, line: 1246, baseType: !677, size: 64, offset: 2112)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !541, line: 1067, size: 5184, elements: !679)
!679 = !{!680, !712, !713, !728, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !750, !840, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !889, !890, !891, !892, !893, !894, !895, !896, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !952}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !678, file: !541, line: 1068, baseType: !681, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !541, line: 934, baseType: !683)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !541, line: 925, size: 576, elements: !684)
!684 = !{!685, !703, !704, !705, !706, !708, !711}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !683, file: !541, line: 926, baseType: !686, size: 320)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !541, line: 830, baseType: !687)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !541, line: 813, size: 320, elements: !688)
!688 = !{!689, !692, !695, !696, !700, !701, !702}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !687, file: !541, line: 814, baseType: !690, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !541, line: 51, flags: DIFlagFwdDecl)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !687, file: !541, line: 815, baseType: !693, size: 64, offset: 64)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !541, line: 815, flags: DIFlagFwdDecl)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !687, file: !541, line: 818, baseType: !343, size: 64, offset: 128)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !687, file: !541, line: 819, baseType: !697, size: 32, offset: 192)
!697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !345, size: 32, elements: !698)
!698 = !{!699}
!699 = !DISubrange(count: 4)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !687, file: !541, line: 822, baseType: !313, size: 32, offset: 224)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !687, file: !541, line: 826, baseType: !313, size: 32, offset: 256)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !687, file: !541, line: 829, baseType: !313, size: 32, offset: 288)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !683, file: !541, line: 928, baseType: !394, size: 16, offset: 320)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !683, file: !541, line: 928, baseType: !394, size: 16, offset: 336)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !683, file: !541, line: 929, baseType: !313, size: 32, offset: 352)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !683, file: !541, line: 930, baseType: !707, size: 64, offset: 384)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !683, file: !541, line: 931, baseType: !709, size: 64, offset: 448)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !541, line: 931, flags: DIFlagFwdDecl)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !683, file: !541, line: 933, baseType: !343, size: 64, offset: 512)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !678, file: !541, line: 1069, baseType: !681, size: 64, offset: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !678, file: !541, line: 1070, baseType: !714, size: 64, offset: 128)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !541, line: 916, baseType: !716)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !541, line: 891, size: 704, elements: !717)
!717 = !{!718, !719, !720, !722, !723, !724, !725, !726, !727}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !716, file: !541, line: 892, baseType: !686, size: 320)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !716, file: !541, line: 896, baseType: !313, size: 32, offset: 320)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !716, file: !541, line: 900, baseType: !721, size: 96, offset: 352)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !313, size: 96, elements: !358)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !716, file: !541, line: 903, baseType: !342, size: 32, offset: 448)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !716, file: !541, line: 906, baseType: !313, size: 32, offset: 480)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !716, file: !541, line: 909, baseType: !342, size: 32, offset: 512)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !716, file: !541, line: 912, baseType: !342, size: 32, offset: 544)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !716, file: !541, line: 914, baseType: !548, size: 64, offset: 576)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !716, file: !541, line: 915, baseType: !343, size: 64, offset: 640)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !678, file: !541, line: 1071, baseType: !729, size: 64, offset: 192)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !541, line: 920, baseType: !731)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !541, line: 918, size: 320, elements: !732)
!732 = !{!733}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !731, file: !541, line: 919, baseType: !686, size: 320)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !678, file: !541, line: 1075, baseType: !342, size: 32, offset: 256)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !678, file: !541, line: 1077, baseType: !342, size: 32, offset: 288)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !678, file: !541, line: 1078, baseType: !342, size: 32, offset: 320)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !678, file: !541, line: 1079, baseType: !394, size: 16, offset: 352)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !678, file: !541, line: 1082, baseType: !394, size: 16, offset: 368)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !678, file: !541, line: 1085, baseType: !349, size: 8, offset: 384)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !678, file: !541, line: 1086, baseType: !349, size: 8, offset: 392)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !678, file: !541, line: 1087, baseType: !349, size: 8, offset: 400)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !678, file: !541, line: 1088, baseType: !349, size: 8, offset: 408)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !678, file: !541, line: 1090, baseType: !342, size: 32, offset: 416)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !678, file: !541, line: 1093, baseType: !394, size: 16, offset: 448)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !678, file: !541, line: 1096, baseType: !349, size: 8, offset: 464)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !678, file: !541, line: 1098, baseType: !747, size: 40, offset: 472)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 40, elements: !748)
!748 = !{!749}
!749 = !DISubrange(count: 5)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !678, file: !541, line: 1101, baseType: !751, size: 832, offset: 512)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !541, line: 836, size: 832, elements: !752)
!752 = !{!753, !754, !755, !756, !757, !758, !760, !761, !762, !836, !837, !838, !839}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !751, file: !541, line: 837, baseType: !686, size: 320)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !751, file: !541, line: 839, baseType: !394, size: 16, offset: 320)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !751, file: !541, line: 839, baseType: !394, size: 16, offset: 336)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !751, file: !541, line: 842, baseType: !394, size: 16, offset: 352)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !751, file: !541, line: 842, baseType: !394, size: 16, offset: 368)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !751, file: !541, line: 843, baseType: !759, size: 32, offset: 384)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !394, size: 32, elements: !600)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !751, file: !541, line: 845, baseType: !313, size: 32, offset: 416)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !751, file: !541, line: 847, baseType: !343, size: 64, offset: 448)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !751, file: !541, line: 848, baseType: !763, size: 64, offset: 512)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !497, line: 77, size: 15424, elements: !765)
!765 = !{!766, !767, !768, !771, !774, !775, !778, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !822, !823, !824, !825, !826, !830}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !764, file: !497, line: 78, baseType: !363, size: 960)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !764, file: !497, line: 80, baseType: !381, size: 8192, offset: 960)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !764, file: !497, line: 82, baseType: !769, size: 64, offset: 9152)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !497, line: 43, flags: DIFlagFwdDecl)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !764, file: !497, line: 83, baseType: !772, size: 64, offset: 9216)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !364, line: 46, flags: DIFlagFwdDecl)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !764, file: !497, line: 86, baseType: !495, size: 64, offset: 9280)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !764, file: !497, line: 87, baseType: !776, size: 64, offset: 9344)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !497, line: 44, flags: DIFlagFwdDecl)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !764, file: !497, line: 89, baseType: !779, size: 512, offset: 9408)
!779 = !DICompositeType(tag: DW_TAG_array_type, baseType: !776, size: 512, elements: !780)
!780 = !{!781}
!781 = !DISubrange(count: 8)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !764, file: !497, line: 90, baseType: !394, size: 16, offset: 9920)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !764, file: !497, line: 90, baseType: !394, size: 16, offset: 9936)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !764, file: !497, line: 92, baseType: !394, size: 16, offset: 9952)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !764, file: !497, line: 92, baseType: !394, size: 16, offset: 9968)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !764, file: !497, line: 93, baseType: !394, size: 16, offset: 9984)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !764, file: !497, line: 93, baseType: !394, size: 16, offset: 10000)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !764, file: !497, line: 94, baseType: !313, size: 32, offset: 10016)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !764, file: !497, line: 97, baseType: !394, size: 16, offset: 10048)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !764, file: !497, line: 97, baseType: !394, size: 16, offset: 10064)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !764, file: !497, line: 98, baseType: !394, size: 16, offset: 10080)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !764, file: !497, line: 98, baseType: !394, size: 16, offset: 10096)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !764, file: !497, line: 99, baseType: !394, size: 16, offset: 10112)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !764, file: !497, line: 99, baseType: !394, size: 16, offset: 10128)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !764, file: !497, line: 100, baseType: !7, size: 32, offset: 10144)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !764, file: !497, line: 101, baseType: !707, size: 64, offset: 10176)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !764, file: !497, line: 103, baseType: !387, size: 64, offset: 10240)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !764, file: !497, line: 104, baseType: !799, size: 64, offset: 10304)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !364, line: 159, size: 448, elements: !801)
!801 = !{!802, !804, !805, !806, !807, !809}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !800, file: !364, line: 161, baseType: !803, size: 64)
!803 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !600)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !800, file: !364, line: 162, baseType: !803, size: 64, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !800, file: !364, line: 163, baseType: !759, size: 32, offset: 128)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !800, file: !364, line: 164, baseType: !759, size: 32, offset: 160)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !800, file: !364, line: 165, baseType: !808, size: 128, offset: 192)
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !707, size: 128, elements: !600)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !800, file: !364, line: 166, baseType: !810, size: 128, offset: 320)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !772, size: 128, elements: !600)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !764, file: !497, line: 107, baseType: !342, size: 32, offset: 10368)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !764, file: !497, line: 108, baseType: !313, size: 32, offset: 10400)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !764, file: !497, line: 109, baseType: !394, size: 16, offset: 10432)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !764, file: !497, line: 110, baseType: !394, size: 16, offset: 10448)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !764, file: !497, line: 113, baseType: !313, size: 32, offset: 10464)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !764, file: !497, line: 113, baseType: !313, size: 32, offset: 10496)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !764, file: !497, line: 114, baseType: !349, size: 8, offset: 10528)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !764, file: !497, line: 114, baseType: !349, size: 8, offset: 10536)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !764, file: !497, line: 115, baseType: !394, size: 16, offset: 10544)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !764, file: !497, line: 116, baseType: !821, size: 128, offset: 10560)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 128, elements: !698)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !764, file: !497, line: 119, baseType: !342, size: 32, offset: 10688)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !764, file: !497, line: 119, baseType: !342, size: 32, offset: 10720)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !764, file: !497, line: 122, baseType: !529, size: 512, offset: 10752)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !764, file: !497, line: 123, baseType: !349, size: 8, offset: 11264)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !764, file: !497, line: 125, baseType: !827, size: 56, offset: 11272)
!827 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 56, elements: !828)
!828 = !{!829}
!829 = !DISubrange(count: 7)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !764, file: !497, line: 126, baseType: !831, size: 4096, offset: 11328)
!831 = !DICompositeType(tag: DW_TAG_array_type, baseType: !832, size: 4096, elements: !780)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !497, line: 69, baseType: !833)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !497, line: 67, size: 512, elements: !834)
!834 = !{!835}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !833, file: !497, line: 68, baseType: !410, size: 512)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !751, file: !541, line: 849, baseType: !763, size: 64, offset: 576)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "canvas", scope: !751, file: !541, line: 850, baseType: !763, size: 64, offset: 640)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "stencil_col", scope: !751, file: !541, line: 851, baseType: !357, size: 96, offset: 704)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !751, file: !541, line: 852, baseType: !342, size: 32, offset: 800)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !678, file: !541, line: 1104, baseType: !841, size: 1344, offset: 1344)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleEditSettings", file: !541, line: 867, size: 1344, elements: !842)
!842 = !{!843, !844, !845, !846, !847, !858, !859, !860, !861, !862, !863, !864, !865, !866}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !841, file: !541, line: 868, baseType: !394, size: 16)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "totrekey", scope: !841, file: !541, line: 869, baseType: !394, size: 16, offset: 16)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "totaddkey", scope: !841, file: !541, line: 870, baseType: !394, size: 16, offset: 32)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "brushtype", scope: !841, file: !541, line: 871, baseType: !394, size: 16, offset: 48)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !841, file: !541, line: 873, baseType: !848, size: 896, offset: 64)
!848 = !DICompositeType(tag: DW_TAG_array_type, baseType: !849, size: 896, elements: !828)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParticleBrushData", file: !541, line: 864, baseType: !850)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleBrushData", file: !541, line: 859, size: 128, elements: !851)
!851 = !{!852, !853, !854, !855, !856, !857}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !850, file: !541, line: 860, baseType: !394, size: 16)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !850, file: !541, line: 861, baseType: !394, size: 16, offset: 16)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !850, file: !541, line: 861, baseType: !394, size: 16, offset: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !850, file: !541, line: 861, baseType: !394, size: 16, offset: 48)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !850, file: !541, line: 862, baseType: !313, size: 32, offset: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !850, file: !541, line: 863, baseType: !342, size: 32, offset: 96)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !841, file: !541, line: 874, baseType: !343, size: 64, offset: 960)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "emitterdist", scope: !841, file: !541, line: 876, baseType: !342, size: 32, offset: 1024)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !841, file: !541, line: 876, baseType: !342, size: 32, offset: 1056)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !841, file: !541, line: 878, baseType: !313, size: 32, offset: 1088)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "edittype", scope: !841, file: !541, line: 879, baseType: !313, size: 32, offset: 1120)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "draw_step", scope: !841, file: !541, line: 881, baseType: !313, size: 32, offset: 1152)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "fade_frames", scope: !841, file: !541, line: 881, baseType: !313, size: 32, offset: 1184)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !841, file: !541, line: 883, baseType: !539, size: 64, offset: 1216)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !841, file: !541, line: 884, baseType: !548, size: 64, offset: 1280)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_size", scope: !678, file: !541, line: 1107, baseType: !342, size: 32, offset: 2688)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "select_thresh", scope: !678, file: !541, line: 1110, baseType: !342, size: 32, offset: 2720)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_mode", scope: !678, file: !541, line: 1113, baseType: !394, size: 16, offset: 2752)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_flag", scope: !678, file: !541, line: 1113, baseType: !394, size: 16, offset: 2768)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "multires_subdiv_type", scope: !678, file: !541, line: 1116, baseType: !349, size: 8, offset: 2784)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !678, file: !541, line: 1117, baseType: !578, size: 8, offset: 2792)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_resolution", scope: !678, file: !541, line: 1120, baseType: !394, size: 16, offset: 2800)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_internal", scope: !678, file: !541, line: 1121, baseType: !342, size: 32, offset: 2816)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_external", scope: !678, file: !541, line: 1122, baseType: !342, size: 32, offset: 2848)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_ratio", scope: !678, file: !541, line: 1123, baseType: !342, size: 32, offset: 2880)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_limit", scope: !678, file: !541, line: 1124, baseType: !342, size: 32, offset: 2912)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_angle_limit", scope: !678, file: !541, line: 1125, baseType: !342, size: 32, offset: 2944)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_correlation_limit", scope: !678, file: !541, line: 1126, baseType: !342, size: 32, offset: 2976)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_symmetry_limit", scope: !678, file: !541, line: 1127, baseType: !342, size: 32, offset: 3008)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_angle_weight", scope: !678, file: !541, line: 1128, baseType: !342, size: 32, offset: 3040)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_length_weight", scope: !678, file: !541, line: 1129, baseType: !342, size: 32, offset: 3072)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_distance_weight", scope: !678, file: !541, line: 1130, baseType: !342, size: 32, offset: 3104)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_options", scope: !678, file: !541, line: 1131, baseType: !394, size: 16, offset: 3136)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro", scope: !678, file: !541, line: 1132, baseType: !349, size: 8, offset: 3152)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro_passes", scope: !678, file: !541, line: 1133, baseType: !349, size: 8, offset: 3160)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivisions", scope: !678, file: !541, line: 1134, baseType: !888, size: 24, offset: 3168)
!888 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 24, elements: !358)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_multi_level", scope: !678, file: !541, line: 1135, baseType: !349, size: 8, offset: 3192)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_template", scope: !678, file: !541, line: 1138, baseType: !548, size: 64, offset: 3200)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching", scope: !678, file: !541, line: 1139, baseType: !349, size: 8, offset: 3264)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching_convert", scope: !678, file: !541, line: 1140, baseType: !349, size: 8, offset: 3272)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivision_number", scope: !678, file: !541, line: 1141, baseType: !349, size: 8, offset: 3280)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_options", scope: !678, file: !541, line: 1142, baseType: !349, size: 8, offset: 3288)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_roll", scope: !678, file: !541, line: 1143, baseType: !349, size: 8, offset: 3296)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_side_string", scope: !678, file: !541, line: 1144, baseType: !897, size: 64, offset: 3304)
!897 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 64, elements: !780)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_num_string", scope: !678, file: !541, line: 1145, baseType: !897, size: 64, offset: 3368)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode", scope: !678, file: !541, line: 1148, baseType: !349, size: 8, offset: 3432)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode_live_unwrap", scope: !678, file: !541, line: 1149, baseType: !349, size: 8, offset: 3440)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "snap_mode", scope: !678, file: !541, line: 1152, baseType: !349, size: 8, offset: 3448)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "snap_node_mode", scope: !678, file: !541, line: 1152, baseType: !349, size: 8, offset: 3456)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "snap_uv_mode", scope: !678, file: !541, line: 1153, baseType: !349, size: 8, offset: 3464)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "snap_flag", scope: !678, file: !541, line: 1154, baseType: !394, size: 16, offset: 3472)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "snap_target", scope: !678, file: !541, line: 1154, baseType: !394, size: 16, offset: 3488)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "proportional", scope: !678, file: !541, line: 1155, baseType: !394, size: 16, offset: 3504)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "prop_mode", scope: !678, file: !541, line: 1155, baseType: !394, size: 16, offset: 3520)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_objects", scope: !678, file: !541, line: 1156, baseType: !349, size: 8, offset: 3536)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_mask", scope: !678, file: !541, line: 1157, baseType: !349, size: 8, offset: 3544)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "auto_normalize", scope: !678, file: !541, line: 1159, baseType: !349, size: 8, offset: 3552)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "multipaint", scope: !678, file: !541, line: 1160, baseType: !349, size: 8, offset: 3560)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "weightuser", scope: !678, file: !541, line: 1161, baseType: !349, size: 8, offset: 3568)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "vgroupsubset", scope: !678, file: !541, line: 1162, baseType: !349, size: 8, offset: 3576)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "use_uv_sculpt", scope: !678, file: !541, line: 1165, baseType: !313, size: 32, offset: 3584)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "uv_sculpt_settings", scope: !678, file: !541, line: 1166, baseType: !313, size: 32, offset: 3616)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "uv_sculpt_tool", scope: !678, file: !541, line: 1167, baseType: !313, size: 32, offset: 3648)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "uv_relax_method", scope: !678, file: !541, line: 1168, baseType: !313, size: 32, offset: 3680)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_settings", scope: !678, file: !541, line: 1171, baseType: !394, size: 16, offset: 3712)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "pad5", scope: !678, file: !541, line: 1171, baseType: !394, size: 16, offset: 3728)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_size", scope: !678, file: !541, line: 1172, baseType: !313, size: 32, offset: 3744)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_unprojected_radius", scope: !678, file: !541, line: 1173, baseType: !342, size: 32, offset: 3776)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_alpha", scope: !678, file: !541, line: 1174, baseType: !342, size: 32, offset: 3808)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "unified_paint_settings", scope: !678, file: !541, line: 1177, baseType: !924, size: 1024, offset: 3840)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UnifiedPaintSettings", file: !541, line: 963, size: 1024, elements: !925)
!925 = !{!926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !950, !951}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !924, file: !541, line: 965, baseType: !313, size: 32)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "unprojected_radius", scope: !924, file: !541, line: 968, baseType: !342, size: 32, offset: 32)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !924, file: !541, line: 971, baseType: !342, size: 32, offset: 64)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !924, file: !541, line: 974, baseType: !342, size: 32, offset: 96)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "rgb", scope: !924, file: !541, line: 977, baseType: !357, size: 96, offset: 128)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "secondary_rgb", scope: !924, file: !541, line: 979, baseType: !357, size: 96, offset: 224)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !924, file: !541, line: 982, baseType: !313, size: 32, offset: 320)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "last_rake", scope: !924, file: !541, line: 987, baseType: !599, size: 64, offset: 352)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "brush_rotation", scope: !924, file: !541, line: 989, baseType: !342, size: 32, offset: 416)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "draw_anchored", scope: !924, file: !541, line: 994, baseType: !313, size: 32, offset: 448)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "anchored_size", scope: !924, file: !541, line: 995, baseType: !313, size: 32, offset: 480)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "draw_inverted", scope: !924, file: !541, line: 997, baseType: !349, size: 8, offset: 512)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !924, file: !541, line: 998, baseType: !827, size: 56, offset: 520)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "overlap_factor", scope: !924, file: !541, line: 1000, baseType: !342, size: 32, offset: 576)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "anchored_initial_mouse", scope: !924, file: !541, line: 1003, baseType: !599, size: 64, offset: 608)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "stroke_active", scope: !924, file: !541, line: 1006, baseType: !313, size: 32, offset: 672)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "size_pressure_value", scope: !924, file: !541, line: 1009, baseType: !342, size: 32, offset: 704)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "tex_mouse", scope: !924, file: !541, line: 1012, baseType: !599, size: 64, offset: 736)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "mask_tex_mouse", scope: !924, file: !541, line: 1015, baseType: !599, size: 64, offset: 800)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "do_linear_conversion", scope: !924, file: !541, line: 1018, baseType: !313, size: 32, offset: 864)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !924, file: !541, line: 1019, baseType: !947, size: 64, offset: 896)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !949, line: 132, flags: DIFlagFwdDecl)
!949 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!950 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_radius", scope: !924, file: !541, line: 1023, baseType: !342, size: 32, offset: 960)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "pad4", scope: !924, file: !541, line: 1024, baseType: !313, size: 32, offset: 992)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "statvis", scope: !678, file: !541, line: 1179, baseType: !953, size: 320, offset: 4864)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MeshStatVis", file: !541, line: 1043, size: 320, elements: !954)
!954 = !{!955, !956, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !953, file: !541, line: 1044, baseType: !349, size: 8)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "_pad1", scope: !953, file: !541, line: 1045, baseType: !957, size: 16, offset: 8)
!957 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 16, elements: !600)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_axis", scope: !953, file: !541, line: 1048, baseType: !349, size: 8, offset: 24)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_min", scope: !953, file: !541, line: 1049, baseType: !342, size: 32, offset: 32)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_max", scope: !953, file: !541, line: 1049, baseType: !342, size: 32, offset: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_min", scope: !953, file: !541, line: 1052, baseType: !342, size: 32, offset: 96)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_max", scope: !953, file: !541, line: 1052, baseType: !342, size: 32, offset: 128)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_samples", scope: !953, file: !541, line: 1053, baseType: !349, size: 8, offset: 160)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "_pad2", scope: !953, file: !541, line: 1054, baseType: !888, size: 24, offset: 168)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "distort_min", scope: !953, file: !541, line: 1057, baseType: !342, size: 32, offset: 192)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "distort_max", scope: !953, file: !541, line: 1057, baseType: !342, size: 32, offset: 224)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "sharp_min", scope: !953, file: !541, line: 1060, baseType: !342, size: 32, offset: 256)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "sharp_max", scope: !953, file: !541, line: 1060, baseType: !342, size: 32, offset: 288)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !540, file: !541, line: 1247, baseType: !970, size: 64, offset: 2176)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DICompositeType(tag: DW_TAG_structure_type, name: "SceneStats", file: !541, line: 60, flags: DIFlagFwdDecl)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !540, file: !541, line: 1251, baseType: !973, size: 31872, offset: 2240)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderData", file: !541, line: 403, size: 31872, elements: !974)
!974 = !{!975, !1050, !1070, !1079, !1099, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1237, !1238, !1239, !1243, !1259, !1260}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "im_format", scope: !973, file: !541, line: 404, baseType: !976, size: 1984)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageFormatData", file: !541, line: 259, size: 1984, elements: !977)
!977 = !{!978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !995, !1045}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "imtype", scope: !976, file: !541, line: 260, baseType: !349, size: 8)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !976, file: !541, line: 263, baseType: !349, size: 8, offset: 8)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !976, file: !541, line: 266, baseType: !349, size: 8, offset: 16)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !976, file: !541, line: 267, baseType: !349, size: 8, offset: 24)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !976, file: !541, line: 269, baseType: !349, size: 8, offset: 32)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "compress", scope: !976, file: !541, line: 270, baseType: !349, size: 8, offset: 40)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "exr_codec", scope: !976, file: !541, line: 276, baseType: !349, size: 8, offset: 48)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_flag", scope: !976, file: !541, line: 279, baseType: !349, size: 8, offset: 56)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_white", scope: !976, file: !541, line: 280, baseType: !394, size: 16, offset: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_black", scope: !976, file: !541, line: 280, baseType: !394, size: 16, offset: 80)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_gamma", scope: !976, file: !541, line: 281, baseType: !342, size: 32, offset: 96)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "jp2_flag", scope: !976, file: !541, line: 284, baseType: !349, size: 8, offset: 128)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "jp2_codec", scope: !976, file: !541, line: 285, baseType: !349, size: 8, offset: 136)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !976, file: !541, line: 287, baseType: !992, size: 48, offset: 144)
!992 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 48, elements: !993)
!993 = !{!994}
!994 = !DISubrange(count: 6)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "view_settings", scope: !976, file: !541, line: 290, baseType: !996, size: 1280, offset: 192)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedViewSettings", file: !530, line: 174, baseType: !997)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedViewSettings", file: !530, line: 166, size: 1280, elements: !998)
!998 = !{!999, !1000, !1001, !1002, !1003, !1004, !1005, !1044}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !997, file: !530, line: 167, baseType: !313, size: 32)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !997, file: !530, line: 167, baseType: !313, size: 32, offset: 32)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "look", scope: !997, file: !530, line: 168, baseType: !410, size: 512, offset: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "view_transform", scope: !997, file: !530, line: 169, baseType: !410, size: 512, offset: 576)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !997, file: !530, line: 170, baseType: !342, size: 32, offset: 1088)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !997, file: !530, line: 171, baseType: !342, size: 32, offset: 1120)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "curve_mapping", scope: !997, file: !530, line: 172, baseType: !1006, size: 64, offset: 1152)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapping", file: !530, line: 72, size: 3072, elements: !1008)
!1008 = !{!1009, !1010, !1011, !1012, !1013, !1014, !1015, !1040, !1041, !1042, !1043}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1007, file: !530, line: 73, baseType: !313, size: 32)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !1007, file: !530, line: 73, baseType: !313, size: 32, offset: 32)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "preset", scope: !1007, file: !530, line: 74, baseType: !313, size: 32, offset: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !1007, file: !530, line: 75, baseType: !313, size: 32, offset: 96)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !1007, file: !530, line: 77, baseType: !617, size: 128, offset: 128)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "clipr", scope: !1007, file: !530, line: 77, baseType: !617, size: 128, offset: 256)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "cm", scope: !1007, file: !530, line: 79, baseType: !1016, size: 2304, offset: 384)
!1016 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1017, size: 2304, elements: !698)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMap", file: !530, line: 67, baseType: !1018)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMap", file: !530, line: 55, size: 576, elements: !1019)
!1019 = !{!1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1036, !1037, !1038, !1039}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "totpoint", scope: !1018, file: !530, line: 56, baseType: !394, size: 16)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1018, file: !530, line: 56, baseType: !394, size: 16, offset: 16)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1018, file: !530, line: 58, baseType: !342, size: 32, offset: 32)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "mintable", scope: !1018, file: !530, line: 59, baseType: !342, size: 32, offset: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "maxtable", scope: !1018, file: !530, line: 59, baseType: !342, size: 32, offset: 96)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "ext_in", scope: !1018, file: !530, line: 60, baseType: !599, size: 64, offset: 128)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "ext_out", scope: !1018, file: !530, line: 60, baseType: !599, size: 64, offset: 192)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !1018, file: !530, line: 61, baseType: !1028, size: 64, offset: 256)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMapPoint", file: !530, line: 47, baseType: !1030)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapPoint", file: !530, line: 44, size: 96, elements: !1031)
!1031 = !{!1032, !1033, !1034, !1035}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1030, file: !530, line: 45, baseType: !342, size: 32)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1030, file: !530, line: 45, baseType: !342, size: 32, offset: 32)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1030, file: !530, line: 46, baseType: !394, size: 16, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "shorty", scope: !1030, file: !530, line: 46, baseType: !394, size: 16, offset: 80)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !1018, file: !530, line: 62, baseType: !1028, size: 64, offset: 320)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "premultable", scope: !1018, file: !530, line: 64, baseType: !1028, size: 64, offset: 384)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_in", scope: !1018, file: !530, line: 65, baseType: !599, size: 64, offset: 448)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_out", scope: !1018, file: !530, line: 66, baseType: !599, size: 64, offset: 512)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "black", scope: !1007, file: !530, line: 80, baseType: !357, size: 96, offset: 2688)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "white", scope: !1007, file: !530, line: 80, baseType: !357, size: 96, offset: 2784)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "bwmul", scope: !1007, file: !530, line: 81, baseType: !357, size: 96, offset: 2880)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "sample", scope: !1007, file: !530, line: 83, baseType: !357, size: 96, offset: 2976)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !997, file: !530, line: 173, baseType: !343, size: 64, offset: 1216)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "display_settings", scope: !976, file: !541, line: 291, baseType: !1046, size: 512, offset: 1472)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedDisplaySettings", file: !530, line: 178, baseType: !1047)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedDisplaySettings", file: !530, line: 176, size: 512, elements: !1048)
!1048 = !{!1049}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "display_device", scope: !1047, file: !530, line: 177, baseType: !410, size: 512)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "avicodecdata", scope: !973, file: !541, line: 406, baseType: !1051, size: 64, offset: 1984)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AviCodecData", file: !541, line: 80, size: 1472, elements: !1053)
!1053 = !{!1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "lpFormat", scope: !1052, file: !541, line: 81, baseType: !343, size: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "lpParms", scope: !1052, file: !541, line: 82, baseType: !343, size: 64, offset: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "cbFormat", scope: !1052, file: !541, line: 83, baseType: !7, size: 32, offset: 128)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "cbParms", scope: !1052, file: !541, line: 84, baseType: !7, size: 32, offset: 160)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "fccType", scope: !1052, file: !541, line: 86, baseType: !7, size: 32, offset: 192)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "fccHandler", scope: !1052, file: !541, line: 87, baseType: !7, size: 32, offset: 224)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "dwKeyFrameEvery", scope: !1052, file: !541, line: 88, baseType: !7, size: 32, offset: 256)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "dwQuality", scope: !1052, file: !541, line: 89, baseType: !7, size: 32, offset: 288)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "dwBytesPerSecond", scope: !1052, file: !541, line: 90, baseType: !7, size: 32, offset: 320)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "dwFlags", scope: !1052, file: !541, line: 91, baseType: !7, size: 32, offset: 352)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "dwInterleaveEvery", scope: !1052, file: !541, line: 92, baseType: !7, size: 32, offset: 384)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1052, file: !541, line: 93, baseType: !7, size: 32, offset: 416)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "avicodecname", scope: !1052, file: !541, line: 95, baseType: !1067, size: 1024, offset: 448)
!1067 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 1024, elements: !1068)
!1068 = !{!1069}
!1069 = !DISubrange(count: 128)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "qtcodecdata", scope: !973, file: !541, line: 407, baseType: !1071, size: 64, offset: 2048)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "QuicktimeCodecData", file: !541, line: 98, size: 1216, elements: !1073)
!1073 = !{!1074, !1075, !1076, !1077, !1078}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "cdParms", scope: !1072, file: !541, line: 100, baseType: !343, size: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1072, file: !541, line: 101, baseType: !343, size: 64, offset: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "cdSize", scope: !1072, file: !541, line: 103, baseType: !7, size: 32, offset: 128)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1072, file: !541, line: 104, baseType: !7, size: 32, offset: 160)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "qtcodecname", scope: !1072, file: !541, line: 106, baseType: !1067, size: 1024, offset: 192)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "qtcodecsettings", scope: !973, file: !541, line: 408, baseType: !1080, size: 512, offset: 2112)
!1080 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "QuicktimeCodecSettings", file: !541, line: 109, size: 512, elements: !1081)
!1081 = !{!1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "codecType", scope: !1080, file: !541, line: 111, baseType: !313, size: 32)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "codecSpatialQuality", scope: !1080, file: !541, line: 112, baseType: !313, size: 32, offset: 32)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1080, file: !541, line: 115, baseType: !313, size: 32, offset: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "codecFlags", scope: !1080, file: !541, line: 116, baseType: !313, size: 32, offset: 96)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "colorDepth", scope: !1080, file: !541, line: 117, baseType: !313, size: 32, offset: 128)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "codecTemporalQuality", scope: !1080, file: !541, line: 118, baseType: !313, size: 32, offset: 160)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "minSpatialQuality", scope: !1080, file: !541, line: 119, baseType: !313, size: 32, offset: 192)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "minTemporalQuality", scope: !1080, file: !541, line: 120, baseType: !313, size: 32, offset: 224)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "keyFrameRate", scope: !1080, file: !541, line: 121, baseType: !313, size: 32, offset: 256)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "bitRate", scope: !1080, file: !541, line: 122, baseType: !313, size: 32, offset: 288)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "audiocodecType", scope: !1080, file: !541, line: 125, baseType: !313, size: 32, offset: 320)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "audioSampleRate", scope: !1080, file: !541, line: 126, baseType: !313, size: 32, offset: 352)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "audioBitDepth", scope: !1080, file: !541, line: 127, baseType: !394, size: 16, offset: 384)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "audioChannels", scope: !1080, file: !541, line: 128, baseType: !394, size: 16, offset: 400)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "audioCodecFlags", scope: !1080, file: !541, line: 129, baseType: !313, size: 32, offset: 416)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "audioBitRate", scope: !1080, file: !541, line: 130, baseType: !313, size: 32, offset: 448)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1080, file: !541, line: 131, baseType: !313, size: 32, offset: 480)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "ffcodecdata", scope: !973, file: !541, line: 409, baseType: !1100, size: 576, offset: 2624)
!1100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFMpegCodecData", file: !541, line: 134, size: 576, elements: !1101)
!1101 = !{!1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1100, file: !541, line: 135, baseType: !313, size: 32)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1100, file: !541, line: 136, baseType: !313, size: 32, offset: 32)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1100, file: !541, line: 137, baseType: !313, size: 32, offset: 64)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "video_bitrate", scope: !1100, file: !541, line: 138, baseType: !313, size: 32, offset: 96)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "audio_bitrate", scope: !1100, file: !541, line: 139, baseType: !313, size: 32, offset: 128)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "audio_mixrate", scope: !1100, file: !541, line: 140, baseType: !313, size: 32, offset: 160)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "audio_channels", scope: !1100, file: !541, line: 141, baseType: !313, size: 32, offset: 192)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "audio_pad", scope: !1100, file: !541, line: 142, baseType: !313, size: 32, offset: 224)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "audio_volume", scope: !1100, file: !541, line: 143, baseType: !342, size: 32, offset: 256)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1100, file: !541, line: 144, baseType: !313, size: 32, offset: 288)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1100, file: !541, line: 145, baseType: !313, size: 32, offset: 320)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1100, file: !541, line: 147, baseType: !313, size: 32, offset: 352)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1100, file: !541, line: 148, baseType: !313, size: 32, offset: 384)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1100, file: !541, line: 149, baseType: !313, size: 32, offset: 416)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "mux_packet_size", scope: !1100, file: !541, line: 150, baseType: !313, size: 32, offset: 448)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "mux_rate", scope: !1100, file: !541, line: 151, baseType: !313, size: 32, offset: 480)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1100, file: !541, line: 152, baseType: !399, size: 64, offset: 512)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "cfra", scope: !973, file: !541, line: 411, baseType: !313, size: 32, offset: 3200)
