; ModuleID = 'blender/source/blender/blenfont/intern/blf.c'
source_filename = "blender/source/blender/blenfont/intern/blf.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.FontBLF = type { i8*, i8*, [3 x float], [3 x float], float, i32, i32, i32, i32, [4 x float], [4 x float], [16 x double], %struct.rctf, i32, i32, i32, i32, i32, %struct.ListBase, %struct.GlyphCacheBLF*, %struct.FT_LibraryRec_*, i32*, %struct.FT_FaceRec_*, %struct.FontBufInfoBLF }
%struct.rctf = type { float, float, float, float }
%struct.ListBase = type { i8*, i8* }
%struct.GlyphCacheBLF = type { %struct.GlyphCacheBLF*, %struct.GlyphCacheBLF*, i32, i32, [257 x %struct.ListBase], [256 x %struct.GlyphBLF*], i32*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, float, float }
%struct.GlyphBLF = type { %struct.GlyphBLF*, %struct.GlyphBLF*, i32, i32, %struct.rctf, float, i32, i32, i32, i32, i8*, i32, i32, i32, [2 x [2 x float]], float, float, i16 }
%struct.FT_LibraryRec_ = type opaque
%struct.FT_FaceRec_ = type { i64, i64, i64, i64, i64, i8*, i8*, i32, %struct.FT_Bitmap_Size_*, i32, %struct.FT_CharMapRec_**, %struct.FT_Generic_, %struct.FT_BBox_, i16, i16, i16, i16, i16, i16, i16, i16, %struct.FT_GlyphSlotRec_*, %struct.FT_SizeRec_*, %struct.FT_CharMapRec_*, %struct.FT_DriverRec_*, %struct.FT_MemoryRec_*, %struct.FT_StreamRec_*, %struct.FT_ListRec_, %struct.FT_Generic_, i8*, %struct.FT_Face_InternalRec_* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "blf_mono_font", scope: !2, file: !3, line: 75, type: !45, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !36, globals: !42, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "blender/source/blender/blenfont/intern/blf.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{!5, !28}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FT_Encoding_", file: !6, line: 742, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "include/freetype.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27}
!9 = !DIEnumerator(name: "FT_ENCODING_NONE", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "FT_ENCODING_MS_SYMBOL", value: 1937337698, isUnsigned: true)
!11 = !DIEnumerator(name: "FT_ENCODING_UNICODE", value: 1970170211, isUnsigned: true)
!12 = !DIEnumerator(name: "FT_ENCODING_SJIS", value: 1936353651, isUnsigned: true)
!13 = !DIEnumerator(name: "FT_ENCODING_GB2312", value: 1734484000, isUnsigned: true)
!14 = !DIEnumerator(name: "FT_ENCODING_BIG5", value: 1651074869, isUnsigned: true)
!15 = !DIEnumerator(name: "FT_ENCODING_WANSUNG", value: 2002873971, isUnsigned: true)
!16 = !DIEnumerator(name: "FT_ENCODING_JOHAB", value: 1785686113, isUnsigned: true)
!17 = !DIEnumerator(name: "FT_ENCODING_MS_SJIS", value: 1936353651, isUnsigned: true)
!18 = !DIEnumerator(name: "FT_ENCODING_MS_GB2312", value: 1734484000, isUnsigned: true)
!19 = !DIEnumerator(name: "FT_ENCODING_MS_BIG5", value: 1651074869, isUnsigned: true)
!20 = !DIEnumerator(name: "FT_ENCODING_MS_WANSUNG", value: 2002873971, isUnsigned: true)
!21 = !DIEnumerator(name: "FT_ENCODING_MS_JOHAB", value: 1785686113, isUnsigned: true)
!22 = !DIEnumerator(name: "FT_ENCODING_ADOBE_STANDARD", value: 1094995778, isUnsigned: true)
!23 = !DIEnumerator(name: "FT_ENCODING_ADOBE_EXPERT", value: 1094992453, isUnsigned: true)
!24 = !DIEnumerator(name: "FT_ENCODING_ADOBE_CUSTOM", value: 1094992451, isUnsigned: true)
!25 = !DIEnumerator(name: "FT_ENCODING_ADOBE_LATIN_1", value: 1818326065, isUnsigned: true)
!26 = !DIEnumerator(name: "FT_ENCODING_OLD_LATIN_2", value: 1818326066, isUnsigned: true)
!27 = !DIEnumerator(name: "FT_ENCODING_APPLE_ROMAN", value: 1634889070, isUnsigned: true)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FT_Glyph_Format_", file: !29, line: 720, baseType: !7, size: 32, elements: !30)
!29 = !DIFile(filename: "include/ftimage.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!30 = !{!31, !32, !33, !34, !35}
!31 = !DIEnumerator(name: "FT_GLYPH_FORMAT_NONE", value: 0, isUnsigned: true)
!32 = !DIEnumerator(name: "FT_GLYPH_FORMAT_COMPOSITE", value: 1668246896, isUnsigned: true)
!33 = !DIEnumerator(name: "FT_GLYPH_FORMAT_BITMAP", value: 1651078259, isUnsigned: true)
!34 = !DIEnumerator(name: "FT_GLYPH_FORMAT_OUTLINE", value: 1869968492, isUnsigned: true)
!35 = !DIEnumerator(name: "FT_GLYPH_FORMAT_PLOTTER", value: 1886154612, isUnsigned: true)
!36 = !{!37, !41}
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "GLdouble", file: !39, line: 283, baseType: !40)
!39 = !DIFile(filename: "blender/extern/glew/include/GL/glew.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!40 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!41 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!42 = !{!0, !43, !46, !432, !434, !436}
!43 = !DIGlobalVariableExpression(var: !44, expr: !DIExpression())
!44 = distinct !DIGlobalVariable(name: "blf_mono_font_render", scope: !2, file: !3, line: 76, type: !45, isLocal: false, isDefinition: true)
!45 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "global_font", scope: !2, file: !3, line: 67, type: !48, isLocal: true, isDefinition: true)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 1024, elements: !75)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "FontBLF", file: !51, line: 230, baseType: !52)
!51 = !DIFile(filename: "blender/source/blender/blenfont/intern/blf_internal_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FontBLF", file: !51, line: 158, size: 2944, elements: !53)
!53 = !{!54, !57, !58, !62, !63, !64, !65, !66, !67, !68, !72, !73, !77, !86, !87, !88, !89, !90, !91, !99, !162, !166, !176, !417}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !52, file: !51, line: 160, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !52, file: !51, line: 163, baseType: !55, size: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "aspect", scope: !52, file: !51, line: 166, baseType: !59, size: 96, offset: 128)
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 96, elements: !60)
!60 = !{!61}
!61 = !DISubrange(count: 3)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !52, file: !51, line: 169, baseType: !59, size: 96, offset: 224)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "angle", scope: !52, file: !51, line: 172, baseType: !41, size: 32, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !52, file: !51, line: 175, baseType: !45, size: 32, offset: 352)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !52, file: !51, line: 178, baseType: !45, size: 32, offset: 384)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "shadow_x", scope: !52, file: !51, line: 181, baseType: !45, size: 32, offset: 416)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "shadow_y", scope: !52, file: !51, line: 182, baseType: !45, size: 32, offset: 448)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "shadow_col", scope: !52, file: !51, line: 185, baseType: !69, size: 128, offset: 480)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 128, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 4)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "orig_col", scope: !52, file: !51, line: 188, baseType: !69, size: 128, offset: 608)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !52, file: !51, line: 193, baseType: !74, size: 1024, offset: 768)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 1024, elements: !75)
!75 = !{!76}
!76 = !DISubrange(count: 16)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "clip_rec", scope: !52, file: !51, line: 196, baseType: !78, size: 128, offset: 1792)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !79, line: 95, baseType: !80)
!79 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !79, line: 92, size: 128, elements: !81)
!81 = !{!82, !83, !84, !85}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !80, file: !79, line: 93, baseType: !41, size: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !80, file: !79, line: 93, baseType: !41, size: 32, offset: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !80, file: !79, line: 94, baseType: !41, size: 32, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !80, file: !79, line: 94, baseType: !41, size: 32, offset: 96)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "dpi", scope: !52, file: !51, line: 199, baseType: !7, size: 32, offset: 1920)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !52, file: !51, line: 202, baseType: !7, size: 32, offset: 1952)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "max_tex_size", scope: !52, file: !51, line: 205, baseType: !45, size: 32, offset: 1984)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "tex_bind_state", scope: !52, file: !51, line: 208, baseType: !7, size: 32, offset: 2016)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !52, file: !51, line: 211, baseType: !45, size: 32, offset: 2048)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !52, file: !51, line: 214, baseType: !92, size: 128, offset: 2112)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !93, line: 71, baseType: !94)
!93 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !93, line: 69, size: 128, elements: !95)
!95 = !{!96, !98}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !94, file: !93, line: 70, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !94, file: !93, line: 70, baseType: !97, size: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "glyph_cache", scope: !52, file: !51, line: 217, baseType: !100, size: 64, offset: 2240)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "GlyphCacheBLF", file: !51, line: 85, baseType: !102)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GlyphCacheBLF", file: !51, line: 34, size: 49984, elements: !103)
!103 = !{!104, !106, !107, !108, !109, !113, !147, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !102, file: !51, line: 35, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !102, file: !51, line: 36, baseType: !105, size: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !102, file: !51, line: 39, baseType: !7, size: 32, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "dpi", scope: !102, file: !51, line: 42, baseType: !7, size: 32, offset: 160)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "bucket", scope: !102, file: !51, line: 45, baseType: !110, size: 32896, offset: 192)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 32896, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 257)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "glyph_ascii_table", scope: !102, file: !51, line: 48, baseType: !114, size: 16384, offset: 33088)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 16384, elements: !145)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GlyphBLF", file: !51, line: 87, size: 896, elements: !117)
!117 = !{!118, !119, !120, !121, !124, !125, !126, !127, !129, !130, !131, !134, !135, !136, !137, !141, !142, !143}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !116, file: !51, line: 88, baseType: !115, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !116, file: !51, line: 89, baseType: !115, size: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !116, file: !51, line: 92, baseType: !7, size: 32, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !116, file: !51, line: 95, baseType: !122, size: 32, offset: 160)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_UInt", file: !123, line: 231, baseType: !7)
!123 = !DIFile(filename: "include/fttypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!124 = !DIDerivedType(tag: DW_TAG_member, name: "box", scope: !116, file: !51, line: 98, baseType: !78, size: 128, offset: 192)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "advance", scope: !116, file: !51, line: 101, baseType: !41, size: 32, offset: 320)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "advance_i", scope: !116, file: !51, line: 103, baseType: !45, size: 32, offset: 352)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !116, file: !51, line: 106, baseType: !128, size: 32, offset: 384)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "GLuint", file: !39, line: 272, baseType: !7)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "xoff", scope: !116, file: !51, line: 109, baseType: !45, size: 32, offset: 416)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "yoff", scope: !116, file: !51, line: 110, baseType: !45, size: 32, offset: 448)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap", scope: !116, file: !51, line: 115, baseType: !132, size: 64, offset: 512)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !116, file: !51, line: 118, baseType: !45, size: 32, offset: 576)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !116, file: !51, line: 119, baseType: !45, size: 32, offset: 608)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !116, file: !51, line: 120, baseType: !45, size: 32, offset: 640)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !116, file: !51, line: 123, baseType: !138, size: 128, offset: 672)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 128, elements: !139)
!139 = !{!140, !140}
!140 = !DISubrange(count: 2)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "pos_x", scope: !116, file: !51, line: 129, baseType: !41, size: 32, offset: 800)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "pos_y", scope: !116, file: !51, line: 130, baseType: !41, size: 32, offset: 832)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "build_tex", scope: !116, file: !51, line: 133, baseType: !144, size: 16, offset: 864)
!144 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!145 = !{!146}
!146 = !DISubrange(count: 256)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "textures", scope: !102, file: !51, line: 51, baseType: !148, size: 64, offset: 49472)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "ntex", scope: !102, file: !51, line: 54, baseType: !7, size: 32, offset: 49536)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "cur_tex", scope: !102, file: !51, line: 57, baseType: !7, size: 32, offset: 49568)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "x_offs", scope: !102, file: !51, line: 62, baseType: !45, size: 32, offset: 49600)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "y_offs", scope: !102, file: !51, line: 63, baseType: !45, size: 32, offset: 49632)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !102, file: !51, line: 66, baseType: !45, size: 32, offset: 49664)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "max_glyph_width", scope: !102, file: !51, line: 69, baseType: !45, size: 32, offset: 49696)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "max_glyph_height", scope: !102, file: !51, line: 70, baseType: !45, size: 32, offset: 49728)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "p2_width", scope: !102, file: !51, line: 73, baseType: !45, size: 32, offset: 49760)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "p2_height", scope: !102, file: !51, line: 74, baseType: !45, size: 32, offset: 49792)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "num_glyphs", scope: !102, file: !51, line: 77, baseType: !45, size: 32, offset: 49824)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "rem_glyphs", scope: !102, file: !51, line: 80, baseType: !45, size: 32, offset: 49856)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "ascender", scope: !102, file: !51, line: 83, baseType: !41, size: 32, offset: 49888)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "descender", scope: !102, file: !51, line: 84, baseType: !41, size: 32, offset: 49920)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "ft_lib", scope: !52, file: !51, line: 220, baseType: !163, size: 64, offset: 2304)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Library", file: !6, line: 406, baseType: !164)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "FT_LibraryRec_", file: !6, line: 406, flags: DIFlagFwdDecl)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "ft_lib_mutex", scope: !52, file: !51, line: 223, baseType: !167, size: 64, offset: 2368)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpinLock", file: !169, line: 127, baseType: !170)
!169 = !DIFile(filename: "blender/source/blender/blenlib/BLI_threads.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "spec_null_spinlock_t", file: !171, line: 9, baseType: !172)
!171 = !DIFile(filename: "include/spec_pthread.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !173, line: 26, baseType: !174)
!173 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !175, line: 42, baseType: !7)
!175 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!176 = !DIDerivedType(tag: DW_TAG_member, name: "face", scope: !52, file: !51, line: 226, baseType: !177, size: 64, offset: 2432)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Face", file: !6, line: 484, baseType: !178)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_FaceRec_", file: !6, line: 995, size: 1984, elements: !180)
!180 = !{!181, !184, !185, !186, !187, !188, !191, !192, !194, !206, !207, !220, !230, !238, !239, !240, !241, !242, !243, !244, !245, !246, !319, !342, !343, !347, !369, !398, !411, !412, !413}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "num_faces", scope: !179, file: !6, line: 997, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Long", file: !123, line: 242, baseType: !183)
!183 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "face_index", scope: !179, file: !6, line: 998, baseType: !182, size: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "face_flags", scope: !179, file: !6, line: 1000, baseType: !182, size: 64, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "style_flags", scope: !179, file: !6, line: 1001, baseType: !182, size: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "num_glyphs", scope: !179, file: !6, line: 1003, baseType: !182, size: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "family_name", scope: !179, file: !6, line: 1005, baseType: !189, size: 64, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_String", file: !123, line: 187, baseType: !56)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "style_name", scope: !179, file: !6, line: 1006, baseType: !189, size: 64, offset: 384)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "num_fixed_sizes", scope: !179, file: !6, line: 1008, baseType: !193, size: 32, offset: 448)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Int", file: !123, line: 220, baseType: !45)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "available_sizes", scope: !179, file: !6, line: 1009, baseType: !195, size: 64, offset: 512)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Bitmap_Size", file: !6, line: 373, baseType: !197)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Bitmap_Size_", file: !6, line: 363, size: 256, elements: !198)
!198 = !{!199, !201, !202, !204, !205}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !197, file: !6, line: 365, baseType: !200, size: 16)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Short", file: !123, line: 198, baseType: !144)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !197, file: !6, line: 366, baseType: !200, size: 16, offset: 16)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !197, file: !6, line: 368, baseType: !203, size: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Pos", file: !29, line: 58, baseType: !183)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "x_ppem", scope: !197, file: !6, line: 370, baseType: !203, size: 64, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "y_ppem", scope: !197, file: !6, line: 371, baseType: !203, size: 64, offset: 192)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "num_charmaps", scope: !179, file: !6, line: 1011, baseType: !193, size: 32, offset: 576)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "charmaps", scope: !179, file: !6, line: 1012, baseType: !208, size: 64, offset: 640)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_CharMap", file: !6, line: 568, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_CharMapRec_", file: !6, line: 816, size: 128, elements: !212)
!212 = !{!213, !214, !216, !219}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "face", scope: !211, file: !6, line: 818, baseType: !177, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !211, file: !6, line: 819, baseType: !215, size: 32, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Encoding", file: !6, line: 771, baseType: !5)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "platform_id", scope: !211, file: !6, line: 820, baseType: !217, size: 16, offset: 96)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_UShort", file: !123, line: 209, baseType: !218)
!218 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "encoding_id", scope: !211, file: !6, line: 821, baseType: !217, size: 16, offset: 112)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !179, file: !6, line: 1014, baseType: !221, size: 128, offset: 704)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Generic", file: !123, line: 464, baseType: !222)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Generic_", file: !123, line: 459, size: 128, elements: !223)
!223 = !{!224, !225}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !222, file: !123, line: 461, baseType: !97, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "finalizer", scope: !222, file: !123, line: 462, baseType: !226, size: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Generic_Finalizer", file: !123, line: 428, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{null, !97}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "bbox", scope: !179, file: !6, line: 1019, baseType: !231, size: 256, offset: 832)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_BBox", file: !29, line: 120, baseType: !232)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_BBox_", file: !29, line: 115, size: 256, elements: !233)
!233 = !{!234, !235, !236, !237}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "xMin", scope: !232, file: !29, line: 117, baseType: !203, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "yMin", scope: !232, file: !29, line: 117, baseType: !203, size: 64, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "xMax", scope: !232, file: !29, line: 118, baseType: !203, size: 64, offset: 128)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "yMax", scope: !232, file: !29, line: 118, baseType: !203, size: 64, offset: 192)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "units_per_EM", scope: !179, file: !6, line: 1021, baseType: !217, size: 16, offset: 1088)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ascender", scope: !179, file: !6, line: 1022, baseType: !200, size: 16, offset: 1104)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "descender", scope: !179, file: !6, line: 1023, baseType: !200, size: 16, offset: 1120)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !179, file: !6, line: 1024, baseType: !200, size: 16, offset: 1136)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "max_advance_width", scope: !179, file: !6, line: 1026, baseType: !200, size: 16, offset: 1152)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "max_advance_height", scope: !179, file: !6, line: 1027, baseType: !200, size: 16, offset: 1168)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "underline_position", scope: !179, file: !6, line: 1029, baseType: !200, size: 16, offset: 1184)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "underline_thickness", scope: !179, file: !6, line: 1030, baseType: !200, size: 16, offset: 1200)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "glyph", scope: !179, file: !6, line: 1032, baseType: !247, size: 64, offset: 1216)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_GlyphSlot", file: !6, line: 536, baseType: !248)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_GlyphSlotRec_", file: !6, line: 1706, size: 2432, elements: !250)
!250 = !{!251, !252, !253, !254, !255, !256, !268, !270, !271, !277, !279, !291, !292, !293, !305, !306, !310, !311, !312, !313, !314, !315}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "library", scope: !249, file: !6, line: 1708, baseType: !163, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "face", scope: !249, file: !6, line: 1709, baseType: !177, size: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !249, file: !6, line: 1710, baseType: !247, size: 64, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !249, file: !6, line: 1711, baseType: !122, size: 32, offset: 192)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !249, file: !6, line: 1712, baseType: !221, size: 128, offset: 256)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "metrics", scope: !249, file: !6, line: 1714, baseType: !257, size: 512, offset: 384)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Glyph_Metrics", file: !6, line: 322, baseType: !258)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Glyph_Metrics_", file: !6, line: 309, size: 512, elements: !259)
!259 = !{!260, !261, !262, !263, !264, !265, !266, !267}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !258, file: !6, line: 311, baseType: !203, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !258, file: !6, line: 312, baseType: !203, size: 64, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "horiBearingX", scope: !258, file: !6, line: 314, baseType: !203, size: 64, offset: 128)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "horiBearingY", scope: !258, file: !6, line: 315, baseType: !203, size: 64, offset: 192)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "horiAdvance", scope: !258, file: !6, line: 316, baseType: !203, size: 64, offset: 256)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "vertBearingX", scope: !258, file: !6, line: 318, baseType: !203, size: 64, offset: 320)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "vertBearingY", scope: !258, file: !6, line: 319, baseType: !203, size: 64, offset: 384)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "vertAdvance", scope: !258, file: !6, line: 320, baseType: !203, size: 64, offset: 448)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "linearHoriAdvance", scope: !249, file: !6, line: 1715, baseType: !269, size: 64, offset: 896)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Fixed", file: !123, line: 288, baseType: !183)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "linearVertAdvance", scope: !249, file: !6, line: 1716, baseType: !269, size: 64, offset: 960)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "advance", scope: !249, file: !6, line: 1717, baseType: !272, size: 128, offset: 1024)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Vector", file: !29, line: 79, baseType: !273)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Vector_", file: !29, line: 74, size: 128, elements: !274)
!274 = !{!275, !276}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !273, file: !29, line: 76, baseType: !203, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !273, file: !29, line: 77, baseType: !203, size: 64, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !249, file: !6, line: 1719, baseType: !278, size: 32, offset: 1152)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Glyph_Format", file: !29, line: 729, baseType: !28)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap", scope: !249, file: !6, line: 1721, baseType: !280, size: 320, offset: 1216)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Bitmap", file: !29, line: 277, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Bitmap_", file: !29, line: 266, size: 320, elements: !282)
!282 = !{!283, !284, !285, !286, !287, !288, !289, !290}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !281, file: !29, line: 268, baseType: !7, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !281, file: !29, line: 269, baseType: !7, size: 32, offset: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !281, file: !29, line: 270, baseType: !45, size: 32, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !281, file: !29, line: 271, baseType: !132, size: 64, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "num_grays", scope: !281, file: !29, line: 272, baseType: !218, size: 16, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_mode", scope: !281, file: !29, line: 273, baseType: !133, size: 8, offset: 208)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "palette_mode", scope: !281, file: !29, line: 274, baseType: !133, size: 8, offset: 216)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !281, file: !29, line: 275, baseType: !97, size: 64, offset: 256)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap_left", scope: !249, file: !6, line: 1722, baseType: !193, size: 32, offset: 1536)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap_top", scope: !249, file: !6, line: 1723, baseType: !193, size: 32, offset: 1568)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "outline", scope: !249, file: !6, line: 1725, baseType: !294, size: 320, offset: 1600)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Outline", file: !29, line: 350, baseType: !295)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Outline_", file: !29, line: 339, size: 320, elements: !296)
!296 = !{!297, !298, !299, !301, !302, !304}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "n_contours", scope: !295, file: !29, line: 341, baseType: !144, size: 16)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "n_points", scope: !295, file: !29, line: 342, baseType: !144, size: 16, offset: 16)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !295, file: !29, line: 344, baseType: !300, size: 64, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "tags", scope: !295, file: !29, line: 345, baseType: !55, size: 64, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "contours", scope: !295, file: !29, line: 346, baseType: !303, size: 64, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !295, file: !29, line: 348, baseType: !45, size: 32, offset: 256)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "num_subglyphs", scope: !249, file: !6, line: 1727, baseType: !122, size: 32, offset: 1920)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "subglyphs", scope: !249, file: !6, line: 1728, baseType: !307, size: 64, offset: 1984)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_SubGlyph", file: !6, line: 1523, baseType: !308)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "FT_SubGlyphRec_", file: !6, line: 1523, flags: DIFlagFwdDecl)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "control_data", scope: !249, file: !6, line: 1730, baseType: !97, size: 64, offset: 2048)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "control_len", scope: !249, file: !6, line: 1731, baseType: !183, size: 64, offset: 2112)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "lsb_delta", scope: !249, file: !6, line: 1733, baseType: !203, size: 64, offset: 2176)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "rsb_delta", scope: !249, file: !6, line: 1734, baseType: !203, size: 64, offset: 2240)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !249, file: !6, line: 1736, baseType: !97, size: 64, offset: 2304)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !249, file: !6, line: 1738, baseType: !316, size: 64, offset: 2368)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Slot_Internal", file: !6, line: 1535, baseType: !317)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Slot_InternalRec_", file: !6, line: 1535, flags: DIFlagFwdDecl)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !179, file: !6, line: 1033, baseType: !320, size: 64, offset: 1280)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Size", file: !6, line: 515, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_SizeRec_", file: !6, line: 1497, size: 704, elements: !323)
!323 = !{!324, !325, !326, !338}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "face", scope: !322, file: !6, line: 1499, baseType: !177, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !322, file: !6, line: 1500, baseType: !221, size: 128, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "metrics", scope: !322, file: !6, line: 1501, baseType: !327, size: 448, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Size_Metrics", file: !6, line: 1475, baseType: !328)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Size_Metrics_", file: !6, line: 1462, size: 448, elements: !329)
!329 = !{!330, !331, !332, !333, !334, !335, !336, !337}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "x_ppem", scope: !328, file: !6, line: 1464, baseType: !217, size: 16)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "y_ppem", scope: !328, file: !6, line: 1465, baseType: !217, size: 16, offset: 16)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "x_scale", scope: !328, file: !6, line: 1467, baseType: !269, size: 64, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "y_scale", scope: !328, file: !6, line: 1468, baseType: !269, size: 64, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "ascender", scope: !328, file: !6, line: 1470, baseType: !203, size: 64, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "descender", scope: !328, file: !6, line: 1471, baseType: !203, size: 64, offset: 256)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !328, file: !6, line: 1472, baseType: !203, size: 64, offset: 320)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "max_advance", scope: !328, file: !6, line: 1473, baseType: !203, size: 64, offset: 384)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !322, file: !6, line: 1502, baseType: !339, size: 64, offset: 640)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Size_Internal", file: !6, line: 1404, baseType: !340)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Size_InternalRec_", file: !6, line: 1404, flags: DIFlagFwdDecl)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "charmap", scope: !179, file: !6, line: 1034, baseType: !209, size: 64, offset: 1344)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "driver", scope: !179, file: !6, line: 1038, baseType: !344, size: 64, offset: 1408)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Driver", file: !6, line: 438, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "FT_DriverRec_", file: !6, line: 438, flags: DIFlagFwdDecl)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !179, file: !6, line: 1039, baseType: !348, size: 64, offset: 1472)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Memory", file: !349, line: 66, baseType: !350)
!349 = !DIFile(filename: "include/ftsystem.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_MemoryRec_", file: !349, line: 171, size: 256, elements: !352)
!352 = !{!353, !354, !359, !364}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !351, file: !349, line: 173, baseType: !97, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !351, file: !349, line: 174, baseType: !355, size: 64, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Alloc_Func", file: !349, line: 89, baseType: !356)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DISubroutineType(types: !358)
!358 = !{!97, !348, !183}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !351, file: !349, line: 175, baseType: !360, size: 64, offset: 128)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Free_Func", file: !349, line: 110, baseType: !361)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DISubroutineType(types: !363)
!363 = !{null, !348, !97}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "realloc", scope: !351, file: !349, line: 176, baseType: !365, size: 64, offset: 192)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Realloc_Func", file: !349, line: 143, baseType: !366)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DISubroutineType(types: !368)
!368 = !{!97, !348, !183, !183, !97}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !179, file: !6, line: 1040, baseType: !370, size: 64, offset: 1536)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Stream", file: !349, line: 196, baseType: !371)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_StreamRec_", file: !349, line: 321, size: 640, elements: !373)
!373 = !{!374, !375, !377, !378, !384, !385, !390, !395, !396, !397}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !372, file: !349, line: 323, baseType: !132, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !372, file: !349, line: 324, baseType: !376, size: 64, offset: 64)
!376 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !372, file: !349, line: 325, baseType: !376, size: 64, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor", scope: !372, file: !349, line: 327, baseType: !379, size: 64, offset: 192)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_StreamDesc", file: !349, line: 214, baseType: !380)
!380 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "FT_StreamDesc_", file: !349, line: 209, size: 64, elements: !381)
!381 = !{!382, !383}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !380, file: !349, line: 211, baseType: !183, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !380, file: !349, line: 212, baseType: !97, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "pathname", scope: !372, file: !349, line: 328, baseType: !379, size: 64, offset: 256)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !372, file: !349, line: 329, baseType: !386, size: 64, offset: 320)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Stream_IoFunc", file: !349, line: 248, baseType: !387)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!376, !370, !376, !132, !376}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !372, file: !349, line: 330, baseType: !391, size: 64, offset: 384)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Stream_CloseFunc", file: !349, line: 268, baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{null, !370}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !372, file: !349, line: 332, baseType: !348, size: 64, offset: 448)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !372, file: !349, line: 333, baseType: !132, size: 64, offset: 512)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !372, file: !349, line: 334, baseType: !132, size: 64, offset: 576)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "sizes_list", scope: !179, file: !6, line: 1042, baseType: !399, size: 128, offset: 1600)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_ListRec", file: !123, line: 572, baseType: !400)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_ListRec_", file: !123, line: 567, size: 128, elements: !401)
!401 = !{!402, !410}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !400, file: !123, line: 569, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_ListNode", file: !123, line: 515, baseType: !404)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_ListNodeRec_", file: !123, line: 544, size: 192, elements: !406)
!406 = !{!407, !408, !409}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !405, file: !123, line: 546, baseType: !403, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !405, file: !123, line: 547, baseType: !403, size: 64, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !405, file: !123, line: 548, baseType: !97, size: 64, offset: 128)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !400, file: !123, line: 570, baseType: !403, size: 64, offset: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "autohint", scope: !179, file: !6, line: 1044, baseType: !221, size: 128, offset: 1728)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !179, file: !6, line: 1045, baseType: !97, size: 64, offset: 1856)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !179, file: !6, line: 1047, baseType: !414, size: 64, offset: 1920)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Face_Internal", file: !6, line: 847, baseType: !415)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Face_InternalRec_", file: !6, line: 847, flags: DIFlagFwdDecl)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "buf_info", scope: !52, file: !51, line: 229, baseType: !418, size: 448, offset: 2496)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "FontBufInfoBLF", file: !51, line: 156, baseType: !419)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FontBufInfoBLF", file: !51, line: 136, size: 448, elements: !420)
!420 = !{!421, !423, !424, !425, !426, !427, !431}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "fbuf", scope: !419, file: !51, line: 138, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "cbuf", scope: !419, file: !51, line: 141, baseType: !132, size: 64, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !419, file: !51, line: 144, baseType: !45, size: 32, offset: 128)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !419, file: !51, line: 145, baseType: !45, size: 32, offset: 160)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ch", scope: !419, file: !51, line: 148, baseType: !45, size: 32, offset: 192)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !419, file: !51, line: 151, baseType: !428, size: 64, offset: 256)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedDisplay", file: !430, line: 38, flags: DIFlagFwdDecl)
!430 = !DIFile(filename: "blender/source/blender/blenfont/BLF_api.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!431 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !419, file: !51, line: 155, baseType: !69, size: 128, offset: 320)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(name: "global_font_points", scope: !2, file: !3, line: 71, type: !45, isLocal: true, isDefinition: true)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(name: "global_font_dpi", scope: !2, file: !3, line: 72, type: !45, isLocal: true, isDefinition: true)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(name: "global_font_default", scope: !2, file: !3, line: 70, type: !45, isLocal: true, isDefinition: true)
!438 = !{i32 7, !"Dwarf Version", i32 4}
!439 = !{i32 2, !"Debug Info Version", i32 3}
!440 = !{i32 1, !"wchar_size", i32 4}
!441 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!442 = distinct !DISubprogram(name: "BLF_init", scope: !3, file: !3, line: 85, type: !443, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !445)
!443 = !DISubroutineType(types: !444)
!444 = !{!45, !45, !45}
!445 = !{}
!446 = !DILocalVariable(name: "points", arg: 1, scope: !442, file: !3, line: 85, type: !45)
!447 = !DILocation(line: 85, column: 18, scope: !442)
!448 = !DILocalVariable(name: "dpi", arg: 2, scope: !442, file: !3, line: 85, type: !45)
!449 = !DILocation(line: 85, column: 30, scope: !442)
!450 = !DILocalVariable(name: "i", scope: !442, file: !3, line: 87, type: !45)
!451 = !DILocation(line: 87, column: 6, scope: !442)
!452 = !DILocation(line: 89, column: 9, scope: !453)
!453 = distinct !DILexicalBlock(scope: !442, file: !3, line: 89, column: 2)
!454 = !DILocation(line: 89, column: 7, scope: !453)
!455 = !DILocation(line: 89, column: 14, scope: !456)
!456 = distinct !DILexicalBlock(scope: !453, file: !3, line: 89, column: 2)
!457 = !DILocation(line: 89, column: 16, scope: !456)
!458 = !DILocation(line: 89, column: 2, scope: !453)
!459 = !DILocation(line: 90, column: 15, scope: !456)
!460 = !DILocation(line: 90, column: 3, scope: !456)
!461 = !DILocation(line: 90, column: 18, scope: !456)
!462 = !DILocation(line: 89, column: 33, scope: !456)
!463 = !DILocation(line: 89, column: 2, scope: !456)
!464 = distinct !{!464, !458, !465}
!465 = !DILocation(line: 90, column: 20, scope: !453)
!466 = !DILocation(line: 92, column: 23, scope: !442)
!467 = !DILocation(line: 92, column: 21, scope: !442)
!468 = !DILocation(line: 93, column: 20, scope: !442)
!469 = !DILocation(line: 93, column: 18, scope: !442)
!470 = !DILocation(line: 94, column: 9, scope: !442)
!471 = !DILocation(line: 94, column: 2, scope: !442)
!472 = distinct !DISubprogram(name: "BLF_default_dpi", scope: !3, file: !3, line: 97, type: !473, scopeLine: 98, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !445)
!473 = !DISubroutineType(types: !474)
!474 = !{null, !45}
!475 = !DILocalVariable(name: "dpi", arg: 1, scope: !472, file: !3, line: 97, type: !45)
!476 = !DILocation(line: 97, column: 26, scope: !472)
!477 = !DILocation(line: 99, column: 20, scope: !472)
!478 = !DILocation(line: 99, column: 18, scope: !472)
!479 = !DILocation(line: 100, column: 1, scope: !472)
!480 = distinct !DISubprogram(name: "BLF_exit", scope: !3, file: !3, line: 102, type: !481, scopeLine: 103, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !445)
!481 = !DISubroutineType(types: !482)
!482 = !{null}
!483 = !DILocalVariable(name: "font", scope: !480, file: !3, line: 104, type: !49)
!484 = !DILocation(line: 104, column: 11, scope: !480)
!485 = !DILocalVariable(name: "i", scope: !480, file: !3, line: 105, type: !45)
!486 = !DILocation(line: 105, column: 6, scope: !480)
!487 = !DILocation(line: 107, column: 9, scope: !488)
!488 = distinct !DILexicalBlock(scope: !480, file: !3, line: 107, column: 2)
