; ModuleID = 'blender/source/blender/editors/mask/mask_shapekey.c'
source_filename = "blender/source/blender/editors/mask/mask_shapekey.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.wmOperatorType = type { i8*, i8*, i8*, i8*, i32 (%struct.bContext*, %struct.wmOperator*)*, i8 (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, void (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, i32 (%struct.bContext*)*, void (%struct.bContext*, %struct.wmOperator*)*, %struct.StructRNA*, %struct.IDProperty*, %struct.PropertyRNA*, %struct.ListBase, %struct.wmKeyMap*, i8*, i32 (%struct.bContext*, %struct.wmOperatorType*)*, %struct.ExtensionRNA, i16 }
%struct.bContext = type opaque
%struct.wmOperator = type { %struct.wmOperator*, %struct.wmOperator*, [64 x i8], %struct.IDProperty*, %struct.wmOperatorType*, i8*, i8*, %struct.PointerRNA*, %struct.ReportList*, %struct.ListBase, %struct.wmOperator*, %struct.uiLayout*, i16, [3 x i16] }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }
%struct.ReportList = type { %struct.ListBase, i32, i32, i32, i32, %struct.wmTimer* }
%struct.wmTimer = type { %struct.wmTimer*, %struct.wmTimer*, %struct.wmWindow*, double, i32, i8*, double, double, double, double, double, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !24, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/editors/mask/mask_shapekey.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !13, !20}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 351, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12}
!7 = !DIEnumerator(name: "OPERATOR_RUNNING_MODAL", value: 1, isUnsigned: true)
!8 = !DIEnumerator(name: "OPERATOR_CANCELLED", value: 2, isUnsigned: true)
!9 = !DIEnumerator(name: "OPERATOR_FINISHED", value: 4, isUnsigned: true)
!10 = !DIEnumerator(name: "OPERATOR_PASS_THROUGH", value: 8, isUnsigned: true)
!11 = !DIEnumerator(name: "OPERATOR_HANDLED", value: 16, isUnsigned: true)
!12 = !DIEnumerator(name: "OPERATOR_INTERFACE", value: 32, isUnsigned: true)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !14, line: 519, baseType: !5, size: 32, elements: !15)
!14 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!15 = !{!16, !17, !18, !19}
!16 = !DIEnumerator(name: "OB_RECALC_OB", value: 1, isUnsigned: true)
!17 = !DIEnumerator(name: "OB_RECALC_DATA", value: 2, isUnsigned: true)
!18 = !DIEnumerator(name: "OB_RECALC_TIME", value: 4, isUnsigned: true)
!19 = !DIEnumerator(name: "OB_RECALC_ALL", value: 7, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 227, baseType: !5, size: 32, elements: !22)
!21 = !DIFile(filename: "blender/source/blender/makesdna/DNA_mask_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!22 = !{!23}
!23 = !DIEnumerator(name: "MASK_SHAPE_SELECT", value: 1, isUnsigned: true)
!24 = !{!25, !34, !35}
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "MaskLayerShapeElem", file: !21, line: 120, baseType: !27)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MaskLayerShapeElem", file: !21, line: 118, size: 256, elements: !28)
!28 = !{!29}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !27, file: !21, line: 119, baseType: !30, size: 256)
!30 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 256, elements: !32)
!31 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!32 = !{!33}
!33 = !DISubrange(count: 8)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "MaskLayerShape", file: !21, line: 111, baseType: !37)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MaskLayerShape", file: !21, line: 103, size: 320, elements: !38)
!38 = !{!39, !41, !42, !44, !46, !47, !49}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !37, file: !21, line: 104, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !37, file: !21, line: 104, baseType: !40, size: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !37, file: !21, line: 106, baseType: !43, size: 64, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "tot_vert", scope: !37, file: !21, line: 107, baseType: !45, size: 32, offset: 192)
!45 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !37, file: !21, line: 108, baseType: !45, size: 32, offset: 224)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !37, file: !21, line: 109, baseType: !48, size: 8, offset: 256)
!48 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !37, file: !21, line: 110, baseType: !50, size: 56, offset: 264)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 56, elements: !51)
!51 = !{!52}
!52 = !DISubrange(count: 7)
!53 = !{i32 7, !"Dwarf Version", i32 4}
!54 = !{i32 2, !"Debug Info Version", i32 3}
!55 = !{i32 1, !"wchar_size", i32 4}
!56 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!57 = distinct !DISubprogram(name: "MASK_OT_shape_key_insert", scope: !1, file: !1, line: 87, type: !58, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !346)
!58 = !DISubroutineType(types: !59)
!59 = !{null, !60}
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorType", file: !62, line: 568, baseType: !63)
!62 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !62, line: 508, size: 1536, elements: !64)
!64 = !{!65, !68, !69, !70, !71, !268, !273, !279, !283, !284, !288, !289, !290, !291, !295, !296, !311, !312, !316, !345}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !63, file: !62, line: 509, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !63, file: !62, line: 510, baseType: !66, size: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !63, file: !62, line: 511, baseType: !66, size: 64, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !63, file: !62, line: 512, baseType: !66, size: 64, offset: 192)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !63, file: !62, line: 518, baseType: !72, size: 64, offset: 256)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{!45, !75, !78}
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !77, line: 44, flags: DIFlagFwdDecl)
!77 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !4, line: 328, size: 1344, elements: !80)
!80 = !{!81, !82, !83, !87, !118, !120, !121, !122, !134, !258, !259, !260, !263, !264}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !79, file: !4, line: 329, baseType: !78, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !79, file: !4, line: 329, baseType: !78, size: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !79, file: !4, line: 332, baseType: !84, size: 512, offset: 128)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 512, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !79, file: !4, line: 333, baseType: !88, size: 64, offset: 640)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !90, line: 75, baseType: !91)
!90 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !90, line: 62, size: 1024, elements: !92)
!92 = !{!93, !95, !96, !97, !98, !100, !101, !102, !116, !117}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !91, file: !90, line: 63, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !91, file: !90, line: 63, baseType: !94, size: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !91, file: !90, line: 64, baseType: !48, size: 8, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !91, file: !90, line: 64, baseType: !48, size: 8, offset: 136)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !91, file: !90, line: 65, baseType: !99, size: 16, offset: 144)
!99 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !91, file: !90, line: 66, baseType: !84, size: 512, offset: 160)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !91, file: !90, line: 67, baseType: !45, size: 32, offset: 672)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !91, file: !90, line: 69, baseType: !103, size: 256, offset: 704)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !90, line: 60, baseType: !104)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !90, line: 48, size: 256, elements: !105)
!105 = !{!106, !107, !114, !115}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !104, file: !90, line: 49, baseType: !34, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !104, file: !90, line: 58, baseType: !108, size: 128, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !109, line: 71, baseType: !110)
!109 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !109, line: 69, size: 128, elements: !111)
!111 = !{!112, !113}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !110, file: !109, line: 70, baseType: !34, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !110, file: !109, line: 70, baseType: !34, size: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !104, file: !90, line: 59, baseType: !45, size: 32, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !104, file: !90, line: 59, baseType: !45, size: 32, offset: 224)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !91, file: !90, line: 70, baseType: !45, size: 32, offset: 960)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !91, file: !90, line: 74, baseType: !45, size: 32, offset: 992)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !79, file: !4, line: 336, baseType: !119, size: 64, offset: 704)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !79, file: !4, line: 337, baseType: !34, size: 64, offset: 768)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !79, file: !4, line: 338, baseType: !34, size: 64, offset: 832)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !79, file: !4, line: 340, baseType: !123, size: 64, offset: 896)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !77, line: 55, size: 192, elements: !125)
!125 = !{!126, !130, !133}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !124, file: !77, line: 58, baseType: !127, size: 64)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !124, file: !77, line: 56, size: 64, elements: !128)
!128 = !{!129}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !127, file: !77, line: 57, baseType: !34, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !124, file: !77, line: 60, baseType: !131, size: 64, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !77, line: 41, flags: DIFlagFwdDecl)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !124, file: !77, line: 61, baseType: !34, size: 64, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !79, file: !4, line: 341, baseType: !135, size: 64, offset: 960)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !4, line: 106, size: 320, elements: !137)
!137 = !{!138, !139, !140, !141, !142, !143}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !136, file: !4, line: 107, baseType: !108, size: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !136, file: !4, line: 108, baseType: !45, size: 32, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !136, file: !4, line: 109, baseType: !45, size: 32, offset: 160)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !136, file: !4, line: 110, baseType: !45, size: 32, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !136, file: !4, line: 110, baseType: !45, size: 32, offset: 224)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !136, file: !4, line: 111, baseType: !144, size: 64, offset: 256)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !62, line: 490, size: 768, elements: !146)
!146 = !{!147, !148, !149, !249, !250, !251, !252, !253, !254, !255, !256, !257}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !145, file: !62, line: 491, baseType: !144, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !145, file: !62, line: 491, baseType: !144, size: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !145, file: !62, line: 493, baseType: !150, size: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !4, line: 169, size: 2048, elements: !152)
!152 = !{!153, !154, !155, !156, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !224, !227, !241, !242, !243, !244, !245, !246, !247, !248}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !151, file: !4, line: 170, baseType: !150, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !151, file: !4, line: 170, baseType: !150, size: 64, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !151, file: !4, line: 172, baseType: !34, size: 64, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !151, file: !4, line: 174, baseType: !157, size: 64, offset: 192)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !159, line: 41, flags: DIFlagFwdDecl)
!159 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!160 = !DIDerivedType(tag: DW_TAG_member, name: "newscreen", scope: !151, file: !4, line: 175, baseType: !157, size: 64, offset: 256)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "screenname", scope: !151, file: !4, line: 176, baseType: !84, size: 512, offset: 320)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "posx", scope: !151, file: !4, line: 178, baseType: !99, size: 16, offset: 832)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "posy", scope: !151, file: !4, line: 178, baseType: !99, size: 16, offset: 848)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !151, file: !4, line: 178, baseType: !99, size: 16, offset: 864)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !151, file: !4, line: 178, baseType: !99, size: 16, offset: 880)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "windowstate", scope: !151, file: !4, line: 179, baseType: !99, size: 16, offset: 896)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !151, file: !4, line: 180, baseType: !99, size: 16, offset: 912)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !151, file: !4, line: 181, baseType: !99, size: 16, offset: 928)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !151, file: !4, line: 182, baseType: !99, size: 16, offset: 944)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "lastcursor", scope: !151, file: !4, line: 183, baseType: !99, size: 16, offset: 960)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "modalcursor", scope: !151, file: !4, line: 184, baseType: !99, size: 16, offset: 976)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "grabcursor", scope: !151, file: !4, line: 185, baseType: !99, size: 16, offset: 992)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "addmousemove", scope: !151, file: !4, line: 186, baseType: !99, size: 16, offset: 1008)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "winid", scope: !151, file: !4, line: 188, baseType: !45, size: 32, offset: 1024)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "lock_pie_event", scope: !151, file: !4, line: 190, baseType: !99, size: 16, offset: 1056)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "last_pie_event", scope: !151, file: !4, line: 191, baseType: !99, size: 16, offset: 1072)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "eventstate", scope: !151, file: !4, line: 194, baseType: !178, size: 64, offset: 1088)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmEvent", file: !62, line: 421, size: 960, elements: !180)
!180 = !{!181, !182, !183, !184, !185, !186, !187, !191, !195, !196, !197, !198, !199, !200, !201, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !220, !221, !222, !223}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !179, file: !62, line: 422, baseType: !178, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !179, file: !62, line: 422, baseType: !178, size: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !179, file: !62, line: 424, baseType: !99, size: 16, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !179, file: !62, line: 425, baseType: !99, size: 16, offset: 144)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !179, file: !62, line: 426, baseType: !45, size: 32, offset: 160)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !179, file: !62, line: 426, baseType: !45, size: 32, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "mval", scope: !179, file: !62, line: 427, baseType: !188, size: 64, offset: 224)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 64, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 2)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_buf", scope: !179, file: !62, line: 428, baseType: !192, size: 48, offset: 288)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 48, elements: !193)
!193 = !{!194}
!194 = !DISubrange(count: 6)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !179, file: !62, line: 431, baseType: !48, size: 8, offset: 336)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !179, file: !62, line: 432, baseType: !48, size: 8, offset: 344)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "prevtype", scope: !179, file: !62, line: 435, baseType: !99, size: 16, offset: 352)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "prevval", scope: !179, file: !62, line: 436, baseType: !99, size: 16, offset: 368)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "prevx", scope: !179, file: !62, line: 437, baseType: !45, size: 32, offset: 384)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "prevy", scope: !179, file: !62, line: 437, baseType: !45, size: 32, offset: 416)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicktime", scope: !179, file: !62, line: 438, baseType: !202, size: 64, offset: 448)
!202 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "prevclickx", scope: !179, file: !62, line: 439, baseType: !45, size: 32, offset: 512)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicky", scope: !179, file: !62, line: 439, baseType: !45, size: 32, offset: 544)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !179, file: !62, line: 442, baseType: !99, size: 16, offset: 576)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !179, file: !62, line: 442, baseType: !99, size: 16, offset: 592)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !179, file: !62, line: 442, baseType: !99, size: 16, offset: 608)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "oskey", scope: !179, file: !62, line: 442, baseType: !99, size: 16, offset: 624)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "keymodifier", scope: !179, file: !62, line: 443, baseType: !99, size: 16, offset: 640)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "check_click", scope: !179, file: !62, line: 446, baseType: !99, size: 16, offset: 656)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "keymap_idname", scope: !179, file: !62, line: 449, baseType: !66, size: 64, offset: 704)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "tablet_data", scope: !179, file: !62, line: 452, baseType: !213, size: 64, offset: 768)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTabletData", file: !62, line: 463, size: 128, elements: !215)
!215 = !{!216, !217, !218, !219}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "Active", scope: !214, file: !62, line: 464, baseType: !45, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "Pressure", scope: !214, file: !62, line: 465, baseType: !31, size: 32, offset: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "Xtilt", scope: !214, file: !62, line: 466, baseType: !31, size: 32, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "Ytilt", scope: !214, file: !62, line: 467, baseType: !31, size: 32, offset: 96)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "custom", scope: !179, file: !62, line: 455, baseType: !99, size: 16, offset: 832)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "customdatafree", scope: !179, file: !62, line: 456, baseType: !99, size: 16, offset: 848)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !179, file: !62, line: 457, baseType: !45, size: 32, offset: 864)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !179, file: !62, line: 458, baseType: !34, size: 64, offset: 896)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "curswin", scope: !151, file: !4, line: 196, baseType: !225, size: 64, offset: 1152)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmSubWindow", file: !4, line: 55, flags: DIFlagFwdDecl)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tweak", scope: !151, file: !4, line: 198, baseType: !228, size: 64, offset: 1216)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmGesture", file: !62, line: 398, size: 448, elements: !230)
!230 = !{!231, !232, !233, !234, !235, !236, !237, !238, !239, !240}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !229, file: !62, line: 399, baseType: !228, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !229, file: !62, line: 399, baseType: !228, size: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !229, file: !62, line: 400, baseType: !45, size: 32, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !229, file: !62, line: 401, baseType: !45, size: 32, offset: 160)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !229, file: !62, line: 402, baseType: !45, size: 32, offset: 192)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "swinid", scope: !229, file: !62, line: 403, baseType: !45, size: 32, offset: 224)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !229, file: !62, line: 404, baseType: !45, size: 32, offset: 256)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !229, file: !62, line: 405, baseType: !45, size: 32, offset: 288)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !229, file: !62, line: 407, baseType: !34, size: 64, offset: 320)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !229, file: !62, line: 414, baseType: !34, size: 64, offset: 384)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "drawmethod", scope: !151, file: !4, line: 200, baseType: !45, size: 32, offset: 1280)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "drawfail", scope: !151, file: !4, line: 200, baseType: !45, size: 32, offset: 1312)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "drawdata", scope: !151, file: !4, line: 201, baseType: !34, size: 64, offset: 1344)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !151, file: !4, line: 203, baseType: !108, size: 128, offset: 1408)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !151, file: !4, line: 204, baseType: !108, size: 128, offset: 1536)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "modalhandlers", scope: !151, file: !4, line: 205, baseType: !108, size: 128, offset: 1664)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "subwindows", scope: !151, file: !4, line: 207, baseType: !108, size: 128, offset: 1792)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "gesture", scope: !151, file: !4, line: 208, baseType: !108, size: 128, offset: 1920)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "timestep", scope: !145, file: !62, line: 495, baseType: !202, size: 64, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !145, file: !62, line: 496, baseType: !45, size: 32, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !145, file: !62, line: 497, baseType: !34, size: 64, offset: 320)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !145, file: !62, line: 499, baseType: !202, size: 64, offset: 384)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !145, file: !62, line: 500, baseType: !202, size: 64, offset: 448)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "ltime", scope: !145, file: !62, line: 502, baseType: !202, size: 64, offset: 512)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "ntime", scope: !145, file: !62, line: 503, baseType: !202, size: 64, offset: 576)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !145, file: !62, line: 504, baseType: !202, size: 64, offset: 640)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "sleep", scope: !145, file: !62, line: 505, baseType: !45, size: 32, offset: 704)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !79, file: !4, line: 343, baseType: !108, size: 128, offset: 1024)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "opm", scope: !79, file: !4, line: 344, baseType: !78, size: 64, offset: 1152)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "layout", scope: !79, file: !4, line: 345, baseType: !261, size: 64, offset: 1216)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !4, line: 61, flags: DIFlagFwdDecl)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !79, file: !4, line: 346, baseType: !99, size: 16, offset: 1280)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !79, file: !4, line: 346, baseType: !265, size: 48, offset: 1296)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 48, elements: !266)
!266 = !{!267}
!267 = !DISubrange(count: 3)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !63, file: !62, line: 524, baseType: !269, size: 64, offset: 320)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{!272, !75, !78}
!272 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "invoke", scope: !63, file: !62, line: 530, baseType: !274, size: 64, offset: 384)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DISubroutineType(types: !276)
!276 = !{!45, !75, !78, !277}
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !179)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "cancel", scope: !63, file: !62, line: 531, baseType: !280, size: 64, offset: 448)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DISubroutineType(types: !282)
!282 = !{null, !75, !78}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "modal", scope: !63, file: !62, line: 532, baseType: !274, size: 64, offset: 512)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !63, file: !62, line: 536, baseType: !285, size: 64, offset: 576)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{!45, !75}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "ui", scope: !63, file: !62, line: 539, baseType: !280, size: 64, offset: 640)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !63, file: !62, line: 542, baseType: !131, size: 64, offset: 704)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "last_properties", scope: !63, file: !62, line: 545, baseType: !94, size: 64, offset: 768)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !63, file: !62, line: 549, baseType: !292, size: 64, offset: 832)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyRNA", file: !77, line: 333, baseType: !294)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "PropertyRNA", file: !77, line: 39, flags: DIFlagFwdDecl)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !63, file: !62, line: 552, baseType: !108, size: 128, offset: 896)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "modalkeymap", scope: !63, file: !62, line: 555, baseType: !297, size: 64, offset: 1024)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmKeyMap", file: !4, line: 281, size: 1088, elements: !299)
!299 = !{!300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !298, file: !4, line: 282, baseType: !297, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !298, file: !4, line: 282, baseType: !297, size: 64, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !298, file: !4, line: 284, baseType: !108, size: 128, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "diff_items", scope: !298, file: !4, line: 285, baseType: !108, size: 128, offset: 256)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !298, file: !4, line: 287, baseType: !84, size: 512, offset: 384)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "spaceid", scope: !298, file: !4, line: 288, baseType: !99, size: 16, offset: 896)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "regionid", scope: !298, file: !4, line: 289, baseType: !99, size: 16, offset: 912)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !298, file: !4, line: 291, baseType: !99, size: 16, offset: 928)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "kmi_id", scope: !298, file: !4, line: 292, baseType: !99, size: 16, offset: 944)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !298, file: !4, line: 295, baseType: !285, size: 64, offset: 960)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "modal_items", scope: !298, file: !4, line: 296, baseType: !34, size: 64, offset: 1024)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "pyop_data", scope: !63, file: !62, line: 559, baseType: !34, size: 64, offset: 1088)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "pyop_poll", scope: !63, file: !62, line: 560, baseType: !313, size: 64, offset: 1152)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DISubroutineType(types: !315)
!315 = !{!45, !75, !119}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !63, file: !62, line: 563, baseType: !317, size: 256, offset: 1216)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !77, line: 436, baseType: !318)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !77, line: 430, size: 256, elements: !319)
!319 = !{!320, !321, !324, !340}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !318, file: !77, line: 431, baseType: !34, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !318, file: !77, line: 432, baseType: !322, size: 64, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !77, line: 417, baseType: !132)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !318, file: !77, line: 433, baseType: !325, size: 64, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !77, line: 408, baseType: !326)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DISubroutineType(types: !328)
!328 = !{!45, !75, !123, !329, !331}
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !77, line: 38, flags: DIFlagFwdDecl)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !77, line: 348, baseType: !333)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !77, line: 337, size: 256, elements: !334)
!334 = !{!335, !336, !337, !338, !339}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !333, file: !77, line: 339, baseType: !34, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !333, file: !77, line: 342, baseType: !329, size: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !333, file: !77, line: 345, baseType: !45, size: 32, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !333, file: !77, line: 347, baseType: !45, size: 32, offset: 160)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !333, file: !77, line: 347, baseType: !45, size: 32, offset: 192)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !318, file: !77, line: 434, baseType: !341, size: 64, offset: 192)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !77, line: 409, baseType: !342)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DISubroutineType(types: !344)
!344 = !{null, !34}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !63, file: !62, line: 566, baseType: !99, size: 16, offset: 1472)
!346 = !{}
!347 = !DILocalVariable(name: "ot", arg: 1, scope: !57, file: !1, line: 87, type: !60)
!348 = !DILocation(line: 87, column: 47, scope: !57)
!349 = !DILocation(line: 90, column: 2, scope: !57)
!350 = !DILocation(line: 90, column: 6, scope: !57)
!351 = !DILocation(line: 90, column: 11, scope: !57)
!352 = !DILocation(line: 91, column: 2, scope: !57)
!353 = !DILocation(line: 91, column: 6, scope: !57)
!354 = !DILocation(line: 91, column: 18, scope: !57)
!355 = !DILocation(line: 92, column: 2, scope: !57)
!356 = !DILocation(line: 92, column: 6, scope: !57)
!357 = !DILocation(line: 92, column: 13, scope: !57)
!358 = !DILocation(line: 95, column: 2, scope: !57)
!359 = !DILocation(line: 95, column: 6, scope: !57)
!360 = !DILocation(line: 95, column: 11, scope: !57)
!361 = !DILocation(line: 96, column: 2, scope: !57)
!362 = !DILocation(line: 96, column: 6, scope: !57)
!363 = !DILocation(line: 96, column: 11, scope: !57)
!364 = !DILocation(line: 99, column: 2, scope: !57)
!365 = !DILocation(line: 99, column: 6, scope: !57)
!366 = !DILocation(line: 99, column: 11, scope: !57)
!367 = !DILocation(line: 100, column: 1, scope: !57)
!368 = distinct !DISubprogram(name: "mask_shape_key_insert_exec", scope: !1, file: !1, line: 56, type: !369, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !346)
!369 = !DISubroutineType(types: !370)
!370 = !{!45, !371, !373}
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "bContext", file: !159, line: 69, baseType: !76)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperator", file: !4, line: 348, baseType: !79)
!375 = !DILocalVariable(name: "C", arg: 1, scope: !368, file: !1, line: 56, type: !371)
!376 = !DILocation(line: 56, column: 49, scope: !368)
!377 = !DILocalVariable(name: "UNUSED_op", arg: 2, scope: !368, file: !1, line: 56, type: !373)
!378 = !DILocation(line: 56, column: 64, scope: !368)
!379 = !DILocalVariable(name: "scene", scope: !368, file: !1, line: 58, type: !380)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "Scene", file: !382, line: 1299, baseType: !383)
!382 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !382, line: 1216, size: 39680, elements: !384)
!384 = !{!385, !421, !425, !711, !714, !715, !716, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !742, !745, !748, !1039, !1042, !1338, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1360, !1361, !1362, !1363, !1364, !1372, !1438, !1445, !1446, !1453, !1456, !1457, !1458, !1459, !1460, !1461}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !383, file: !382, line: 1217, baseType: !386, size: 960)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !90, line: 130, baseType: !387)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !90, line: 117, size: 960, elements: !388)
!388 = !{!389, !390, !391, !393, !412, !416, !417, !418, !419, !420}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !387, file: !90, line: 118, baseType: !34, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !387, file: !90, line: 118, baseType: !34, size: 64, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !387, file: !90, line: 119, baseType: !392, size: 64, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !387, file: !90, line: 120, baseType: !394, size: 64, offset: 192)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !90, line: 136, size: 17600, elements: !396)
!396 = !{!397, !398, !400, !403, !407, !408, !409}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !395, file: !90, line: 137, baseType: !386, size: 960)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !395, file: !90, line: 138, baseType: !399, size: 64, offset: 960)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !395, file: !90, line: 139, baseType: !401, size: 64, offset: 1024)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !90, line: 43, flags: DIFlagFwdDecl)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !395, file: !90, line: 140, baseType: !404, size: 8192, offset: 1088)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 8192, elements: !405)
!405 = !{!406}
!406 = !DISubrange(count: 1024)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !395, file: !90, line: 141, baseType: !404, size: 8192, offset: 9280)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !395, file: !90, line: 148, baseType: !394, size: 64, offset: 17472)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !395, file: !90, line: 150, baseType: !410, size: 64, offset: 17536)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !90, line: 45, flags: DIFlagFwdDecl)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !387, file: !90, line: 121, baseType: !413, size: 528, offset: 256)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 528, elements: !414)
!414 = !{!415}
!415 = !DISubrange(count: 66)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !387, file: !90, line: 126, baseType: !99, size: 16, offset: 784)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !387, file: !90, line: 127, baseType: !45, size: 32, offset: 800)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !387, file: !90, line: 128, baseType: !45, size: 32, offset: 832)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !387, file: !90, line: 128, baseType: !45, size: 32, offset: 864)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !387, file: !90, line: 129, baseType: !88, size: 64, offset: 896)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !383, file: !382, line: 1218, baseType: !422, size: 64, offset: 960)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !424, line: 45, flags: DIFlagFwdDecl)
!424 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!425 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !383, file: !382, line: 1220, baseType: !426, size: 64, offset: 1024)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !14, line: 115, size: 11392, elements: !428)
!428 = !{!429, !430, !431, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !448, !457, !471, !472, !514, !515, !518, !519, !535, !536, !537, !538, !539, !540, !541, !545, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !561, !562, !563, !564, !565, !566, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !626, !627, !628, !629, !630, !631, !632, !633, !634, !637, !640, !643, !644, !645, !646, !647, !650, !653, !656, !657, !663, !664, !665, !666, !667, !668, !670, !673, !676, !678, !699, !700}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !427, file: !14, line: 116, baseType: !386, size: 960)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !427, file: !14, line: 117, baseType: !422, size: 64, offset: 960)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !427, file: !14, line: 119, baseType: !432, size: 64, offset: 1024)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !14, line: 57, flags: DIFlagFwdDecl)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !427, file: !14, line: 121, baseType: !99, size: 16, offset: 1088)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !427, file: !14, line: 121, baseType: !99, size: 16, offset: 1104)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !427, file: !14, line: 122, baseType: !45, size: 32, offset: 1120)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !427, file: !14, line: 122, baseType: !45, size: 32, offset: 1152)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !427, file: !14, line: 122, baseType: !45, size: 32, offset: 1184)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !427, file: !14, line: 123, baseType: !84, size: 512, offset: 1216)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !427, file: !14, line: 124, baseType: !426, size: 64, offset: 1728)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !427, file: !14, line: 124, baseType: !426, size: 64, offset: 1792)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !427, file: !14, line: 127, baseType: !426, size: 64, offset: 1856)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !427, file: !14, line: 127, baseType: !426, size: 64, offset: 1920)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !427, file: !14, line: 127, baseType: !426, size: 64, offset: 1984)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !427, file: !14, line: 128, baseType: !446, size: 64, offset: 2048)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !424, line: 46, flags: DIFlagFwdDecl)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !427, file: !14, line: 130, baseType: !449, size: 64, offset: 2112)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !14, line: 97, size: 832, elements: !451)
!451 = !{!452, !455, !456}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !450, file: !14, line: 98, baseType: !453, size: 768)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 768, elements: !454)
!454 = !{!33, !267}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !450, file: !14, line: 99, baseType: !45, size: 32, offset: 768)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !450, file: !14, line: 99, baseType: !45, size: 32, offset: 800)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !427, file: !14, line: 131, baseType: !458, size: 64, offset: 2176)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !460, line: 486, size: 1600, elements: !461)
!460 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!461 = !{!462, !463, !464, !465, !466, !467, !468, !469, !470}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !459, file: !460, line: 487, baseType: !386, size: 960)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !459, file: !460, line: 489, baseType: !108, size: 128, offset: 960)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !459, file: !460, line: 490, baseType: !108, size: 128, offset: 1088)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !459, file: !460, line: 491, baseType: !108, size: 128, offset: 1216)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !459, file: !460, line: 492, baseType: !108, size: 128, offset: 1344)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !459, file: !460, line: 494, baseType: !45, size: 32, offset: 1472)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !459, file: !460, line: 495, baseType: !45, size: 32, offset: 1504)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !459, file: !460, line: 497, baseType: !45, size: 32, offset: 1536)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !459, file: !460, line: 498, baseType: !45, size: 32, offset: 1568)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !427, file: !14, line: 132, baseType: !458, size: 64, offset: 2240)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !427, file: !14, line: 133, baseType: !473, size: 64, offset: 2304)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !460, line: 334, size: 1728, elements: !475)
!475 = !{!476, !477, !480, !481, !482, !483, !484, !485, !487, !488, !489, !490, !491, !492, !493, !513}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !474, file: !460, line: 335, baseType: !108, size: 128)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !474, file: !460, line: 336, baseType: !478, size: 64, offset: 128)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !460, line: 47, flags: DIFlagFwdDecl)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !474, file: !460, line: 338, baseType: !99, size: 16, offset: 192)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !474, file: !460, line: 338, baseType: !99, size: 16, offset: 208)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !474, file: !460, line: 339, baseType: !5, size: 32, offset: 224)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !474, file: !460, line: 340, baseType: !45, size: 32, offset: 256)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !474, file: !460, line: 342, baseType: !31, size: 32, offset: 288)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !474, file: !460, line: 343, baseType: !486, size: 96, offset: 320)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 96, elements: !266)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !474, file: !460, line: 344, baseType: !486, size: 96, offset: 416)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !474, file: !460, line: 347, baseType: !108, size: 128, offset: 512)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !474, file: !460, line: 349, baseType: !45, size: 32, offset: 640)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !474, file: !460, line: 350, baseType: !45, size: 32, offset: 672)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !474, file: !460, line: 351, baseType: !34, size: 64, offset: 704)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !474, file: !460, line: 352, baseType: !34, size: 64, offset: 768)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !474, file: !460, line: 354, baseType: !494, size: 384, offset: 832)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !460, line: 116, baseType: !495)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !460, line: 94, size: 384, elements: !496)
!496 = !{!497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !495, file: !460, line: 96, baseType: !45, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !495, file: !460, line: 96, baseType: !45, size: 32, offset: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !495, file: !460, line: 97, baseType: !45, size: 32, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !495, file: !460, line: 97, baseType: !45, size: 32, offset: 96)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !495, file: !460, line: 99, baseType: !99, size: 16, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !495, file: !460, line: 100, baseType: !99, size: 16, offset: 144)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !495, file: !460, line: 102, baseType: !99, size: 16, offset: 160)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !495, file: !460, line: 105, baseType: !99, size: 16, offset: 176)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !495, file: !460, line: 108, baseType: !99, size: 16, offset: 192)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !495, file: !460, line: 109, baseType: !99, size: 16, offset: 208)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !495, file: !460, line: 111, baseType: !99, size: 16, offset: 224)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !495, file: !460, line: 112, baseType: !99, size: 16, offset: 240)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !495, file: !460, line: 114, baseType: !45, size: 32, offset: 256)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !495, file: !460, line: 114, baseType: !45, size: 32, offset: 288)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !495, file: !460, line: 115, baseType: !45, size: 32, offset: 320)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !495, file: !460, line: 115, baseType: !45, size: 32, offset: 352)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !474, file: !460, line: 355, baseType: !84, size: 512, offset: 1216)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !427, file: !14, line: 134, baseType: !34, size: 64, offset: 2368)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !427, file: !14, line: 136, baseType: !516, size: 64, offset: 2432)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !14, line: 58, flags: DIFlagFwdDecl)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !427, file: !14, line: 138, baseType: !494, size: 384, offset: 2496)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !427, file: !14, line: 139, baseType: !520, size: 64, offset: 2880)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !460, line: 80, baseType: !522)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !460, line: 72, size: 192, elements: !523)
!523 = !{!524, !531, !532, !533, !534}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !522, file: !460, line: 73, baseType: !525, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !460, line: 59, baseType: !527)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !460, line: 56, size: 128, elements: !528)
!528 = !{!529, !530}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !527, file: !460, line: 57, baseType: !486, size: 96)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !527, file: !460, line: 58, baseType: !45, size: 32, offset: 96)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !522, file: !460, line: 74, baseType: !45, size: 32, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !522, file: !460, line: 76, baseType: !45, size: 32, offset: 96)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !522, file: !460, line: 77, baseType: !45, size: 32, offset: 128)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !522, file: !460, line: 79, baseType: !45, size: 32, offset: 160)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !427, file: !14, line: 141, baseType: !108, size: 128, offset: 2944)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !427, file: !14, line: 142, baseType: !108, size: 128, offset: 3072)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !427, file: !14, line: 143, baseType: !108, size: 128, offset: 3200)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !427, file: !14, line: 144, baseType: !108, size: 128, offset: 3328)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !427, file: !14, line: 146, baseType: !45, size: 32, offset: 3456)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !427, file: !14, line: 147, baseType: !45, size: 32, offset: 3488)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !427, file: !14, line: 150, baseType: !542, size: 64, offset: 3520)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !14, line: 50, flags: DIFlagFwdDecl)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !427, file: !14, line: 151, baseType: !546, size: 64, offset: 3584)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !427, file: !14, line: 152, baseType: !45, size: 32, offset: 3648)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !427, file: !14, line: 153, baseType: !45, size: 32, offset: 3680)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !427, file: !14, line: 156, baseType: !486, size: 96, offset: 3712)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !427, file: !14, line: 156, baseType: !486, size: 96, offset: 3808)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !427, file: !14, line: 156, baseType: !486, size: 96, offset: 3904)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !427, file: !14, line: 157, baseType: !486, size: 96, offset: 4000)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !427, file: !14, line: 158, baseType: !486, size: 96, offset: 4096)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !427, file: !14, line: 159, baseType: !486, size: 96, offset: 4192)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !427, file: !14, line: 160, baseType: !486, size: 96, offset: 4288)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !427, file: !14, line: 160, baseType: !486, size: 96, offset: 4384)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !427, file: !14, line: 161, baseType: !558, size: 128, offset: 4480)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 128, elements: !559)
!559 = !{!560}
!560 = !DISubrange(count: 4)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !427, file: !14, line: 161, baseType: !558, size: 128, offset: 4608)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !427, file: !14, line: 162, baseType: !486, size: 96, offset: 4736)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !427, file: !14, line: 162, baseType: !486, size: 96, offset: 4832)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !427, file: !14, line: 163, baseType: !31, size: 32, offset: 4928)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !427, file: !14, line: 163, baseType: !31, size: 32, offset: 4960)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !427, file: !14, line: 164, baseType: !567, size: 512, offset: 4992)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 512, elements: !568)
!568 = !{!560, !560}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !427, file: !14, line: 165, baseType: !567, size: 512, offset: 5504)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !427, file: !14, line: 166, baseType: !567, size: 512, offset: 6016)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !427, file: !14, line: 167, baseType: !567, size: 512, offset: 6528)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !427, file: !14, line: 176, baseType: !567, size: 512, offset: 7040)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !427, file: !14, line: 178, baseType: !5, size: 32, offset: 7552)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !427, file: !14, line: 180, baseType: !99, size: 16, offset: 7584)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !427, file: !14, line: 181, baseType: !99, size: 16, offset: 7600)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !427, file: !14, line: 183, baseType: !99, size: 16, offset: 7616)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !427, file: !14, line: 183, baseType: !99, size: 16, offset: 7632)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !427, file: !14, line: 184, baseType: !99, size: 16, offset: 7648)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !427, file: !14, line: 184, baseType: !99, size: 16, offset: 7664)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !427, file: !14, line: 185, baseType: !99, size: 16, offset: 7680)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !427, file: !14, line: 186, baseType: !99, size: 16, offset: 7696)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !427, file: !14, line: 187, baseType: !99, size: 16, offset: 7712)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !427, file: !14, line: 188, baseType: !48, size: 8, offset: 7728)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !427, file: !14, line: 189, baseType: !48, size: 8, offset: 7736)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !427, file: !14, line: 192, baseType: !45, size: 32, offset: 7744)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !427, file: !14, line: 192, baseType: !45, size: 32, offset: 7776)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !427, file: !14, line: 192, baseType: !45, size: 32, offset: 7808)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !427, file: !14, line: 192, baseType: !45, size: 32, offset: 7840)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !427, file: !14, line: 194, baseType: !45, size: 32, offset: 7872)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !427, file: !14, line: 202, baseType: !31, size: 32, offset: 7904)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !427, file: !14, line: 202, baseType: !31, size: 32, offset: 7936)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !427, file: !14, line: 202, baseType: !31, size: 32, offset: 7968)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !427, file: !14, line: 211, baseType: !31, size: 32, offset: 8000)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !427, file: !14, line: 212, baseType: !31, size: 32, offset: 8032)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !427, file: !14, line: 213, baseType: !31, size: 32, offset: 8064)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !427, file: !14, line: 214, baseType: !31, size: 32, offset: 8096)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !427, file: !14, line: 215, baseType: !31, size: 32, offset: 8128)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !427, file: !14, line: 216, baseType: !31, size: 32, offset: 8160)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !427, file: !14, line: 219, baseType: !31, size: 32, offset: 8192)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !427, file: !14, line: 220, baseType: !31, size: 32, offset: 8224)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !427, file: !14, line: 221, baseType: !31, size: 32, offset: 8256)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !427, file: !14, line: 224, baseType: !603, size: 16, offset: 8288)
!603 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !427, file: !14, line: 224, baseType: !603, size: 16, offset: 8304)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !427, file: !14, line: 226, baseType: !99, size: 16, offset: 8320)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !427, file: !14, line: 228, baseType: !48, size: 8, offset: 8336)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !427, file: !14, line: 229, baseType: !48, size: 8, offset: 8344)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !427, file: !14, line: 231, baseType: !99, size: 16, offset: 8352)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !427, file: !14, line: 232, baseType: !48, size: 8, offset: 8368)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !427, file: !14, line: 233, baseType: !48, size: 8, offset: 8376)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !427, file: !14, line: 234, baseType: !31, size: 32, offset: 8384)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !427, file: !14, line: 235, baseType: !31, size: 32, offset: 8416)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !427, file: !14, line: 237, baseType: !108, size: 128, offset: 8448)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !427, file: !14, line: 238, baseType: !108, size: 128, offset: 8576)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !427, file: !14, line: 239, baseType: !108, size: 128, offset: 8704)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !427, file: !14, line: 240, baseType: !108, size: 128, offset: 8832)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !427, file: !14, line: 242, baseType: !31, size: 32, offset: 8960)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !427, file: !14, line: 244, baseType: !99, size: 16, offset: 8992)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !427, file: !14, line: 245, baseType: !603, size: 16, offset: 9008)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !427, file: !14, line: 246, baseType: !558, size: 128, offset: 9024)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !427, file: !14, line: 248, baseType: !45, size: 32, offset: 9152)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !427, file: !14, line: 249, baseType: !45, size: 32, offset: 9184)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !427, file: !14, line: 251, baseType: !624, size: 64, offset: 9216)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !14, line: 251, flags: DIFlagFwdDecl)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !427, file: !14, line: 253, baseType: !48, size: 8, offset: 9280)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !427, file: !14, line: 254, baseType: !48, size: 8, offset: 9288)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !427, file: !14, line: 255, baseType: !99, size: 16, offset: 9296)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !427, file: !14, line: 256, baseType: !486, size: 96, offset: 9312)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !427, file: !14, line: 258, baseType: !108, size: 128, offset: 9408)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !427, file: !14, line: 259, baseType: !108, size: 128, offset: 9536)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !427, file: !14, line: 260, baseType: !108, size: 128, offset: 9664)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !427, file: !14, line: 261, baseType: !108, size: 128, offset: 9792)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !427, file: !14, line: 263, baseType: !635, size: 64, offset: 9920)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !14, line: 52, flags: DIFlagFwdDecl)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !427, file: !14, line: 264, baseType: !638, size: 64, offset: 9984)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !14, line: 53, flags: DIFlagFwdDecl)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !427, file: !14, line: 265, baseType: !641, size: 64, offset: 10048)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !460, line: 46, flags: DIFlagFwdDecl)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !427, file: !14, line: 267, baseType: !48, size: 8, offset: 10112)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !427, file: !14, line: 268, baseType: !48, size: 8, offset: 10120)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !427, file: !14, line: 269, baseType: !99, size: 16, offset: 10128)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !427, file: !14, line: 270, baseType: !31, size: 32, offset: 10144)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !427, file: !14, line: 272, baseType: !648, size: 64, offset: 10176)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !14, line: 54, flags: DIFlagFwdDecl)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !427, file: !14, line: 275, baseType: !651, size: 64, offset: 10240)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !14, line: 275, flags: DIFlagFwdDecl)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !427, file: !14, line: 277, baseType: !654, size: 64, offset: 10304)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !14, line: 56, flags: DIFlagFwdDecl)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !427, file: !14, line: 277, baseType: !654, size: 64, offset: 10368)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !427, file: !14, line: 278, baseType: !658, size: 64, offset: 10432)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !659, line: 27, baseType: !660)
!659 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !661, line: 45, baseType: !662)
!661 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!662 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !427, file: !14, line: 279, baseType: !658, size: 64, offset: 10496)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !427, file: !14, line: 280, baseType: !5, size: 32, offset: 10560)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !427, file: !14, line: 281, baseType: !5, size: 32, offset: 10592)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !427, file: !14, line: 283, baseType: !108, size: 128, offset: 10624)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !427, file: !14, line: 284, baseType: !108, size: 128, offset: 10752)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !427, file: !14, line: 285, baseType: !669, size: 64, offset: 10880)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !427, file: !14, line: 287, baseType: !671, size: 64, offset: 10944)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !14, line: 59, flags: DIFlagFwdDecl)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !427, file: !14, line: 288, baseType: !674, size: 64, offset: 11008)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !14, line: 288, flags: DIFlagFwdDecl)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !427, file: !14, line: 290, baseType: !677, size: 64, offset: 11072)
!677 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 64, elements: !189)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !427, file: !14, line: 291, baseType: !679, size: 64, offset: 11136)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !681, line: 65, baseType: !682)
!681 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !681, line: 50, size: 320, elements: !683)
!683 = !{!684, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !682, file: !681, line: 51, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !682, file: !681, line: 53, baseType: !45, size: 32, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !682, file: !681, line: 54, baseType: !45, size: 32, offset: 96)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !682, file: !681, line: 55, baseType: !45, size: 32, offset: 128)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !682, file: !681, line: 55, baseType: !45, size: 32, offset: 160)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !682, file: !681, line: 56, baseType: !48, size: 8, offset: 192)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !682, file: !681, line: 56, baseType: !48, size: 8, offset: 200)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !682, file: !681, line: 57, baseType: !48, size: 8, offset: 208)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !682, file: !681, line: 57, baseType: !48, size: 8, offset: 216)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !682, file: !681, line: 59, baseType: !99, size: 16, offset: 224)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !682, file: !681, line: 59, baseType: !99, size: 16, offset: 240)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !682, file: !681, line: 59, baseType: !99, size: 16, offset: 256)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !682, file: !681, line: 61, baseType: !99, size: 16, offset: 272)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !682, file: !681, line: 63, baseType: !45, size: 32, offset: 288)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !427, file: !14, line: 293, baseType: !108, size: 128, offset: 11200)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !427, file: !14, line: 294, baseType: !701, size: 64, offset: 11328)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !14, line: 113, baseType: !703)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !14, line: 108, size: 256, elements: !704)
!704 = !{!705, !707, !708, !709, !710}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !703, file: !14, line: 109, baseType: !706, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !703, file: !14, line: 109, baseType: !706, size: 64, offset: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !703, file: !14, line: 110, baseType: !426, size: 64, offset: 128)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !703, file: !14, line: 111, baseType: !45, size: 32, offset: 192)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !703, file: !14, line: 112, baseType: !31, size: 32, offset: 224)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !383, file: !382, line: 1221, baseType: !712, size: 64, offset: 1088)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !382, line: 52, flags: DIFlagFwdDecl)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !383, file: !382, line: 1223, baseType: !685, size: 64, offset: 1152)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !383, file: !382, line: 1225, baseType: !108, size: 128, offset: 1216)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !383, file: !382, line: 1226, baseType: !717, size: 64, offset: 1344)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !382, line: 69, size: 320, elements: !719)
!719 = !{!720, !721, !722, !723, !724, !725, !726, !727}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !718, file: !382, line: 70, baseType: !717, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !718, file: !382, line: 70, baseType: !717, size: 64, offset: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !718, file: !382, line: 71, baseType: !5, size: 32, offset: 128)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !718, file: !382, line: 71, baseType: !5, size: 32, offset: 160)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !718, file: !382, line: 72, baseType: !45, size: 32, offset: 192)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !718, file: !382, line: 73, baseType: !99, size: 16, offset: 224)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !718, file: !382, line: 73, baseType: !99, size: 16, offset: 240)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !718, file: !382, line: 74, baseType: !426, size: 64, offset: 256)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !383, file: !382, line: 1227, baseType: !426, size: 64, offset: 1408)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !383, file: !382, line: 1229, baseType: !486, size: 96, offset: 1472)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !383, file: !382, line: 1230, baseType: !486, size: 96, offset: 1568)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !383, file: !382, line: 1231, baseType: !486, size: 96, offset: 1664)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !383, file: !382, line: 1231, baseType: !486, size: 96, offset: 1760)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !383, file: !382, line: 1233, baseType: !5, size: 32, offset: 1856)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !383, file: !382, line: 1234, baseType: !45, size: 32, offset: 1888)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !383, file: !382, line: 1235, baseType: !5, size: 32, offset: 1920)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !383, file: !382, line: 1237, baseType: !99, size: 16, offset: 1952)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !383, file: !382, line: 1239, baseType: !48, size: 8, offset: 1968)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !383, file: !382, line: 1240, baseType: !739, size: 8, offset: 1976)
!739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 8, elements: !740)
!740 = !{!741}
!741 = !DISubrange(count: 1)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !383, file: !382, line: 1242, baseType: !743, size: 64, offset: 1984)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !424, line: 248, flags: DIFlagFwdDecl)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !383, file: !382, line: 1244, baseType: !746, size: 64, offset: 2048)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !382, line: 59, flags: DIFlagFwdDecl)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !383, file: !382, line: 1246, baseType: !749, size: 64, offset: 2112)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !382, line: 1067, size: 5184, elements: !751)
!751 = !{!752, !782, !783, !798, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !820, !911, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !960, !961, !962, !963, !964, !965, !966, !967, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !1022}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !750, file: !382, line: 1068, baseType: !753, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !382, line: 934, baseType: !755)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !382, line: 925, size: 576, elements: !756)
!756 = !{!757, !773, !774, !775, !776, !778, !781}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !755, file: !382, line: 926, baseType: !758, size: 320)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !382, line: 830, baseType: !759)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !382, line: 813, size: 320, elements: !760)
!760 = !{!761, !764, !767, !768, !770, !771, !772}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !759, file: !382, line: 814, baseType: !762, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !382, line: 51, flags: DIFlagFwdDecl)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !759, file: !382, line: 815, baseType: !765, size: 64, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !382, line: 815, flags: DIFlagFwdDecl)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !759, file: !382, line: 818, baseType: !34, size: 64, offset: 128)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !759, file: !382, line: 819, baseType: !769, size: 32, offset: 192)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 32, elements: !559)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !759, file: !382, line: 822, baseType: !45, size: 32, offset: 224)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !759, file: !382, line: 826, baseType: !45, size: 32, offset: 256)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !759, file: !382, line: 829, baseType: !45, size: 32, offset: 288)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !755, file: !382, line: 928, baseType: !99, size: 16, offset: 320)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !755, file: !382, line: 928, baseType: !99, size: 16, offset: 336)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !755, file: !382, line: 929, baseType: !45, size: 32, offset: 352)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !755, file: !382, line: 930, baseType: !777, size: 64, offset: 384)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !755, file: !382, line: 931, baseType: !779, size: 64, offset: 448)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !382, line: 931, flags: DIFlagFwdDecl)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !755, file: !382, line: 933, baseType: !34, size: 64, offset: 512)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !750, file: !382, line: 1069, baseType: !753, size: 64, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !750, file: !382, line: 1070, baseType: !784, size: 64, offset: 128)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !382, line: 916, baseType: !786)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !382, line: 891, size: 704, elements: !787)
!787 = !{!788, !789, !790, !792, !793, !794, !795, !796, !797}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !786, file: !382, line: 892, baseType: !758, size: 320)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !786, file: !382, line: 896, baseType: !45, size: 32, offset: 320)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !786, file: !382, line: 900, baseType: !791, size: 96, offset: 352)
!791 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 96, elements: !266)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !786, file: !382, line: 903, baseType: !31, size: 32, offset: 448)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !786, file: !382, line: 906, baseType: !45, size: 32, offset: 480)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !786, file: !382, line: 909, baseType: !31, size: 32, offset: 512)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !786, file: !382, line: 912, baseType: !31, size: 32, offset: 544)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !786, file: !382, line: 914, baseType: !426, size: 64, offset: 576)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !786, file: !382, line: 915, baseType: !34, size: 64, offset: 640)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !750, file: !382, line: 1071, baseType: !799, size: 64, offset: 192)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !382, line: 920, baseType: !801)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !382, line: 918, size: 320, elements: !802)
!802 = !{!803}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !801, file: !382, line: 919, baseType: !758, size: 320)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !750, file: !382, line: 1075, baseType: !31, size: 32, offset: 256)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !750, file: !382, line: 1077, baseType: !31, size: 32, offset: 288)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !750, file: !382, line: 1078, baseType: !31, size: 32, offset: 320)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !750, file: !382, line: 1079, baseType: !99, size: 16, offset: 352)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !750, file: !382, line: 1082, baseType: !99, size: 16, offset: 368)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !750, file: !382, line: 1085, baseType: !48, size: 8, offset: 384)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !750, file: !382, line: 1086, baseType: !48, size: 8, offset: 392)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !750, file: !382, line: 1087, baseType: !48, size: 8, offset: 400)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !750, file: !382, line: 1088, baseType: !48, size: 8, offset: 408)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !750, file: !382, line: 1090, baseType: !31, size: 32, offset: 416)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !750, file: !382, line: 1093, baseType: !99, size: 16, offset: 448)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !750, file: !382, line: 1096, baseType: !48, size: 8, offset: 464)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !750, file: !382, line: 1098, baseType: !817, size: 40, offset: 472)
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 40, elements: !818)
!818 = !{!819}
!819 = !DISubrange(count: 5)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !750, file: !382, line: 1101, baseType: !821, size: 832, offset: 512)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !382, line: 836, size: 832, elements: !822)
!822 = !{!823, !824, !825, !826, !827, !828, !830, !831, !832, !907, !908, !909, !910}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !821, file: !382, line: 837, baseType: !758, size: 320)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !821, file: !382, line: 839, baseType: !99, size: 16, offset: 320)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !821, file: !382, line: 839, baseType: !99, size: 16, offset: 336)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !821, file: !382, line: 842, baseType: !99, size: 16, offset: 352)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !821, file: !382, line: 842, baseType: !99, size: 16, offset: 368)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !821, file: !382, line: 843, baseType: !829, size: 32, offset: 384)
!829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 32, elements: !189)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !821, file: !382, line: 845, baseType: !45, size: 32, offset: 416)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !821, file: !382, line: 847, baseType: !34, size: 64, offset: 448)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !821, file: !382, line: 848, baseType: !833, size: 64, offset: 512)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !681, line: 77, size: 15424, elements: !835)
!835 = !{!836, !837, !838, !841, !844, !847, !850, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !899, !900, !901}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !834, file: !681, line: 78, baseType: !386, size: 960)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !834, file: !681, line: 80, baseType: !404, size: 8192, offset: 960)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !834, file: !681, line: 82, baseType: !839, size: 64, offset: 9152)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !681, line: 43, flags: DIFlagFwdDecl)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !834, file: !681, line: 83, baseType: !842, size: 64, offset: 9216)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !90, line: 46, flags: DIFlagFwdDecl)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !834, file: !681, line: 86, baseType: !845, size: 64, offset: 9280)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !681, line: 41, flags: DIFlagFwdDecl)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !834, file: !681, line: 87, baseType: !848, size: 64, offset: 9344)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !681, line: 44, flags: DIFlagFwdDecl)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !834, file: !681, line: 89, baseType: !851, size: 512, offset: 9408)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !848, size: 512, elements: !32)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !834, file: !681, line: 90, baseType: !99, size: 16, offset: 9920)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !834, file: !681, line: 90, baseType: !99, size: 16, offset: 9936)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !834, file: !681, line: 92, baseType: !99, size: 16, offset: 9952)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !834, file: !681, line: 92, baseType: !99, size: 16, offset: 9968)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !834, file: !681, line: 93, baseType: !99, size: 16, offset: 9984)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !834, file: !681, line: 93, baseType: !99, size: 16, offset: 10000)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !834, file: !681, line: 94, baseType: !45, size: 32, offset: 10016)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !834, file: !681, line: 97, baseType: !99, size: 16, offset: 10048)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !834, file: !681, line: 97, baseType: !99, size: 16, offset: 10064)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !834, file: !681, line: 98, baseType: !99, size: 16, offset: 10080)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !834, file: !681, line: 98, baseType: !99, size: 16, offset: 10096)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !834, file: !681, line: 99, baseType: !99, size: 16, offset: 10112)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !834, file: !681, line: 99, baseType: !99, size: 16, offset: 10128)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !834, file: !681, line: 100, baseType: !5, size: 32, offset: 10144)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !834, file: !681, line: 101, baseType: !777, size: 64, offset: 10176)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !834, file: !681, line: 103, baseType: !410, size: 64, offset: 10240)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !834, file: !681, line: 104, baseType: !869, size: 64, offset: 10304)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
