; ModuleID = 'blender/source/blender/editors/space_text/text_autocomplete.c'
source_filename = "blender/source/blender/editors/space_text/text_autocomplete.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "doc_scroll", scope: !2, file: !3, line: 307, type: !42, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !41, globals: !52, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "blender/source/blender/editors/space_text/text_autocomplete.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{!5, !15, !26}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 351, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14}
!9 = !DIEnumerator(name: "OPERATOR_RUNNING_MODAL", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "OPERATOR_CANCELLED", value: 2, isUnsigned: true)
!11 = !DIEnumerator(name: "OPERATOR_FINISHED", value: 4, isUnsigned: true)
!12 = !DIEnumerator(name: "OPERATOR_PASS_THROUGH", value: 8, isUnsigned: true)
!13 = !DIEnumerator(name: "OPERATOR_HANDLED", value: 16, isUnsigned: true)
!14 = !DIEnumerator(name: "OPERATOR_INTERFACE", value: 32, isUnsigned: true)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 361, baseType: !7, size: 32, elements: !17)
!16 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!17 = !{!18, !19, !20, !21, !22, !23, !24, !25}
!18 = !DIEnumerator(name: "RGN_TYPE_WINDOW", value: 0, isUnsigned: true)
!19 = !DIEnumerator(name: "RGN_TYPE_HEADER", value: 1, isUnsigned: true)
!20 = !DIEnumerator(name: "RGN_TYPE_CHANNELS", value: 2, isUnsigned: true)
!21 = !DIEnumerator(name: "RGN_TYPE_TEMPORARY", value: 3, isUnsigned: true)
!22 = !DIEnumerator(name: "RGN_TYPE_UI", value: 4, isUnsigned: true)
!23 = !DIEnumerator(name: "RGN_TYPE_TOOLS", value: 5, isUnsigned: true)
!24 = !DIEnumerator(name: "RGN_TYPE_TOOL_PROPS", value: 6, isUnsigned: true)
!25 = !DIEnumerator(name: "RGN_TYPE_PREVIEW", value: 7, isUnsigned: true)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 46, baseType: !7, size: 32, elements: !28)
!27 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!28 = !{!29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40}
!29 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!30 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!31 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!32 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!33 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!34 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!35 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!36 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!37 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!38 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!39 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!40 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!41 = !{!42, !43, !48, !51}
!42 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_gh_Entry", file: !45, line: 94, size: 192, elements: !46)
!45 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!46 = !{!47, !49, !50}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !44, file: !45, line: 94, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !44, file: !45, line: 94, baseType: !48, size: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !44, file: !45, line: 94, baseType: !48, size: 64, offset: 128)
!51 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!52 = !{!0}
!53 = !{i32 7, !"Dwarf Version", i32 4}
!54 = !{i32 2, !"Debug Info Version", i32 3}
!55 = !{i32 1, !"wchar_size", i32 4}
!56 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!57 = distinct !DISubprogram(name: "text_do_suggest_select", scope: !3, file: !3, line: 53, type: !58, scopeLine: 54, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !1809)
!58 = !DISubroutineType(types: !59)
!59 = !{!42, !60, !229}
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceText", file: !62, line: 856, baseType: !63)
!62 = !DIFile(filename: "blender/source/blender/makesdna/DNA_space_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceText", file: !62, line: 818, size: 5440, elements: !64)
!64 = !{!65, !88, !89, !90, !91, !92, !93, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !210, !211, !212, !213, !217, !218, !219, !220, !224, !225}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !63, file: !62, line: 819, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceLink", file: !62, line: 91, baseType: !68)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !62, line: 85, size: 448, elements: !69)
!69 = !{!70, !72, !73, !80, !81, !83}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !68, file: !62, line: 86, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !68, file: !62, line: 86, baseType: !71, size: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !68, file: !62, line: 87, baseType: !74, size: 128, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !75, line: 71, baseType: !76)
!75 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !75, line: 69, size: 128, elements: !77)
!77 = !{!78, !79}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !76, file: !75, line: 70, baseType: !48, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !76, file: !75, line: 70, baseType: !48, size: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !68, file: !62, line: 88, baseType: !42, size: 32, offset: 256)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !68, file: !62, line: 89, baseType: !82, size: 32, offset: 288)
!82 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !68, file: !62, line: 90, baseType: !84, size: 128, offset: 320)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 128, elements: !86)
!85 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!86 = !{!87}
!87 = !DISubrange(count: 8)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !63, file: !62, line: 819, baseType: !66, size: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !63, file: !62, line: 820, baseType: !74, size: 128, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !63, file: !62, line: 821, baseType: !42, size: 32, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !63, file: !62, line: 822, baseType: !82, size: 32, offset: 288)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !63, file: !62, line: 823, baseType: !84, size: 128, offset: 320)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !63, file: !62, line: 825, baseType: !94, size: 64, offset: 448)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Text", file: !96, line: 50, size: 1664, elements: !97)
!96 = !DIFile(filename: "blender/source/blender/makesdna/DNA_text_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!97 = !{!98, !161, !163, !164, !165, !166, !178, !179, !180, !181, !182, !183, !184, !185}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !95, file: !96, line: 51, baseType: !99, size: 960)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !100, line: 130, baseType: !101)
!100 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !100, line: 117, size: 960, elements: !102)
!102 = !{!103, !104, !105, !107, !127, !131, !132, !133, !134, !135}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !101, file: !100, line: 118, baseType: !48, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !101, file: !100, line: 118, baseType: !48, size: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !101, file: !100, line: 119, baseType: !106, size: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !101, file: !100, line: 120, baseType: !108, size: 64, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !100, line: 136, size: 17600, elements: !110)
!110 = !{!111, !112, !114, !117, !122, !123, !124}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !109, file: !100, line: 137, baseType: !99, size: 960)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !109, file: !100, line: 138, baseType: !113, size: 64, offset: 960)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !109, file: !100, line: 139, baseType: !115, size: 64, offset: 1024)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !100, line: 43, flags: DIFlagFwdDecl)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !109, file: !100, line: 140, baseType: !118, size: 8192, offset: 1088)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 8192, elements: !120)
!119 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!120 = !{!121}
!121 = !DISubrange(count: 1024)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !109, file: !100, line: 141, baseType: !118, size: 8192, offset: 9280)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !109, file: !100, line: 148, baseType: !108, size: 64, offset: 17472)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !109, file: !100, line: 150, baseType: !125, size: 64, offset: 17536)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !100, line: 45, flags: DIFlagFwdDecl)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !101, file: !100, line: 121, baseType: !128, size: 528, offset: 256)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 528, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 66)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !101, file: !100, line: 126, baseType: !85, size: 16, offset: 784)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !101, file: !100, line: 127, baseType: !42, size: 32, offset: 800)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !101, file: !100, line: 128, baseType: !42, size: 32, offset: 832)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !101, file: !100, line: 128, baseType: !42, size: 32, offset: 864)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !101, file: !100, line: 129, baseType: !136, size: 64, offset: 896)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !100, line: 75, baseType: !138)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !100, line: 62, size: 1024, elements: !139)
!139 = !{!140, !142, !143, !144, !145, !146, !150, !151, !159, !160}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !138, file: !100, line: 63, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !138, file: !100, line: 63, baseType: !141, size: 64, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !138, file: !100, line: 64, baseType: !119, size: 8, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !138, file: !100, line: 64, baseType: !119, size: 8, offset: 136)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !138, file: !100, line: 65, baseType: !85, size: 16, offset: 144)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !138, file: !100, line: 66, baseType: !147, size: 512, offset: 160)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 512, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !138, file: !100, line: 67, baseType: !42, size: 32, offset: 672)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !138, file: !100, line: 69, baseType: !152, size: 256, offset: 704)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !100, line: 60, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !100, line: 48, size: 256, elements: !154)
!154 = !{!155, !156, !157, !158}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !153, file: !100, line: 49, baseType: !48, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !153, file: !100, line: 58, baseType: !74, size: 128, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !153, file: !100, line: 59, baseType: !42, size: 32, offset: 192)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !153, file: !100, line: 59, baseType: !42, size: 32, offset: 224)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !138, file: !100, line: 70, baseType: !42, size: 32, offset: 960)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !138, file: !100, line: 74, baseType: !42, size: 32, offset: 992)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !95, file: !96, line: 53, baseType: !162, size: 64, offset: 960)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !95, file: !96, line: 55, baseType: !42, size: 32, offset: 1024)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nlines", scope: !95, file: !96, line: 55, baseType: !42, size: 32, offset: 1056)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "lines", scope: !95, file: !96, line: 57, baseType: !74, size: 128, offset: 1088)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "curl", scope: !95, file: !96, line: 58, baseType: !167, size: 64, offset: 1216)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "TextLine", file: !96, line: 48, baseType: !169)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TextLine", file: !96, line: 42, size: 320, elements: !170)
!170 = !{!171, !173, !174, !175, !176, !177}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !169, file: !96, line: 43, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !169, file: !96, line: 43, baseType: !172, size: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !169, file: !96, line: 45, baseType: !162, size: 64, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !169, file: !96, line: 46, baseType: !162, size: 64, offset: 192)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !169, file: !96, line: 47, baseType: !42, size: 32, offset: 256)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "blen", scope: !169, file: !96, line: 47, baseType: !42, size: 32, offset: 288)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "sell", scope: !95, file: !96, line: 58, baseType: !167, size: 64, offset: 1280)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "curc", scope: !95, file: !96, line: 59, baseType: !42, size: 32, offset: 1344)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "selc", scope: !95, file: !96, line: 59, baseType: !42, size: 32, offset: 1376)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "undo_buf", scope: !95, file: !96, line: 61, baseType: !162, size: 64, offset: 1408)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "undo_pos", scope: !95, file: !96, line: 62, baseType: !42, size: 32, offset: 1472)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "undo_len", scope: !95, file: !96, line: 62, baseType: !42, size: 32, offset: 1504)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "compiled", scope: !95, file: !96, line: 64, baseType: !48, size: 64, offset: 1536)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !95, file: !96, line: 65, baseType: !186, size: 64, offset: 1600)
!186 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !63, file: !62, line: 827, baseType: !42, size: 32, offset: 512)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "viewlines", scope: !63, file: !62, line: 827, baseType: !42, size: 32, offset: 544)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !63, file: !62, line: 828, baseType: !85, size: 16, offset: 576)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "menunr", scope: !63, file: !62, line: 828, baseType: !85, size: 16, offset: 592)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "lheight", scope: !63, file: !62, line: 830, baseType: !85, size: 16, offset: 608)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "cwidth", scope: !63, file: !62, line: 831, baseType: !119, size: 8, offset: 624)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "linenrs_tot", scope: !63, file: !62, line: 831, baseType: !119, size: 8, offset: 632)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !63, file: !62, line: 832, baseType: !42, size: 32, offset: 640)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "showlinenrs", scope: !63, file: !62, line: 833, baseType: !42, size: 32, offset: 672)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "tabnumber", scope: !63, file: !62, line: 834, baseType: !42, size: 32, offset: 704)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "showsyntax", scope: !63, file: !62, line: 836, baseType: !85, size: 16, offset: 736)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "line_hlight", scope: !63, file: !62, line: 837, baseType: !85, size: 16, offset: 752)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "overwrite", scope: !63, file: !62, line: 838, baseType: !85, size: 16, offset: 768)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "live_edit", scope: !63, file: !62, line: 839, baseType: !85, size: 16, offset: 784)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "pix_per_line", scope: !63, file: !62, line: 840, baseType: !82, size: 32, offset: 800)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "txtscroll", scope: !63, file: !62, line: 842, baseType: !203, size: 128, offset: 832)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !204, line: 86, size: 128, elements: !205)
!204 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!205 = !{!206, !207, !208, !209}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !203, file: !204, line: 87, baseType: !42, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !203, file: !204, line: 87, baseType: !42, size: 32, offset: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !203, file: !204, line: 88, baseType: !42, size: 32, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !203, file: !204, line: 88, baseType: !42, size: 32, offset: 96)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "txtbar", scope: !63, file: !62, line: 842, baseType: !203, size: 128, offset: 960)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "wordwrap", scope: !63, file: !62, line: 844, baseType: !42, size: 32, offset: 1088)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "doplugins", scope: !63, file: !62, line: 844, baseType: !42, size: 32, offset: 1120)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "findstr", scope: !63, file: !62, line: 846, baseType: !214, size: 2048, offset: 1152)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 2048, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 256)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "replacestr", scope: !63, file: !62, line: 847, baseType: !214, size: 2048, offset: 3200)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "margin_column", scope: !63, file: !62, line: 849, baseType: !85, size: 16, offset: 5248)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "lheight_dpi", scope: !63, file: !62, line: 850, baseType: !85, size: 16, offset: 5264)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !63, file: !62, line: 851, baseType: !221, size: 32, offset: 5280)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 32, elements: !222)
!222 = !{!223}
!223 = !DISubrange(count: 4)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "drawcache", scope: !63, file: !62, line: 853, baseType: !48, size: 64, offset: 5312)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_accum", scope: !63, file: !62, line: 855, baseType: !226, size: 64, offset: 5376)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 64, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 2)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "ARegion", file: !16, line: 267, baseType: !231)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !16, line: 230, size: 3072, elements: !232)
!232 = !{!233, !235, !236, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !231, file: !16, line: 231, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !231, file: !16, line: 231, baseType: !234, size: 64, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !231, file: !16, line: 233, baseType: !237, size: 1280, offset: 128)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "View2D", file: !238, line: 71, baseType: !239)
!238 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view2d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View2D", file: !238, line: 40, size: 1280, elements: !240)
!240 = !{!241, !249, !250, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !272, !273, !274, !277}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !239, file: !238, line: 41, baseType: !242, size: 128)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !204, line: 95, baseType: !243)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !204, line: 92, size: 128, elements: !244)
!244 = !{!245, !246, !247, !248}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !243, file: !204, line: 93, baseType: !82, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !243, file: !204, line: 93, baseType: !82, size: 32, offset: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !243, file: !204, line: 94, baseType: !82, size: 32, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !243, file: !204, line: 94, baseType: !82, size: 32, offset: 96)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !239, file: !238, line: 41, baseType: !242, size: 128, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "vert", scope: !239, file: !238, line: 42, baseType: !251, size: 128, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !204, line: 89, baseType: !203)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "hor", scope: !239, file: !238, line: 42, baseType: !251, size: 128, offset: 384)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !239, file: !238, line: 43, baseType: !251, size: 128, offset: 512)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !239, file: !238, line: 45, baseType: !226, size: 64, offset: 640)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !239, file: !238, line: 45, baseType: !226, size: 64, offset: 704)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "minzoom", scope: !239, file: !238, line: 46, baseType: !82, size: 32, offset: 768)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "maxzoom", scope: !239, file: !238, line: 46, baseType: !82, size: 32, offset: 800)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !239, file: !238, line: 48, baseType: !85, size: 16, offset: 832)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_ui", scope: !239, file: !238, line: 49, baseType: !85, size: 16, offset: 848)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "keeptot", scope: !239, file: !238, line: 51, baseType: !85, size: 16, offset: 864)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "keepzoom", scope: !239, file: !238, line: 52, baseType: !85, size: 16, offset: 880)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "keepofs", scope: !239, file: !238, line: 53, baseType: !85, size: 16, offset: 896)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !239, file: !238, line: 55, baseType: !85, size: 16, offset: 912)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !239, file: !238, line: 56, baseType: !85, size: 16, offset: 928)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !239, file: !238, line: 58, baseType: !85, size: 16, offset: 944)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !239, file: !238, line: 58, baseType: !85, size: 16, offset: 960)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "oldwinx", scope: !239, file: !238, line: 59, baseType: !85, size: 16, offset: 976)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "oldwiny", scope: !239, file: !238, line: 59, baseType: !85, size: 16, offset: 992)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !239, file: !238, line: 61, baseType: !85, size: 16, offset: 1008)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "tab_offset", scope: !239, file: !238, line: 63, baseType: !271, size: 64, offset: 1024)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "tab_num", scope: !239, file: !238, line: 64, baseType: !42, size: 32, offset: 1088)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tab_cur", scope: !239, file: !238, line: 65, baseType: !42, size: 32, offset: 1120)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "sms", scope: !239, file: !238, line: 68, baseType: !275, size: 64, offset: 1152)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmoothView2DStore", file: !238, line: 68, flags: DIFlagFwdDecl)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_timer", scope: !239, file: !238, line: 69, baseType: !278, size: 64, offset: 1216)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !280, line: 490, size: 768, elements: !281)
!280 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!281 = !{!282, !283, !284, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !279, file: !280, line: 491, baseType: !278, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !279, file: !280, line: 491, baseType: !278, size: 64, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !279, file: !280, line: 493, baseType: !285, size: 64, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !6, line: 169, size: 2048, elements: !287)
!287 = !{!288, !289, !290, !291, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1548, !1551, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !286, file: !6, line: 170, baseType: !285, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !286, file: !6, line: 170, baseType: !285, size: 64, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !286, file: !6, line: 172, baseType: !48, size: 64, offset: 128)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !286, file: !6, line: 174, baseType: !292, size: 64, offset: 192)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !16, line: 49, size: 1984, elements: !294)
!294 = !{!295, !296, !297, !298, !299, !300, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !293, file: !16, line: 50, baseType: !99, size: 960)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !293, file: !16, line: 52, baseType: !74, size: 128, offset: 960)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !293, file: !16, line: 53, baseType: !74, size: 128, offset: 1088)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !293, file: !16, line: 54, baseType: !74, size: 128, offset: 1216)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !293, file: !16, line: 55, baseType: !74, size: 128, offset: 1344)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !293, file: !16, line: 57, baseType: !301, size: 64, offset: 1472)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !303, line: 1216, size: 39680, elements: !304)
!303 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!304 = !{!305, !306, !310, !314, !317, !318, !319, !331, !332, !336, !337, !338, !339, !340, !341, !342, !343, !344, !348, !417, !845, !1060, !1063, !1342, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1364, !1365, !1366, !1367, !1368, !1376, !1443, !1450, !1451, !1458, !1459, !1465, !1466, !1467, !1468, !1469}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !302, file: !303, line: 1217, baseType: !99, size: 960)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !302, file: !303, line: 1218, baseType: !307, size: 64, offset: 960)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !309, line: 43, flags: DIFlagFwdDecl)
!309 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!310 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !302, file: !303, line: 1220, baseType: !311, size: 64, offset: 1024)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !313, line: 44, flags: DIFlagFwdDecl)
!313 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!314 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !302, file: !303, line: 1221, baseType: !315, size: 64, offset: 1088)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !303, line: 52, flags: DIFlagFwdDecl)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !302, file: !303, line: 1223, baseType: !301, size: 64, offset: 1152)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !302, file: !303, line: 1225, baseType: !74, size: 128, offset: 1216)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !302, file: !303, line: 1226, baseType: !320, size: 64, offset: 1344)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !303, line: 69, size: 320, elements: !322)
!322 = !{!323, !324, !325, !326, !327, !328, !329, !330}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !321, file: !303, line: 70, baseType: !320, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !321, file: !303, line: 70, baseType: !320, size: 64, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !321, file: !303, line: 71, baseType: !7, size: 32, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !321, file: !303, line: 71, baseType: !7, size: 32, offset: 160)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !321, file: !303, line: 72, baseType: !42, size: 32, offset: 192)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !321, file: !303, line: 73, baseType: !85, size: 16, offset: 224)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !321, file: !303, line: 73, baseType: !85, size: 16, offset: 240)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !321, file: !303, line: 74, baseType: !311, size: 64, offset: 256)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !302, file: !303, line: 1227, baseType: !311, size: 64, offset: 1408)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !302, file: !303, line: 1229, baseType: !333, size: 96, offset: 1472)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 96, elements: !334)
!334 = !{!335}
!335 = !DISubrange(count: 3)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !302, file: !303, line: 1230, baseType: !333, size: 96, offset: 1568)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !302, file: !303, line: 1231, baseType: !333, size: 96, offset: 1664)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !302, file: !303, line: 1231, baseType: !333, size: 96, offset: 1760)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !302, file: !303, line: 1233, baseType: !7, size: 32, offset: 1856)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !302, file: !303, line: 1234, baseType: !42, size: 32, offset: 1888)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !302, file: !303, line: 1235, baseType: !7, size: 32, offset: 1920)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !302, file: !303, line: 1237, baseType: !85, size: 16, offset: 1952)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !302, file: !303, line: 1239, baseType: !119, size: 8, offset: 1968)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !302, file: !303, line: 1240, baseType: !345, size: 8, offset: 1976)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 8, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 1)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !302, file: !303, line: 1242, baseType: !349, size: 64, offset: 1984)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !351, line: 328, size: 3456, elements: !352)
!351 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!352 = !{!353, !354, !355, !358, !359, !363, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !388, !393, !394, !397, !401, !405, !409, !413, !414, !415, !416}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !350, file: !351, line: 329, baseType: !99, size: 960)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !350, file: !351, line: 330, baseType: !307, size: 64, offset: 960)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !350, file: !351, line: 332, baseType: !356, size: 64, offset: 1024)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !351, line: 332, flags: DIFlagFwdDecl)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !350, file: !351, line: 333, baseType: !147, size: 512, offset: 1088)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !350, file: !351, line: 335, baseType: !360, size: 64, offset: 1600)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !362, line: 41, flags: DIFlagFwdDecl)
!362 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!363 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !350, file: !351, line: 337, baseType: !364, size: 64, offset: 1664)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !366, line: 45, flags: DIFlagFwdDecl)
!366 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!367 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !350, file: !351, line: 338, baseType: !226, size: 64, offset: 1728)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !350, file: !351, line: 340, baseType: !74, size: 128, offset: 1792)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !350, file: !351, line: 340, baseType: !74, size: 128, offset: 1920)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !350, file: !351, line: 342, baseType: !42, size: 32, offset: 2048)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !350, file: !351, line: 342, baseType: !42, size: 32, offset: 2080)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !350, file: !351, line: 343, baseType: !42, size: 32, offset: 2112)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !350, file: !351, line: 345, baseType: !42, size: 32, offset: 2144)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !350, file: !351, line: 346, baseType: !42, size: 32, offset: 2176)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !350, file: !351, line: 347, baseType: !85, size: 16, offset: 2208)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !350, file: !351, line: 348, baseType: !85, size: 16, offset: 2224)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !350, file: !351, line: 349, baseType: !42, size: 32, offset: 2240)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !350, file: !351, line: 351, baseType: !42, size: 32, offset: 2272)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !350, file: !351, line: 353, baseType: !85, size: 16, offset: 2304)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !350, file: !351, line: 354, baseType: !85, size: 16, offset: 2320)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !350, file: !351, line: 355, baseType: !42, size: 32, offset: 2336)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !350, file: !351, line: 357, baseType: !242, size: 128, offset: 2368)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !350, file: !351, line: 363, baseType: !74, size: 128, offset: 2496)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !350, file: !351, line: 363, baseType: !74, size: 128, offset: 2624)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !350, file: !351, line: 368, baseType: !386, size: 64, offset: 2752)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !351, line: 48, flags: DIFlagFwdDecl)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !350, file: !351, line: 372, baseType: !389, size: 32, offset: 2816)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !351, line: 274, baseType: !390)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !351, line: 271, size: 32, elements: !391)
!391 = !{!392}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !390, file: !351, line: 273, baseType: !7, size: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !350, file: !351, line: 373, baseType: !42, size: 32, offset: 2848)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !350, file: !351, line: 382, baseType: !395, size: 64, offset: 2880)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !351, line: 46, flags: DIFlagFwdDecl)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !350, file: !351, line: 385, baseType: !398, size: 64, offset: 2944)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DISubroutineType(types: !400)
!400 = !{null, !48, !82}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !350, file: !351, line: 386, baseType: !402, size: 64, offset: 3008)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DISubroutineType(types: !404)
!404 = !{null, !48, !162}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !350, file: !351, line: 387, baseType: !406, size: 64, offset: 3072)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{!42, !48}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !350, file: !351, line: 388, baseType: !410, size: 64, offset: 3136)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DISubroutineType(types: !412)
!412 = !{null, !48}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !350, file: !351, line: 389, baseType: !48, size: 64, offset: 3200)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !350, file: !351, line: 389, baseType: !48, size: 64, offset: 3264)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !350, file: !351, line: 389, baseType: !48, size: 64, offset: 3328)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !350, file: !351, line: 389, baseType: !48, size: 64, offset: 3392)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !302, file: !303, line: 1244, baseType: !418, size: 64, offset: 2048)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !420, line: 200, size: 17024, elements: !421)
!420 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!421 = !{!422, !424, !425, !426, !838, !839, !840, !841, !842, !843, !844}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !419, file: !420, line: 201, baseType: !423, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !419, file: !420, line: 202, baseType: !74, size: 128, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !419, file: !420, line: 203, baseType: !74, size: 128, offset: 192)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !419, file: !420, line: 206, baseType: !427, size: 64, offset: 320)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !420, line: 190, baseType: !429)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !420, line: 126, size: 2816, elements: !430)
!430 = !{!431, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !527, !530, !531, !532, !810, !813, !814, !815, !816, !817, !818, !819, !820, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !837}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !429, file: !420, line: 127, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !429, file: !420, line: 127, baseType: !432, size: 64, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !429, file: !420, line: 128, baseType: !48, size: 64, offset: 128)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !429, file: !420, line: 129, baseType: !48, size: 64, offset: 192)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !429, file: !420, line: 130, baseType: !147, size: 512, offset: 256)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !429, file: !420, line: 132, baseType: !42, size: 32, offset: 768)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !429, file: !420, line: 132, baseType: !42, size: 32, offset: 800)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !429, file: !420, line: 133, baseType: !42, size: 32, offset: 832)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !429, file: !420, line: 134, baseType: !42, size: 32, offset: 864)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !429, file: !420, line: 134, baseType: !42, size: 32, offset: 896)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !429, file: !420, line: 134, baseType: !42, size: 32, offset: 928)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !429, file: !420, line: 135, baseType: !42, size: 32, offset: 960)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !429, file: !420, line: 135, baseType: !42, size: 32, offset: 992)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !429, file: !420, line: 136, baseType: !42, size: 32, offset: 1024)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !429, file: !420, line: 136, baseType: !42, size: 32, offset: 1056)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !429, file: !420, line: 137, baseType: !42, size: 32, offset: 1088)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !429, file: !420, line: 137, baseType: !42, size: 32, offset: 1120)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !429, file: !420, line: 138, baseType: !82, size: 32, offset: 1152)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !429, file: !420, line: 139, baseType: !82, size: 32, offset: 1184)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !429, file: !420, line: 139, baseType: !82, size: 32, offset: 1216)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !429, file: !420, line: 141, baseType: !85, size: 16, offset: 1248)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !429, file: !420, line: 142, baseType: !85, size: 16, offset: 1264)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !429, file: !420, line: 143, baseType: !42, size: 32, offset: 1280)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !429, file: !420, line: 144, baseType: !42, size: 32, offset: 1312)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !429, file: !420, line: 146, baseType: !457, size: 64, offset: 1344)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !420, line: 114, baseType: !459)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !420, line: 99, size: 7232, elements: !460)
!460 = !{!461, !463, !464, !465, !466, !467, !468, !476, !480, !495, !504, !511, !521}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !459, file: !420, line: 100, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !459, file: !420, line: 100, baseType: !462, size: 64, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !459, file: !420, line: 101, baseType: !42, size: 32, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !459, file: !420, line: 101, baseType: !42, size: 32, offset: 160)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !459, file: !420, line: 102, baseType: !42, size: 32, offset: 192)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !459, file: !420, line: 102, baseType: !42, size: 32, offset: 224)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !459, file: !420, line: 103, baseType: !469, size: 64, offset: 256)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !420, line: 59, baseType: !471)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !420, line: 56, size: 2112, elements: !472)
!472 = !{!473, !474, !475}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !471, file: !420, line: 57, baseType: !214, size: 2048)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !471, file: !420, line: 58, baseType: !42, size: 32, offset: 2048)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !471, file: !420, line: 58, baseType: !42, size: 32, offset: 2080)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !459, file: !420, line: 106, baseType: !477, size: 6144, offset: 320)
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 6144, elements: !478)
!478 = !{!479}
!479 = !DISubrange(count: 768)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !459, file: !420, line: 107, baseType: !481, size: 64, offset: 6464)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !420, line: 97, baseType: !483)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !420, line: 83, size: 8320, elements: !484)
!484 = !{!485, !486, !487, !491, !492, !493, !494}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !483, file: !420, line: 84, baseType: !477, size: 6144)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !483, file: !420, line: 87, baseType: !214, size: 2048, offset: 6144)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !483, file: !420, line: 88, baseType: !488, size: 64, offset: 8192)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !490, line: 41, flags: DIFlagFwdDecl)
!490 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!491 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !483, file: !420, line: 90, baseType: !85, size: 16, offset: 8256)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !483, file: !420, line: 92, baseType: !85, size: 16, offset: 8272)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !483, file: !420, line: 93, baseType: !85, size: 16, offset: 8288)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !483, file: !420, line: 95, baseType: !85, size: 16, offset: 8304)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !459, file: !420, line: 108, baseType: !496, size: 64, offset: 6528)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !420, line: 66, baseType: !498)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !420, line: 61, size: 128, elements: !499)
!499 = !{!500, !501, !502, !503}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !498, file: !420, line: 62, baseType: !42, size: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !498, file: !420, line: 63, baseType: !42, size: 32, offset: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !498, file: !420, line: 64, baseType: !42, size: 32, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !498, file: !420, line: 65, baseType: !42, size: 32, offset: 96)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !459, file: !420, line: 109, baseType: !505, size: 64, offset: 6592)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !420, line: 71, baseType: !507)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !420, line: 68, size: 64, elements: !508)
!508 = !{!509, !510}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !507, file: !420, line: 69, baseType: !42, size: 32)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !507, file: !420, line: 70, baseType: !42, size: 32, offset: 32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !459, file: !420, line: 110, baseType: !512, size: 64, offset: 6656)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !420, line: 81, baseType: !514)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !420, line: 73, size: 352, elements: !515)
!515 = !{!516, !517, !518, !519, !520}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !514, file: !420, line: 74, baseType: !333, size: 96)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !514, file: !420, line: 75, baseType: !333, size: 96, offset: 96)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !514, file: !420, line: 76, baseType: !333, size: 96, offset: 192)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !514, file: !420, line: 77, baseType: !42, size: 32, offset: 288)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !514, file: !420, line: 78, baseType: !42, size: 32, offset: 320)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !459, file: !420, line: 113, baseType: !522, size: 512, offset: 6720)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !523, line: 182, baseType: !524)
!523 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !523, line: 180, size: 512, elements: !525)
!525 = !{!526}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !524, file: !523, line: 181, baseType: !147, size: 512)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !429, file: !420, line: 148, baseType: !528, size: 64, offset: 1408)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !420, line: 49, flags: DIFlagFwdDecl)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !429, file: !420, line: 151, baseType: !301, size: 64, offset: 1472)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !429, file: !420, line: 152, baseType: !311, size: 64, offset: 1536)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !429, file: !420, line: 153, baseType: !533, size: 64, offset: 1600)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !309, line: 64, size: 19136, elements: !535)
!535 = !{!536, !537, !538, !539, !540, !541, !543, !544, !545, !546, !549, !550, !796, !797, !805, !806, !807, !808, !809}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !534, file: !309, line: 65, baseType: !99, size: 960)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !534, file: !309, line: 66, baseType: !307, size: 64, offset: 960)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !534, file: !309, line: 68, baseType: !118, size: 8192, offset: 1024)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !534, file: !309, line: 70, baseType: !42, size: 32, offset: 9216)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !534, file: !309, line: 71, baseType: !42, size: 32, offset: 9248)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !534, file: !309, line: 72, baseType: !542, size: 64, offset: 9280)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 64, elements: !227)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !534, file: !309, line: 74, baseType: !82, size: 32, offset: 9344)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !534, file: !309, line: 74, baseType: !82, size: 32, offset: 9376)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !534, file: !309, line: 76, baseType: !488, size: 64, offset: 9408)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !534, file: !309, line: 77, baseType: !547, size: 64, offset: 9472)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !309, line: 77, flags: DIFlagFwdDecl)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !534, file: !309, line: 78, baseType: !364, size: 64, offset: 9536)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !534, file: !309, line: 80, baseType: !551, size: 2624, offset: 9600)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !366, line: 340, size: 2624, elements: !552)
!552 = !{!553, !581, !599, !600, !601, !618, !676, !677, !776, !777, !778, !779, !785}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !551, file: !366, line: 341, baseType: !554, size: 576)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !366, line: 251, baseType: !555)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !366, line: 207, size: 576, elements: !556)
!556 = !{!557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !555, file: !366, line: 208, baseType: !42, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !555, file: !366, line: 211, baseType: !85, size: 16, offset: 32)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !555, file: !366, line: 212, baseType: !85, size: 16, offset: 48)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !555, file: !366, line: 213, baseType: !82, size: 32, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !555, file: !366, line: 214, baseType: !85, size: 16, offset: 96)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !555, file: !366, line: 215, baseType: !85, size: 16, offset: 112)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !555, file: !366, line: 216, baseType: !85, size: 16, offset: 128)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !555, file: !366, line: 217, baseType: !85, size: 16, offset: 144)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !555, file: !366, line: 218, baseType: !85, size: 16, offset: 160)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !555, file: !366, line: 219, baseType: !85, size: 16, offset: 176)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !555, file: !366, line: 220, baseType: !82, size: 32, offset: 192)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !555, file: !366, line: 222, baseType: !85, size: 16, offset: 224)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !555, file: !366, line: 225, baseType: !85, size: 16, offset: 240)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !555, file: !366, line: 228, baseType: !42, size: 32, offset: 256)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !555, file: !366, line: 229, baseType: !42, size: 32, offset: 288)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !555, file: !366, line: 233, baseType: !42, size: 32, offset: 320)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !555, file: !366, line: 236, baseType: !85, size: 16, offset: 352)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !555, file: !366, line: 236, baseType: !85, size: 16, offset: 368)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !555, file: !366, line: 241, baseType: !82, size: 32, offset: 384)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !555, file: !366, line: 244, baseType: !42, size: 32, offset: 416)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !555, file: !366, line: 244, baseType: !42, size: 32, offset: 448)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !555, file: !366, line: 245, baseType: !82, size: 32, offset: 480)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !555, file: !366, line: 248, baseType: !82, size: 32, offset: 512)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !555, file: !366, line: 250, baseType: !42, size: 32, offset: 544)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !551, file: !366, line: 342, baseType: !582, size: 448, offset: 576)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !366, line: 79, baseType: !583)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !366, line: 61, size: 448, elements: !584)
!584 = !{!585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !583, file: !366, line: 62, baseType: !48, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !583, file: !366, line: 64, baseType: !85, size: 16, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !583, file: !366, line: 65, baseType: !85, size: 16, offset: 80)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !583, file: !366, line: 67, baseType: !82, size: 32, offset: 96)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !583, file: !366, line: 68, baseType: !82, size: 32, offset: 128)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !583, file: !366, line: 69, baseType: !82, size: 32, offset: 160)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !583, file: !366, line: 70, baseType: !85, size: 16, offset: 192)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !583, file: !366, line: 71, baseType: !85, size: 16, offset: 208)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !583, file: !366, line: 72, baseType: !226, size: 64, offset: 224)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !583, file: !366, line: 75, baseType: !82, size: 32, offset: 288)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !583, file: !366, line: 75, baseType: !82, size: 32, offset: 320)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !583, file: !366, line: 75, baseType: !82, size: 32, offset: 352)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !583, file: !366, line: 78, baseType: !82, size: 32, offset: 384)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !583, file: !366, line: 78, baseType: !82, size: 32, offset: 416)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !551, file: !366, line: 343, baseType: !74, size: 128, offset: 1024)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !551, file: !366, line: 344, baseType: !74, size: 128, offset: 1152)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !551, file: !366, line: 345, baseType: !602, size: 192, offset: 1280)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !366, line: 278, baseType: !603)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !366, line: 270, size: 192, elements: !604)
!604 = !{!605, !606, !607, !608, !609}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !603, file: !366, line: 271, baseType: !42, size: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !603, file: !366, line: 273, baseType: !82, size: 32, offset: 32)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !603, file: !366, line: 275, baseType: !42, size: 32, offset: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !603, file: !366, line: 276, baseType: !42, size: 32, offset: 96)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !603, file: !366, line: 277, baseType: !610, size: 64, offset: 128)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !366, line: 55, size: 576, elements: !612)
!612 = !{!613, !614, !615}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !611, file: !366, line: 56, baseType: !42, size: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !611, file: !366, line: 57, baseType: !82, size: 32, offset: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !611, file: !366, line: 58, baseType: !616, size: 512, offset: 64)
!616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 512, elements: !617)
!617 = !{!223, !223}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !551, file: !366, line: 346, baseType: !619, size: 384, offset: 1472)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !366, line: 268, baseType: !620)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !366, line: 253, size: 384, elements: !621)
!621 = !{!622, !623, !624, !625, !626, !670, !671, !672, !673, !674, !675}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !620, file: !366, line: 254, baseType: !42, size: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !620, file: !366, line: 255, baseType: !42, size: 32, offset: 32)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !620, file: !366, line: 255, baseType: !42, size: 32, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !620, file: !366, line: 258, baseType: !82, size: 32, offset: 96)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !620, file: !366, line: 259, baseType: !627, size: 64, offset: 128)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !366, line: 164, baseType: !629)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !366, line: 108, size: 1664, elements: !630)
!630 = !{!631, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !629, file: !366, line: 109, baseType: !632, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !629, file: !366, line: 109, baseType: !632, size: 64, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !629, file: !366, line: 111, baseType: !147, size: 512, offset: 128)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !629, file: !366, line: 119, baseType: !226, size: 64, offset: 640)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !629, file: !366, line: 119, baseType: !226, size: 64, offset: 704)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !629, file: !366, line: 125, baseType: !226, size: 64, offset: 768)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !629, file: !366, line: 125, baseType: !226, size: 64, offset: 832)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !629, file: !366, line: 127, baseType: !226, size: 64, offset: 896)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !629, file: !366, line: 130, baseType: !42, size: 32, offset: 960)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !629, file: !366, line: 131, baseType: !42, size: 32, offset: 992)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !629, file: !366, line: 132, baseType: !643, size: 64, offset: 1024)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !366, line: 106, baseType: !645)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !366, line: 81, size: 512, elements: !646)
!646 = !{!647, !648, !651, !652, !653, !654}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !645, file: !366, line: 82, baseType: !226, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !645, file: !366, line: 97, baseType: !649, size: 256, offset: 64)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 256, elements: !650)
!650 = !{!223, !228}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !645, file: !366, line: 102, baseType: !226, size: 64, offset: 320)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !645, file: !366, line: 102, baseType: !226, size: 64, offset: 384)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !645, file: !366, line: 104, baseType: !42, size: 32, offset: 448)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !645, file: !366, line: 105, baseType: !42, size: 32, offset: 480)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !629, file: !366, line: 135, baseType: !333, size: 96, offset: 1088)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !629, file: !366, line: 136, baseType: !82, size: 32, offset: 1184)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !629, file: !366, line: 139, baseType: !42, size: 32, offset: 1216)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !629, file: !366, line: 139, baseType: !42, size: 32, offset: 1248)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !629, file: !366, line: 139, baseType: !42, size: 32, offset: 1280)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !629, file: !366, line: 140, baseType: !333, size: 96, offset: 1312)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !629, file: !366, line: 143, baseType: !85, size: 16, offset: 1408)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !629, file: !366, line: 144, baseType: !85, size: 16, offset: 1424)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !629, file: !366, line: 145, baseType: !85, size: 16, offset: 1440)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !629, file: !366, line: 148, baseType: !85, size: 16, offset: 1456)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !629, file: !366, line: 149, baseType: !42, size: 32, offset: 1472)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !629, file: !366, line: 150, baseType: !82, size: 32, offset: 1504)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !629, file: !366, line: 152, baseType: !364, size: 64, offset: 1536)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !629, file: !366, line: 163, baseType: !82, size: 32, offset: 1600)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !629, file: !366, line: 163, baseType: !82, size: 32, offset: 1632)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !620, file: !366, line: 261, baseType: !82, size: 32, offset: 192)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !620, file: !366, line: 261, baseType: !82, size: 32, offset: 224)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !620, file: !366, line: 261, baseType: !82, size: 32, offset: 256)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !620, file: !366, line: 263, baseType: !42, size: 32, offset: 288)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !620, file: !366, line: 266, baseType: !42, size: 32, offset: 320)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !620, file: !366, line: 267, baseType: !82, size: 32, offset: 352)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !551, file: !366, line: 347, baseType: !627, size: 64, offset: 1856)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !551, file: !366, line: 348, baseType: !678, size: 64, offset: 1920)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !366, line: 205, baseType: !680)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !366, line: 186, size: 1024, elements: !681)
!681 = !{!682, !684, !685, !686, !688, !689, !690, !698, !699, !700, !774, !775}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !680, file: !366, line: 187, baseType: !683, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !680, file: !366, line: 187, baseType: !683, size: 64, offset: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !680, file: !366, line: 189, baseType: !147, size: 512, offset: 128)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !680, file: !366, line: 191, baseType: !687, size: 64, offset: 640)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !680, file: !366, line: 193, baseType: !42, size: 32, offset: 704)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !680, file: !366, line: 193, baseType: !42, size: 32, offset: 736)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !680, file: !366, line: 195, baseType: !691, size: 64, offset: 768)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !366, line: 184, baseType: !693)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !366, line: 166, size: 320, elements: !694)
!694 = !{!695, !696, !697}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !693, file: !366, line: 180, baseType: !649, size: 256)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !693, file: !366, line: 182, baseType: !42, size: 32, offset: 256)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !693, file: !366, line: 183, baseType: !42, size: 32, offset: 288)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !680, file: !366, line: 196, baseType: !42, size: 32, offset: 832)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !680, file: !366, line: 198, baseType: !42, size: 32, offset: 864)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !680, file: !366, line: 200, baseType: !701, size: 64, offset: 896)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !490, line: 77, size: 15424, elements: !703)
!703 = !{!704, !705, !706, !709, !712, !713, !716, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !734, !735, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !760, !761, !762, !763, !764, !768}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !702, file: !490, line: 78, baseType: !99, size: 960)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !702, file: !490, line: 80, baseType: !118, size: 8192, offset: 960)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !702, file: !490, line: 82, baseType: !707, size: 64, offset: 9152)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !490, line: 43, flags: DIFlagFwdDecl)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !702, file: !490, line: 83, baseType: !710, size: 64, offset: 9216)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !100, line: 46, flags: DIFlagFwdDecl)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !702, file: !490, line: 86, baseType: !488, size: 64, offset: 9280)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !702, file: !490, line: 87, baseType: !714, size: 64, offset: 9344)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !490, line: 44, flags: DIFlagFwdDecl)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !702, file: !490, line: 89, baseType: !717, size: 512, offset: 9408)
!717 = !DICompositeType(tag: DW_TAG_array_type, baseType: !714, size: 512, elements: !86)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !702, file: !490, line: 90, baseType: !85, size: 16, offset: 9920)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !702, file: !490, line: 90, baseType: !85, size: 16, offset: 9936)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !702, file: !490, line: 92, baseType: !85, size: 16, offset: 9952)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !702, file: !490, line: 92, baseType: !85, size: 16, offset: 9968)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !702, file: !490, line: 93, baseType: !85, size: 16, offset: 9984)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !702, file: !490, line: 93, baseType: !85, size: 16, offset: 10000)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !702, file: !490, line: 94, baseType: !42, size: 32, offset: 10016)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !702, file: !490, line: 97, baseType: !85, size: 16, offset: 10048)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !702, file: !490, line: 97, baseType: !85, size: 16, offset: 10064)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !702, file: !490, line: 98, baseType: !85, size: 16, offset: 10080)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !702, file: !490, line: 98, baseType: !85, size: 16, offset: 10096)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !702, file: !490, line: 99, baseType: !85, size: 16, offset: 10112)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !702, file: !490, line: 99, baseType: !85, size: 16, offset: 10128)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !702, file: !490, line: 100, baseType: !7, size: 32, offset: 10144)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !702, file: !490, line: 101, baseType: !733, size: 64, offset: 10176)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !702, file: !490, line: 103, baseType: !125, size: 64, offset: 10240)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !702, file: !490, line: 104, baseType: !736, size: 64, offset: 10304)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !100, line: 159, size: 448, elements: !738)
!738 = !{!739, !741, !742, !744, !745, !747}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !737, file: !100, line: 161, baseType: !740, size: 64)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !227)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !737, file: !100, line: 162, baseType: !740, size: 64, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !737, file: !100, line: 163, baseType: !743, size: 32, offset: 128)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 32, elements: !227)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !737, file: !100, line: 164, baseType: !743, size: 32, offset: 160)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !737, file: !100, line: 165, baseType: !746, size: 128, offset: 192)
!746 = !DICompositeType(tag: DW_TAG_array_type, baseType: !733, size: 128, elements: !227)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !737, file: !100, line: 166, baseType: !748, size: 128, offset: 320)
!748 = !DICompositeType(tag: DW_TAG_array_type, baseType: !710, size: 128, elements: !227)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !702, file: !490, line: 107, baseType: !82, size: 32, offset: 10368)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !702, file: !490, line: 108, baseType: !42, size: 32, offset: 10400)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !702, file: !490, line: 109, baseType: !85, size: 16, offset: 10432)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !702, file: !490, line: 110, baseType: !85, size: 16, offset: 10448)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !702, file: !490, line: 113, baseType: !42, size: 32, offset: 10464)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !702, file: !490, line: 113, baseType: !42, size: 32, offset: 10496)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !702, file: !490, line: 114, baseType: !119, size: 8, offset: 10528)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !702, file: !490, line: 114, baseType: !119, size: 8, offset: 10536)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !702, file: !490, line: 115, baseType: !85, size: 16, offset: 10544)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !702, file: !490, line: 116, baseType: !759, size: 128, offset: 10560)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 128, elements: !222)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !702, file: !490, line: 119, baseType: !82, size: 32, offset: 10688)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !702, file: !490, line: 119, baseType: !82, size: 32, offset: 10720)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !702, file: !490, line: 122, baseType: !522, size: 512, offset: 10752)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !702, file: !490, line: 123, baseType: !119, size: 8, offset: 11264)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !702, file: !490, line: 125, baseType: !765, size: 56, offset: 11272)
!765 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 56, elements: !766)
!766 = !{!767}
!767 = !DISubrange(count: 7)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !702, file: !490, line: 126, baseType: !769, size: 4096, offset: 11328)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !770, size: 4096, elements: !86)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !490, line: 69, baseType: !771)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !490, line: 67, size: 512, elements: !772)
!772 = !{!773}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !771, file: !490, line: 68, baseType: !147, size: 512)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !680, file: !366, line: 201, baseType: !82, size: 32, offset: 960)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !680, file: !366, line: 204, baseType: !42, size: 32, offset: 992)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !551, file: !366, line: 350, baseType: !74, size: 128, offset: 1984)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !551, file: !366, line: 351, baseType: !42, size: 32, offset: 2112)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !551, file: !366, line: 351, baseType: !42, size: 32, offset: 2144)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !551, file: !366, line: 353, baseType: !780, size: 64, offset: 2176)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !366, line: 297, baseType: !782)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !366, line: 295, size: 2048, elements: !783)
!783 = !{!784}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !782, file: !366, line: 296, baseType: !214, size: 2048)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !551, file: !366, line: 355, baseType: !786, size: 384, offset: 2240)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !366, line: 338, baseType: !787)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !366, line: 322, size: 384, elements: !788)
!788 = !{!789, !790, !791, !792, !793, !794, !795}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !787, file: !366, line: 323, baseType: !42, size: 32)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !787, file: !366, line: 325, baseType: !85, size: 16, offset: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !787, file: !366, line: 326, baseType: !85, size: 16, offset: 48)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !787, file: !366, line: 331, baseType: !74, size: 128, offset: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !787, file: !366, line: 334, baseType: !74, size: 128, offset: 192)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !787, file: !366, line: 335, baseType: !42, size: 32, offset: 320)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !787, file: !366, line: 337, baseType: !42, size: 32, offset: 352)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !534, file: !309, line: 81, baseType: !48, size: 64, offset: 12224)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !534, file: !309, line: 85, baseType: !798, size: 6208, offset: 12288)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !309, line: 55, size: 6208, elements: !799)
!799 = !{!800, !801, !802, !803, !804}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !798, file: !309, line: 56, baseType: !477, size: 6144)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !798, file: !309, line: 58, baseType: !85, size: 16, offset: 6144)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !798, file: !309, line: 59, baseType: !85, size: 16, offset: 6160)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !798, file: !309, line: 60, baseType: !85, size: 16, offset: 6176)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !798, file: !309, line: 61, baseType: !85, size: 16, offset: 6192)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !534, file: !309, line: 86, baseType: !42, size: 32, offset: 18496)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !534, file: !309, line: 88, baseType: !42, size: 32, offset: 18528)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !534, file: !309, line: 90, baseType: !42, size: 32, offset: 18560)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !534, file: !309, line: 94, baseType: !42, size: 32, offset: 18592)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !534, file: !309, line: 100, baseType: !522, size: 512, offset: 18624)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !429, file: !420, line: 154, baseType: !811, size: 64, offset: 1664)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !313, line: 264, flags: DIFlagFwdDecl)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !429, file: !420, line: 156, baseType: !488, size: 64, offset: 1728)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "effect_fader", scope: !429, file: !420, line: 158, baseType: !82, size: 32, offset: 1792)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "speed_fader", scope: !429, file: !420, line: 159, baseType: !82, size: 32, offset: 1824)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "seq1", scope: !429, file: !420, line: 162, baseType: !432, size: 64, offset: 1856)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "seq2", scope: !429, file: !420, line: 162, baseType: !432, size: 64, offset: 1920)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "seq3", scope: !429, file: !420, line: 162, baseType: !432, size: 64, offset: 1984)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !429, file: !420, line: 164, baseType: !74, size: 128, offset: 2048)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !429, file: !420, line: 166, baseType: !821, size: 64, offset: 2176)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DICompositeType(tag: DW_TAG_structure_type, name: "bSound", file: !420, line: 51, flags: DIFlagFwdDecl)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "scene_sound", scope: !429, file: !420, line: 167, baseType: !48, size: 64, offset: 2240)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !429, file: !420, line: 168, baseType: !82, size: 32, offset: 2304)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !429, file: !420, line: 170, baseType: !82, size: 32, offset: 2336)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "pan", scope: !429, file: !420, line: 170, baseType: !82, size: 32, offset: 2368)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "strobe", scope: !429, file: !420, line: 171, baseType: !82, size: 32, offset: 2400)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "effectdata", scope: !429, file: !420, line: 173, baseType: !48, size: 64, offset: 2432)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "anim_startofs", scope: !429, file: !420, line: 175, baseType: !42, size: 32, offset: 2496)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "anim_endofs", scope: !429, file: !420, line: 176, baseType: !42, size: 32, offset: 2528)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "blend_mode", scope: !429, file: !420, line: 179, baseType: !42, size: 32, offset: 2560)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "blend_opacity", scope: !429, file: !420, line: 180, baseType: !82, size: 32, offset: 2592)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !429, file: !420, line: 183, baseType: !42, size: 32, offset: 2624)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !429, file: !420, line: 185, baseType: !119, size: 8, offset: 2656)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !429, file: !420, line: 186, baseType: !836, size: 24, offset: 2664)
!836 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 24, elements: !334)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !429, file: !420, line: 189, baseType: !74, size: 128, offset: 2688)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "act_imagedir", scope: !419, file: !420, line: 207, baseType: !118, size: 8192, offset: 384)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "act_sounddir", scope: !419, file: !420, line: 208, baseType: !118, size: 8192, offset: 8576)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "over_ofs", scope: !419, file: !420, line: 210, baseType: !42, size: 32, offset: 16768)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "over_cfra", scope: !419, file: !420, line: 210, baseType: !42, size: 32, offset: 16800)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "over_flag", scope: !419, file: !420, line: 211, baseType: !42, size: 32, offset: 16832)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !419, file: !420, line: 211, baseType: !42, size: 32, offset: 16864)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "over_border", scope: !419, file: !420, line: 212, baseType: !242, size: 128, offset: 16896)
