; ModuleID = 'blender/source/blender/editors/space_view3d/view3d_project.c'
source_filename = "blender/source/blender/editors/space_view3d/view3d_project.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ARegion = type { %struct.ARegion*, %struct.ARegion*, %struct.View2D, %struct.rcti, %struct.rcti, i16, i16, i16, i16, i16, i16, float, i16, i16, i16, i16, i16, i16, i16, i16, %struct.ARegionType*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.wmTimer*, i8*, i8* }
%struct.View2D = type { %struct.rctf, %struct.rctf, %struct.rcti, %struct.rcti, %struct.rcti, [2 x float], [2 x float], float, float, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, float*, i32, i32, %struct.SmoothView2DStore*, %struct.wmTimer* }
%struct.rctf = type { float, float, float, float }
%struct.SmoothView2DStore = type opaque
%struct.rcti = type { i32, i32, i32, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !20, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/editors/space_view3d/view3d_project.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !13}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 109, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "blender/source/blender/editors/include/ED_view3d.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12}
!7 = !DIEnumerator(name: "V3D_PROJ_RET_OK", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "V3D_PROJ_RET_CLIP_NEAR", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "V3D_PROJ_RET_CLIP_ZERO", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "V3D_PROJ_RET_CLIP_BB", value: 3, isUnsigned: true)
!11 = !DIEnumerator(name: "V3D_PROJ_RET_CLIP_WIN", value: 4, isUnsigned: true)
!12 = !DIEnumerator(name: "V3D_PROJ_RET_OVERFLOW", value: 5, isUnsigned: true)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 119, baseType: !5, size: 32, elements: !14)
!14 = !{!15, !16, !17, !18, !19}
!15 = !DIEnumerator(name: "V3D_PROJ_TEST_NOP", value: 0, isUnsigned: true)
!16 = !DIEnumerator(name: "V3D_PROJ_TEST_CLIP_BB", value: 1, isUnsigned: true)
!17 = !DIEnumerator(name: "V3D_PROJ_TEST_CLIP_WIN", value: 2, isUnsigned: true)
!18 = !DIEnumerator(name: "V3D_PROJ_TEST_CLIP_NEAR", value: 4, isUnsigned: true)
!19 = !DIEnumerator(name: "V3D_PROJ_TEST_CLIP_ZERO", value: 8, isUnsigned: true)
!20 = !{!21, !22, !23, !24, !28, !120}
!21 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!22 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 128, elements: !26)
!26 = !{!27}
!27 = !DISubrange(count: 4)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "RegionView3D", file: !30, line: 148, baseType: !31)
!30 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view3d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RegionView3D", file: !30, line: 85, size: 7040, elements: !32)
!32 = !{!33, !36, !37, !38, !39, !40, !41, !42, !46, !47, !59, !61, !64, !82, !84, !87, !91, !92, !93, !94, !95, !96, !97, !100, !101, !103, !104, !105, !106, !107, !109, !111, !112, !113, !114, !115, !116, !117, !118, !119}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "winmat", scope: !31, file: !30, line: 87, baseType: !34, size: 512)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 512, elements: !35)
!35 = !{!27, !27}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "viewmat", scope: !31, file: !30, line: 88, baseType: !34, size: 512, offset: 512)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "viewinv", scope: !31, file: !30, line: 89, baseType: !34, size: 512, offset: 1024)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "persmat", scope: !31, file: !30, line: 90, baseType: !34, size: 512, offset: 1536)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "persinv", scope: !31, file: !30, line: 91, baseType: !34, size: 512, offset: 2048)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "viewmatob", scope: !31, file: !30, line: 94, baseType: !34, size: 512, offset: 2560)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "persmatob", scope: !31, file: !30, line: 95, baseType: !34, size: 512, offset: 3072)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !31, file: !30, line: 99, baseType: !43, size: 768, offset: 3584)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 768, elements: !44)
!44 = !{!45, !27}
!45 = !DISubrange(count: 6)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "clip_local", scope: !31, file: !30, line: 100, baseType: !43, size: 768, offset: 4352)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "clipbb", scope: !31, file: !30, line: 101, baseType: !48, size: 64, offset: 5120)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !50, line: 97, size: 832, elements: !51)
!50 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!51 = !{!52, !57, !58}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !49, file: !50, line: 98, baseType: !53, size: 768)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 768, elements: !54)
!54 = !{!55, !56}
!55 = !DISubrange(count: 8)
!56 = !DISubrange(count: 3)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !49, file: !50, line: 99, baseType: !23, size: 32, offset: 768)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !49, file: !50, line: 99, baseType: !23, size: 32, offset: 800)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "localvd", scope: !31, file: !30, line: 103, baseType: !60, size: 64, offset: 5184)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "render_engine", scope: !31, file: !30, line: 104, baseType: !62, size: 64, offset: 5248)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderEngine", file: !30, line: 44, flags: DIFlagFwdDecl)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "depths", scope: !31, file: !30, line: 105, baseType: !65, size: 64, offset: 5312)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ViewDepths", file: !4, line: 77, size: 320, elements: !67)
!67 = !{!68, !70, !71, !72, !73, !75, !80}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !66, file: !4, line: 78, baseType: !69, size: 16)
!69 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !66, file: !4, line: 78, baseType: !69, size: 16, offset: 16)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !66, file: !4, line: 79, baseType: !22, size: 16, offset: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !66, file: !4, line: 79, baseType: !22, size: 16, offset: 48)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "depths", scope: !66, file: !4, line: 80, baseType: !74, size: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "depth_range", scope: !66, file: !4, line: 81, baseType: !76, size: 128, offset: 128)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 128, elements: !78)
!77 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!78 = !{!79}
!79 = !DISubrange(count: 2)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "damaged", scope: !66, file: !4, line: 83, baseType: !81, size: 8, offset: 256)
!81 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "gpuoffscreen", scope: !31, file: !30, line: 106, baseType: !83, size: 64, offset: 5376)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "sms", scope: !31, file: !30, line: 109, baseType: !85, size: 64, offset: 5440)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmoothView3DStore", file: !30, line: 46, flags: DIFlagFwdDecl)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_timer", scope: !31, file: !30, line: 110, baseType: !88, size: 64, offset: 5504)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !90, line: 69, flags: DIFlagFwdDecl)
!90 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view2d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!91 = !DIDerivedType(tag: DW_TAG_member, name: "twmat", scope: !31, file: !30, line: 114, baseType: !34, size: 512, offset: 5568)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "viewquat", scope: !31, file: !30, line: 116, baseType: !25, size: 128, offset: 6080)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !31, file: !30, line: 117, baseType: !21, size: 32, offset: 6208)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "camdx", scope: !31, file: !30, line: 118, baseType: !21, size: 32, offset: 6240)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "camdy", scope: !31, file: !30, line: 118, baseType: !21, size: 32, offset: 6272)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "pixsize", scope: !31, file: !30, line: 119, baseType: !21, size: 32, offset: 6304)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "ofs", scope: !31, file: !30, line: 120, baseType: !98, size: 96, offset: 6336)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 96, elements: !99)
!99 = !{!56}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "camzoom", scope: !31, file: !30, line: 122, baseType: !21, size: 32, offset: 6432)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "is_persp", scope: !31, file: !30, line: 123, baseType: !102, size: 8, offset: 6464)
!102 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "persp", scope: !31, file: !30, line: 125, baseType: !102, size: 8, offset: 6472)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !31, file: !30, line: 126, baseType: !102, size: 8, offset: 6480)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "viewlock", scope: !31, file: !30, line: 127, baseType: !102, size: 8, offset: 6488)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "viewlock_quad", scope: !31, file: !30, line: 128, baseType: !102, size: 8, offset: 6496)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !31, file: !30, line: 129, baseType: !108, size: 24, offset: 6504)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 24, elements: !99)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "ofs_lock", scope: !31, file: !30, line: 130, baseType: !110, size: 64, offset: 6528)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 64, elements: !78)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "twdrawflag", scope: !31, file: !30, line: 132, baseType: !22, size: 16, offset: 6592)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "rflag", scope: !31, file: !30, line: 133, baseType: !22, size: 16, offset: 6608)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "lviewquat", scope: !31, file: !30, line: 137, baseType: !25, size: 128, offset: 6624)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "lpersp", scope: !31, file: !30, line: 138, baseType: !22, size: 16, offset: 6752)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "lview", scope: !31, file: !30, line: 138, baseType: !22, size: 16, offset: 6768)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "gridview", scope: !31, file: !30, line: 140, baseType: !21, size: 32, offset: 6784)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "tw_idot", scope: !31, file: !30, line: 141, baseType: !98, size: 96, offset: 6816)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "rot_angle", scope: !31, file: !30, line: 145, baseType: !21, size: 32, offset: 6912)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "rot_axis", scope: !31, file: !30, line: 146, baseType: !98, size: 96, offset: 6944)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "GLint", file: !122, line: 273, baseType: !23)
!122 = !DIFile(filename: "blender/extern/glew/include/GL/glew.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!123 = !{i32 7, !"Dwarf Version", i32 4}
!124 = !{i32 2, !"Debug Info Version", i32 3}
!125 = !{i32 1, !"wchar_size", i32 4}
!126 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!127 = distinct !DISubprogram(name: "ED_view3d_project_float_v2_m4", scope: !1, file: !1, line: 56, type: !128, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1694)
!128 = !DISubroutineType(types: !129)
!129 = !{null, !130, !1692, !74, !24}
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "ARegion", file: !133, line: 267, baseType: !134)
!133 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !133, line: 230, size: 3072, elements: !135)
!135 = !{!136, !138, !139, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !134, file: !133, line: 231, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !134, file: !133, line: 231, baseType: !137, size: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !134, file: !133, line: 233, baseType: !140, size: 1280, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "View2D", file: !90, line: 71, baseType: !141)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View2D", file: !90, line: 40, size: 1280, elements: !142)
!142 = !{!143, !152, !153, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !185}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !141, file: !90, line: 41, baseType: !144, size: 128)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !145, line: 95, baseType: !146)
!145 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !145, line: 92, size: 128, elements: !147)
!147 = !{!148, !149, !150, !151}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !146, file: !145, line: 93, baseType: !21, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !146, file: !145, line: 93, baseType: !21, size: 32, offset: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !146, file: !145, line: 94, baseType: !21, size: 32, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !146, file: !145, line: 94, baseType: !21, size: 32, offset: 96)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !141, file: !90, line: 41, baseType: !144, size: 128, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "vert", scope: !141, file: !90, line: 42, baseType: !154, size: 128, offset: 256)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !145, line: 89, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !145, line: 86, size: 128, elements: !156)
!156 = !{!157, !158, !159, !160}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !155, file: !145, line: 87, baseType: !23, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !155, file: !145, line: 87, baseType: !23, size: 32, offset: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !155, file: !145, line: 88, baseType: !23, size: 32, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !155, file: !145, line: 88, baseType: !23, size: 32, offset: 96)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "hor", scope: !141, file: !90, line: 42, baseType: !154, size: 128, offset: 384)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !141, file: !90, line: 43, baseType: !154, size: 128, offset: 512)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !141, file: !90, line: 45, baseType: !110, size: 64, offset: 640)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !141, file: !90, line: 45, baseType: !110, size: 64, offset: 704)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "minzoom", scope: !141, file: !90, line: 46, baseType: !21, size: 32, offset: 768)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "maxzoom", scope: !141, file: !90, line: 46, baseType: !21, size: 32, offset: 800)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !141, file: !90, line: 48, baseType: !22, size: 16, offset: 832)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_ui", scope: !141, file: !90, line: 49, baseType: !22, size: 16, offset: 848)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "keeptot", scope: !141, file: !90, line: 51, baseType: !22, size: 16, offset: 864)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "keepzoom", scope: !141, file: !90, line: 52, baseType: !22, size: 16, offset: 880)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "keepofs", scope: !141, file: !90, line: 53, baseType: !22, size: 16, offset: 896)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !141, file: !90, line: 55, baseType: !22, size: 16, offset: 912)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !141, file: !90, line: 56, baseType: !22, size: 16, offset: 928)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !141, file: !90, line: 58, baseType: !22, size: 16, offset: 944)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !141, file: !90, line: 58, baseType: !22, size: 16, offset: 960)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "oldwinx", scope: !141, file: !90, line: 59, baseType: !22, size: 16, offset: 976)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "oldwiny", scope: !141, file: !90, line: 59, baseType: !22, size: 16, offset: 992)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !141, file: !90, line: 61, baseType: !22, size: 16, offset: 1008)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "tab_offset", scope: !141, file: !90, line: 63, baseType: !74, size: 64, offset: 1024)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "tab_num", scope: !141, file: !90, line: 64, baseType: !23, size: 32, offset: 1088)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "tab_cur", scope: !141, file: !90, line: 65, baseType: !23, size: 32, offset: 1120)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "sms", scope: !141, file: !90, line: 68, baseType: !183, size: 64, offset: 1152)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmoothView2DStore", file: !90, line: 68, flags: DIFlagFwdDecl)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_timer", scope: !141, file: !90, line: 69, baseType: !88, size: 64, offset: 1216)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "winrct", scope: !134, file: !133, line: 234, baseType: !154, size: 128, offset: 1408)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "drawrct", scope: !134, file: !133, line: 235, baseType: !154, size: 128, offset: 1536)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !134, file: !133, line: 236, baseType: !22, size: 16, offset: 1664)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !134, file: !133, line: 236, baseType: !22, size: 16, offset: 1680)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "swinid", scope: !134, file: !133, line: 238, baseType: !22, size: 16, offset: 1696)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "regiontype", scope: !134, file: !133, line: 239, baseType: !22, size: 16, offset: 1712)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !134, file: !133, line: 240, baseType: !22, size: 16, offset: 1728)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !134, file: !133, line: 241, baseType: !22, size: 16, offset: 1744)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "fsize", scope: !134, file: !133, line: 243, baseType: !21, size: 32, offset: 1760)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !134, file: !133, line: 244, baseType: !22, size: 16, offset: 1792)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !134, file: !133, line: 244, baseType: !22, size: 16, offset: 1808)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw", scope: !134, file: !133, line: 246, baseType: !22, size: 16, offset: 1824)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw_overlay", scope: !134, file: !133, line: 247, baseType: !22, size: 16, offset: 1840)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !134, file: !133, line: 248, baseType: !22, size: 16, offset: 1856)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "overlap", scope: !134, file: !133, line: 249, baseType: !22, size: 16, offset: 1872)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "flagfullscreen", scope: !134, file: !133, line: 250, baseType: !22, size: 16, offset: 1888)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !134, file: !133, line: 251, baseType: !22, size: 16, offset: 1904)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !134, file: !133, line: 253, baseType: !204, size: 64, offset: 1920)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ARegionType", file: !206, line: 116, size: 1472, elements: !207)
!206 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_screen.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!207 = !{!208, !209, !210, !211, !217, !218, !226, !1654, !1658, !1662, !1663, !1664, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !205, file: !206, line: 117, baseType: !204, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !205, file: !206, line: 117, baseType: !204, size: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "regionid", scope: !205, file: !206, line: 119, baseType: !23, size: 32, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !205, file: !206, line: 122, baseType: !212, size: 64, offset: 192)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{null, !215, !137}
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindowManager", file: !206, line: 54, flags: DIFlagFwdDecl)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "exit", scope: !205, file: !206, line: 124, baseType: !212, size: 64, offset: 256)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !205, file: !206, line: 126, baseType: !219, size: 64, offset: 320)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DISubroutineType(types: !221)
!221 = !{null, !222, !137}
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !224)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !225, line: 37, flags: DIFlagFwdDecl)
!225 = !DIFile(filename: "blender/source/blender/editors/include/BIF_glutil.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!226 = !DIDerivedType(tag: DW_TAG_member, name: "listener", scope: !205, file: !206, line: 128, baseType: !227, size: 64, offset: 384)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{null, !230, !1551, !137, !1618}
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !133, line: 49, size: 1984, elements: !232)
!232 = !{!233, !301, !302, !303, !304, !305, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !231, file: !133, line: 50, baseType: !234, size: 960)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !235, line: 130, baseType: !236)
!235 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !235, line: 117, size: 960, elements: !237)
!237 = !{!238, !239, !240, !242, !261, !265, !266, !267, !268, !269}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !236, file: !235, line: 118, baseType: !83, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !236, file: !235, line: 118, baseType: !83, size: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !236, file: !235, line: 119, baseType: !241, size: 64, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !236, file: !235, line: 120, baseType: !243, size: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !235, line: 136, size: 17600, elements: !245)
!245 = !{!246, !247, !249, !252, !256, !257, !258}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !244, file: !235, line: 137, baseType: !234, size: 960)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !244, file: !235, line: 138, baseType: !248, size: 64, offset: 960)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !244, file: !235, line: 139, baseType: !250, size: 64, offset: 1024)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !235, line: 43, flags: DIFlagFwdDecl)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !244, file: !235, line: 140, baseType: !253, size: 8192, offset: 1088)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 8192, elements: !254)
!254 = !{!255}
!255 = !DISubrange(count: 1024)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !244, file: !235, line: 141, baseType: !253, size: 8192, offset: 9280)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !244, file: !235, line: 148, baseType: !243, size: 64, offset: 17472)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !244, file: !235, line: 150, baseType: !259, size: 64, offset: 17536)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !235, line: 45, flags: DIFlagFwdDecl)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !236, file: !235, line: 121, baseType: !262, size: 528, offset: 256)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 528, elements: !263)
!263 = !{!264}
!264 = !DISubrange(count: 66)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !236, file: !235, line: 126, baseType: !22, size: 16, offset: 784)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !236, file: !235, line: 127, baseType: !23, size: 32, offset: 800)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !236, file: !235, line: 128, baseType: !23, size: 32, offset: 832)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !236, file: !235, line: 128, baseType: !23, size: 32, offset: 864)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !236, file: !235, line: 129, baseType: !270, size: 64, offset: 896)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !235, line: 75, baseType: !272)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !235, line: 62, size: 1024, elements: !273)
!273 = !{!274, !276, !277, !278, !279, !280, !284, !285, !299, !300}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !272, file: !235, line: 63, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !272, file: !235, line: 63, baseType: !275, size: 64, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !272, file: !235, line: 64, baseType: !102, size: 8, offset: 128)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !272, file: !235, line: 64, baseType: !102, size: 8, offset: 136)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !272, file: !235, line: 65, baseType: !22, size: 16, offset: 144)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !272, file: !235, line: 66, baseType: !281, size: 512, offset: 160)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 512, elements: !282)
!282 = !{!283}
!283 = !DISubrange(count: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !272, file: !235, line: 67, baseType: !23, size: 32, offset: 672)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !272, file: !235, line: 69, baseType: !286, size: 256, offset: 704)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !235, line: 60, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !235, line: 48, size: 256, elements: !288)
!288 = !{!289, !290, !297, !298}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !287, file: !235, line: 49, baseType: !83, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !287, file: !235, line: 58, baseType: !291, size: 128, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !292, line: 71, baseType: !293)
!292 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !292, line: 69, size: 128, elements: !294)
!294 = !{!295, !296}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !293, file: !292, line: 70, baseType: !83, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !293, file: !292, line: 70, baseType: !83, size: 64, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !287, file: !235, line: 59, baseType: !23, size: 32, offset: 192)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !287, file: !235, line: 59, baseType: !23, size: 32, offset: 224)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !272, file: !235, line: 70, baseType: !23, size: 32, offset: 960)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !272, file: !235, line: 74, baseType: !23, size: 32, offset: 992)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !231, file: !133, line: 52, baseType: !291, size: 128, offset: 960)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !231, file: !133, line: 53, baseType: !291, size: 128, offset: 1088)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !231, file: !133, line: 54, baseType: !291, size: 128, offset: 1216)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !231, file: !133, line: 55, baseType: !291, size: 128, offset: 1344)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !231, file: !133, line: 57, baseType: !306, size: 64, offset: 1472)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !308, line: 1216, size: 39680, elements: !309)
!308 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!309 = !{!310, !311, !315, !584, !587, !588, !589, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !615, !618, !621, !915, !918, !1202, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1224, !1225, !1226, !1227, !1228, !1236, !1303, !1310, !1311, !1318, !1526, !1527, !1528, !1529, !1530, !1531}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !307, file: !308, line: 1217, baseType: !234, size: 960)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !307, file: !308, line: 1218, baseType: !312, size: 64, offset: 960)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !314, line: 45, flags: DIFlagFwdDecl)
!314 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!315 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !307, file: !308, line: 1220, baseType: !316, size: 64, offset: 1024)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !50, line: 115, size: 11392, elements: !318)
!318 = !{!319, !320, !321, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !338, !339, !353, !354, !395, !396, !399, !400, !416, !417, !418, !419, !420, !421, !422, !426, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !501, !502, !503, !504, !505, !506, !507, !508, !509, !512, !515, !518, !519, !520, !521, !522, !525, !528, !531, !532, !538, !539, !540, !541, !542, !543, !545, !548, !551, !552, !572, !573}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !317, file: !50, line: 116, baseType: !234, size: 960)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !317, file: !50, line: 117, baseType: !312, size: 64, offset: 960)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !317, file: !50, line: 119, baseType: !322, size: 64, offset: 1024)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !50, line: 57, flags: DIFlagFwdDecl)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !317, file: !50, line: 121, baseType: !22, size: 16, offset: 1088)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !317, file: !50, line: 121, baseType: !22, size: 16, offset: 1104)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !317, file: !50, line: 122, baseType: !23, size: 32, offset: 1120)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !317, file: !50, line: 122, baseType: !23, size: 32, offset: 1152)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !317, file: !50, line: 122, baseType: !23, size: 32, offset: 1184)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !317, file: !50, line: 123, baseType: !281, size: 512, offset: 1216)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !317, file: !50, line: 124, baseType: !316, size: 64, offset: 1728)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !317, file: !50, line: 124, baseType: !316, size: 64, offset: 1792)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !317, file: !50, line: 127, baseType: !316, size: 64, offset: 1856)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !317, file: !50, line: 127, baseType: !316, size: 64, offset: 1920)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !317, file: !50, line: 127, baseType: !316, size: 64, offset: 1984)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !317, file: !50, line: 128, baseType: !336, size: 64, offset: 2048)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !314, line: 46, flags: DIFlagFwdDecl)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !317, file: !50, line: 130, baseType: !48, size: 64, offset: 2112)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !317, file: !50, line: 131, baseType: !340, size: 64, offset: 2176)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !342, line: 486, size: 1600, elements: !343)
!342 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!343 = !{!344, !345, !346, !347, !348, !349, !350, !351, !352}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !341, file: !342, line: 487, baseType: !234, size: 960)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !341, file: !342, line: 489, baseType: !291, size: 128, offset: 960)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !341, file: !342, line: 490, baseType: !291, size: 128, offset: 1088)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !341, file: !342, line: 491, baseType: !291, size: 128, offset: 1216)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !341, file: !342, line: 492, baseType: !291, size: 128, offset: 1344)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !341, file: !342, line: 494, baseType: !23, size: 32, offset: 1472)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !341, file: !342, line: 495, baseType: !23, size: 32, offset: 1504)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !341, file: !342, line: 497, baseType: !23, size: 32, offset: 1536)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !341, file: !342, line: 498, baseType: !23, size: 32, offset: 1568)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !317, file: !50, line: 132, baseType: !340, size: 64, offset: 2240)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !317, file: !50, line: 133, baseType: !355, size: 64, offset: 2304)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !342, line: 334, size: 1728, elements: !357)
!357 = !{!358, !359, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !394}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !356, file: !342, line: 335, baseType: !291, size: 128)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !356, file: !342, line: 336, baseType: !360, size: 64, offset: 128)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !342, line: 47, flags: DIFlagFwdDecl)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !356, file: !342, line: 338, baseType: !22, size: 16, offset: 192)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !356, file: !342, line: 338, baseType: !22, size: 16, offset: 208)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !356, file: !342, line: 339, baseType: !5, size: 32, offset: 224)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !356, file: !342, line: 340, baseType: !23, size: 32, offset: 256)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !356, file: !342, line: 342, baseType: !21, size: 32, offset: 288)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !356, file: !342, line: 343, baseType: !98, size: 96, offset: 320)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !356, file: !342, line: 344, baseType: !98, size: 96, offset: 416)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !356, file: !342, line: 347, baseType: !291, size: 128, offset: 512)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !356, file: !342, line: 349, baseType: !23, size: 32, offset: 640)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !356, file: !342, line: 350, baseType: !23, size: 32, offset: 672)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !356, file: !342, line: 351, baseType: !83, size: 64, offset: 704)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !356, file: !342, line: 352, baseType: !83, size: 64, offset: 768)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !356, file: !342, line: 354, baseType: !375, size: 384, offset: 832)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !342, line: 116, baseType: !376)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !342, line: 94, size: 384, elements: !377)
!377 = !{!378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !376, file: !342, line: 96, baseType: !23, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !376, file: !342, line: 96, baseType: !23, size: 32, offset: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !376, file: !342, line: 97, baseType: !23, size: 32, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !376, file: !342, line: 97, baseType: !23, size: 32, offset: 96)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !376, file: !342, line: 99, baseType: !22, size: 16, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !376, file: !342, line: 100, baseType: !22, size: 16, offset: 144)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !376, file: !342, line: 102, baseType: !22, size: 16, offset: 160)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !376, file: !342, line: 105, baseType: !22, size: 16, offset: 176)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !376, file: !342, line: 108, baseType: !22, size: 16, offset: 192)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !376, file: !342, line: 109, baseType: !22, size: 16, offset: 208)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !376, file: !342, line: 111, baseType: !22, size: 16, offset: 224)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !376, file: !342, line: 112, baseType: !22, size: 16, offset: 240)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !376, file: !342, line: 114, baseType: !23, size: 32, offset: 256)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !376, file: !342, line: 114, baseType: !23, size: 32, offset: 288)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !376, file: !342, line: 115, baseType: !23, size: 32, offset: 320)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !376, file: !342, line: 115, baseType: !23, size: 32, offset: 352)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !356, file: !342, line: 355, baseType: !281, size: 512, offset: 1216)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !317, file: !50, line: 134, baseType: !83, size: 64, offset: 2368)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !317, file: !50, line: 136, baseType: !397, size: 64, offset: 2432)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !50, line: 58, flags: DIFlagFwdDecl)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !317, file: !50, line: 138, baseType: !375, size: 384, offset: 2496)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !317, file: !50, line: 139, baseType: !401, size: 64, offset: 2880)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !342, line: 80, baseType: !403)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !342, line: 72, size: 192, elements: !404)
!404 = !{!405, !412, !413, !414, !415}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !403, file: !342, line: 73, baseType: !406, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !342, line: 59, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !342, line: 56, size: 128, elements: !409)
!409 = !{!410, !411}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !408, file: !342, line: 57, baseType: !98, size: 96)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !408, file: !342, line: 58, baseType: !23, size: 32, offset: 96)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !403, file: !342, line: 74, baseType: !23, size: 32, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !403, file: !342, line: 76, baseType: !23, size: 32, offset: 96)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !403, file: !342, line: 77, baseType: !23, size: 32, offset: 128)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !403, file: !342, line: 79, baseType: !23, size: 32, offset: 160)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !317, file: !50, line: 141, baseType: !291, size: 128, offset: 2944)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !317, file: !50, line: 142, baseType: !291, size: 128, offset: 3072)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !317, file: !50, line: 143, baseType: !291, size: 128, offset: 3200)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !317, file: !50, line: 144, baseType: !291, size: 128, offset: 3328)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !317, file: !50, line: 146, baseType: !23, size: 32, offset: 3456)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !317, file: !50, line: 147, baseType: !23, size: 32, offset: 3488)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !317, file: !50, line: 150, baseType: !423, size: 64, offset: 3520)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !50, line: 50, flags: DIFlagFwdDecl)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !317, file: !50, line: 151, baseType: !427, size: 64, offset: 3584)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !317, file: !50, line: 152, baseType: !23, size: 32, offset: 3648)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !317, file: !50, line: 153, baseType: !23, size: 32, offset: 3680)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !317, file: !50, line: 156, baseType: !98, size: 96, offset: 3712)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !317, file: !50, line: 156, baseType: !98, size: 96, offset: 3808)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !317, file: !50, line: 156, baseType: !98, size: 96, offset: 3904)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !317, file: !50, line: 157, baseType: !98, size: 96, offset: 4000)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !317, file: !50, line: 158, baseType: !98, size: 96, offset: 4096)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !317, file: !50, line: 159, baseType: !98, size: 96, offset: 4192)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !317, file: !50, line: 160, baseType: !98, size: 96, offset: 4288)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !317, file: !50, line: 160, baseType: !98, size: 96, offset: 4384)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !317, file: !50, line: 161, baseType: !25, size: 128, offset: 4480)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !317, file: !50, line: 161, baseType: !25, size: 128, offset: 4608)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !317, file: !50, line: 162, baseType: !98, size: 96, offset: 4736)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !317, file: !50, line: 162, baseType: !98, size: 96, offset: 4832)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !317, file: !50, line: 163, baseType: !21, size: 32, offset: 4928)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !317, file: !50, line: 163, baseType: !21, size: 32, offset: 4960)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !317, file: !50, line: 164, baseType: !34, size: 512, offset: 4992)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !317, file: !50, line: 165, baseType: !34, size: 512, offset: 5504)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !317, file: !50, line: 166, baseType: !34, size: 512, offset: 6016)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !317, file: !50, line: 167, baseType: !34, size: 512, offset: 6528)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !317, file: !50, line: 176, baseType: !34, size: 512, offset: 7040)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !317, file: !50, line: 178, baseType: !5, size: 32, offset: 7552)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !317, file: !50, line: 180, baseType: !22, size: 16, offset: 7584)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !317, file: !50, line: 181, baseType: !22, size: 16, offset: 7600)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !317, file: !50, line: 183, baseType: !22, size: 16, offset: 7616)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !317, file: !50, line: 183, baseType: !22, size: 16, offset: 7632)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !317, file: !50, line: 184, baseType: !22, size: 16, offset: 7648)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !317, file: !50, line: 184, baseType: !22, size: 16, offset: 7664)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !317, file: !50, line: 185, baseType: !22, size: 16, offset: 7680)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !317, file: !50, line: 186, baseType: !22, size: 16, offset: 7696)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !317, file: !50, line: 187, baseType: !22, size: 16, offset: 7712)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !317, file: !50, line: 188, baseType: !102, size: 8, offset: 7728)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !317, file: !50, line: 189, baseType: !102, size: 8, offset: 7736)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !317, file: !50, line: 192, baseType: !23, size: 32, offset: 7744)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !317, file: !50, line: 192, baseType: !23, size: 32, offset: 7776)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !317, file: !50, line: 192, baseType: !23, size: 32, offset: 7808)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !317, file: !50, line: 192, baseType: !23, size: 32, offset: 7840)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !317, file: !50, line: 194, baseType: !23, size: 32, offset: 7872)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !317, file: !50, line: 202, baseType: !21, size: 32, offset: 7904)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !317, file: !50, line: 202, baseType: !21, size: 32, offset: 7936)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !317, file: !50, line: 202, baseType: !21, size: 32, offset: 7968)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !317, file: !50, line: 211, baseType: !21, size: 32, offset: 8000)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !317, file: !50, line: 212, baseType: !21, size: 32, offset: 8032)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !317, file: !50, line: 213, baseType: !21, size: 32, offset: 8064)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !317, file: !50, line: 214, baseType: !21, size: 32, offset: 8096)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !317, file: !50, line: 215, baseType: !21, size: 32, offset: 8128)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !317, file: !50, line: 216, baseType: !21, size: 32, offset: 8160)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !317, file: !50, line: 219, baseType: !21, size: 32, offset: 8192)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !317, file: !50, line: 220, baseType: !21, size: 32, offset: 8224)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !317, file: !50, line: 221, baseType: !21, size: 32, offset: 8256)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !317, file: !50, line: 224, baseType: !69, size: 16, offset: 8288)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !317, file: !50, line: 224, baseType: !69, size: 16, offset: 8304)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !317, file: !50, line: 226, baseType: !22, size: 16, offset: 8320)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !317, file: !50, line: 228, baseType: !102, size: 8, offset: 8336)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !317, file: !50, line: 229, baseType: !102, size: 8, offset: 8344)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !317, file: !50, line: 231, baseType: !22, size: 16, offset: 8352)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !317, file: !50, line: 232, baseType: !102, size: 8, offset: 8368)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !317, file: !50, line: 233, baseType: !102, size: 8, offset: 8376)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !317, file: !50, line: 234, baseType: !21, size: 32, offset: 8384)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !317, file: !50, line: 235, baseType: !21, size: 32, offset: 8416)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !317, file: !50, line: 237, baseType: !291, size: 128, offset: 8448)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !317, file: !50, line: 238, baseType: !291, size: 128, offset: 8576)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !317, file: !50, line: 239, baseType: !291, size: 128, offset: 8704)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !317, file: !50, line: 240, baseType: !291, size: 128, offset: 8832)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !317, file: !50, line: 242, baseType: !21, size: 32, offset: 8960)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !317, file: !50, line: 244, baseType: !22, size: 16, offset: 8992)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !317, file: !50, line: 245, baseType: !69, size: 16, offset: 9008)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !317, file: !50, line: 246, baseType: !25, size: 128, offset: 9024)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !317, file: !50, line: 248, baseType: !23, size: 32, offset: 9152)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !317, file: !50, line: 249, baseType: !23, size: 32, offset: 9184)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !317, file: !50, line: 251, baseType: !499, size: 64, offset: 9216)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !50, line: 251, flags: DIFlagFwdDecl)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !317, file: !50, line: 253, baseType: !102, size: 8, offset: 9280)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !317, file: !50, line: 254, baseType: !102, size: 8, offset: 9288)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !317, file: !50, line: 255, baseType: !22, size: 16, offset: 9296)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !317, file: !50, line: 256, baseType: !98, size: 96, offset: 9312)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !317, file: !50, line: 258, baseType: !291, size: 128, offset: 9408)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !317, file: !50, line: 259, baseType: !291, size: 128, offset: 9536)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !317, file: !50, line: 260, baseType: !291, size: 128, offset: 9664)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !317, file: !50, line: 261, baseType: !291, size: 128, offset: 9792)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !317, file: !50, line: 263, baseType: !510, size: 64, offset: 9920)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !50, line: 52, flags: DIFlagFwdDecl)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !317, file: !50, line: 264, baseType: !513, size: 64, offset: 9984)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !50, line: 53, flags: DIFlagFwdDecl)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !317, file: !50, line: 265, baseType: !516, size: 64, offset: 10048)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !342, line: 46, flags: DIFlagFwdDecl)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !317, file: !50, line: 267, baseType: !102, size: 8, offset: 10112)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !317, file: !50, line: 268, baseType: !102, size: 8, offset: 10120)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !317, file: !50, line: 269, baseType: !22, size: 16, offset: 10128)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !317, file: !50, line: 270, baseType: !21, size: 32, offset: 10144)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !317, file: !50, line: 272, baseType: !523, size: 64, offset: 10176)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !50, line: 54, flags: DIFlagFwdDecl)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !317, file: !50, line: 275, baseType: !526, size: 64, offset: 10240)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !50, line: 275, flags: DIFlagFwdDecl)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !317, file: !50, line: 277, baseType: !529, size: 64, offset: 10304)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !50, line: 56, flags: DIFlagFwdDecl)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !317, file: !50, line: 277, baseType: !529, size: 64, offset: 10368)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !317, file: !50, line: 278, baseType: !533, size: 64, offset: 10432)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !534, line: 27, baseType: !535)
!534 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !536, line: 45, baseType: !537)
!536 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!537 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !317, file: !50, line: 279, baseType: !533, size: 64, offset: 10496)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !317, file: !50, line: 280, baseType: !5, size: 32, offset: 10560)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !317, file: !50, line: 281, baseType: !5, size: 32, offset: 10592)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !317, file: !50, line: 283, baseType: !291, size: 128, offset: 10624)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !317, file: !50, line: 284, baseType: !291, size: 128, offset: 10752)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !317, file: !50, line: 285, baseType: !544, size: 64, offset: 10880)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !317, file: !50, line: 287, baseType: !546, size: 64, offset: 10944)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !50, line: 59, flags: DIFlagFwdDecl)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !317, file: !50, line: 288, baseType: !549, size: 64, offset: 11008)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !50, line: 288, flags: DIFlagFwdDecl)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !317, file: !50, line: 290, baseType: !110, size: 64, offset: 11072)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !317, file: !50, line: 291, baseType: !553, size: 64, offset: 11136)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !555, line: 65, baseType: !556)
!555 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !555, line: 50, size: 320, elements: !557)
!557 = !{!558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !556, file: !555, line: 51, baseType: !306, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !556, file: !555, line: 53, baseType: !23, size: 32, offset: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !556, file: !555, line: 54, baseType: !23, size: 32, offset: 96)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !556, file: !555, line: 55, baseType: !23, size: 32, offset: 128)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !556, file: !555, line: 55, baseType: !23, size: 32, offset: 160)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !556, file: !555, line: 56, baseType: !102, size: 8, offset: 192)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !556, file: !555, line: 56, baseType: !102, size: 8, offset: 200)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !556, file: !555, line: 57, baseType: !102, size: 8, offset: 208)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !556, file: !555, line: 57, baseType: !102, size: 8, offset: 216)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !556, file: !555, line: 59, baseType: !22, size: 16, offset: 224)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !556, file: !555, line: 59, baseType: !22, size: 16, offset: 240)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !556, file: !555, line: 59, baseType: !22, size: 16, offset: 256)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !556, file: !555, line: 61, baseType: !22, size: 16, offset: 272)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !556, file: !555, line: 63, baseType: !23, size: 32, offset: 288)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !317, file: !50, line: 293, baseType: !291, size: 128, offset: 11200)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !317, file: !50, line: 294, baseType: !574, size: 64, offset: 11328)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !50, line: 113, baseType: !576)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !50, line: 108, size: 256, elements: !577)
!577 = !{!578, !580, !581, !582, !583}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !576, file: !50, line: 109, baseType: !579, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !576, file: !50, line: 109, baseType: !579, size: 64, offset: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !576, file: !50, line: 110, baseType: !316, size: 64, offset: 128)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !576, file: !50, line: 111, baseType: !23, size: 32, offset: 192)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !576, file: !50, line: 112, baseType: !21, size: 32, offset: 224)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !307, file: !308, line: 1221, baseType: !585, size: 64, offset: 1088)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !308, line: 52, flags: DIFlagFwdDecl)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !307, file: !308, line: 1223, baseType: !306, size: 64, offset: 1152)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !307, file: !308, line: 1225, baseType: !291, size: 128, offset: 1216)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !307, file: !308, line: 1226, baseType: !590, size: 64, offset: 1344)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !308, line: 69, size: 320, elements: !592)
!592 = !{!593, !594, !595, !596, !597, !598, !599, !600}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !591, file: !308, line: 70, baseType: !590, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !591, file: !308, line: 70, baseType: !590, size: 64, offset: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !591, file: !308, line: 71, baseType: !5, size: 32, offset: 128)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !591, file: !308, line: 71, baseType: !5, size: 32, offset: 160)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !591, file: !308, line: 72, baseType: !23, size: 32, offset: 192)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !591, file: !308, line: 73, baseType: !22, size: 16, offset: 224)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !591, file: !308, line: 73, baseType: !22, size: 16, offset: 240)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !591, file: !308, line: 74, baseType: !316, size: 64, offset: 256)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !307, file: !308, line: 1227, baseType: !316, size: 64, offset: 1408)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !307, file: !308, line: 1229, baseType: !98, size: 96, offset: 1472)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !307, file: !308, line: 1230, baseType: !98, size: 96, offset: 1568)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !307, file: !308, line: 1231, baseType: !98, size: 96, offset: 1664)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !307, file: !308, line: 1231, baseType: !98, size: 96, offset: 1760)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !307, file: !308, line: 1233, baseType: !5, size: 32, offset: 1856)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !307, file: !308, line: 1234, baseType: !23, size: 32, offset: 1888)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !307, file: !308, line: 1235, baseType: !5, size: 32, offset: 1920)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !307, file: !308, line: 1237, baseType: !22, size: 16, offset: 1952)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !307, file: !308, line: 1239, baseType: !102, size: 8, offset: 1968)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !307, file: !308, line: 1240, baseType: !612, size: 8, offset: 1976)
!612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 8, elements: !613)
!613 = !{!614}
!614 = !DISubrange(count: 1)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !307, file: !308, line: 1242, baseType: !616, size: 64, offset: 1984)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !314, line: 248, flags: DIFlagFwdDecl)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !307, file: !308, line: 1244, baseType: !619, size: 64, offset: 2048)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !308, line: 59, flags: DIFlagFwdDecl)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !307, file: !308, line: 1246, baseType: !622, size: 64, offset: 2112)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !308, line: 1067, size: 5184, elements: !624)
!624 = !{!625, !655, !656, !671, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !693, !788, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !898}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !623, file: !308, line: 1068, baseType: !626, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !308, line: 934, baseType: !628)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !308, line: 925, size: 576, elements: !629)
!629 = !{!630, !646, !647, !648, !649, !651, !654}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !628, file: !308, line: 926, baseType: !631, size: 320)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !308, line: 830, baseType: !632)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !308, line: 813, size: 320, elements: !633)
!633 = !{!634, !637, !640, !641, !643, !644, !645}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !632, file: !308, line: 814, baseType: !635, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !308, line: 51, flags: DIFlagFwdDecl)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !632, file: !308, line: 815, baseType: !638, size: 64, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !308, line: 815, flags: DIFlagFwdDecl)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !632, file: !308, line: 818, baseType: !83, size: 64, offset: 128)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !632, file: !308, line: 819, baseType: !642, size: 32, offset: 192)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 32, elements: !26)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !632, file: !308, line: 822, baseType: !23, size: 32, offset: 224)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !632, file: !308, line: 826, baseType: !23, size: 32, offset: 256)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !632, file: !308, line: 829, baseType: !23, size: 32, offset: 288)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !628, file: !308, line: 928, baseType: !22, size: 16, offset: 320)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !628, file: !308, line: 928, baseType: !22, size: 16, offset: 336)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !628, file: !308, line: 929, baseType: !23, size: 32, offset: 352)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !628, file: !308, line: 930, baseType: !650, size: 64, offset: 384)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !628, file: !308, line: 931, baseType: !652, size: 64, offset: 448)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !308, line: 931, flags: DIFlagFwdDecl)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !628, file: !308, line: 933, baseType: !83, size: 64, offset: 512)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !623, file: !308, line: 1069, baseType: !626, size: 64, offset: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !623, file: !308, line: 1070, baseType: !657, size: 64, offset: 128)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !308, line: 916, baseType: !659)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !308, line: 891, size: 704, elements: !660)
!660 = !{!661, !662, !663, !665, !666, !667, !668, !669, !670}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !659, file: !308, line: 892, baseType: !631, size: 320)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !659, file: !308, line: 896, baseType: !23, size: 32, offset: 320)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !659, file: !308, line: 900, baseType: !664, size: 96, offset: 352)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 96, elements: !99)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !659, file: !308, line: 903, baseType: !21, size: 32, offset: 448)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !659, file: !308, line: 906, baseType: !23, size: 32, offset: 480)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !659, file: !308, line: 909, baseType: !21, size: 32, offset: 512)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !659, file: !308, line: 912, baseType: !21, size: 32, offset: 544)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !659, file: !308, line: 914, baseType: !316, size: 64, offset: 576)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !659, file: !308, line: 915, baseType: !83, size: 64, offset: 640)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !623, file: !308, line: 1071, baseType: !672, size: 64, offset: 192)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !308, line: 920, baseType: !674)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !308, line: 918, size: 320, elements: !675)
!675 = !{!676}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !674, file: !308, line: 919, baseType: !631, size: 320)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !623, file: !308, line: 1075, baseType: !21, size: 32, offset: 256)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !623, file: !308, line: 1077, baseType: !21, size: 32, offset: 288)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !623, file: !308, line: 1078, baseType: !21, size: 32, offset: 320)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !623, file: !308, line: 1079, baseType: !22, size: 16, offset: 352)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !623, file: !308, line: 1082, baseType: !22, size: 16, offset: 368)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !623, file: !308, line: 1085, baseType: !102, size: 8, offset: 384)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !623, file: !308, line: 1086, baseType: !102, size: 8, offset: 392)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !623, file: !308, line: 1087, baseType: !102, size: 8, offset: 400)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !623, file: !308, line: 1088, baseType: !102, size: 8, offset: 408)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !623, file: !308, line: 1090, baseType: !21, size: 32, offset: 416)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !623, file: !308, line: 1093, baseType: !22, size: 16, offset: 448)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !623, file: !308, line: 1096, baseType: !102, size: 8, offset: 464)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !623, file: !308, line: 1098, baseType: !690, size: 40, offset: 472)
!690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 40, elements: !691)
!691 = !{!692}
!692 = !DISubrange(count: 5)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !623, file: !308, line: 1101, baseType: !694, size: 832, offset: 512)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !308, line: 836, size: 832, elements: !695)
!695 = !{!696, !697, !698, !699, !700, !701, !703, !704, !705, !784, !785, !786, !787}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !694, file: !308, line: 837, baseType: !631, size: 320)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !694, file: !308, line: 839, baseType: !22, size: 16, offset: 320)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !694, file: !308, line: 839, baseType: !22, size: 16, offset: 336)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !694, file: !308, line: 842, baseType: !22, size: 16, offset: 352)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !694, file: !308, line: 842, baseType: !22, size: 16, offset: 368)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !694, file: !308, line: 843, baseType: !702, size: 32, offset: 384)
!702 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 32, elements: !78)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !694, file: !308, line: 845, baseType: !23, size: 32, offset: 416)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !694, file: !308, line: 847, baseType: !83, size: 64, offset: 448)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !694, file: !308, line: 848, baseType: !706, size: 64, offset: 512)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !555, line: 77, size: 15424, elements: !708)
!708 = !{!709, !710, !711, !714, !717, !720, !723, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !773, !774, !778}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !707, file: !555, line: 78, baseType: !234, size: 960)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !707, file: !555, line: 80, baseType: !253, size: 8192, offset: 960)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !707, file: !555, line: 82, baseType: !712, size: 64, offset: 9152)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !555, line: 43, flags: DIFlagFwdDecl)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !707, file: !555, line: 83, baseType: !715, size: 64, offset: 9216)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !235, line: 46, flags: DIFlagFwdDecl)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !707, file: !555, line: 86, baseType: !718, size: 64, offset: 9280)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !555, line: 41, flags: DIFlagFwdDecl)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !707, file: !555, line: 87, baseType: !721, size: 64, offset: 9344)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !555, line: 44, flags: DIFlagFwdDecl)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !707, file: !555, line: 89, baseType: !724, size: 512, offset: 9408)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !721, size: 512, elements: !725)
!725 = !{!55}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !707, file: !555, line: 90, baseType: !22, size: 16, offset: 9920)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !707, file: !555, line: 90, baseType: !22, size: 16, offset: 9936)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !707, file: !555, line: 92, baseType: !22, size: 16, offset: 9952)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !707, file: !555, line: 92, baseType: !22, size: 16, offset: 9968)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !707, file: !555, line: 93, baseType: !22, size: 16, offset: 9984)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !707, file: !555, line: 93, baseType: !22, size: 16, offset: 10000)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !707, file: !555, line: 94, baseType: !23, size: 32, offset: 10016)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !707, file: !555, line: 97, baseType: !22, size: 16, offset: 10048)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !707, file: !555, line: 97, baseType: !22, size: 16, offset: 10064)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !707, file: !555, line: 98, baseType: !22, size: 16, offset: 10080)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !707, file: !555, line: 98, baseType: !22, size: 16, offset: 10096)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !707, file: !555, line: 99, baseType: !22, size: 16, offset: 10112)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !707, file: !555, line: 99, baseType: !22, size: 16, offset: 10128)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !707, file: !555, line: 100, baseType: !5, size: 32, offset: 10144)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !707, file: !555, line: 101, baseType: !650, size: 64, offset: 10176)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !707, file: !555, line: 103, baseType: !259, size: 64, offset: 10240)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !707, file: !555, line: 104, baseType: !743, size: 64, offset: 10304)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !235, line: 159, size: 448, elements: !745)
!745 = !{!746, !748, !749, !750, !751, !753}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !744, file: !235, line: 161, baseType: !747, size: 64)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !78)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !744, file: !235, line: 162, baseType: !747, size: 64, offset: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !744, file: !235, line: 163, baseType: !702, size: 32, offset: 128)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !744, file: !235, line: 164, baseType: !702, size: 32, offset: 160)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !744, file: !235, line: 165, baseType: !752, size: 128, offset: 192)
!752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !650, size: 128, elements: !78)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !744, file: !235, line: 166, baseType: !754, size: 128, offset: 320)
!754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !715, size: 128, elements: !78)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !707, file: !555, line: 107, baseType: !21, size: 32, offset: 10368)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !707, file: !555, line: 108, baseType: !23, size: 32, offset: 10400)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !707, file: !555, line: 109, baseType: !22, size: 16, offset: 10432)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !707, file: !555, line: 110, baseType: !22, size: 16, offset: 10448)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !707, file: !555, line: 113, baseType: !23, size: 32, offset: 10464)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !707, file: !555, line: 113, baseType: !23, size: 32, offset: 10496)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !707, file: !555, line: 114, baseType: !102, size: 8, offset: 10528)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !707, file: !555, line: 114, baseType: !102, size: 8, offset: 10536)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !707, file: !555, line: 115, baseType: !22, size: 16, offset: 10544)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !707, file: !555, line: 116, baseType: !25, size: 128, offset: 10560)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !707, file: !555, line: 119, baseType: !21, size: 32, offset: 10688)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !707, file: !555, line: 119, baseType: !21, size: 32, offset: 10720)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !707, file: !555, line: 122, baseType: !768, size: 512, offset: 10752)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !769, line: 182, baseType: !770)
!769 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !769, line: 180, size: 512, elements: !771)
!771 = !{!772}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !770, file: !769, line: 181, baseType: !281, size: 512)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !707, file: !555, line: 123, baseType: !102, size: 8, offset: 11264)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !707, file: !555, line: 125, baseType: !775, size: 56, offset: 11272)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 56, elements: !776)
!776 = !{!777}
!777 = !DISubrange(count: 7)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !707, file: !555, line: 126, baseType: !779, size: 4096, offset: 11328)
!779 = !DICompositeType(tag: DW_TAG_array_type, baseType: !780, size: 4096, elements: !725)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !555, line: 69, baseType: !781)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !555, line: 67, size: 512, elements: !782)
!782 = !{!783}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !781, file: !555, line: 68, baseType: !281, size: 512)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !694, file: !308, line: 849, baseType: !706, size: 64, offset: 576)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "canvas", scope: !694, file: !308, line: 850, baseType: !706, size: 64, offset: 640)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "stencil_col", scope: !694, file: !308, line: 851, baseType: !98, size: 96, offset: 704)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !694, file: !308, line: 852, baseType: !21, size: 32, offset: 800)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !623, file: !308, line: 1104, baseType: !789, size: 1344, offset: 1344)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleEditSettings", file: !308, line: 867, size: 1344, elements: !790)
!790 = !{!791, !792, !793, !794, !795, !806, !807, !808, !809, !810, !811, !812, !813, !814}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !789, file: !308, line: 868, baseType: !22, size: 16)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "totrekey", scope: !789, file: !308, line: 869, baseType: !22, size: 16, offset: 16)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "totaddkey", scope: !789, file: !308, line: 870, baseType: !22, size: 16, offset: 32)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "brushtype", scope: !789, file: !308, line: 871, baseType: !22, size: 16, offset: 48)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !789, file: !308, line: 873, baseType: !796, size: 896, offset: 64)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !797, size: 896, elements: !776)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParticleBrushData", file: !308, line: 864, baseType: !798)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleBrushData", file: !308, line: 859, size: 128, elements: !799)
!799 = !{!800, !801, !802, !803, !804, !805}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !798, file: !308, line: 860, baseType: !22, size: 16)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !798, file: !308, line: 861, baseType: !22, size: 16, offset: 16)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !798, file: !308, line: 861, baseType: !22, size: 16, offset: 32)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !798, file: !308, line: 861, baseType: !22, size: 16, offset: 48)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !798, file: !308, line: 862, baseType: !23, size: 32, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !798, file: !308, line: 863, baseType: !21, size: 32, offset: 96)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !789, file: !308, line: 874, baseType: !83, size: 64, offset: 960)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "emitterdist", scope: !789, file: !308, line: 876, baseType: !21, size: 32, offset: 1024)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !789, file: !308, line: 876, baseType: !21, size: 32, offset: 1056)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !789, file: !308, line: 878, baseType: !23, size: 32, offset: 1088)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "edittype", scope: !789, file: !308, line: 879, baseType: !23, size: 32, offset: 1120)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "draw_step", scope: !789, file: !308, line: 881, baseType: !23, size: 32, offset: 1152)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "fade_frames", scope: !789, file: !308, line: 881, baseType: !23, size: 32, offset: 1184)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !789, file: !308, line: 883, baseType: !306, size: 64, offset: 1216)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !789, file: !308, line: 884, baseType: !316, size: 64, offset: 1280)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_size", scope: !623, file: !308, line: 1107, baseType: !21, size: 32, offset: 2688)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "select_thresh", scope: !623, file: !308, line: 1110, baseType: !21, size: 32, offset: 2720)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_mode", scope: !623, file: !308, line: 1113, baseType: !22, size: 16, offset: 2752)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_flag", scope: !623, file: !308, line: 1113, baseType: !22, size: 16, offset: 2768)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "multires_subdiv_type", scope: !623, file: !308, line: 1116, baseType: !102, size: 8, offset: 2784)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !623, file: !308, line: 1117, baseType: !612, size: 8, offset: 2792)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_resolution", scope: !623, file: !308, line: 1120, baseType: !22, size: 16, offset: 2800)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_internal", scope: !623, file: !308, line: 1121, baseType: !21, size: 32, offset: 2816)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_external", scope: !623, file: !308, line: 1122, baseType: !21, size: 32, offset: 2848)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_ratio", scope: !623, file: !308, line: 1123, baseType: !21, size: 32, offset: 2880)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_limit", scope: !623, file: !308, line: 1124, baseType: !21, size: 32, offset: 2912)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_angle_limit", scope: !623, file: !308, line: 1125, baseType: !21, size: 32, offset: 2944)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_correlation_limit", scope: !623, file: !308, line: 1126, baseType: !21, size: 32, offset: 2976)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_symmetry_limit", scope: !623, file: !308, line: 1127, baseType: !21, size: 32, offset: 3008)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_angle_weight", scope: !623, file: !308, line: 1128, baseType: !21, size: 32, offset: 3040)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_length_weight", scope: !623, file: !308, line: 1129, baseType: !21, size: 32, offset: 3072)
