; ModuleID = 'blender/source/blender/blenkernel/intern/deform.c'
source_filename = "blender/source/blender/blenkernel/intern/deform.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.bDeformGroup = type { %struct.bDeformGroup*, %struct.bDeformGroup*, [64 x i8], i8, [7 x i8] }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !19, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/blenkernel/intern/deform.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 46, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!7 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!8 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!9 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!10 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!11 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!12 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!13 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!14 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!18 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!19 = !{!20, !21, !22}
!20 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!21 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !{i32 7, !"Dwarf Version", i32 4}
!24 = !{i32 2, !"Debug Info Version", i32 3}
!25 = !{i32 1, !"wchar_size", i32 4}
!26 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!27 = distinct !DISubprogram(name: "BKE_defgroup_new", scope: !1, file: !1, line: 54, type: !28, scopeLine: 55, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !409)
!28 = !DISubroutineType(types: !29)
!29 = !{!30, !46, !407}
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bDeformGroup", file: !32, line: 63, size: 704, elements: !33)
!32 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!33 = !{!34, !35, !36, !41, !42}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !31, file: !32, line: 64, baseType: !30, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !31, file: !32, line: 64, baseType: !30, size: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !31, file: !32, line: 65, baseType: !37, size: 512, offset: 128)
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 512, elements: !39)
!38 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!39 = !{!40}
!40 = !DISubrange(count: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !31, file: !32, line: 67, baseType: !38, size: 8, offset: 640)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !31, file: !32, line: 67, baseType: !43, size: 56, offset: 648)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 56, elements: !44)
!44 = !{!45}
!45 = !DISubrange(count: 7)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "Object", file: !32, line: 295, baseType: !48)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !32, line: 115, size: 11392, elements: !49)
!49 = !{!50, !116, !120, !123, !124, !125, !126, !127, !128, !129, !131, !132, !133, !134, !135, !138, !150, !164, !165, !208, !209, !212, !213, !229, !230, !231, !232, !233, !234, !235, !239, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !255, !256, !257, !258, !259, !260, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !319, !320, !321, !322, !323, !324, !325, !326, !327, !330, !333, !336, !337, !338, !339, !340, !343, !346, !349, !350, !356, !357, !358, !359, !360, !361, !363, !366, !369, !373, !395, !396}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !48, file: !32, line: 116, baseType: !51, size: 960)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !52, line: 130, baseType: !53)
!52 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !52, line: 117, size: 960, elements: !54)
!54 = !{!55, !56, !57, !59, !78, !82, !84, !85, !86, !87}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !53, file: !52, line: 118, baseType: !22, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !53, file: !52, line: 118, baseType: !22, size: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !53, file: !52, line: 119, baseType: !58, size: 64, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !53, file: !52, line: 120, baseType: !60, size: 64, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !52, line: 136, size: 17600, elements: !62)
!62 = !{!63, !64, !66, !69, !73, !74, !75}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !61, file: !52, line: 137, baseType: !51, size: 960)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !61, file: !52, line: 138, baseType: !65, size: 64, offset: 960)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !61, file: !52, line: 139, baseType: !67, size: 64, offset: 1024)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !52, line: 43, flags: DIFlagFwdDecl)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !61, file: !52, line: 140, baseType: !70, size: 8192, offset: 1088)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 8192, elements: !71)
!71 = !{!72}
!72 = !DISubrange(count: 1024)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !61, file: !52, line: 141, baseType: !70, size: 8192, offset: 9280)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !61, file: !52, line: 148, baseType: !60, size: 64, offset: 17472)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !61, file: !52, line: 150, baseType: !76, size: 64, offset: 17536)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !52, line: 45, flags: DIFlagFwdDecl)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !53, file: !52, line: 121, baseType: !79, size: 528, offset: 256)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 528, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 66)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !53, file: !52, line: 126, baseType: !83, size: 16, offset: 784)
!83 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !53, file: !52, line: 127, baseType: !20, size: 32, offset: 800)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !53, file: !52, line: 128, baseType: !20, size: 32, offset: 832)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !53, file: !52, line: 128, baseType: !20, size: 32, offset: 864)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !53, file: !52, line: 129, baseType: !88, size: 64, offset: 896)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !52, line: 75, baseType: !90)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !52, line: 62, size: 1024, elements: !91)
!91 = !{!92, !94, !95, !96, !97, !98, !99, !100, !114, !115}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !90, file: !52, line: 63, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !90, file: !52, line: 63, baseType: !93, size: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !90, file: !52, line: 64, baseType: !38, size: 8, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !90, file: !52, line: 64, baseType: !38, size: 8, offset: 136)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !90, file: !52, line: 65, baseType: !83, size: 16, offset: 144)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !90, file: !52, line: 66, baseType: !37, size: 512, offset: 160)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !90, file: !52, line: 67, baseType: !20, size: 32, offset: 672)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !90, file: !52, line: 69, baseType: !101, size: 256, offset: 704)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !52, line: 60, baseType: !102)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !52, line: 48, size: 256, elements: !103)
!103 = !{!104, !105, !112, !113}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !102, file: !52, line: 49, baseType: !22, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !102, file: !52, line: 58, baseType: !106, size: 128, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !107, line: 71, baseType: !108)
!107 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !107, line: 69, size: 128, elements: !109)
!109 = !{!110, !111}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !108, file: !107, line: 70, baseType: !22, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !108, file: !107, line: 70, baseType: !22, size: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !102, file: !52, line: 59, baseType: !20, size: 32, offset: 192)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !102, file: !52, line: 59, baseType: !20, size: 32, offset: 224)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !90, file: !52, line: 70, baseType: !20, size: 32, offset: 960)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !90, file: !52, line: 74, baseType: !20, size: 32, offset: 992)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !48, file: !32, line: 117, baseType: !117, size: 64, offset: 960)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !119, line: 45, flags: DIFlagFwdDecl)
!119 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!120 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !48, file: !32, line: 119, baseType: !121, size: 64, offset: 1024)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !32, line: 57, flags: DIFlagFwdDecl)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !48, file: !32, line: 121, baseType: !83, size: 16, offset: 1088)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !48, file: !32, line: 121, baseType: !83, size: 16, offset: 1104)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !48, file: !32, line: 122, baseType: !20, size: 32, offset: 1120)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !48, file: !32, line: 122, baseType: !20, size: 32, offset: 1152)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !48, file: !32, line: 122, baseType: !20, size: 32, offset: 1184)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !48, file: !32, line: 123, baseType: !37, size: 512, offset: 1216)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !48, file: !32, line: 124, baseType: !130, size: 64, offset: 1728)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !48, file: !32, line: 124, baseType: !130, size: 64, offset: 1792)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !48, file: !32, line: 127, baseType: !130, size: 64, offset: 1856)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !48, file: !32, line: 127, baseType: !130, size: 64, offset: 1920)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !48, file: !32, line: 127, baseType: !130, size: 64, offset: 1984)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !48, file: !32, line: 128, baseType: !136, size: 64, offset: 2048)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !119, line: 46, flags: DIFlagFwdDecl)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !48, file: !32, line: 130, baseType: !139, size: 64, offset: 2112)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !32, line: 97, size: 832, elements: !141)
!141 = !{!142, !148, !149}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !140, file: !32, line: 98, baseType: !143, size: 768)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 768, elements: !145)
!144 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!145 = !{!146, !147}
!146 = !DISubrange(count: 8)
!147 = !DISubrange(count: 3)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !140, file: !32, line: 99, baseType: !20, size: 32, offset: 768)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !140, file: !32, line: 99, baseType: !20, size: 32, offset: 800)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !48, file: !32, line: 131, baseType: !151, size: 64, offset: 2176)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !153, line: 486, size: 1600, elements: !154)
!153 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!154 = !{!155, !156, !157, !158, !159, !160, !161, !162, !163}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !152, file: !153, line: 487, baseType: !51, size: 960)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !152, file: !153, line: 489, baseType: !106, size: 128, offset: 960)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !152, file: !153, line: 490, baseType: !106, size: 128, offset: 1088)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !152, file: !153, line: 491, baseType: !106, size: 128, offset: 1216)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !152, file: !153, line: 492, baseType: !106, size: 128, offset: 1344)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !152, file: !153, line: 494, baseType: !20, size: 32, offset: 1472)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !152, file: !153, line: 495, baseType: !20, size: 32, offset: 1504)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !152, file: !153, line: 497, baseType: !20, size: 32, offset: 1536)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !152, file: !153, line: 498, baseType: !20, size: 32, offset: 1568)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !48, file: !32, line: 132, baseType: !151, size: 64, offset: 2240)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !48, file: !32, line: 133, baseType: !166, size: 64, offset: 2304)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !153, line: 334, size: 1728, elements: !168)
!168 = !{!169, !170, !173, !174, !175, !176, !177, !178, !181, !182, !183, !184, !185, !186, !187, !207}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !167, file: !153, line: 335, baseType: !106, size: 128)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !167, file: !153, line: 336, baseType: !171, size: 64, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !153, line: 47, flags: DIFlagFwdDecl)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !167, file: !153, line: 338, baseType: !83, size: 16, offset: 192)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !167, file: !153, line: 338, baseType: !83, size: 16, offset: 208)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !167, file: !153, line: 339, baseType: !5, size: 32, offset: 224)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !167, file: !153, line: 340, baseType: !20, size: 32, offset: 256)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !167, file: !153, line: 342, baseType: !144, size: 32, offset: 288)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !167, file: !153, line: 343, baseType: !179, size: 96, offset: 320)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 96, elements: !180)
!180 = !{!147}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !167, file: !153, line: 344, baseType: !179, size: 96, offset: 416)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !167, file: !153, line: 347, baseType: !106, size: 128, offset: 512)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !167, file: !153, line: 349, baseType: !20, size: 32, offset: 640)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !167, file: !153, line: 350, baseType: !20, size: 32, offset: 672)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !167, file: !153, line: 351, baseType: !22, size: 64, offset: 704)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !167, file: !153, line: 352, baseType: !22, size: 64, offset: 768)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !167, file: !153, line: 354, baseType: !188, size: 384, offset: 832)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !153, line: 116, baseType: !189)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !153, line: 94, size: 384, elements: !190)
!190 = !{!191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !189, file: !153, line: 96, baseType: !20, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !189, file: !153, line: 96, baseType: !20, size: 32, offset: 32)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !189, file: !153, line: 97, baseType: !20, size: 32, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !189, file: !153, line: 97, baseType: !20, size: 32, offset: 96)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !189, file: !153, line: 99, baseType: !83, size: 16, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !189, file: !153, line: 100, baseType: !83, size: 16, offset: 144)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !189, file: !153, line: 102, baseType: !83, size: 16, offset: 160)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !189, file: !153, line: 105, baseType: !83, size: 16, offset: 176)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !189, file: !153, line: 108, baseType: !83, size: 16, offset: 192)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !189, file: !153, line: 109, baseType: !83, size: 16, offset: 208)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !189, file: !153, line: 111, baseType: !83, size: 16, offset: 224)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !189, file: !153, line: 112, baseType: !83, size: 16, offset: 240)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !189, file: !153, line: 114, baseType: !20, size: 32, offset: 256)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !189, file: !153, line: 114, baseType: !20, size: 32, offset: 288)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !189, file: !153, line: 115, baseType: !20, size: 32, offset: 320)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !189, file: !153, line: 115, baseType: !20, size: 32, offset: 352)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !167, file: !153, line: 355, baseType: !37, size: 512, offset: 1216)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !48, file: !32, line: 134, baseType: !22, size: 64, offset: 2368)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !48, file: !32, line: 136, baseType: !210, size: 64, offset: 2432)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !32, line: 58, flags: DIFlagFwdDecl)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !48, file: !32, line: 138, baseType: !188, size: 384, offset: 2496)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !48, file: !32, line: 139, baseType: !214, size: 64, offset: 2880)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !153, line: 80, baseType: !216)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !153, line: 72, size: 192, elements: !217)
!217 = !{!218, !225, !226, !227, !228}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !216, file: !153, line: 73, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !153, line: 59, baseType: !221)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !153, line: 56, size: 128, elements: !222)
!222 = !{!223, !224}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !221, file: !153, line: 57, baseType: !179, size: 96)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !221, file: !153, line: 58, baseType: !20, size: 32, offset: 96)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !216, file: !153, line: 74, baseType: !20, size: 32, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !216, file: !153, line: 76, baseType: !20, size: 32, offset: 96)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !216, file: !153, line: 77, baseType: !20, size: 32, offset: 128)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !216, file: !153, line: 79, baseType: !20, size: 32, offset: 160)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !48, file: !32, line: 141, baseType: !106, size: 128, offset: 2944)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !48, file: !32, line: 142, baseType: !106, size: 128, offset: 3072)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !48, file: !32, line: 143, baseType: !106, size: 128, offset: 3200)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !48, file: !32, line: 144, baseType: !106, size: 128, offset: 3328)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !48, file: !32, line: 146, baseType: !20, size: 32, offset: 3456)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !48, file: !32, line: 147, baseType: !20, size: 32, offset: 3488)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !48, file: !32, line: 150, baseType: !236, size: 64, offset: 3520)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !32, line: 50, flags: DIFlagFwdDecl)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !48, file: !32, line: 151, baseType: !240, size: 64, offset: 3584)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !48, file: !32, line: 152, baseType: !20, size: 32, offset: 3648)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !48, file: !32, line: 153, baseType: !20, size: 32, offset: 3680)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !48, file: !32, line: 156, baseType: !179, size: 96, offset: 3712)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !48, file: !32, line: 156, baseType: !179, size: 96, offset: 3808)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !48, file: !32, line: 156, baseType: !179, size: 96, offset: 3904)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !48, file: !32, line: 157, baseType: !179, size: 96, offset: 4000)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !48, file: !32, line: 158, baseType: !179, size: 96, offset: 4096)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !48, file: !32, line: 159, baseType: !179, size: 96, offset: 4192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !48, file: !32, line: 160, baseType: !179, size: 96, offset: 4288)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !48, file: !32, line: 160, baseType: !179, size: 96, offset: 4384)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !48, file: !32, line: 161, baseType: !252, size: 128, offset: 4480)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 128, elements: !253)
!253 = !{!254}
!254 = !DISubrange(count: 4)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !48, file: !32, line: 161, baseType: !252, size: 128, offset: 4608)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !48, file: !32, line: 162, baseType: !179, size: 96, offset: 4736)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !48, file: !32, line: 162, baseType: !179, size: 96, offset: 4832)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !48, file: !32, line: 163, baseType: !144, size: 32, offset: 4928)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !48, file: !32, line: 163, baseType: !144, size: 32, offset: 4960)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !48, file: !32, line: 164, baseType: !261, size: 512, offset: 4992)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 512, elements: !262)
!262 = !{!254, !254}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !48, file: !32, line: 165, baseType: !261, size: 512, offset: 5504)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !48, file: !32, line: 166, baseType: !261, size: 512, offset: 6016)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !48, file: !32, line: 167, baseType: !261, size: 512, offset: 6528)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !48, file: !32, line: 176, baseType: !261, size: 512, offset: 7040)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !48, file: !32, line: 178, baseType: !5, size: 32, offset: 7552)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !48, file: !32, line: 180, baseType: !83, size: 16, offset: 7584)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !48, file: !32, line: 181, baseType: !83, size: 16, offset: 7600)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !48, file: !32, line: 183, baseType: !83, size: 16, offset: 7616)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !48, file: !32, line: 183, baseType: !83, size: 16, offset: 7632)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !48, file: !32, line: 184, baseType: !83, size: 16, offset: 7648)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !48, file: !32, line: 184, baseType: !83, size: 16, offset: 7664)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !48, file: !32, line: 185, baseType: !83, size: 16, offset: 7680)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !48, file: !32, line: 186, baseType: !83, size: 16, offset: 7696)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !48, file: !32, line: 187, baseType: !83, size: 16, offset: 7712)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !48, file: !32, line: 188, baseType: !38, size: 8, offset: 7728)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !48, file: !32, line: 189, baseType: !38, size: 8, offset: 7736)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !48, file: !32, line: 192, baseType: !20, size: 32, offset: 7744)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !48, file: !32, line: 192, baseType: !20, size: 32, offset: 7776)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !48, file: !32, line: 192, baseType: !20, size: 32, offset: 7808)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !48, file: !32, line: 192, baseType: !20, size: 32, offset: 7840)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !48, file: !32, line: 194, baseType: !20, size: 32, offset: 7872)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !48, file: !32, line: 202, baseType: !144, size: 32, offset: 7904)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !48, file: !32, line: 202, baseType: !144, size: 32, offset: 7936)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !48, file: !32, line: 202, baseType: !144, size: 32, offset: 7968)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !48, file: !32, line: 211, baseType: !144, size: 32, offset: 8000)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !48, file: !32, line: 212, baseType: !144, size: 32, offset: 8032)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !48, file: !32, line: 213, baseType: !144, size: 32, offset: 8064)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !48, file: !32, line: 214, baseType: !144, size: 32, offset: 8096)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !48, file: !32, line: 215, baseType: !144, size: 32, offset: 8128)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !48, file: !32, line: 216, baseType: !144, size: 32, offset: 8160)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !48, file: !32, line: 219, baseType: !144, size: 32, offset: 8192)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !48, file: !32, line: 220, baseType: !144, size: 32, offset: 8224)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !48, file: !32, line: 221, baseType: !144, size: 32, offset: 8256)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !48, file: !32, line: 224, baseType: !21, size: 16, offset: 8288)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !48, file: !32, line: 224, baseType: !21, size: 16, offset: 8304)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !48, file: !32, line: 226, baseType: !83, size: 16, offset: 8320)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !48, file: !32, line: 228, baseType: !38, size: 8, offset: 8336)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !48, file: !32, line: 229, baseType: !38, size: 8, offset: 8344)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !48, file: !32, line: 231, baseType: !83, size: 16, offset: 8352)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !48, file: !32, line: 232, baseType: !38, size: 8, offset: 8368)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !48, file: !32, line: 233, baseType: !38, size: 8, offset: 8376)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !48, file: !32, line: 234, baseType: !144, size: 32, offset: 8384)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !48, file: !32, line: 235, baseType: !144, size: 32, offset: 8416)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !48, file: !32, line: 237, baseType: !106, size: 128, offset: 8448)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !48, file: !32, line: 238, baseType: !106, size: 128, offset: 8576)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !48, file: !32, line: 239, baseType: !106, size: 128, offset: 8704)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !48, file: !32, line: 240, baseType: !106, size: 128, offset: 8832)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !48, file: !32, line: 242, baseType: !144, size: 32, offset: 8960)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !48, file: !32, line: 244, baseType: !83, size: 16, offset: 8992)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !48, file: !32, line: 245, baseType: !21, size: 16, offset: 9008)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !48, file: !32, line: 246, baseType: !252, size: 128, offset: 9024)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !48, file: !32, line: 248, baseType: !20, size: 32, offset: 9152)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !48, file: !32, line: 249, baseType: !20, size: 32, offset: 9184)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !48, file: !32, line: 251, baseType: !317, size: 64, offset: 9216)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !32, line: 251, flags: DIFlagFwdDecl)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !48, file: !32, line: 253, baseType: !38, size: 8, offset: 9280)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !48, file: !32, line: 254, baseType: !38, size: 8, offset: 9288)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !48, file: !32, line: 255, baseType: !83, size: 16, offset: 9296)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !48, file: !32, line: 256, baseType: !179, size: 96, offset: 9312)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !48, file: !32, line: 258, baseType: !106, size: 128, offset: 9408)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !48, file: !32, line: 259, baseType: !106, size: 128, offset: 9536)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !48, file: !32, line: 260, baseType: !106, size: 128, offset: 9664)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !48, file: !32, line: 261, baseType: !106, size: 128, offset: 9792)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !48, file: !32, line: 263, baseType: !328, size: 64, offset: 9920)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !32, line: 52, flags: DIFlagFwdDecl)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !48, file: !32, line: 264, baseType: !331, size: 64, offset: 9984)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !32, line: 53, flags: DIFlagFwdDecl)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !48, file: !32, line: 265, baseType: !334, size: 64, offset: 10048)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !153, line: 46, flags: DIFlagFwdDecl)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !48, file: !32, line: 267, baseType: !38, size: 8, offset: 10112)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !48, file: !32, line: 268, baseType: !38, size: 8, offset: 10120)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !48, file: !32, line: 269, baseType: !83, size: 16, offset: 10128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !48, file: !32, line: 270, baseType: !144, size: 32, offset: 10144)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !48, file: !32, line: 272, baseType: !341, size: 64, offset: 10176)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !32, line: 54, flags: DIFlagFwdDecl)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !48, file: !32, line: 275, baseType: !344, size: 64, offset: 10240)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !32, line: 275, flags: DIFlagFwdDecl)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !48, file: !32, line: 277, baseType: !347, size: 64, offset: 10304)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !32, line: 56, flags: DIFlagFwdDecl)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !48, file: !32, line: 277, baseType: !347, size: 64, offset: 10368)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !48, file: !32, line: 278, baseType: !351, size: 64, offset: 10432)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !352, line: 27, baseType: !353)
!352 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !354, line: 45, baseType: !355)
!354 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!355 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !48, file: !32, line: 279, baseType: !351, size: 64, offset: 10496)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !48, file: !32, line: 280, baseType: !5, size: 32, offset: 10560)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !48, file: !32, line: 281, baseType: !5, size: 32, offset: 10592)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !48, file: !32, line: 283, baseType: !106, size: 128, offset: 10624)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !48, file: !32, line: 284, baseType: !106, size: 128, offset: 10752)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !48, file: !32, line: 285, baseType: !362, size: 64, offset: 10880)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !48, file: !32, line: 287, baseType: !364, size: 64, offset: 10944)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !32, line: 59, flags: DIFlagFwdDecl)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !48, file: !32, line: 288, baseType: !367, size: 64, offset: 11008)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !32, line: 288, flags: DIFlagFwdDecl)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !48, file: !32, line: 290, baseType: !370, size: 64, offset: 11072)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 64, elements: !371)
!371 = !{!372}
!372 = !DISubrange(count: 2)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !48, file: !32, line: 291, baseType: !374, size: 64, offset: 11136)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !376, line: 65, baseType: !377)
!376 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !376, line: 50, size: 320, elements: !378)
!378 = !{!379, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !377, file: !376, line: 51, baseType: !380, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !376, line: 40, flags: DIFlagFwdDecl)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !377, file: !376, line: 53, baseType: !20, size: 32, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !377, file: !376, line: 54, baseType: !20, size: 32, offset: 96)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !377, file: !376, line: 55, baseType: !20, size: 32, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !377, file: !376, line: 55, baseType: !20, size: 32, offset: 160)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !377, file: !376, line: 56, baseType: !38, size: 8, offset: 192)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !377, file: !376, line: 56, baseType: !38, size: 8, offset: 200)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !377, file: !376, line: 57, baseType: !38, size: 8, offset: 208)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !377, file: !376, line: 57, baseType: !38, size: 8, offset: 216)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !377, file: !376, line: 59, baseType: !83, size: 16, offset: 224)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !377, file: !376, line: 59, baseType: !83, size: 16, offset: 240)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !377, file: !376, line: 59, baseType: !83, size: 16, offset: 256)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !377, file: !376, line: 61, baseType: !83, size: 16, offset: 272)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !377, file: !376, line: 63, baseType: !20, size: 32, offset: 288)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !48, file: !32, line: 293, baseType: !106, size: 128, offset: 11200)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !48, file: !32, line: 294, baseType: !397, size: 64, offset: 11328)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !32, line: 113, baseType: !399)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !32, line: 108, size: 256, elements: !400)
!400 = !{!401, !403, !404, !405, !406}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !399, file: !32, line: 109, baseType: !402, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !399, file: !32, line: 109, baseType: !402, size: 64, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !399, file: !32, line: 110, baseType: !130, size: 64, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !399, file: !32, line: 111, baseType: !20, size: 32, offset: 192)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !399, file: !32, line: 112, baseType: !144, size: 32, offset: 224)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!409 = !{}
!410 = !DILocalVariable(name: "ob", arg: 1, scope: !27, file: !1, line: 54, type: !46)
!411 = !DILocation(line: 54, column: 40, scope: !27)
!412 = !DILocalVariable(name: "name", arg: 2, scope: !27, file: !1, line: 54, type: !407)
!413 = !DILocation(line: 54, column: 56, scope: !27)
!414 = !DILocalVariable(name: "defgroup", scope: !27, file: !1, line: 56, type: !415)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "bDeformGroup", file: !32, line: 68, baseType: !31)
!417 = !DILocation(line: 56, column: 16, scope: !27)
!418 = !DILocation(line: 60, column: 13, scope: !27)
!419 = !DILocation(line: 60, column: 11, scope: !27)
!420 = !DILocation(line: 62, column: 14, scope: !27)
!421 = !DILocation(line: 62, column: 24, scope: !27)
!422 = !DILocation(line: 62, column: 30, scope: !27)
!423 = !DILocation(line: 62, column: 2, scope: !27)
!424 = !DILocation(line: 64, column: 15, scope: !27)
!425 = !DILocation(line: 64, column: 19, scope: !27)
!426 = !DILocation(line: 64, column: 28, scope: !27)
!427 = !DILocation(line: 64, column: 2, scope: !27)
!428 = !DILocation(line: 65, column: 23, scope: !27)
!429 = !DILocation(line: 65, column: 33, scope: !27)
!430 = !DILocation(line: 65, column: 2, scope: !27)
!431 = !DILocation(line: 67, column: 9, scope: !27)
!432 = !DILocation(line: 67, column: 2, scope: !27)
!433 = distinct !DISubprogram(name: "defgroup_unique_name", scope: !1, file: !1, line: 551, type: !434, scopeLine: 552, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !409)
!434 = !DISubroutineType(types: !435)
!435 = !{null, !415, !46}
!436 = !DILocalVariable(name: "dg", arg: 1, scope: !433, file: !1, line: 551, type: !415)
!437 = !DILocation(line: 551, column: 41, scope: !433)
!438 = !DILocalVariable(name: "ob", arg: 2, scope: !433, file: !1, line: 551, type: !46)
!439 = !DILocation(line: 551, column: 53, scope: !433)
!440 = !DILocalVariable(name: "data", scope: !433, file: !1, line: 553, type: !441)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !433, file: !1, line: 553, size: 128, elements: !442)
!442 = !{!443, !444}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "ob", scope: !441, file: !1, line: 553, baseType: !46, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "dg", scope: !441, file: !1, line: 553, baseType: !22, size: 64, offset: 64)
!445 = !DILocation(line: 553, column: 34, scope: !433)
!446 = !DILocation(line: 554, column: 12, scope: !433)
!447 = !DILocation(line: 554, column: 7, scope: !433)
!448 = !DILocation(line: 554, column: 10, scope: !433)
!449 = !DILocation(line: 555, column: 12, scope: !433)
!450 = !DILocation(line: 555, column: 7, scope: !433)
!451 = !DILocation(line: 555, column: 10, scope: !433)
!452 = !DILocation(line: 557, column: 43, scope: !433)
!453 = !DILocation(line: 557, column: 71, scope: !433)
!454 = !DILocation(line: 557, column: 75, scope: !433)
!455 = !DILocation(line: 557, column: 2, scope: !433)
!456 = !DILocation(line: 558, column: 1, scope: !433)
!457 = distinct !DISubprogram(name: "defgroup_copy_list", scope: !1, file: !1, line: 70, type: !458, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !409)
!458 = !DISubroutineType(types: !459)
!459 = !{null, !362, !362}
!460 = !DILocalVariable(name: "outbase", arg: 1, scope: !457, file: !1, line: 70, type: !362)
!461 = !DILocation(line: 70, column: 35, scope: !457)
!462 = !DILocalVariable(name: "inbase", arg: 2, scope: !457, file: !1, line: 70, type: !362)
!463 = !DILocation(line: 70, column: 54, scope: !457)
!464 = !DILocalVariable(name: "defgroup", scope: !457, file: !1, line: 72, type: !415)
!465 = !DILocation(line: 72, column: 16, scope: !457)
!466 = !DILocalVariable(name: "defgroupn", scope: !457, file: !1, line: 72, type: !415)
!467 = !DILocation(line: 72, column: 27, scope: !457)
!468 = !DILocation(line: 74, column: 21, scope: !457)
!469 = !DILocation(line: 74, column: 2, scope: !457)
!470 = !DILocation(line: 76, column: 18, scope: !471)
!471 = distinct !DILexicalBlock(scope: !457, file: !1, line: 76, column: 2)
!472 = !DILocation(line: 76, column: 26, scope: !471)
!473 = !DILocation(line: 76, column: 16, scope: !471)
!474 = !DILocation(line: 76, column: 7, scope: !471)
!475 = !DILocation(line: 76, column: 33, scope: !476)
!476 = distinct !DILexicalBlock(scope: !471, file: !1, line: 76, column: 2)
!477 = !DILocation(line: 76, column: 2, scope: !471)
!478 = !DILocation(line: 77, column: 34, scope: !479)
!479 = distinct !DILexicalBlock(scope: !476, file: !1, line: 76, column: 70)
!480 = !DILocation(line: 77, column: 15, scope: !479)
!481 = !DILocation(line: 77, column: 13, scope: !479)
!482 = !DILocation(line: 78, column: 15, scope: !479)
!483 = !DILocation(line: 78, column: 24, scope: !479)
!484 = !DILocation(line: 78, column: 3, scope: !479)
!485 = !DILocation(line: 79, column: 2, scope: !479)
!486 = !DILocation(line: 76, column: 54, scope: !476)
!487 = !DILocation(line: 76, column: 64, scope: !476)
!488 = !DILocation(line: 76, column: 52, scope: !476)
!489 = !DILocation(line: 76, column: 2, scope: !476)
!490 = distinct !{!490, !477, !491}
!491 = !DILocation(line: 79, column: 2, scope: !471)
!492 = !DILocation(line: 80, column: 1, scope: !457)
!493 = distinct !DISubprogram(name: "BLI_listbase_clear", scope: !494, file: !494, line: 89, type: !495, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !409)
!494 = !DIFile(filename: "blender/source/blender/blenlib/BLI_listbase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!495 = !DISubroutineType(types: !496)
!496 = !{null, !497}
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!498 = !DILocalVariable(name: "lb", arg: 1, scope: !493, file: !494, line: 89, type: !497)
!499 = !DILocation(line: 89, column: 53, scope: !493)
!500 = !DILocation(line: 89, column: 71, scope: !493)
!501 = !DILocation(line: 89, column: 75, scope: !493)
!502 = !DILocation(line: 89, column: 80, scope: !493)
!503 = !DILocation(line: 89, column: 59, scope: !493)
!504 = !DILocation(line: 89, column: 63, scope: !493)
!505 = !DILocation(line: 89, column: 69, scope: !493)
!506 = !DILocation(line: 89, column: 93, scope: !493)
!507 = distinct !DISubprogram(name: "defgroup_duplicate", scope: !1, file: !1, line: 82, type: !508, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !409)
!508 = !DISubroutineType(types: !509)
!509 = !{!30, !415}
!510 = !DILocalVariable(name: "ingroup", arg: 1, scope: !507, file: !1, line: 82, type: !415)
!511 = !DILocation(line: 82, column: 48, scope: !507)
!512 = !DILocalVariable(name: "outgroup", scope: !507, file: !1, line: 84, type: !415)
!513 = !DILocation(line: 84, column: 16, scope: !507)
!514 = !DILocation(line: 86, column: 7, scope: !515)
!515 = distinct !DILexicalBlock(scope: !507, file: !1, line: 86, column: 6)
!516 = !DILocation(line: 86, column: 6, scope: !507)
!517 = !DILocation(line: 87, column: 3, scope: !515)
!518 = !DILocation(line: 89, column: 13, scope: !507)
!519 = !DILocation(line: 89, column: 11, scope: !507)
!520 = !DILocation(line: 92, column: 9, scope: !507)
!521 = !DILocation(line: 92, column: 2, scope: !507)
!522 = !DILocation(line: 92, column: 19, scope: !507)
!523 = !DILocation(line: 94, column: 19, scope: !507)
!524 = !DILocation(line: 94, column: 29, scope: !507)
!525 = !DILocation(line: 94, column: 34, scope: !507)
!526 = !DILocation(line: 94, column: 2, scope: !507)
!527 = !DILocation(line: 94, column: 12, scope: !507)
!528 = !DILocation(line: 94, column: 17, scope: !507)
!529 = !DILocation(line: 96, column: 9, scope: !507)
!530 = !DILocation(line: 96, column: 2, scope: !507)
!531 = !DILocation(line: 97, column: 1, scope: !507)
!532 = distinct !DISubprogram(name: "defvert_copy_subset", scope: !1, file: !1, line: 103, type: !533, scopeLine: 105, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !409)
!533 = !DISubroutineType(types: !534)
!534 = !{null, !535, !548, !550, !553}
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "MDeformVert", file: !537, line: 63, baseType: !538)
!537 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !537, line: 59, size: 128, elements: !539)
!539 = !{!540, !546, !547}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "dw", scope: !538, file: !537, line: 60, baseType: !541, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformWeight", file: !537, line: 54, size: 64, elements: !543)
!543 = !{!544, !545}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "def_nr", scope: !542, file: !537, line: 55, baseType: !20, size: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !542, file: !537, line: 56, baseType: !144, size: 32, offset: 32)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "totweight", scope: !538, file: !537, line: 61, baseType: !20, size: 32, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !538, file: !537, line: 62, baseType: !20, size: 32, offset: 96)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !536)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !552)
!552 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!553 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!554 = !DILocalVariable(name: "dvert_dst", arg: 1, scope: !532, file: !1, line: 103, type: !535)
!555 = !DILocation(line: 103, column: 39, scope: !532)
!556 = !DILocalVariable(name: "dvert_src", arg: 2, scope: !532, file: !1, line: 103, type: !548)
!557 = !DILocation(line: 103, column: 69, scope: !532)
!558 = !DILocalVariable(name: "vgroup_subset", arg: 3, scope: !532, file: !1, line: 104, type: !550)
!559 = !DILocation(line: 104, column: 38, scope: !532)
!560 = !DILocalVariable(name: "vgroup_tot", arg: 4, scope: !532, file: !1, line: 104, type: !553)
!561 = !DILocation(line: 104, column: 63, scope: !532)
!562 = !DILocalVariable(name: "defgroup", scope: !532, file: !1, line: 106, type: !20)
!563 = !DILocation(line: 106, column: 6, scope: !532)
!564 = !DILocation(line: 107, column: 16, scope: !565)
!565 = distinct !DILexicalBlock(scope: !532, file: !1, line: 107, column: 2)
!566 = !DILocation(line: 107, column: 7, scope: !565)
!567 = !DILocation(line: 107, column: 21, scope: !568)
!568 = distinct !DILexicalBlock(scope: !565, file: !1, line: 107, column: 2)
!569 = !DILocation(line: 107, column: 32, scope: !568)
!570 = !DILocation(line: 107, column: 30, scope: !568)
!571 = !DILocation(line: 107, column: 2, scope: !565)
!572 = !DILocation(line: 108, column: 7, scope: !573)
!573 = distinct !DILexicalBlock(scope: !574, file: !1, line: 108, column: 7)
!574 = distinct !DILexicalBlock(scope: !568, file: !1, line: 107, column: 56)
!575 = !DILocation(line: 108, column: 21, scope: !573)
!576 = !DILocation(line: 108, column: 7, scope: !574)
!577 = !DILocation(line: 109, column: 23, scope: !578)
!578 = distinct !DILexicalBlock(scope: !573, file: !1, line: 108, column: 32)
!579 = !DILocation(line: 109, column: 34, scope: !578)
!580 = !DILocation(line: 109, column: 45, scope: !578)
!581 = !DILocation(line: 109, column: 4, scope: !578)
!582 = !DILocation(line: 110, column: 3, scope: !578)
!583 = !DILocation(line: 111, column: 2, scope: !574)
!584 = !DILocation(line: 107, column: 52, scope: !568)
!585 = !DILocation(line: 107, column: 2, scope: !568)
!586 = distinct !{!586, !571, !587}
!587 = !DILocation(line: 111, column: 2, scope: !565)
!588 = !DILocation(line: 112, column: 1, scope: !532)
!589 = distinct !DISubprogram(name: "defvert_copy_index", scope: !1, file: !1, line: 137, type: !590, scopeLine: 138, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !409)
!590 = !DISubroutineType(types: !591)
!591 = !{null, !535, !548, !553}
!592 = !DILocalVariable(name: "dvert_dst", arg: 1, scope: !589, file: !1, line: 137, type: !535)
!593 = !DILocation(line: 137, column: 38, scope: !589)
!594 = !DILocalVariable(name: "dvert_src", arg: 2, scope: !589, file: !1, line: 137, type: !548)
!595 = !DILocation(line: 137, column: 68, scope: !589)
!596 = !DILocalVariable(name: "defgroup", arg: 3, scope: !589, file: !1, line: 137, type: !553)
!597 = !DILocation(line: 137, column: 89, scope: !589)
!598 = !DILocalVariable(name: "dw_src", scope: !589, file: !1, line: 139, type: !599)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "MDeformWeight", file: !537, line: 57, baseType: !542)
!601 = !DILocation(line: 139, column: 17, scope: !589)
!602 = !DILocalVariable(name: "dw_dst", scope: !589, file: !1, line: 139, type: !599)
!603 = !DILocation(line: 139, column: 26, scope: !589)
!604 = !DILocation(line: 141, column: 30, scope: !589)
!605 = !DILocation(line: 141, column: 41, scope: !589)
!606 = !DILocation(line: 141, column: 11, scope: !589)
!607 = !DILocation(line: 141, column: 9, scope: !589)
!608 = !DILocation(line: 143, column: 6, scope: !609)
!609 = distinct !DILexicalBlock(scope: !589, file: !1, line: 143, column: 6)
!610 = !DILocation(line: 143, column: 6, scope: !589)
!611 = !DILocation(line: 145, column: 33, scope: !612)
!612 = distinct !DILexicalBlock(scope: !609, file: !1, line: 143, column: 14)
!613 = !DILocation(line: 145, column: 44, scope: !612)
!614 = !DILocation(line: 145, column: 12, scope: !612)
!615 = !DILocation(line: 145, column: 10, scope: !612)
!616 = !DILocation(line: 146, column: 20, scope: !612)
!617 = !DILocation(line: 146, column: 28, scope: !612)
!618 = !DILocation(line: 146, column: 3, scope: !612)
!619 = !DILocation(line: 146, column: 11, scope: !612)
!620 = !DILocation(line: 146, column: 18, scope: !612)
!621 = !DILocation(line: 147, column: 2, scope: !612)
!622 = !DILocation(line: 150, column: 31, scope: !623)
!623 = distinct !DILexicalBlock(scope: !609, file: !1, line: 148, column: 7)
!624 = !DILocation(line: 150, column: 42, scope: !623)
!625 = !DILocation(line: 150, column: 12, scope: !623)
!626 = !DILocation(line: 150, column: 10, scope: !623)
!627 = !DILocation(line: 152, column: 7, scope: !628)
!628 = distinct !DILexicalBlock(scope: !623, file: !1, line: 152, column: 7)
!629 = !DILocation(line: 152, column: 7, scope: !623)
!630 = !DILocation(line: 153, column: 4, scope: !631)
!631 = distinct !DILexicalBlock(scope: !628, file: !1, line: 152, column: 15)
!632 = !DILocation(line: 153, column: 12, scope: !631)
!633 = !DILocation(line: 153, column: 19, scope: !631)
!634 = !DILocation(line: 154, column: 3, scope: !631)
!635 = !DILocation(line: 156, column: 1, scope: !589)
!636 = distinct !DISubprogram(name: "defvert_copy", scope: !1, file: !1, line: 114, type: !637, scopeLine: 115, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !409)
!637 = !DISubroutineType(types: !638)
!638 = !{null, !535, !548}
!639 = !DILocalVariable(name: "dvert_dst", arg: 1, scope: !636, file: !1, line: 114, type: !535)
!640 = !DILocation(line: 114, column: 32, scope: !636)
!641 = !DILocalVariable(name: "dvert_src", arg: 2, scope: !636, file: !1, line: 114, type: !548)
!642 = !DILocation(line: 114, column: 62, scope: !636)
!643 = !DILocation(line: 116, column: 6, scope: !644)
!644 = distinct !DILexicalBlock(scope: !636, file: !1, line: 116, column: 6)
!645 = !DILocation(line: 116, column: 17, scope: !644)
!646 = !DILocation(line: 116, column: 30, scope: !644)
!647 = !DILocation(line: 116, column: 41, scope: !644)
!648 = !DILocation(line: 116, column: 27, scope: !644)
!649 = !DILocation(line: 116, column: 6, scope: !636)
!650 = !DILocation(line: 117, column: 7, scope: !651)
!651 = distinct !DILexicalBlock(scope: !652, file: !1, line: 117, column: 7)
!652 = distinct !DILexicalBlock(scope: !644, file: !1, line: 116, column: 52)
!653 = !DILocation(line: 117, column: 18, scope: !651)
!654 = !DILocation(line: 117, column: 7, scope: !652)
!655 = !DILocation(line: 118, column: 11, scope: !651)
!656 = !DILocation(line: 118, column: 22, scope: !651)
!657 = !DILocation(line: 118, column: 4, scope: !651)
!658 = !DILocation(line: 118, column: 26, scope: !651)
!659 = !DILocation(line: 118, column: 37, scope: !651)
!660 = !DILocation(line: 118, column: 41, scope: !651)
!661 = !DILocation(line: 118, column: 52, scope: !651)
!662 = !DILocation(line: 118, column: 62, scope: !651)
!663 = !DILocation(line: 119, column: 2, scope: !652)
!664 = !DILocation(line: 121, column: 7, scope: !665)
!665 = distinct !DILexicalBlock(scope: !666, file: !1, line: 121, column: 7)
!666 = distinct !DILexicalBlock(scope: !644, file: !1, line: 120, column: 7)
!667 = !DILocation(line: 121, column: 18, scope: !665)
!668 = !DILocation(line: 121, column: 7, scope: !666)
!669 = !DILocation(line: 122, column: 4, scope: !665)
!670 = !DILocation(line: 122, column: 14, scope: !665)
!671 = !DILocation(line: 122, column: 25, scope: !665)
!672 = !DILocation(line: 124, column: 7, scope: !673)
!673 = distinct !DILexicalBlock(scope: !666, file: !1, line: 124, column: 7)
!674 = !DILocation(line: 124, column: 18, scope: !673)
!675 = !DILocation(line: 124, column: 7, scope: !666)
!676 = !DILocation(line: 125, column: 20, scope: !673)
!677 = !DILocation(line: 125, column: 34, scope: !673)
!678 = !DILocation(line: 125, column: 45, scope: !673)
!679 = !DILocation(line: 125, column: 4, scope: !673)
!680 = !DILocation(line: 125, column: 15, scope: !673)
!681 = !DILocation(line: 125, column: 18, scope: !673)
!682 = !DILocation(line: 127, column: 4, scope: !673)
!683 = !DILocation(line: 127, column: 15, scope: !673)
!684 = !DILocation(line: 127, column: 18, scope: !673)
!685 = !DILocation(line: 129, column: 26, scope: !666)
!686 = !DILocation(line: 129, column: 37, scope: !666)
!687 = !DILocation(line: 129, column: 3, scope: !666)
!688 = !DILocation(line: 129, column: 14, scope: !666)
!689 = !DILocation(line: 129, column: 24, scope: !666)
!690 = !DILocation(line: 131, column: 1, scope: !636)
!691 = distinct !DISubprogram(name: "defvert_find_index", scope: !1, file: !1, line: 752, type: !692, scopeLine: 753, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !409)
!692 = !DISubroutineType(types: !693)
!693 = !{!541, !548, !553}
!694 = !DILocalVariable(name: "dvert", arg: 1, scope: !691, file: !1, line: 752, type: !548)
!695 = !DILocation(line: 752, column: 54, scope: !691)
!696 = !DILocalVariable(name: "defgroup", arg: 2, scope: !691, file: !1, line: 752, type: !553)
!697 = !DILocation(line: 752, column: 71, scope: !691)
!698 = !DILocation(line: 754, column: 6, scope: !699)
!699 = distinct !DILexicalBlock(scope: !691, file: !1, line: 754, column: 6)
!700 = !DILocation(line: 754, column: 12, scope: !699)
!701 = !DILocation(line: 754, column: 15, scope: !699)
!702 = !DILocation(line: 754, column: 24, scope: !699)
!703 = !DILocation(line: 754, column: 6, scope: !691)
!704 = !DILocalVariable(name: "dw", scope: !705, file: !1, line: 755, type: !599)
!705 = distinct !DILexicalBlock(scope: !699, file: !1, line: 754, column: 30)
!706 = !DILocation(line: 755, column: 18, scope: !705)
!707 = !DILocation(line: 755, column: 23, scope: !705)
!708 = !DILocation(line: 755, column: 30, scope: !705)
!709 = !DILocalVariable(name: "i", scope: !705, file: !1, line: 756, type: !5)
!710 = !DILocation(line: 756, column: 16, scope: !705)
!711 = !DILocation(line: 758, column: 12, scope: !712)
!712 = distinct !DILexicalBlock(scope: !705, file: !1, line: 758, column: 3)
!713 = !DILocation(line: 758, column: 19, scope: !712)
!714 = !DILocation(line: 758, column: 10, scope: !712)
!715 = !DILocation(line: 758, column: 8, scope: !712)
!716 = !DILocation(line: 758, column: 30, scope: !717)
!717 = distinct !DILexicalBlock(scope: !712, file: !1, line: 758, column: 3)
!718 = !DILocation(line: 758, column: 32, scope: !717)
!719 = !DILocation(line: 758, column: 3, scope: !712)
!720 = !DILocation(line: 759, column: 8, scope: !721)
!721 = distinct !DILexicalBlock(scope: !722, file: !1, line: 759, column: 8)
!722 = distinct !DILexicalBlock(scope: !717, file: !1, line: 758, column: 49)
!723 = !DILocation(line: 759, column: 12, scope: !721)
!724 = !DILocation(line: 759, column: 22, scope: !721)
!725 = !DILocation(line: 759, column: 19, scope: !721)
!726 = !DILocation(line: 759, column: 8, scope: !722)
!727 = !DILocation(line: 760, column: 12, scope: !728)
!728 = distinct !DILexicalBlock(scope: !721, file: !1, line: 759, column: 32)
!729 = !DILocation(line: 760, column: 5, scope: !728)
!730 = !DILocation(line: 762, column: 3, scope: !722)
!731 = !DILocation(line: 758, column: 39, scope: !717)
!732 = !DILocation(line: 758, column: 45, scope: !717)
!733 = !DILocation(line: 758, column: 3, scope: !717)
!734 = distinct !{!734, !719, !735}
!735 = !DILocation(line: 762, column: 3, scope: !712)
!736 = !DILocation(line: 763, column: 2, scope: !705)
!737 = !DILocation(line: 765, column: 2, scope: !691)
!738 = !DILocation(line: 766, column: 1, scope: !691)
!739 = distinct !DISubprogram(name: "defvert_verify_index", scope: !1, file: !1, line: 770, type: !740, scopeLine: 771, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !409)
!740 = !DISubroutineType(types: !741)
!741 = !{!541, !535, !553}
!742 = !DILocalVariable(name: "dvert", arg: 1, scope: !739, file: !1, line: 770, type: !535)
!743 = !DILocation(line: 770, column: 50, scope: !739)
!744 = !DILocalVariable(name: "defgroup", arg: 2, scope: !739, file: !1, line: 770, type: !553)
!745 = !DILocation(line: 770, column: 67, scope: !739)
!746 = !DILocalVariable(name: "dw_new", scope: !739, file: !1, line: 772, type: !599)
!747 = !DILocation(line: 772, column: 17, scope: !739)
!748 = !DILocation(line: 775, column: 7, scope: !749)
!749 = distinct !DILexicalBlock(scope: !739, file: !1, line: 775, column: 6)
!750 = !DILocation(line: 775, column: 13, scope: !749)
!751 = !DILocation(line: 775, column: 16, scope: !749)
!752 = !DILocation(line: 775, column: 25, scope: !749)
!753 = !DILocation(line: 775, column: 6, scope: !739)
!754 = !DILocation(line: 776, column: 3, scope: !749)
!755 = !DILocation(line: 778, column: 30, scope: !739)
!756 = !DILocation(line: 778, column: 37, scope: !739)
!757 = !DILocation(line: 778, column: 11, scope: !739)
!758 = !DILocation(line: 778, column: 9, scope: !739)
!759 = !DILocation(line: 779, column: 6, scope: !760)
!760 = distinct !DILexicalBlock(scope: !739, file: !1, line: 779, column: 6)
!761 = !DILocation(line: 779, column: 6, scope: !739)
!762 = !DILocation(line: 780, column: 10, scope: !760)
!763 = !DILocation(line: 780, column: 3, scope: !760)
!764 = !DILocation(line: 782, column: 11, scope: !739)
!765 = !DILocation(line: 782, column: 48, scope: !739)
!766 = !DILocation(line: 782, column: 55, scope: !739)
!767 = !DILocation(line: 782, column: 65, scope: !739)
!768 = !DILocation(line: 782, column: 47, scope: !739)
!769 = !DILocation(line: 782, column: 45, scope: !739)
!770 = !DILocation(line: 782, column: 9, scope: !739)
!771 = !DILocation(line: 783, column: 6, scope: !772)
!772 = distinct !DILexicalBlock(scope: !739, file: !1, line: 783, column: 6)
!773 = !DILocation(line: 783, column: 13, scope: !772)
!774 = !DILocation(line: 783, column: 6, scope: !739)
!775 = !DILocation(line: 784, column: 10, scope: !776)
!776 = distinct !DILexicalBlock(scope: !772, file: !1, line: 783, column: 17)
!777 = !DILocation(line: 784, column: 3, scope: !776)
!778 = !DILocation(line: 784, column: 18, scope: !776)
!779 = !DILocation(line: 784, column: 25, scope: !776)
!780 = !DILocation(line: 784, column: 53, scope: !776)
!781 = !DILocation(line: 784, column: 60, scope: !776)
!782 = !DILocation(line: 784, column: 51, scope: !776)
!783 = !DILocation(line: 785, column: 3, scope: !776)
!784 = !DILocation(line: 785, column: 13, scope: !776)
!785 = !DILocation(line: 785, column: 20, scope: !776)
!786 = !DILocation(line: 786, column: 2, scope: !776)
!787 = !DILocation(line: 787, column: 14, scope: !739)
!788 = !DILocation(line: 787, column: 2, scope: !739)
!789 = !DILocation(line: 787, column: 9, scope: !739)
!790 = !DILocation(line: 787, column: 12, scope: !739)
!791 = !DILocation(line: 788, column: 12, scope: !739)
!792 = !DILocation(line: 788, column: 19, scope: !739)
!793 = !DILocation(line: 788, column: 9, scope: !739)
!794 = !DILocation(line: 789, column: 2, scope: !739)
!795 = !DILocation(line: 789, column: 10, scope: !739)
!796 = !DILocation(line: 789, column: 17, scope: !739)
!797 = !DILocation(line: 790, column: 19, scope: !739)
!798 = !DILocation(line: 790, column: 2, scope: !739)
!799 = !DILocation(line: 790, column: 10, scope: !739)
!800 = !DILocation(line: 790, column: 17, scope: !739)
!801 = !DILocation(line: 793, column: 2, scope: !739)
!802 = !DILocation(line: 793, column: 9, scope: !739)
!803 = !DILocation(line: 793, column: 18, scope: !739)
!804 = !DILocation(line: 795, column: 9, scope: !739)
!805 = !DILocation(line: 795, column: 2, scope: !739)
!806 = !DILocation(line: 796, column: 1, scope: !739)
!807 = distinct !DISubprogram(name: "defvert_sync", scope: !1, file: !1, line: 161, type: !808, scopeLine: 162, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !409)
!808 = !DISubroutineType(types: !809)
!809 = !{null, !535, !548, !551}
!810 = !DILocalVariable(name: "dvert_dst", arg: 1, scope: !807, file: !1, line: 161, type: !535)
!811 = !DILocation(line: 161, column: 32, scope: !807)
!812 = !DILocalVariable(name: "dvert_src", arg: 2, scope: !807, file: !1, line: 161, type: !548)
!813 = !DILocation(line: 161, column: 62, scope: !807)
!814 = !DILocalVariable(name: "use_verify", arg: 3, scope: !807, file: !1, line: 161, type: !551)
!815 = !DILocation(line: 161, column: 84, scope: !807)
!816 = !DILocation(line: 163, column: 6, scope: !817)
!817 = distinct !DILexicalBlock(scope: !807, file: !1, line: 163, column: 6)
!818 = !DILocation(line: 163, column: 17, scope: !817)
!819 = !DILocation(line: 163, column: 27, scope: !817)
!820 = !DILocation(line: 163, column: 30, scope: !817)
!821 = !DILocation(line: 163, column: 41, scope: !817)
!822 = !DILocation(line: 163, column: 6, scope: !807)
!823 = !DILocalVariable(name: "i", scope: !824, file: !1, line: 164, type: !20)
!824 = distinct !DILexicalBlock(scope: !817, file: !1, line: 163, column: 52)
!825 = !DILocation(line: 164, column: 7, scope: !824)
!826 = !DILocalVariable(name: "dw_src", scope: !824, file: !1, line: 165, type: !599)
!827 = !DILocation(line: 165, column: 18, scope: !824)
!828 = !DILocation(line: 166, column: 10, scope: !829)
!829 = distinct !DILexicalBlock(scope: !824, file: !1, line: 166, column: 3)
!830 = !DILocation(line: 166, column: 24, scope: !829)
!831 = !DILocation(line: 166, column: 35, scope: !829)
!832 = !DILocation(line: 166, column: 22, scope: !829)
!833 = !DILocation(line: 166, column: 8, scope: !829)
!834 = !DILocation(line: 166, column: 39, scope: !835)
!835 = distinct !DILexicalBlock(scope: !829, file: !1, line: 166, column: 3)
!836 = !DILocation(line: 166, column: 43, scope: !835)
!837 = !DILocation(line: 166, column: 54, scope: !835)
!838 = !DILocation(line: 166, column: 41, scope: !835)
!839 = !DILocation(line: 166, column: 3, scope: !829)
!840 = !DILocalVariable(name: "dw_dst", scope: !841, file: !1, line: 167, type: !599)
!841 = distinct !DILexicalBlock(scope: !835, file: !1, line: 166, column: 80)
!842 = !DILocation(line: 167, column: 19, scope: !841)
!843 = !DILocation(line: 168, column: 8, scope: !844)
!844 = distinct !DILexicalBlock(scope: !841, file: !1, line: 168, column: 8)
!845 = !DILocation(line: 168, column: 8, scope: !841)
!846 = !DILocation(line: 168, column: 50, scope: !844)
!847 = !DILocation(line: 168, column: 61, scope: !844)
!848 = !DILocation(line: 168, column: 69, scope: !844)
!849 = !DILocation(line: 168, column: 29, scope: !844)
!850 = !DILocation(line: 168, column: 27, scope: !844)
!851 = !DILocation(line: 168, column: 20, scope: !844)
!852 = !DILocation(line: 169, column: 48, scope: !844)
!853 = !DILocation(line: 169, column: 59, scope: !844)
!854 = !DILocation(line: 169, column: 67, scope: !844)
!855 = !DILocation(line: 169, column: 29, scope: !844)
!856 = !DILocation(line: 169, column: 27, scope: !844)
!857 = !DILocation(line: 171, column: 8, scope: !858)
!858 = distinct !DILexicalBlock(scope: !841, file: !1, line: 171, column: 8)
!859 = !DILocation(line: 171, column: 8, scope: !841)
!860 = !DILocation(line: 172, column: 22, scope: !861)
!861 = distinct !DILexicalBlock(scope: !858, file: !1, line: 171, column: 16)
!862 = !DILocation(line: 172, column: 30, scope: !861)
!863 = !DILocation(line: 172, column: 5, scope: !861)
!864 = !DILocation(line: 172, column: 13, scope: !861)
!865 = !DILocation(line: 172, column: 20, scope: !861)
!866 = !DILocation(line: 173, column: 4, scope: !861)
!867 = !DILocation(line: 174, column: 3, scope: !841)
!868 = !DILocation(line: 166, column: 66, scope: !835)
!869 = !DILocation(line: 166, column: 76, scope: !835)
!870 = !DILocation(line: 166, column: 3, scope: !835)
!871 = distinct !{!871, !839, !872}
!872 = !DILocation(line: 174, column: 3, scope: !829)
!873 = !DILocation(line: 175, column: 2, scope: !824)
!874 = !DILocation(line: 176, column: 1, scope: !807)
!875 = distinct !DISubprogram(name: "defvert_sync_mapped", scope: !1, file: !1, line: 179, type: !876, scopeLine: 181, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !409)
!876 = !DISubroutineType(types: !877)
!877 = !{null, !535, !548, !878, !553, !551}
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!879 = !DILocalVariable(name: "dvert_dst", arg: 1, scope: !875, file: !1, line: 179, type: !535)
!880 = !DILocation(line: 179, column: 39, scope: !875)
!881 = !DILocalVariable(name: "dvert_src", arg: 2, scope: !875, file: !1, line: 179, type: !548)
!882 = !DILocation(line: 179, column: 69, scope: !875)
!883 = !DILocalVariable(name: "flip_map", arg: 3, scope: !875, file: !1, line: 180, type: !878)
!884 = !DILocation(line: 180, column: 37, scope: !875)
!885 = !DILocalVariable(name: "flip_map_len", arg: 4, scope: !875, file: !1, line: 180, type: !553)
!886 = !DILocation(line: 180, column: 57, scope: !875)
!887 = !DILocalVariable(name: "use_verify", arg: 5, scope: !875, file: !1, line: 180, type: !551)
!888 = !DILocation(line: 180, column: 82, scope: !875)
!889 = !DILocation(line: 182, column: 6, scope: !890)
!890 = distinct !DILexicalBlock(scope: !875, file: !1, line: 182, column: 6)
!891 = !DILocation(line: 182, column: 17, scope: !890)
!892 = !DILocation(line: 182, column: 27, scope: !890)
!893 = !DILocation(line: 182, column: 30, scope: !890)
!894 = !DILocation(line: 182, column: 41, scope: !890)
!895 = !DILocation(line: 182, column: 6, scope: !875)
!896 = !DILocalVariable(name: "i", scope: !897, file: !1, line: 183, type: !20)
!897 = distinct !DILexicalBlock(scope: !890, file: !1, line: 182, column: 52)
!898 = !DILocation(line: 183, column: 7, scope: !897)
!899 = !DILocalVariable(name: "dw_src", scope: !897, file: !1, line: 184, type: !599)
!900 = !DILocation(line: 184, column: 18, scope: !897)
!901 = !DILocation(line: 185, column: 10, scope: !902)
!902 = distinct !DILexicalBlock(scope: !897, file: !1, line: 185, column: 3)
!903 = !DILocation(line: 185, column: 24, scope: !902)
!904 = !DILocation(line: 185, column: 35, scope: !902)
!905 = !DILocation(line: 185, column: 22, scope: !902)
!906 = !DILocation(line: 185, column: 8, scope: !902)
!907 = !DILocation(line: 185, column: 39, scope: !908)
!908 = distinct !DILexicalBlock(scope: !902, file: !1, line: 185, column: 3)
!909 = !DILocation(line: 185, column: 43, scope: !908)
!910 = !DILocation(line: 185, column: 54, scope: !908)
!911 = !DILocation(line: 185, column: 41, scope: !908)
!912 = !DILocation(line: 185, column: 3, scope: !902)
!913 = !DILocation(line: 186, column: 8, scope: !914)
!914 = distinct !DILexicalBlock(scope: !915, file: !1, line: 186, column: 8)
!915 = distinct !DILexicalBlock(scope: !908, file: !1, line: 185, column: 80)
!916 = !DILocation(line: 186, column: 16, scope: !914)
!917 = !DILocation(line: 186, column: 25, scope: !914)
!918 = !DILocation(line: 186, column: 23, scope: !914)
!919 = !DILocation(line: 186, column: 8, scope: !915)
!920 = !DILocalVariable(name: "dw_dst", scope: !921, file: !1, line: 187, type: !599)
!921 = distinct !DILexicalBlock(scope: !914, file: !1, line: 186, column: 39)
!922 = !DILocation(line: 187, column: 20, scope: !921)
!923 = !DILocation(line: 188, column: 9, scope: !924)
!924 = distinct !DILexicalBlock(scope: !921, file: !1, line: 188, column: 9)
!925 = !DILocation(line: 188, column: 9, scope: !921)
!926 = !DILocation(line: 188, column: 51, scope: !924)
!927 = !DILocation(line: 188, column: 62, scope: !924)
!928 = !DILocation(line: 188, column: 71, scope: !924)
!929 = !DILocation(line: 188, column: 79, scope: !924)
!930 = !DILocation(line: 188, column: 30, scope: !924)
!931 = !DILocation(line: 188, column: 28, scope: !924)
!932 = !DILocation(line: 188, column: 21, scope: !924)
!933 = !DILocation(line: 189, column: 49, scope: !924)
!934 = !DILocation(line: 189, column: 60, scope: !924)
!935 = !DILocation(line: 189, column: 69, scope: !924)
!936 = !DILocation(line: 189, column: 77, scope: !924)
!937 = !DILocation(line: 189, column: 30, scope: !924)
!938 = !DILocation(line: 189, column: 28, scope: !924)
!939 = !DILocation(line: 191, column: 9, scope: !940)
!940 = distinct !DILexicalBlock(scope: !921, file: !1, line: 191, column: 9)
!941 = !DILocation(line: 191, column: 9, scope: !921)
!942 = !DILocation(line: 192, column: 23, scope: !943)
!943 = distinct !DILexicalBlock(scope: !940, file: !1, line: 191, column: 17)
!944 = !DILocation(line: 192, column: 31, scope: !943)
!945 = !DILocation(line: 192, column: 6, scope: !943)
!946 = !DILocation(line: 192, column: 14, scope: !943)
!947 = !DILocation(line: 192, column: 21, scope: !943)
!948 = !DILocation(line: 193, column: 5, scope: !943)
!949 = !DILocation(line: 194, column: 4, scope: !921)
!950 = !DILocation(line: 195, column: 3, scope: !915)
!951 = !DILocation(line: 185, column: 66, scope: !908)
!952 = !DILocation(line: 185, column: 76, scope: !908)
!953 = !DILocation(line: 185, column: 3, scope: !908)
!954 = distinct !{!954, !912, !955}
!955 = !DILocation(line: 195, column: 3, scope: !902)
!956 = !DILocation(line: 196, column: 2, scope: !897)
!957 = !DILocation(line: 197, column: 1, scope: !875)
!958 = distinct !DISubprogram(name: "defvert_remap", scope: !1, file: !1, line: 200, type: !959, scopeLine: 201, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !409)
!959 = !DISubroutineType(types: !960)
!960 = !{null, !535, !961, !553}
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!962 = !DILocalVariable(name: "dvert", arg: 1, scope: !958, file: !1, line: 200, type: !535)
!963 = !DILocation(line: 200, column: 33, scope: !958)
!964 = !DILocalVariable(name: "map", arg: 2, scope: !958, file: !1, line: 200, type: !961)
!965 = !DILocation(line: 200, column: 45, scope: !958)
!966 = !DILocalVariable(name: "map_len", arg: 3, scope: !958, file: !1, line: 200, type: !553)
!967 = !DILocation(line: 200, column: 60, scope: !958)
!968 = !DILocalVariable(name: "dw", scope: !958, file: !1, line: 202, type: !599)
!969 = !DILocation(line: 202, column: 17, scope: !958)
!970 = !DILocation(line: 202, column: 22, scope: !958)
!971 = !DILocation(line: 202, column: 29, scope: !958)
!972 = !DILocalVariable(name: "i", scope: !958, file: !1, line: 203, type: !5)
!973 = !DILocation(line: 203, column: 15, scope: !958)
!974 = !DILocation(line: 204, column: 11, scope: !975)
!975 = distinct !DILexicalBlock(scope: !958, file: !1, line: 204, column: 2)
!976 = !DILocation(line: 204, column: 18, scope: !975)
!977 = !DILocation(line: 204, column: 9, scope: !975)
!978 = !DILocation(line: 204, column: 7, scope: !975)
!979 = !DILocation(line: 204, column: 29, scope: !980)
!980 = distinct !DILexicalBlock(scope: !975, file: !1, line: 204, column: 2)
!981 = !DILocation(line: 204, column: 31, scope: !980)
!982 = !DILocation(line: 204, column: 2, scope: !975)
!983 = !DILocation(line: 205, column: 7, scope: !984)
!984 = distinct !DILexicalBlock(scope: !985, file: !1, line: 205, column: 7)
!985 = distinct !DILexicalBlock(scope: !980, file: !1, line: 204, column: 48)
!986 = !DILocation(line: 205, column: 11, scope: !984)
!987 = !DILocation(line: 205, column: 20, scope: !984)
!988 = !DILocation(line: 205, column: 18, scope: !984)
!989 = !DILocation(line: 205, column: 7, scope: !985)
!990 = !DILocation(line: 206, column: 17, scope: !991)
!991 = distinct !DILexicalBlock(scope: !984, file: !1, line: 205, column: 29)
!992 = !DILocation(line: 206, column: 21, scope: !991)
!993 = !DILocation(line: 206, column: 25, scope: !991)
!994 = !DILocation(line: 206, column: 4, scope: !991)
!995 = !DILocation(line: 206, column: 8, scope: !991)
!996 = !DILocation(line: 206, column: 15, scope: !991)
!997 = !DILocation(line: 210, column: 3, scope: !991)
!998 = !DILocation(line: 211, column: 2, scope: !985)
!999 = !DILocation(line: 204, column: 38, scope: !980)
!1000 = !DILocation(line: 204, column: 44, scope: !980)
!1001 = !DILocation(line: 204, column: 2, scope: !980)
!1002 = distinct !{!1002, !982, !1003}
!1003 = !DILocation(line: 211, column: 2, scope: !975)
!1004 = !DILocation(line: 212, column: 1, scope: !958)
!1005 = distinct !DISubprogram(name: "defvert_normalize_subset", scope: !1, file: !1, line: 217, type: !1006, scopeLine: 219, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !409)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{null, !535, !550, !553}
!1008 = !DILocalVariable(name: "dvert", arg: 1, scope: !1005, file: !1, line: 217, type: !535)
!1009 = !DILocation(line: 217, column: 44, scope: !1005)
!1010 = !DILocalVariable(name: "vgroup_subset", arg: 2, scope: !1005, file: !1, line: 218, type: !550)
!1011 = !DILocation(line: 218, column: 43, scope: !1005)
!1012 = !DILocalVariable(name: "vgroup_tot", arg: 3, scope: !1005, file: !1, line: 218, type: !553)
!1013 = !DILocation(line: 218, column: 68, scope: !1005)
!1014 = !DILocation(line: 220, column: 6, scope: !1015)
!1015 = distinct !DILexicalBlock(scope: !1005, file: !1, line: 220, column: 6)
!1016 = !DILocation(line: 220, column: 13, scope: !1015)
!1017 = !DILocation(line: 220, column: 23, scope: !1015)
!1018 = !DILocation(line: 220, column: 6, scope: !1005)
!1019 = !DILocation(line: 222, column: 2, scope: !1020)
!1020 = distinct !DILexicalBlock(scope: !1015, file: !1, line: 220, column: 29)
!1021 = !DILocation(line: 223, column: 11, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !1015, file: !1, line: 223, column: 11)
!1023 = !DILocation(line: 223, column: 18, scope: !1022)
!1024 = !DILocation(line: 223, column: 28, scope: !1022)
!1025 = !DILocation(line: 223, column: 11, scope: !1015)
!1026 = !DILocalVariable(name: "dw", scope: !1027, file: !1, line: 224, type: !599)
!1027 = distinct !DILexicalBlock(scope: !1022, file: !1, line: 223, column: 34)
!1028 = !DILocation(line: 224, column: 18, scope: !1027)
!1029 = !DILocation(line: 224, column: 23, scope: !1027)
!1030 = !DILocation(line: 224, column: 30, scope: !1027)
!1031 = !DILocation(line: 225, column: 8, scope: !1032)
!1032 = distinct !DILexicalBlock(scope: !1027, file: !1, line: 225, column: 7)
!1033 = !DILocation(line: 225, column: 12, scope: !1032)
!1034 = !DILocation(line: 225, column: 21, scope: !1032)
!1035 = !DILocation(line: 225, column: 19, scope: !1032)
!1036 = !DILocation(line: 225, column: 33, scope: !1032)
!1037 = !DILocation(line: 225, column: 36, scope: !1032)
!1038 = !DILocation(line: 225, column: 50, scope: !1032)
!1039 = !DILocation(line: 225, column: 54, scope: !1032)
!1040 = !DILocation(line: 225, column: 7, scope: !1027)
!1041 = !DILocation(line: 226, column: 4, scope: !1042)
!1042 = distinct !DILexicalBlock(scope: !1032, file: !1, line: 225, column: 63)
!1043 = !DILocation(line: 226, column: 8, scope: !1042)
!1044 = !DILocation(line: 226, column: 15, scope: !1042)
!1045 = !DILocation(line: 227, column: 3, scope: !1042)
!1046 = !DILocation(line: 228, column: 2, scope: !1027)
!1047 = !DILocalVariable(name: "dw", scope: !1048, file: !1, line: 230, type: !599)
!1048 = distinct !DILexicalBlock(scope: !1022, file: !1, line: 229, column: 7)
!1049 = !DILocation(line: 230, column: 18, scope: !1048)
!1050 = !DILocalVariable(name: "i", scope: !1048, file: !1, line: 231, type: !5)
!1051 = !DILocation(line: 231, column: 16, scope: !1048)
!1052 = !DILocalVariable(name: "tot_weight", scope: !1048, file: !1, line: 232, type: !144)
!1053 = !DILocation(line: 232, column: 9, scope: !1048)
!1054 = !DILocation(line: 234, column: 12, scope: !1055)
!1055 = distinct !DILexicalBlock(scope: !1048, file: !1, line: 234, column: 3)
!1056 = !DILocation(line: 234, column: 19, scope: !1055)
!1057 = !DILocation(line: 234, column: 10, scope: !1055)
!1058 = !DILocation(line: 234, column: 35, scope: !1055)
!1059 = !DILocation(line: 234, column: 42, scope: !1055)
!1060 = !DILocation(line: 234, column: 33, scope: !1055)
!1061 = !DILocation(line: 234, column: 8, scope: !1055)
!1062 = !DILocation(line: 234, column: 46, scope: !1063)
!1063 = distinct !DILexicalBlock(scope: !1055, file: !1, line: 234, column: 3)
!1064 = !DILocation(line: 234, column: 48, scope: !1063)
!1065 = !DILocation(line: 234, column: 3, scope: !1055)
!1066 = !DILocation(line: 235, column: 9, scope: !1067)
!1067 = distinct !DILexicalBlock(scope: !1068, file: !1, line: 235, column: 8)
!1068 = distinct !DILexicalBlock(scope: !1063, file: !1, line: 234, column: 65)
!1069 = !DILocation(line: 235, column: 13, scope: !1067)
!1070 = !DILocation(line: 235, column: 22, scope: !1067)
!1071 = !DILocation(line: 235, column: 20, scope: !1067)
!1072 = !DILocation(line: 235, column: 34, scope: !1067)
!1073 = !DILocation(line: 235, column: 37, scope: !1067)
!1074 = !DILocation(line: 235, column: 51, scope: !1067)
!1075 = !DILocation(line: 235, column: 55, scope: !1067)
!1076 = !DILocation(line: 235, column: 8, scope: !1068)
!1077 = !DILocation(line: 236, column: 19, scope: !1078)
!1078 = distinct !DILexicalBlock(scope: !1067, file: !1, line: 235, column: 64)
!1079 = !DILocation(line: 236, column: 23, scope: !1078)
!1080 = !DILocation(line: 236, column: 16, scope: !1078)
!1081 = !DILocation(line: 237, column: 4, scope: !1078)
!1082 = !DILocation(line: 238, column: 3, scope: !1068)
!1083 = !DILocation(line: 234, column: 55, scope: !1063)
!1084 = !DILocation(line: 234, column: 61, scope: !1063)
!1085 = !DILocation(line: 234, column: 3, scope: !1063)
!1086 = distinct !{!1086, !1065, !1087}
!1087 = !DILocation(line: 238, column: 3, scope: !1055)
!1088 = !DILocation(line: 240, column: 7, scope: !1089)
!1089 = distinct !DILexicalBlock(scope: !1048, file: !1, line: 240, column: 7)
!1090 = !DILocation(line: 240, column: 18, scope: !1089)
!1091 = !DILocation(line: 240, column: 7, scope: !1048)
!1092 = !DILocalVariable(name: "scalar", scope: !1093, file: !1, line: 241, type: !144)
!1093 = distinct !DILexicalBlock(scope: !1089, file: !1, line: 240, column: 26)
!1094 = !DILocation(line: 241, column: 10, scope: !1093)
!1095 = !DILocation(line: 241, column: 26, scope: !1093)
!1096 = !DILocation(line: 241, column: 24, scope: !1093)
!1097 = !DILocation(line: 242, column: 13, scope: !1098)
!1098 = distinct !DILexicalBlock(scope: !1093, file: !1, line: 242, column: 4)
!1099 = !DILocation(line: 242, column: 20, scope: !1098)
!1100 = !DILocation(line: 242, column: 11, scope: !1098)
!1101 = !DILocation(line: 242, column: 36, scope: !1098)
!1102 = !DILocation(line: 242, column: 43, scope: !1098)
!1103 = !DILocation(line: 242, column: 34, scope: !1098)
!1104 = !DILocation(line: 242, column: 9, scope: !1098)
!1105 = !DILocation(line: 242, column: 47, scope: !1106)
!1106 = distinct !DILexicalBlock(scope: !1098, file: !1, line: 242, column: 4)
!1107 = !DILocation(line: 242, column: 49, scope: !1106)
!1108 = !DILocation(line: 242, column: 4, scope: !1098)
!1109 = !DILocation(line: 243, column: 10, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !1111, file: !1, line: 243, column: 9)
!1111 = distinct !DILexicalBlock(scope: !1106, file: !1, line: 242, column: 66)
!1112 = !DILocation(line: 243, column: 14, scope: !1110)
!1113 = !DILocation(line: 243, column: 23, scope: !1110)
!1114 = !DILocation(line: 243, column: 21, scope: !1110)
!1115 = !DILocation(line: 243, column: 35, scope: !1110)
!1116 = !DILocation(line: 243, column: 38, scope: !1110)
!1117 = !DILocation(line: 243, column: 52, scope: !1110)
!1118 = !DILocation(line: 243, column: 56, scope: !1110)
!1119 = !DILocation(line: 243, column: 9, scope: !1111)
!1120 = !DILocation(line: 244, column: 20, scope: !1121)
!1121 = distinct !DILexicalBlock(scope: !1110, file: !1, line: 243, column: 65)
!1122 = !DILocation(line: 244, column: 6, scope: !1121)
!1123 = !DILocation(line: 244, column: 10, scope: !1121)
!1124 = !DILocation(line: 244, column: 17, scope: !1121)
!1125 = !DILocation(line: 247, column: 6, scope: !1126)
!1126 = distinct !DILexicalBlock(scope: !1127, file: !1, line: 247, column: 6)
!1127 = distinct !DILexicalBlock(scope: !1121, file: !1, line: 247, column: 6)
!1128 = !DILocation(line: 247, column: 6, scope: !1127)
!1129 = !DILocation(line: 247, column: 6, scope: !1130)
!1130 = distinct !DILexicalBlock(scope: !1126, file: !1, line: 247, column: 6)
!1131 = !DILocation(line: 248, column: 5, scope: !1121)
!1132 = !DILocation(line: 249, column: 4, scope: !1111)
!1133 = !DILocation(line: 242, column: 56, scope: !1106)
!1134 = !DILocation(line: 242, column: 62, scope: !1106)
!1135 = !DILocation(line: 242, column: 4, scope: !1106)
!1136 = distinct !{!1136, !1108, !1137}
!1137 = !DILocation(line: 249, column: 4, scope: !1098)
!1138 = !DILocation(line: 250, column: 3, scope: !1093)
!1139 = !DILocation(line: 252, column: 1, scope: !1005)
!1140 = distinct !DISubprogram(name: "defvert_normalize", scope: !1, file: !1, line: 254, type: !1141, scopeLine: 255, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !409)
!1141 = !DISubroutineType(types: !1142)
!1142 = !{null, !535}
!1143 = !DILocalVariable(name: "dvert", arg: 1, scope: !1140, file: !1, line: 254, type: !535)
!1144 = !DILocation(line: 254, column: 37, scope: !1140)
!1145 = !DILocation(line: 256, column: 6, scope: !1146)
!1146 = distinct !DILexicalBlock(scope: !1140, file: !1, line: 256, column: 6)
!1147 = !DILocation(line: 256, column: 13, scope: !1146)
!1148 = !DILocation(line: 256, column: 23, scope: !1146)
!1149 = !DILocation(line: 256, column: 6, scope: !1140)
!1150 = !DILocation(line: 258, column: 2, scope: !1151)
!1151 = distinct !DILexicalBlock(scope: !1146, file: !1, line: 256, column: 29)
!1152 = !DILocation(line: 259, column: 11, scope: !1153)
!1153 = distinct !DILexicalBlock(scope: !1146, file: !1, line: 259, column: 11)
!1154 = !DILocation(line: 259, column: 18, scope: !1153)
!1155 = !DILocation(line: 259, column: 28, scope: !1153)
!1156 = !DILocation(line: 259, column: 11, scope: !1146)
!1157 = !DILocation(line: 260, column: 3, scope: !1158)
!1158 = distinct !DILexicalBlock(scope: !1153, file: !1, line: 259, column: 34)
!1159 = !DILocation(line: 260, column: 10, scope: !1158)
!1160 = !DILocation(line: 260, column: 16, scope: !1158)
!1161 = !DILocation(line: 260, column: 23, scope: !1158)
!1162 = !DILocation(line: 261, column: 2, scope: !1158)
!1163 = !DILocalVariable(name: "dw", scope: !1164, file: !1, line: 263, type: !599)
!1164 = distinct !DILexicalBlock(scope: !1153, file: !1, line: 262, column: 7)
!1165 = !DILocation(line: 263, column: 18, scope: !1164)
!1166 = !DILocalVariable(name: "i", scope: !1164, file: !1, line: 264, type: !5)
!1167 = !DILocation(line: 264, column: 16, scope: !1164)
!1168 = !DILocalVariable(name: "tot_weight", scope: !1164, file: !1, line: 265, type: !144)
!1169 = !DILocation(line: 265, column: 9, scope: !1164)
!1170 = !DILocation(line: 267, column: 12, scope: !1171)
!1171 = distinct !DILexicalBlock(scope: !1164, file: !1, line: 267, column: 3)
!1172 = !DILocation(line: 267, column: 19, scope: !1171)
!1173 = !DILocation(line: 267, column: 10, scope: !1171)
!1174 = !DILocation(line: 267, column: 35, scope: !1171)
!1175 = !DILocation(line: 267, column: 42, scope: !1171)
!1176 = !DILocation(line: 267, column: 33, scope: !1171)
!1177 = !DILocation(line: 267, column: 8, scope: !1171)
!1178 = !DILocation(line: 267, column: 46, scope: !1179)
!1179 = distinct !DILexicalBlock(scope: !1171, file: !1, line: 267, column: 3)
!1180 = !DILocation(line: 267, column: 48, scope: !1179)
!1181 = !DILocation(line: 267, column: 3, scope: !1171)
!1182 = !DILocation(line: 268, column: 18, scope: !1183)
!1183 = distinct !DILexicalBlock(scope: !1179, file: !1, line: 267, column: 65)
!1184 = !DILocation(line: 268, column: 22, scope: !1183)
!1185 = !DILocation(line: 268, column: 15, scope: !1183)
!1186 = !DILocation(line: 269, column: 3, scope: !1183)
!1187 = !DILocation(line: 267, column: 55, scope: !1179)
!1188 = !DILocation(line: 267, column: 61, scope: !1179)
!1189 = !DILocation(line: 267, column: 3, scope: !1179)
!1190 = distinct !{!1190, !1181, !1191}
!1191 = !DILocation(line: 269, column: 3, scope: !1171)
!1192 = !DILocation(line: 271, column: 7, scope: !1193)
!1193 = distinct !DILexicalBlock(scope: !1164, file: !1, line: 271, column: 7)
!1194 = !DILocation(line: 271, column: 18, scope: !1193)
!1195 = !DILocation(line: 271, column: 7, scope: !1164)
!1196 = !DILocalVariable(name: "scalar", scope: !1197, file: !1, line: 272, type: !144)
!1197 = distinct !DILexicalBlock(scope: !1193, file: !1, line: 271, column: 26)
!1198 = !DILocation(line: 272, column: 10, scope: !1197)
!1199 = !DILocation(line: 272, column: 26, scope: !1197)
!1200 = !DILocation(line: 272, column: 24, scope: !1197)
!1201 = !DILocation(line: 273, column: 13, scope: !1202)
!1202 = distinct !DILexicalBlock(scope: !1197, file: !1, line: 273, column: 4)
!1203 = !DILocation(line: 273, column: 20, scope: !1202)
!1204 = !DILocation(line: 273, column: 11, scope: !1202)
!1205 = !DILocation(line: 273, column: 36, scope: !1202)
!1206 = !DILocation(line: 273, column: 43, scope: !1202)
!1207 = !DILocation(line: 273, column: 34, scope: !1202)
!1208 = !DILocation(line: 273, column: 9, scope: !1202)
!1209 = !DILocation(line: 273, column: 47, scope: !1210)
!1210 = distinct !DILexicalBlock(scope: !1202, file: !1, line: 273, column: 4)
!1211 = !DILocation(line: 273, column: 49, scope: !1210)
!1212 = !DILocation(line: 273, column: 4, scope: !1202)
!1213 = !DILocation(line: 274, column: 19, scope: !1214)
!1214 = distinct !DILexicalBlock(scope: !1210, file: !1, line: 273, column: 66)
!1215 = !DILocation(line: 274, column: 5, scope: !1214)
!1216 = !DILocation(line: 274, column: 9, scope: !1214)
!1217 = !DILocation(line: 274, column: 16, scope: !1214)
!1218 = !DILocation(line: 277, column: 5, scope: !1219)
!1219 = distinct !DILexicalBlock(scope: !1220, file: !1, line: 277, column: 5)
!1220 = distinct !DILexicalBlock(scope: !1214, file: !1, line: 277, column: 5)
!1221 = !DILocation(line: 277, column: 5, scope: !1220)
!1222 = !DILocation(line: 277, column: 5, scope: !1223)
!1223 = distinct !DILexicalBlock(scope: !1219, file: !1, line: 277, column: 5)
!1224 = !DILocation(line: 278, column: 4, scope: !1214)
!1225 = !DILocation(line: 273, column: 56, scope: !1210)
!1226 = !DILocation(line: 273, column: 62, scope: !1210)
!1227 = !DILocation(line: 273, column: 4, scope: !1210)
!1228 = distinct !{!1228, !1212, !1229}
!1229 = !DILocation(line: 278, column: 4, scope: !1202)
!1230 = !DILocation(line: 279, column: 3, scope: !1197)
!1231 = !DILocation(line: 281, column: 1, scope: !1140)
!1232 = distinct !DISubprogram(name: "defvert_normalize_lock_single", scope: !1, file: !1, line: 284, type: !1233, scopeLine: 287, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !409)
!1233 = !DISubroutineType(types: !1234)
!1234 = !{null, !535, !550, !553, !553}
!1235 = !DILocalVariable(name: "dvert", arg: 1, scope: !1232, file: !1, line: 284, type: !535)
!1236 = !DILocation(line: 284, column: 49, scope: !1232)
!1237 = !DILocalVariable(name: "vgroup_subset", arg: 2, scope: !1232, file: !1, line: 285, type: !550)
