; ModuleID = 'blender/source/blender/editors/space_outliner/outliner_select.c'
source_filename = "blender/source/blender/editors/space_outliner/outliner_select.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }

!75 = !DIEnumerator(name: "BONE_UNKEYED", value: 8192, isUnsigned: true)
!76 = !DIEnumerator(name: "BONE_HINGE_CHILD_TRANSFORM", value: 16384, isUnsigned: true)
!77 = !DIEnumerator(name: "BONE_NO_SCALE", value: 32768, isUnsigned: true)
!78 = !DIEnumerator(name: "BONE_HIDDEN_PG", value: 65536, isUnsigned: true)
!79 = !DIEnumerator(name: "BONE_DRAWWIRE", value: 131072, isUnsigned: true)
!80 = !DIEnumerator(name: "BONE_NO_CYCLICOFFSET", value: 262144, isUnsigned: true)
!81 = !DIEnumerator(name: "BONE_EDITMODE_LOCKED", value: 524288, isUnsigned: true)
!82 = !DIEnumerator(name: "BONE_TRANSFORM_CHILD", value: 1048576, isUnsigned: true)
!83 = !DIEnumerator(name: "BONE_UNSELECTABLE", value: 2097152, isUnsigned: true)
!84 = !DIEnumerator(name: "BONE_NO_LOCAL_LOCATION", value: 4194304, isUnsigned: true)
!85 = !DIEnumerator(name: "BONE_RELATIVE_PARENTING", value: 8388608, isUnsigned: true)
!86 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ObjectMode", file: !49, line: 666, baseType: !5, size: 32, elements: !87)
!87 = !{!88, !89, !90, !91, !92, !93, !94, !95}
!88 = !DIEnumerator(name: "OB_MODE_OBJECT", value: 0, isUnsigned: true)
!89 = !DIEnumerator(name: "OB_MODE_EDIT", value: 1, isUnsigned: true)
!90 = !DIEnumerator(name: "OB_MODE_SCULPT", value: 2, isUnsigned: true)
!91 = !DIEnumerator(name: "OB_MODE_VERTEX_PAINT", value: 4, isUnsigned: true)
!92 = !DIEnumerator(name: "OB_MODE_WEIGHT_PAINT", value: 8, isUnsigned: true)
!93 = !DIEnumerator(name: "OB_MODE_TEXTURE_PAINT", value: 16, isUnsigned: true)
!94 = !DIEnumerator(name: "OB_MODE_PARTICLE_EDIT", value: 32, isUnsigned: true)
!95 = !DIEnumerator(name: "OB_MODE_POSE", value: 64, isUnsigned: true)
!96 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 263, baseType: !5, size: 32, elements: !97)
!97 = !{!98, !99, !100, !101}
!98 = !DIEnumerator(name: "KMI_INACTIVE", value: 1, isUnsigned: true)
!99 = !DIEnumerator(name: "KMI_EXPANDED", value: 2, isUnsigned: true)
!100 = !DIEnumerator(name: "KMI_USER_MODIFIED", value: 4, isUnsigned: true)
!101 = !DIEnumerator(name: "KMI_UPDATE", value: 8, isUnsigned: true)
!102 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !103, line: 141, baseType: !5, size: 32, elements: !104)
!103 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!104 = !{!105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116}
!105 = !DIEnumerator(name: "WM_OP_INVOKE_DEFAULT", value: 0, isUnsigned: true)
!106 = !DIEnumerator(name: "WM_OP_INVOKE_REGION_WIN", value: 1, isUnsigned: true)
!107 = !DIEnumerator(name: "WM_OP_INVOKE_REGION_CHANNELS", value: 2, isUnsigned: true)
!108 = !DIEnumerator(name: "WM_OP_INVOKE_REGION_PREVIEW", value: 3, isUnsigned: true)
!109 = !DIEnumerator(name: "WM_OP_INVOKE_AREA", value: 4, isUnsigned: true)
!110 = !DIEnumerator(name: "WM_OP_INVOKE_SCREEN", value: 5, isUnsigned: true)
!111 = !DIEnumerator(name: "WM_OP_EXEC_DEFAULT", value: 6, isUnsigned: true)
!112 = !DIEnumerator(name: "WM_OP_EXEC_REGION_WIN", value: 7, isUnsigned: true)
!113 = !DIEnumerator(name: "WM_OP_EXEC_REGION_CHANNELS", value: 8, isUnsigned: true)
!114 = !DIEnumerator(name: "WM_OP_EXEC_REGION_PREVIEW", value: 9, isUnsigned: true)
!115 = !DIEnumerator(name: "WM_OP_EXEC_AREA", value: 10, isUnsigned: true)
!116 = !DIEnumerator(name: "WM_OP_EXEC_SCREEN", value: 11, isUnsigned: true)
!117 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eSpaceOutliner_Search_Flags", file: !16, line: 305, baseType: !5, size: 32, elements: !118)
!118 = !{!119, !120, !121}
!119 = !DIEnumerator(name: "SO_FIND_CASE_SENSITIVE", value: 1, isUnsigned: true)
!120 = !DIEnumerator(name: "SO_FIND_COMPLETE", value: 2, isUnsigned: true)
!121 = !DIEnumerator(name: "SO_SEARCH_RECURSIVE", value: 4, isUnsigned: true)
!122 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !123, line: 394, baseType: !5, size: 32, elements: !124)
!123 = !DIFile(filename: "blender/source/blender/windowmanager/wm_event_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!124 = !{!125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135}
!125 = !DIEnumerator(name: "GESTURE_MODAL_CANCEL", value: 1, isUnsigned: true)
!126 = !DIEnumerator(name: "GESTURE_MODAL_CONFIRM", value: 2, isUnsigned: true)
!127 = !DIEnumerator(name: "GESTURE_MODAL_SELECT", value: 3, isUnsigned: true)
!128 = !DIEnumerator(name: "GESTURE_MODAL_DESELECT", value: 4, isUnsigned: true)
!129 = !DIEnumerator(name: "GESTURE_MODAL_NOP", value: 5, isUnsigned: true)
!130 = !DIEnumerator(name: "GESTURE_MODAL_CIRCLE_ADD", value: 6, isUnsigned: true)
!131 = !DIEnumerator(name: "GESTURE_MODAL_CIRCLE_SUB", value: 7, isUnsigned: true)
!132 = !DIEnumerator(name: "GESTURE_MODAL_BEGIN", value: 8, isUnsigned: true)
!133 = !DIEnumerator(name: "GESTURE_MODAL_IN", value: 9, isUnsigned: true)
!134 = !DIEnumerator(name: "GESTURE_MODAL_OUT", value: 10, isUnsigned: true)
!135 = !DIEnumerator(name: "GESTURE_MODAL_CIRCLE_SIZE", value: 11, isUnsigned: true)
!136 = !{!137, !208, !143, !2168, !2170, !2172, !2252, !158, !2254, !2264, !2345, !783, !2347}
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !139, line: 130, baseType: !140)
!139 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !139, line: 117, size: 960, elements: !141)
!141 = !{!142, !144, !145, !147, !166, !170, !172, !174, !175, !176}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !140, file: !139, line: 118, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !140, file: !139, line: 118, baseType: !143, size: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !140, file: !139, line: 119, baseType: !146, size: 64, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !140, file: !139, line: 120, baseType: !148, size: 64, offset: 192)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !139, line: 136, size: 17600, elements: !150)
!150 = !{!151, !152, !153, !156, !161, !162, !163}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !149, file: !139, line: 137, baseType: !138, size: 960)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !149, file: !139, line: 138, baseType: !137, size: 64, offset: 960)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !149, file: !139, line: 139, baseType: !154, size: 64, offset: 1024)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !139, line: 43, flags: DIFlagFwdDecl)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !149, file: !139, line: 140, baseType: !157, size: 8192, offset: 1088)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 8192, elements: !159)
!158 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!159 = !{!160}
!160 = !DISubrange(count: 1024)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !149, file: !139, line: 141, baseType: !157, size: 8192, offset: 9280)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !149, file: !139, line: 148, baseType: !148, size: 64, offset: 17472)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !149, file: !139, line: 150, baseType: !164, size: 64, offset: 17536)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !139, line: 45, flags: DIFlagFwdDecl)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !140, file: !139, line: 121, baseType: !167, size: 528, offset: 256)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 528, elements: !168)
!168 = !{!169}
!169 = !DISubrange(count: 66)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !140, file: !139, line: 126, baseType: !171, size: 16, offset: 784)
!171 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !140, file: !139, line: 127, baseType: !173, size: 32, offset: 800)
!173 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !140, file: !139, line: 128, baseType: !173, size: 32, offset: 832)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !140, file: !139, line: 128, baseType: !173, size: 32, offset: 864)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !140, file: !139, line: 129, baseType: !177, size: 64, offset: 896)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !139, line: 75, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !139, line: 62, size: 1024, elements: !180)
!180 = !{!181, !183, !184, !185, !186, !187, !191, !192, !206, !207}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !179, file: !139, line: 63, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !179, file: !139, line: 63, baseType: !182, size: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !179, file: !139, line: 64, baseType: !158, size: 8, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !179, file: !139, line: 64, baseType: !158, size: 8, offset: 136)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !179, file: !139, line: 65, baseType: !171, size: 16, offset: 144)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !179, file: !139, line: 66, baseType: !188, size: 512, offset: 160)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 512, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !179, file: !139, line: 67, baseType: !173, size: 32, offset: 672)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !179, file: !139, line: 69, baseType: !193, size: 256, offset: 704)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !139, line: 60, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !139, line: 48, size: 256, elements: !195)
!195 = !{!196, !197, !204, !205}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !194, file: !139, line: 49, baseType: !143, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !194, file: !139, line: 58, baseType: !198, size: 128, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !199, line: 71, baseType: !200)
!199 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !199, line: 69, size: 128, elements: !201)
!201 = !{!202, !203}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !200, file: !199, line: 70, baseType: !143, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !200, file: !199, line: 70, baseType: !143, size: 64, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !194, file: !139, line: 59, baseType: !173, size: 32, offset: 192)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !194, file: !139, line: 59, baseType: !173, size: 32, offset: 224)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !179, file: !139, line: 70, baseType: !173, size: 32, offset: 960)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !179, file: !139, line: 74, baseType: !173, size: 32, offset: 992)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "Object", file: !49, line: 295, baseType: !210)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !49, line: 115, size: 11392, elements: !211)
!211 = !{!212, !213, !216, !219, !220, !221, !222, !223, !224, !225, !227, !228, !229, !230, !231, !235, !247, !261, !262, !305, !306, !309, !310, !326, !327, !328, !329, !330, !331, !332, !2035, !2036, !2037, !2038, !2039, !2040, !2041, !2042, !2043, !2044, !2045, !2046, !2047, !2048, !2049, !2050, !2051, !2052, !2053, !2054, !2055, !2056, !2057, !2058, !2059, !2060, !2061, !2062, !2063, !2064, !2065, !2066, !2067, !2068, !2069, !2070, !2071, !2072, !2073, !2074, !2075, !2076, !2077, !2078, !2079, !2080, !2081, !2082, !2083, !2084, !2085, !2086, !2088, !2089, !2090, !2091, !2092, !2093, !2094, !2095, !2096, !2097, !2098, !2099, !2100, !2101, !2102, !2103, !2104, !2105, !2106, !2107, !2110, !2111, !2112, !2113, !2114, !2115, !2116, !2117, !2118, !2121, !2124, !2125, !2126, !2127, !2128, !2129, !2132, !2135, !2138, !2139, !2140, !2141, !2142, !2143, !2144, !2145, !2146, !2149, !2152, !2153, !2156, !2157}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !210, file: !49, line: 116, baseType: !138, size: 960)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !210, file: !49, line: 117, baseType: !214, size: 64, offset: 960)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !61, line: 37, flags: DIFlagFwdDecl)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !210, file: !49, line: 119, baseType: !217, size: 64, offset: 1024)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !49, line: 57, flags: DIFlagFwdDecl)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !210, file: !49, line: 121, baseType: !171, size: 16, offset: 1088)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !210, file: !49, line: 121, baseType: !171, size: 16, offset: 1104)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !210, file: !49, line: 122, baseType: !173, size: 32, offset: 1120)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !210, file: !49, line: 122, baseType: !173, size: 32, offset: 1152)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !210, file: !49, line: 122, baseType: !173, size: 32, offset: 1184)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !210, file: !49, line: 123, baseType: !188, size: 512, offset: 1216)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !210, file: !49, line: 124, baseType: !226, size: 64, offset: 1728)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !210, file: !49, line: 124, baseType: !226, size: 64, offset: 1792)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !210, file: !49, line: 127, baseType: !226, size: 64, offset: 1856)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !210, file: !49, line: 127, baseType: !226, size: 64, offset: 1920)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !210, file: !49, line: 127, baseType: !226, size: 64, offset: 1984)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !210, file: !49, line: 128, baseType: !232, size: 64, offset: 2048)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !234, line: 45, flags: DIFlagFwdDecl)
!234 = !DIFile(filename: "blender/source/blender/makesdna/DNA_lamp_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!235 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !210, file: !49, line: 130, baseType: !236, size: 64, offset: 2112)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !49, line: 97, size: 832, elements: !238)
!238 = !{!239, !245, !246}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !237, file: !49, line: 98, baseType: !240, size: 768)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 768, elements: !242)
!241 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!242 = !{!243, !244}
!243 = !DISubrange(count: 8)
!244 = !DISubrange(count: 3)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !237, file: !49, line: 99, baseType: !173, size: 32, offset: 768)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !237, file: !49, line: 99, baseType: !173, size: 32, offset: 800)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !210, file: !49, line: 131, baseType: !248, size: 64, offset: 2176)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !250, line: 486, size: 1600, elements: !251)
!250 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!251 = !{!252, !253, !254, !255, !256, !257, !258, !259, !260}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !249, file: !250, line: 487, baseType: !138, size: 960)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !249, file: !250, line: 489, baseType: !198, size: 128, offset: 960)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !249, file: !250, line: 490, baseType: !198, size: 128, offset: 1088)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !249, file: !250, line: 491, baseType: !198, size: 128, offset: 1216)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !249, file: !250, line: 492, baseType: !198, size: 128, offset: 1344)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !249, file: !250, line: 494, baseType: !173, size: 32, offset: 1472)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !249, file: !250, line: 495, baseType: !173, size: 32, offset: 1504)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !249, file: !250, line: 497, baseType: !173, size: 32, offset: 1536)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !249, file: !250, line: 498, baseType: !173, size: 32, offset: 1568)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !210, file: !49, line: 132, baseType: !248, size: 64, offset: 2240)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !210, file: !49, line: 133, baseType: !263, size: 64, offset: 2304)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !250, line: 334, size: 1728, elements: !265)
!265 = !{!266, !267, !270, !271, !272, !273, !274, !275, !278, !279, !280, !281, !282, !283, !284, !304}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !264, file: !250, line: 335, baseType: !198, size: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !264, file: !250, line: 336, baseType: !268, size: 64, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !250, line: 47, flags: DIFlagFwdDecl)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !264, file: !250, line: 338, baseType: !171, size: 16, offset: 192)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !264, file: !250, line: 338, baseType: !171, size: 16, offset: 208)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !264, file: !250, line: 339, baseType: !5, size: 32, offset: 224)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !264, file: !250, line: 340, baseType: !173, size: 32, offset: 256)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !264, file: !250, line: 342, baseType: !241, size: 32, offset: 288)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !264, file: !250, line: 343, baseType: !276, size: 96, offset: 320)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 96, elements: !277)
!277 = !{!244}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !264, file: !250, line: 344, baseType: !276, size: 96, offset: 416)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !264, file: !250, line: 347, baseType: !198, size: 128, offset: 512)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !264, file: !250, line: 349, baseType: !173, size: 32, offset: 640)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !264, file: !250, line: 350, baseType: !173, size: 32, offset: 672)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !264, file: !250, line: 351, baseType: !143, size: 64, offset: 704)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !264, file: !250, line: 352, baseType: !143, size: 64, offset: 768)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !264, file: !250, line: 354, baseType: !285, size: 384, offset: 832)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !250, line: 116, baseType: !286)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !250, line: 94, size: 384, elements: !287)
!287 = !{!288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !286, file: !250, line: 96, baseType: !173, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !286, file: !250, line: 96, baseType: !173, size: 32, offset: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !286, file: !250, line: 97, baseType: !173, size: 32, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !286, file: !250, line: 97, baseType: !173, size: 32, offset: 96)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !286, file: !250, line: 99, baseType: !171, size: 16, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !286, file: !250, line: 100, baseType: !171, size: 16, offset: 144)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !286, file: !250, line: 102, baseType: !171, size: 16, offset: 160)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !286, file: !250, line: 105, baseType: !171, size: 16, offset: 176)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !286, file: !250, line: 108, baseType: !171, size: 16, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !286, file: !250, line: 109, baseType: !171, size: 16, offset: 208)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !286, file: !250, line: 111, baseType: !171, size: 16, offset: 224)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !286, file: !250, line: 112, baseType: !171, size: 16, offset: 240)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !286, file: !250, line: 114, baseType: !173, size: 32, offset: 256)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !286, file: !250, line: 114, baseType: !173, size: 32, offset: 288)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !286, file: !250, line: 115, baseType: !173, size: 32, offset: 320)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !286, file: !250, line: 115, baseType: !173, size: 32, offset: 352)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !264, file: !250, line: 355, baseType: !188, size: 512, offset: 1216)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !210, file: !49, line: 134, baseType: !143, size: 64, offset: 2368)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !210, file: !49, line: 136, baseType: !307, size: 64, offset: 2432)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !49, line: 58, flags: DIFlagFwdDecl)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !210, file: !49, line: 138, baseType: !285, size: 384, offset: 2496)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !210, file: !49, line: 139, baseType: !311, size: 64, offset: 2880)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !250, line: 80, baseType: !313)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !250, line: 72, size: 192, elements: !314)
!314 = !{!315, !322, !323, !324, !325}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !313, file: !250, line: 73, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !250, line: 59, baseType: !318)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !250, line: 56, size: 128, elements: !319)
!319 = !{!320, !321}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !318, file: !250, line: 57, baseType: !276, size: 96)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !318, file: !250, line: 58, baseType: !173, size: 32, offset: 96)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !313, file: !250, line: 74, baseType: !173, size: 32, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !313, file: !250, line: 76, baseType: !173, size: 32, offset: 96)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !313, file: !250, line: 77, baseType: !173, size: 32, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !313, file: !250, line: 79, baseType: !173, size: 32, offset: 160)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !210, file: !49, line: 141, baseType: !198, size: 128, offset: 2944)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !210, file: !49, line: 142, baseType: !198, size: 128, offset: 3072)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !210, file: !49, line: 143, baseType: !198, size: 128, offset: 3200)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !210, file: !49, line: 144, baseType: !198, size: 128, offset: 3328)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !210, file: !49, line: 146, baseType: !173, size: 32, offset: 3456)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !210, file: !49, line: 147, baseType: !173, size: 32, offset: 3488)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !210, file: !49, line: 150, baseType: !333, size: 64, offset: 3520)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !336, line: 93, size: 7552, elements: !337)
!336 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!337 = !{!338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !386, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !455, !456, !457, !458, !459, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !1986, !1987, !1988, !1997, !1998, !1999, !2000, !2001, !2002, !2003, !2004, !2005, !2006, !2007, !2008, !2009, !2010, !2011, !2012, !2013, !2014, !2015, !2016, !2017, !2018, !2019, !2020, !2021, !2022, !2023, !2024, !2025, !2026, !2034}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !335, file: !336, line: 94, baseType: !138, size: 960)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !335, file: !336, line: 95, baseType: !214, size: 64, offset: 960)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !335, file: !336, line: 97, baseType: !171, size: 16, offset: 1024)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !335, file: !336, line: 97, baseType: !171, size: 16, offset: 1040)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !335, file: !336, line: 99, baseType: !241, size: 32, offset: 1056)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !335, file: !336, line: 99, baseType: !241, size: 32, offset: 1088)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !335, file: !336, line: 99, baseType: !241, size: 32, offset: 1120)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !335, file: !336, line: 100, baseType: !241, size: 32, offset: 1152)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !335, file: !336, line: 100, baseType: !241, size: 32, offset: 1184)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !335, file: !336, line: 100, baseType: !241, size: 32, offset: 1216)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !335, file: !336, line: 101, baseType: !241, size: 32, offset: 1248)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !335, file: !336, line: 101, baseType: !241, size: 32, offset: 1280)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !335, file: !336, line: 101, baseType: !241, size: 32, offset: 1312)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !335, file: !336, line: 102, baseType: !241, size: 32, offset: 1344)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !335, file: !336, line: 102, baseType: !241, size: 32, offset: 1376)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !335, file: !336, line: 102, baseType: !241, size: 32, offset: 1408)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !335, file: !336, line: 103, baseType: !241, size: 32, offset: 1440)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !335, file: !336, line: 103, baseType: !241, size: 32, offset: 1472)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !335, file: !336, line: 103, baseType: !241, size: 32, offset: 1504)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !335, file: !336, line: 103, baseType: !241, size: 32, offset: 1536)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !335, file: !336, line: 103, baseType: !241, size: 32, offset: 1568)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !335, file: !336, line: 104, baseType: !241, size: 32, offset: 1600)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !335, file: !336, line: 104, baseType: !241, size: 32, offset: 1632)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !335, file: !336, line: 104, baseType: !241, size: 32, offset: 1664)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !335, file: !336, line: 104, baseType: !241, size: 32, offset: 1696)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !335, file: !336, line: 104, baseType: !241, size: 32, offset: 1728)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !335, file: !336, line: 105, baseType: !241, size: 32, offset: 1760)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !335, file: !336, line: 108, baseType: !366, size: 704, offset: 1792)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !336, line: 53, size: 704, elements: !367)
!367 = !{!368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !366, file: !336, line: 54, baseType: !241, size: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !366, file: !336, line: 55, baseType: !241, size: 32, offset: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !366, file: !336, line: 56, baseType: !241, size: 32, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !366, file: !336, line: 57, baseType: !241, size: 32, offset: 96)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !366, file: !336, line: 59, baseType: !276, size: 96, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !366, file: !336, line: 60, baseType: !276, size: 96, offset: 224)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !366, file: !336, line: 61, baseType: !276, size: 96, offset: 320)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !366, file: !336, line: 63, baseType: !241, size: 32, offset: 416)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !366, file: !336, line: 64, baseType: !241, size: 32, offset: 448)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !366, file: !336, line: 65, baseType: !241, size: 32, offset: 480)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !366, file: !336, line: 67, baseType: !171, size: 16, offset: 512)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !366, file: !336, line: 68, baseType: !171, size: 16, offset: 528)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !366, file: !336, line: 69, baseType: !171, size: 16, offset: 544)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !366, file: !336, line: 70, baseType: !171, size: 16, offset: 560)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !366, file: !336, line: 72, baseType: !241, size: 32, offset: 576)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !366, file: !336, line: 73, baseType: !241, size: 32, offset: 608)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !366, file: !336, line: 74, baseType: !241, size: 32, offset: 640)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !366, file: !336, line: 75, baseType: !241, size: 32, offset: 672)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !335, file: !336, line: 109, baseType: !387, size: 128, offset: 2496)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !336, line: 79, size: 128, elements: !388)
!388 = !{!389, !390, !391, !392}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !387, file: !336, line: 80, baseType: !173, size: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !387, file: !336, line: 81, baseType: !173, size: 32, offset: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !387, file: !336, line: 82, baseType: !173, size: 32, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !387, file: !336, line: 83, baseType: !173, size: 32, offset: 96)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !335, file: !336, line: 111, baseType: !241, size: 32, offset: 2624)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !335, file: !336, line: 111, baseType: !241, size: 32, offset: 2656)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !335, file: !336, line: 112, baseType: !241, size: 32, offset: 2688)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !335, file: !336, line: 112, baseType: !241, size: 32, offset: 2720)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !335, file: !336, line: 113, baseType: !241, size: 32, offset: 2752)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !335, file: !336, line: 114, baseType: !241, size: 32, offset: 2784)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !335, file: !336, line: 114, baseType: !241, size: 32, offset: 2816)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !335, file: !336, line: 115, baseType: !171, size: 16, offset: 2848)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !335, file: !336, line: 115, baseType: !171, size: 16, offset: 2864)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !335, file: !336, line: 116, baseType: !171, size: 16, offset: 2880)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !335, file: !336, line: 117, baseType: !158, size: 8, offset: 2896)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !335, file: !336, line: 117, baseType: !158, size: 8, offset: 2904)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !335, file: !336, line: 119, baseType: !241, size: 32, offset: 2912)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !335, file: !336, line: 119, baseType: !241, size: 32, offset: 2944)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !335, file: !336, line: 120, baseType: !171, size: 16, offset: 2976)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !335, file: !336, line: 120, baseType: !171, size: 16, offset: 2992)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !335, file: !336, line: 121, baseType: !241, size: 32, offset: 3008)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !335, file: !336, line: 121, baseType: !241, size: 32, offset: 3040)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !335, file: !336, line: 122, baseType: !241, size: 32, offset: 3072)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !335, file: !336, line: 123, baseType: !241, size: 32, offset: 3104)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !335, file: !336, line: 124, baseType: !171, size: 16, offset: 3136)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !335, file: !336, line: 125, baseType: !171, size: 16, offset: 3152)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !335, file: !336, line: 127, baseType: !173, size: 32, offset: 3168)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !335, file: !336, line: 127, baseType: !173, size: 32, offset: 3200)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !335, file: !336, line: 128, baseType: !173, size: 32, offset: 3232)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !335, file: !336, line: 128, baseType: !173, size: 32, offset: 3264)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !335, file: !336, line: 129, baseType: !171, size: 16, offset: 3296)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !335, file: !336, line: 129, baseType: !171, size: 16, offset: 3312)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !335, file: !336, line: 129, baseType: !171, size: 16, offset: 3328)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !335, file: !336, line: 129, baseType: !171, size: 16, offset: 3344)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !335, file: !336, line: 130, baseType: !241, size: 32, offset: 3360)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !335, file: !336, line: 130, baseType: !241, size: 32, offset: 3392)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !335, file: !336, line: 130, baseType: !241, size: 32, offset: 3424)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !335, file: !336, line: 130, baseType: !241, size: 32, offset: 3456)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !335, file: !336, line: 131, baseType: !241, size: 32, offset: 3488)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !335, file: !336, line: 131, baseType: !241, size: 32, offset: 3520)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !335, file: !336, line: 131, baseType: !241, size: 32, offset: 3552)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !335, file: !336, line: 131, baseType: !241, size: 32, offset: 3584)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !335, file: !336, line: 132, baseType: !241, size: 32, offset: 3616)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !335, file: !336, line: 132, baseType: !241, size: 32, offset: 3648)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !335, file: !336, line: 133, baseType: !188, size: 512, offset: 3680)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !335, file: !336, line: 135, baseType: !241, size: 32, offset: 4192)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !335, file: !336, line: 136, baseType: !241, size: 32, offset: 4224)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !335, file: !336, line: 137, baseType: !241, size: 32, offset: 4256)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !335, file: !336, line: 138, baseType: !173, size: 32, offset: 4288)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !335, file: !336, line: 141, baseType: !158, size: 8, offset: 4320)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !335, file: !336, line: 141, baseType: !158, size: 8, offset: 4328)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !335, file: !336, line: 141, baseType: !158, size: 8, offset: 4336)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !335, file: !336, line: 141, baseType: !158, size: 8, offset: 4344)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !335, file: !336, line: 142, baseType: !171, size: 16, offset: 4352)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !335, file: !336, line: 142, baseType: !171, size: 16, offset: 4368)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !335, file: !336, line: 142, baseType: !171, size: 16, offset: 4384)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !335, file: !336, line: 145, baseType: !158, size: 8, offset: 4400)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !335, file: !336, line: 145, baseType: !158, size: 8, offset: 4408)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !335, file: !336, line: 148, baseType: !171, size: 16, offset: 4416)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !335, file: !336, line: 148, baseType: !171, size: 16, offset: 4432)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !335, file: !336, line: 149, baseType: !241, size: 32, offset: 4448)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !335, file: !336, line: 149, baseType: !241, size: 32, offset: 4480)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !335, file: !336, line: 152, baseType: !452, size: 128, offset: 4512)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 128, elements: !453)
!453 = !{!454}
!454 = !DISubrange(count: 4)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !335, file: !336, line: 153, baseType: !241, size: 32, offset: 4640)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !335, file: !336, line: 154, baseType: !241, size: 32, offset: 4672)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !335, file: !336, line: 157, baseType: !171, size: 16, offset: 4704)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !335, file: !336, line: 157, baseType: !171, size: 16, offset: 4720)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !335, file: !336, line: 160, baseType: !460, size: 64, offset: 4736)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !462, line: 113, size: 6208, elements: !463)
!462 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!463 = !{!464, !465, !466, !467, !468, !469, !473}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !461, file: !462, line: 114, baseType: !171, size: 16)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !461, file: !462, line: 114, baseType: !171, size: 16, offset: 16)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !461, file: !462, line: 115, baseType: !158, size: 8, offset: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !461, file: !462, line: 115, baseType: !158, size: 8, offset: 40)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !461, file: !462, line: 116, baseType: !158, size: 8, offset: 48)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !461, file: !462, line: 117, baseType: !470, size: 8, offset: 56)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 8, elements: !471)
!471 = !{!472}
!472 = !DISubrange(count: 1)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !461, file: !462, line: 119, baseType: !474, size: 6144, offset: 64)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !475, size: 6144, elements: !484)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !462, line: 109, baseType: !476)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !462, line: 106, size: 192, elements: !477)
!477 = !{!478, !479, !480, !481, !482, !483}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !476, file: !462, line: 107, baseType: !241, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !476, file: !462, line: 107, baseType: !241, size: 32, offset: 32)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !476, file: !462, line: 107, baseType: !241, size: 32, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !476, file: !462, line: 107, baseType: !241, size: 32, offset: 96)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !476, file: !462, line: 107, baseType: !241, size: 32, offset: 128)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !476, file: !462, line: 108, baseType: !173, size: 32, offset: 160)
!484 = !{!485}
!485 = !DISubrange(count: 32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !335, file: !336, line: 161, baseType: !460, size: 64, offset: 4800)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !335, file: !336, line: 162, baseType: !158, size: 8, offset: 4864)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !335, file: !336, line: 162, baseType: !158, size: 8, offset: 4872)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !335, file: !336, line: 163, baseType: !158, size: 8, offset: 4880)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !335, file: !336, line: 163, baseType: !158, size: 8, offset: 4888)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !335, file: !336, line: 164, baseType: !171, size: 16, offset: 4896)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !335, file: !336, line: 164, baseType: !171, size: 16, offset: 4912)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !335, file: !336, line: 165, baseType: !241, size: 32, offset: 4928)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !335, file: !336, line: 165, baseType: !241, size: 32, offset: 4960)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !335, file: !336, line: 167, baseType: !496, size: 1152, offset: 4992)
!496 = !DICompositeType(tag: DW_TAG_array_type, baseType: !497, size: 1152, elements: !1984)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !462, line: 57, size: 2496, elements: !499)
!499 = !{!500, !501, !502, !503, !504, !505, !1925, !1926, !1927, !1928, !1929, !1930, !1931, !1932, !1933, !1934, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1951, !1952, !1953, !1954, !1955, !1956, !1957, !1958, !1959, !1960, !1961, !1962, !1963, !1964, !1965, !1966, !1967, !1968, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1977, !1978, !1979, !1980, !1981, !1982, !1983}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !498, file: !462, line: 59, baseType: !171, size: 16)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !498, file: !462, line: 59, baseType: !171, size: 16, offset: 16)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !498, file: !462, line: 59, baseType: !171, size: 16, offset: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !498, file: !462, line: 59, baseType: !171, size: 16, offset: 48)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !498, file: !462, line: 60, baseType: !226, size: 64, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !498, file: !462, line: 61, baseType: !506, size: 64, offset: 128)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !462, line: 202, size: 3328, elements: !508)
!508 = !{!509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !1835, !1836, !1837, !1838, !1839, !1865, !1866, !1895, !1915, !1923, !1924}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !507, file: !462, line: 203, baseType: !138, size: 960)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !507, file: !462, line: 204, baseType: !214, size: 64, offset: 960)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !507, file: !462, line: 206, baseType: !241, size: 32, offset: 1024)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !507, file: !462, line: 206, baseType: !241, size: 32, offset: 1056)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !507, file: !462, line: 207, baseType: !241, size: 32, offset: 1088)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !507, file: !462, line: 207, baseType: !241, size: 32, offset: 1120)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !507, file: !462, line: 207, baseType: !241, size: 32, offset: 1152)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !507, file: !462, line: 207, baseType: !241, size: 32, offset: 1184)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !507, file: !462, line: 207, baseType: !241, size: 32, offset: 1216)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !507, file: !462, line: 207, baseType: !241, size: 32, offset: 1248)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !507, file: !462, line: 208, baseType: !241, size: 32, offset: 1280)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !507, file: !462, line: 208, baseType: !241, size: 32, offset: 1312)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !507, file: !462, line: 211, baseType: !241, size: 32, offset: 1344)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !507, file: !462, line: 211, baseType: !241, size: 32, offset: 1376)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !507, file: !462, line: 211, baseType: !241, size: 32, offset: 1408)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !507, file: !462, line: 211, baseType: !241, size: 32, offset: 1440)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !507, file: !462, line: 211, baseType: !241, size: 32, offset: 1472)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !507, file: !462, line: 214, baseType: !241, size: 32, offset: 1504)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !507, file: !462, line: 214, baseType: !241, size: 32, offset: 1536)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !507, file: !462, line: 217, baseType: !241, size: 32, offset: 1568)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !507, file: !462, line: 218, baseType: !241, size: 32, offset: 1600)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !507, file: !462, line: 219, baseType: !241, size: 32, offset: 1632)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !507, file: !462, line: 220, baseType: !241, size: 32, offset: 1664)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !507, file: !462, line: 221, baseType: !241, size: 32, offset: 1696)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !507, file: !462, line: 222, baseType: !171, size: 16, offset: 1728)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !507, file: !462, line: 222, baseType: !171, size: 16, offset: 1744)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !507, file: !462, line: 224, baseType: !171, size: 16, offset: 1760)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !507, file: !462, line: 224, baseType: !171, size: 16, offset: 1776)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !507, file: !462, line: 227, baseType: !171, size: 16, offset: 1792)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !507, file: !462, line: 227, baseType: !171, size: 16, offset: 1808)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !507, file: !462, line: 229, baseType: !171, size: 16, offset: 1824)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !507, file: !462, line: 229, baseType: !171, size: 16, offset: 1840)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !507, file: !462, line: 230, baseType: !171, size: 16, offset: 1856)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !507, file: !462, line: 230, baseType: !171, size: 16, offset: 1872)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !507, file: !462, line: 232, baseType: !241, size: 32, offset: 1888)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !507, file: !462, line: 232, baseType: !241, size: 32, offset: 1920)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !507, file: !462, line: 232, baseType: !241, size: 32, offset: 1952)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !507, file: !462, line: 232, baseType: !241, size: 32, offset: 1984)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !507, file: !462, line: 233, baseType: !173, size: 32, offset: 2016)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !507, file: !462, line: 234, baseType: !173, size: 32, offset: 2048)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !507, file: !462, line: 235, baseType: !171, size: 16, offset: 2080)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !507, file: !462, line: 235, baseType: !171, size: 16, offset: 2096)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !507, file: !462, line: 236, baseType: !171, size: 16, offset: 2112)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !507, file: !462, line: 239, baseType: !171, size: 16, offset: 2128)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !507, file: !462, line: 240, baseType: !173, size: 32, offset: 2144)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !507, file: !462, line: 241, baseType: !173, size: 32, offset: 2176)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !507, file: !462, line: 241, baseType: !173, size: 32, offset: 2208)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !507, file: !462, line: 241, baseType: !173, size: 32, offset: 2240)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !507, file: !462, line: 243, baseType: !241, size: 32, offset: 2272)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !507, file: !462, line: 243, baseType: !241, size: 32, offset: 2304)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !507, file: !462, line: 244, baseType: !241, size: 32, offset: 2336)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !507, file: !462, line: 246, baseType: !561, size: 320, offset: 2368)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !562, line: 50, size: 320, elements: !563)
!562 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!563 = !{!564, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1834}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !561, file: !562, line: 51, baseType: !565, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !567, line: 1216, size: 39680, elements: !568)
!567 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!568 = !{!569, !570, !571, !572, !747, !748, !749, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !1187, !1402, !1405, !1692, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1714, !1715, !1716, !1717, !1718, !1726, !1793, !1800, !1801, !1808, !1809, !1815, !1816, !1817, !1818, !1819}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !566, file: !567, line: 1217, baseType: !138, size: 960)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !566, file: !567, line: 1218, baseType: !214, size: 64, offset: 960)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !566, file: !567, line: 1220, baseType: !226, size: 64, offset: 1024)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !566, file: !567, line: 1221, baseType: !573, size: 64, offset: 1088)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !575, line: 52, size: 4224, elements: !576)
!575 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!576 = !{!577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !646, !647, !648, !649, !650, !651, !655, !671}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !574, file: !575, line: 53, baseType: !138, size: 960)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !574, file: !575, line: 54, baseType: !214, size: 64, offset: 960)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !574, file: !575, line: 56, baseType: !171, size: 16, offset: 1024)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !574, file: !575, line: 56, baseType: !171, size: 16, offset: 1040)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !574, file: !575, line: 57, baseType: !171, size: 16, offset: 1056)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !574, file: !575, line: 57, baseType: !171, size: 16, offset: 1072)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !574, file: !575, line: 59, baseType: !241, size: 32, offset: 1088)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !574, file: !575, line: 59, baseType: !241, size: 32, offset: 1120)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !574, file: !575, line: 59, baseType: !241, size: 32, offset: 1152)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !574, file: !575, line: 60, baseType: !241, size: 32, offset: 1184)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !574, file: !575, line: 60, baseType: !241, size: 32, offset: 1216)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !574, file: !575, line: 60, baseType: !241, size: 32, offset: 1248)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !574, file: !575, line: 61, baseType: !241, size: 32, offset: 1280)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !574, file: !575, line: 61, baseType: !241, size: 32, offset: 1312)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !574, file: !575, line: 61, baseType: !241, size: 32, offset: 1344)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !574, file: !575, line: 68, baseType: !241, size: 32, offset: 1376)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !574, file: !575, line: 68, baseType: !241, size: 32, offset: 1408)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !574, file: !575, line: 68, baseType: !241, size: 32, offset: 1440)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !574, file: !575, line: 69, baseType: !241, size: 32, offset: 1472)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !574, file: !575, line: 69, baseType: !241, size: 32, offset: 1504)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !574, file: !575, line: 74, baseType: !241, size: 32, offset: 1536)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !574, file: !575, line: 79, baseType: !241, size: 32, offset: 1568)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !574, file: !575, line: 81, baseType: !171, size: 16, offset: 1600)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !574, file: !575, line: 91, baseType: !171, size: 16, offset: 1616)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !574, file: !575, line: 92, baseType: !171, size: 16, offset: 1632)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !574, file: !575, line: 93, baseType: !171, size: 16, offset: 1648)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !574, file: !575, line: 94, baseType: !171, size: 16, offset: 1664)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !574, file: !575, line: 94, baseType: !171, size: 16, offset: 1680)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !574, file: !575, line: 94, baseType: !171, size: 16, offset: 1696)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !574, file: !575, line: 94, baseType: !171, size: 16, offset: 1712)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !574, file: !575, line: 96, baseType: !241, size: 32, offset: 1728)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !574, file: !575, line: 96, baseType: !241, size: 32, offset: 1760)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !574, file: !575, line: 96, baseType: !241, size: 32, offset: 1792)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !574, file: !575, line: 96, baseType: !241, size: 32, offset: 1824)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !574, file: !575, line: 98, baseType: !241, size: 32, offset: 1856)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !574, file: !575, line: 98, baseType: !241, size: 32, offset: 1888)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !574, file: !575, line: 98, baseType: !241, size: 32, offset: 1920)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !574, file: !575, line: 98, baseType: !241, size: 32, offset: 1952)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !574, file: !575, line: 99, baseType: !241, size: 32, offset: 1984)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !574, file: !575, line: 99, baseType: !241, size: 32, offset: 2016)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !574, file: !575, line: 100, baseType: !241, size: 32, offset: 2048)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !574, file: !575, line: 100, baseType: !241, size: 32, offset: 2080)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !574, file: !575, line: 103, baseType: !171, size: 16, offset: 2112)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !574, file: !575, line: 103, baseType: !171, size: 16, offset: 2128)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !574, file: !575, line: 103, baseType: !171, size: 16, offset: 2144)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !574, file: !575, line: 103, baseType: !171, size: 16, offset: 2160)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !574, file: !575, line: 106, baseType: !241, size: 32, offset: 2176)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !574, file: !575, line: 106, baseType: !241, size: 32, offset: 2208)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !574, file: !575, line: 106, baseType: !241, size: 32, offset: 2240)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !574, file: !575, line: 106, baseType: !241, size: 32, offset: 2272)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !574, file: !575, line: 107, baseType: !171, size: 16, offset: 2304)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !574, file: !575, line: 107, baseType: !171, size: 16, offset: 2320)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !574, file: !575, line: 107, baseType: !171, size: 16, offset: 2336)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !574, file: !575, line: 107, baseType: !171, size: 16, offset: 2352)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !574, file: !575, line: 108, baseType: !241, size: 32, offset: 2368)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !574, file: !575, line: 108, baseType: !241, size: 32, offset: 2400)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !574, file: !575, line: 109, baseType: !241, size: 32, offset: 2432)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !574, file: !575, line: 109, baseType: !241, size: 32, offset: 2464)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !574, file: !575, line: 110, baseType: !241, size: 32, offset: 2496)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !574, file: !575, line: 110, baseType: !241, size: 32, offset: 2528)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !574, file: !575, line: 110, baseType: !241, size: 32, offset: 2560)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !574, file: !575, line: 111, baseType: !171, size: 16, offset: 2592)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !574, file: !575, line: 111, baseType: !171, size: 16, offset: 2608)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !574, file: !575, line: 112, baseType: !171, size: 16, offset: 2624)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !574, file: !575, line: 112, baseType: !171, size: 16, offset: 2640)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !574, file: !575, line: 112, baseType: !171, size: 16, offset: 2656)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !574, file: !575, line: 115, baseType: !171, size: 16, offset: 2672)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !574, file: !575, line: 118, baseType: !645, size: 64, offset: 2688)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !574, file: !575, line: 118, baseType: !645, size: 64, offset: 2752)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !574, file: !575, line: 121, baseType: !232, size: 64, offset: 2816)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !574, file: !575, line: 122, baseType: !496, size: 1152, offset: 2880)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !574, file: !575, line: 123, baseType: !171, size: 16, offset: 4032)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !574, file: !575, line: 123, baseType: !171, size: 16, offset: 4048)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !574, file: !575, line: 123, baseType: !652, size: 32, offset: 4064)
!652 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 32, elements: !653)
!653 = !{!654}
!654 = !DISubrange(count: 2)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !574, file: !575, line: 126, baseType: !656, size: 64, offset: 4096)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !139, line: 159, size: 448, elements: !658)
!658 = !{!659, !661, !662, !663, !664, !667}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !657, file: !139, line: 161, baseType: !660, size: 64)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !653)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !657, file: !139, line: 162, baseType: !660, size: 64, offset: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !657, file: !139, line: 163, baseType: !652, size: 32, offset: 128)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !657, file: !139, line: 164, baseType: !652, size: 32, offset: 160)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !657, file: !139, line: 165, baseType: !665, size: 128, offset: 192)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !666, size: 128, elements: !653)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !657, file: !139, line: 166, baseType: !668, size: 128, offset: 320)
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !669, size: 128, elements: !653)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !139, line: 46, flags: DIFlagFwdDecl)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !574, file: !575, line: 129, baseType: !672, size: 64, offset: 4160)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !674, line: 328, size: 3456, elements: !675)
!674 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!675 = !{!676, !677, !678, !681, !682, !686, !687, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !712, !713, !714, !717, !722, !723, !726, !730, !735, !739, !743, !744, !745, !746}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !673, file: !674, line: 329, baseType: !138, size: 960)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !673, file: !674, line: 330, baseType: !214, size: 64, offset: 960)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !673, file: !674, line: 332, baseType: !679, size: 64, offset: 1024)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !674, line: 332, flags: DIFlagFwdDecl)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !673, file: !674, line: 333, baseType: !188, size: 512, offset: 1088)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !673, file: !674, line: 335, baseType: !683, size: 64, offset: 1600)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !685, line: 41, flags: DIFlagFwdDecl)
!685 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!686 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !673, file: !674, line: 337, baseType: !307, size: 64, offset: 1664)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !673, file: !674, line: 338, baseType: !688, size: 64, offset: 1728)
!688 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 64, elements: !653)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !673, file: !674, line: 340, baseType: !198, size: 128, offset: 1792)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !673, file: !674, line: 340, baseType: !198, size: 128, offset: 1920)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !673, file: !674, line: 342, baseType: !173, size: 32, offset: 2048)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !673, file: !674, line: 342, baseType: !173, size: 32, offset: 2080)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !673, file: !674, line: 343, baseType: !173, size: 32, offset: 2112)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !673, file: !674, line: 345, baseType: !173, size: 32, offset: 2144)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !673, file: !674, line: 346, baseType: !173, size: 32, offset: 2176)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !673, file: !674, line: 347, baseType: !171, size: 16, offset: 2208)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !673, file: !674, line: 348, baseType: !171, size: 16, offset: 2224)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !673, file: !674, line: 349, baseType: !173, size: 32, offset: 2240)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !673, file: !674, line: 351, baseType: !173, size: 32, offset: 2272)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !673, file: !674, line: 353, baseType: !171, size: 16, offset: 2304)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !673, file: !674, line: 354, baseType: !171, size: 16, offset: 2320)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !673, file: !674, line: 355, baseType: !173, size: 32, offset: 2336)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !673, file: !674, line: 357, baseType: !704, size: 128, offset: 2368)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !705, line: 95, baseType: !706)
!705 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !705, line: 92, size: 128, elements: !707)
!707 = !{!708, !709, !710, !711}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !706, file: !705, line: 93, baseType: !241, size: 32)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !706, file: !705, line: 93, baseType: !241, size: 32, offset: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !706, file: !705, line: 94, baseType: !241, size: 32, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !706, file: !705, line: 94, baseType: !241, size: 32, offset: 96)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !673, file: !674, line: 363, baseType: !198, size: 128, offset: 2496)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !673, file: !674, line: 363, baseType: !198, size: 128, offset: 2624)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !673, file: !674, line: 368, baseType: !715, size: 64, offset: 2752)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !674, line: 48, flags: DIFlagFwdDecl)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !673, file: !674, line: 372, baseType: !718, size: 32, offset: 2816)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !674, line: 274, baseType: !719)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !674, line: 271, size: 32, elements: !720)
!720 = !{!721}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !719, file: !674, line: 273, baseType: !5, size: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !673, file: !674, line: 373, baseType: !173, size: 32, offset: 2848)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !673, file: !674, line: 382, baseType: !724, size: 64, offset: 2880)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !674, line: 46, flags: DIFlagFwdDecl)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !673, file: !674, line: 385, baseType: !727, size: 64, offset: 2944)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DISubroutineType(types: !729)
!729 = !{null, !143, !241}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !673, file: !674, line: 386, baseType: !731, size: 64, offset: 3008)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DISubroutineType(types: !733)
!733 = !{null, !143, !734}
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !673, file: !674, line: 387, baseType: !736, size: 64, offset: 3072)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DISubroutineType(types: !738)
!738 = !{!173, !143}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !673, file: !674, line: 388, baseType: !740, size: 64, offset: 3136)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DISubroutineType(types: !742)
!742 = !{null, !143}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !673, file: !674, line: 389, baseType: !143, size: 64, offset: 3200)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !673, file: !674, line: 389, baseType: !143, size: 64, offset: 3264)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !673, file: !674, line: 389, baseType: !143, size: 64, offset: 3328)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !673, file: !674, line: 389, baseType: !143, size: 64, offset: 3392)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !566, file: !567, line: 1223, baseType: !565, size: 64, offset: 1152)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !566, file: !567, line: 1225, baseType: !198, size: 128, offset: 1216)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !566, file: !567, line: 1226, baseType: !750, size: 64, offset: 1344)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !567, line: 69, size: 320, elements: !752)
!752 = !{!753, !754, !755, !756, !757, !758, !759, !760}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !751, file: !567, line: 70, baseType: !750, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !751, file: !567, line: 70, baseType: !750, size: 64, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !751, file: !567, line: 71, baseType: !5, size: 32, offset: 128)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !751, file: !567, line: 71, baseType: !5, size: 32, offset: 160)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !751, file: !567, line: 72, baseType: !173, size: 32, offset: 192)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !751, file: !567, line: 73, baseType: !171, size: 16, offset: 224)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !751, file: !567, line: 73, baseType: !171, size: 16, offset: 240)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !751, file: !567, line: 74, baseType: !226, size: 64, offset: 256)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !566, file: !567, line: 1227, baseType: !226, size: 64, offset: 1408)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !566, file: !567, line: 1229, baseType: !276, size: 96, offset: 1472)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !566, file: !567, line: 1230, baseType: !276, size: 96, offset: 1568)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !566, file: !567, line: 1231, baseType: !276, size: 96, offset: 1664)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !566, file: !567, line: 1231, baseType: !276, size: 96, offset: 1760)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !566, file: !567, line: 1233, baseType: !5, size: 32, offset: 1856)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !566, file: !567, line: 1234, baseType: !173, size: 32, offset: 1888)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !566, file: !567, line: 1235, baseType: !5, size: 32, offset: 1920)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !566, file: !567, line: 1237, baseType: !171, size: 16, offset: 1952)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !566, file: !567, line: 1239, baseType: !158, size: 8, offset: 1968)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !566, file: !567, line: 1240, baseType: !470, size: 8, offset: 1976)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !566, file: !567, line: 1242, baseType: !672, size: 64, offset: 1984)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !566, file: !567, line: 1244, baseType: !774, size: 64, offset: 2048)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !776, line: 200, size: 17024, elements: !777)
!776 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!777 = !{!778, !780, !781, !782, !1180, !1181, !1182, !1183, !1184, !1185, !1186}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !775, file: !776, line: 201, baseType: !779, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !775, file: !776, line: 202, baseType: !198, size: 128, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !775, file: !776, line: 203, baseType: !198, size: 128, offset: 192)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !775, file: !776, line: 206, baseType: !783, size: 64, offset: 320)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !776, line: 190, baseType: !785)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !776, line: 126, size: 2816, elements: !786)
!786 = !{!787, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !885, !886, !887, !888, !1152, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1179}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !785, file: !776, line: 127, baseType: !788, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !785, file: !776, line: 127, baseType: !788, size: 64, offset: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !785, file: !776, line: 128, baseType: !143, size: 64, offset: 128)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !785, file: !776, line: 129, baseType: !143, size: 64, offset: 192)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !785, file: !776, line: 130, baseType: !188, size: 512, offset: 256)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !785, file: !776, line: 132, baseType: !173, size: 32, offset: 768)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !785, file: !776, line: 132, baseType: !173, size: 32, offset: 800)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !785, file: !776, line: 133, baseType: !173, size: 32, offset: 832)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !785, file: !776, line: 134, baseType: !173, size: 32, offset: 864)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !785, file: !776, line: 134, baseType: !173, size: 32, offset: 896)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !785, file: !776, line: 134, baseType: !173, size: 32, offset: 928)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !785, file: !776, line: 135, baseType: !173, size: 32, offset: 960)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !785, file: !776, line: 135, baseType: !173, size: 32, offset: 992)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !785, file: !776, line: 136, baseType: !173, size: 32, offset: 1024)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !785, file: !776, line: 136, baseType: !173, size: 32, offset: 1056)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !785, file: !776, line: 137, baseType: !173, size: 32, offset: 1088)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !785, file: !776, line: 137, baseType: !173, size: 32, offset: 1120)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !785, file: !776, line: 138, baseType: !241, size: 32, offset: 1152)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !785, file: !776, line: 139, baseType: !241, size: 32, offset: 1184)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !785, file: !776, line: 139, baseType: !241, size: 32, offset: 1216)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !785, file: !776, line: 141, baseType: !171, size: 16, offset: 1248)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !785, file: !776, line: 142, baseType: !171, size: 16, offset: 1264)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !785, file: !776, line: 143, baseType: !173, size: 32, offset: 1280)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !785, file: !776, line: 144, baseType: !173, size: 32, offset: 1312)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !785, file: !776, line: 146, baseType: !813, size: 64, offset: 1344)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !776, line: 114, baseType: !815)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !776, line: 99, size: 7232, elements: !816)
!816 = !{!817, !819, !820, !821, !822, !823, !824, !835, !839, !853, !862, !869, !879}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !815, file: !776, line: 100, baseType: !818, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !815, file: !776, line: 100, baseType: !818, size: 64, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !815, file: !776, line: 101, baseType: !173, size: 32, offset: 128)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !815, file: !776, line: 101, baseType: !173, size: 32, offset: 160)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !815, file: !776, line: 102, baseType: !173, size: 32, offset: 192)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !815, file: !776, line: 102, baseType: !173, size: 32, offset: 224)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !815, file: !776, line: 103, baseType: !825, size: 64, offset: 256)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !776, line: 59, baseType: !827)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !776, line: 56, size: 2112, elements: !828)
!828 = !{!829, !833, !834}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !827, file: !776, line: 57, baseType: !830, size: 2048)
!830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 2048, elements: !831)
!831 = !{!832}
!832 = !DISubrange(count: 256)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !827, file: !776, line: 58, baseType: !173, size: 32, offset: 2048)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !827, file: !776, line: 58, baseType: !173, size: 32, offset: 2080)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !815, file: !776, line: 106, baseType: !836, size: 6144, offset: 320)
!836 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 6144, elements: !837)
!837 = !{!838}
!838 = !DISubrange(count: 768)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !815, file: !776, line: 107, baseType: !840, size: 64, offset: 6464)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !776, line: 97, baseType: !842)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !776, line: 83, size: 8320, elements: !843)
!843 = !{!844, !845, !846, !849, !850, !851, !852}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !842, file: !776, line: 84, baseType: !836, size: 6144)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !842, file: !776, line: 87, baseType: !830, size: 2048, offset: 6144)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !842, file: !776, line: 88, baseType: !847, size: 64, offset: 8192)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !562, line: 41, flags: DIFlagFwdDecl)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !842, file: !776, line: 90, baseType: !171, size: 16, offset: 8256)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !842, file: !776, line: 92, baseType: !171, size: 16, offset: 8272)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !842, file: !776, line: 93, baseType: !171, size: 16, offset: 8288)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !842, file: !776, line: 95, baseType: !171, size: 16, offset: 8304)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !815, file: !776, line: 108, baseType: !854, size: 64, offset: 6528)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !776, line: 66, baseType: !856)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !776, line: 61, size: 128, elements: !857)
!857 = !{!858, !859, !860, !861}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !856, file: !776, line: 62, baseType: !173, size: 32)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !856, file: !776, line: 63, baseType: !173, size: 32, offset: 32)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !856, file: !776, line: 64, baseType: !173, size: 32, offset: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !856, file: !776, line: 65, baseType: !173, size: 32, offset: 96)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !815, file: !776, line: 109, baseType: !863, size: 64, offset: 6592)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !776, line: 71, baseType: !865)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !776, line: 68, size: 64, elements: !866)
!866 = !{!867, !868}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !865, file: !776, line: 69, baseType: !173, size: 32)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !865, file: !776, line: 70, baseType: !173, size: 32, offset: 32)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !815, file: !776, line: 110, baseType: !870, size: 64, offset: 6656)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !776, line: 81, baseType: !872)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !776, line: 73, size: 352, elements: !873)
!873 = !{!874, !875, !876, !877, !878}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !872, file: !776, line: 74, baseType: !276, size: 96)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !872, file: !776, line: 75, baseType: !276, size: 96, offset: 96)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !872, file: !776, line: 76, baseType: !276, size: 96, offset: 192)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !872, file: !776, line: 77, baseType: !173, size: 32, offset: 288)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !872, file: !776, line: 78, baseType: !173, size: 32, offset: 320)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !815, file: !776, line: 113, baseType: !880, size: 512, offset: 6720)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !881, line: 182, baseType: !882)
!881 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !881, line: 180, size: 512, elements: !883)
!883 = !{!884}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !882, file: !881, line: 181, baseType: !188, size: 512)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !785, file: !776, line: 148, baseType: !232, size: 64, offset: 1408)
