; ModuleID = 'spec_ft.c'
source_filename = "spec_ft.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.FT_FaceRec_ = type { i64, i64, i64, i64, i64, i8*, i8*, i32, %struct.FT_Bitmap_Size_*, i32, %struct.FT_CharMapRec_**, %struct.FT_Generic_, %struct.FT_BBox_, i16, i16, i16, i16, i16, i16, i16, i16, %struct.FT_GlyphSlotRec_*, %struct.FT_SizeRec_*, %struct.FT_CharMapRec_*, %struct.FT_DriverRec_*, %struct.FT_MemoryRec_*, %struct.FT_StreamRec_*, %struct.FT_ListRec_, %struct.FT_Generic_, i8*, %struct.FT_Face_InternalRec_* }
%struct.FT_Bitmap_Size_ = type { i16, i16, i64, i64, i64 }
%struct.FT_BBox_ = type { i64, i64, i64, i64 }
%struct.FT_GlyphSlotRec_ = type { %struct.FT_LibraryRec_*, %struct.FT_FaceRec_*, %struct.FT_GlyphSlotRec_*, i32, %struct.FT_Generic_, %struct.FT_Glyph_Metrics_, i64, i64, %struct.FT_Vector_, i32, %struct.FT_Bitmap_, i32, i32, %struct.FT_Outline_, i32, %struct.FT_SubGlyphRec_*, i8*, i64, i64, i64, i8*, %struct.FT_Slot_InternalRec_* }
%struct.FT_LibraryRec_ = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "spec_ft.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !26, !34}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FT_Encoding_", file: !4, line: 742, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "include/freetype.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25}
!7 = !DIEnumerator(name: "FT_ENCODING_NONE", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "FT_ENCODING_MS_SYMBOL", value: 1937337698, isUnsigned: true)
!9 = !DIEnumerator(name: "FT_ENCODING_UNICODE", value: 1970170211, isUnsigned: true)
!10 = !DIEnumerator(name: "FT_ENCODING_SJIS", value: 1936353651, isUnsigned: true)
!11 = !DIEnumerator(name: "FT_ENCODING_GB2312", value: 1734484000, isUnsigned: true)
!12 = !DIEnumerator(name: "FT_ENCODING_BIG5", value: 1651074869, isUnsigned: true)
!13 = !DIEnumerator(name: "FT_ENCODING_WANSUNG", value: 2002873971, isUnsigned: true)
!14 = !DIEnumerator(name: "FT_ENCODING_JOHAB", value: 1785686113, isUnsigned: true)
!15 = !DIEnumerator(name: "FT_ENCODING_MS_SJIS", value: 1936353651, isUnsigned: true)
!16 = !DIEnumerator(name: "FT_ENCODING_MS_GB2312", value: 1734484000, isUnsigned: true)
!17 = !DIEnumerator(name: "FT_ENCODING_MS_BIG5", value: 1651074869, isUnsigned: true)
!18 = !DIEnumerator(name: "FT_ENCODING_MS_WANSUNG", value: 2002873971, isUnsigned: true)
!19 = !DIEnumerator(name: "FT_ENCODING_MS_JOHAB", value: 1785686113, isUnsigned: true)
!20 = !DIEnumerator(name: "FT_ENCODING_ADOBE_STANDARD", value: 1094995778, isUnsigned: true)
!21 = !DIEnumerator(name: "FT_ENCODING_ADOBE_EXPERT", value: 1094992453, isUnsigned: true)
!22 = !DIEnumerator(name: "FT_ENCODING_ADOBE_CUSTOM", value: 1094992451, isUnsigned: true)
!23 = !DIEnumerator(name: "FT_ENCODING_ADOBE_LATIN_1", value: 1818326065, isUnsigned: true)
!24 = !DIEnumerator(name: "FT_ENCODING_OLD_LATIN_2", value: 1818326066, isUnsigned: true)
!25 = !DIEnumerator(name: "FT_ENCODING_APPLE_ROMAN", value: 1634889070, isUnsigned: true)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FT_Glyph_Format_", file: !27, line: 720, baseType: !5, size: 32, elements: !28)
!27 = !DIFile(filename: "include/ftimage.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!28 = !{!29, !30, !31, !32, !33}
!29 = !DIEnumerator(name: "FT_GLYPH_FORMAT_NONE", value: 0, isUnsigned: true)
!30 = !DIEnumerator(name: "FT_GLYPH_FORMAT_COMPOSITE", value: 1668246896, isUnsigned: true)
!31 = !DIEnumerator(name: "FT_GLYPH_FORMAT_BITMAP", value: 1651078259, isUnsigned: true)
!32 = !DIEnumerator(name: "FT_GLYPH_FORMAT_OUTLINE", value: 1869968492, isUnsigned: true)
!33 = !DIEnumerator(name: "FT_GLYPH_FORMAT_PLOTTER", value: 1886154612, isUnsigned: true)
!34 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FT_Render_Mode_", file: !4, line: 2850, baseType: !5, size: 32, elements: !35)
!35 = !{!36, !37, !38, !39, !40, !41}
!36 = !DIEnumerator(name: "FT_RENDER_MODE_NORMAL", value: 0, isUnsigned: true)
!37 = !DIEnumerator(name: "FT_RENDER_MODE_LIGHT", value: 1, isUnsigned: true)
!38 = !DIEnumerator(name: "FT_RENDER_MODE_MONO", value: 2, isUnsigned: true)
!39 = !DIEnumerator(name: "FT_RENDER_MODE_LCD", value: 3, isUnsigned: true)
!40 = !DIEnumerator(name: "FT_RENDER_MODE_LCD_V", value: 4, isUnsigned: true)
!41 = !DIEnumerator(name: "FT_RENDER_MODE_MAX", value: 5, isUnsigned: true)
!42 = !{i32 7, !"Dwarf Version", i32 4}
!43 = !{i32 2, !"Debug Info Version", i32 3}
!44 = !{i32 1, !"wchar_size", i32 4}
!45 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!46 = distinct !DISubprogram(name: "FT_Attach_File", scope: !1, file: !1, line: 14, type: !47, scopeLine: 16, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !304)
!47 = !DISubroutineType(types: !48)
!48 = !{!49, !52, !302}
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Error", file: !50, line: 300, baseType: !51)
!50 = !DIFile(filename: "include/fttypes.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!51 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Face", file: !4, line: 484, baseType: !53)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_FaceRec_", file: !4, line: 995, size: 1984, elements: !55)
!55 = !{!56, !59, !60, !61, !62, !63, !67, !68, !70, !83, !84, !97, !108, !116, !117, !118, !119, !120, !121, !122, !123, !124, !204, !227, !228, !232, !254, !283, !296, !297, !298}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "num_faces", scope: !54, file: !4, line: 997, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Long", file: !50, line: 242, baseType: !58)
!58 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "face_index", scope: !54, file: !4, line: 998, baseType: !57, size: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "face_flags", scope: !54, file: !4, line: 1000, baseType: !57, size: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "style_flags", scope: !54, file: !4, line: 1001, baseType: !57, size: 64, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "num_glyphs", scope: !54, file: !4, line: 1003, baseType: !57, size: 64, offset: 256)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "family_name", scope: !54, file: !4, line: 1005, baseType: !64, size: 64, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_String", file: !50, line: 187, baseType: !66)
!66 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "style_name", scope: !54, file: !4, line: 1006, baseType: !64, size: 64, offset: 384)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "num_fixed_sizes", scope: !54, file: !4, line: 1008, baseType: !69, size: 32, offset: 448)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Int", file: !50, line: 220, baseType: !51)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "available_sizes", scope: !54, file: !4, line: 1009, baseType: !71, size: 64, offset: 512)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Bitmap_Size", file: !4, line: 373, baseType: !73)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Bitmap_Size_", file: !4, line: 363, size: 256, elements: !74)
!74 = !{!75, !78, !79, !81, !82}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !73, file: !4, line: 365, baseType: !76, size: 16)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Short", file: !50, line: 198, baseType: !77)
!77 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !73, file: !4, line: 366, baseType: !76, size: 16, offset: 16)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !73, file: !4, line: 368, baseType: !80, size: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Pos", file: !27, line: 58, baseType: !58)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "x_ppem", scope: !73, file: !4, line: 370, baseType: !80, size: 64, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "y_ppem", scope: !73, file: !4, line: 371, baseType: !80, size: 64, offset: 192)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "num_charmaps", scope: !54, file: !4, line: 1011, baseType: !69, size: 32, offset: 576)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "charmaps", scope: !54, file: !4, line: 1012, baseType: !85, size: 64, offset: 640)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_CharMap", file: !4, line: 568, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_CharMapRec_", file: !4, line: 816, size: 128, elements: !89)
!89 = !{!90, !91, !93, !96}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "face", scope: !88, file: !4, line: 818, baseType: !52, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !88, file: !4, line: 819, baseType: !92, size: 32, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Encoding", file: !4, line: 771, baseType: !3)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "platform_id", scope: !88, file: !4, line: 820, baseType: !94, size: 16, offset: 96)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_UShort", file: !50, line: 209, baseType: !95)
!95 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "encoding_id", scope: !88, file: !4, line: 821, baseType: !94, size: 16, offset: 112)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !54, file: !4, line: 1014, baseType: !98, size: 128, offset: 704)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Generic", file: !50, line: 464, baseType: !99)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Generic_", file: !50, line: 459, size: 128, elements: !100)
!100 = !{!101, !103}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !99, file: !50, line: 461, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "finalizer", scope: !99, file: !50, line: 462, baseType: !104, size: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Generic_Finalizer", file: !50, line: 428, baseType: !105)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DISubroutineType(types: !107)
!107 = !{null, !102}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "bbox", scope: !54, file: !4, line: 1019, baseType: !109, size: 256, offset: 832)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_BBox", file: !27, line: 120, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_BBox_", file: !27, line: 115, size: 256, elements: !111)
!111 = !{!112, !113, !114, !115}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "xMin", scope: !110, file: !27, line: 117, baseType: !80, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "yMin", scope: !110, file: !27, line: 117, baseType: !80, size: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "xMax", scope: !110, file: !27, line: 118, baseType: !80, size: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "yMax", scope: !110, file: !27, line: 118, baseType: !80, size: 64, offset: 192)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "units_per_EM", scope: !54, file: !4, line: 1021, baseType: !94, size: 16, offset: 1088)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "ascender", scope: !54, file: !4, line: 1022, baseType: !76, size: 16, offset: 1104)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "descender", scope: !54, file: !4, line: 1023, baseType: !76, size: 16, offset: 1120)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !54, file: !4, line: 1024, baseType: !76, size: 16, offset: 1136)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "max_advance_width", scope: !54, file: !4, line: 1026, baseType: !76, size: 16, offset: 1152)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "max_advance_height", scope: !54, file: !4, line: 1027, baseType: !76, size: 16, offset: 1168)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "underline_position", scope: !54, file: !4, line: 1029, baseType: !76, size: 16, offset: 1184)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "underline_thickness", scope: !54, file: !4, line: 1030, baseType: !76, size: 16, offset: 1200)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "glyph", scope: !54, file: !4, line: 1032, baseType: !125, size: 64, offset: 1216)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_GlyphSlot", file: !4, line: 536, baseType: !126)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_GlyphSlotRec_", file: !4, line: 1706, size: 2432, elements: !128)
!128 = !{!129, !133, !134, !135, !137, !138, !150, !152, !153, !159, !161, !175, !176, !177, !190, !191, !195, !196, !197, !198, !199, !200}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "library", scope: !127, file: !4, line: 1708, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Library", file: !4, line: 406, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "FT_LibraryRec_", file: !4, line: 406, flags: DIFlagFwdDecl)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "face", scope: !127, file: !4, line: 1709, baseType: !52, size: 64, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !127, file: !4, line: 1710, baseType: !125, size: 64, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !127, file: !4, line: 1711, baseType: !136, size: 32, offset: 192)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_UInt", file: !50, line: 231, baseType: !5)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !127, file: !4, line: 1712, baseType: !98, size: 128, offset: 256)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "metrics", scope: !127, file: !4, line: 1714, baseType: !139, size: 512, offset: 384)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Glyph_Metrics", file: !4, line: 322, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Glyph_Metrics_", file: !4, line: 309, size: 512, elements: !141)
!141 = !{!142, !143, !144, !145, !146, !147, !148, !149}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !140, file: !4, line: 311, baseType: !80, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !140, file: !4, line: 312, baseType: !80, size: 64, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "horiBearingX", scope: !140, file: !4, line: 314, baseType: !80, size: 64, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "horiBearingY", scope: !140, file: !4, line: 315, baseType: !80, size: 64, offset: 192)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "horiAdvance", scope: !140, file: !4, line: 316, baseType: !80, size: 64, offset: 256)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "vertBearingX", scope: !140, file: !4, line: 318, baseType: !80, size: 64, offset: 320)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "vertBearingY", scope: !140, file: !4, line: 319, baseType: !80, size: 64, offset: 384)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "vertAdvance", scope: !140, file: !4, line: 320, baseType: !80, size: 64, offset: 448)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "linearHoriAdvance", scope: !127, file: !4, line: 1715, baseType: !151, size: 64, offset: 896)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Fixed", file: !50, line: 288, baseType: !58)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "linearVertAdvance", scope: !127, file: !4, line: 1716, baseType: !151, size: 64, offset: 960)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "advance", scope: !127, file: !4, line: 1717, baseType: !154, size: 128, offset: 1024)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Vector", file: !27, line: 79, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Vector_", file: !27, line: 74, size: 128, elements: !156)
!156 = !{!157, !158}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !155, file: !27, line: 76, baseType: !80, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !155, file: !27, line: 77, baseType: !80, size: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !127, file: !4, line: 1719, baseType: !160, size: 32, offset: 1152)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Glyph_Format", file: !27, line: 729, baseType: !26)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap", scope: !127, file: !4, line: 1721, baseType: !162, size: 320, offset: 1216)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Bitmap", file: !27, line: 277, baseType: !163)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Bitmap_", file: !27, line: 266, size: 320, elements: !164)
!164 = !{!165, !166, !167, !168, !171, !172, !173, !174}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !163, file: !27, line: 268, baseType: !5, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !163, file: !27, line: 269, baseType: !5, size: 32, offset: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !163, file: !27, line: 270, baseType: !51, size: 32, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !163, file: !27, line: 271, baseType: !169, size: 64, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "num_grays", scope: !163, file: !27, line: 272, baseType: !95, size: 16, offset: 192)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_mode", scope: !163, file: !27, line: 273, baseType: !170, size: 8, offset: 208)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "palette_mode", scope: !163, file: !27, line: 274, baseType: !170, size: 8, offset: 216)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !163, file: !27, line: 275, baseType: !102, size: 64, offset: 256)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap_left", scope: !127, file: !4, line: 1722, baseType: !69, size: 32, offset: 1536)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap_top", scope: !127, file: !4, line: 1723, baseType: !69, size: 32, offset: 1568)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "outline", scope: !127, file: !4, line: 1725, baseType: !178, size: 320, offset: 1600)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Outline", file: !27, line: 350, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Outline_", file: !27, line: 339, size: 320, elements: !180)
!180 = !{!181, !182, !183, !185, !187, !189}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "n_contours", scope: !179, file: !27, line: 341, baseType: !77, size: 16)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "n_points", scope: !179, file: !27, line: 342, baseType: !77, size: 16, offset: 16)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !179, file: !27, line: 344, baseType: !184, size: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "tags", scope: !179, file: !27, line: 345, baseType: !186, size: 64, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "contours", scope: !179, file: !27, line: 346, baseType: !188, size: 64, offset: 192)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !179, file: !27, line: 348, baseType: !51, size: 32, offset: 256)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "num_subglyphs", scope: !127, file: !4, line: 1727, baseType: !136, size: 32, offset: 1920)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "subglyphs", scope: !127, file: !4, line: 1728, baseType: !192, size: 64, offset: 1984)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_SubGlyph", file: !4, line: 1523, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "FT_SubGlyphRec_", file: !4, line: 1523, flags: DIFlagFwdDecl)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "control_data", scope: !127, file: !4, line: 1730, baseType: !102, size: 64, offset: 2048)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "control_len", scope: !127, file: !4, line: 1731, baseType: !58, size: 64, offset: 2112)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "lsb_delta", scope: !127, file: !4, line: 1733, baseType: !80, size: 64, offset: 2176)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "rsb_delta", scope: !127, file: !4, line: 1734, baseType: !80, size: 64, offset: 2240)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !127, file: !4, line: 1736, baseType: !102, size: 64, offset: 2304)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !127, file: !4, line: 1738, baseType: !201, size: 64, offset: 2368)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Slot_Internal", file: !4, line: 1535, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Slot_InternalRec_", file: !4, line: 1535, flags: DIFlagFwdDecl)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !54, file: !4, line: 1033, baseType: !205, size: 64, offset: 1280)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Size", file: !4, line: 515, baseType: !206)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_SizeRec_", file: !4, line: 1497, size: 704, elements: !208)
!208 = !{!209, !210, !211, !223}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "face", scope: !207, file: !4, line: 1499, baseType: !52, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !207, file: !4, line: 1500, baseType: !98, size: 128, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "metrics", scope: !207, file: !4, line: 1501, baseType: !212, size: 448, offset: 192)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Size_Metrics", file: !4, line: 1475, baseType: !213)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Size_Metrics_", file: !4, line: 1462, size: 448, elements: !214)
!214 = !{!215, !216, !217, !218, !219, !220, !221, !222}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "x_ppem", scope: !213, file: !4, line: 1464, baseType: !94, size: 16)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "y_ppem", scope: !213, file: !4, line: 1465, baseType: !94, size: 16, offset: 16)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "x_scale", scope: !213, file: !4, line: 1467, baseType: !151, size: 64, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "y_scale", scope: !213, file: !4, line: 1468, baseType: !151, size: 64, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "ascender", scope: !213, file: !4, line: 1470, baseType: !80, size: 64, offset: 192)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "descender", scope: !213, file: !4, line: 1471, baseType: !80, size: 64, offset: 256)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !213, file: !4, line: 1472, baseType: !80, size: 64, offset: 320)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "max_advance", scope: !213, file: !4, line: 1473, baseType: !80, size: 64, offset: 384)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !207, file: !4, line: 1502, baseType: !224, size: 64, offset: 640)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Size_Internal", file: !4, line: 1404, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Size_InternalRec_", file: !4, line: 1404, flags: DIFlagFwdDecl)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "charmap", scope: !54, file: !4, line: 1034, baseType: !86, size: 64, offset: 1344)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "driver", scope: !54, file: !4, line: 1038, baseType: !229, size: 64, offset: 1408)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Driver", file: !4, line: 438, baseType: !230)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "FT_DriverRec_", file: !4, line: 438, flags: DIFlagFwdDecl)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !54, file: !4, line: 1039, baseType: !233, size: 64, offset: 1472)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Memory", file: !234, line: 66, baseType: !235)
!234 = !DIFile(filename: "include/ftsystem.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_MemoryRec_", file: !234, line: 171, size: 256, elements: !237)
!237 = !{!238, !239, !244, !249}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !236, file: !234, line: 173, baseType: !102, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !236, file: !234, line: 174, baseType: !240, size: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Alloc_Func", file: !234, line: 89, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DISubroutineType(types: !243)
!243 = !{!102, !233, !58}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !236, file: !234, line: 175, baseType: !245, size: 64, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Free_Func", file: !234, line: 110, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{null, !233, !102}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "realloc", scope: !236, file: !234, line: 176, baseType: !250, size: 64, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Realloc_Func", file: !234, line: 143, baseType: !251)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DISubroutineType(types: !253)
!253 = !{!102, !233, !58, !58, !102}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !54, file: !4, line: 1040, baseType: !255, size: 64, offset: 1536)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Stream", file: !234, line: 196, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_StreamRec_", file: !234, line: 321, size: 640, elements: !258)
!258 = !{!259, !260, !262, !263, !269, !270, !275, !280, !281, !282}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !257, file: !234, line: 323, baseType: !169, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !257, file: !234, line: 324, baseType: !261, size: 64, offset: 64)
!261 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !257, file: !234, line: 325, baseType: !261, size: 64, offset: 128)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor", scope: !257, file: !234, line: 327, baseType: !264, size: 64, offset: 192)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_StreamDesc", file: !234, line: 214, baseType: !265)
!265 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "FT_StreamDesc_", file: !234, line: 209, size: 64, elements: !266)
!266 = !{!267, !268}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !265, file: !234, line: 211, baseType: !58, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !265, file: !234, line: 212, baseType: !102, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "pathname", scope: !257, file: !234, line: 328, baseType: !264, size: 64, offset: 256)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !257, file: !234, line: 329, baseType: !271, size: 64, offset: 320)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Stream_IoFunc", file: !234, line: 248, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!261, !255, !261, !169, !261}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !257, file: !234, line: 330, baseType: !276, size: 64, offset: 384)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Stream_CloseFunc", file: !234, line: 268, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{null, !255}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !257, file: !234, line: 332, baseType: !233, size: 64, offset: 448)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !257, file: !234, line: 333, baseType: !169, size: 64, offset: 512)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !257, file: !234, line: 334, baseType: !169, size: 64, offset: 576)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "sizes_list", scope: !54, file: !4, line: 1042, baseType: !284, size: 128, offset: 1600)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_ListRec", file: !50, line: 572, baseType: !285)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_ListRec_", file: !50, line: 567, size: 128, elements: !286)
!286 = !{!287, !295}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !285, file: !50, line: 569, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_ListNode", file: !50, line: 515, baseType: !289)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_ListNodeRec_", file: !50, line: 544, size: 192, elements: !291)
!291 = !{!292, !293, !294}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !290, file: !50, line: 546, baseType: !288, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !290, file: !50, line: 547, baseType: !288, size: 64, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !290, file: !50, line: 548, baseType: !102, size: 64, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !285, file: !50, line: 570, baseType: !288, size: 64, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "autohint", scope: !54, file: !4, line: 1044, baseType: !98, size: 128, offset: 1728)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !54, file: !4, line: 1045, baseType: !102, size: 64, offset: 1856)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !54, file: !4, line: 1047, baseType: !299, size: 64, offset: 1920)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Face_Internal", file: !4, line: 847, baseType: !300)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Face_InternalRec_", file: !4, line: 847, flags: DIFlagFwdDecl)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !66)
!304 = !{}
!305 = !DILocalVariable(name: "face", arg: 1, scope: !46, file: !1, line: 14, type: !52)
!306 = !DILocation(line: 14, column: 53, scope: !46)
!307 = !DILocalVariable(name: "filepathname", arg: 2, scope: !46, file: !1, line: 15, type: !302)
!308 = !DILocation(line: 15, column: 32, scope: !46)
!309 = !DILocation(line: 17, column: 13, scope: !46)
!310 = !DILocation(line: 17, column: 5, scope: !46)
!311 = !DILocation(line: 18, column: 5, scope: !46)
!312 = !DILocation(line: 19, column: 5, scope: !46)
!313 = distinct !DISubprogram(name: "FT_Attach_Stream", scope: !1, file: !1, line: 23, type: !314, scopeLine: 25, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !304)
!314 = !DISubroutineType(types: !315)
!315 = !{!49, !52, !316}
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Open_Args", file: !4, line: 1937, baseType: !318)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Open_Args_", file: !4, line: 1926, size: 512, elements: !319)
!319 = !{!320, !321, !325, !326, !327, !328, !332, !333}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !318, file: !4, line: 1928, baseType: !136, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "memory_base", scope: !318, file: !4, line: 1929, baseType: !322, size: 64, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !324)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Byte", file: !50, line: 154, baseType: !170)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "memory_size", scope: !318, file: !4, line: 1930, baseType: !57, size: 64, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "pathname", scope: !318, file: !4, line: 1931, baseType: !64, size: 64, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !318, file: !4, line: 1932, baseType: !255, size: 64, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "driver", scope: !318, file: !4, line: 1933, baseType: !329, size: 64, offset: 320)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Module", file: !4, line: 426, baseType: !330)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: "FT_ModuleRec_", file: !4, line: 426, flags: DIFlagFwdDecl)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "num_params", scope: !318, file: !4, line: 1934, baseType: !69, size: 32, offset: 384)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !318, file: !4, line: 1935, baseType: !334, size: 64, offset: 448)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Parameter", file: !4, line: 1865, baseType: !336)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FT_Parameter_", file: !4, line: 1860, size: 128, elements: !337)
!337 = !{!338, !340}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !336, file: !4, line: 1862, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_ULong", file: !50, line: 253, baseType: !261)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !336, file: !4, line: 1863, baseType: !341, size: 64, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "FT_Pointer", file: !50, line: 311, baseType: !102)
!342 = !DILocalVariable(name: "face", arg: 1, scope: !313, file: !1, line: 23, type: !52)
!343 = !DILocation(line: 23, column: 57, scope: !313)
!344 = !DILocalVariable(name: "parameters", arg: 2, scope: !313, file: !1, line: 24, type: !316)
!345 = !DILocation(line: 24, column: 36, scope: !313)
!346 = !DILocation(line: 26, column: 13, scope: !313)
!347 = !DILocation(line: 26, column: 5, scope: !313)
!348 = !DILocation(line: 27, column: 5, scope: !313)
!349 = !DILocation(line: 28, column: 5, scope: !313)
!350 = distinct !DISubprogram(name: "FT_Bitmap_Convert", scope: !1, file: !1, line: 32, type: !351, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !304)
!351 = !DISubroutineType(types: !352)
!352 = !{!49, !130, !353, !355, !69}
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !162)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!356 = !DILocalVariable(name: "library", arg: 1, scope: !350, file: !1, line: 32, type: !130)
!357 = !DILocation(line: 32, column: 60, scope: !350)
!358 = !DILocalVariable(name: "source", arg: 2, scope: !350, file: !1, line: 33, type: !353)
!359 = !DILocation(line: 33, column: 40, scope: !350)
!360 = !DILocalVariable(name: "target", arg: 3, scope: !350, file: !1, line: 34, type: !355)
!361 = !DILocation(line: 34, column: 40, scope: !350)
!362 = !DILocalVariable(name: "alignment", arg: 4, scope: !350, file: !1, line: 35, type: !69)
!363 = !DILocation(line: 35, column: 40, scope: !350)
!364 = !DILocation(line: 37, column: 13, scope: !350)
!365 = !DILocation(line: 37, column: 5, scope: !350)
!366 = !DILocation(line: 38, column: 5, scope: !350)
!367 = !DILocation(line: 39, column: 5, scope: !350)
!368 = distinct !DISubprogram(name: "FT_Bitmap_Copy", scope: !1, file: !1, line: 43, type: !369, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !304)
!369 = !DISubroutineType(types: !370)
!370 = !{!49, !130, !353, !355}
!371 = !DILocalVariable(name: "library", arg: 1, scope: !368, file: !1, line: 43, type: !130)
!372 = !DILocation(line: 43, column: 57, scope: !368)
!373 = !DILocalVariable(name: "source", arg: 2, scope: !368, file: !1, line: 44, type: !353)
!374 = !DILocation(line: 44, column: 37, scope: !368)
!375 = !DILocalVariable(name: "target", arg: 3, scope: !368, file: !1, line: 45, type: !355)
!376 = !DILocation(line: 45, column: 37, scope: !368)
!377 = !DILocation(line: 47, column: 13, scope: !368)
!378 = !DILocation(line: 47, column: 5, scope: !368)
!379 = !DILocation(line: 48, column: 5, scope: !368)
!380 = !DILocation(line: 49, column: 5, scope: !368)
!381 = distinct !DISubprogram(name: "FT_Bitmap_Done", scope: !1, file: !1, line: 53, type: !382, scopeLine: 55, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !304)
!382 = !DISubroutineType(types: !383)
!383 = !{!49, !130, !355}
!384 = !DILocalVariable(name: "library", arg: 1, scope: !381, file: !1, line: 53, type: !130)
!385 = !DILocation(line: 53, column: 51, scope: !381)
!386 = !DILocalVariable(name: "bitmap", arg: 2, scope: !381, file: !1, line: 54, type: !355)
!387 = !DILocation(line: 54, column: 31, scope: !381)
!388 = !DILocation(line: 56, column: 13, scope: !381)
!389 = !DILocation(line: 56, column: 5, scope: !381)
!390 = !DILocation(line: 57, column: 5, scope: !381)
!391 = !DILocation(line: 58, column: 5, scope: !381)
!392 = distinct !DISubprogram(name: "FT_Done_Face", scope: !1, file: !1, line: 62, type: !393, scopeLine: 63, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !304)
!393 = !DISubroutineType(types: !394)
!394 = !{!49, !52}
