; ModuleID = 'blender/source/blender/imbuf/intern/anim_movie.c'
source_filename = "blender/source/blender/imbuf/intern/anim_movie.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.anim = type { i32, i32, i32, i32, i16, float, i32, i32, [1024 x i8], [1024 x i8], i8*, i8*, i8*, i32, i64, i32, i32, i32, %struct._AviMovie*, [768 x i8], i32, i32, [4 x %struct.anim*], [4 x %struct.anim_index*], [64 x i8] }
%struct._AviMovie = type opaque
%struct.anim_index = type { [1024 x i8], i32, %struct.anim_index_entry* }
%struct.anim_index_entry = type { i32, i64, i64, i64 }
%struct.ImBuf = type { %struct.ImBuf*, %struct.ImBuf*, i32, i32, i8, i32, i32, i32, i32*, float*, [2 x double], i32, i32, i32, i32, i32**, i32*, float*, float, [20 x %struct.ImBuf*], i32, i32, i32, i32, %struct.ImMetaData*, i8*, i32, [1024 x i8], [1024 x i8], %struct.MEM_CacheLimiterHandle_s*, i32, i8*, i32, i32, %struct.ColorSpace*, %struct.ColorSpace*, i32*, %struct.ColormanageCache*, i32, %struct.rcti, %struct.DDSData }
%struct.ImMetaData = type opaque
%struct.MEM_CacheLimiterHandle_s = type opaque
%struct.ColorSpace = type { %struct.ColorSpace*, %struct.ColorSpace*, i32, [64 x i8], [512 x i8], %struct.OCIO_ConstProcessorRcPtr*, %struct.OCIO_ConstProcessorRcPtr*, i8, i8 }
%struct.OCIO_ConstProcessorRcPtr = type opaque
%struct.ColormanageCache = type opaque
%struct.rcti = type { i32, i32, i32, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !45, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/imbuf/intern/anim_movie.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !13, !22, !30}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 201, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "blender/source/blender/imbuf/IMB_colormanagement.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12}
!7 = !DIEnumerator(name: "COLOR_ROLE_SCENE_LINEAR", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "COLOR_ROLE_COLOR_PICKING", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "COLOR_ROLE_TEXTURE_PAINTING", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "COLOR_ROLE_DEFAULT_SEQUENCER", value: 3, isUnsigned: true)
!11 = !DIEnumerator(name: "COLOR_ROLE_DEFAULT_BYTE", value: 4, isUnsigned: true)
!12 = !DIEnumerator(name: "COLOR_ROLE_DEFAULT_FLOAT", value: 5, isUnsigned: true)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IMB_Timecode_Type", file: !14, line: 207, baseType: !5, size: 32, elements: !15)
!14 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!15 = !{!16, !17, !18, !19, !20, !21}
!16 = !DIEnumerator(name: "IMB_TC_NONE", value: 0, isUnsigned: true)
!17 = !DIEnumerator(name: "IMB_TC_RECORD_RUN", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "IMB_TC_FREE_RUN", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "IMB_TC_INTERPOLATED_REC_DATE_FREE_RUN", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "IMB_TC_RECORD_RUN_NO_GAPS", value: 8, isUnsigned: true)
!21 = !DIEnumerator(name: "IMB_TC_MAX_SLOT", value: 4, isUnsigned: true)
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IMB_Proxy_Size", file: !14, line: 224, baseType: !5, size: 32, elements: !23)
!23 = !{!24, !25, !26, !27, !28, !29}
!24 = !DIEnumerator(name: "IMB_PROXY_NONE", value: 0, isUnsigned: true)
!25 = !DIEnumerator(name: "IMB_PROXY_25", value: 1, isUnsigned: true)
!26 = !DIEnumerator(name: "IMB_PROXY_50", value: 2, isUnsigned: true)
!27 = !DIEnumerator(name: "IMB_PROXY_75", value: 4, isUnsigned: true)
!28 = !DIEnumerator(name: "IMB_PROXY_100", value: 8, isUnsigned: true)
!29 = !DIEnumerator(name: "IMB_PROXY_MAX_SLOT", value: 4, isUnsigned: true)
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 46, baseType: !5, size: 32, elements: !32)
!31 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!32 = !{!33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44}
!33 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!34 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!35 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!36 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!37 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!38 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!39 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!40 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!41 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!42 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!43 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!44 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!45 = !{!46, !47, !52, !113}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !49, line: 125, size: 24384, elements: !50)
!49 = !DIFile(filename: "blender/source/blender/imbuf/intern/IMB_anim.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!50 = !{!51, !53, !54, !55, !56, !58, !60, !61, !62, !67, !68, !69, !70, !71, !72, !76, !77, !78, !79, !82, !86, !87, !88, !92, !109}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "ib_flags", scope: !48, file: !49, line: 126, baseType: !52, size: 32)
!52 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "curtype", scope: !48, file: !49, line: 127, baseType: !52, size: 32, offset: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "curposition", scope: !48, file: !49, line: 128, baseType: !52, size: 32, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !48, file: !49, line: 129, baseType: !52, size: 32, offset: 96)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "frs_sec", scope: !48, file: !49, line: 130, baseType: !57, size: 16, offset: 128)
!57 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "frs_sec_base", scope: !48, file: !49, line: 131, baseType: !59, size: 32, offset: 160)
!59 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !48, file: !49, line: 132, baseType: !52, size: 32, offset: 192)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !48, file: !49, line: 132, baseType: !52, size: 32, offset: 224)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !48, file: !49, line: 135, baseType: !63, size: 8192, offset: 256)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 8192, elements: !65)
!64 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!65 = !{!66}
!66 = !DISubrange(count: 1024)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !48, file: !49, line: 137, baseType: !63, size: 8192, offset: 8448)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "movie", scope: !48, file: !49, line: 140, baseType: !46, size: 64, offset: 16640)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !48, file: !49, line: 141, baseType: !46, size: 64, offset: 16704)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !48, file: !49, line: 142, baseType: !46, size: 64, offset: 16768)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !48, file: !49, line: 143, baseType: !52, size: 32, offset: 16832)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "framesize", scope: !48, file: !49, line: 144, baseType: !73, size: 64, offset: 16896)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !74, line: 46, baseType: !75)
!74 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!75 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "interlacing", scope: !48, file: !49, line: 145, baseType: !52, size: 32, offset: 16960)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "preseek", scope: !48, file: !49, line: 146, baseType: !52, size: 32, offset: 16992)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !48, file: !49, line: 147, baseType: !52, size: 32, offset: 17024)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "avi", scope: !48, file: !49, line: 150, baseType: !80, size: 64, offset: 17088)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "_AviMovie", file: !49, line: 122, flags: DIFlagFwdDecl)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "index_dir", scope: !48, file: !49, line: 188, baseType: !83, size: 6144, offset: 17152)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 6144, elements: !84)
!84 = !{!85}
!85 = !DISubrange(count: 768)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "proxies_tried", scope: !48, file: !49, line: 190, baseType: !52, size: 32, offset: 23296)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "indices_tried", scope: !48, file: !49, line: 191, baseType: !52, size: 32, offset: 23328)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_anim", scope: !48, file: !49, line: 193, baseType: !89, size: 256, offset: 23360)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 256, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 4)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "curr_idx", scope: !48, file: !49, line: 194, baseType: !93, size: 256, offset: 23616)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 256, elements: !90)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "anim_index", file: !96, line: 65, size: 8320, elements: !97)
!96 = !DIFile(filename: "blender/source/blender/imbuf/intern/IMB_indexer.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!97 = !{!98, !99, !100}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !95, file: !96, line: 66, baseType: !63, size: 8192)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "num_entries", scope: !95, file: !96, line: 68, baseType: !52, size: 32, offset: 8192)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !95, file: !96, line: 69, baseType: !101, size: 64, offset: 8256)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "anim_index_entry", file: !96, line: 58, size: 256, elements: !103)
!103 = !{!104, !105, !107, !108}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "frameno", scope: !102, file: !96, line: 59, baseType: !52, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "seek_pos", scope: !102, file: !96, line: 60, baseType: !106, size: 64, offset: 64)
!106 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "seek_pos_dts", scope: !102, file: !96, line: 61, baseType: !106, size: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !102, file: !96, line: 62, baseType: !106, size: 64, offset: 192)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !48, file: !49, line: 196, baseType: !110, size: 512, offset: 23872)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 512, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 64)
!113 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!114 = !{i32 7, !"Dwarf Version", i32 4}
!115 = !{i32 2, !"Debug Info Version", i32 3}
!116 = !{i32 1, !"wchar_size", i32 4}
!117 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!118 = distinct !DISubprogram(name: "ismovie", scope: !1, file: !1, line: 119, type: !119, scopeLine: 120, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !123)
!119 = !DISubroutineType(types: !120)
!120 = !{!52, !121}
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!123 = !{}
!124 = !DILocalVariable(name: "UNUSED_filepath", arg: 1, scope: !118, file: !1, line: 119, type: !121)
!125 = !DILocation(line: 119, column: 25, scope: !118)
!126 = !DILocation(line: 121, column: 2, scope: !118)
!127 = distinct !DISubprogram(name: "IMB_free_anim", scope: !1, file: !1, line: 233, type: !128, scopeLine: 234, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !123)
!128 = !DISubroutineType(types: !129)
!129 = !{null, !47}
!130 = !DILocalVariable(name: "anim", arg: 1, scope: !127, file: !1, line: 233, type: !47)
!131 = !DILocation(line: 233, column: 33, scope: !127)
!132 = !DILocation(line: 235, column: 6, scope: !133)
!133 = distinct !DILexicalBlock(scope: !127, file: !1, line: 235, column: 6)
!134 = !DILocation(line: 235, column: 11, scope: !133)
!135 = !DILocation(line: 235, column: 6, scope: !127)
!136 = !DILocation(line: 236, column: 3, scope: !137)
!137 = distinct !DILexicalBlock(scope: !133, file: !1, line: 235, column: 20)
!138 = !DILocation(line: 237, column: 3, scope: !137)
!139 = !DILocation(line: 240, column: 18, scope: !127)
!140 = !DILocation(line: 240, column: 2, scope: !127)
!141 = !DILocation(line: 255, column: 19, scope: !127)
!142 = !DILocation(line: 255, column: 2, scope: !127)
!143 = !DILocation(line: 257, column: 2, scope: !127)
!144 = !DILocation(line: 257, column: 12, scope: !127)
!145 = !DILocation(line: 258, column: 1, scope: !127)
!146 = distinct !DISubprogram(name: "free_anim_movie", scope: !1, file: !1, line: 133, type: !128, scopeLine: 134, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !123)
!147 = !DILocalVariable(name: "UNUSED_anim", arg: 1, scope: !146, file: !1, line: 133, type: !47)
!148 = !DILocation(line: 133, column: 42, scope: !146)
!149 = !DILocation(line: 136, column: 1, scope: !146)
!150 = distinct !DISubprogram(name: "IMB_close_anim", scope: !1, file: !1, line: 260, type: !128, scopeLine: 261, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !123)
!151 = !DILocalVariable(name: "anim", arg: 1, scope: !150, file: !1, line: 260, type: !47)
!152 = !DILocation(line: 260, column: 34, scope: !150)
!153 = !DILocation(line: 262, column: 6, scope: !154)
!154 = distinct !DILexicalBlock(scope: !150, file: !1, line: 262, column: 6)
!155 = !DILocation(line: 262, column: 11, scope: !154)
!156 = !DILocation(line: 262, column: 6, scope: !150)
!157 = !DILocation(line: 262, column: 20, scope: !154)
!158 = !DILocation(line: 264, column: 16, scope: !150)
!159 = !DILocation(line: 264, column: 2, scope: !150)
!160 = !DILocation(line: 265, column: 1, scope: !150)
!161 = distinct !DISubprogram(name: "IMB_close_anim_proxies", scope: !1, file: !1, line: 267, type: !128, scopeLine: 268, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !123)
!162 = !DILocalVariable(name: "anim", arg: 1, scope: !161, file: !1, line: 267, type: !47)
!163 = !DILocation(line: 267, column: 42, scope: !161)
!164 = !DILocation(line: 269, column: 6, scope: !165)
!165 = distinct !DILexicalBlock(scope: !161, file: !1, line: 269, column: 6)
!166 = !DILocation(line: 269, column: 11, scope: !165)
!167 = !DILocation(line: 269, column: 6, scope: !161)
!168 = !DILocation(line: 270, column: 3, scope: !165)
!169 = !DILocation(line: 272, column: 19, scope: !161)
!170 = !DILocation(line: 272, column: 2, scope: !161)
!171 = !DILocation(line: 273, column: 1, scope: !161)
!172 = distinct !DISubprogram(name: "IMB_open_anim", scope: !1, file: !1, line: 275, type: !173, scopeLine: 276, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !123)
!173 = !DISubroutineType(types: !174)
!174 = !{!47, !121, !52, !52, !175}
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!176 = !DILocalVariable(name: "name", arg: 1, scope: !172, file: !1, line: 275, type: !121)
!177 = !DILocation(line: 275, column: 40, scope: !172)
!178 = !DILocalVariable(name: "ib_flags", arg: 2, scope: !172, file: !1, line: 275, type: !52)
!179 = !DILocation(line: 275, column: 50, scope: !172)
!180 = !DILocalVariable(name: "streamindex", arg: 3, scope: !172, file: !1, line: 275, type: !52)
!181 = !DILocation(line: 275, column: 64, scope: !172)
!182 = !DILocalVariable(name: "colorspace", arg: 4, scope: !172, file: !1, line: 275, type: !175)
!183 = !DILocation(line: 275, column: 82, scope: !172)
!184 = !DILocalVariable(name: "anim", scope: !172, file: !1, line: 277, type: !47)
!185 = !DILocation(line: 277, column: 15, scope: !172)
!186 = !DILocation(line: 279, column: 24, scope: !172)
!187 = !DILocation(line: 279, column: 9, scope: !172)
!188 = !DILocation(line: 279, column: 7, scope: !172)
!189 = !DILocation(line: 280, column: 6, scope: !190)
!190 = distinct !DILexicalBlock(scope: !172, file: !1, line: 280, column: 6)
!191 = !DILocation(line: 280, column: 11, scope: !190)
!192 = !DILocation(line: 280, column: 6, scope: !172)
!193 = !DILocation(line: 281, column: 7, scope: !194)
!194 = distinct !DILexicalBlock(scope: !195, file: !1, line: 281, column: 7)
!195 = distinct !DILexicalBlock(scope: !190, file: !1, line: 280, column: 20)
!196 = !DILocation(line: 281, column: 7, scope: !195)
!197 = !DILocation(line: 282, column: 32, scope: !198)
!198 = distinct !DILexicalBlock(scope: !194, file: !1, line: 281, column: 19)
!199 = !DILocation(line: 282, column: 4, scope: !198)
!200 = !DILocation(line: 283, column: 16, scope: !198)
!201 = !DILocation(line: 283, column: 22, scope: !198)
!202 = !DILocation(line: 283, column: 34, scope: !198)
!203 = !DILocation(line: 283, column: 4, scope: !198)
!204 = !DILocation(line: 284, column: 3, scope: !198)
!205 = !DILocation(line: 286, column: 32, scope: !206)
!206 = distinct !DILexicalBlock(scope: !194, file: !1, line: 285, column: 8)
!207 = !DILocation(line: 286, column: 38, scope: !206)
!208 = !DILocation(line: 286, column: 4, scope: !206)
!209 = !DILocation(line: 289, column: 15, scope: !195)
!210 = !DILocation(line: 289, column: 21, scope: !195)
!211 = !DILocation(line: 289, column: 27, scope: !195)
!212 = !DILocation(line: 289, column: 3, scope: !195)
!213 = !DILocation(line: 290, column: 20, scope: !195)
!214 = !DILocation(line: 290, column: 3, scope: !195)
!215 = !DILocation(line: 290, column: 9, scope: !195)
!216 = !DILocation(line: 290, column: 18, scope: !195)
!217 = !DILocation(line: 291, column: 23, scope: !195)
!218 = !DILocation(line: 291, column: 3, scope: !195)
!219 = !DILocation(line: 291, column: 9, scope: !195)
!220 = !DILocation(line: 291, column: 21, scope: !195)
!221 = !DILocation(line: 292, column: 2, scope: !195)
!222 = !DILocation(line: 293, column: 9, scope: !172)
!223 = !DILocation(line: 293, column: 2, scope: !172)
!224 = distinct !DISubprogram(name: "IMB_anim_previewframe", scope: !1, file: !1, line: 1294, type: !225, scopeLine: 1295, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !123)
!225 = !DISubroutineType(types: !226)
!226 = !{!227, !47}
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !229, line: 70, size: 19840, elements: !230)
!229 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!230 = !{!231, !232, !233, !234, !235, !237, !238, !239, !240, !242, !244, !249, !250, !251, !252, !253, !255, !257, !258, !259, !263, !264, !265, !266, !267, !270, !271, !272, !273, !274, !277, !278, !280, !281, !282, !301, !302, !303, !306, !307, !316}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !228, file: !229, line: 71, baseType: !227, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !228, file: !229, line: 71, baseType: !227, size: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !228, file: !229, line: 74, baseType: !52, size: 32, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !228, file: !229, line: 74, baseType: !52, size: 32, offset: 160)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !228, file: !229, line: 79, baseType: !236, size: 8, offset: 192)
!236 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !228, file: !229, line: 80, baseType: !52, size: 32, offset: 224)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !228, file: !229, line: 83, baseType: !52, size: 32, offset: 256)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "mall", scope: !228, file: !229, line: 84, baseType: !52, size: 32, offset: 288)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !228, file: !229, line: 87, baseType: !241, size: 64, offset: 320)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "rect_float", scope: !228, file: !229, line: 88, baseType: !243, size: 64, offset: 384)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ppm", scope: !228, file: !229, line: 93, baseType: !245, size: 128, offset: 448)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 128, elements: !247)
!246 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!247 = !{!248}
!248 = !DISubrange(count: 2)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "tilex", scope: !228, file: !229, line: 96, baseType: !52, size: 32, offset: 576)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "tiley", scope: !228, file: !229, line: 96, baseType: !52, size: 32, offset: 608)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "xtiles", scope: !228, file: !229, line: 97, baseType: !52, size: 32, offset: 640)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "ytiles", scope: !228, file: !229, line: 97, baseType: !52, size: 32, offset: 672)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "tiles", scope: !228, file: !229, line: 98, baseType: !254, size: 64, offset: 704)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !228, file: !229, line: 101, baseType: !256, size: 64, offset: 768)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_float", scope: !228, file: !229, line: 102, baseType: !243, size: 64, offset: 832)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !228, file: !229, line: 105, baseType: !59, size: 32, offset: 896)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "mipmap", scope: !228, file: !229, line: 108, baseType: !260, size: 1280, offset: 960)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !227, size: 1280, elements: !261)
!261 = !{!262}
!262 = !DISubrange(count: 20)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "miptot", scope: !228, file: !229, line: 109, baseType: !52, size: 32, offset: 2240)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "miplevel", scope: !228, file: !229, line: 109, baseType: !52, size: 32, offset: 2272)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !228, file: !229, line: 112, baseType: !52, size: 32, offset: 2304)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "userflags", scope: !228, file: !229, line: 113, baseType: !52, size: 32, offset: 2336)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !228, file: !229, line: 114, baseType: !268, size: 64, offset: 2368)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImMetaData", file: !229, line: 50, flags: DIFlagFwdDecl)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !228, file: !229, line: 115, baseType: !46, size: 64, offset: 2432)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !228, file: !229, line: 118, baseType: !52, size: 32, offset: 2496)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !228, file: !229, line: 119, baseType: !63, size: 8192, offset: 2528)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "cachename", scope: !228, file: !229, line: 120, baseType: !63, size: 8192, offset: 10720)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "c_handle", scope: !228, file: !229, line: 123, baseType: !275, size: 64, offset: 18944)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DICompositeType(tag: DW_TAG_structure_type, name: "MEM_CacheLimiterHandle_s", file: !229, line: 123, flags: DIFlagFwdDecl)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "refcounter", scope: !228, file: !229, line: 124, baseType: !52, size: 32, offset: 19008)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffer", scope: !228, file: !229, line: 127, baseType: !279, size: 64, offset: 19072)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "encodedsize", scope: !228, file: !229, line: 128, baseType: !5, size: 32, offset: 19136)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffersize", scope: !228, file: !229, line: 129, baseType: !5, size: 32, offset: 19168)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "rect_colorspace", scope: !228, file: !229, line: 132, baseType: !283, size: 64, offset: 19200)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !285, line: 47, size: 4992, elements: !286)
!285 = !DIFile(filename: "blender/source/blender/imbuf/intern/IMB_colormanagement_intern.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!286 = !{!287, !288, !289, !290, !291, !295, !298, !299, !300}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !284, file: !285, line: 48, baseType: !283, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !284, file: !285, line: 48, baseType: !283, size: 64, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !284, file: !285, line: 49, baseType: !52, size: 32, offset: 128)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !284, file: !285, line: 50, baseType: !110, size: 512, offset: 160)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !284, file: !285, line: 51, baseType: !292, size: 4096, offset: 672)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 4096, elements: !293)
!293 = !{!294}
!294 = !DISubrange(count: 512)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "to_scene_linear", scope: !284, file: !285, line: 53, baseType: !296, size: 64, offset: 4800)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "OCIO_ConstProcessorRcPtr", file: !285, line: 41, flags: DIFlagFwdDecl)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "from_scene_linear", scope: !284, file: !285, line: 54, baseType: !296, size: 64, offset: 4864)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "is_invertible", scope: !284, file: !285, line: 56, baseType: !236, size: 8, offset: 4928)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "is_data", scope: !284, file: !285, line: 57, baseType: !236, size: 8, offset: 4936)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "float_colorspace", scope: !228, file: !229, line: 133, baseType: !283, size: 64, offset: 19264)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer_flags", scope: !228, file: !229, line: 134, baseType: !241, size: 64, offset: 19328)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_cache", scope: !228, file: !229, line: 135, baseType: !304, size: 64, offset: 19392)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColormanageCache", file: !229, line: 135, flags: DIFlagFwdDecl)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_flag", scope: !228, file: !229, line: 136, baseType: !52, size: 32, offset: 19456)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_rect", scope: !228, file: !229, line: 137, baseType: !308, size: 128, offset: 19488)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !309, line: 89, baseType: !310)
!309 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !309, line: 86, size: 128, elements: !311)
!311 = !{!312, !313, !314, !315}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !310, file: !309, line: 87, baseType: !52, size: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !310, file: !309, line: 87, baseType: !52, size: 32, offset: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !310, file: !309, line: 88, baseType: !52, size: 32, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !310, file: !309, line: 88, baseType: !52, size: 32, offset: 96)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "dds_data", scope: !228, file: !229, line: 140, baseType: !317, size: 192, offset: 19648)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DDSData", file: !229, line: 55, size: 192, elements: !318)
!318 = !{!319, !320, !321, !322}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "fourcc", scope: !317, file: !229, line: 56, baseType: !5, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "nummipmaps", scope: !317, file: !229, line: 57, baseType: !5, size: 32, offset: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !317, file: !229, line: 58, baseType: !279, size: 64, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !317, file: !229, line: 59, baseType: !5, size: 32, offset: 128)
!323 = !DILocalVariable(name: "anim", arg: 1, scope: !224, file: !1, line: 1294, type: !47)
!324 = !DILocation(line: 1294, column: 50, scope: !224)
!325 = !DILocalVariable(name: "ibuf", scope: !224, file: !1, line: 1296, type: !227)
!326 = !DILocation(line: 1296, column: 16, scope: !224)
!327 = !DILocalVariable(name: "position", scope: !224, file: !1, line: 1297, type: !52)
!328 = !DILocation(line: 1297, column: 6, scope: !224)
!329 = !DILocation(line: 1299, column: 27, scope: !224)
!330 = !DILocation(line: 1299, column: 9, scope: !224)
!331 = !DILocation(line: 1299, column: 7, scope: !224)
!332 = !DILocation(line: 1300, column: 6, scope: !333)
!333 = distinct !DILexicalBlock(scope: !224, file: !1, line: 1300, column: 6)
!334 = !DILocation(line: 1300, column: 6, scope: !224)
!335 = !DILocation(line: 1301, column: 17, scope: !336)
!336 = distinct !DILexicalBlock(scope: !333, file: !1, line: 1300, column: 12)
!337 = !DILocation(line: 1301, column: 3, scope: !336)
!338 = !DILocation(line: 1302, column: 14, scope: !336)
!339 = !DILocation(line: 1302, column: 20, scope: !336)
!340 = !DILocation(line: 1302, column: 29, scope: !336)
!341 = !DILocation(line: 1302, column: 12, scope: !336)
!342 = !DILocation(line: 1303, column: 28, scope: !336)
!343 = !DILocation(line: 1303, column: 34, scope: !336)
!344 = !DILocation(line: 1303, column: 10, scope: !336)
!345 = !DILocation(line: 1303, column: 8, scope: !336)
!346 = !DILocation(line: 1305, column: 2, scope: !336)
!347 = !DILocation(line: 1306, column: 9, scope: !224)
!348 = !DILocation(line: 1306, column: 2, scope: !224)
!349 = distinct !DISubprogram(name: "IMB_anim_absolute", scope: !1, file: !1, line: 1309, type: !350, scopeLine: 1312, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !123)
!350 = !DISubroutineType(types: !351)
!351 = !{!227, !47, !52, !352, !353}
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMB_Timecode_Type", file: !14, line: 222, baseType: !13)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMB_Proxy_Size", file: !14, line: 231, baseType: !22)
!354 = !DILocalVariable(name: "anim", arg: 1, scope: !349, file: !1, line: 1309, type: !47)
!355 = !DILocation(line: 1309, column: 46, scope: !349)
!356 = !DILocalVariable(name: "position", arg: 2, scope: !349, file: !1, line: 1309, type: !52)
!357 = !DILocation(line: 1309, column: 56, scope: !349)
!358 = !DILocalVariable(name: "tc", arg: 3, scope: !349, file: !1, line: 1310, type: !352)
!359 = !DILocation(line: 1310, column: 51, scope: !349)
!360 = !DILocalVariable(name: "preview_size", arg: 4, scope: !349, file: !1, line: 1311, type: !353)
!361 = !DILocation(line: 1311, column: 48, scope: !349)
!362 = !DILocalVariable(name: "ibuf", scope: !349, file: !1, line: 1313, type: !227)
!363 = !DILocation(line: 1313, column: 16, scope: !349)
!364 = !DILocalVariable(name: "head", scope: !349, file: !1, line: 1314, type: !365)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 2048, elements: !366)
!366 = !{!367}
!367 = !DISubrange(count: 256)
!368 = !DILocation(line: 1314, column: 7, scope: !349)
!369 = !DILocalVariable(name: "tail", scope: !349, file: !1, line: 1314, type: !365)
!370 = !DILocation(line: 1314, column: 18, scope: !349)
!371 = !DILocalVariable(name: "digits", scope: !349, file: !1, line: 1315, type: !113)
!372 = !DILocation(line: 1315, column: 17, scope: !349)
!373 = !DILocalVariable(name: "pic", scope: !349, file: !1, line: 1316, type: !52)
!374 = !DILocation(line: 1316, column: 6, scope: !349)
!375 = !DILocalVariable(name: "filter_y", scope: !349, file: !1, line: 1317, type: !52)
!376 = !DILocation(line: 1317, column: 6, scope: !349)
!377 = !DILocation(line: 1318, column: 6, scope: !378)
!378 = distinct !DILexicalBlock(scope: !349, file: !1, line: 1318, column: 6)
!379 = !DILocation(line: 1318, column: 11, scope: !378)
