; ModuleID = 'blender/source/blender/imbuf/intern/scaling.c'
source_filename = "blender/source/blender/imbuf/intern/scaling.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ImBuf = type { %struct.ImBuf*, %struct.ImBuf*, i32, i32, i8, i32, i32, i32, i32*, float*, [2 x double], i32, i32, i32, i32, i32**, i32*, float*, float, [20 x %struct.ImBuf*], i32, i32, i32, i32, %struct.ImMetaData*, i8*, i32, [1024 x i8], [1024 x i8], %struct.MEM_CacheLimiterHandle_s*, i32, i8*, i32, i32, %struct.ColorSpace*, %struct.ColorSpace*, i32*, %struct.ColormanageCache*, i32, %struct.rcti, %struct.DDSData }
%struct.ImMetaData = type opaque
%struct.MEM_CacheLimiterHandle_s = type opaque
%struct.ColorSpace = type opaque
%struct.ColormanageCache = type opaque
%struct.rcti = type { i32, i32, i32, i32 }
%struct.DDSData = type { i32, i32, i8*, i32 }
%struct.imbufRGBA = type { float, float, float, float }
%struct.ScaleTreadInitData = type { %struct.ImBuf*, i32, i32, i8*, float* }
%struct.ScaleThreadData = type { %struct.ImBuf*, i32, i32, i32, i32, i8*, float* }

@MEM_mallocN = external dso_local global i8* (i64, i8*)*, align 8
@.str = private unnamed_addr constant [15 x i8] c"scalefastimbuf\00", align 1
@.str.1 = private unnamed_addr constant [17 x i8] c"scalefastimbuf f\00", align 1
@MEM_freeN = external dso_local global void (i8*)*, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/imbuf/intern/scaling.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{}
!3 = !{!4, !5, !7, !9, !11, !12, !19, !20, !10, !23, !115, !8}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!11 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "imbufRGBA", file: !1, line: 1550, size: 128, elements: !14)
!14 = !{!15, !16, !17, !18}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !13, file: !1, line: 1551, baseType: !8, size: 32)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !13, file: !1, line: 1551, baseType: !8, size: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !13, file: !1, line: 1551, baseType: !8, size: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !13, file: !1, line: 1551, baseType: !8, size: 32, offset: 96)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !22, line: 78, baseType: !10)
!22 = !DIFile(filename: "blender/source/blender/imbuf/intern/imbuf.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScaleThreadData", file: !1, line: 1661, baseType: !25)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScaleThreadData", file: !1, line: 1650, size: 320, elements: !26)
!26 = !{!27, !109, !110, !111, !112, !113, !114}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "ibuf", scope: !25, file: !1, line: 1651, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImBuf", file: !30, line: 141, baseType: !31)
!30 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !30, line: 70, size: 19840, elements: !32)
!32 = !{!33, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !49, !50, !51, !52, !53, !55, !56, !57, !58, !62, !63, !64, !65, !66, !69, !70, !71, !76, !77, !80, !81, !82, !83, !84, !87, !88, !89, !92, !93, !102}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !31, file: !30, line: 71, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !31, file: !30, line: 71, baseType: !34, size: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !31, file: !30, line: 74, baseType: !6, size: 32, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !31, file: !30, line: 74, baseType: !6, size: 32, offset: 160)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !31, file: !30, line: 79, baseType: !10, size: 8, offset: 192)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !31, file: !30, line: 80, baseType: !6, size: 32, offset: 224)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !31, file: !30, line: 83, baseType: !6, size: 32, offset: 256)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "mall", scope: !31, file: !30, line: 84, baseType: !6, size: 32, offset: 288)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !31, file: !30, line: 87, baseType: !19, size: 64, offset: 320)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "rect_float", scope: !31, file: !30, line: 88, baseType: !7, size: 64, offset: 384)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "ppm", scope: !31, file: !30, line: 93, baseType: !45, size: 128, offset: 448)
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 128, elements: !47)
!46 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!47 = !{!48}
!48 = !DISubrange(count: 2)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "tilex", scope: !31, file: !30, line: 96, baseType: !6, size: 32, offset: 576)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "tiley", scope: !31, file: !30, line: 96, baseType: !6, size: 32, offset: 608)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "xtiles", scope: !31, file: !30, line: 97, baseType: !6, size: 32, offset: 640)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "ytiles", scope: !31, file: !30, line: 97, baseType: !6, size: 32, offset: 672)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "tiles", scope: !31, file: !30, line: 98, baseType: !54, size: 64, offset: 704)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !31, file: !30, line: 101, baseType: !5, size: 64, offset: 768)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_float", scope: !31, file: !30, line: 102, baseType: !7, size: 64, offset: 832)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !31, file: !30, line: 105, baseType: !8, size: 32, offset: 896)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "mipmap", scope: !31, file: !30, line: 108, baseType: !59, size: 1280, offset: 960)
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 1280, elements: !60)
!60 = !{!61}
!61 = !DISubrange(count: 20)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "miptot", scope: !31, file: !30, line: 109, baseType: !6, size: 32, offset: 2240)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "miplevel", scope: !31, file: !30, line: 109, baseType: !6, size: 32, offset: 2272)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !31, file: !30, line: 112, baseType: !6, size: 32, offset: 2304)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "userflags", scope: !31, file: !30, line: 113, baseType: !6, size: 32, offset: 2336)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !31, file: !30, line: 114, baseType: !67, size: 64, offset: 2368)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImMetaData", file: !30, line: 50, flags: DIFlagFwdDecl)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !31, file: !30, line: 115, baseType: !4, size: 64, offset: 2432)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !31, file: !30, line: 118, baseType: !6, size: 32, offset: 2496)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !31, file: !30, line: 119, baseType: !72, size: 8192, offset: 2528)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 8192, elements: !74)
!73 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!74 = !{!75}
!75 = !DISubrange(count: 1024)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "cachename", scope: !31, file: !30, line: 120, baseType: !72, size: 8192, offset: 10720)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "c_handle", scope: !31, file: !30, line: 123, baseType: !78, size: 64, offset: 18944)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "MEM_CacheLimiterHandle_s", file: !30, line: 123, flags: DIFlagFwdDecl)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "refcounter", scope: !31, file: !30, line: 124, baseType: !6, size: 32, offset: 19008)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffer", scope: !31, file: !30, line: 127, baseType: !9, size: 64, offset: 19072)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "encodedsize", scope: !31, file: !30, line: 128, baseType: !11, size: 32, offset: 19136)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffersize", scope: !31, file: !30, line: 129, baseType: !11, size: 32, offset: 19168)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "rect_colorspace", scope: !31, file: !30, line: 132, baseType: !85, size: 64, offset: 19200)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !30, line: 132, flags: DIFlagFwdDecl)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "float_colorspace", scope: !31, file: !30, line: 133, baseType: !85, size: 64, offset: 19264)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer_flags", scope: !31, file: !30, line: 134, baseType: !19, size: 64, offset: 19328)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_cache", scope: !31, file: !30, line: 135, baseType: !90, size: 64, offset: 19392)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColormanageCache", file: !30, line: 135, flags: DIFlagFwdDecl)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_flag", scope: !31, file: !30, line: 136, baseType: !6, size: 32, offset: 19456)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_rect", scope: !31, file: !30, line: 137, baseType: !94, size: 128, offset: 19488)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !95, line: 89, baseType: !96)
!95 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !95, line: 86, size: 128, elements: !97)
!97 = !{!98, !99, !100, !101}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !96, file: !95, line: 87, baseType: !6, size: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !96, file: !95, line: 87, baseType: !6, size: 32, offset: 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !96, file: !95, line: 88, baseType: !6, size: 32, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !96, file: !95, line: 88, baseType: !6, size: 32, offset: 96)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "dds_data", scope: !31, file: !30, line: 140, baseType: !103, size: 192, offset: 19648)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DDSData", file: !30, line: 55, size: 192, elements: !104)
!104 = !{!105, !106, !107, !108}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "fourcc", scope: !103, file: !30, line: 56, baseType: !11, size: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "nummipmaps", scope: !103, file: !30, line: 57, baseType: !11, size: 32, offset: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !103, file: !30, line: 58, baseType: !9, size: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !103, file: !30, line: 59, baseType: !11, size: 32, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "newx", scope: !25, file: !1, line: 1653, baseType: !11, size: 32, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "newy", scope: !25, file: !1, line: 1654, baseType: !11, size: 32, offset: 96)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "start_line", scope: !25, file: !1, line: 1656, baseType: !6, size: 32, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tot_line", scope: !25, file: !1, line: 1657, baseType: !6, size: 32, offset: 160)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !25, file: !1, line: 1659, baseType: !9, size: 64, offset: 192)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "float_buffer", scope: !25, file: !1, line: 1660, baseType: !7, size: 64, offset: 256)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScaleTreadInitData", file: !1, line: 1648, baseType: !117)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScaleTreadInitData", file: !1, line: 1640, size: 256, elements: !118)
!118 = !{!119, !120, !121, !122, !123}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "ibuf", scope: !117, file: !1, line: 1641, baseType: !28, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "newx", scope: !117, file: !1, line: 1643, baseType: !11, size: 32, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "newy", scope: !117, file: !1, line: 1644, baseType: !11, size: 32, offset: 96)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !117, file: !1, line: 1646, baseType: !9, size: 64, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "float_buffer", scope: !117, file: !1, line: 1647, baseType: !7, size: 64, offset: 192)
!124 = !{i32 7, !"Dwarf Version", i32 4}
!125 = !{i32 2, !"Debug Info Version", i32 3}
!126 = !{i32 1, !"wchar_size", i32 4}
!127 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!128 = distinct !DISubprogram(name: "IMB_half_x", scope: !1, file: !1, line: 110, type: !129, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!129 = !DISubroutineType(types: !130)
!130 = !{!34, !34}
!131 = !DILocalVariable(name: "ibuf1", arg: 1, scope: !128, file: !1, line: 110, type: !34)
!132 = !DILocation(line: 110, column: 40, scope: !128)
!133 = !DILocalVariable(name: "ibuf2", scope: !128, file: !1, line: 112, type: !34)
!134 = !DILocation(line: 112, column: 16, scope: !128)
!135 = !DILocation(line: 114, column: 6, scope: !136)
!136 = distinct !DILexicalBlock(scope: !128, file: !1, line: 114, column: 6)
!137 = !DILocation(line: 114, column: 12, scope: !136)
!138 = !DILocation(line: 114, column: 6, scope: !128)
!139 = !DILocation(line: 114, column: 21, scope: !136)
!140 = !DILocation(line: 115, column: 6, scope: !141)
!141 = distinct !DILexicalBlock(scope: !128, file: !1, line: 115, column: 6)
!142 = !DILocation(line: 115, column: 13, scope: !141)
!143 = !DILocation(line: 115, column: 18, scope: !141)
!144 = !DILocation(line: 115, column: 26, scope: !141)
!145 = !DILocation(line: 115, column: 29, scope: !141)
!146 = !DILocation(line: 115, column: 36, scope: !141)
!147 = !DILocation(line: 115, column: 47, scope: !141)
!148 = !DILocation(line: 115, column: 6, scope: !128)
!149 = !DILocation(line: 115, column: 56, scope: !141)
!150 = !DILocation(line: 117, column: 6, scope: !151)
!151 = distinct !DILexicalBlock(scope: !128, file: !1, line: 117, column: 6)
!152 = !DILocation(line: 117, column: 13, scope: !151)
!153 = !DILocation(line: 117, column: 15, scope: !151)
!154 = !DILocation(line: 117, column: 6, scope: !128)
!155 = !DILocation(line: 117, column: 41, scope: !151)
!156 = !DILocation(line: 117, column: 28, scope: !151)
!157 = !DILocation(line: 117, column: 21, scope: !151)
!158 = !DILocation(line: 119, column: 26, scope: !128)
!159 = !DILocation(line: 119, column: 33, scope: !128)
!160 = !DILocation(line: 119, column: 36, scope: !128)
!161 = !DILocation(line: 119, column: 41, scope: !128)
!162 = !DILocation(line: 119, column: 48, scope: !128)
!163 = !DILocation(line: 119, column: 51, scope: !128)
!164 = !DILocation(line: 119, column: 58, scope: !128)
!165 = !DILocation(line: 119, column: 66, scope: !128)
!166 = !DILocation(line: 119, column: 73, scope: !128)
!167 = !DILocation(line: 119, column: 10, scope: !128)
!168 = !DILocation(line: 119, column: 8, scope: !128)
!169 = !DILocation(line: 120, column: 6, scope: !170)
!170 = distinct !DILexicalBlock(scope: !128, file: !1, line: 120, column: 6)
!171 = !DILocation(line: 120, column: 12, scope: !170)
!172 = !DILocation(line: 120, column: 6, scope: !128)
!173 = !DILocation(line: 120, column: 21, scope: !170)
!174 = !DILocation(line: 122, column: 22, scope: !128)
!175 = !DILocation(line: 122, column: 29, scope: !128)
!176 = !DILocation(line: 122, column: 2, scope: !128)
!177 = !DILocation(line: 124, column: 10, scope: !128)
!178 = !DILocation(line: 124, column: 2, scope: !128)
!179 = !DILocation(line: 125, column: 1, scope: !128)
!180 = distinct !DISubprogram(name: "imb_half_x_no_alloc", scope: !1, file: !1, line: 55, type: !181, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !2)
!181 = !DISubroutineType(types: !182)
!182 = !{null, !34, !34}
!183 = !DILocalVariable(name: "ibuf2", arg: 1, scope: !180, file: !1, line: 55, type: !34)
!184 = !DILocation(line: 55, column: 47, scope: !180)
!185 = !DILocalVariable(name: "ibuf1", arg: 2, scope: !180, file: !1, line: 55, type: !34)
