; ModuleID = 'blender/source/blender/editors/space_graph/space_graph.c'
source_filename = "blender/source/blender/editors/space_graph/space_graph.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }
%struct.WalkNavigation = type { float, float, float, float, float, float, i16, [3 x i16] }

!289 = !DIEnumerator(name: "TH_NLA_META", value: 171, isUnsigned: true)
!290 = !DIEnumerator(name: "TH_NLA_META_SEL", value: 172, isUnsigned: true)
!291 = !DIEnumerator(name: "TH_NLA_SOUND", value: 173, isUnsigned: true)
!292 = !DIEnumerator(name: "TH_NLA_SOUND_SEL", value: 174, isUnsigned: true)
!293 = !DIEnumerator(name: "TH_EMBOSS", value: 175, isUnsigned: true)
!294 = !DIEnumerator(name: "TH_AXIS_X", value: 176, isUnsigned: true)
!295 = !DIEnumerator(name: "TH_AXIS_Y", value: 177, isUnsigned: true)
!296 = !DIEnumerator(name: "TH_AXIS_Z", value: 178, isUnsigned: true)
!297 = !DIEnumerator(name: "TH_LOW_GRAD", value: 179, isUnsigned: true)
!298 = !DIEnumerator(name: "TH_HIGH_GRAD", value: 180, isUnsigned: true)
!299 = !DIEnumerator(name: "TH_SHOW_BACK_GRAD", value: 181, isUnsigned: true)
!300 = !DIEnumerator(name: "TH_INFO_SELECTED", value: 182, isUnsigned: true)
!301 = !DIEnumerator(name: "TH_INFO_SELECTED_TEXT", value: 183, isUnsigned: true)
!302 = !DIEnumerator(name: "TH_INFO_ERROR", value: 184, isUnsigned: true)
!303 = !DIEnumerator(name: "TH_INFO_ERROR_TEXT", value: 185, isUnsigned: true)
!304 = !DIEnumerator(name: "TH_INFO_WARNING", value: 186, isUnsigned: true)
!305 = !DIEnumerator(name: "TH_INFO_WARNING_TEXT", value: 187, isUnsigned: true)
!306 = !DIEnumerator(name: "TH_INFO_INFO", value: 188, isUnsigned: true)
!307 = !DIEnumerator(name: "TH_INFO_INFO_TEXT", value: 189, isUnsigned: true)
!308 = !DIEnumerator(name: "TH_INFO_DEBUG", value: 190, isUnsigned: true)
!309 = !DIEnumerator(name: "TH_INFO_DEBUG_TEXT", value: 191, isUnsigned: true)
!310 = !DIEnumerator(name: "TH_VIEW_OVERLAY", value: 192, isUnsigned: true)
!311 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eView2D_CommonViewTypes", file: !312, line: 52, baseType: !99, size: 32, elements: !313)
!312 = !DIFile(filename: "blender/source/blender/editors/include/UI_view2d.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!313 = !{!314, !315, !316, !317, !318, !319}
!314 = !DIEnumerator(name: "V2D_COMMONVIEW_CUSTOM", value: -1)
!315 = !DIEnumerator(name: "V2D_COMMONVIEW_STANDARD", value: 0)
!316 = !DIEnumerator(name: "V2D_COMMONVIEW_LIST", value: 1)
!317 = !DIEnumerator(name: "V2D_COMMONVIEW_STACK", value: 2)
!318 = !DIEnumerator(name: "V2D_COMMONVIEW_HEADER", value: 3)
!319 = !DIEnumerator(name: "V2D_COMMONVIEW_PANELS_UI", value: 4)
!320 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eView2D_Units", file: !312, line: 73, baseType: !5, size: 32, elements: !321)
!321 = !{!322, !323, !324, !325, !326, !327}
!322 = !DIEnumerator(name: "V2D_UNIT_SECONDS", value: 0, isUnsigned: true)
!323 = !DIEnumerator(name: "V2D_UNIT_FRAMES", value: 1, isUnsigned: true)
!324 = !DIEnumerator(name: "V2D_UNIT_FRAMESCALE", value: 2, isUnsigned: true)
!325 = !DIEnumerator(name: "V2D_UNIT_VALUES", value: 3, isUnsigned: true)
!326 = !DIEnumerator(name: "V2D_UNIT_DEGREES", value: 4, isUnsigned: true)
!327 = !DIEnumerator(name: "V2D_UNIT_TIME", value: 5, isUnsigned: true)
!328 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eView2D_Clamp", file: !312, line: 86, baseType: !5, size: 32, elements: !329)
!329 = !{!330, !331}
!330 = !DIEnumerator(name: "V2D_GRID_NOCLAMP", value: 0, isUnsigned: true)
!331 = !DIEnumerator(name: "V2D_GRID_CLAMP", value: 1, isUnsigned: true)
!332 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eView2D_Gridlines", file: !312, line: 92, baseType: !5, size: 32, elements: !333)
!333 = !{!334, !335, !336, !337, !338, !339, !340}
!334 = !DIEnumerator(name: "V2D_HORIZONTAL_LINES", value: 1, isUnsigned: true)
!335 = !DIEnumerator(name: "V2D_VERTICAL_LINES", value: 2, isUnsigned: true)
!336 = !DIEnumerator(name: "V2D_HORIZONTAL_AXIS", value: 4, isUnsigned: true)
!337 = !DIEnumerator(name: "V2D_VERTICAL_AXIS", value: 8, isUnsigned: true)
!338 = !DIEnumerator(name: "V2D_HORIZONTAL_FINELINES", value: 16, isUnsigned: true)
!339 = !DIEnumerator(name: "V2D_GRIDLINES_MAJOR", value: 15, isUnsigned: true)
!340 = !DIEnumerator(name: "V2D_GRIDLINES_ALL", value: 31, isUnsigned: true)
!341 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eAnimEditDraw_CurrentFrame", file: !98, line: 508, baseType: !5, size: 32, elements: !342)
!342 = !{!343, !344, !345, !346}
!343 = !DIEnumerator(name: "DRAWCFRA_PLAIN", value: 0, isUnsigned: true)
!344 = !DIEnumerator(name: "DRAWCFRA_SHOW_NUMBOX", value: 1, isUnsigned: true)
!345 = !DIEnumerator(name: "DRAWCFRA_UNIT_SECONDS", value: 2, isUnsigned: true)
!346 = !DIEnumerator(name: "DRAWCFRA_WIDE", value: 4, isUnsigned: true)
!347 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !348, line: 44, baseType: !5, size: 32, elements: !349)
!348 = !DIFile(filename: "blender/source/blender/editors/include/ED_markers.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!349 = !{!350, !351, !352}
!350 = !DIEnumerator(name: "DRAW_MARKERS_LINES", value: 1, isUnsigned: true)
!351 = !DIEnumerator(name: "DRAW_MARKERS_LOCAL", value: 2, isUnsigned: true)
!352 = !DIEnumerator(name: "DRAW_MARKERS_MARGIN", value: 4, isUnsigned: true)
!353 = !{!354, !355, !424, !425, !439, !1902, !1987}
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !357, line: 130, baseType: !358)
!357 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !357, line: 117, size: 960, elements: !359)
!359 = !{!360, !361, !362, !364, !383, !387, !389, !390, !391, !392}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !358, file: !357, line: 118, baseType: !354, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !358, file: !357, line: 118, baseType: !354, size: 64, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !358, file: !357, line: 119, baseType: !363, size: 64, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !358, file: !357, line: 120, baseType: !365, size: 64, offset: 192)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !357, line: 136, size: 17600, elements: !367)
!367 = !{!368, !369, !370, !373, !378, !379, !380}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !366, file: !357, line: 137, baseType: !356, size: 960)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !366, file: !357, line: 138, baseType: !355, size: 64, offset: 960)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !366, file: !357, line: 139, baseType: !371, size: 64, offset: 1024)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !357, line: 43, flags: DIFlagFwdDecl)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !366, file: !357, line: 140, baseType: !374, size: 8192, offset: 1088)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !375, size: 8192, elements: !376)
!375 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!376 = !{!377}
!377 = !DISubrange(count: 1024)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !366, file: !357, line: 141, baseType: !374, size: 8192, offset: 9280)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !366, file: !357, line: 148, baseType: !365, size: 64, offset: 17472)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !366, file: !357, line: 150, baseType: !381, size: 64, offset: 17536)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !357, line: 45, flags: DIFlagFwdDecl)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !358, file: !357, line: 121, baseType: !384, size: 528, offset: 256)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !375, size: 528, elements: !385)
!385 = !{!386}
!386 = !DISubrange(count: 66)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !358, file: !357, line: 126, baseType: !388, size: 16, offset: 784)
!388 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !358, file: !357, line: 127, baseType: !99, size: 32, offset: 800)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !358, file: !357, line: 128, baseType: !99, size: 32, offset: 832)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !358, file: !357, line: 128, baseType: !99, size: 32, offset: 864)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !358, file: !357, line: 129, baseType: !393, size: 64, offset: 896)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !357, line: 75, baseType: !395)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !357, line: 62, size: 1024, elements: !396)
!396 = !{!397, !399, !400, !401, !402, !403, !407, !408, !422, !423}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !395, file: !357, line: 63, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !395, file: !357, line: 63, baseType: !398, size: 64, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !395, file: !357, line: 64, baseType: !375, size: 8, offset: 128)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !395, file: !357, line: 64, baseType: !375, size: 8, offset: 136)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !395, file: !357, line: 65, baseType: !388, size: 16, offset: 144)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !395, file: !357, line: 66, baseType: !404, size: 512, offset: 160)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !375, size: 512, elements: !405)
!405 = !{!406}
!406 = !DISubrange(count: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !395, file: !357, line: 67, baseType: !99, size: 32, offset: 672)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !395, file: !357, line: 69, baseType: !409, size: 256, offset: 704)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !357, line: 60, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !357, line: 48, size: 256, elements: !411)
!411 = !{!412, !413, !420, !421}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !410, file: !357, line: 49, baseType: !354, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !410, file: !357, line: 58, baseType: !414, size: 128, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !415, line: 71, baseType: !416)
!415 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !415, line: 69, size: 128, elements: !417)
!417 = !{!418, !419}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !416, file: !415, line: 70, baseType: !354, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !416, file: !415, line: 70, baseType: !354, size: 64, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !410, file: !357, line: 59, baseType: !99, size: 32, offset: 192)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !410, file: !357, line: 59, baseType: !99, size: 32, offset: 224)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !395, file: !357, line: 70, baseType: !99, size: 32, offset: 960)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !395, file: !357, line: 74, baseType: !99, size: 32, offset: 992)
!424 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceLink", file: !16, line: 91, baseType: !427)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !16, line: 85, size: 448, elements: !428)
!428 = !{!429, !431, !432, !433, !434, !435}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !427, file: !16, line: 86, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !427, file: !16, line: 86, baseType: !430, size: 64, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !427, file: !16, line: 87, baseType: !414, size: 128, offset: 128)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !427, file: !16, line: 88, baseType: !99, size: 32, offset: 256)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !427, file: !16, line: 89, baseType: !424, size: 32, offset: 288)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !427, file: !16, line: 90, baseType: !436, size: 128, offset: 320)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 128, elements: !437)
!437 = !{!438}
!438 = !DISubrange(count: 8)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceIpo", file: !16, line: 334, baseType: !441)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceIpo", file: !16, line: 315, size: 2048, elements: !442)
!442 = !{!443, !444, !445, !446, !447, !448, !449, !1882, !1896, !1897, !1898, !1899, !1900, !1901}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !441, file: !16, line: 316, baseType: !425, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !441, file: !16, line: 316, baseType: !425, size: 64, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !441, file: !16, line: 317, baseType: !414, size: 128, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !441, file: !16, line: 318, baseType: !99, size: 32, offset: 256)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !441, file: !16, line: 319, baseType: !424, size: 32, offset: 288)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !441, file: !16, line: 320, baseType: !436, size: 128, offset: 320)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !441, file: !16, line: 322, baseType: !450, size: 1280, offset: 448)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "View2D", file: !451, line: 71, baseType: !452)
!451 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view2d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View2D", file: !451, line: 40, size: 1280, elements: !453)
!453 = !{!454, !463, !464, !472, !473, !474, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !495, !496, !497, !500}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !452, file: !451, line: 41, baseType: !455, size: 128)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !456, line: 95, baseType: !457)
!456 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !456, line: 92, size: 128, elements: !458)
!458 = !{!459, !460, !461, !462}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !457, file: !456, line: 93, baseType: !424, size: 32)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !457, file: !456, line: 93, baseType: !424, size: 32, offset: 32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !457, file: !456, line: 94, baseType: !424, size: 32, offset: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !457, file: !456, line: 94, baseType: !424, size: 32, offset: 96)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !452, file: !451, line: 41, baseType: !455, size: 128, offset: 128)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "vert", scope: !452, file: !451, line: 42, baseType: !465, size: 128, offset: 256)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !456, line: 89, baseType: !466)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !456, line: 86, size: 128, elements: !467)
!467 = !{!468, !469, !470, !471}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !466, file: !456, line: 87, baseType: !99, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !466, file: !456, line: 87, baseType: !99, size: 32, offset: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !466, file: !456, line: 88, baseType: !99, size: 32, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !466, file: !456, line: 88, baseType: !99, size: 32, offset: 96)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "hor", scope: !452, file: !451, line: 42, baseType: !465, size: 128, offset: 384)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !452, file: !451, line: 43, baseType: !465, size: 128, offset: 512)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !452, file: !451, line: 45, baseType: !475, size: 64, offset: 640)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !424, size: 64, elements: !476)
!476 = !{!477}
!477 = !DISubrange(count: 2)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !452, file: !451, line: 45, baseType: !475, size: 64, offset: 704)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "minzoom", scope: !452, file: !451, line: 46, baseType: !424, size: 32, offset: 768)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "maxzoom", scope: !452, file: !451, line: 46, baseType: !424, size: 32, offset: 800)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !452, file: !451, line: 48, baseType: !388, size: 16, offset: 832)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_ui", scope: !452, file: !451, line: 49, baseType: !388, size: 16, offset: 848)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "keeptot", scope: !452, file: !451, line: 51, baseType: !388, size: 16, offset: 864)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "keepzoom", scope: !452, file: !451, line: 52, baseType: !388, size: 16, offset: 880)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "keepofs", scope: !452, file: !451, line: 53, baseType: !388, size: 16, offset: 896)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !452, file: !451, line: 55, baseType: !388, size: 16, offset: 912)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !452, file: !451, line: 56, baseType: !388, size: 16, offset: 928)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !452, file: !451, line: 58, baseType: !388, size: 16, offset: 944)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !452, file: !451, line: 58, baseType: !388, size: 16, offset: 960)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "oldwinx", scope: !452, file: !451, line: 59, baseType: !388, size: 16, offset: 976)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "oldwiny", scope: !452, file: !451, line: 59, baseType: !388, size: 16, offset: 992)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !452, file: !451, line: 61, baseType: !388, size: 16, offset: 1008)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "tab_offset", scope: !452, file: !451, line: 63, baseType: !494, size: 64, offset: 1024)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "tab_num", scope: !452, file: !451, line: 64, baseType: !99, size: 32, offset: 1088)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "tab_cur", scope: !452, file: !451, line: 65, baseType: !99, size: 32, offset: 1120)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "sms", scope: !452, file: !451, line: 68, baseType: !498, size: 64, offset: 1152)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmoothView2DStore", file: !451, line: 68, flags: DIFlagFwdDecl)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_timer", scope: !452, file: !451, line: 69, baseType: !501, size: 64, offset: 1216)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !503, line: 490, size: 768, elements: !504)
!503 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!504 = !{!505, !506, !507, !1873, !1874, !1875, !1876, !1877, !1878, !1879, !1880, !1881}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !502, file: !503, line: 491, baseType: !501, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !502, file: !503, line: 491, baseType: !501, size: 64, offset: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !502, file: !503, line: 493, baseType: !508, size: 64, offset: 128)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !510, line: 169, size: 2048, elements: !511)
!510 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!511 = !{!512, !513, !514, !515, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1848, !1851, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1872}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !509, file: !510, line: 170, baseType: !508, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !509, file: !510, line: 170, baseType: !508, size: 64, offset: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !509, file: !510, line: 172, baseType: !354, size: 64, offset: 128)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !509, file: !510, line: 174, baseType: !516, size: 64, offset: 192)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !4, line: 49, size: 1984, elements: !518)
!518 = !{!519, !520, !521, !522, !523, !524, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !517, file: !4, line: 50, baseType: !356, size: 960)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !517, file: !4, line: 52, baseType: !414, size: 128, offset: 960)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !517, file: !4, line: 53, baseType: !414, size: 128, offset: 1088)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !517, file: !4, line: 54, baseType: !414, size: 128, offset: 1216)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !517, file: !4, line: 55, baseType: !414, size: 128, offset: 1344)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !517, file: !4, line: 57, baseType: !525, size: 64, offset: 1472)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !527, line: 1216, size: 39680, elements: !528)
!527 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!528 = !{!529, !530, !599, !603, !606, !607, !608, !620, !621, !625, !626, !627, !628, !629, !630, !631, !632, !633, !637, !706, !1142, !1357, !1360, !1641, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1663, !1664, !1665, !1666, !1667, !1675, !1742, !1749, !1750, !1757, !1758, !1764, !1765, !1766, !1767, !1768}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !526, file: !527, line: 1217, baseType: !356, size: 960)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !526, file: !527, line: 1218, baseType: !531, size: 64, offset: 960)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !533, line: 838, size: 768, elements: !534)
!533 = !DIFile(filename: "blender/source/blender/makesdna/DNA_anim_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!534 = !{!535, !549, !550, !560, !561, !592, !593, !594, !595, !596, !597, !598}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !532, file: !533, line: 840, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !41, line: 499, baseType: !538)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !41, line: 486, size: 1600, elements: !539)
!539 = !{!540, !541, !542, !543, !544, !545, !546, !547, !548}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !538, file: !41, line: 487, baseType: !356, size: 960)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !538, file: !41, line: 489, baseType: !414, size: 128, offset: 960)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !538, file: !41, line: 490, baseType: !414, size: 128, offset: 1088)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !538, file: !41, line: 491, baseType: !414, size: 128, offset: 1216)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !538, file: !41, line: 492, baseType: !414, size: 128, offset: 1344)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !538, file: !41, line: 494, baseType: !99, size: 32, offset: 1472)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !538, file: !41, line: 495, baseType: !99, size: 32, offset: 1504)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !538, file: !41, line: 497, baseType: !99, size: 32, offset: 1536)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !538, file: !41, line: 498, baseType: !99, size: 32, offset: 1568)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !532, file: !533, line: 844, baseType: !536, size: 64, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !532, file: !533, line: 848, baseType: !551, size: 64, offset: 128)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !533, line: 549, baseType: !553)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !533, line: 544, size: 320, elements: !554)
!554 = !{!555, !557, !558, !559}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !553, file: !533, line: 545, baseType: !556, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !553, file: !533, line: 545, baseType: !556, size: 64, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !553, file: !533, line: 547, baseType: !536, size: 64, offset: 128)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !553, file: !533, line: 548, baseType: !414, size: 128, offset: 192)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !532, file: !533, line: 851, baseType: !414, size: 128, offset: 192)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !532, file: !533, line: 853, baseType: !562, size: 64, offset: 320)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !533, line: 594, baseType: !564)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !533, line: 561, size: 1664, elements: !565)
!565 = !{!566, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !564, file: !533, line: 562, baseType: !567, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !564, file: !533, line: 562, baseType: !567, size: 64, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !564, file: !533, line: 564, baseType: !414, size: 128, offset: 128)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !564, file: !533, line: 565, baseType: !536, size: 64, offset: 256)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !564, file: !533, line: 566, baseType: !551, size: 64, offset: 320)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !564, file: !533, line: 568, baseType: !414, size: 128, offset: 384)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !564, file: !533, line: 569, baseType: !414, size: 128, offset: 512)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !564, file: !533, line: 571, baseType: !404, size: 512, offset: 640)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !564, file: !533, line: 573, baseType: !424, size: 32, offset: 1152)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "strip_time", scope: !564, file: !533, line: 574, baseType: !424, size: 32, offset: 1184)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !564, file: !533, line: 576, baseType: !424, size: 32, offset: 1216)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !564, file: !533, line: 576, baseType: !424, size: 32, offset: 1248)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "actstart", scope: !564, file: !533, line: 577, baseType: !424, size: 32, offset: 1280)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "actend", scope: !564, file: !533, line: 577, baseType: !424, size: 32, offset: 1312)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !564, file: !533, line: 579, baseType: !424, size: 32, offset: 1344)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !564, file: !533, line: 580, baseType: !424, size: 32, offset: 1376)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !564, file: !533, line: 582, baseType: !424, size: 32, offset: 1408)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !564, file: !533, line: 582, baseType: !424, size: 32, offset: 1440)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "blendmode", scope: !564, file: !533, line: 583, baseType: !388, size: 16, offset: 1472)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "extendmode", scope: !564, file: !533, line: 585, baseType: !388, size: 16, offset: 1488)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !564, file: !533, line: 586, baseType: !388, size: 16, offset: 1504)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !564, file: !533, line: 588, baseType: !388, size: 16, offset: 1520)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handle", scope: !564, file: !533, line: 590, baseType: !354, size: 64, offset: 1536)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !564, file: !533, line: 592, baseType: !99, size: 32, offset: 1600)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !564, file: !533, line: 593, baseType: !99, size: 32, offset: 1632)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "drivers", scope: !532, file: !533, line: 858, baseType: !414, size: 128, offset: 384)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "overrides", scope: !532, file: !533, line: 859, baseType: !414, size: 128, offset: 512)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !532, file: !533, line: 862, baseType: !99, size: 32, offset: 640)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !532, file: !533, line: 863, baseType: !99, size: 32, offset: 672)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "act_blendmode", scope: !532, file: !533, line: 866, baseType: !388, size: 16, offset: 704)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "act_extendmode", scope: !532, file: !533, line: 867, baseType: !388, size: 16, offset: 720)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "act_influence", scope: !532, file: !533, line: 868, baseType: !424, size: 32, offset: 736)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !526, file: !527, line: 1220, baseType: !600, size: 64, offset: 1024)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !602, line: 49, flags: DIFlagFwdDecl)
!602 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!603 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !526, file: !527, line: 1221, baseType: !604, size: 64, offset: 1088)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !527, line: 52, flags: DIFlagFwdDecl)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !526, file: !527, line: 1223, baseType: !525, size: 64, offset: 1152)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !526, file: !527, line: 1225, baseType: !414, size: 128, offset: 1216)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !526, file: !527, line: 1226, baseType: !609, size: 64, offset: 1344)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !527, line: 69, size: 320, elements: !611)
!611 = !{!612, !613, !614, !615, !616, !617, !618, !619}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !610, file: !527, line: 70, baseType: !609, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !610, file: !527, line: 70, baseType: !609, size: 64, offset: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !610, file: !527, line: 71, baseType: !5, size: 32, offset: 128)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !610, file: !527, line: 71, baseType: !5, size: 32, offset: 160)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !610, file: !527, line: 72, baseType: !99, size: 32, offset: 192)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !610, file: !527, line: 73, baseType: !388, size: 16, offset: 224)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !610, file: !527, line: 73, baseType: !388, size: 16, offset: 240)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !610, file: !527, line: 74, baseType: !600, size: 64, offset: 256)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !526, file: !527, line: 1227, baseType: !600, size: 64, offset: 1408)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !526, file: !527, line: 1229, baseType: !622, size: 96, offset: 1472)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !424, size: 96, elements: !623)
!623 = !{!624}
!624 = !DISubrange(count: 3)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !526, file: !527, line: 1230, baseType: !622, size: 96, offset: 1568)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !526, file: !527, line: 1231, baseType: !622, size: 96, offset: 1664)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !526, file: !527, line: 1231, baseType: !622, size: 96, offset: 1760)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !526, file: !527, line: 1233, baseType: !5, size: 32, offset: 1856)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !526, file: !527, line: 1234, baseType: !99, size: 32, offset: 1888)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !526, file: !527, line: 1235, baseType: !5, size: 32, offset: 1920)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !526, file: !527, line: 1237, baseType: !388, size: 16, offset: 1952)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !526, file: !527, line: 1239, baseType: !375, size: 8, offset: 1968)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !526, file: !527, line: 1240, baseType: !634, size: 8, offset: 1976)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !375, size: 8, elements: !635)
!635 = !{!636}
!636 = !DISubrange(count: 1)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !526, file: !527, line: 1242, baseType: !638, size: 64, offset: 1984)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !640, line: 328, size: 3456, elements: !641)
!640 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!641 = !{!642, !643, !644, !647, !648, !652, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !676, !681, !682, !685, !689, !694, !698, !702, !703, !704, !705}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !639, file: !640, line: 329, baseType: !356, size: 960)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !639, file: !640, line: 330, baseType: !531, size: 64, offset: 960)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !639, file: !640, line: 332, baseType: !645, size: 64, offset: 1024)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !640, line: 332, flags: DIFlagFwdDecl)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !639, file: !640, line: 333, baseType: !404, size: 512, offset: 1088)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !639, file: !640, line: 335, baseType: !649, size: 64, offset: 1600)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !651, line: 41, flags: DIFlagFwdDecl)
!651 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!652 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !639, file: !640, line: 337, baseType: !653, size: 64, offset: 1664)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !527, line: 61, flags: DIFlagFwdDecl)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !639, file: !640, line: 338, baseType: !475, size: 64, offset: 1728)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !639, file: !640, line: 340, baseType: !414, size: 128, offset: 1792)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !639, file: !640, line: 340, baseType: !414, size: 128, offset: 1920)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !639, file: !640, line: 342, baseType: !99, size: 32, offset: 2048)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !639, file: !640, line: 342, baseType: !99, size: 32, offset: 2080)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !639, file: !640, line: 343, baseType: !99, size: 32, offset: 2112)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !639, file: !640, line: 345, baseType: !99, size: 32, offset: 2144)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !639, file: !640, line: 346, baseType: !99, size: 32, offset: 2176)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !639, file: !640, line: 347, baseType: !388, size: 16, offset: 2208)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !639, file: !640, line: 348, baseType: !388, size: 16, offset: 2224)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !639, file: !640, line: 349, baseType: !99, size: 32, offset: 2240)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !639, file: !640, line: 351, baseType: !99, size: 32, offset: 2272)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !639, file: !640, line: 353, baseType: !388, size: 16, offset: 2304)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !639, file: !640, line: 354, baseType: !388, size: 16, offset: 2320)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !639, file: !640, line: 355, baseType: !99, size: 32, offset: 2336)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !639, file: !640, line: 357, baseType: !455, size: 128, offset: 2368)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !639, file: !640, line: 363, baseType: !414, size: 128, offset: 2496)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !639, file: !640, line: 363, baseType: !414, size: 128, offset: 2624)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !639, file: !640, line: 368, baseType: !674, size: 64, offset: 2752)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !640, line: 48, flags: DIFlagFwdDecl)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !639, file: !640, line: 372, baseType: !677, size: 32, offset: 2816)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !640, line: 274, baseType: !678)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !640, line: 271, size: 32, elements: !679)
!679 = !{!680}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !678, file: !640, line: 273, baseType: !5, size: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !639, file: !640, line: 373, baseType: !99, size: 32, offset: 2848)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !639, file: !640, line: 382, baseType: !683, size: 64, offset: 2880)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !640, line: 46, flags: DIFlagFwdDecl)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !639, file: !640, line: 385, baseType: !686, size: 64, offset: 2944)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DISubroutineType(types: !688)
!688 = !{null, !354, !424}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !639, file: !640, line: 386, baseType: !690, size: 64, offset: 3008)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DISubroutineType(types: !692)
!692 = !{null, !354, !693}
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !639, file: !640, line: 387, baseType: !695, size: 64, offset: 3072)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DISubroutineType(types: !697)
!697 = !{!99, !354}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !639, file: !640, line: 388, baseType: !699, size: 64, offset: 3136)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DISubroutineType(types: !701)
!701 = !{null, !354}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !639, file: !640, line: 389, baseType: !354, size: 64, offset: 3200)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !639, file: !640, line: 389, baseType: !354, size: 64, offset: 3264)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !639, file: !640, line: 389, baseType: !354, size: 64, offset: 3328)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !639, file: !640, line: 389, baseType: !354, size: 64, offset: 3392)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !526, file: !527, line: 1244, baseType: !707, size: 64, offset: 2048)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !709, line: 200, size: 17024, elements: !710)
!709 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!710 = !{!711, !713, !714, !715, !1135, !1136, !1137, !1138, !1139, !1140, !1141}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !708, file: !709, line: 201, baseType: !712, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !708, file: !709, line: 202, baseType: !414, size: 128, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !708, file: !709, line: 203, baseType: !414, size: 128, offset: 192)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !708, file: !709, line: 206, baseType: !716, size: 64, offset: 320)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !709, line: 190, baseType: !718)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !709, line: 126, size: 2816, elements: !719)
!719 = !{!720, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !819, !822, !823, !824, !1106, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1134}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !718, file: !709, line: 127, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !718, file: !709, line: 127, baseType: !721, size: 64, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !718, file: !709, line: 128, baseType: !354, size: 64, offset: 128)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !718, file: !709, line: 129, baseType: !354, size: 64, offset: 192)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !718, file: !709, line: 130, baseType: !404, size: 512, offset: 256)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !718, file: !709, line: 132, baseType: !99, size: 32, offset: 768)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !718, file: !709, line: 132, baseType: !99, size: 32, offset: 800)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !718, file: !709, line: 133, baseType: !99, size: 32, offset: 832)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !718, file: !709, line: 134, baseType: !99, size: 32, offset: 864)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !718, file: !709, line: 134, baseType: !99, size: 32, offset: 896)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !718, file: !709, line: 134, baseType: !99, size: 32, offset: 928)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !718, file: !709, line: 135, baseType: !99, size: 32, offset: 960)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !718, file: !709, line: 135, baseType: !99, size: 32, offset: 992)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !718, file: !709, line: 136, baseType: !99, size: 32, offset: 1024)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !718, file: !709, line: 136, baseType: !99, size: 32, offset: 1056)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !718, file: !709, line: 137, baseType: !99, size: 32, offset: 1088)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !718, file: !709, line: 137, baseType: !99, size: 32, offset: 1120)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !718, file: !709, line: 138, baseType: !424, size: 32, offset: 1152)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !718, file: !709, line: 139, baseType: !424, size: 32, offset: 1184)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !718, file: !709, line: 139, baseType: !424, size: 32, offset: 1216)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !718, file: !709, line: 141, baseType: !388, size: 16, offset: 1248)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !718, file: !709, line: 142, baseType: !388, size: 16, offset: 1264)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !718, file: !709, line: 143, baseType: !99, size: 32, offset: 1280)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !718, file: !709, line: 144, baseType: !99, size: 32, offset: 1312)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !718, file: !709, line: 146, baseType: !746, size: 64, offset: 1344)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !709, line: 114, baseType: !748)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !709, line: 99, size: 7232, elements: !749)
!749 = !{!750, !752, !753, !754, !755, !756, !757, !768, !772, !787, !796, !803, !813}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !748, file: !709, line: 100, baseType: !751, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !748, file: !709, line: 100, baseType: !751, size: 64, offset: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !748, file: !709, line: 101, baseType: !99, size: 32, offset: 128)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !748, file: !709, line: 101, baseType: !99, size: 32, offset: 160)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !748, file: !709, line: 102, baseType: !99, size: 32, offset: 192)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !748, file: !709, line: 102, baseType: !99, size: 32, offset: 224)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !748, file: !709, line: 103, baseType: !758, size: 64, offset: 256)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !709, line: 59, baseType: !760)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !709, line: 56, size: 2112, elements: !761)
!761 = !{!762, !766, !767}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !760, file: !709, line: 57, baseType: !763, size: 2048)
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !375, size: 2048, elements: !764)
!764 = !{!765}
!765 = !DISubrange(count: 256)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !760, file: !709, line: 58, baseType: !99, size: 32, offset: 2048)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !760, file: !709, line: 58, baseType: !99, size: 32, offset: 2080)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !748, file: !709, line: 106, baseType: !769, size: 6144, offset: 320)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !375, size: 6144, elements: !770)
!770 = !{!771}
!771 = !DISubrange(count: 768)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !748, file: !709, line: 107, baseType: !773, size: 64, offset: 6464)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !709, line: 97, baseType: !775)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !709, line: 83, size: 8320, elements: !776)
!776 = !{!777, !778, !779, !783, !784, !785, !786}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !775, file: !709, line: 84, baseType: !769, size: 6144)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !775, file: !709, line: 87, baseType: !763, size: 2048, offset: 6144)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !775, file: !709, line: 88, baseType: !780, size: 64, offset: 8192)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !782, line: 41, flags: DIFlagFwdDecl)
!782 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!783 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !775, file: !709, line: 90, baseType: !388, size: 16, offset: 8256)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !775, file: !709, line: 92, baseType: !388, size: 16, offset: 8272)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !775, file: !709, line: 93, baseType: !388, size: 16, offset: 8288)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !775, file: !709, line: 95, baseType: !388, size: 16, offset: 8304)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !748, file: !709, line: 108, baseType: !788, size: 64, offset: 6528)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !709, line: 66, baseType: !790)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !709, line: 61, size: 128, elements: !791)
!791 = !{!792, !793, !794, !795}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !790, file: !709, line: 62, baseType: !99, size: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !790, file: !709, line: 63, baseType: !99, size: 32, offset: 32)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !790, file: !709, line: 64, baseType: !99, size: 32, offset: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !790, file: !709, line: 65, baseType: !99, size: 32, offset: 96)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !748, file: !709, line: 109, baseType: !797, size: 64, offset: 6592)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !709, line: 71, baseType: !799)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !709, line: 68, size: 64, elements: !800)
!800 = !{!801, !802}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !799, file: !709, line: 69, baseType: !99, size: 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !799, file: !709, line: 70, baseType: !99, size: 32, offset: 32)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !748, file: !709, line: 110, baseType: !804, size: 64, offset: 6656)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !709, line: 81, baseType: !806)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !709, line: 73, size: 352, elements: !807)
!807 = !{!808, !809, !810, !811, !812}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !806, file: !709, line: 74, baseType: !622, size: 96)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !806, file: !709, line: 75, baseType: !622, size: 96, offset: 96)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !806, file: !709, line: 76, baseType: !622, size: 96, offset: 192)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !806, file: !709, line: 77, baseType: !99, size: 32, offset: 288)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !806, file: !709, line: 78, baseType: !99, size: 32, offset: 320)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !748, file: !709, line: 113, baseType: !814, size: 512, offset: 6720)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !815, line: 182, baseType: !816)
!815 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !815, line: 180, size: 512, elements: !817)
!817 = !{!818}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !816, file: !815, line: 181, baseType: !404, size: 512)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !718, file: !709, line: 148, baseType: !820, size: 64, offset: 1408)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !602, line: 46, flags: DIFlagFwdDecl)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !718, file: !709, line: 151, baseType: !525, size: 64, offset: 1472)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !718, file: !709, line: 152, baseType: !600, size: 64, offset: 1536)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !718, file: !709, line: 153, baseType: !825, size: 64, offset: 1600)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !827, line: 64, size: 19136, elements: !828)
!827 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!828 = !{!829, !830, !831, !832, !833, !834, !836, !837, !838, !839, !842, !843, !1092, !1093, !1101, !1102, !1103, !1104, !1105}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !826, file: !827, line: 65, baseType: !356, size: 960)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !826, file: !827, line: 66, baseType: !531, size: 64, offset: 960)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !826, file: !827, line: 68, baseType: !374, size: 8192, offset: 1024)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !826, file: !827, line: 70, baseType: !99, size: 32, offset: 9216)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !826, file: !827, line: 71, baseType: !99, size: 32, offset: 9248)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !826, file: !827, line: 72, baseType: !835, size: 64, offset: 9280)
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 64, elements: !476)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !826, file: !827, line: 74, baseType: !424, size: 32, offset: 9344)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !826, file: !827, line: 74, baseType: !424, size: 32, offset: 9376)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !826, file: !827, line: 76, baseType: !780, size: 64, offset: 9408)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !826, file: !827, line: 77, baseType: !840, size: 64, offset: 9472)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !827, line: 77, flags: DIFlagFwdDecl)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !826, file: !827, line: 78, baseType: !653, size: 64, offset: 9536)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !826, file: !827, line: 80, baseType: !844, size: 2624, offset: 9600)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !845, line: 340, size: 2624, elements: !846)
!845 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!846 = !{!847, !875, !893, !894, !895, !913, !971, !972, !1072, !1073, !1074, !1075, !1081}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !844, file: !845, line: 341, baseType: !848, size: 576)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !845, line: 251, baseType: !849)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !845, line: 207, size: 576, elements: !850)
!850 = !{!851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !849, file: !845, line: 208, baseType: !99, size: 32)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !849, file: !845, line: 211, baseType: !388, size: 16, offset: 32)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !849, file: !845, line: 212, baseType: !388, size: 16, offset: 48)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !849, file: !845, line: 213, baseType: !424, size: 32, offset: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !849, file: !845, line: 214, baseType: !388, size: 16, offset: 96)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !849, file: !845, line: 215, baseType: !388, size: 16, offset: 112)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !849, file: !845, line: 216, baseType: !388, size: 16, offset: 128)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !849, file: !845, line: 217, baseType: !388, size: 16, offset: 144)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !849, file: !845, line: 218, baseType: !388, size: 16, offset: 160)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !849, file: !845, line: 219, baseType: !388, size: 16, offset: 176)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !849, file: !845, line: 220, baseType: !424, size: 32, offset: 192)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !849, file: !845, line: 222, baseType: !388, size: 16, offset: 224)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !849, file: !845, line: 225, baseType: !388, size: 16, offset: 240)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !849, file: !845, line: 228, baseType: !99, size: 32, offset: 256)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !849, file: !845, line: 229, baseType: !99, size: 32, offset: 288)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !849, file: !845, line: 233, baseType: !99, size: 32, offset: 320)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !849, file: !845, line: 236, baseType: !388, size: 16, offset: 352)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !849, file: !845, line: 236, baseType: !388, size: 16, offset: 368)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !849, file: !845, line: 241, baseType: !424, size: 32, offset: 384)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !849, file: !845, line: 244, baseType: !99, size: 32, offset: 416)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !849, file: !845, line: 244, baseType: !99, size: 32, offset: 448)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !849, file: !845, line: 245, baseType: !424, size: 32, offset: 480)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !849, file: !845, line: 248, baseType: !424, size: 32, offset: 512)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !849, file: !845, line: 250, baseType: !99, size: 32, offset: 544)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !844, file: !845, line: 342, baseType: !876, size: 448, offset: 576)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !845, line: 79, baseType: !877)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !845, line: 61, size: 448, elements: !878)
!878 = !{!879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !877, file: !845, line: 62, baseType: !354, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !877, file: !845, line: 64, baseType: !388, size: 16, offset: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !877, file: !845, line: 65, baseType: !388, size: 16, offset: 80)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !877, file: !845, line: 67, baseType: !424, size: 32, offset: 96)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !877, file: !845, line: 68, baseType: !424, size: 32, offset: 128)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !877, file: !845, line: 69, baseType: !424, size: 32, offset: 160)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !877, file: !845, line: 70, baseType: !388, size: 16, offset: 192)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !877, file: !845, line: 71, baseType: !388, size: 16, offset: 208)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !877, file: !845, line: 72, baseType: !475, size: 64, offset: 224)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !877, file: !845, line: 75, baseType: !424, size: 32, offset: 288)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !877, file: !845, line: 75, baseType: !424, size: 32, offset: 320)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !877, file: !845, line: 75, baseType: !424, size: 32, offset: 352)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !877, file: !845, line: 78, baseType: !424, size: 32, offset: 384)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !877, file: !845, line: 78, baseType: !424, size: 32, offset: 416)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !844, file: !845, line: 343, baseType: !414, size: 128, offset: 1024)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !844, file: !845, line: 344, baseType: !414, size: 128, offset: 1152)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !844, file: !845, line: 345, baseType: !896, size: 192, offset: 1280)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !845, line: 278, baseType: !897)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !845, line: 270, size: 192, elements: !898)
!898 = !{!899, !900, !901, !902, !903}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !897, file: !845, line: 271, baseType: !99, size: 32)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !897, file: !845, line: 273, baseType: !424, size: 32, offset: 32)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !897, file: !845, line: 275, baseType: !99, size: 32, offset: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !897, file: !845, line: 276, baseType: !99, size: 32, offset: 96)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !897, file: !845, line: 277, baseType: !904, size: 64, offset: 128)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !845, line: 55, size: 576, elements: !906)
!906 = !{!907, !908, !909}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !905, file: !845, line: 56, baseType: !99, size: 32)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !905, file: !845, line: 57, baseType: !424, size: 32, offset: 32)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !905, file: !845, line: 58, baseType: !910, size: 512, offset: 64)
!910 = !DICompositeType(tag: DW_TAG_array_type, baseType: !424, size: 512, elements: !911)
!911 = !{!912, !912}
!912 = !DISubrange(count: 4)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !844, file: !845, line: 346, baseType: !914, size: 384, offset: 1472)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !845, line: 268, baseType: !915)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !845, line: 253, size: 384, elements: !916)
!916 = !{!917, !918, !919, !920, !921, !965, !966, !967, !968, !969, !970}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !915, file: !845, line: 254, baseType: !99, size: 32)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !915, file: !845, line: 255, baseType: !99, size: 32, offset: 32)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !915, file: !845, line: 255, baseType: !99, size: 32, offset: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !915, file: !845, line: 258, baseType: !424, size: 32, offset: 96)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !915, file: !845, line: 259, baseType: !922, size: 64, offset: 128)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !845, line: 164, baseType: !924)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !845, line: 108, size: 1664, elements: !925)
!925 = !{!926, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !924, file: !845, line: 109, baseType: !927, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !924, file: !845, line: 109, baseType: !927, size: 64, offset: 64)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !924, file: !845, line: 111, baseType: !404, size: 512, offset: 128)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !924, file: !845, line: 119, baseType: !475, size: 64, offset: 640)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !924, file: !845, line: 119, baseType: !475, size: 64, offset: 704)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !924, file: !845, line: 125, baseType: !475, size: 64, offset: 768)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !924, file: !845, line: 125, baseType: !475, size: 64, offset: 832)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !924, file: !845, line: 127, baseType: !475, size: 64, offset: 896)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !924, file: !845, line: 130, baseType: !99, size: 32, offset: 960)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !924, file: !845, line: 131, baseType: !99, size: 32, offset: 992)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !924, file: !845, line: 132, baseType: !938, size: 64, offset: 1024)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !845, line: 106, baseType: !940)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !845, line: 81, size: 512, elements: !941)
!941 = !{!942, !943, !946, !947, !948, !949}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !940, file: !845, line: 82, baseType: !475, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !940, file: !845, line: 97, baseType: !944, size: 256, offset: 64)
!944 = !DICompositeType(tag: DW_TAG_array_type, baseType: !424, size: 256, elements: !945)
!945 = !{!912, !477}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !940, file: !845, line: 102, baseType: !475, size: 64, offset: 320)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !940, file: !845, line: 102, baseType: !475, size: 64, offset: 384)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !940, file: !845, line: 104, baseType: !99, size: 32, offset: 448)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !940, file: !845, line: 105, baseType: !99, size: 32, offset: 480)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !924, file: !845, line: 135, baseType: !622, size: 96, offset: 1088)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !924, file: !845, line: 136, baseType: !424, size: 32, offset: 1184)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !924, file: !845, line: 139, baseType: !99, size: 32, offset: 1216)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !924, file: !845, line: 139, baseType: !99, size: 32, offset: 1248)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !924, file: !845, line: 139, baseType: !99, size: 32, offset: 1280)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !924, file: !845, line: 140, baseType: !622, size: 96, offset: 1312)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !924, file: !845, line: 143, baseType: !388, size: 16, offset: 1408)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !924, file: !845, line: 144, baseType: !388, size: 16, offset: 1424)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !924, file: !845, line: 145, baseType: !388, size: 16, offset: 1440)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !924, file: !845, line: 148, baseType: !388, size: 16, offset: 1456)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !924, file: !845, line: 149, baseType: !99, size: 32, offset: 1472)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !924, file: !845, line: 150, baseType: !424, size: 32, offset: 1504)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !924, file: !845, line: 152, baseType: !653, size: 64, offset: 1536)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !924, file: !845, line: 163, baseType: !424, size: 32, offset: 1600)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !924, file: !845, line: 163, baseType: !424, size: 32, offset: 1632)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !915, file: !845, line: 261, baseType: !424, size: 32, offset: 192)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !915, file: !845, line: 261, baseType: !424, size: 32, offset: 224)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !915, file: !845, line: 261, baseType: !424, size: 32, offset: 256)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !915, file: !845, line: 263, baseType: !99, size: 32, offset: 288)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !915, file: !845, line: 266, baseType: !99, size: 32, offset: 320)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !915, file: !845, line: 267, baseType: !424, size: 32, offset: 352)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !844, file: !845, line: 347, baseType: !922, size: 64, offset: 1856)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !844, file: !845, line: 348, baseType: !973, size: 64, offset: 1920)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !845, line: 205, baseType: !975)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !845, line: 186, size: 1024, elements: !976)
!976 = !{!977, !979, !980, !981, !983, !984, !985, !993, !994, !995, !1070, !1071}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !975, file: !845, line: 187, baseType: !978, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !975, file: !845, line: 187, baseType: !978, size: 64, offset: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !975, file: !845, line: 189, baseType: !404, size: 512, offset: 128)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !975, file: !845, line: 191, baseType: !982, size: 64, offset: 640)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !975, file: !845, line: 193, baseType: !99, size: 32, offset: 704)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !975, file: !845, line: 193, baseType: !99, size: 32, offset: 736)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !975, file: !845, line: 195, baseType: !986, size: 64, offset: 768)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !845, line: 184, baseType: !988)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !845, line: 166, size: 320, elements: !989)
!989 = !{!990, !991, !992}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !988, file: !845, line: 180, baseType: !944, size: 256)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !988, file: !845, line: 182, baseType: !99, size: 32, offset: 256)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !988, file: !845, line: 183, baseType: !99, size: 32, offset: 288)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !975, file: !845, line: 196, baseType: !99, size: 32, offset: 832)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !975, file: !845, line: 198, baseType: !99, size: 32, offset: 864)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !975, file: !845, line: 200, baseType: !996, size: 64, offset: 896)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !782, line: 77, size: 15424, elements: !998)
!998 = !{!999, !1000, !1001, !1004, !1007, !1008, !1011, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1029, !1030, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1056, !1057, !1058, !1059, !1060, !1064}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !997, file: !782, line: 78, baseType: !356, size: 960)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !997, file: !782, line: 80, baseType: !374, size: 8192, offset: 960)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !997, file: !782, line: 82, baseType: !1002, size: 64, offset: 9152)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !782, line: 43, flags: DIFlagFwdDecl)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !997, file: !782, line: 83, baseType: !1005, size: 64, offset: 9216)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !357, line: 46, flags: DIFlagFwdDecl)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !997, file: !782, line: 86, baseType: !780, size: 64, offset: 9280)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !997, file: !782, line: 87, baseType: !1009, size: 64, offset: 9344)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !782, line: 44, flags: DIFlagFwdDecl)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !997, file: !782, line: 89, baseType: !1012, size: 512, offset: 9408)
!1012 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1009, size: 512, elements: !437)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !997, file: !782, line: 90, baseType: !388, size: 16, offset: 9920)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !997, file: !782, line: 90, baseType: !388, size: 16, offset: 9936)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !997, file: !782, line: 92, baseType: !388, size: 16, offset: 9952)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !997, file: !782, line: 92, baseType: !388, size: 16, offset: 9968)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !997, file: !782, line: 93, baseType: !388, size: 16, offset: 9984)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !997, file: !782, line: 93, baseType: !388, size: 16, offset: 10000)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !997, file: !782, line: 94, baseType: !99, size: 32, offset: 10016)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !997, file: !782, line: 97, baseType: !388, size: 16, offset: 10048)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !997, file: !782, line: 97, baseType: !388, size: 16, offset: 10064)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !997, file: !782, line: 98, baseType: !388, size: 16, offset: 10080)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !997, file: !782, line: 98, baseType: !388, size: 16, offset: 10096)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !997, file: !782, line: 99, baseType: !388, size: 16, offset: 10112)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !997, file: !782, line: 99, baseType: !388, size: 16, offset: 10128)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !997, file: !782, line: 100, baseType: !5, size: 32, offset: 10144)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !997, file: !782, line: 101, baseType: !1028, size: 64, offset: 10176)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !997, file: !782, line: 103, baseType: !381, size: 64, offset: 10240)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !997, file: !782, line: 104, baseType: !1031, size: 64, offset: 10304)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !357, line: 159, size: 448, elements: !1033)
!1033 = !{!1034, !1036, !1037, !1039, !1040, !1042}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1032, file: !357, line: 161, baseType: !1035, size: 64)
!1035 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !476)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1032, file: !357, line: 162, baseType: !1035, size: 64, offset: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !1032, file: !357, line: 163, baseType: !1038, size: 32, offset: 128)
!1038 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 32, elements: !476)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !1032, file: !357, line: 164, baseType: !1038, size: 32, offset: 160)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !1032, file: !357, line: 165, baseType: !1041, size: 128, offset: 192)
!1041 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1028, size: 128, elements: !476)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1032, file: !357, line: 166, baseType: !1043, size: 128, offset: 320)
!1043 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1005, size: 128, elements: !476)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !997, file: !782, line: 107, baseType: !424, size: 32, offset: 10368)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !997, file: !782, line: 108, baseType: !99, size: 32, offset: 10400)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !997, file: !782, line: 109, baseType: !388, size: 16, offset: 10432)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !997, file: !782, line: 110, baseType: !388, size: 16, offset: 10448)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !997, file: !782, line: 113, baseType: !99, size: 32, offset: 10464)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !997, file: !782, line: 113, baseType: !99, size: 32, offset: 10496)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !997, file: !782, line: 114, baseType: !375, size: 8, offset: 10528)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !997, file: !782, line: 114, baseType: !375, size: 8, offset: 10536)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !997, file: !782, line: 115, baseType: !388, size: 16, offset: 10544)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !997, file: !782, line: 116, baseType: !1054, size: 128, offset: 10560)
!1054 = !DICompositeType(tag: DW_TAG_array_type, baseType: !424, size: 128, elements: !1055)
!1055 = !{!912}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !997, file: !782, line: 119, baseType: !424, size: 32, offset: 10688)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !997, file: !782, line: 119, baseType: !424, size: 32, offset: 10720)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !997, file: !782, line: 122, baseType: !814, size: 512, offset: 10752)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !997, file: !782, line: 123, baseType: !375, size: 8, offset: 11264)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !997, file: !782, line: 125, baseType: !1061, size: 56, offset: 11272)
!1061 = !DICompositeType(tag: DW_TAG_array_type, baseType: !375, size: 56, elements: !1062)
!1062 = !{!1063}
!1063 = !DISubrange(count: 7)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !997, file: !782, line: 126, baseType: !1065, size: 4096, offset: 11328)
!1065 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1066, size: 4096, elements: !437)
!1066 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !782, line: 69, baseType: !1067)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !782, line: 67, size: 512, elements: !1068)
!1068 = !{!1069}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1067, file: !782, line: 68, baseType: !404, size: 512)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !975, file: !845, line: 201, baseType: !424, size: 32, offset: 960)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !975, file: !845, line: 204, baseType: !99, size: 32, offset: 992)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !844, file: !845, line: 350, baseType: !414, size: 128, offset: 1984)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !844, file: !845, line: 351, baseType: !99, size: 32, offset: 2112)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !844, file: !845, line: 351, baseType: !99, size: 32, offset: 2144)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !844, file: !845, line: 353, baseType: !1076, size: 64, offset: 2176)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !845, line: 297, baseType: !1078)
!1078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !845, line: 295, size: 2048, elements: !1079)
!1079 = !{!1080}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !1078, file: !845, line: 296, baseType: !763, size: 2048)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !844, file: !845, line: 355, baseType: !1082, size: 384, offset: 2240)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !845, line: 338, baseType: !1083)
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !845, line: 322, size: 384, elements: !1084)
!1084 = !{!1085, !1086, !1087, !1088, !1089, !1090, !1091}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1083, file: !845, line: 323, baseType: !99, size: 32)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !1083, file: !845, line: 325, baseType: !388, size: 16, offset: 32)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1083, file: !845, line: 326, baseType: !388, size: 16, offset: 48)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !1083, file: !845, line: 331, baseType: !414, size: 128, offset: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1083, file: !845, line: 334, baseType: !414, size: 128, offset: 192)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !1083, file: !845, line: 335, baseType: !99, size: 32, offset: 320)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1083, file: !845, line: 337, baseType: !99, size: 32, offset: 352)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !826, file: !827, line: 81, baseType: !354, size: 64, offset: 12224)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !826, file: !827, line: 85, baseType: !1094, size: 6208, offset: 12288)
!1094 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !827, line: 55, size: 6208, elements: !1095)
!1095 = !{!1096, !1097, !1098, !1099, !1100}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1094, file: !827, line: 56, baseType: !769, size: 6144)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !1094, file: !827, line: 58, baseType: !388, size: 16, offset: 6144)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1094, file: !827, line: 59, baseType: !388, size: 16, offset: 6160)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !1094, file: !827, line: 60, baseType: !388, size: 16, offset: 6176)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !1094, file: !827, line: 61, baseType: !388, size: 16, offset: 6192)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !826, file: !827, line: 86, baseType: !99, size: 32, offset: 18496)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !826, file: !827, line: 88, baseType: !99, size: 32, offset: 18528)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !826, file: !827, line: 90, baseType: !99, size: 32, offset: 18560)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !826, file: !827, line: 94, baseType: !99, size: 32, offset: 18592)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !826, file: !827, line: 100, baseType: !814, size: 512, offset: 18624)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !718, file: !709, line: 154, baseType: !1107, size: 64, offset: 1664)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !1109, line: 264, flags: DIFlagFwdDecl)
!1109 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !718, file: !709, line: 156, baseType: !780, size: 64, offset: 1728)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "effect_fader", scope: !718, file: !709, line: 158, baseType: !424, size: 32, offset: 1792)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "speed_fader", scope: !718, file: !709, line: 159, baseType: !424, size: 32, offset: 1824)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "seq1", scope: !718, file: !709, line: 162, baseType: !721, size: 64, offset: 1856)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "seq2", scope: !718, file: !709, line: 162, baseType: !721, size: 64, offset: 1920)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "seq3", scope: !718, file: !709, line: 162, baseType: !721, size: 64, offset: 1984)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !718, file: !709, line: 164, baseType: !414, size: 128, offset: 2048)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !718, file: !709, line: 166, baseType: !1118, size: 64, offset: 2176)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64)
!1119 = !DICompositeType(tag: DW_TAG_structure_type, name: "bSound", file: !709, line: 51, flags: DIFlagFwdDecl)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "scene_sound", scope: !718, file: !709, line: 167, baseType: !354, size: 64, offset: 2240)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !718, file: !709, line: 168, baseType: !424, size: 32, offset: 2304)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !718, file: !709, line: 170, baseType: !424, size: 32, offset: 2336)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "pan", scope: !718, file: !709, line: 170, baseType: !424, size: 32, offset: 2368)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "strobe", scope: !718, file: !709, line: 171, baseType: !424, size: 32, offset: 2400)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "effectdata", scope: !718, file: !709, line: 173, baseType: !354, size: 64, offset: 2432)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "anim_startofs", scope: !718, file: !709, line: 175, baseType: !99, size: 32, offset: 2496)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "anim_endofs", scope: !718, file: !709, line: 176, baseType: !99, size: 32, offset: 2528)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "blend_mode", scope: !718, file: !709, line: 179, baseType: !99, size: 32, offset: 2560)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "blend_opacity", scope: !718, file: !709, line: 180, baseType: !424, size: 32, offset: 2592)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !718, file: !709, line: 183, baseType: !99, size: 32, offset: 2624)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !718, file: !709, line: 185, baseType: !375, size: 8, offset: 2656)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !718, file: !709, line: 186, baseType: !1133, size: 24, offset: 2664)
!1133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !375, size: 24, elements: !623)
