; ModuleID = 'blender/source/blender/editors/sculpt_paint/sculpt.c'
source_filename = "blender/source/blender/editors/sculpt_paint/sculpt.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "flip", scope: !2, file: !3, line: 2036, type: !5190, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "do_rotate_brush", scope: !3, file: !3, line: 2030, type: !4, scopeLine: 2031, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3745, retainedNodes: !5189)
!3 = !DIFile(filename: "blender/source/blender/editors/sculpt_paint/sculpt.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6, !3739, !3741, !57}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !8, line: 916, baseType: !9)
!8 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !8, line: 891, size: 704, elements: !10)
!10 = !{!11, !3731, !3732, !3733, !3734, !3735, !3736, !3737, !3738}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !9, file: !8, line: 892, baseType: !12, size: 320)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !8, line: 830, baseType: !13)
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !8, line: 813, size: 320, elements: !14)
!14 = !{!15, !3716, !3725, !3726, !3728, !3729, !3730}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !13, file: !8, line: 814, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !18, line: 54, size: 16448, elements: !19)
!18 = !DIFile(filename: "blender/source/blender/makesdna/DNA_brush_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!19 = !{!20, !92, !189, !239, !3627, !3628, !3629, !3630, !3633, !3634, !3669, !3670, !3671, !3672, !3673, !3674, !3675, !3676, !3677, !3678, !3679, !3680, !3681, !3682, !3683, !3684, !3685, !3686, !3687, !3688, !3689, !3690, !3691, !3692, !3693, !3694, !3695, !3696, !3697, !3698, !3699, !3700, !3701, !3702, !3703, !3704, !3705, !3706, !3707, !3708, !3709, !3710, !3711, !3712, !3713, !3714, !3715}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !17, file: !18, line: 55, baseType: !21, size: 960)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !22, line: 130, baseType: !23)
!22 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !22, line: 117, size: 960, elements: !24)
!24 = !{!25, !27, !28, !30, !50, !54, !56, !58, !59, !60}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !23, file: !22, line: 118, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !23, file: !22, line: 118, baseType: !26, size: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !23, file: !22, line: 119, baseType: !29, size: 64, offset: 128)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !23, file: !22, line: 120, baseType: !31, size: 64, offset: 192)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !22, line: 136, size: 17600, elements: !33)
!33 = !{!34, !35, !37, !40, !45, !46, !47}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !32, file: !22, line: 137, baseType: !21, size: 960)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !32, file: !22, line: 138, baseType: !36, size: 64, offset: 960)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !32, file: !22, line: 139, baseType: !38, size: 64, offset: 1024)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !22, line: 43, flags: DIFlagFwdDecl)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !32, file: !22, line: 140, baseType: !41, size: 8192, offset: 1088)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 8192, elements: !43)
!42 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!43 = !{!44}
!44 = !DISubrange(count: 1024)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !32, file: !22, line: 141, baseType: !41, size: 8192, offset: 9280)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !32, file: !22, line: 148, baseType: !31, size: 64, offset: 17472)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !32, file: !22, line: 150, baseType: !48, size: 64, offset: 17536)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !22, line: 45, flags: DIFlagFwdDecl)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !23, file: !22, line: 121, baseType: !51, size: 528, offset: 256)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 528, elements: !52)
!52 = !{!53}
!53 = !DISubrange(count: 66)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !23, file: !22, line: 126, baseType: !55, size: 16, offset: 784)
!55 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !23, file: !22, line: 127, baseType: !57, size: 32, offset: 800)
!57 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !23, file: !22, line: 128, baseType: !57, size: 32, offset: 832)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !23, file: !22, line: 128, baseType: !57, size: 32, offset: 864)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !23, file: !22, line: 129, baseType: !61, size: 64, offset: 896)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !22, line: 75, baseType: !63)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !22, line: 62, size: 1024, elements: !64)
!64 = !{!65, !67, !68, !69, !70, !71, !75, !76, !90, !91}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !63, file: !22, line: 63, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !63, file: !22, line: 63, baseType: !66, size: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !63, file: !22, line: 64, baseType: !42, size: 8, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !63, file: !22, line: 64, baseType: !42, size: 8, offset: 136)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !63, file: !22, line: 65, baseType: !55, size: 16, offset: 144)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !63, file: !22, line: 66, baseType: !72, size: 512, offset: 160)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 512, elements: !73)
!73 = !{!74}
!74 = !DISubrange(count: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !63, file: !22, line: 67, baseType: !57, size: 32, offset: 672)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !63, file: !22, line: 69, baseType: !77, size: 256, offset: 704)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !22, line: 60, baseType: !78)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !22, line: 48, size: 256, elements: !79)
!79 = !{!80, !81, !88, !89}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !78, file: !22, line: 49, baseType: !26, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !78, file: !22, line: 58, baseType: !82, size: 128, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !83, line: 71, baseType: !84)
!83 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !83, line: 69, size: 128, elements: !85)
!85 = !{!86, !87}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !84, file: !83, line: 70, baseType: !26, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !84, file: !83, line: 70, baseType: !26, size: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !78, file: !22, line: 59, baseType: !57, size: 32, offset: 192)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !78, file: !22, line: 59, baseType: !57, size: 32, offset: 224)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !63, file: !22, line: 70, baseType: !57, size: 32, offset: 960)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !63, file: !22, line: 74, baseType: !57, size: 32, offset: 992)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !17, file: !18, line: 57, baseType: !93, size: 192, offset: 960)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BrushClone", file: !18, line: 48, size: 192, elements: !94)
!94 = !{!95, !185, !187, !188}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !93, file: !18, line: 49, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !98, line: 77, size: 15424, elements: !99)
!98 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!99 = !{!100, !101, !102, !105, !108, !111, !114, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !133, !135, !136, !152, !154, !155, !156, !157, !158, !159, !160, !161, !162, !166, !167, !168, !174, !175, !179}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !97, file: !98, line: 78, baseType: !21, size: 960)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !97, file: !98, line: 80, baseType: !41, size: 8192, offset: 960)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !97, file: !98, line: 82, baseType: !103, size: 64, offset: 9152)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !98, line: 43, flags: DIFlagFwdDecl)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !97, file: !98, line: 83, baseType: !106, size: 64, offset: 9216)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !22, line: 46, flags: DIFlagFwdDecl)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !97, file: !98, line: 86, baseType: !109, size: 64, offset: 9280)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !98, line: 41, flags: DIFlagFwdDecl)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !97, file: !98, line: 87, baseType: !112, size: 64, offset: 9344)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !98, line: 44, flags: DIFlagFwdDecl)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !97, file: !98, line: 89, baseType: !115, size: 512, offset: 9408)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 512, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 8)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !97, file: !98, line: 90, baseType: !55, size: 16, offset: 9920)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !97, file: !98, line: 90, baseType: !55, size: 16, offset: 9936)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !97, file: !98, line: 92, baseType: !55, size: 16, offset: 9952)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !97, file: !98, line: 92, baseType: !55, size: 16, offset: 9968)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !97, file: !98, line: 93, baseType: !55, size: 16, offset: 9984)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !97, file: !98, line: 93, baseType: !55, size: 16, offset: 10000)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !97, file: !98, line: 94, baseType: !57, size: 32, offset: 10016)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !97, file: !98, line: 97, baseType: !55, size: 16, offset: 10048)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !97, file: !98, line: 97, baseType: !55, size: 16, offset: 10064)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !97, file: !98, line: 98, baseType: !55, size: 16, offset: 10080)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !97, file: !98, line: 98, baseType: !55, size: 16, offset: 10096)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !97, file: !98, line: 99, baseType: !55, size: 16, offset: 10112)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !97, file: !98, line: 99, baseType: !55, size: 16, offset: 10128)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !97, file: !98, line: 100, baseType: !132, size: 32, offset: 10144)
!132 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !97, file: !98, line: 101, baseType: !134, size: 64, offset: 10176)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !97, file: !98, line: 103, baseType: !48, size: 64, offset: 10240)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !97, file: !98, line: 104, baseType: !137, size: 64, offset: 10304)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !22, line: 159, size: 448, elements: !139)
!139 = !{!140, !144, !145, !147, !148, !150}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !138, file: !22, line: 161, baseType: !141, size: 64)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 64, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 2)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !138, file: !22, line: 162, baseType: !141, size: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !138, file: !22, line: 163, baseType: !146, size: 32, offset: 128)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 32, elements: !142)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !138, file: !22, line: 164, baseType: !146, size: 32, offset: 160)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !138, file: !22, line: 165, baseType: !149, size: 128, offset: 192)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 128, elements: !142)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !138, file: !22, line: 166, baseType: !151, size: 128, offset: 320)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 128, elements: !142)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !97, file: !98, line: 107, baseType: !153, size: 32, offset: 10368)
!153 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !97, file: !98, line: 108, baseType: !57, size: 32, offset: 10400)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !97, file: !98, line: 109, baseType: !55, size: 16, offset: 10432)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !97, file: !98, line: 110, baseType: !55, size: 16, offset: 10448)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !97, file: !98, line: 113, baseType: !57, size: 32, offset: 10464)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !97, file: !98, line: 113, baseType: !57, size: 32, offset: 10496)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !97, file: !98, line: 114, baseType: !42, size: 8, offset: 10528)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !97, file: !98, line: 114, baseType: !42, size: 8, offset: 10536)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !97, file: !98, line: 115, baseType: !55, size: 16, offset: 10544)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !97, file: !98, line: 116, baseType: !163, size: 128, offset: 10560)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 128, elements: !164)
!164 = !{!165}
!165 = !DISubrange(count: 4)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !97, file: !98, line: 119, baseType: !153, size: 32, offset: 10688)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !97, file: !98, line: 119, baseType: !153, size: 32, offset: 10720)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !97, file: !98, line: 122, baseType: !169, size: 512, offset: 10752)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !170, line: 182, baseType: !171)
!170 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !170, line: 180, size: 512, elements: !172)
!172 = !{!173}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !171, file: !170, line: 181, baseType: !72, size: 512)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !97, file: !98, line: 123, baseType: !42, size: 8, offset: 11264)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !97, file: !98, line: 125, baseType: !176, size: 56, offset: 11272)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 56, elements: !177)
!177 = !{!178}
!178 = !DISubrange(count: 7)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !97, file: !98, line: 126, baseType: !180, size: 4096, offset: 11328)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 4096, elements: !116)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !98, line: 69, baseType: !182)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !98, line: 67, size: 512, elements: !183)
!183 = !{!184}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !182, file: !98, line: 68, baseType: !72, size: 512)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !93, file: !18, line: 50, baseType: !186, size: 64, offset: 64)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 64, elements: !142)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !93, file: !18, line: 51, baseType: !153, size: 32, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !93, file: !18, line: 51, baseType: !153, size: 32, offset: 160)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !17, file: !18, line: 58, baseType: !190, size: 64, offset: 1152)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapping", file: !170, line: 72, size: 3072, elements: !192)
!192 = !{!193, !194, !195, !196, !197, !206, !207, !232, !236, !237, !238}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !191, file: !170, line: 73, baseType: !57, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !191, file: !170, line: 73, baseType: !57, size: 32, offset: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "preset", scope: !191, file: !170, line: 74, baseType: !57, size: 32, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !191, file: !170, line: 75, baseType: !57, size: 32, offset: 96)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !191, file: !170, line: 77, baseType: !198, size: 128, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !199, line: 95, baseType: !200)
!199 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !199, line: 92, size: 128, elements: !201)
!201 = !{!202, !203, !204, !205}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !200, file: !199, line: 93, baseType: !153, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !200, file: !199, line: 93, baseType: !153, size: 32, offset: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !200, file: !199, line: 94, baseType: !153, size: 32, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !200, file: !199, line: 94, baseType: !153, size: 32, offset: 96)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "clipr", scope: !191, file: !170, line: 77, baseType: !198, size: 128, offset: 256)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "cm", scope: !191, file: !170, line: 79, baseType: !208, size: 2304, offset: 384)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 2304, elements: !164)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMap", file: !170, line: 67, baseType: !210)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMap", file: !170, line: 55, size: 576, elements: !211)
!211 = !{!212, !213, !214, !215, !216, !217, !218, !219, !228, !229, !230, !231}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "totpoint", scope: !210, file: !170, line: 56, baseType: !55, size: 16)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !210, file: !170, line: 56, baseType: !55, size: 16, offset: 16)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !210, file: !170, line: 58, baseType: !153, size: 32, offset: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "mintable", scope: !210, file: !170, line: 59, baseType: !153, size: 32, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "maxtable", scope: !210, file: !170, line: 59, baseType: !153, size: 32, offset: 96)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "ext_in", scope: !210, file: !170, line: 60, baseType: !186, size: 64, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "ext_out", scope: !210, file: !170, line: 60, baseType: !186, size: 64, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !210, file: !170, line: 61, baseType: !220, size: 64, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMapPoint", file: !170, line: 47, baseType: !222)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapPoint", file: !170, line: 44, size: 96, elements: !223)
!223 = !{!224, !225, !226, !227}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !222, file: !170, line: 45, baseType: !153, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !222, file: !170, line: 45, baseType: !153, size: 32, offset: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !222, file: !170, line: 46, baseType: !55, size: 16, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "shorty", scope: !222, file: !170, line: 46, baseType: !55, size: 16, offset: 80)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !210, file: !170, line: 62, baseType: !220, size: 64, offset: 320)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "premultable", scope: !210, file: !170, line: 64, baseType: !220, size: 64, offset: 384)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_in", scope: !210, file: !170, line: 65, baseType: !186, size: 64, offset: 448)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_out", scope: !210, file: !170, line: 66, baseType: !186, size: 64, offset: 512)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "black", scope: !191, file: !170, line: 80, baseType: !233, size: 96, offset: 2688)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 96, elements: !234)
!234 = !{!235}
!235 = !DISubrange(count: 3)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "white", scope: !191, file: !170, line: 80, baseType: !233, size: 96, offset: 2784)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "bwmul", scope: !191, file: !170, line: 81, baseType: !233, size: 96, offset: 2880)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "sample", scope: !191, file: !170, line: 83, baseType: !233, size: 96, offset: 2976)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !17, file: !18, line: 59, baseType: !240, size: 2496, offset: 1216)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !241, line: 57, size: 2496, elements: !242)
!241 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!242 = !{!243, !244, !245, !246, !247, !3425, !3568, !3569, !3570, !3571, !3572, !3573, !3574, !3575, !3576, !3577, !3578, !3579, !3580, !3581, !3582, !3583, !3584, !3585, !3586, !3587, !3588, !3589, !3590, !3591, !3592, !3593, !3594, !3595, !3596, !3597, !3598, !3599, !3600, !3601, !3602, !3603, !3604, !3605, !3606, !3607, !3608, !3609, !3610, !3611, !3612, !3613, !3614, !3615, !3616, !3617, !3618, !3619, !3620, !3621, !3622, !3623, !3624, !3625, !3626}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !240, file: !241, line: 59, baseType: !55, size: 16)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !240, file: !241, line: 59, baseType: !55, size: 16, offset: 16)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !240, file: !241, line: 59, baseType: !55, size: 16, offset: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !240, file: !241, line: 59, baseType: !55, size: 16, offset: 48)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !240, file: !241, line: 60, baseType: !248, size: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !250, line: 115, size: 11392, elements: !251)
!250 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!251 = !{!252, !253, !257, !2790, !2791, !2792, !2793, !2794, !2795, !2796, !2797, !2798, !2799, !2800, !2801, !2802, !2803, !2817, !2818, !2858, !2859, !2860, !2861, !2877, !2878, !2879, !2880, !2881, !2882, !2883, !2885, !2886, !2887, !2888, !2889, !2890, !2891, !2892, !2893, !2894, !2895, !2896, !2897, !2898, !2899, !2900, !2901, !2902, !2903, !2904, !2905, !2906, !2907, !2908, !2909, !2910, !2911, !2912, !2913, !2914, !2915, !2916, !2917, !2918, !2919, !2920, !2921, !2922, !2923, !2924, !2925, !2926, !2927, !2928, !2929, !2930, !2931, !2932, !2933, !2934, !2935, !2936, !2937, !2938, !2939, !2940, !2941, !2942, !2943, !2944, !2945, !2946, !2947, !2948, !2949, !2950, !2951, !2952, !2953, !2954, !2955, !2956, !2959, !2960, !2961, !2962, !2963, !2964, !2965, !2966, !2967, !2970, !2973, !2974, !2975, !2976, !2977, !2978, !2981, !2984, !3395, !3396, !3397, !3398, !3399, !3400, !3401, !3402, !3403, !3406, !3409, !3410, !3413, !3414}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !249, file: !250, line: 116, baseType: !21, size: 960)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !249, file: !250, line: 117, baseType: !254, size: 64, offset: 960)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !256, line: 39, flags: DIFlagFwdDecl)
!256 = !DIFile(filename: "blender/source/blender/makesdna/DNA_mesh_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!257 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !249, file: !250, line: 119, baseType: !258, size: 64, offset: 1024)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !260, line: 155, size: 1856, elements: !261)
!260 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_paint.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!261 = !{!262, !2028, !2036, !2045, !2051, !2052, !2053, !2055, !2075, !2076, !2085, !2312, !2313, !2314, !2316, !2320, !2323, !2324, !2325, !2326, !2327, !2331, !2332, !2333, !2334, !2335, !2339, !2340, !2343, !2786, !2787, !2788, !2789}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "multires", scope: !259, file: !260, line: 157, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MultiresModifierData", file: !265, line: 717, size: 960, elements: !266)
!265 = !DIFile(filename: "blender/source/blender/makesdna/DNA_modifier_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!266 = !{!267, !2021, !2022, !2023, !2024, !2025, !2026, !2027}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !264, file: !265, line: 718, baseType: !268, size: 896)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierData", file: !265, line: 110, baseType: !269)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierData", file: !265, line: 99, size: 896, elements: !270)
!270 = !{!271, !273, !274, !275, !276, !277, !278, !279, !2020}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !269, file: !265, line: 100, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !269, file: !265, line: 100, baseType: !272, size: 64, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !269, file: !265, line: 102, baseType: !57, size: 32, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !269, file: !265, line: 102, baseType: !57, size: 32, offset: 160)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "stackindex", scope: !269, file: !265, line: 103, baseType: !57, size: 32, offset: 192)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !269, file: !265, line: 103, baseType: !57, size: 32, offset: 224)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !269, file: !265, line: 104, baseType: !72, size: 512, offset: 256)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !269, file: !265, line: 107, baseType: !280, size: 64, offset: 768)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !8, line: 1216, size: 39680, elements: !282)
!282 = !{!283, !284, !285, !286, !1075, !1076, !1077, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1103, !1104, !1451, !1646, !1649, !1890, !1902, !1903, !1904, !1905, !1906, !1907, !1908, !1909, !1912, !1913, !1914, !1915, !1916, !1924, !1991, !1998, !1999, !2006, !2007, !2013, !2014, !2015, !2016, !2017}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !281, file: !8, line: 1217, baseType: !21, size: 960)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !281, file: !8, line: 1218, baseType: !254, size: 64, offset: 960)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !281, file: !8, line: 1220, baseType: !248, size: 64, offset: 1024)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !281, file: !8, line: 1221, baseType: !287, size: 64, offset: 1088)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !289, line: 52, size: 4224, elements: !290)
!289 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!290 = !{!291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !360, !361, !364, !369, !370, !371, !372, !373}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !288, file: !289, line: 53, baseType: !21, size: 960)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !288, file: !289, line: 54, baseType: !254, size: 64, offset: 960)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !288, file: !289, line: 56, baseType: !55, size: 16, offset: 1024)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !288, file: !289, line: 56, baseType: !55, size: 16, offset: 1040)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !288, file: !289, line: 57, baseType: !55, size: 16, offset: 1056)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !288, file: !289, line: 57, baseType: !55, size: 16, offset: 1072)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !288, file: !289, line: 59, baseType: !153, size: 32, offset: 1088)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !288, file: !289, line: 59, baseType: !153, size: 32, offset: 1120)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !288, file: !289, line: 59, baseType: !153, size: 32, offset: 1152)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !288, file: !289, line: 60, baseType: !153, size: 32, offset: 1184)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !288, file: !289, line: 60, baseType: !153, size: 32, offset: 1216)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !288, file: !289, line: 60, baseType: !153, size: 32, offset: 1248)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !288, file: !289, line: 61, baseType: !153, size: 32, offset: 1280)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !288, file: !289, line: 61, baseType: !153, size: 32, offset: 1312)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !288, file: !289, line: 61, baseType: !153, size: 32, offset: 1344)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !288, file: !289, line: 68, baseType: !153, size: 32, offset: 1376)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !288, file: !289, line: 68, baseType: !153, size: 32, offset: 1408)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !288, file: !289, line: 68, baseType: !153, size: 32, offset: 1440)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !288, file: !289, line: 69, baseType: !153, size: 32, offset: 1472)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !288, file: !289, line: 69, baseType: !153, size: 32, offset: 1504)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !288, file: !289, line: 74, baseType: !153, size: 32, offset: 1536)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !288, file: !289, line: 79, baseType: !153, size: 32, offset: 1568)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !288, file: !289, line: 81, baseType: !55, size: 16, offset: 1600)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !288, file: !289, line: 91, baseType: !55, size: 16, offset: 1616)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !288, file: !289, line: 92, baseType: !55, size: 16, offset: 1632)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !288, file: !289, line: 93, baseType: !55, size: 16, offset: 1648)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !288, file: !289, line: 94, baseType: !55, size: 16, offset: 1664)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !288, file: !289, line: 94, baseType: !55, size: 16, offset: 1680)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !288, file: !289, line: 94, baseType: !55, size: 16, offset: 1696)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !288, file: !289, line: 94, baseType: !55, size: 16, offset: 1712)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !288, file: !289, line: 96, baseType: !153, size: 32, offset: 1728)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !288, file: !289, line: 96, baseType: !153, size: 32, offset: 1760)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !288, file: !289, line: 96, baseType: !153, size: 32, offset: 1792)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !288, file: !289, line: 96, baseType: !153, size: 32, offset: 1824)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !288, file: !289, line: 98, baseType: !153, size: 32, offset: 1856)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !288, file: !289, line: 98, baseType: !153, size: 32, offset: 1888)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !288, file: !289, line: 98, baseType: !153, size: 32, offset: 1920)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !288, file: !289, line: 98, baseType: !153, size: 32, offset: 1952)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !288, file: !289, line: 99, baseType: !153, size: 32, offset: 1984)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !288, file: !289, line: 99, baseType: !153, size: 32, offset: 2016)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !288, file: !289, line: 100, baseType: !153, size: 32, offset: 2048)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !288, file: !289, line: 100, baseType: !153, size: 32, offset: 2080)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !288, file: !289, line: 103, baseType: !55, size: 16, offset: 2112)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !288, file: !289, line: 103, baseType: !55, size: 16, offset: 2128)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !288, file: !289, line: 103, baseType: !55, size: 16, offset: 2144)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !288, file: !289, line: 103, baseType: !55, size: 16, offset: 2160)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !288, file: !289, line: 106, baseType: !153, size: 32, offset: 2176)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !288, file: !289, line: 106, baseType: !153, size: 32, offset: 2208)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !288, file: !289, line: 106, baseType: !153, size: 32, offset: 2240)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !288, file: !289, line: 106, baseType: !153, size: 32, offset: 2272)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !288, file: !289, line: 107, baseType: !55, size: 16, offset: 2304)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !288, file: !289, line: 107, baseType: !55, size: 16, offset: 2320)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !288, file: !289, line: 107, baseType: !55, size: 16, offset: 2336)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !288, file: !289, line: 107, baseType: !55, size: 16, offset: 2352)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !288, file: !289, line: 108, baseType: !153, size: 32, offset: 2368)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !288, file: !289, line: 108, baseType: !153, size: 32, offset: 2400)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !288, file: !289, line: 109, baseType: !153, size: 32, offset: 2432)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !288, file: !289, line: 109, baseType: !153, size: 32, offset: 2464)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !288, file: !289, line: 110, baseType: !153, size: 32, offset: 2496)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !288, file: !289, line: 110, baseType: !153, size: 32, offset: 2528)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !288, file: !289, line: 110, baseType: !153, size: 32, offset: 2560)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !288, file: !289, line: 111, baseType: !55, size: 16, offset: 2592)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !288, file: !289, line: 111, baseType: !55, size: 16, offset: 2608)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !288, file: !289, line: 112, baseType: !55, size: 16, offset: 2624)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !288, file: !289, line: 112, baseType: !55, size: 16, offset: 2640)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !288, file: !289, line: 112, baseType: !55, size: 16, offset: 2656)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !288, file: !289, line: 115, baseType: !55, size: 16, offset: 2672)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !288, file: !289, line: 118, baseType: !359, size: 64, offset: 2688)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !288, file: !289, line: 118, baseType: !359, size: 64, offset: 2752)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !288, file: !289, line: 121, baseType: !362, size: 64, offset: 2816)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !256, line: 41, flags: DIFlagFwdDecl)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !288, file: !289, line: 122, baseType: !365, size: 1152, offset: 2880)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 1152, elements: !367)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!367 = !{!368}
!368 = !DISubrange(count: 18)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !288, file: !289, line: 123, baseType: !55, size: 16, offset: 4032)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !288, file: !289, line: 123, baseType: !55, size: 16, offset: 4048)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !288, file: !289, line: 123, baseType: !146, size: 32, offset: 4064)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !288, file: !289, line: 126, baseType: !137, size: 64, offset: 4096)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !288, file: !289, line: 129, baseType: !374, size: 64, offset: 4160)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !376, line: 328, size: 3456, elements: !377)
!376 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!377 = !{!378, !379, !380, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1053, !1054, !1055, !1058, !1062, !1066, !1070, !1071, !1072, !1073, !1074}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !375, file: !376, line: 329, baseType: !21, size: 960)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !375, file: !376, line: 330, baseType: !254, size: 64, offset: 960)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !375, file: !376, line: 332, baseType: !381, size: 64, offset: 1024)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !383, line: 283, size: 4096, elements: !384)
!383 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!384 = !{!385, !386, !387, !388, !392, !393, !397, !992, !1000, !1004, !1010, !1014, !1015, !1016, !1017, !1021, !1022}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !382, file: !383, line: 284, baseType: !57, size: 32)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !382, file: !383, line: 285, baseType: !72, size: 512, offset: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !382, file: !383, line: 287, baseType: !72, size: 512, offset: 544)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !382, file: !383, line: 288, baseType: !389, size: 2048, offset: 1056)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 2048, elements: !390)
!390 = !{!391}
!391 = !DISubrange(count: 256)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !382, file: !383, line: 289, baseType: !57, size: 32, offset: 3104)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !382, file: !383, line: 292, baseType: !394, size: 64, offset: 3136)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DISubroutineType(types: !396)
!396 = !{null, !374}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !382, file: !383, line: 293, baseType: !398, size: 64, offset: 3200)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DISubroutineType(types: !400)
!400 = !{null, !374, !401}
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !376, line: 167, size: 3712, elements: !403)
!403 = !{!404, !405, !406, !407, !408, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !402, file: !376, line: 168, baseType: !401, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !402, file: !376, line: 168, baseType: !401, size: 64, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !402, file: !376, line: 168, baseType: !401, size: 64, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !402, file: !376, line: 170, baseType: !61, size: 64, offset: 192)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !402, file: !376, line: 172, baseType: !409, size: 64, offset: 256)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !383, line: 144, size: 6016, elements: !411)
!411 = !{!412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !588, !589, !590, !860, !864, !868, !869, !875, !879, !883, !884, !885, !886, !890, !891, !895, !899, !903, !907, !911, !915, !919, !920, !927, !929, !938, !947}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !410, file: !383, line: 145, baseType: !26, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !410, file: !383, line: 145, baseType: !26, size: 64, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !410, file: !383, line: 146, baseType: !55, size: 16, offset: 128)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !410, file: !383, line: 148, baseType: !72, size: 512, offset: 144)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !410, file: !383, line: 149, baseType: !57, size: 32, offset: 672)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !410, file: !383, line: 151, baseType: !72, size: 512, offset: 704)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !410, file: !383, line: 152, baseType: !389, size: 2048, offset: 1216)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !410, file: !383, line: 153, baseType: !57, size: 32, offset: 3264)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !410, file: !383, line: 155, baseType: !153, size: 32, offset: 3296)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !410, file: !383, line: 155, baseType: !153, size: 32, offset: 3328)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !410, file: !383, line: 155, baseType: !153, size: 32, offset: 3360)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !410, file: !383, line: 156, baseType: !153, size: 32, offset: 3392)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !410, file: !383, line: 156, baseType: !153, size: 32, offset: 3424)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !410, file: !383, line: 156, baseType: !153, size: 32, offset: 3456)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !410, file: !383, line: 157, baseType: !55, size: 16, offset: 3488)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !410, file: !383, line: 157, baseType: !55, size: 16, offset: 3504)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !410, file: !383, line: 157, baseType: !55, size: 16, offset: 3520)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !410, file: !383, line: 160, baseType: !430, size: 64, offset: 3584)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !383, line: 109, baseType: !432)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !383, line: 98, size: 1408, elements: !433)
!433 = !{!434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !587}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !432, file: !383, line: 99, baseType: !57, size: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !432, file: !383, line: 99, baseType: !57, size: 32, offset: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !432, file: !383, line: 100, baseType: !72, size: 512, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !432, file: !383, line: 101, baseType: !153, size: 32, offset: 576)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !432, file: !383, line: 101, baseType: !153, size: 32, offset: 608)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !432, file: !383, line: 101, baseType: !153, size: 32, offset: 640)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !432, file: !383, line: 101, baseType: !153, size: 32, offset: 672)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !432, file: !383, line: 102, baseType: !153, size: 32, offset: 704)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !432, file: !383, line: 102, baseType: !153, size: 32, offset: 736)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !432, file: !383, line: 103, baseType: !57, size: 32, offset: 768)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !432, file: !383, line: 104, baseType: !57, size: 32, offset: 800)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !432, file: !383, line: 107, baseType: !446, size: 64, offset: 832)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !376, line: 87, size: 2816, elements: !448)
!448 = !{!449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !572}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !447, file: !376, line: 88, baseType: !446, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !447, file: !376, line: 88, baseType: !446, size: 64, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !447, file: !376, line: 88, baseType: !446, size: 64, offset: 128)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !447, file: !376, line: 90, baseType: !61, size: 64, offset: 192)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !447, file: !376, line: 92, baseType: !72, size: 512, offset: 256)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !447, file: !376, line: 94, baseType: !72, size: 512, offset: 768)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !447, file: !376, line: 99, baseType: !26, size: 64, offset: 1280)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !447, file: !376, line: 101, baseType: !55, size: 16, offset: 1344)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !447, file: !376, line: 101, baseType: !55, size: 16, offset: 1360)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !447, file: !376, line: 102, baseType: !55, size: 16, offset: 1376)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !447, file: !376, line: 103, baseType: !55, size: 16, offset: 1392)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !447, file: !376, line: 104, baseType: !461, size: 64, offset: 1408)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !383, line: 114, size: 1600, elements: !463)
!463 = !{!464, !465, !488, !492, !496, !500, !504, !508, !509, !513, !542, !543, !544}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !462, file: !383, line: 115, baseType: !72, size: 512)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !462, file: !383, line: 117, baseType: !466, size: 64, offset: 512)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{null, !469, !472, !475, !475, !486}
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !471, line: 44, flags: DIFlagFwdDecl)
!471 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !474, line: 61, flags: DIFlagFwdDecl)
!474 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !471, line: 55, size: 192, elements: !477)
!477 = !{!478, !482, !485}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !476, file: !471, line: 58, baseType: !479, size: 64)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !476, file: !471, line: 56, size: 64, elements: !480)
!480 = !{!481}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !479, file: !471, line: 57, baseType: !26, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !476, file: !471, line: 60, baseType: !483, size: 64, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !376, line: 335, flags: DIFlagFwdDecl)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !476, file: !471, line: 61, baseType: !26, size: 64, offset: 128)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "draw_color", scope: !462, file: !383, line: 118, baseType: !489, size: 64, offset: 576)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DISubroutineType(types: !491)
!491 = !{null, !469, !475, !475, !359}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw", scope: !462, file: !383, line: 120, baseType: !493, size: 64, offset: 640)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DISubroutineType(types: !495)
!495 = !{null, !469, !472, !475}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw_color", scope: !462, file: !383, line: 121, baseType: !497, size: 64, offset: 704)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DISubroutineType(types: !499)
!499 = !{null, !469, !475, !359}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "interface_register_properties", scope: !462, file: !383, line: 122, baseType: !501, size: 64, offset: 768)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DISubroutineType(types: !503)
!503 = !{null, !374, !446, !483}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "interface_init_socket", scope: !462, file: !383, line: 123, baseType: !505, size: 64, offset: 832)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DISubroutineType(types: !507)
!507 = !{null, !374, !446, !401, !446, !486}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "interface_verify_socket", scope: !462, file: !383, line: 124, baseType: !505, size: 64, offset: 896)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "interface_from_socket", scope: !462, file: !383, line: 125, baseType: !510, size: 64, offset: 960)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DISubroutineType(types: !512)
!512 = !{null, !374, !446, !401, !446}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "ext_socket", scope: !462, file: !383, line: 128, baseType: !514, size: 256, offset: 1024)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !471, line: 436, baseType: !515)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !471, line: 430, size: 256, elements: !516)
!516 = !{!517, !518, !521, !537}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !515, file: !471, line: 431, baseType: !26, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !515, file: !471, line: 432, baseType: !519, size: 64, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !471, line: 417, baseType: !484)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !515, file: !471, line: 433, baseType: !522, size: 64, offset: 128)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !471, line: 408, baseType: !523)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{!57, !469, !475, !526, !528}
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !471, line: 38, flags: DIFlagFwdDecl)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !471, line: 348, baseType: !530)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !471, line: 337, size: 256, elements: !531)
!531 = !{!532, !533, !534, !535, !536}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !530, file: !471, line: 339, baseType: !26, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !530, file: !471, line: 342, baseType: !526, size: 64, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !530, file: !471, line: 345, baseType: !57, size: 32, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !530, file: !471, line: 347, baseType: !57, size: 32, offset: 160)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !530, file: !471, line: 347, baseType: !57, size: 32, offset: 192)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !515, file: !471, line: 434, baseType: !538, size: 64, offset: 192)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !471, line: 409, baseType: !539)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DISubroutineType(types: !541)
!541 = !{null, !26}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "ext_interface", scope: !462, file: !383, line: 129, baseType: !514, size: 256, offset: 1280)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !462, file: !383, line: 132, baseType: !57, size: 32, offset: 1536)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !462, file: !383, line: 132, baseType: !57, size: 32, offset: 1568)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !447, file: !376, line: 105, baseType: !72, size: 512, offset: 1472)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !447, file: !376, line: 107, baseType: !153, size: 32, offset: 1984)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !447, file: !376, line: 107, baseType: !153, size: 32, offset: 2016)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "default_value", scope: !447, file: !376, line: 109, baseType: !26, size: 64, offset: 2048)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "stack_index", scope: !447, file: !376, line: 112, baseType: !55, size: 16, offset: 2112)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "stack_type", scope: !447, file: !376, line: 114, baseType: !55, size: 16, offset: 2128)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !447, file: !376, line: 115, baseType: !57, size: 32, offset: 2144)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !447, file: !376, line: 117, baseType: !26, size: 64, offset: 2176)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "own_index", scope: !447, file: !376, line: 122, baseType: !57, size: 32, offset: 2240)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "to_index", scope: !447, file: !376, line: 124, baseType: !57, size: 32, offset: 2272)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "groupsock", scope: !447, file: !376, line: 126, baseType: !446, size: 64, offset: 2304)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !447, file: !376, line: 128, baseType: !557, size: 64, offset: 2368)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeLink", file: !376, line: 298, size: 448, elements: !559)
!559 = !{!560, !561, !562, !565, !566, !569, !570, !571}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !558, file: !376, line: 299, baseType: !557, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !558, file: !376, line: 299, baseType: !557, size: 64, offset: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "fromnode", scope: !558, file: !376, line: 301, baseType: !563, size: 64, offset: 128)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNode", file: !376, line: 218, baseType: !402)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "tonode", scope: !558, file: !376, line: 301, baseType: !563, size: 64, offset: 192)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "fromsock", scope: !558, file: !376, line: 302, baseType: !567, size: 64, offset: 256)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocket", file: !376, line: 132, baseType: !447)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "tosock", scope: !558, file: !376, line: 302, baseType: !567, size: 64, offset: 320)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !558, file: !376, line: 304, baseType: !57, size: 32, offset: 384)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !558, file: !376, line: 305, baseType: !57, size: 32, offset: 416)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !447, file: !376, line: 131, baseType: !573, size: 384, offset: 2432)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeStack", file: !376, line: 73, baseType: !574)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeStack", file: !376, line: 62, size: 384, elements: !575)
!575 = !{!576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !574, file: !376, line: 63, baseType: !163, size: 128)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !574, file: !376, line: 64, baseType: !153, size: 32, offset: 128)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !574, file: !376, line: 64, baseType: !153, size: 32, offset: 160)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !574, file: !376, line: 65, baseType: !26, size: 64, offset: 192)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "hasinput", scope: !574, file: !376, line: 66, baseType: !55, size: 16, offset: 256)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "hasoutput", scope: !574, file: !376, line: 67, baseType: !55, size: 16, offset: 272)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !574, file: !376, line: 68, baseType: !55, size: 16, offset: 288)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "sockettype", scope: !574, file: !376, line: 69, baseType: !55, size: 16, offset: 304)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !574, file: !376, line: 70, baseType: !55, size: 16, offset: 320)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !574, file: !376, line: 71, baseType: !55, size: 16, offset: 336)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !574, file: !376, line: 72, baseType: !146, size: 32, offset: 352)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !432, file: !383, line: 108, baseType: !72, size: 512, offset: 896)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !410, file: !383, line: 160, baseType: !430, size: 64, offset: 3648)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "storagename", scope: !410, file: !383, line: 162, baseType: !72, size: 512, offset: 3712)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype", scope: !410, file: !383, line: 165, baseType: !591, size: 64, offset: 4224)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DISubroutineType(types: !593)
!593 = !{null, !594, !596, !809, !374, !401, !856}
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !470)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !598, line: 230, size: 3072, elements: !599)
!598 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!599 = !{!600, !601, !602, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !798, !799, !800, !801, !802, !803, !804, !805, !806, !808}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !597, file: !598, line: 231, baseType: !596, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !597, file: !598, line: 231, baseType: !596, size: 64, offset: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !597, file: !598, line: 233, baseType: !603, size: 1280, offset: 128)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "View2D", file: !604, line: 71, baseType: !605)
!604 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view2d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View2D", file: !604, line: 40, size: 1280, elements: !606)
!606 = !{!607, !608, !609, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !641}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !605, file: !604, line: 41, baseType: !198, size: 128)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !605, file: !604, line: 41, baseType: !198, size: 128, offset: 128)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "vert", scope: !605, file: !604, line: 42, baseType: !610, size: 128, offset: 256)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !199, line: 89, baseType: !611)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !199, line: 86, size: 128, elements: !612)
!612 = !{!613, !614, !615, !616}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !611, file: !199, line: 87, baseType: !57, size: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !611, file: !199, line: 87, baseType: !57, size: 32, offset: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !611, file: !199, line: 88, baseType: !57, size: 32, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !611, file: !199, line: 88, baseType: !57, size: 32, offset: 96)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "hor", scope: !605, file: !604, line: 42, baseType: !610, size: 128, offset: 384)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !605, file: !604, line: 43, baseType: !610, size: 128, offset: 512)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !605, file: !604, line: 45, baseType: !186, size: 64, offset: 640)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !605, file: !604, line: 45, baseType: !186, size: 64, offset: 704)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "minzoom", scope: !605, file: !604, line: 46, baseType: !153, size: 32, offset: 768)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "maxzoom", scope: !605, file: !604, line: 46, baseType: !153, size: 32, offset: 800)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !605, file: !604, line: 48, baseType: !55, size: 16, offset: 832)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_ui", scope: !605, file: !604, line: 49, baseType: !55, size: 16, offset: 848)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "keeptot", scope: !605, file: !604, line: 51, baseType: !55, size: 16, offset: 864)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "keepzoom", scope: !605, file: !604, line: 52, baseType: !55, size: 16, offset: 880)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "keepofs", scope: !605, file: !604, line: 53, baseType: !55, size: 16, offset: 896)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !605, file: !604, line: 55, baseType: !55, size: 16, offset: 912)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !605, file: !604, line: 56, baseType: !55, size: 16, offset: 928)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !605, file: !604, line: 58, baseType: !55, size: 16, offset: 944)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !605, file: !604, line: 58, baseType: !55, size: 16, offset: 960)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "oldwinx", scope: !605, file: !604, line: 59, baseType: !55, size: 16, offset: 976)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "oldwiny", scope: !605, file: !604, line: 59, baseType: !55, size: 16, offset: 992)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !605, file: !604, line: 61, baseType: !55, size: 16, offset: 1008)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "tab_offset", scope: !605, file: !604, line: 63, baseType: !359, size: 64, offset: 1024)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "tab_num", scope: !605, file: !604, line: 64, baseType: !57, size: 32, offset: 1088)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "tab_cur", scope: !605, file: !604, line: 65, baseType: !57, size: 32, offset: 1120)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "sms", scope: !605, file: !604, line: 68, baseType: !639, size: 64, offset: 1152)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmoothView2DStore", file: !604, line: 68, flags: DIFlagFwdDecl)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_timer", scope: !605, file: !604, line: 69, baseType: !642, size: 64, offset: 1216)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !644, line: 490, size: 768, elements: !645)
!644 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!645 = !{!646, !647, !648, !769, !770, !771, !772, !773, !774, !775, !776, !777}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !643, file: !644, line: 491, baseType: !642, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !643, file: !644, line: 491, baseType: !642, size: 64, offset: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !643, file: !644, line: 493, baseType: !649, size: 64, offset: 128)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !474, line: 169, size: 2048, elements: !651)
!651 = !{!652, !653, !654, !655, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !744, !747, !761, !762, !763, !764, !765, !766, !767, !768}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !650, file: !474, line: 170, baseType: !649, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !650, file: !474, line: 170, baseType: !649, size: 64, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !650, file: !474, line: 172, baseType: !26, size: 64, offset: 128)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !650, file: !474, line: 174, baseType: !656, size: 64, offset: 192)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !598, line: 49, size: 1984, elements: !658)
!658 = !{!659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !657, file: !598, line: 50, baseType: !21, size: 960)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !657, file: !598, line: 52, baseType: !82, size: 128, offset: 960)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !657, file: !598, line: 53, baseType: !82, size: 128, offset: 1088)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !657, file: !598, line: 54, baseType: !82, size: 128, offset: 1216)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !657, file: !598, line: 55, baseType: !82, size: 128, offset: 1344)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !657, file: !598, line: 57, baseType: !280, size: 64, offset: 1472)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "newscene", scope: !657, file: !598, line: 58, baseType: !280, size: 64, offset: 1536)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "redraws_flag", scope: !657, file: !598, line: 60, baseType: !57, size: 32, offset: 1600)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !657, file: !598, line: 61, baseType: !57, size: 32, offset: 1632)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !657, file: !598, line: 63, baseType: !55, size: 16, offset: 1664)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !657, file: !598, line: 64, baseType: !55, size: 16, offset: 1680)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "winid", scope: !657, file: !598, line: 65, baseType: !55, size: 16, offset: 1696)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw", scope: !657, file: !598, line: 66, baseType: !55, size: 16, offset: 1712)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "do_refresh", scope: !657, file: !598, line: 67, baseType: !55, size: 16, offset: 1728)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw_gesture", scope: !657, file: !598, line: 68, baseType: !55, size: 16, offset: 1744)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw_paintcursor", scope: !657, file: !598, line: 69, baseType: !55, size: 16, offset: 1760)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw_drag", scope: !657, file: !598, line: 70, baseType: !55, size: 16, offset: 1776)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !657, file: !598, line: 71, baseType: !55, size: 16, offset: 1792)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "mainwin", scope: !657, file: !598, line: 73, baseType: !55, size: 16, offset: 1808)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "subwinactive", scope: !657, file: !598, line: 74, baseType: !55, size: 16, offset: 1824)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !657, file: !598, line: 76, baseType: !55, size: 16, offset: 1840)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "animtimer", scope: !657, file: !598, line: 78, baseType: !642, size: 64, offset: 1856)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !657, file: !598, line: 79, baseType: !26, size: 64, offset: 1920)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "newscreen", scope: !650, file: !474, line: 175, baseType: !656, size: 64, offset: 256)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "screenname", scope: !650, file: !474, line: 176, baseType: !72, size: 512, offset: 320)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "posx", scope: !650, file: !474, line: 178, baseType: !55, size: 16, offset: 832)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "posy", scope: !650, file: !474, line: 178, baseType: !55, size: 16, offset: 848)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !650, file: !474, line: 178, baseType: !55, size: 16, offset: 864)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !650, file: !474, line: 178, baseType: !55, size: 16, offset: 880)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "windowstate", scope: !650, file: !474, line: 179, baseType: !55, size: 16, offset: 896)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !650, file: !474, line: 180, baseType: !55, size: 16, offset: 912)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !650, file: !474, line: 181, baseType: !55, size: 16, offset: 928)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !650, file: !474, line: 182, baseType: !55, size: 16, offset: 944)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "lastcursor", scope: !650, file: !474, line: 183, baseType: !55, size: 16, offset: 960)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "modalcursor", scope: !650, file: !474, line: 184, baseType: !55, size: 16, offset: 976)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "grabcursor", scope: !650, file: !474, line: 185, baseType: !55, size: 16, offset: 992)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "addmousemove", scope: !650, file: !474, line: 186, baseType: !55, size: 16, offset: 1008)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "winid", scope: !650, file: !474, line: 188, baseType: !57, size: 32, offset: 1024)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "lock_pie_event", scope: !650, file: !474, line: 190, baseType: !55, size: 16, offset: 1056)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "last_pie_event", scope: !650, file: !474, line: 191, baseType: !55, size: 16, offset: 1072)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "eventstate", scope: !650, file: !474, line: 194, baseType: !700, size: 64, offset: 1088)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmEvent", file: !644, line: 421, size: 960, elements: !702)
!702 = !{!703, !704, !705, !706, !707, !708, !709, !711, !715, !716, !717, !718, !719, !720, !721, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !740, !741, !742, !743}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !701, file: !644, line: 422, baseType: !700, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !701, file: !644, line: 422, baseType: !700, size: 64, offset: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !701, file: !644, line: 424, baseType: !55, size: 16, offset: 128)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !701, file: !644, line: 425, baseType: !55, size: 16, offset: 144)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !701, file: !644, line: 426, baseType: !57, size: 32, offset: 160)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !701, file: !644, line: 426, baseType: !57, size: 32, offset: 192)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "mval", scope: !701, file: !644, line: 427, baseType: !710, size: 64, offset: 224)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 64, elements: !142)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_buf", scope: !701, file: !644, line: 428, baseType: !712, size: 48, offset: 288)
!712 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 48, elements: !713)
!713 = !{!714}
!714 = !DISubrange(count: 6)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !701, file: !644, line: 431, baseType: !42, size: 8, offset: 336)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !701, file: !644, line: 432, baseType: !42, size: 8, offset: 344)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "prevtype", scope: !701, file: !644, line: 435, baseType: !55, size: 16, offset: 352)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "prevval", scope: !701, file: !644, line: 436, baseType: !55, size: 16, offset: 368)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "prevx", scope: !701, file: !644, line: 437, baseType: !57, size: 32, offset: 384)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "prevy", scope: !701, file: !644, line: 437, baseType: !57, size: 32, offset: 416)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicktime", scope: !701, file: !644, line: 438, baseType: !722, size: 64, offset: 448)
!722 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "prevclickx", scope: !701, file: !644, line: 439, baseType: !57, size: 32, offset: 512)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicky", scope: !701, file: !644, line: 439, baseType: !57, size: 32, offset: 544)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !701, file: !644, line: 442, baseType: !55, size: 16, offset: 576)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !701, file: !644, line: 442, baseType: !55, size: 16, offset: 592)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !701, file: !644, line: 442, baseType: !55, size: 16, offset: 608)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "oskey", scope: !701, file: !644, line: 442, baseType: !55, size: 16, offset: 624)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "keymodifier", scope: !701, file: !644, line: 443, baseType: !55, size: 16, offset: 640)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "check_click", scope: !701, file: !644, line: 446, baseType: !55, size: 16, offset: 656)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "keymap_idname", scope: !701, file: !644, line: 449, baseType: !486, size: 64, offset: 704)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "tablet_data", scope: !701, file: !644, line: 452, baseType: !733, size: 64, offset: 768)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTabletData", file: !644, line: 463, size: 128, elements: !735)
!735 = !{!736, !737, !738, !739}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "Active", scope: !734, file: !644, line: 464, baseType: !57, size: 32)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "Pressure", scope: !734, file: !644, line: 465, baseType: !153, size: 32, offset: 32)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "Xtilt", scope: !734, file: !644, line: 466, baseType: !153, size: 32, offset: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "Ytilt", scope: !734, file: !644, line: 467, baseType: !153, size: 32, offset: 96)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "custom", scope: !701, file: !644, line: 455, baseType: !55, size: 16, offset: 832)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "customdatafree", scope: !701, file: !644, line: 456, baseType: !55, size: 16, offset: 848)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !701, file: !644, line: 457, baseType: !57, size: 32, offset: 864)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !701, file: !644, line: 458, baseType: !26, size: 64, offset: 896)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "curswin", scope: !650, file: !474, line: 196, baseType: !745, size: 64, offset: 1152)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmSubWindow", file: !474, line: 55, flags: DIFlagFwdDecl)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "tweak", scope: !650, file: !474, line: 198, baseType: !748, size: 64, offset: 1216)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmGesture", file: !644, line: 398, size: 448, elements: !750)
!750 = !{!751, !752, !753, !754, !755, !756, !757, !758, !759, !760}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !749, file: !644, line: 399, baseType: !748, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !749, file: !644, line: 399, baseType: !748, size: 64, offset: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !749, file: !644, line: 400, baseType: !57, size: 32, offset: 128)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !749, file: !644, line: 401, baseType: !57, size: 32, offset: 160)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !749, file: !644, line: 402, baseType: !57, size: 32, offset: 192)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "swinid", scope: !749, file: !644, line: 403, baseType: !57, size: 32, offset: 224)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !749, file: !644, line: 404, baseType: !57, size: 32, offset: 256)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !749, file: !644, line: 405, baseType: !57, size: 32, offset: 288)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !749, file: !644, line: 407, baseType: !26, size: 64, offset: 320)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !749, file: !644, line: 414, baseType: !26, size: 64, offset: 384)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "drawmethod", scope: !650, file: !474, line: 200, baseType: !57, size: 32, offset: 1280)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "drawfail", scope: !650, file: !474, line: 200, baseType: !57, size: 32, offset: 1312)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "drawdata", scope: !650, file: !474, line: 201, baseType: !26, size: 64, offset: 1344)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !650, file: !474, line: 203, baseType: !82, size: 128, offset: 1408)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !650, file: !474, line: 204, baseType: !82, size: 128, offset: 1536)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "modalhandlers", scope: !650, file: !474, line: 205, baseType: !82, size: 128, offset: 1664)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "subwindows", scope: !650, file: !474, line: 207, baseType: !82, size: 128, offset: 1792)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "gesture", scope: !650, file: !474, line: 208, baseType: !82, size: 128, offset: 1920)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "timestep", scope: !643, file: !644, line: 495, baseType: !722, size: 64, offset: 192)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !643, file: !644, line: 496, baseType: !57, size: 32, offset: 256)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !643, file: !644, line: 497, baseType: !26, size: 64, offset: 320)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !643, file: !644, line: 499, baseType: !722, size: 64, offset: 384)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !643, file: !644, line: 500, baseType: !722, size: 64, offset: 448)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "ltime", scope: !643, file: !644, line: 502, baseType: !722, size: 64, offset: 512)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "ntime", scope: !643, file: !644, line: 503, baseType: !722, size: 64, offset: 576)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !643, file: !644, line: 504, baseType: !722, size: 64, offset: 640)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "sleep", scope: !643, file: !644, line: 505, baseType: !57, size: 32, offset: 704)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "winrct", scope: !597, file: !598, line: 234, baseType: !610, size: 128, offset: 1408)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "drawrct", scope: !597, file: !598, line: 235, baseType: !610, size: 128, offset: 1536)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !597, file: !598, line: 236, baseType: !55, size: 16, offset: 1664)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !597, file: !598, line: 236, baseType: !55, size: 16, offset: 1680)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "swinid", scope: !597, file: !598, line: 238, baseType: !55, size: 16, offset: 1696)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "regiontype", scope: !597, file: !598, line: 239, baseType: !55, size: 16, offset: 1712)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !597, file: !598, line: 240, baseType: !55, size: 16, offset: 1728)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !597, file: !598, line: 241, baseType: !55, size: 16, offset: 1744)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "fsize", scope: !597, file: !598, line: 243, baseType: !153, size: 32, offset: 1760)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !597, file: !598, line: 244, baseType: !55, size: 16, offset: 1792)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !597, file: !598, line: 244, baseType: !55, size: 16, offset: 1808)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw", scope: !597, file: !598, line: 246, baseType: !55, size: 16, offset: 1824)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw_overlay", scope: !597, file: !598, line: 247, baseType: !55, size: 16, offset: 1840)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !597, file: !598, line: 248, baseType: !55, size: 16, offset: 1856)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "overlap", scope: !597, file: !598, line: 249, baseType: !55, size: 16, offset: 1872)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "flagfullscreen", scope: !597, file: !598, line: 250, baseType: !55, size: 16, offset: 1888)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !597, file: !598, line: 251, baseType: !55, size: 16, offset: 1904)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !597, file: !598, line: 253, baseType: !796, size: 64, offset: 1920)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DICompositeType(tag: DW_TAG_structure_type, name: "ARegionType", file: !598, line: 42, flags: DIFlagFwdDecl)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "uiblocks", scope: !597, file: !598, line: 255, baseType: !82, size: 128, offset: 1984)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "panels", scope: !597, file: !598, line: 256, baseType: !82, size: 128, offset: 2112)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "panels_category_active", scope: !597, file: !598, line: 257, baseType: !82, size: 128, offset: 2240)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "ui_lists", scope: !597, file: !598, line: 258, baseType: !82, size: 128, offset: 2368)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "ui_previews", scope: !597, file: !598, line: 259, baseType: !82, size: 128, offset: 2496)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !597, file: !598, line: 260, baseType: !82, size: 128, offset: 2624)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "panels_category", scope: !597, file: !598, line: 261, baseType: !82, size: 128, offset: 2752)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "regiontimer", scope: !597, file: !598, line: 263, baseType: !642, size: 64, offset: 2880)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "headerstr", scope: !597, file: !598, line: 265, baseType: !807, size: 64, offset: 2944)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "regiondata", scope: !597, file: !598, line: 266, baseType: !26, size: 64, offset: 3008)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceNode", file: !811, line: 925, size: 3200, elements: !812)
!811 = !DIFile(filename: "blender/source/blender/makesdna/DNA_space_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!812 = !{!813, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !810, file: !811, line: 926, baseType: !814, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceLink", file: !811, line: 91, baseType: !816)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !811, line: 85, size: 448, elements: !817)
!817 = !{!818, !820, !821, !822, !823, !824}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !816, file: !811, line: 86, baseType: !819, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !816, file: !811, line: 86, baseType: !819, size: 64, offset: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !816, file: !811, line: 87, baseType: !82, size: 128, offset: 128)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !816, file: !811, line: 88, baseType: !57, size: 32, offset: 256)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !816, file: !811, line: 89, baseType: !153, size: 32, offset: 288)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !816, file: !811, line: 90, baseType: !825, size: 128, offset: 320)
!825 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 128, elements: !116)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !810, file: !811, line: 926, baseType: !814, size: 64, offset: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !810, file: !811, line: 927, baseType: !82, size: 128, offset: 128)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !810, file: !811, line: 928, baseType: !57, size: 32, offset: 256)
