; ModuleID = 'blender/source/blender/blenkernel/intern/shrinkwrap.c'
source_filename = "blender/source/blender/blenkernel/intern/shrinkwrap.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.SpaceTransform = type { [4 x [4 x float]], [4 x [4 x float]] }
%struct.BVHTree = type opaque
%struct.BVHTreeRayHit = type { i32, [3 x float], [3 x float], float, i32 }
%struct.BVHTreeRay = type { [3 x float], [3 x float], float }
%struct.ShrinkwrapModifierData = type { %struct.ModifierData, %struct.Object*, %struct.Object*, [64 x i8], float, i16, i8, i8, float, i8, i8, [2 x i8] }
%struct.ModifierData = type { %struct.ModifierData*, %struct.ModifierData*, i32, i32, i32, i32, [64 x i8], %struct.Scene*, i8* }
%struct.Scene = type opaque

!76 = !DIEnumerator(name: "CD_GRID_PAINT_MASK", value: 35, isUnsigned: true)
!77 = !DIEnumerator(name: "CD_MVERT_SKIN", value: 36, isUnsigned: true)
!78 = !DIEnumerator(name: "CD_FREESTYLE_EDGE", value: 37, isUnsigned: true)
!79 = !DIEnumerator(name: "CD_FREESTYLE_FACE", value: 38, isUnsigned: true)
!80 = !DIEnumerator(name: "CD_MLOOPTANGENT", value: 39, isUnsigned: true)
!81 = !DIEnumerator(name: "CD_TESSLOOPNORMAL", value: 40, isUnsigned: true)
!82 = !DIEnumerator(name: "CD_NUMTYPES", value: 41, isUnsigned: true)
!83 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !84, line: 339, baseType: !5, size: 32, elements: !85)
!84 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!85 = !{!86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96}
!86 = !DIEnumerator(name: "OB_EMPTY", value: 0, isUnsigned: true)
!87 = !DIEnumerator(name: "OB_MESH", value: 1, isUnsigned: true)
!88 = !DIEnumerator(name: "OB_CURVE", value: 2, isUnsigned: true)
!89 = !DIEnumerator(name: "OB_SURF", value: 3, isUnsigned: true)
!90 = !DIEnumerator(name: "OB_FONT", value: 4, isUnsigned: true)
!91 = !DIEnumerator(name: "OB_MBALL", value: 5, isUnsigned: true)
!92 = !DIEnumerator(name: "OB_LAMP", value: 10, isUnsigned: true)
!93 = !DIEnumerator(name: "OB_CAMERA", value: 11, isUnsigned: true)
!94 = !DIEnumerator(name: "OB_SPEAKER", value: 12, isUnsigned: true)
!95 = !DIEnumerator(name: "OB_LATTICE", value: 22, isUnsigned: true)
!96 = !DIEnumerator(name: "OB_ARMATURE", value: 25, isUnsigned: true)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 758, baseType: !5, size: 32, elements: !98)
!98 = !{!99, !100, !101}
!99 = !DIEnumerator(name: "MOD_SHRINKWRAP_NEAREST_SURFACE", value: 0, isUnsigned: true)
!100 = !DIEnumerator(name: "MOD_SHRINKWRAP_PROJECT", value: 1, isUnsigned: true)
!101 = !DIEnumerator(name: "MOD_SHRINKWRAP_NEAREST_VERTEX", value: 2, isUnsigned: true)
!102 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ObjectMode", file: !84, line: 666, baseType: !5, size: 32, elements: !103)
!103 = !{!104, !105, !106, !107, !108, !109, !110, !111}
!104 = !DIEnumerator(name: "OB_MODE_OBJECT", value: 0, isUnsigned: true)
!105 = !DIEnumerator(name: "OB_MODE_EDIT", value: 1, isUnsigned: true)
!106 = !DIEnumerator(name: "OB_MODE_SCULPT", value: 2, isUnsigned: true)
!107 = !DIEnumerator(name: "OB_MODE_VERTEX_PAINT", value: 4, isUnsigned: true)
!108 = !DIEnumerator(name: "OB_MODE_WEIGHT_PAINT", value: 8, isUnsigned: true)
!109 = !DIEnumerator(name: "OB_MODE_TEXTURE_PAINT", value: 16, isUnsigned: true)
!110 = !DIEnumerator(name: "OB_MODE_PARTICLE_EDIT", value: 32, isUnsigned: true)
!111 = !DIEnumerator(name: "OB_MODE_POSE", value: 64, isUnsigned: true)
!112 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !113, line: 58, baseType: !5, size: 32, elements: !114)
!113 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_subsurf.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!114 = !{!115, !116, !117, !118, !119}
!115 = !DIEnumerator(name: "SUBSURF_USE_RENDER_PARAMS", value: 1, isUnsigned: true)
!116 = !DIEnumerator(name: "SUBSURF_IS_FINAL_CALC", value: 2, isUnsigned: true)
!117 = !DIEnumerator(name: "SUBSURF_FOR_EDIT_MODE", value: 4, isUnsigned: true)
!118 = !DIEnumerator(name: "SUBSURF_IN_EDIT_MODE", value: 8, isUnsigned: true)
!119 = !DIEnumerator(name: "SUBSURF_ALLOC_PAINT_MASK", value: 16, isUnsigned: true)
!120 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 780, baseType: !5, size: 32, elements: !121)
!121 = !{!122, !123, !124, !125}
!122 = !DIEnumerator(name: "MOD_SHRINKWRAP_PROJECT_OVER_NORMAL", value: 0, isUnsigned: true)
!123 = !DIEnumerator(name: "MOD_SHRINKWRAP_PROJECT_OVER_X_AXIS", value: 1, isUnsigned: true)
!124 = !DIEnumerator(name: "MOD_SHRINKWRAP_PROJECT_OVER_Y_AXIS", value: 2, isUnsigned: true)
!125 = !DIEnumerator(name: "MOD_SHRINKWRAP_PROJECT_OVER_Z_AXIS", value: 4, isUnsigned: true)
!126 = !{!127}
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!128 = !{i32 7, !"Dwarf Version", i32 4}
!129 = !{i32 2, !"Debug Info Version", i32 3}
!130 = !{i32 1, !"wchar_size", i32 4}
!131 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!132 = distinct !DISubprogram(name: "BKE_shrinkwrap_project_normal", scope: !1, file: !1, line: 155, type: !133, scopeLine: 160, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !180)
!133 = !DISubroutineType(types: !134)
!134 = !{!135, !136, !137, !137, !140, !151, !155, !168, !127}
!135 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!136 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !139)
!139 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceTransform", file: !143, line: 247, baseType: !144)
!143 = !DIFile(filename: "blender/source/blender/blenlib/BLI_math_matrix.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceTransform", file: !143, line: 243, size: 1024, elements: !145)
!145 = !{!146, !150}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "local2target", scope: !144, file: !143, line: 244, baseType: !147, size: 512)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 512, elements: !148)
!148 = !{!149, !149}
!149 = !DISubrange(count: 4)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "target2local", scope: !144, file: !143, line: 245, baseType: !147, size: 512, offset: 512)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHTree", file: !153, line: 43, baseType: !154)
!153 = !DIFile(filename: "blender/source/blender/blenlib/BLI_kdopbvh.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "BVHTree", file: !4, line: 583, flags: DIFlagFwdDecl)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHTreeRayHit", file: !153, line: 73, baseType: !157)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BVHTreeRayHit", file: !153, line: 67, size: 288, elements: !158)
!158 = !{!159, !161, !165, !166, !167}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !157, file: !153, line: 68, baseType: !160, size: 32)
!160 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !157, file: !153, line: 69, baseType: !162, size: 96, offset: 32)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 96, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 3)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !157, file: !153, line: 70, baseType: !162, size: 96, offset: 128)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !157, file: !153, line: 71, baseType: !139, size: 32, offset: 224)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !157, file: !153, line: 72, baseType: !160, size: 32, offset: 256)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHTree_RayCastCallback", file: !153, line: 79, baseType: !169)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{null, !127, !160, !172, !155}
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !174)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHTreeRay", file: !153, line: 65, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BVHTreeRay", file: !153, line: 61, size: 224, elements: !176)
!176 = !{!177, !178, !179}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !175, file: !153, line: 62, baseType: !162, size: 96)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !175, file: !153, line: 63, baseType: !162, size: 96, offset: 96)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !175, file: !153, line: 64, baseType: !139, size: 32, offset: 192)
!180 = !{}
!181 = !DILocalVariable(name: "options", arg: 1, scope: !132, file: !1, line: 156, type: !136)
!182 = !DILocation(line: 156, column: 14, scope: !132)
!183 = !DILocalVariable(name: "vert", arg: 2, scope: !132, file: !1, line: 156, type: !137)
!184 = !DILocation(line: 156, column: 35, scope: !132)
!185 = !DILocalVariable(name: "dir", arg: 3, scope: !132, file: !1, line: 157, type: !137)
!186 = !DILocation(line: 157, column: 21, scope: !132)
!187 = !DILocalVariable(name: "transf", arg: 4, scope: !132, file: !1, line: 157, type: !140)
!188 = !DILocation(line: 157, column: 51, scope: !132)
!189 = !DILocalVariable(name: "tree", arg: 5, scope: !132, file: !1, line: 158, type: !151)
!190 = !DILocation(line: 158, column: 18, scope: !132)
!191 = !DILocalVariable(name: "hit", arg: 6, scope: !132, file: !1, line: 158, type: !155)
!192 = !DILocation(line: 158, column: 39, scope: !132)
!193 = !DILocalVariable(name: "callback", arg: 7, scope: !132, file: !1, line: 159, type: !168)
!194 = !DILocation(line: 159, column: 33, scope: !132)
!195 = !DILocalVariable(name: "userdata", arg: 8, scope: !132, file: !1, line: 159, type: !127)
!196 = !DILocation(line: 159, column: 49, scope: !132)
!197 = !DILocalVariable(name: "tmp_co", scope: !132, file: !1, line: 166, type: !162)
!198 = !DILocation(line: 166, column: 8, scope: !132)
!199 = !DILocalVariable(name: "tmp_no", scope: !132, file: !1, line: 166, type: !162)
!200 = !DILocation(line: 166, column: 19, scope: !132)
!201 = !DILocalVariable(name: "co", scope: !132, file: !1, line: 167, type: !137)
!202 = !DILocation(line: 167, column: 15, scope: !132)
!203 = !DILocalVariable(name: "no", scope: !132, file: !1, line: 167, type: !137)
!204 = !DILocation(line: 167, column: 20, scope: !132)
!205 = !DILocalVariable(name: "hit_tmp", scope: !132, file: !1, line: 168, type: !156)
!206 = !DILocation(line: 168, column: 16, scope: !132)
!207 = !DILocation(line: 171, column: 2, scope: !132)
!208 = !DILocation(line: 171, column: 19, scope: !132)
!209 = !DILocation(line: 174, column: 6, scope: !210)
!210 = distinct !DILexicalBlock(scope: !132, file: !1, line: 174, column: 6)
!211 = !DILocation(line: 174, column: 6, scope: !132)
!212 = !DILocation(line: 175, column: 14, scope: !213)
!213 = distinct !DILexicalBlock(scope: !210, file: !1, line: 174, column: 14)
!214 = !DILocation(line: 175, column: 22, scope: !213)
!215 = !DILocation(line: 175, column: 3, scope: !213)
!216 = !DILocation(line: 176, column: 29, scope: !213)
!217 = !DILocation(line: 176, column: 37, scope: !213)
!218 = !DILocation(line: 176, column: 3, scope: !213)
!219 = !DILocation(line: 177, column: 8, scope: !213)
!220 = !DILocation(line: 177, column: 6, scope: !213)
!221 = !DILocation(line: 179, column: 14, scope: !213)
!222 = !DILocation(line: 179, column: 22, scope: !213)
!223 = !DILocation(line: 179, column: 3, scope: !213)
!224 = !DILocation(line: 180, column: 36, scope: !213)
!225 = !DILocation(line: 180, column: 44, scope: !213)
!226 = !DILocation(line: 180, column: 3, scope: !213)
!227 = !DILocation(line: 181, column: 8, scope: !213)
!228 = !DILocation(line: 181, column: 6, scope: !213)
!229 = !DILocation(line: 186, column: 2, scope: !213)
!230 = !DILocation(line: 188, column: 8, scope: !231)
!231 = distinct !DILexicalBlock(scope: !210, file: !1, line: 187, column: 7)
!232 = !DILocation(line: 188, column: 6, scope: !231)
!233 = !DILocation(line: 189, column: 8, scope: !231)
!234 = !DILocation(line: 189, column: 6, scope: !231)
!235 = !DILocation(line: 192, column: 10, scope: !132)
!236 = !DILocation(line: 192, column: 16, scope: !132)
!237 = !DILocation(line: 194, column: 23, scope: !132)
!238 = !DILocation(line: 194, column: 29, scope: !132)
!239 = !DILocation(line: 194, column: 33, scope: !132)
!240 = !DILocation(line: 194, column: 53, scope: !132)
!241 = !DILocation(line: 194, column: 63, scope: !132)
!242 = !DILocation(line: 194, column: 2, scope: !132)
!243 = !DILocation(line: 196, column: 14, scope: !244)
!244 = distinct !DILexicalBlock(scope: !132, file: !1, line: 196, column: 6)
!245 = !DILocation(line: 196, column: 20, scope: !244)
!246 = !DILocation(line: 196, column: 6, scope: !132)
!247 = !DILocation(line: 198, column: 7, scope: !248)
!248 = distinct !DILexicalBlock(scope: !249, file: !1, line: 198, column: 7)
!249 = distinct !DILexicalBlock(scope: !244, file: !1, line: 196, column: 27)
!250 = !DILocation(line: 198, column: 7, scope: !249)
!251 = !DILocation(line: 199, column: 38, scope: !252)
!252 = distinct !DILexicalBlock(scope: !248, file: !1, line: 198, column: 15)
!253 = !DILocation(line: 199, column: 54, scope: !252)
!254 = !DILocation(line: 199, column: 46, scope: !252)
!255 = !DILocation(line: 199, column: 4, scope: !252)
!256 = !DILocation(line: 200, column: 3, scope: !252)
!257 = !DILocation(line: 202, column: 7, scope: !258)
!258 = distinct !DILexicalBlock(scope: !249, file: !1, line: 202, column: 7)
!259 = !DILocation(line: 202, column: 15, scope: !258)
!260 = !DILocation(line: 202, column: 7, scope: !249)
!261 = !DILocalVariable(name: "dot", scope: !262, file: !1, line: 204, type: !138)
!262 = distinct !DILexicalBlock(scope: !258, file: !1, line: 202, column: 95)
!263 = !DILocation(line: 204, column: 16, scope: !262)
!264 = !DILocation(line: 204, column: 31, scope: !262)
!265 = !DILocation(line: 204, column: 44, scope: !262)
!266 = !DILocation(line: 204, column: 36, scope: !262)
!267 = !DILocation(line: 204, column: 22, scope: !262)
!268 = !DILocation(line: 205, column: 10, scope: !269)
!269 = distinct !DILexicalBlock(scope: !262, file: !1, line: 205, column: 8)
!270 = !DILocation(line: 205, column: 18, scope: !269)
!271 = !DILocation(line: 205, column: 58, scope: !269)
!272 = !DILocation(line: 205, column: 61, scope: !269)
!273 = !DILocation(line: 205, column: 65, scope: !269)
!274 = !DILocation(line: 205, column: 74, scope: !269)
!275 = !DILocation(line: 206, column: 10, scope: !269)
!276 = !DILocation(line: 206, column: 18, scope: !269)
!277 = !DILocation(line: 206, column: 58, scope: !269)
!278 = !DILocation(line: 206, column: 61, scope: !269)
!279 = !DILocation(line: 206, column: 65, scope: !269)
!280 = !DILocation(line: 205, column: 8, scope: !262)
!281 = !DILocation(line: 208, column: 5, scope: !282)
!282 = distinct !DILexicalBlock(scope: !269, file: !1, line: 207, column: 4)
!283 = !DILocation(line: 210, column: 3, scope: !262)
!284 = !DILocation(line: 212, column: 7, scope: !285)
!285 = distinct !DILexicalBlock(scope: !249, file: !1, line: 212, column: 7)
!286 = !DILocation(line: 212, column: 7, scope: !249)
!287 = !DILocation(line: 214, column: 31, scope: !288)
!288 = distinct !DILexicalBlock(scope: !285, file: !1, line: 212, column: 15)
!289 = !DILocation(line: 214, column: 47, scope: !288)
!290 = !DILocation(line: 214, column: 39, scope: !288)
!291 = !DILocation(line: 214, column: 4, scope: !288)
!292 = !DILocation(line: 218, column: 3, scope: !288)
!293 = !DILocation(line: 222, column: 10, scope: !249)
!294 = !DILocation(line: 222, column: 3, scope: !249)
!295 = !DILocation(line: 223, column: 3, scope: !249)
!296 = !DILocation(line: 225, column: 2, scope: !132)
!297 = !DILocation(line: 226, column: 1, scope: !132)
!298 = distinct !DISubprogram(name: "copy_v3_v3", scope: !299, file: !299, line: 64, type: !300, scopeLine: 65, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !180)
!299 = !DIFile(filename: "blender/source/blender/blenlib/intern/math_vector_inline.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!300 = !DISubroutineType(types: !301)
!301 = !{null, !302, !137}
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!303 = !DILocalVariable(name: "r", arg: 1, scope: !298, file: !299, line: 64, type: !302)
!304 = !DILocation(line: 64, column: 31, scope: !298)
!305 = !DILocalVariable(name: "a", arg: 2, scope: !298, file: !299, line: 64, type: !137)
!306 = !DILocation(line: 64, column: 49, scope: !298)
!307 = !DILocation(line: 66, column: 9, scope: !298)
!308 = !DILocation(line: 66, column: 2, scope: !298)
!309 = !DILocation(line: 66, column: 7, scope: !298)
!310 = !DILocation(line: 67, column: 9, scope: !298)
!311 = !DILocation(line: 67, column: 2, scope: !298)
!312 = !DILocation(line: 67, column: 7, scope: !298)
!313 = !DILocation(line: 68, column: 9, scope: !298)
!314 = !DILocation(line: 68, column: 2, scope: !298)
!315 = !DILocation(line: 68, column: 7, scope: !298)
!316 = !DILocation(line: 69, column: 1, scope: !298)
!317 = distinct !DISubprogram(name: "dot_v3v3", scope: !299, file: !299, line: 619, type: !318, scopeLine: 620, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !180)
!318 = !DISubroutineType(types: !319)
!319 = !{!139, !137, !137}
!320 = !DILocalVariable(name: "a", arg: 1, scope: !317, file: !299, line: 619, type: !137)
!321 = !DILocation(line: 619, column: 36, scope: !317)
!322 = !DILocalVariable(name: "b", arg: 2, scope: !317, file: !299, line: 619, type: !137)
!323 = !DILocation(line: 619, column: 54, scope: !317)
!324 = !DILocation(line: 621, column: 9, scope: !317)
!325 = !DILocation(line: 621, column: 16, scope: !317)
!326 = !DILocation(line: 621, column: 14, scope: !317)
!327 = !DILocation(line: 621, column: 23, scope: !317)
!328 = !DILocation(line: 621, column: 30, scope: !317)
!329 = !DILocation(line: 621, column: 28, scope: !317)
!330 = !DILocation(line: 621, column: 21, scope: !317)
!331 = !DILocation(line: 621, column: 37, scope: !317)
!332 = !DILocation(line: 621, column: 44, scope: !317)
!333 = !DILocation(line: 621, column: 42, scope: !317)
!334 = !DILocation(line: 621, column: 35, scope: !317)
!335 = !DILocation(line: 621, column: 2, scope: !317)
!336 = distinct !DISubprogram(name: "shrinkwrapModifier_deform", scope: !1, file: !1, line: 456, type: !337, scopeLine: 458, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !180)
!337 = !DISubroutineType(types: !338)
!338 = !{null, !339, !1202, !726, !955, !160, !135}
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "ShrinkwrapModifierData", file: !4, line: 755, baseType: !341)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ShrinkwrapModifierData", file: !4, line: 736, size: 1664, elements: !342)
!342 = !{!343, !364, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !341, file: !4, line: 737, baseType: !344, size: 896)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierData", file: !4, line: 110, baseType: !345)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierData", file: !4, line: 99, size: 896, elements: !346)
!346 = !{!347, !349, !350, !351, !352, !353, !354, !358, !362}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !345, file: !4, line: 100, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !345, file: !4, line: 100, baseType: !348, size: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !345, file: !4, line: 102, baseType: !160, size: 32, offset: 128)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !345, file: !4, line: 102, baseType: !160, size: 32, offset: 160)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "stackindex", scope: !345, file: !4, line: 103, baseType: !160, size: 32, offset: 192)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !345, file: !4, line: 103, baseType: !160, size: 32, offset: 224)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !345, file: !4, line: 104, baseType: !355, size: 512, offset: 256)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 512, elements: !356)
!356 = !{!357}
!357 = !DISubrange(count: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !345, file: !4, line: 107, baseType: !359, size: 64, offset: 768)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !361, line: 40, flags: DIFlagFwdDecl)
!361 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!362 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !345, file: !4, line: 109, baseType: !363, size: 64, offset: 832)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !341, file: !4, line: 739, baseType: !365, size: 64, offset: 896)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !84, line: 115, size: 11392, elements: !367)
!367 = !{!368, !434, !438, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !455, !465, !479, !480, !521, !522, !525, !526, !542, !543, !544, !545, !546, !547, !548, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !629, !630, !631, !632, !633, !634, !635, !636, !637, !640, !643, !646, !647, !648, !649, !650, !653, !656, !1138, !1139, !1145, !1146, !1147, !1148, !1149, !1150, !1152, !1155, !1158, !1160, !1179, !1180}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !366, file: !84, line: 116, baseType: !369, size: 960)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !370, line: 130, baseType: !371)
!370 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !370, line: 117, size: 960, elements: !372)
!372 = !{!373, !374, !375, !377, !396, !400, !402, !403, !404, !405}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !371, file: !370, line: 118, baseType: !127, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !371, file: !370, line: 118, baseType: !127, size: 64, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !371, file: !370, line: 119, baseType: !376, size: 64, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !371, file: !370, line: 120, baseType: !378, size: 64, offset: 192)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !370, line: 136, size: 17600, elements: !380)
!380 = !{!381, !382, !384, !387, !391, !392, !393}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !379, file: !370, line: 137, baseType: !369, size: 960)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !379, file: !370, line: 138, baseType: !383, size: 64, offset: 960)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !379, file: !370, line: 139, baseType: !385, size: 64, offset: 1024)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !370, line: 43, flags: DIFlagFwdDecl)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !379, file: !370, line: 140, baseType: !388, size: 8192, offset: 1088)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 8192, elements: !389)
!389 = !{!390}
!390 = !DISubrange(count: 1024)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !379, file: !370, line: 141, baseType: !388, size: 8192, offset: 9280)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !379, file: !370, line: 148, baseType: !378, size: 64, offset: 17472)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !379, file: !370, line: 150, baseType: !394, size: 64, offset: 17536)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !370, line: 45, flags: DIFlagFwdDecl)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !371, file: !370, line: 121, baseType: !397, size: 528, offset: 256)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 528, elements: !398)
!398 = !{!399}
!399 = !DISubrange(count: 66)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !371, file: !370, line: 126, baseType: !401, size: 16, offset: 784)
!401 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !371, file: !370, line: 127, baseType: !160, size: 32, offset: 800)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !371, file: !370, line: 128, baseType: !160, size: 32, offset: 832)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !371, file: !370, line: 128, baseType: !160, size: 32, offset: 864)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !371, file: !370, line: 129, baseType: !406, size: 64, offset: 896)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !370, line: 75, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !370, line: 62, size: 1024, elements: !409)
!409 = !{!410, !412, !413, !414, !415, !416, !417, !418, !432, !433}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !408, file: !370, line: 63, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !408, file: !370, line: 63, baseType: !411, size: 64, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !408, file: !370, line: 64, baseType: !136, size: 8, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !408, file: !370, line: 64, baseType: !136, size: 8, offset: 136)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !408, file: !370, line: 65, baseType: !401, size: 16, offset: 144)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !408, file: !370, line: 66, baseType: !355, size: 512, offset: 160)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !408, file: !370, line: 67, baseType: !160, size: 32, offset: 672)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !408, file: !370, line: 69, baseType: !419, size: 256, offset: 704)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !370, line: 60, baseType: !420)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !370, line: 48, size: 256, elements: !421)
!421 = !{!422, !423, !430, !431}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !420, file: !370, line: 49, baseType: !127, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !420, file: !370, line: 58, baseType: !424, size: 128, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !425, line: 71, baseType: !426)
!425 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !425, line: 69, size: 128, elements: !427)
!427 = !{!428, !429}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !426, file: !425, line: 70, baseType: !127, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !426, file: !425, line: 70, baseType: !127, size: 64, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !420, file: !370, line: 59, baseType: !160, size: 32, offset: 192)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !420, file: !370, line: 59, baseType: !160, size: 32, offset: 224)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !408, file: !370, line: 70, baseType: !160, size: 32, offset: 960)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !408, file: !370, line: 74, baseType: !160, size: 32, offset: 992)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !366, file: !84, line: 117, baseType: !435, size: 64, offset: 960)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !437, line: 45, flags: DIFlagFwdDecl)
!437 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!438 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !366, file: !84, line: 119, baseType: !439, size: 64, offset: 1024)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !84, line: 57, flags: DIFlagFwdDecl)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !366, file: !84, line: 121, baseType: !401, size: 16, offset: 1088)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !366, file: !84, line: 121, baseType: !401, size: 16, offset: 1104)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !366, file: !84, line: 122, baseType: !160, size: 32, offset: 1120)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !366, file: !84, line: 122, baseType: !160, size: 32, offset: 1152)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !366, file: !84, line: 122, baseType: !160, size: 32, offset: 1184)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !366, file: !84, line: 123, baseType: !355, size: 512, offset: 1216)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !366, file: !84, line: 124, baseType: !365, size: 64, offset: 1728)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !366, file: !84, line: 124, baseType: !365, size: 64, offset: 1792)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !366, file: !84, line: 127, baseType: !365, size: 64, offset: 1856)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !366, file: !84, line: 127, baseType: !365, size: 64, offset: 1920)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !366, file: !84, line: 127, baseType: !365, size: 64, offset: 1984)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !366, file: !84, line: 128, baseType: !453, size: 64, offset: 2048)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !437, line: 46, flags: DIFlagFwdDecl)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !366, file: !84, line: 130, baseType: !456, size: 64, offset: 2112)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !84, line: 97, size: 832, elements: !458)
!458 = !{!459, !463, !464}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !457, file: !84, line: 98, baseType: !460, size: 768)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 768, elements: !461)
!461 = !{!462, !164}
!462 = !DISubrange(count: 8)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !457, file: !84, line: 99, baseType: !160, size: 32, offset: 768)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !457, file: !84, line: 99, baseType: !160, size: 32, offset: 800)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !366, file: !84, line: 131, baseType: !466, size: 64, offset: 2176)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !468, line: 486, size: 1600, elements: !469)
!468 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!469 = !{!470, !471, !472, !473, !474, !475, !476, !477, !478}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !467, file: !468, line: 487, baseType: !369, size: 960)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !467, file: !468, line: 489, baseType: !424, size: 128, offset: 960)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !467, file: !468, line: 490, baseType: !424, size: 128, offset: 1088)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !467, file: !468, line: 491, baseType: !424, size: 128, offset: 1216)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !467, file: !468, line: 492, baseType: !424, size: 128, offset: 1344)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !467, file: !468, line: 494, baseType: !160, size: 32, offset: 1472)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !467, file: !468, line: 495, baseType: !160, size: 32, offset: 1504)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !467, file: !468, line: 497, baseType: !160, size: 32, offset: 1536)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !467, file: !468, line: 498, baseType: !160, size: 32, offset: 1568)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !366, file: !84, line: 132, baseType: !466, size: 64, offset: 2240)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !366, file: !84, line: 133, baseType: !481, size: 64, offset: 2304)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !468, line: 334, size: 1728, elements: !483)
!483 = !{!484, !485, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !520}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !482, file: !468, line: 335, baseType: !424, size: 128)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !482, file: !468, line: 336, baseType: !486, size: 64, offset: 128)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !468, line: 47, flags: DIFlagFwdDecl)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !482, file: !468, line: 338, baseType: !401, size: 16, offset: 192)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !482, file: !468, line: 338, baseType: !401, size: 16, offset: 208)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !482, file: !468, line: 339, baseType: !5, size: 32, offset: 224)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !482, file: !468, line: 340, baseType: !160, size: 32, offset: 256)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !482, file: !468, line: 342, baseType: !139, size: 32, offset: 288)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !482, file: !468, line: 343, baseType: !162, size: 96, offset: 320)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !482, file: !468, line: 344, baseType: !162, size: 96, offset: 416)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !482, file: !468, line: 347, baseType: !424, size: 128, offset: 512)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !482, file: !468, line: 349, baseType: !160, size: 32, offset: 640)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !482, file: !468, line: 350, baseType: !160, size: 32, offset: 672)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !482, file: !468, line: 351, baseType: !127, size: 64, offset: 704)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !482, file: !468, line: 352, baseType: !127, size: 64, offset: 768)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !482, file: !468, line: 354, baseType: !501, size: 384, offset: 832)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !468, line: 116, baseType: !502)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !468, line: 94, size: 384, elements: !503)
!503 = !{!504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !502, file: !468, line: 96, baseType: !160, size: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !502, file: !468, line: 96, baseType: !160, size: 32, offset: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !502, file: !468, line: 97, baseType: !160, size: 32, offset: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !502, file: !468, line: 97, baseType: !160, size: 32, offset: 96)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !502, file: !468, line: 99, baseType: !401, size: 16, offset: 128)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !502, file: !468, line: 100, baseType: !401, size: 16, offset: 144)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !502, file: !468, line: 102, baseType: !401, size: 16, offset: 160)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !502, file: !468, line: 105, baseType: !401, size: 16, offset: 176)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !502, file: !468, line: 108, baseType: !401, size: 16, offset: 192)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !502, file: !468, line: 109, baseType: !401, size: 16, offset: 208)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !502, file: !468, line: 111, baseType: !401, size: 16, offset: 224)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !502, file: !468, line: 112, baseType: !401, size: 16, offset: 240)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !502, file: !468, line: 114, baseType: !160, size: 32, offset: 256)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !502, file: !468, line: 114, baseType: !160, size: 32, offset: 288)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !502, file: !468, line: 115, baseType: !160, size: 32, offset: 320)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !502, file: !468, line: 115, baseType: !160, size: 32, offset: 352)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !482, file: !468, line: 355, baseType: !355, size: 512, offset: 1216)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !366, file: !84, line: 134, baseType: !127, size: 64, offset: 2368)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !366, file: !84, line: 136, baseType: !523, size: 64, offset: 2432)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !84, line: 58, flags: DIFlagFwdDecl)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !366, file: !84, line: 138, baseType: !501, size: 384, offset: 2496)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !366, file: !84, line: 139, baseType: !527, size: 64, offset: 2880)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !468, line: 80, baseType: !529)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !468, line: 72, size: 192, elements: !530)
!530 = !{!531, !538, !539, !540, !541}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !529, file: !468, line: 73, baseType: !532, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !468, line: 59, baseType: !534)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !468, line: 56, size: 128, elements: !535)
!535 = !{!536, !537}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !534, file: !468, line: 57, baseType: !162, size: 96)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !534, file: !468, line: 58, baseType: !160, size: 32, offset: 96)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !529, file: !468, line: 74, baseType: !160, size: 32, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !529, file: !468, line: 76, baseType: !160, size: 32, offset: 96)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !529, file: !468, line: 77, baseType: !160, size: 32, offset: 128)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !529, file: !468, line: 79, baseType: !160, size: 32, offset: 160)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !366, file: !84, line: 141, baseType: !424, size: 128, offset: 2944)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !366, file: !84, line: 142, baseType: !424, size: 128, offset: 3072)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !366, file: !84, line: 143, baseType: !424, size: 128, offset: 3200)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !366, file: !84, line: 144, baseType: !424, size: 128, offset: 3328)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !366, file: !84, line: 146, baseType: !160, size: 32, offset: 3456)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !366, file: !84, line: 147, baseType: !160, size: 32, offset: 3488)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !366, file: !84, line: 150, baseType: !549, size: 64, offset: 3520)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !84, line: 50, flags: DIFlagFwdDecl)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !366, file: !84, line: 151, baseType: !363, size: 64, offset: 3584)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !366, file: !84, line: 152, baseType: !160, size: 32, offset: 3648)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !366, file: !84, line: 153, baseType: !160, size: 32, offset: 3680)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !366, file: !84, line: 156, baseType: !162, size: 96, offset: 3712)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !366, file: !84, line: 156, baseType: !162, size: 96, offset: 3808)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !366, file: !84, line: 156, baseType: !162, size: 96, offset: 3904)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !366, file: !84, line: 157, baseType: !162, size: 96, offset: 4000)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !366, file: !84, line: 158, baseType: !162, size: 96, offset: 4096)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !366, file: !84, line: 159, baseType: !162, size: 96, offset: 4192)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !366, file: !84, line: 160, baseType: !162, size: 96, offset: 4288)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !366, file: !84, line: 160, baseType: !162, size: 96, offset: 4384)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !366, file: !84, line: 161, baseType: !564, size: 128, offset: 4480)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 128, elements: !565)
!565 = !{!149}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !366, file: !84, line: 161, baseType: !564, size: 128, offset: 4608)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !366, file: !84, line: 162, baseType: !162, size: 96, offset: 4736)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !366, file: !84, line: 162, baseType: !162, size: 96, offset: 4832)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !366, file: !84, line: 163, baseType: !139, size: 32, offset: 4928)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !366, file: !84, line: 163, baseType: !139, size: 32, offset: 4960)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !366, file: !84, line: 164, baseType: !147, size: 512, offset: 4992)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !366, file: !84, line: 165, baseType: !147, size: 512, offset: 5504)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !366, file: !84, line: 166, baseType: !147, size: 512, offset: 6016)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !366, file: !84, line: 167, baseType: !147, size: 512, offset: 6528)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !366, file: !84, line: 176, baseType: !147, size: 512, offset: 7040)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !366, file: !84, line: 178, baseType: !5, size: 32, offset: 7552)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !366, file: !84, line: 180, baseType: !401, size: 16, offset: 7584)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !366, file: !84, line: 181, baseType: !401, size: 16, offset: 7600)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !366, file: !84, line: 183, baseType: !401, size: 16, offset: 7616)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !366, file: !84, line: 183, baseType: !401, size: 16, offset: 7632)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !366, file: !84, line: 184, baseType: !401, size: 16, offset: 7648)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !366, file: !84, line: 184, baseType: !401, size: 16, offset: 7664)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !366, file: !84, line: 185, baseType: !401, size: 16, offset: 7680)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !366, file: !84, line: 186, baseType: !401, size: 16, offset: 7696)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !366, file: !84, line: 187, baseType: !401, size: 16, offset: 7712)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !366, file: !84, line: 188, baseType: !136, size: 8, offset: 7728)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !366, file: !84, line: 189, baseType: !136, size: 8, offset: 7736)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !366, file: !84, line: 192, baseType: !160, size: 32, offset: 7744)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !366, file: !84, line: 192, baseType: !160, size: 32, offset: 7776)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !366, file: !84, line: 192, baseType: !160, size: 32, offset: 7808)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !366, file: !84, line: 192, baseType: !160, size: 32, offset: 7840)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !366, file: !84, line: 194, baseType: !160, size: 32, offset: 7872)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !366, file: !84, line: 202, baseType: !139, size: 32, offset: 7904)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !366, file: !84, line: 202, baseType: !139, size: 32, offset: 7936)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !366, file: !84, line: 202, baseType: !139, size: 32, offset: 7968)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !366, file: !84, line: 211, baseType: !139, size: 32, offset: 8000)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !366, file: !84, line: 212, baseType: !139, size: 32, offset: 8032)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !366, file: !84, line: 213, baseType: !139, size: 32, offset: 8064)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !366, file: !84, line: 214, baseType: !139, size: 32, offset: 8096)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !366, file: !84, line: 215, baseType: !139, size: 32, offset: 8128)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !366, file: !84, line: 216, baseType: !139, size: 32, offset: 8160)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !366, file: !84, line: 219, baseType: !139, size: 32, offset: 8192)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !366, file: !84, line: 220, baseType: !139, size: 32, offset: 8224)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !366, file: !84, line: 221, baseType: !139, size: 32, offset: 8256)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !366, file: !84, line: 224, baseType: !606, size: 16, offset: 8288)
!606 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !366, file: !84, line: 224, baseType: !606, size: 16, offset: 8304)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !366, file: !84, line: 226, baseType: !401, size: 16, offset: 8320)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !366, file: !84, line: 228, baseType: !136, size: 8, offset: 8336)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !366, file: !84, line: 229, baseType: !136, size: 8, offset: 8344)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !366, file: !84, line: 231, baseType: !401, size: 16, offset: 8352)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !366, file: !84, line: 232, baseType: !136, size: 8, offset: 8368)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !366, file: !84, line: 233, baseType: !136, size: 8, offset: 8376)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !366, file: !84, line: 234, baseType: !139, size: 32, offset: 8384)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !366, file: !84, line: 235, baseType: !139, size: 32, offset: 8416)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !366, file: !84, line: 237, baseType: !424, size: 128, offset: 8448)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !366, file: !84, line: 238, baseType: !424, size: 128, offset: 8576)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !366, file: !84, line: 239, baseType: !424, size: 128, offset: 8704)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !366, file: !84, line: 240, baseType: !424, size: 128, offset: 8832)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !366, file: !84, line: 242, baseType: !139, size: 32, offset: 8960)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !366, file: !84, line: 244, baseType: !401, size: 16, offset: 8992)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !366, file: !84, line: 245, baseType: !606, size: 16, offset: 9008)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !366, file: !84, line: 246, baseType: !564, size: 128, offset: 9024)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !366, file: !84, line: 248, baseType: !160, size: 32, offset: 9152)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !366, file: !84, line: 249, baseType: !160, size: 32, offset: 9184)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !366, file: !84, line: 251, baseType: !627, size: 64, offset: 9216)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !84, line: 251, flags: DIFlagFwdDecl)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !366, file: !84, line: 253, baseType: !136, size: 8, offset: 9280)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !366, file: !84, line: 254, baseType: !136, size: 8, offset: 9288)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !366, file: !84, line: 255, baseType: !401, size: 16, offset: 9296)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !366, file: !84, line: 256, baseType: !162, size: 96, offset: 9312)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !366, file: !84, line: 258, baseType: !424, size: 128, offset: 9408)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !366, file: !84, line: 259, baseType: !424, size: 128, offset: 9536)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !366, file: !84, line: 260, baseType: !424, size: 128, offset: 9664)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !366, file: !84, line: 261, baseType: !424, size: 128, offset: 9792)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !366, file: !84, line: 263, baseType: !638, size: 64, offset: 9920)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !84, line: 52, flags: DIFlagFwdDecl)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !366, file: !84, line: 264, baseType: !641, size: 64, offset: 9984)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !84, line: 53, flags: DIFlagFwdDecl)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !366, file: !84, line: 265, baseType: !644, size: 64, offset: 10048)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !468, line: 46, flags: DIFlagFwdDecl)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !366, file: !84, line: 267, baseType: !136, size: 8, offset: 10112)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !366, file: !84, line: 268, baseType: !136, size: 8, offset: 10120)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !366, file: !84, line: 269, baseType: !401, size: 16, offset: 10128)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !366, file: !84, line: 270, baseType: !139, size: 32, offset: 10144)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !366, file: !84, line: 272, baseType: !651, size: 64, offset: 10176)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !84, line: 54, flags: DIFlagFwdDecl)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !366, file: !84, line: 275, baseType: !654, size: 64, offset: 10240)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !84, line: 275, flags: DIFlagFwdDecl)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !366, file: !84, line: 277, baseType: !657, size: 64, offset: 10304)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !13, line: 178, size: 13504, elements: !659)
!659 = !{!660, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !711, !714, !716, !717, !719, !720, !721, !722, !728, !732, !733, !737, !738, !739, !740, !741, !754, !766, !780, !784, !788, !792, !801, !813, !817, !821, !825, !829, !833, !834, !835, !836, !837, !838, !842, !843, !844, !845, !849, !850, !851, !852, !853, !858, !859, !860, !861, !862, !866, !867, !868, !869, !870, !877, !888, !893, !899, !909, !915, !925, !932, !939, !943, !947, !951, !956, !957, !958, !965, !971, !972, !973, !977, !978, !987, !1095, !1099, !1107, !1111, !1115, !1119, !1127, !1137}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !658, file: !13, line: 180, baseType: !661, size: 1600)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !40, line: 73, baseType: !662)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !40, line: 64, size: 1600, elements: !663)
!663 = !{!664, !679, !683, !684, !685, !686, !689}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !662, file: !40, line: 65, baseType: !665, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !40, line: 53, baseType: !667)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !40, line: 42, size: 832, elements: !668)
!668 = !{!669, !670, !671, !672, !673, !674, !675, !676, !677, !678}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !667, file: !40, line: 43, baseType: !160, size: 32)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !667, file: !40, line: 44, baseType: !160, size: 32, offset: 32)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !667, file: !40, line: 45, baseType: !160, size: 32, offset: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !667, file: !40, line: 46, baseType: !160, size: 32, offset: 96)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !667, file: !40, line: 47, baseType: !160, size: 32, offset: 128)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !667, file: !40, line: 48, baseType: !160, size: 32, offset: 160)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !667, file: !40, line: 49, baseType: !160, size: 32, offset: 192)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !667, file: !40, line: 50, baseType: !160, size: 32, offset: 224)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !667, file: !40, line: 51, baseType: !355, size: 512, offset: 256)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !667, file: !40, line: 52, baseType: !127, size: 64, offset: 768)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !662, file: !40, line: 66, baseType: !680, size: 1312, offset: 64)
!680 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 1312, elements: !681)
!681 = !{!682}
!682 = !DISubrange(count: 41)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !662, file: !40, line: 69, baseType: !160, size: 32, offset: 1376)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !662, file: !40, line: 69, baseType: !160, size: 32, offset: 1408)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !662, file: !40, line: 70, baseType: !160, size: 32, offset: 1440)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !662, file: !40, line: 71, baseType: !687, size: 64, offset: 1472)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !40, line: 71, flags: DIFlagFwdDecl)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !662, file: !40, line: 72, baseType: !690, size: 64, offset: 1536)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !40, line: 59, baseType: !692)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !40, line: 57, size: 8192, elements: !693)
!693 = !{!694}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !692, file: !40, line: 58, baseType: !388, size: 8192)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !658, file: !13, line: 180, baseType: !661, size: 1600, offset: 1600)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !658, file: !13, line: 180, baseType: !661, size: 1600, offset: 3200)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !658, file: !13, line: 180, baseType: !661, size: 1600, offset: 4800)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !658, file: !13, line: 180, baseType: !661, size: 1600, offset: 6400)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !658, file: !13, line: 181, baseType: !160, size: 32, offset: 8000)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !658, file: !13, line: 181, baseType: !160, size: 32, offset: 8032)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !658, file: !13, line: 181, baseType: !160, size: 32, offset: 8064)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !658, file: !13, line: 181, baseType: !160, size: 32, offset: 8096)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !658, file: !13, line: 181, baseType: !160, size: 32, offset: 8128)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !658, file: !13, line: 182, baseType: !160, size: 32, offset: 8160)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !658, file: !13, line: 183, baseType: !160, size: 32, offset: 8192)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !658, file: !13, line: 184, baseType: !707, size: 64, offset: 8256)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !708, line: 124, baseType: !709)
!708 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !708, line: 124, flags: DIFlagFwdDecl)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !658, file: !13, line: 185, baseType: !712, size: 64, offset: 8320)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !13, line: 97, flags: DIFlagFwdDecl)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !658, file: !13, line: 186, baseType: !715, size: 32, offset: 8384)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !13, line: 132, baseType: !12)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !658, file: !13, line: 187, baseType: !139, size: 32, offset: 8416)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !658, file: !13, line: 188, baseType: !718, size: 32, offset: 8448)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !13, line: 175, baseType: !18)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !658, file: !13, line: 189, baseType: !160, size: 32, offset: 8480)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !658, file: !13, line: 190, baseType: !549, size: 64, offset: 8512)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !658, file: !13, line: 193, baseType: !136, size: 8, offset: 8576)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !658, file: !13, line: 196, baseType: !723, size: 64, offset: 8640)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DISubroutineType(types: !725)
!725 = !{null, !726}
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !13, line: 177, baseType: !658)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !658, file: !13, line: 199, baseType: !729, size: 64, offset: 8704)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DISubroutineType(types: !731)
!731 = !{null, !726, !138}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !658, file: !13, line: 202, baseType: !723, size: 64, offset: 8768)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !658, file: !13, line: 207, baseType: !734, size: 64, offset: 8832)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{!160, !726}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !658, file: !13, line: 208, baseType: !734, size: 64, offset: 8896)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !658, file: !13, line: 209, baseType: !734, size: 64, offset: 8960)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !658, file: !13, line: 210, baseType: !734, size: 64, offset: 9024)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !658, file: !13, line: 211, baseType: !734, size: 64, offset: 9088)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !658, file: !13, line: 218, baseType: !742, size: 64, offset: 9152)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DISubroutineType(types: !744)
!744 = !{null, !726, !160, !745}
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !747, line: 65, size: 160, elements: !748)
!747 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!748 = !{!749, !750, !752, !753}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !746, file: !747, line: 66, baseType: !162, size: 96)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !746, file: !747, line: 67, baseType: !751, size: 48, offset: 96)
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !401, size: 48, elements: !163)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !746, file: !747, line: 68, baseType: !136, size: 8, offset: 144)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !746, file: !747, line: 68, baseType: !136, size: 8, offset: 152)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !658, file: !13, line: 219, baseType: !755, size: 64, offset: 9216)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DISubroutineType(types: !757)
!757 = !{null, !726, !160, !758}
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !747, line: 48, size: 96, elements: !760)
!760 = !{!761, !762, !763, !764, !765}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !759, file: !747, line: 49, baseType: !5, size: 32)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !759, file: !747, line: 49, baseType: !5, size: 32, offset: 32)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !759, file: !747, line: 50, baseType: !136, size: 8, offset: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !759, file: !747, line: 50, baseType: !136, size: 8, offset: 72)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !759, file: !747, line: 51, baseType: !401, size: 16, offset: 80)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !658, file: !13, line: 220, baseType: !767, size: 64, offset: 9280)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DISubroutineType(types: !769)
!769 = !{null, !726, !160, !770}
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !747, line: 42, size: 160, elements: !772)
!772 = !{!773, !774, !775, !776, !777, !778, !779}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !771, file: !747, line: 43, baseType: !5, size: 32)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !771, file: !747, line: 43, baseType: !5, size: 32, offset: 32)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !771, file: !747, line: 43, baseType: !5, size: 32, offset: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !771, file: !747, line: 43, baseType: !5, size: 32, offset: 96)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !771, file: !747, line: 44, baseType: !401, size: 16, offset: 128)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !771, file: !747, line: 45, baseType: !136, size: 8, offset: 144)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !771, file: !747, line: 45, baseType: !136, size: 8, offset: 152)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !658, file: !13, line: 227, baseType: !781, size: 64, offset: 9344)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DISubroutineType(types: !783)
!783 = !{!745, !726}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !658, file: !13, line: 228, baseType: !785, size: 64, offset: 9408)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DISubroutineType(types: !787)
!787 = !{!758, !726}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !658, file: !13, line: 229, baseType: !789, size: 64, offset: 9472)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DISubroutineType(types: !791)
!791 = !{!770, !726}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !658, file: !13, line: 230, baseType: !793, size: 64, offset: 9536)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DISubroutineType(types: !795)
!795 = !{!796, !726}
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !747, line: 88, size: 64, elements: !798)
!798 = !{!799, !800}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !797, file: !747, line: 89, baseType: !5, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !797, file: !747, line: 90, baseType: !5, size: 32, offset: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !658, file: !13, line: 231, baseType: !802, size: 64, offset: 9600)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DISubroutineType(types: !804)
!804 = !{!805, !726}
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !747, line: 79, size: 96, elements: !807)
!807 = !{!808, !809, !810, !811, !812}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !806, file: !747, line: 81, baseType: !160, size: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !806, file: !747, line: 82, baseType: !160, size: 32, offset: 32)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !806, file: !747, line: 83, baseType: !401, size: 16, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !806, file: !747, line: 84, baseType: !136, size: 8, offset: 80)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !806, file: !747, line: 84, baseType: !136, size: 8, offset: 88)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !658, file: !13, line: 236, baseType: !814, size: 64, offset: 9664)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DISubroutineType(types: !816)
!816 = !{null, !726, !745}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !658, file: !13, line: 237, baseType: !818, size: 64, offset: 9728)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DISubroutineType(types: !820)
!820 = !{null, !726, !758}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !658, file: !13, line: 238, baseType: !822, size: 64, offset: 9792)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DISubroutineType(types: !824)
!824 = !{null, !726, !770}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !658, file: !13, line: 239, baseType: !826, size: 64, offset: 9856)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DISubroutineType(types: !828)
!828 = !{null, !726, !796}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !658, file: !13, line: 240, baseType: !830, size: 64, offset: 9920)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DISubroutineType(types: !832)
!832 = !{null, !726, !805}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !658, file: !13, line: 245, baseType: !781, size: 64, offset: 9984)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !658, file: !13, line: 246, baseType: !785, size: 64, offset: 10048)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !658, file: !13, line: 247, baseType: !789, size: 64, offset: 10112)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !658, file: !13, line: 248, baseType: !793, size: 64, offset: 10176)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !658, file: !13, line: 249, baseType: !802, size: 64, offset: 10240)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !658, file: !13, line: 255, baseType: !839, size: 64, offset: 10304)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DISubroutineType(types: !841)
!841 = !{!127, !726, !160, !160}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !658, file: !13, line: 256, baseType: !839, size: 64, offset: 10368)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !658, file: !13, line: 257, baseType: !839, size: 64, offset: 10432)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !658, file: !13, line: 258, baseType: !839, size: 64, offset: 10496)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !658, file: !13, line: 264, baseType: !846, size: 64, offset: 10560)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{!127, !726, !160}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !658, file: !13, line: 265, baseType: !846, size: 64, offset: 10624)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !658, file: !13, line: 266, baseType: !846, size: 64, offset: 10688)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !658, file: !13, line: 267, baseType: !846, size: 64, offset: 10752)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !658, file: !13, line: 268, baseType: !846, size: 64, offset: 10816)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataLayout", scope: !658, file: !13, line: 272, baseType: !854, size: 64, offset: 10880)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DISubroutineType(types: !856)
!856 = !{!857, !726}
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataLayout", scope: !658, file: !13, line: 273, baseType: !854, size: 64, offset: 10944)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataLayout", scope: !658, file: !13, line: 274, baseType: !854, size: 64, offset: 11008)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataLayout", scope: !658, file: !13, line: 275, baseType: !854, size: 64, offset: 11072)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataLayout", scope: !658, file: !13, line: 276, baseType: !854, size: 64, offset: 11136)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromVertCData", scope: !658, file: !13, line: 279, baseType: !863, size: 64, offset: 11200)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DISubroutineType(types: !865)
!865 = !{null, !726, !160, !857, !160}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromEdgeCData", scope: !658, file: !13, line: 280, baseType: !863, size: 64, offset: 11264)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromFaceCData", scope: !658, file: !13, line: 281, baseType: !863, size: 64, offset: 11328)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "getNumGrids", scope: !658, file: !13, line: 284, baseType: !734, size: 64, offset: 11392)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "getGridSize", scope: !658, file: !13, line: 285, baseType: !734, size: 64, offset: 11456)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "getGridData", scope: !658, file: !13, line: 286, baseType: !871, size: 64, offset: 11520)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DISubroutineType(types: !873)
!873 = !{!874, !726}
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !13, line: 82, flags: DIFlagFwdDecl)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "getGridAdjacency", scope: !658, file: !13, line: 287, baseType: !878, size: 64, offset: 11584)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DISubroutineType(types: !880)
!880 = !{!881, !726}
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGridAdjacency", file: !13, line: 120, baseType: !883)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMGridAdjacency", file: !13, line: 117, size: 256, elements: !884)
!884 = !{!885, !887}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !883, file: !13, line: 118, baseType: !886, size: 128)
!886 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 128, elements: !565)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !883, file: !13, line: 119, baseType: !886, size: 128, offset: 128)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "getGridOffset", scope: !658, file: !13, line: 288, baseType: !889, size: 64, offset: 11648)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DISubroutineType(types: !891)
!891 = !{!892, !726}
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "getGridKey", scope: !658, file: !13, line: 289, baseType: !894, size: 64, offset: 11712)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DISubroutineType(types: !896)
!896 = !{null, !726, !897}
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGKey", file: !13, line: 83, flags: DIFlagFwdDecl)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "getGridFlagMats", scope: !658, file: !13, line: 290, baseType: !900, size: 64, offset: 11776)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DISubroutineType(types: !902)
!902 = !{!903, !726}
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFlagMat", file: !13, line: 126, baseType: !905)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMFlagMat", file: !13, line: 123, size: 32, elements: !906)
!906 = !{!907, !908}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !905, file: !13, line: 124, baseType: !401, size: 16)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !905, file: !13, line: 125, baseType: !136, size: 8, offset: 16)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "getGridHidden", scope: !658, file: !13, line: 291, baseType: !910, size: 64, offset: 11840)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DISubroutineType(types: !912)
!912 = !{!913, !726}
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedVert", scope: !658, file: !13, line: 299, baseType: !916, size: 64, offset: 11904)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DISubroutineType(types: !918)
!918 = !{null, !726, !919, !127, !924}
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DISubroutineType(types: !921)
!921 = !{null, !127, !160, !137, !137, !922}
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !401)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMForeachFlag", file: !13, line: 162, baseType: !23)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedEdge", scope: !658, file: !13, line: 309, baseType: !926, size: 64, offset: 11968)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DISubroutineType(types: !928)
!928 = !{null, !726, !929, !127}
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DISubroutineType(types: !931)
!931 = !{null, !127, !160, !137, !137}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedLoop", scope: !658, file: !13, line: 317, baseType: !933, size: 64, offset: 12032)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DISubroutineType(types: !935)
!935 = !{null, !726, !936, !127, !924}
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DISubroutineType(types: !938)
!938 = !{null, !127, !160, !160, !137, !137}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedFaceCenter", scope: !658, file: !13, line: 327, baseType: !940, size: 64, offset: 12096)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DISubroutineType(types: !942)
!942 = !{null, !726, !929, !127, !924}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "getMinMax", scope: !658, file: !13, line: 337, baseType: !944, size: 64, offset: 12160)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DISubroutineType(types: !946)
!946 = !{null, !726, !302, !302}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCo", scope: !658, file: !13, line: 344, baseType: !948, size: 64, offset: 12224)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DISubroutineType(types: !950)
!950 = !{null, !726, !160, !302}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCos", scope: !658, file: !13, line: 347, baseType: !952, size: 64, offset: 12288)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = !DISubroutineType(types: !954)
!954 = !{null, !726, !955}
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "getVertNo", scope: !658, file: !13, line: 350, baseType: !948, size: 64, offset: 12352)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyNo", scope: !658, file: !13, line: 351, baseType: !948, size: 64, offset: 12416)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyMap", scope: !658, file: !13, line: 355, baseType: !959, size: 64, offset: 12480)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DISubroutineType(types: !961)
!961 = !{!962, !365, !726}
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !964)
!964 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !13, line: 355, flags: DIFlagFwdDecl)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "getPBVH", scope: !658, file: !13, line: 359, baseType: !966, size: 64, offset: 12544)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DISubroutineType(types: !968)
!968 = !{!969, !365, !726}
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !13, line: 100, flags: DIFlagFwdDecl)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "drawVerts", scope: !658, file: !13, line: 364, baseType: !723, size: 64, offset: 12608)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "drawUVEdges", scope: !658, file: !13, line: 367, baseType: !723, size: 64, offset: 12672)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "drawEdges", scope: !658, file: !13, line: 373, baseType: !974, size: 64, offset: 12736)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DISubroutineType(types: !976)
!976 = !{null, !726, !135, !135}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "drawLooseEdges", scope: !658, file: !13, line: 376, baseType: !723, size: 64, offset: 12800)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesSolid", scope: !658, file: !13, line: 385, baseType: !979, size: 64, offset: 12864)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{null, !726, !982, !135, !983}
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetMaterial", file: !13, line: 146, baseType: !984)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{!160, !160, !127}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesTex", scope: !658, file: !13, line: 391, baseType: !988, size: 64, offset: 12928)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DISubroutineType(types: !990)
!990 = !{null, !726, !991, !1090, !127, !1094}
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptionsTex", file: !13, line: 150, baseType: !992)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DISubroutineType(types: !994)
!994 = !{!995, !996, !1089, !160}
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawOption", file: !13, line: 143, baseType: !27)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !747, line: 160, size: 384, elements: !998)
!998 = !{!999, !1003, !1084, !1085, !1086, !1087, !1088}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !997, file: !747, line: 161, baseType: !1000, size: 256)
!1000 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 256, elements: !1001)
!1001 = !{!149, !1002}
!1002 = !DISubrange(count: 2)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !997, file: !747, line: 162, baseType: !1004, size: 64, offset: 256)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !361, line: 77, size: 15424, elements: !1006)
!1006 = !{!1007, !1008, !1009, !1012, !1015, !1018, !1021, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1073, !1074, !1078}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1005, file: !361, line: 78, baseType: !369, size: 960)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1005, file: !361, line: 80, baseType: !388, size: 8192, offset: 960)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1005, file: !361, line: 82, baseType: !1010, size: 64, offset: 9152)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !361, line: 43, flags: DIFlagFwdDecl)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1005, file: !361, line: 83, baseType: !1013, size: 64, offset: 9216)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !370, line: 46, flags: DIFlagFwdDecl)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1005, file: !361, line: 86, baseType: !1016, size: 64, offset: 9280)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !361, line: 41, flags: DIFlagFwdDecl)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !1005, file: !361, line: 87, baseType: !1019, size: 64, offset: 9344)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !361, line: 44, flags: DIFlagFwdDecl)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !1005, file: !361, line: 89, baseType: !1022, size: 512, offset: 9408)
!1022 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1019, size: 512, elements: !1023)
!1023 = !{!462}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !1005, file: !361, line: 90, baseType: !401, size: 16, offset: 9920)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !1005, file: !361, line: 90, baseType: !401, size: 16, offset: 9936)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1005, file: !361, line: 92, baseType: !401, size: 16, offset: 9952)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1005, file: !361, line: 92, baseType: !401, size: 16, offset: 9968)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1005, file: !361, line: 93, baseType: !401, size: 16, offset: 9984)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1005, file: !361, line: 93, baseType: !401, size: 16, offset: 10000)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1005, file: !361, line: 94, baseType: !160, size: 32, offset: 10016)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !1005, file: !361, line: 97, baseType: !401, size: 16, offset: 10048)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !1005, file: !361, line: 97, baseType: !401, size: 16, offset: 10064)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !1005, file: !361, line: 98, baseType: !401, size: 16, offset: 10080)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !1005, file: !361, line: 98, baseType: !401, size: 16, offset: 10096)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !1005, file: !361, line: 99, baseType: !401, size: 16, offset: 10112)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !1005, file: !361, line: 99, baseType: !401, size: 16, offset: 10128)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !1005, file: !361, line: 100, baseType: !5, size: 32, offset: 10144)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !1005, file: !361, line: 101, baseType: !914, size: 64, offset: 10176)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1005, file: !361, line: 103, baseType: !394, size: 64, offset: 10240)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !1005, file: !361, line: 104, baseType: !1041, size: 64, offset: 10304)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !370, line: 159, size: 448, elements: !1043)
!1043 = !{!1044, !1047, !1048, !1050, !1051, !1053}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1042, file: !370, line: 161, baseType: !1045, size: 64)
!1045 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !1046)
!1046 = !{!1002}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1042, file: !370, line: 162, baseType: !1045, size: 64, offset: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !1042, file: !370, line: 163, baseType: !1049, size: 32, offset: 128)
!1049 = !DICompositeType(tag: DW_TAG_array_type, baseType: !401, size: 32, elements: !1046)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !1042, file: !370, line: 164, baseType: !1049, size: 32, offset: 160)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !1042, file: !370, line: 165, baseType: !1052, size: 128, offset: 192)
!1052 = !DICompositeType(tag: DW_TAG_array_type, baseType: !914, size: 128, elements: !1046)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1042, file: !370, line: 166, baseType: !1054, size: 128, offset: 320)
!1054 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1013, size: 128, elements: !1046)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !1005, file: !361, line: 107, baseType: !139, size: 32, offset: 10368)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !1005, file: !361, line: 108, baseType: !160, size: 32, offset: 10400)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !1005, file: !361, line: 109, baseType: !401, size: 16, offset: 10432)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1005, file: !361, line: 110, baseType: !401, size: 16, offset: 10448)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !1005, file: !361, line: 113, baseType: !160, size: 32, offset: 10464)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !1005, file: !361, line: 113, baseType: !160, size: 32, offset: 10496)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !1005, file: !361, line: 114, baseType: !136, size: 8, offset: 10528)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !1005, file: !361, line: 114, baseType: !136, size: 8, offset: 10536)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !1005, file: !361, line: 115, baseType: !401, size: 16, offset: 10544)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !1005, file: !361, line: 116, baseType: !564, size: 128, offset: 10560)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !1005, file: !361, line: 119, baseType: !139, size: 32, offset: 10688)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !1005, file: !361, line: 119, baseType: !139, size: 32, offset: 10720)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1005, file: !361, line: 122, baseType: !1068, size: 512, offset: 10752)
!1068 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !1069, line: 182, baseType: !1070)
!1069 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !1069, line: 180, size: 512, elements: !1071)
!1071 = !{!1072}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1070, file: !1069, line: 181, baseType: !355, size: 512)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !1005, file: !361, line: 123, baseType: !136, size: 8, offset: 11264)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1005, file: !361, line: 125, baseType: !1075, size: 56, offset: 11272)
!1075 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 56, elements: !1076)
!1076 = !{!1077}
!1077 = !DISubrange(count: 7)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !1005, file: !361, line: 126, baseType: !1079, size: 4096, offset: 11328)
!1079 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1080, size: 4096, elements: !1023)
!1080 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !361, line: 69, baseType: !1081)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !361, line: 67, size: 512, elements: !1082)
!1082 = !{!1083}
