; ModuleID = 'blender/source/blender/render/intern/source/initrender.c'
source_filename = "blender/source/blender/render/intern/source/initrender.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "firsttime", scope: !2, file: !3, line: 256, type: !21, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "make_sample_tables", scope: !3, file: !3, line: 254, type: !4, scopeLine: 255, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2002, retainedNodes: !2014)
!3 = !DIFile(filename: "blender/source/blender/render/intern/source/initrender.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "Render", file: !8, line: 58, baseType: !9)
!8 = !DIFile(filename: "blender/source/blender/render/extern/include/RE_pipeline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Render", file: !10, line: 126, size: 49920, elements: !11)
!10 = !DIFile(filename: "blender/source/blender/render/intern/include/render_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!11 = !{!12, !14, !15, !20, !22, !24, !25, !26, !27, !29, !106, !107, !108, !117, !118, !119, !120, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !145, !148, !152, !153, !154, !155, !156, !157, !176, !181, !182, !184, !188, !310, !1710, !1712, !1714, !1715, !1716, !1717, !1718, !1721, !1724, !1727, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1779, !1780, !1781, !1782, !1917, !1918, !1919, !1920, !1921, !1922, !1923, !1924, !1925, !1926, !1927, !1928, !1931, !1935, !1936, !1937, !1938, !1943, !1944, !1948, !1949, !1980, !1981, !1985, !1986, !1990, !1991, !1995, !1996, !1997, !2000, !2001}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !9, file: !10, line: 128, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !9, file: !10, line: 128, baseType: !13, size: 64, offset: 64)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !9, file: !10, line: 129, baseType: !16, size: 592, offset: 128)
!16 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 592, elements: !18)
!17 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!18 = !{!19}
!19 = !DISubrange(count: 74)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !9, file: !10, line: 130, baseType: !21, size: 32, offset: 736)
!21 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !9, file: !10, line: 133, baseType: !23, size: 16, offset: 768)
!23 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "osa", scope: !9, file: !10, line: 133, baseType: !23, size: 16, offset: 784)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !9, file: !10, line: 133, baseType: !23, size: 16, offset: 800)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "result_ok", scope: !9, file: !10, line: 133, baseType: !23, size: 16, offset: 816)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "scene_color_manage", scope: !9, file: !10, line: 136, baseType: !28, size: 8, offset: 832)
!28 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !9, file: !10, line: 139, baseType: !30, size: 64, offset: 896)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderResult", file: !8, line: 148, baseType: !32)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !8, line: 110, size: 1152, elements: !33)
!33 = !{!34, !36, !37, !38, !39, !40, !41, !43, !46, !47, !56, !57, !58, !66, !68, !101, !102, !103, !104}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !32, file: !8, line: 111, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !32, file: !8, line: 111, baseType: !35, size: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "rectx", scope: !32, file: !8, line: 114, baseType: !21, size: 32, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "recty", scope: !32, file: !8, line: 114, baseType: !21, size: 32, offset: 160)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !32, file: !8, line: 115, baseType: !23, size: 16, offset: 192)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "sample_nr", scope: !32, file: !8, line: 115, baseType: !23, size: 16, offset: 208)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "rect32", scope: !32, file: !8, line: 118, baseType: !42, size: 64, offset: 256)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "rectf", scope: !32, file: !8, line: 120, baseType: !44, size: 64, offset: 320)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "rectz", scope: !32, file: !8, line: 122, baseType: !44, size: 64, offset: 384)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "tilerect", scope: !32, file: !8, line: 125, baseType: !48, size: 128, offset: 448)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !49, line: 89, baseType: !50)
!49 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !49, line: 86, size: 128, elements: !51)
!51 = !{!52, !53, !54, !55}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !50, file: !49, line: 87, baseType: !21, size: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !50, file: !49, line: 87, baseType: !21, size: 32, offset: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !50, file: !49, line: 88, baseType: !21, size: 32, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !50, file: !49, line: 88, baseType: !21, size: 32, offset: 96)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "xof", scope: !32, file: !8, line: 127, baseType: !21, size: 32, offset: 576)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "yof", scope: !32, file: !8, line: 127, baseType: !21, size: 32, offset: 608)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !32, file: !8, line: 130, baseType: !59, size: 128, offset: 640)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !60, line: 71, baseType: !61)
!60 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !60, line: 69, size: 128, elements: !62)
!62 = !{!63, !65}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !61, file: !60, line: 70, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !61, file: !60, line: 70, baseType: !64, size: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "renrect", scope: !32, file: !8, line: 133, baseType: !67, size: 128, offset: 768)
!67 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !48)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "renlay", scope: !32, file: !8, line: 134, baseType: !69, size: 64, offset: 896)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !71)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderLayer", file: !8, line: 108, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderLayer", file: !8, line: 85, size: 1600, elements: !73)
!73 = !{!74, !76, !77, !78, !80, !81, !82, !83, !84, !85, !89, !93, !94, !95, !96, !97, !98, !99, !100}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !72, file: !8, line: 86, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !72, file: !8, line: 86, baseType: !75, size: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !72, file: !8, line: 89, baseType: !16, size: 592, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !72, file: !8, line: 90, baseType: !79, size: 32, offset: 736)
!79 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "lay_zmask", scope: !72, file: !8, line: 90, baseType: !79, size: 32, offset: 768)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "lay_exclude", scope: !72, file: !8, line: 90, baseType: !79, size: 32, offset: 800)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "layflag", scope: !72, file: !8, line: 91, baseType: !21, size: 32, offset: 832)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "passflag", scope: !72, file: !8, line: 91, baseType: !21, size: 32, offset: 864)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "pass_xor", scope: !72, file: !8, line: 91, baseType: !21, size: 32, offset: 896)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "mat_override", scope: !72, file: !8, line: 93, baseType: !86, size: 64, offset: 960)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !88, line: 50, flags: DIFlagFwdDecl)
!88 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!89 = !DIDerivedType(tag: DW_TAG_member, name: "light_override", scope: !72, file: !8, line: 94, baseType: !90, size: 64, offset: 1024)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !92, line: 46, flags: DIFlagFwdDecl)
!92 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!93 = !DIDerivedType(tag: DW_TAG_member, name: "rectf", scope: !72, file: !8, line: 96, baseType: !44, size: 64, offset: 1088)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "acolrect", scope: !72, file: !8, line: 97, baseType: !44, size: 64, offset: 1152)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "scolrect", scope: !72, file: !8, line: 98, baseType: !44, size: 64, offset: 1216)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer", scope: !72, file: !8, line: 99, baseType: !42, size: 64, offset: 1280)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "rectx", scope: !72, file: !8, line: 101, baseType: !21, size: 32, offset: 1344)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "recty", scope: !72, file: !8, line: 101, baseType: !21, size: 32, offset: 1376)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "exrhandle", scope: !72, file: !8, line: 104, baseType: !64, size: 64, offset: 1408)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "passes", scope: !72, file: !8, line: 106, baseType: !59, size: 128, offset: 1472)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "do_exr_tile", scope: !32, file: !8, line: 137, baseType: !21, size: 32, offset: 960)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !32, file: !8, line: 140, baseType: !21, size: 32, offset: 992)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "have_combined", scope: !32, file: !8, line: 143, baseType: !21, size: 32, offset: 1024)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !32, file: !8, line: 146, baseType: !105, size: 64, offset: 1088)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "pushedresult", scope: !9, file: !10, line: 141, baseType: !30, size: 64, offset: 960)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "fullresult", scope: !9, file: !10, line: 143, baseType: !59, size: 128, offset: 1024)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "resultmutex", scope: !9, file: !10, line: 147, baseType: !109, size: 32, offset: 1152)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThreadRWMutex", file: !110, line: 148, baseType: !111)
!110 = !DIFile(filename: "blender/source/blender/blenlib/BLI_threads.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "spec_null_rwlock_t", file: !112, line: 10, baseType: !113)
!112 = !DIFile(filename: "include/spec_pthread.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !114, line: 26, baseType: !115)
!114 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !116, line: 42, baseType: !79)
!116 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!117 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !9, file: !10, line: 150, baseType: !21, size: 32, offset: 1184)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !9, file: !10, line: 150, baseType: !21, size: 32, offset: 1216)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "disprect", scope: !9, file: !10, line: 152, baseType: !48, size: 128, offset: 1248)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "viewplane", scope: !9, file: !10, line: 153, baseType: !121, size: 128, offset: 1376)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !49, line: 95, baseType: !122)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !49, line: 92, size: 128, elements: !123)
!123 = !{!124, !125, !126, !127}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !122, file: !49, line: 93, baseType: !45, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !122, file: !49, line: 93, baseType: !45, size: 32, offset: 32)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !122, file: !49, line: 94, baseType: !45, size: 32, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !122, file: !49, line: 94, baseType: !45, size: 32, offset: 96)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "viewdx", scope: !9, file: !10, line: 154, baseType: !45, size: 32, offset: 1504)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "viewdy", scope: !9, file: !10, line: 154, baseType: !45, size: 32, offset: 1536)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "clipcrop", scope: !9, file: !10, line: 155, baseType: !45, size: 32, offset: 1568)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "rectx", scope: !9, file: !10, line: 158, baseType: !21, size: 32, offset: 1600)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "recty", scope: !9, file: !10, line: 158, baseType: !21, size: 32, offset: 1632)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "partx", scope: !9, file: !10, line: 162, baseType: !21, size: 32, offset: 1664)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "party", scope: !9, file: !10, line: 162, baseType: !21, size: 32, offset: 1696)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "ycor", scope: !9, file: !10, line: 165, baseType: !45, size: 32, offset: 1728)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "panophi", scope: !9, file: !10, line: 167, baseType: !45, size: 32, offset: 1760)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "panosi", scope: !9, file: !10, line: 167, baseType: !45, size: 32, offset: 1792)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "panoco", scope: !9, file: !10, line: 167, baseType: !45, size: 32, offset: 1824)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "panodxp", scope: !9, file: !10, line: 167, baseType: !45, size: 32, offset: 1856)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "panodxv", scope: !9, file: !10, line: 167, baseType: !45, size: 32, offset: 1888)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "grvec", scope: !9, file: !10, line: 170, baseType: !142, size: 96, offset: 1920)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 96, elements: !143)
!143 = !{!144}
!144 = !DISubrange(count: 3)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !9, file: !10, line: 171, baseType: !146, size: 288, offset: 2016)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 288, elements: !147)
!147 = !{!144, !144}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "viewmat", scope: !9, file: !10, line: 172, baseType: !149, size: 512, offset: 2304)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 512, elements: !150)
!150 = !{!151, !151}
!151 = !DISubrange(count: 4)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "viewinv", scope: !9, file: !10, line: 172, baseType: !149, size: 512, offset: 2816)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "viewmat_orig", scope: !9, file: !10, line: 173, baseType: !149, size: 512, offset: 3328)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "winmat", scope: !9, file: !10, line: 174, baseType: !149, size: 512, offset: 3840)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "clipsta", scope: !9, file: !10, line: 177, baseType: !45, size: 32, offset: 4352)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "clipend", scope: !9, file: !10, line: 178, baseType: !45, size: 32, offset: 4384)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !9, file: !10, line: 181, baseType: !158, size: 64, offset: 4416)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "SampleTables", file: !10, line: 77, baseType: !160)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SampleTables", file: !10, line: 72, size: 3776, elements: !161)
!161 = !{!162, !166, !170, !171, !175}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "centLut", scope: !160, file: !10, line: 73, baseType: !163, size: 512)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 512, elements: !164)
!164 = !{!165}
!165 = !DISubrange(count: 16)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "fmask1", scope: !160, file: !10, line: 74, baseType: !167, size: 576, offset: 512)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 576, elements: !168)
!168 = !{!169}
!169 = !DISubrange(count: 9)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "fmask2", scope: !160, file: !10, line: 74, baseType: !167, size: 576, offset: 1088)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "cmask", scope: !160, file: !10, line: 75, baseType: !172, size: 2048, offset: 1664)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 2048, elements: !173)
!173 = !{!174}
!174 = !DISubrange(count: 256)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "centmask", scope: !160, file: !10, line: 75, baseType: !105, size: 64, offset: 3712)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "jit", scope: !9, file: !10, line: 182, baseType: !177, size: 2048, offset: 4480)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 2048, elements: !178)
!178 = !{!179, !180}
!179 = !DISubrange(count: 32)
!180 = !DISubrange(count: 2)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "mblur_jit", scope: !9, file: !10, line: 183, baseType: !177, size: 2048, offset: 6528)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "qmcsamplers", scope: !9, file: !10, line: 184, baseType: !183, size: 64, offset: 8576)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "shadowsamplenr", scope: !9, file: !10, line: 187, baseType: !185, size: 32, offset: 8640)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 32, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 1)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !9, file: !10, line: 190, baseType: !189, size: 64, offset: 8704)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Main", file: !191, line: 53, size: 15232, elements: !192)
!191 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_main.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!192 = !{!193, !194, !195, !199, !200, !201, !202, !203, !207, !209, !210, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !307}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !190, file: !191, line: 54, baseType: !189, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !190, file: !191, line: 54, baseType: !189, size: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !190, file: !191, line: 55, baseType: !196, size: 8192, offset: 128)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 8192, elements: !197)
!197 = !{!198}
!198 = !DISubrange(count: 1024)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "versionfile", scope: !190, file: !191, line: 56, baseType: !23, size: 16, offset: 8320)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "subversionfile", scope: !190, file: !191, line: 56, baseType: !23, size: 16, offset: 8336)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "minversionfile", scope: !190, file: !191, line: 57, baseType: !23, size: 16, offset: 8352)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "minsubversionfile", scope: !190, file: !191, line: 57, baseType: !23, size: 16, offset: 8368)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "build_commit_timestamp", scope: !190, file: !191, line: 58, baseType: !204, size: 64, offset: 8384)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !114, line: 27, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !116, line: 45, baseType: !206)
!206 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "build_hash", scope: !190, file: !191, line: 59, baseType: !208, size: 128, offset: 8448)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 128, elements: !164)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", scope: !190, file: !191, line: 60, baseType: !23, size: 16, offset: 8576)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "curlib", scope: !190, file: !191, line: 62, baseType: !211, size: 64, offset: 8640)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !213, line: 136, size: 17600, elements: !214)
!213 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!214 = !{!215, !258, !260, !263, !264, !265, !266}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !212, file: !213, line: 137, baseType: !216, size: 960)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !213, line: 130, baseType: !217)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !213, line: 117, size: 960, elements: !218)
!218 = !{!219, !220, !221, !223, !224, !228, !229, !230, !231, !232}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !217, file: !213, line: 118, baseType: !64, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !217, file: !213, line: 118, baseType: !64, size: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !217, file: !213, line: 119, baseType: !222, size: 64, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !217, file: !213, line: 120, baseType: !211, size: 64, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !217, file: !213, line: 121, baseType: !225, size: 528, offset: 256)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 528, elements: !226)
!226 = !{!227}
!227 = !DISubrange(count: 66)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !217, file: !213, line: 126, baseType: !23, size: 16, offset: 784)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !217, file: !213, line: 127, baseType: !21, size: 32, offset: 800)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !217, file: !213, line: 128, baseType: !21, size: 32, offset: 832)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !217, file: !213, line: 128, baseType: !21, size: 32, offset: 864)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !217, file: !213, line: 129, baseType: !233, size: 64, offset: 896)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !213, line: 75, baseType: !235)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !213, line: 62, size: 1024, elements: !236)
!236 = !{!237, !239, !240, !241, !242, !243, !247, !248, !256, !257}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !235, file: !213, line: 63, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !235, file: !213, line: 63, baseType: !238, size: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !235, file: !213, line: 64, baseType: !17, size: 8, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !235, file: !213, line: 64, baseType: !17, size: 8, offset: 136)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !235, file: !213, line: 65, baseType: !23, size: 16, offset: 144)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !235, file: !213, line: 66, baseType: !244, size: 512, offset: 160)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 512, elements: !245)
!245 = !{!246}
!246 = !DISubrange(count: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !235, file: !213, line: 67, baseType: !21, size: 32, offset: 672)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !235, file: !213, line: 69, baseType: !249, size: 256, offset: 704)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !213, line: 60, baseType: !250)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !213, line: 48, size: 256, elements: !251)
!251 = !{!252, !253, !254, !255}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !250, file: !213, line: 49, baseType: !64, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !250, file: !213, line: 58, baseType: !59, size: 128, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !250, file: !213, line: 59, baseType: !21, size: 32, offset: 192)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !250, file: !213, line: 59, baseType: !21, size: 32, offset: 224)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !235, file: !213, line: 70, baseType: !21, size: 32, offset: 960)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !235, file: !213, line: 74, baseType: !21, size: 32, offset: 992)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !212, file: !213, line: 138, baseType: !259, size: 64, offset: 960)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !212, file: !213, line: 139, baseType: !261, size: 64, offset: 1024)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !213, line: 43, flags: DIFlagFwdDecl)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !212, file: !213, line: 140, baseType: !196, size: 8192, offset: 1088)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !212, file: !213, line: 141, baseType: !196, size: 8192, offset: 9280)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !212, file: !213, line: 148, baseType: !211, size: 64, offset: 17472)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !212, file: !213, line: 150, baseType: !267, size: 64, offset: 17536)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !213, line: 45, flags: DIFlagFwdDecl)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !190, file: !191, line: 63, baseType: !59, size: 128, offset: 8704)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "library", scope: !190, file: !191, line: 64, baseType: !59, size: 128, offset: 8832)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !190, file: !191, line: 65, baseType: !59, size: 128, offset: 8960)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "mesh", scope: !190, file: !191, line: 66, baseType: !59, size: 128, offset: 9088)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !190, file: !191, line: 67, baseType: !59, size: 128, offset: 9216)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "mball", scope: !190, file: !191, line: 68, baseType: !59, size: 128, offset: 9344)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !190, file: !191, line: 69, baseType: !59, size: 128, offset: 9472)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !190, file: !191, line: 70, baseType: !59, size: 128, offset: 9600)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !190, file: !191, line: 71, baseType: !59, size: 128, offset: 9728)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "latt", scope: !190, file: !191, line: 72, baseType: !59, size: 128, offset: 9856)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "lamp", scope: !190, file: !191, line: 73, baseType: !59, size: 128, offset: 9984)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !190, file: !191, line: 74, baseType: !59, size: 128, offset: 10112)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !190, file: !191, line: 75, baseType: !59, size: 128, offset: 10240)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !190, file: !191, line: 76, baseType: !59, size: 128, offset: 10368)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !190, file: !191, line: 77, baseType: !59, size: 128, offset: 10496)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !190, file: !191, line: 78, baseType: !59, size: 128, offset: 10624)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !190, file: !191, line: 79, baseType: !59, size: 128, offset: 10752)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "vfont", scope: !190, file: !191, line: 80, baseType: !59, size: 128, offset: 10880)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !190, file: !191, line: 81, baseType: !59, size: 128, offset: 11008)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "speaker", scope: !190, file: !191, line: 82, baseType: !59, size: 128, offset: 11136)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !190, file: !191, line: 83, baseType: !59, size: 128, offset: 11264)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !190, file: !191, line: 84, baseType: !59, size: 128, offset: 11392)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "armature", scope: !190, file: !191, line: 85, baseType: !59, size: 128, offset: 11520)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !190, file: !191, line: 86, baseType: !59, size: 128, offset: 11648)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !190, file: !191, line: 87, baseType: !59, size: 128, offset: 11776)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !190, file: !191, line: 88, baseType: !59, size: 128, offset: 11904)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !190, file: !191, line: 89, baseType: !59, size: 128, offset: 12032)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "palettes", scope: !190, file: !191, line: 90, baseType: !59, size: 128, offset: 12160)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "paintcurves", scope: !190, file: !191, line: 91, baseType: !59, size: 128, offset: 12288)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "wm", scope: !190, file: !191, line: 92, baseType: !59, size: 128, offset: 12416)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil", scope: !190, file: !191, line: 93, baseType: !59, size: 128, offset: 12544)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "movieclip", scope: !190, file: !191, line: 94, baseType: !59, size: 128, offset: 12672)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !190, file: !191, line: 95, baseType: !59, size: 128, offset: 12800)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "linestyle", scope: !190, file: !191, line: 96, baseType: !59, size: 128, offset: 12928)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "id_tag_update", scope: !190, file: !191, line: 98, baseType: !172, size: 2048, offset: 13056)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "eval_ctx", scope: !190, file: !191, line: 101, baseType: !305, size: 64, offset: 15104)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "EvaluationContext", file: !191, line: 49, flags: DIFlagFwdDecl)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !190, file: !191, line: 103, baseType: !308, size: 64, offset: 15168)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "MainLock", file: !191, line: 51, flags: DIFlagFwdDecl)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !9, file: !10, line: 191, baseType: !311, size: 64, offset: 8768)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "Scene", file: !313, line: 1299, baseType: !314)
!313 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !313, line: 1216, size: 39680, elements: !315)
!315 = !{!316, !317, !321, !593, !1097, !1098, !1099, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1126, !1338, !1341, !1584, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1606, !1607, !1608, !1609, !1610, !1618, !1684, !1691, !1692, !1699, !1702, !1703, !1704, !1705, !1706, !1707}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !314, file: !313, line: 1217, baseType: !216, size: 960)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !314, file: !313, line: 1218, baseType: !318, size: 64, offset: 960)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !320, line: 44, flags: DIFlagFwdDecl)
!320 = !DIFile(filename: "blender/source/blender/makesdna/DNA_camera_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!321 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !314, file: !313, line: 1220, baseType: !322, size: 64, offset: 1024)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !88, line: 115, size: 11392, elements: !324)
!324 = !{!325, !326, !327, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !344, !354, !367, !368, !409, !410, !413, !414, !430, !431, !432, !433, !434, !435, !436, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !515, !516, !517, !518, !519, !520, !521, !522, !523, !526, !529, !530, !531, !532, !533, !534, !537, !540, !543, !544, !545, !546, !547, !548, !549, !550, !551, !554, !557, !560, !581, !582}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !323, file: !88, line: 116, baseType: !216, size: 960)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !323, file: !88, line: 117, baseType: !318, size: 64, offset: 960)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !323, file: !88, line: 119, baseType: !328, size: 64, offset: 1024)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !88, line: 57, flags: DIFlagFwdDecl)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !323, file: !88, line: 121, baseType: !23, size: 16, offset: 1088)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !323, file: !88, line: 121, baseType: !23, size: 16, offset: 1104)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !323, file: !88, line: 122, baseType: !21, size: 32, offset: 1120)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !323, file: !88, line: 122, baseType: !21, size: 32, offset: 1152)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !323, file: !88, line: 122, baseType: !21, size: 32, offset: 1184)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !323, file: !88, line: 123, baseType: !244, size: 512, offset: 1216)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !323, file: !88, line: 124, baseType: !322, size: 64, offset: 1728)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !323, file: !88, line: 124, baseType: !322, size: 64, offset: 1792)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !323, file: !88, line: 127, baseType: !322, size: 64, offset: 1856)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !323, file: !88, line: 127, baseType: !322, size: 64, offset: 1920)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !323, file: !88, line: 127, baseType: !322, size: 64, offset: 1984)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !323, file: !88, line: 128, baseType: !342, size: 64, offset: 2048)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !320, line: 45, flags: DIFlagFwdDecl)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !323, file: !88, line: 130, baseType: !345, size: 64, offset: 2112)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !88, line: 97, size: 832, elements: !347)
!347 = !{!348, !352, !353}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !346, file: !88, line: 98, baseType: !349, size: 768)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 768, elements: !350)
!350 = !{!351, !144}
!351 = !DISubrange(count: 8)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !346, file: !88, line: 99, baseType: !21, size: 32, offset: 768)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !346, file: !88, line: 99, baseType: !21, size: 32, offset: 800)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !323, file: !88, line: 131, baseType: !355, size: 64, offset: 2176)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !92, line: 486, size: 1600, elements: !357)
!357 = !{!358, !359, !360, !361, !362, !363, !364, !365, !366}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !356, file: !92, line: 487, baseType: !216, size: 960)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !356, file: !92, line: 489, baseType: !59, size: 128, offset: 960)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !356, file: !92, line: 490, baseType: !59, size: 128, offset: 1088)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !356, file: !92, line: 491, baseType: !59, size: 128, offset: 1216)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !356, file: !92, line: 492, baseType: !59, size: 128, offset: 1344)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !356, file: !92, line: 494, baseType: !21, size: 32, offset: 1472)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !356, file: !92, line: 495, baseType: !21, size: 32, offset: 1504)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !356, file: !92, line: 497, baseType: !21, size: 32, offset: 1536)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !356, file: !92, line: 498, baseType: !21, size: 32, offset: 1568)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !323, file: !88, line: 132, baseType: !355, size: 64, offset: 2240)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !323, file: !88, line: 133, baseType: !369, size: 64, offset: 2304)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !92, line: 334, size: 1728, elements: !371)
!371 = !{!372, !373, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !408}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !370, file: !92, line: 335, baseType: !59, size: 128)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !370, file: !92, line: 336, baseType: !374, size: 64, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !92, line: 47, flags: DIFlagFwdDecl)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !370, file: !92, line: 338, baseType: !23, size: 16, offset: 192)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !370, file: !92, line: 338, baseType: !23, size: 16, offset: 208)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !370, file: !92, line: 339, baseType: !79, size: 32, offset: 224)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !370, file: !92, line: 340, baseType: !21, size: 32, offset: 256)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !370, file: !92, line: 342, baseType: !45, size: 32, offset: 288)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !370, file: !92, line: 343, baseType: !142, size: 96, offset: 320)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !370, file: !92, line: 344, baseType: !142, size: 96, offset: 416)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !370, file: !92, line: 347, baseType: !59, size: 128, offset: 512)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !370, file: !92, line: 349, baseType: !21, size: 32, offset: 640)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !370, file: !92, line: 350, baseType: !21, size: 32, offset: 672)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !370, file: !92, line: 351, baseType: !64, size: 64, offset: 704)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !370, file: !92, line: 352, baseType: !64, size: 64, offset: 768)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !370, file: !92, line: 354, baseType: !389, size: 384, offset: 832)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !92, line: 116, baseType: !390)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !92, line: 94, size: 384, elements: !391)
!391 = !{!392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !390, file: !92, line: 96, baseType: !21, size: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !390, file: !92, line: 96, baseType: !21, size: 32, offset: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !390, file: !92, line: 97, baseType: !21, size: 32, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !390, file: !92, line: 97, baseType: !21, size: 32, offset: 96)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !390, file: !92, line: 99, baseType: !23, size: 16, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !390, file: !92, line: 100, baseType: !23, size: 16, offset: 144)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !390, file: !92, line: 102, baseType: !23, size: 16, offset: 160)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !390, file: !92, line: 105, baseType: !23, size: 16, offset: 176)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !390, file: !92, line: 108, baseType: !23, size: 16, offset: 192)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !390, file: !92, line: 109, baseType: !23, size: 16, offset: 208)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !390, file: !92, line: 111, baseType: !23, size: 16, offset: 224)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !390, file: !92, line: 112, baseType: !23, size: 16, offset: 240)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !390, file: !92, line: 114, baseType: !21, size: 32, offset: 256)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !390, file: !92, line: 114, baseType: !21, size: 32, offset: 288)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !390, file: !92, line: 115, baseType: !21, size: 32, offset: 320)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !390, file: !92, line: 115, baseType: !21, size: 32, offset: 352)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !370, file: !92, line: 355, baseType: !244, size: 512, offset: 1216)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !323, file: !88, line: 134, baseType: !64, size: 64, offset: 2368)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !323, file: !88, line: 136, baseType: !411, size: 64, offset: 2432)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !88, line: 58, flags: DIFlagFwdDecl)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !323, file: !88, line: 138, baseType: !389, size: 384, offset: 2496)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !323, file: !88, line: 139, baseType: !415, size: 64, offset: 2880)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !92, line: 80, baseType: !417)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !92, line: 72, size: 192, elements: !418)
!418 = !{!419, !426, !427, !428, !429}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !417, file: !92, line: 73, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !92, line: 59, baseType: !422)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !92, line: 56, size: 128, elements: !423)
!423 = !{!424, !425}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !422, file: !92, line: 57, baseType: !142, size: 96)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !422, file: !92, line: 58, baseType: !21, size: 32, offset: 96)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !417, file: !92, line: 74, baseType: !21, size: 32, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !417, file: !92, line: 76, baseType: !21, size: 32, offset: 96)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !417, file: !92, line: 77, baseType: !21, size: 32, offset: 128)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !417, file: !92, line: 79, baseType: !21, size: 32, offset: 160)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !323, file: !88, line: 141, baseType: !59, size: 128, offset: 2944)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !323, file: !88, line: 142, baseType: !59, size: 128, offset: 3072)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !323, file: !88, line: 143, baseType: !59, size: 128, offset: 3200)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !323, file: !88, line: 144, baseType: !59, size: 128, offset: 3328)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !323, file: !88, line: 146, baseType: !21, size: 32, offset: 3456)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !323, file: !88, line: 147, baseType: !21, size: 32, offset: 3488)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !323, file: !88, line: 150, baseType: !437, size: 64, offset: 3520)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !323, file: !88, line: 151, baseType: !105, size: 64, offset: 3584)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !323, file: !88, line: 152, baseType: !21, size: 32, offset: 3648)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !323, file: !88, line: 153, baseType: !21, size: 32, offset: 3680)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !323, file: !88, line: 156, baseType: !142, size: 96, offset: 3712)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !323, file: !88, line: 156, baseType: !142, size: 96, offset: 3808)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !323, file: !88, line: 156, baseType: !142, size: 96, offset: 3904)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !323, file: !88, line: 157, baseType: !142, size: 96, offset: 4000)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !323, file: !88, line: 158, baseType: !142, size: 96, offset: 4096)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !323, file: !88, line: 159, baseType: !142, size: 96, offset: 4192)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !323, file: !88, line: 160, baseType: !142, size: 96, offset: 4288)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !323, file: !88, line: 160, baseType: !142, size: 96, offset: 4384)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !323, file: !88, line: 161, baseType: !450, size: 128, offset: 4480)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 128, elements: !451)
!451 = !{!151}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !323, file: !88, line: 161, baseType: !450, size: 128, offset: 4608)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !323, file: !88, line: 162, baseType: !142, size: 96, offset: 4736)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !323, file: !88, line: 162, baseType: !142, size: 96, offset: 4832)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !323, file: !88, line: 163, baseType: !45, size: 32, offset: 4928)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !323, file: !88, line: 163, baseType: !45, size: 32, offset: 4960)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !323, file: !88, line: 164, baseType: !149, size: 512, offset: 4992)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !323, file: !88, line: 165, baseType: !149, size: 512, offset: 5504)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !323, file: !88, line: 166, baseType: !149, size: 512, offset: 6016)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !323, file: !88, line: 167, baseType: !149, size: 512, offset: 6528)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !323, file: !88, line: 176, baseType: !149, size: 512, offset: 7040)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !323, file: !88, line: 178, baseType: !79, size: 32, offset: 7552)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !323, file: !88, line: 180, baseType: !23, size: 16, offset: 7584)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !323, file: !88, line: 181, baseType: !23, size: 16, offset: 7600)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !323, file: !88, line: 183, baseType: !23, size: 16, offset: 7616)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !323, file: !88, line: 183, baseType: !23, size: 16, offset: 7632)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !323, file: !88, line: 184, baseType: !23, size: 16, offset: 7648)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !323, file: !88, line: 184, baseType: !23, size: 16, offset: 7664)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !323, file: !88, line: 185, baseType: !23, size: 16, offset: 7680)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !323, file: !88, line: 186, baseType: !23, size: 16, offset: 7696)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !323, file: !88, line: 187, baseType: !23, size: 16, offset: 7712)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !323, file: !88, line: 188, baseType: !17, size: 8, offset: 7728)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !323, file: !88, line: 189, baseType: !17, size: 8, offset: 7736)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !323, file: !88, line: 192, baseType: !21, size: 32, offset: 7744)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !323, file: !88, line: 192, baseType: !21, size: 32, offset: 7776)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !323, file: !88, line: 192, baseType: !21, size: 32, offset: 7808)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !323, file: !88, line: 192, baseType: !21, size: 32, offset: 7840)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !323, file: !88, line: 194, baseType: !21, size: 32, offset: 7872)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !323, file: !88, line: 202, baseType: !45, size: 32, offset: 7904)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !323, file: !88, line: 202, baseType: !45, size: 32, offset: 7936)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !323, file: !88, line: 202, baseType: !45, size: 32, offset: 7968)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !323, file: !88, line: 211, baseType: !45, size: 32, offset: 8000)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !323, file: !88, line: 212, baseType: !45, size: 32, offset: 8032)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !323, file: !88, line: 213, baseType: !45, size: 32, offset: 8064)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !323, file: !88, line: 214, baseType: !45, size: 32, offset: 8096)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !323, file: !88, line: 215, baseType: !45, size: 32, offset: 8128)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !323, file: !88, line: 216, baseType: !45, size: 32, offset: 8160)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !323, file: !88, line: 219, baseType: !45, size: 32, offset: 8192)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !323, file: !88, line: 220, baseType: !45, size: 32, offset: 8224)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !323, file: !88, line: 221, baseType: !45, size: 32, offset: 8256)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !323, file: !88, line: 224, baseType: !492, size: 16, offset: 8288)
!492 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !323, file: !88, line: 224, baseType: !492, size: 16, offset: 8304)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !323, file: !88, line: 226, baseType: !23, size: 16, offset: 8320)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !323, file: !88, line: 228, baseType: !17, size: 8, offset: 8336)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !323, file: !88, line: 229, baseType: !17, size: 8, offset: 8344)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !323, file: !88, line: 231, baseType: !23, size: 16, offset: 8352)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !323, file: !88, line: 232, baseType: !17, size: 8, offset: 8368)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !323, file: !88, line: 233, baseType: !17, size: 8, offset: 8376)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !323, file: !88, line: 234, baseType: !45, size: 32, offset: 8384)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !323, file: !88, line: 235, baseType: !45, size: 32, offset: 8416)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !323, file: !88, line: 237, baseType: !59, size: 128, offset: 8448)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !323, file: !88, line: 238, baseType: !59, size: 128, offset: 8576)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !323, file: !88, line: 239, baseType: !59, size: 128, offset: 8704)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !323, file: !88, line: 240, baseType: !59, size: 128, offset: 8832)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !323, file: !88, line: 242, baseType: !45, size: 32, offset: 8960)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !323, file: !88, line: 244, baseType: !23, size: 16, offset: 8992)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !323, file: !88, line: 245, baseType: !492, size: 16, offset: 9008)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !323, file: !88, line: 246, baseType: !450, size: 128, offset: 9024)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !323, file: !88, line: 248, baseType: !21, size: 32, offset: 9152)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !323, file: !88, line: 249, baseType: !21, size: 32, offset: 9184)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !323, file: !88, line: 251, baseType: !513, size: 64, offset: 9216)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !88, line: 251, flags: DIFlagFwdDecl)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !323, file: !88, line: 253, baseType: !17, size: 8, offset: 9280)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !323, file: !88, line: 254, baseType: !17, size: 8, offset: 9288)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !323, file: !88, line: 255, baseType: !23, size: 16, offset: 9296)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !323, file: !88, line: 256, baseType: !142, size: 96, offset: 9312)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !323, file: !88, line: 258, baseType: !59, size: 128, offset: 9408)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !323, file: !88, line: 259, baseType: !59, size: 128, offset: 9536)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !323, file: !88, line: 260, baseType: !59, size: 128, offset: 9664)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !323, file: !88, line: 261, baseType: !59, size: 128, offset: 9792)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !323, file: !88, line: 263, baseType: !524, size: 64, offset: 9920)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !88, line: 52, flags: DIFlagFwdDecl)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !323, file: !88, line: 264, baseType: !527, size: 64, offset: 9984)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !88, line: 53, flags: DIFlagFwdDecl)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !323, file: !88, line: 265, baseType: !90, size: 64, offset: 10048)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !323, file: !88, line: 267, baseType: !17, size: 8, offset: 10112)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !323, file: !88, line: 268, baseType: !17, size: 8, offset: 10120)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !323, file: !88, line: 269, baseType: !23, size: 16, offset: 10128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !323, file: !88, line: 270, baseType: !45, size: 32, offset: 10144)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !323, file: !88, line: 272, baseType: !535, size: 64, offset: 10176)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !88, line: 54, flags: DIFlagFwdDecl)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !323, file: !88, line: 275, baseType: !538, size: 64, offset: 10240)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !88, line: 275, flags: DIFlagFwdDecl)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !323, file: !88, line: 277, baseType: !541, size: 64, offset: 10304)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !88, line: 56, flags: DIFlagFwdDecl)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !323, file: !88, line: 277, baseType: !541, size: 64, offset: 10368)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !323, file: !88, line: 278, baseType: !204, size: 64, offset: 10432)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !323, file: !88, line: 279, baseType: !204, size: 64, offset: 10496)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !323, file: !88, line: 280, baseType: !79, size: 32, offset: 10560)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !323, file: !88, line: 281, baseType: !79, size: 32, offset: 10592)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !323, file: !88, line: 283, baseType: !59, size: 128, offset: 10624)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !323, file: !88, line: 284, baseType: !59, size: 128, offset: 10752)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !323, file: !88, line: 285, baseType: !183, size: 64, offset: 10880)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !323, file: !88, line: 287, baseType: !552, size: 64, offset: 10944)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !88, line: 59, flags: DIFlagFwdDecl)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !323, file: !88, line: 288, baseType: !555, size: 64, offset: 11008)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !88, line: 288, flags: DIFlagFwdDecl)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !323, file: !88, line: 290, baseType: !558, size: 64, offset: 11072)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 64, elements: !559)
!559 = !{!180}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !323, file: !88, line: 291, baseType: !561, size: 64, offset: 11136)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !563, line: 65, baseType: !564)
!563 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !563, line: 50, size: 320, elements: !565)
!565 = !{!566, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !564, file: !563, line: 51, baseType: !567, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !564, file: !563, line: 53, baseType: !21, size: 32, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !564, file: !563, line: 54, baseType: !21, size: 32, offset: 96)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !564, file: !563, line: 55, baseType: !21, size: 32, offset: 128)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !564, file: !563, line: 55, baseType: !21, size: 32, offset: 160)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !564, file: !563, line: 56, baseType: !17, size: 8, offset: 192)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !564, file: !563, line: 56, baseType: !17, size: 8, offset: 200)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !564, file: !563, line: 57, baseType: !17, size: 8, offset: 208)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !564, file: !563, line: 57, baseType: !17, size: 8, offset: 216)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !564, file: !563, line: 59, baseType: !23, size: 16, offset: 224)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !564, file: !563, line: 59, baseType: !23, size: 16, offset: 240)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !564, file: !563, line: 59, baseType: !23, size: 16, offset: 256)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !564, file: !563, line: 61, baseType: !23, size: 16, offset: 272)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !564, file: !563, line: 63, baseType: !21, size: 32, offset: 288)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !323, file: !88, line: 293, baseType: !59, size: 128, offset: 11200)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !323, file: !88, line: 294, baseType: !583, size: 64, offset: 11328)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !88, line: 113, baseType: !585)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !88, line: 108, size: 256, elements: !586)
!586 = !{!587, !589, !590, !591, !592}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !585, file: !88, line: 109, baseType: !588, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !585, file: !88, line: 109, baseType: !588, size: 64, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !585, file: !88, line: 110, baseType: !322, size: 64, offset: 128)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !585, file: !88, line: 111, baseType: !21, size: 32, offset: 192)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !585, file: !88, line: 112, baseType: !45, size: 32, offset: 224)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !314, file: !313, line: 1221, baseType: !594, size: 64, offset: 1088)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !596, line: 52, size: 4224, elements: !597)
!596 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!597 = !{!598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !1092, !1093, !1094, !1095, !1096}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !595, file: !596, line: 53, baseType: !216, size: 960)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !595, file: !596, line: 54, baseType: !318, size: 64, offset: 960)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !595, file: !596, line: 56, baseType: !23, size: 16, offset: 1024)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !595, file: !596, line: 56, baseType: !23, size: 16, offset: 1040)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !595, file: !596, line: 57, baseType: !23, size: 16, offset: 1056)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !595, file: !596, line: 57, baseType: !23, size: 16, offset: 1072)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !595, file: !596, line: 59, baseType: !45, size: 32, offset: 1088)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !595, file: !596, line: 59, baseType: !45, size: 32, offset: 1120)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !595, file: !596, line: 59, baseType: !45, size: 32, offset: 1152)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !595, file: !596, line: 60, baseType: !45, size: 32, offset: 1184)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !595, file: !596, line: 60, baseType: !45, size: 32, offset: 1216)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !595, file: !596, line: 60, baseType: !45, size: 32, offset: 1248)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !595, file: !596, line: 61, baseType: !45, size: 32, offset: 1280)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !595, file: !596, line: 61, baseType: !45, size: 32, offset: 1312)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !595, file: !596, line: 61, baseType: !45, size: 32, offset: 1344)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !595, file: !596, line: 68, baseType: !45, size: 32, offset: 1376)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !595, file: !596, line: 68, baseType: !45, size: 32, offset: 1408)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !595, file: !596, line: 68, baseType: !45, size: 32, offset: 1440)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !595, file: !596, line: 69, baseType: !45, size: 32, offset: 1472)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !595, file: !596, line: 69, baseType: !45, size: 32, offset: 1504)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !595, file: !596, line: 74, baseType: !45, size: 32, offset: 1536)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !595, file: !596, line: 79, baseType: !45, size: 32, offset: 1568)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !595, file: !596, line: 81, baseType: !23, size: 16, offset: 1600)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !595, file: !596, line: 91, baseType: !23, size: 16, offset: 1616)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !595, file: !596, line: 92, baseType: !23, size: 16, offset: 1632)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !595, file: !596, line: 93, baseType: !23, size: 16, offset: 1648)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !595, file: !596, line: 94, baseType: !23, size: 16, offset: 1664)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !595, file: !596, line: 94, baseType: !23, size: 16, offset: 1680)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !595, file: !596, line: 94, baseType: !23, size: 16, offset: 1696)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !595, file: !596, line: 94, baseType: !23, size: 16, offset: 1712)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !595, file: !596, line: 96, baseType: !45, size: 32, offset: 1728)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !595, file: !596, line: 96, baseType: !45, size: 32, offset: 1760)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !595, file: !596, line: 96, baseType: !45, size: 32, offset: 1792)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !595, file: !596, line: 96, baseType: !45, size: 32, offset: 1824)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !595, file: !596, line: 98, baseType: !45, size: 32, offset: 1856)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !595, file: !596, line: 98, baseType: !45, size: 32, offset: 1888)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !595, file: !596, line: 98, baseType: !45, size: 32, offset: 1920)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !595, file: !596, line: 98, baseType: !45, size: 32, offset: 1952)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !595, file: !596, line: 99, baseType: !45, size: 32, offset: 1984)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !595, file: !596, line: 99, baseType: !45, size: 32, offset: 2016)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !595, file: !596, line: 100, baseType: !45, size: 32, offset: 2048)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !595, file: !596, line: 100, baseType: !45, size: 32, offset: 2080)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !595, file: !596, line: 103, baseType: !23, size: 16, offset: 2112)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !595, file: !596, line: 103, baseType: !23, size: 16, offset: 2128)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !595, file: !596, line: 103, baseType: !23, size: 16, offset: 2144)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !595, file: !596, line: 103, baseType: !23, size: 16, offset: 2160)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !595, file: !596, line: 106, baseType: !45, size: 32, offset: 2176)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !595, file: !596, line: 106, baseType: !45, size: 32, offset: 2208)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !595, file: !596, line: 106, baseType: !45, size: 32, offset: 2240)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !595, file: !596, line: 106, baseType: !45, size: 32, offset: 2272)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !595, file: !596, line: 107, baseType: !23, size: 16, offset: 2304)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !595, file: !596, line: 107, baseType: !23, size: 16, offset: 2320)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !595, file: !596, line: 107, baseType: !23, size: 16, offset: 2336)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !595, file: !596, line: 107, baseType: !23, size: 16, offset: 2352)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !595, file: !596, line: 108, baseType: !45, size: 32, offset: 2368)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !595, file: !596, line: 108, baseType: !45, size: 32, offset: 2400)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !595, file: !596, line: 109, baseType: !45, size: 32, offset: 2432)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !595, file: !596, line: 109, baseType: !45, size: 32, offset: 2464)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !595, file: !596, line: 110, baseType: !45, size: 32, offset: 2496)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !595, file: !596, line: 110, baseType: !45, size: 32, offset: 2528)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !595, file: !596, line: 110, baseType: !45, size: 32, offset: 2560)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !595, file: !596, line: 111, baseType: !23, size: 16, offset: 2592)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !595, file: !596, line: 111, baseType: !23, size: 16, offset: 2608)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !595, file: !596, line: 112, baseType: !23, size: 16, offset: 2624)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !595, file: !596, line: 112, baseType: !23, size: 16, offset: 2640)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !595, file: !596, line: 112, baseType: !23, size: 16, offset: 2656)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !595, file: !596, line: 115, baseType: !23, size: 16, offset: 2672)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !595, file: !596, line: 118, baseType: !44, size: 64, offset: 2688)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !595, file: !596, line: 118, baseType: !44, size: 64, offset: 2752)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !595, file: !596, line: 121, baseType: !342, size: 64, offset: 2816)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !595, file: !596, line: 122, baseType: !669, size: 1152, offset: 2880)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !670, size: 1152, elements: !1090)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !672, line: 57, size: 2496, elements: !673)
!672 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!673 = !{!674, !675, !676, !677, !678, !679, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !671, file: !672, line: 59, baseType: !23, size: 16)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !671, file: !672, line: 59, baseType: !23, size: 16, offset: 16)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !671, file: !672, line: 59, baseType: !23, size: 16, offset: 32)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !671, file: !672, line: 59, baseType: !23, size: 16, offset: 48)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !671, file: !672, line: 60, baseType: !322, size: 64, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !671, file: !672, line: 61, baseType: !680, size: 64, offset: 128)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !672, line: 202, size: 3328, elements: !682)
!682 = !{!683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !738, !739, !818, !841, !931, !932, !1000, !1021, !1029, !1030}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !681, file: !672, line: 203, baseType: !216, size: 960)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !681, file: !672, line: 204, baseType: !318, size: 64, offset: 960)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !681, file: !672, line: 206, baseType: !45, size: 32, offset: 1024)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !681, file: !672, line: 206, baseType: !45, size: 32, offset: 1056)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !681, file: !672, line: 207, baseType: !45, size: 32, offset: 1088)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !681, file: !672, line: 207, baseType: !45, size: 32, offset: 1120)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !681, file: !672, line: 207, baseType: !45, size: 32, offset: 1152)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !681, file: !672, line: 207, baseType: !45, size: 32, offset: 1184)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !681, file: !672, line: 207, baseType: !45, size: 32, offset: 1216)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !681, file: !672, line: 207, baseType: !45, size: 32, offset: 1248)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !681, file: !672, line: 208, baseType: !45, size: 32, offset: 1280)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !681, file: !672, line: 208, baseType: !45, size: 32, offset: 1312)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !681, file: !672, line: 211, baseType: !45, size: 32, offset: 1344)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !681, file: !672, line: 211, baseType: !45, size: 32, offset: 1376)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !681, file: !672, line: 211, baseType: !45, size: 32, offset: 1408)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !681, file: !672, line: 211, baseType: !45, size: 32, offset: 1440)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !681, file: !672, line: 211, baseType: !45, size: 32, offset: 1472)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !681, file: !672, line: 214, baseType: !45, size: 32, offset: 1504)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !681, file: !672, line: 214, baseType: !45, size: 32, offset: 1536)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !681, file: !672, line: 217, baseType: !45, size: 32, offset: 1568)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !681, file: !672, line: 218, baseType: !45, size: 32, offset: 1600)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !681, file: !672, line: 219, baseType: !45, size: 32, offset: 1632)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !681, file: !672, line: 220, baseType: !45, size: 32, offset: 1664)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !681, file: !672, line: 221, baseType: !45, size: 32, offset: 1696)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !681, file: !672, line: 222, baseType: !23, size: 16, offset: 1728)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !681, file: !672, line: 222, baseType: !23, size: 16, offset: 1744)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !681, file: !672, line: 224, baseType: !23, size: 16, offset: 1760)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !681, file: !672, line: 224, baseType: !23, size: 16, offset: 1776)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !681, file: !672, line: 227, baseType: !23, size: 16, offset: 1792)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !681, file: !672, line: 227, baseType: !23, size: 16, offset: 1808)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !681, file: !672, line: 229, baseType: !23, size: 16, offset: 1824)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !681, file: !672, line: 229, baseType: !23, size: 16, offset: 1840)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !681, file: !672, line: 230, baseType: !23, size: 16, offset: 1856)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !681, file: !672, line: 230, baseType: !23, size: 16, offset: 1872)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !681, file: !672, line: 232, baseType: !45, size: 32, offset: 1888)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !681, file: !672, line: 232, baseType: !45, size: 32, offset: 1920)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !681, file: !672, line: 232, baseType: !45, size: 32, offset: 1952)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !681, file: !672, line: 232, baseType: !45, size: 32, offset: 1984)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !681, file: !672, line: 233, baseType: !21, size: 32, offset: 2016)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !681, file: !672, line: 234, baseType: !21, size: 32, offset: 2048)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !681, file: !672, line: 235, baseType: !23, size: 16, offset: 2080)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !681, file: !672, line: 235, baseType: !23, size: 16, offset: 2096)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !681, file: !672, line: 236, baseType: !23, size: 16, offset: 2112)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !681, file: !672, line: 239, baseType: !23, size: 16, offset: 2128)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !681, file: !672, line: 240, baseType: !21, size: 32, offset: 2144)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !681, file: !672, line: 241, baseType: !21, size: 32, offset: 2176)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !681, file: !672, line: 241, baseType: !21, size: 32, offset: 2208)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !681, file: !672, line: 241, baseType: !21, size: 32, offset: 2240)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !681, file: !672, line: 243, baseType: !45, size: 32, offset: 2272)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !681, file: !672, line: 243, baseType: !45, size: 32, offset: 2304)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !681, file: !672, line: 244, baseType: !45, size: 32, offset: 2336)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !681, file: !672, line: 246, baseType: !564, size: 320, offset: 2368)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !681, file: !672, line: 248, baseType: !736, size: 64, offset: 2688)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !672, line: 248, flags: DIFlagFwdDecl)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !681, file: !672, line: 249, baseType: !342, size: 64, offset: 2752)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !681, file: !672, line: 250, baseType: !740, size: 64, offset: 2816)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !563, line: 77, size: 15424, elements: !742)
!742 = !{!743, !744, !745, !748, !751, !754, !755, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !774, !775, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !807, !808, !812}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !741, file: !563, line: 78, baseType: !216, size: 960)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !741, file: !563, line: 80, baseType: !196, size: 8192, offset: 960)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !741, file: !563, line: 82, baseType: !746, size: 64, offset: 9152)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !563, line: 43, flags: DIFlagFwdDecl)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !741, file: !563, line: 83, baseType: !749, size: 64, offset: 9216)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !213, line: 46, flags: DIFlagFwdDecl)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !741, file: !563, line: 86, baseType: !752, size: 64, offset: 9280)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !563, line: 41, flags: DIFlagFwdDecl)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !741, file: !563, line: 87, baseType: !35, size: 64, offset: 9344)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !741, file: !563, line: 89, baseType: !756, size: 512, offset: 9408)
!756 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 512, elements: !757)
!757 = !{!351}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !741, file: !563, line: 90, baseType: !23, size: 16, offset: 9920)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !741, file: !563, line: 90, baseType: !23, size: 16, offset: 9936)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !741, file: !563, line: 92, baseType: !23, size: 16, offset: 9952)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !741, file: !563, line: 92, baseType: !23, size: 16, offset: 9968)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !741, file: !563, line: 93, baseType: !23, size: 16, offset: 9984)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !741, file: !563, line: 93, baseType: !23, size: 16, offset: 10000)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !741, file: !563, line: 94, baseType: !21, size: 32, offset: 10016)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !741, file: !563, line: 97, baseType: !23, size: 16, offset: 10048)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !741, file: !563, line: 97, baseType: !23, size: 16, offset: 10064)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !741, file: !563, line: 98, baseType: !23, size: 16, offset: 10080)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !741, file: !563, line: 98, baseType: !23, size: 16, offset: 10096)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !741, file: !563, line: 99, baseType: !23, size: 16, offset: 10112)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !741, file: !563, line: 99, baseType: !23, size: 16, offset: 10128)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !741, file: !563, line: 100, baseType: !79, size: 32, offset: 10144)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !741, file: !563, line: 101, baseType: !773, size: 64, offset: 10176)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !741, file: !563, line: 103, baseType: !267, size: 64, offset: 10240)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !741, file: !563, line: 104, baseType: !776, size: 64, offset: 10304)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !213, line: 159, size: 448, elements: !778)
!778 = !{!779, !781, !782, !784, !785, !787}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !777, file: !213, line: 161, baseType: !780, size: 64)
!780 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 64, elements: !559)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !777, file: !213, line: 162, baseType: !780, size: 64, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !777, file: !213, line: 163, baseType: !783, size: 32, offset: 128)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 32, elements: !559)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !777, file: !213, line: 164, baseType: !783, size: 32, offset: 160)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !777, file: !213, line: 165, baseType: !786, size: 128, offset: 192)
!786 = !DICompositeType(tag: DW_TAG_array_type, baseType: !773, size: 128, elements: !559)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !777, file: !213, line: 166, baseType: !788, size: 128, offset: 320)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !749, size: 128, elements: !559)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !741, file: !563, line: 107, baseType: !45, size: 32, offset: 10368)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !741, file: !563, line: 108, baseType: !21, size: 32, offset: 10400)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !741, file: !563, line: 109, baseType: !23, size: 16, offset: 10432)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !741, file: !563, line: 110, baseType: !23, size: 16, offset: 10448)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !741, file: !563, line: 113, baseType: !21, size: 32, offset: 10464)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !741, file: !563, line: 113, baseType: !21, size: 32, offset: 10496)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !741, file: !563, line: 114, baseType: !17, size: 8, offset: 10528)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !741, file: !563, line: 114, baseType: !17, size: 8, offset: 10536)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !741, file: !563, line: 115, baseType: !23, size: 16, offset: 10544)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !741, file: !563, line: 116, baseType: !450, size: 128, offset: 10560)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !741, file: !563, line: 119, baseType: !45, size: 32, offset: 10688)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !741, file: !563, line: 119, baseType: !45, size: 32, offset: 10720)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !741, file: !563, line: 122, baseType: !802, size: 512, offset: 10752)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !803, line: 182, baseType: !804)
!803 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !803, line: 180, size: 512, elements: !805)
!805 = !{!806}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !804, file: !803, line: 181, baseType: !244, size: 512)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !741, file: !563, line: 123, baseType: !17, size: 8, offset: 11264)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !741, file: !563, line: 125, baseType: !809, size: 56, offset: 11272)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 56, elements: !810)
