; ModuleID = 'blender/source/blender/blenkernel/intern/mask.c'
source_filename = "blender/source/blender/blenkernel/intern/mask.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.anon.0 = type { %struct.ListBase, %struct.GHash* }
%struct.ListBase = type { i8*, i8* }
%struct.GHash = type opaque
%struct.BezTriple = type { [3 x [3 x float]], float, float, float, i8, i8, i8, i8, i8, i8, i8, i8, float, float, float, [4 x i8] }
%struct.MaskSpline = type { %struct.MaskSpline*, %struct.MaskSpline*, i16, i8, i8, i32, %struct.MaskSplinePoint*, %struct.MaskParent, %struct.MaskSplinePoint* }
%struct.MaskParent = type { i32, i32, %struct.ID*, [64 x i8], [64 x i8], [2 x float], [4 x [2 x float]] }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.FileData = type opaque
%struct.PackedFile = type opaque
%struct.IDProperty = type { %struct.IDProperty*, %struct.IDProperty*, i8, i8, i16, [64 x i8], i32, %struct.IDPropertyData, i32, i32 }
%struct.IDPropertyData = type { i8*, %struct.ListBase, i32, i32 }
%struct.MaskSplinePoint = type { %struct.BezTriple, i32, i32, %struct.MaskSplinePointUW*, %struct.MaskParent }
%struct.MaskSplinePointUW = type { float, float, i32 }

!15 = !DIEnumerator(name: "MASK_BLEND_SUBTRACT", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "MASK_BLEND_LIGHTEN", value: 2, isUnsigned: true)
!17 = !DIEnumerator(name: "MASK_BLEND_DARKEN", value: 3, isUnsigned: true)
!18 = !DIEnumerator(name: "MASK_BLEND_MUL", value: 4, isUnsigned: true)
!19 = !DIEnumerator(name: "MASK_BLEND_REPLACE", value: 5, isUnsigned: true)
!20 = !DIEnumerator(name: "MASK_BLEND_DIFFERENCE", value: 6, isUnsigned: true)
!21 = !DIEnumerator(name: "MASK_BLEND_MERGE_ADD", value: 7, isUnsigned: true)
!22 = !DIEnumerator(name: "MASK_BLEND_MERGE_SUBTRACT", value: 8, isUnsigned: true)
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 217, baseType: !7, size: 32, elements: !24)
!24 = !{!25, !26, !27, !28}
!25 = !DIEnumerator(name: "MASK_LAYERFLAG_LOCKED", value: 16, isUnsigned: true)
!26 = !DIEnumerator(name: "MASK_LAYERFLAG_SELECT", value: 32, isUnsigned: true)
!27 = !DIEnumerator(name: "MASK_LAYERFLAG_FILL_DISCRETE", value: 64, isUnsigned: true)
!28 = !DIEnumerator(name: "MASK_LAYERFLAG_FILL_OVERLAP", value: 128, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 162, baseType: !7, size: 32, elements: !30)
!30 = !{!31, !32}
!31 = !DIEnumerator(name: "MASK_SPLINE_INTERP_LINEAR", value: 1, isUnsigned: true)
!32 = !DIEnumerator(name: "MASK_SPLINE_INTERP_EASE", value: 2, isUnsigned: true)
!33 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !34, line: 95, baseType: !35, size: 32, elements: !36)
!34 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_mask.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!35 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!36 = !{!37, !38, !39}
!37 = !DIEnumerator(name: "MASK_PROJ_NEG", value: -1)
!38 = !DIEnumerator(name: "MASK_PROJ_ANY", value: 0)
!39 = !DIEnumerator(name: "MASK_PROJ_POS", value: 1)
!40 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !34, line: 59, baseType: !7, size: 32, elements: !41)
!41 = !{!42, !43}
!42 = !DIEnumerator(name: "MASK_HANDLE_MODE_STICK", value: 1, isUnsigned: true)
!43 = !DIEnumerator(name: "MASK_HANDLE_MODE_INDIVIDUAL_HANDLES", value: 2, isUnsigned: true)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBezTriple_Handle", file: !45, line: 361, baseType: !7, size: 32, elements: !46)
!45 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!46 = !{!47, !48, !49, !50, !51, !52}
!47 = !DIEnumerator(name: "HD_FREE", value: 0, isUnsigned: true)
!48 = !DIEnumerator(name: "HD_AUTO", value: 1, isUnsigned: true)
!49 = !DIEnumerator(name: "HD_VECT", value: 2, isUnsigned: true)
!50 = !DIEnumerator(name: "HD_ALIGN", value: 3, isUnsigned: true)
!51 = !DIEnumerator(name: "HD_AUTO_ANIM", value: 4, isUnsigned: true)
!52 = !DIEnumerator(name: "HD_ALIGN_DOUBLESIDE", value: 5, isUnsigned: true)
!53 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !34, line: 51, baseType: !7, size: 32, elements: !54)
!54 = !{!55, !56, !57, !58, !59}
!55 = !DIEnumerator(name: "MASK_WHICH_HANDLE_NONE", value: 0, isUnsigned: true)
!56 = !DIEnumerator(name: "MASK_WHICH_HANDLE_STICK", value: 1, isUnsigned: true)
!57 = !DIEnumerator(name: "MASK_WHICH_HANDLE_LEFT", value: 2, isUnsigned: true)
!58 = !DIEnumerator(name: "MASK_WHICH_HANDLE_RIGHT", value: 3, isUnsigned: true)
!59 = !DIEnumerator(name: "MASK_WHICH_HANDLE_BOTH", value: 4, isUnsigned: true)
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 148, baseType: !7, size: 32, elements: !61)
!61 = !{!62, !63}
!62 = !DIEnumerator(name: "MASK_PARENT_POINT_TRACK", value: 0, isUnsigned: true)
!63 = !DIEnumerator(name: "MASK_PARENT_PLANE_TRACK", value: 1, isUnsigned: true)
!64 = !{!65, !71, !74, !75, !544, !134, !2305, !2307, !1016, !2309}
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "MaskLayerShapeElem", file: !6, line: 120, baseType: !67)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MaskLayerShapeElem", file: !6, line: 118, size: 256, elements: !68)
!68 = !{!69}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !67, file: !6, line: 119, baseType: !70, size: 256)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 256, elements: !72)
!71 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!72 = !{!73}
!73 = !DISubrange(count: 8)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceClip", file: !77, line: 1110, baseType: !78)
!77 = !DIFile(filename: "blender/source/blender/makesdna/DNA_space_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceClip", file: !77, line: 1074, size: 3264, elements: !79)
!79 = !{!80, !100, !101, !102, !103, !104, !105, !106, !107, !108, !115, !483, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !78, file: !77, line: 1075, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceLink", file: !77, line: 91, baseType: !83)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !77, line: 85, size: 448, elements: !84)
!84 = !{!85, !87, !88, !95, !96, !97}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !83, file: !77, line: 86, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !83, file: !77, line: 86, baseType: !86, size: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !83, file: !77, line: 87, baseType: !89, size: 128, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !90, line: 71, baseType: !91)
!90 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !90, line: 69, size: 128, elements: !92)
!92 = !{!93, !94}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !91, file: !90, line: 70, baseType: !74, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !91, file: !90, line: 70, baseType: !74, size: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !83, file: !77, line: 88, baseType: !35, size: 32, offset: 256)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !83, file: !77, line: 89, baseType: !71, size: 32, offset: 288)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !83, file: !77, line: 90, baseType: !98, size: 128, offset: 320)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 128, elements: !72)
!99 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !78, file: !77, line: 1075, baseType: !81, size: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !78, file: !77, line: 1076, baseType: !89, size: 128, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !78, file: !77, line: 1077, baseType: !35, size: 32, offset: 256)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "xof", scope: !78, file: !77, line: 1079, baseType: !71, size: 32, offset: 288)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "yof", scope: !78, file: !77, line: 1079, baseType: !71, size: 32, offset: 320)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "xlockof", scope: !78, file: !77, line: 1080, baseType: !71, size: 32, offset: 352)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "ylockof", scope: !78, file: !77, line: 1080, baseType: !71, size: 32, offset: 384)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "zoom", scope: !78, file: !77, line: 1081, baseType: !71, size: 32, offset: 416)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !78, file: !77, line: 1083, baseType: !109, size: 64, offset: 448)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipUser", file: !110, line: 50, size: 64, elements: !111)
!110 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!111 = !{!112, !113, !114}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !109, file: !110, line: 51, baseType: !35, size: 32)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "render_size", scope: !109, file: !110, line: 52, baseType: !99, size: 16, offset: 32)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "render_flag", scope: !109, file: !110, line: 52, baseType: !99, size: 16, offset: 48)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !78, file: !77, line: 1084, baseType: !116, size: 64, offset: 512)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !110, line: 64, size: 19136, elements: !118)
!118 = !{!119, !182, !185, !186, !187, !188, !192, !193, !194, !198, !201, !205, !466, !467, !478, !479, !480, !481, !482}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !117, file: !110, line: 65, baseType: !120, size: 960)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !121, line: 130, baseType: !122)
!121 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !121, line: 117, size: 960, elements: !123)
!123 = !{!124, !125, !126, !128, !148, !152, !153, !154, !155, !156}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !122, file: !121, line: 118, baseType: !74, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !122, file: !121, line: 118, baseType: !74, size: 64, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !122, file: !121, line: 119, baseType: !127, size: 64, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !122, file: !121, line: 120, baseType: !129, size: 64, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !121, line: 136, size: 17600, elements: !131)
!131 = !{!132, !133, !135, !138, !143, !144, !145}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !130, file: !121, line: 137, baseType: !120, size: 960)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !130, file: !121, line: 138, baseType: !134, size: 64, offset: 960)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !130, file: !121, line: 139, baseType: !136, size: 64, offset: 1024)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !121, line: 43, flags: DIFlagFwdDecl)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !130, file: !121, line: 140, baseType: !139, size: 8192, offset: 1088)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 8192, elements: !141)
!140 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!141 = !{!142}
!142 = !DISubrange(count: 1024)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !130, file: !121, line: 141, baseType: !139, size: 8192, offset: 9280)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !130, file: !121, line: 148, baseType: !129, size: 64, offset: 17472)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !130, file: !121, line: 150, baseType: !146, size: 64, offset: 17536)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !121, line: 45, flags: DIFlagFwdDecl)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !122, file: !121, line: 121, baseType: !149, size: 528, offset: 256)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 528, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 66)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !122, file: !121, line: 126, baseType: !99, size: 16, offset: 784)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !122, file: !121, line: 127, baseType: !35, size: 32, offset: 800)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !122, file: !121, line: 128, baseType: !35, size: 32, offset: 832)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !122, file: !121, line: 128, baseType: !35, size: 32, offset: 864)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !122, file: !121, line: 129, baseType: !157, size: 64, offset: 896)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !121, line: 75, baseType: !159)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !121, line: 62, size: 1024, elements: !160)
!160 = !{!161, !163, !164, !165, !166, !167, !171, !172, !180, !181}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !159, file: !121, line: 63, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !159, file: !121, line: 63, baseType: !162, size: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !159, file: !121, line: 64, baseType: !140, size: 8, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !159, file: !121, line: 64, baseType: !140, size: 8, offset: 136)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !159, file: !121, line: 65, baseType: !99, size: 16, offset: 144)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !159, file: !121, line: 66, baseType: !168, size: 512, offset: 160)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 512, elements: !169)
!169 = !{!170}
!170 = !DISubrange(count: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !159, file: !121, line: 67, baseType: !35, size: 32, offset: 672)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !159, file: !121, line: 69, baseType: !173, size: 256, offset: 704)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !121, line: 60, baseType: !174)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !121, line: 48, size: 256, elements: !175)
!175 = !{!176, !177, !178, !179}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !174, file: !121, line: 49, baseType: !74, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !174, file: !121, line: 58, baseType: !89, size: 128, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !174, file: !121, line: 59, baseType: !35, size: 32, offset: 192)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !174, file: !121, line: 59, baseType: !35, size: 32, offset: 224)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !159, file: !121, line: 70, baseType: !35, size: 32, offset: 960)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !159, file: !121, line: 74, baseType: !35, size: 32, offset: 992)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !117, file: !110, line: 66, baseType: !183, size: 64, offset: 960)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !45, line: 48, flags: DIFlagFwdDecl)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !117, file: !110, line: 68, baseType: !139, size: 8192, offset: 1024)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !117, file: !110, line: 70, baseType: !35, size: 32, offset: 9216)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !117, file: !110, line: 71, baseType: !35, size: 32, offset: 9248)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !117, file: !110, line: 72, baseType: !189, size: 64, offset: 9280)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 64, elements: !190)
!190 = !{!191}
!191 = !DISubrange(count: 2)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !117, file: !110, line: 74, baseType: !71, size: 32, offset: 9344)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !117, file: !110, line: 74, baseType: !71, size: 32, offset: 9376)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !117, file: !110, line: 76, baseType: !195, size: 64, offset: 9408)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !197, line: 41, flags: DIFlagFwdDecl)
!197 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!198 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !117, file: !110, line: 77, baseType: !199, size: 64, offset: 9472)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !110, line: 77, flags: DIFlagFwdDecl)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !117, file: !110, line: 78, baseType: !202, size: 64, offset: 9536)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !204, line: 61, flags: DIFlagFwdDecl)
!204 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!205 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !117, file: !110, line: 80, baseType: !206, size: 2624, offset: 9600)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !207, line: 340, size: 2624, elements: !208)
!207 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!208 = !{!209, !237, !256, !257, !258, !276, !337, !338, !443, !444, !445, !446, !455}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !206, file: !207, line: 341, baseType: !210, size: 576)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !207, line: 251, baseType: !211)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !207, line: 207, size: 576, elements: !212)
!212 = !{!213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !211, file: !207, line: 208, baseType: !35, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !211, file: !207, line: 211, baseType: !99, size: 16, offset: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !211, file: !207, line: 212, baseType: !99, size: 16, offset: 48)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !211, file: !207, line: 213, baseType: !71, size: 32, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !211, file: !207, line: 214, baseType: !99, size: 16, offset: 96)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !211, file: !207, line: 215, baseType: !99, size: 16, offset: 112)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !211, file: !207, line: 216, baseType: !99, size: 16, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !211, file: !207, line: 217, baseType: !99, size: 16, offset: 144)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !211, file: !207, line: 218, baseType: !99, size: 16, offset: 160)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !211, file: !207, line: 219, baseType: !99, size: 16, offset: 176)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !211, file: !207, line: 220, baseType: !71, size: 32, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !211, file: !207, line: 222, baseType: !99, size: 16, offset: 224)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !211, file: !207, line: 225, baseType: !99, size: 16, offset: 240)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !211, file: !207, line: 228, baseType: !35, size: 32, offset: 256)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !211, file: !207, line: 229, baseType: !35, size: 32, offset: 288)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !211, file: !207, line: 233, baseType: !35, size: 32, offset: 320)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !211, file: !207, line: 236, baseType: !99, size: 16, offset: 352)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !211, file: !207, line: 236, baseType: !99, size: 16, offset: 368)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !211, file: !207, line: 241, baseType: !71, size: 32, offset: 384)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !211, file: !207, line: 244, baseType: !35, size: 32, offset: 416)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !211, file: !207, line: 244, baseType: !35, size: 32, offset: 448)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !211, file: !207, line: 245, baseType: !71, size: 32, offset: 480)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !211, file: !207, line: 248, baseType: !71, size: 32, offset: 512)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !211, file: !207, line: 250, baseType: !35, size: 32, offset: 544)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !206, file: !207, line: 342, baseType: !238, size: 448, offset: 576)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !207, line: 79, baseType: !239)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !207, line: 61, size: 448, elements: !240)
!240 = !{!241, !242, !243, !244, !245, !246, !247, !248, !249, !251, !252, !253, !254, !255}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !239, file: !207, line: 62, baseType: !74, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !239, file: !207, line: 64, baseType: !99, size: 16, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !239, file: !207, line: 65, baseType: !99, size: 16, offset: 80)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !239, file: !207, line: 67, baseType: !71, size: 32, offset: 96)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !239, file: !207, line: 68, baseType: !71, size: 32, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !239, file: !207, line: 69, baseType: !71, size: 32, offset: 160)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !239, file: !207, line: 70, baseType: !99, size: 16, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !239, file: !207, line: 71, baseType: !99, size: 16, offset: 208)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !239, file: !207, line: 72, baseType: !250, size: 64, offset: 224)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 64, elements: !190)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !239, file: !207, line: 75, baseType: !71, size: 32, offset: 288)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !239, file: !207, line: 75, baseType: !71, size: 32, offset: 320)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !239, file: !207, line: 75, baseType: !71, size: 32, offset: 352)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !239, file: !207, line: 78, baseType: !71, size: 32, offset: 384)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !239, file: !207, line: 78, baseType: !71, size: 32, offset: 416)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !206, file: !207, line: 343, baseType: !89, size: 128, offset: 1024)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !206, file: !207, line: 344, baseType: !89, size: 128, offset: 1152)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !206, file: !207, line: 345, baseType: !259, size: 192, offset: 1280)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !207, line: 278, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !207, line: 270, size: 192, elements: !261)
!261 = !{!262, !263, !264, !265, !266}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !260, file: !207, line: 271, baseType: !35, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !260, file: !207, line: 273, baseType: !71, size: 32, offset: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !260, file: !207, line: 275, baseType: !35, size: 32, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !260, file: !207, line: 276, baseType: !35, size: 32, offset: 96)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !260, file: !207, line: 277, baseType: !267, size: 64, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !207, line: 55, size: 576, elements: !269)
!269 = !{!270, !271, !272}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !268, file: !207, line: 56, baseType: !35, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !268, file: !207, line: 57, baseType: !71, size: 32, offset: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !268, file: !207, line: 58, baseType: !273, size: 512, offset: 64)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 512, elements: !274)
!274 = !{!275, !275}
!275 = !DISubrange(count: 4)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !206, file: !207, line: 346, baseType: !277, size: 384, offset: 1472)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !207, line: 268, baseType: !278)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !207, line: 253, size: 384, elements: !279)
!279 = !{!280, !281, !282, !283, !284, !331, !332, !333, !334, !335, !336}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !278, file: !207, line: 254, baseType: !35, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !278, file: !207, line: 255, baseType: !35, size: 32, offset: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !278, file: !207, line: 255, baseType: !35, size: 32, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !278, file: !207, line: 258, baseType: !71, size: 32, offset: 96)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !278, file: !207, line: 259, baseType: !285, size: 64, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !207, line: 164, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !207, line: 108, size: 1664, elements: !288)
!288 = !{!289, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !313, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !287, file: !207, line: 109, baseType: !290, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !287, file: !207, line: 109, baseType: !290, size: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !287, file: !207, line: 111, baseType: !168, size: 512, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !287, file: !207, line: 119, baseType: !250, size: 64, offset: 640)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !287, file: !207, line: 119, baseType: !250, size: 64, offset: 704)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !287, file: !207, line: 125, baseType: !250, size: 64, offset: 768)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !287, file: !207, line: 125, baseType: !250, size: 64, offset: 832)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !287, file: !207, line: 127, baseType: !250, size: 64, offset: 896)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !287, file: !207, line: 130, baseType: !35, size: 32, offset: 960)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !287, file: !207, line: 131, baseType: !35, size: 32, offset: 992)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !287, file: !207, line: 132, baseType: !301, size: 64, offset: 1024)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !207, line: 106, baseType: !303)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !207, line: 81, size: 512, elements: !304)
!304 = !{!305, !306, !309, !310, !311, !312}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !303, file: !207, line: 82, baseType: !250, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !303, file: !207, line: 97, baseType: !307, size: 256, offset: 64)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 256, elements: !308)
!308 = !{!275, !191}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !303, file: !207, line: 102, baseType: !250, size: 64, offset: 320)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !303, file: !207, line: 102, baseType: !250, size: 64, offset: 384)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !303, file: !207, line: 104, baseType: !35, size: 32, offset: 448)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !303, file: !207, line: 105, baseType: !35, size: 32, offset: 480)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !287, file: !207, line: 135, baseType: !314, size: 96, offset: 1088)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 96, elements: !315)
!315 = !{!316}
!316 = !DISubrange(count: 3)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !287, file: !207, line: 136, baseType: !71, size: 32, offset: 1184)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !287, file: !207, line: 139, baseType: !35, size: 32, offset: 1216)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !287, file: !207, line: 139, baseType: !35, size: 32, offset: 1248)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !287, file: !207, line: 139, baseType: !35, size: 32, offset: 1280)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !287, file: !207, line: 140, baseType: !314, size: 96, offset: 1312)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !287, file: !207, line: 143, baseType: !99, size: 16, offset: 1408)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !287, file: !207, line: 144, baseType: !99, size: 16, offset: 1424)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !287, file: !207, line: 145, baseType: !99, size: 16, offset: 1440)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !287, file: !207, line: 148, baseType: !99, size: 16, offset: 1456)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !287, file: !207, line: 149, baseType: !35, size: 32, offset: 1472)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !287, file: !207, line: 150, baseType: !71, size: 32, offset: 1504)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !287, file: !207, line: 152, baseType: !202, size: 64, offset: 1536)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !287, file: !207, line: 163, baseType: !71, size: 32, offset: 1600)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !287, file: !207, line: 163, baseType: !71, size: 32, offset: 1632)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !278, file: !207, line: 261, baseType: !71, size: 32, offset: 192)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !278, file: !207, line: 261, baseType: !71, size: 32, offset: 224)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !278, file: !207, line: 261, baseType: !71, size: 32, offset: 256)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !278, file: !207, line: 263, baseType: !35, size: 32, offset: 288)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !278, file: !207, line: 266, baseType: !35, size: 32, offset: 320)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !278, file: !207, line: 267, baseType: !71, size: 32, offset: 352)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !206, file: !207, line: 347, baseType: !285, size: 64, offset: 1856)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !206, file: !207, line: 348, baseType: !339, size: 64, offset: 1920)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !207, line: 205, baseType: !341)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !207, line: 186, size: 1024, elements: !342)
!342 = !{!343, !345, !346, !347, !349, !350, !351, !359, !360, !361, !441, !442}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !341, file: !207, line: 187, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !341, file: !207, line: 187, baseType: !344, size: 64, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !341, file: !207, line: 189, baseType: !168, size: 512, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !341, file: !207, line: 191, baseType: !348, size: 64, offset: 640)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !341, file: !207, line: 193, baseType: !35, size: 32, offset: 704)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !341, file: !207, line: 193, baseType: !35, size: 32, offset: 736)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !341, file: !207, line: 195, baseType: !352, size: 64, offset: 768)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !207, line: 184, baseType: !354)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !207, line: 166, size: 320, elements: !355)
!355 = !{!356, !357, !358}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !354, file: !207, line: 180, baseType: !307, size: 256)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !354, file: !207, line: 182, baseType: !35, size: 32, offset: 256)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !354, file: !207, line: 183, baseType: !35, size: 32, offset: 288)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !341, file: !207, line: 196, baseType: !35, size: 32, offset: 832)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !341, file: !207, line: 198, baseType: !35, size: 32, offset: 864)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !341, file: !207, line: 200, baseType: !362, size: 64, offset: 896)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !197, line: 77, size: 15424, elements: !364)
!364 = !{!365, !366, !367, !370, !373, !374, !377, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !395, !396, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !422, !423, !424, !430, !431, !435}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !363, file: !197, line: 78, baseType: !120, size: 960)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !363, file: !197, line: 80, baseType: !139, size: 8192, offset: 960)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !363, file: !197, line: 82, baseType: !368, size: 64, offset: 9152)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !197, line: 43, flags: DIFlagFwdDecl)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !363, file: !197, line: 83, baseType: !371, size: 64, offset: 9216)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !121, line: 46, flags: DIFlagFwdDecl)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !363, file: !197, line: 86, baseType: !195, size: 64, offset: 9280)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !363, file: !197, line: 87, baseType: !375, size: 64, offset: 9344)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !197, line: 44, flags: DIFlagFwdDecl)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !363, file: !197, line: 89, baseType: !378, size: 512, offset: 9408)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !375, size: 512, elements: !72)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !363, file: !197, line: 90, baseType: !99, size: 16, offset: 9920)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !363, file: !197, line: 90, baseType: !99, size: 16, offset: 9936)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !363, file: !197, line: 92, baseType: !99, size: 16, offset: 9952)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !363, file: !197, line: 92, baseType: !99, size: 16, offset: 9968)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !363, file: !197, line: 93, baseType: !99, size: 16, offset: 9984)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !363, file: !197, line: 93, baseType: !99, size: 16, offset: 10000)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !363, file: !197, line: 94, baseType: !35, size: 32, offset: 10016)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !363, file: !197, line: 97, baseType: !99, size: 16, offset: 10048)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !363, file: !197, line: 97, baseType: !99, size: 16, offset: 10064)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !363, file: !197, line: 98, baseType: !99, size: 16, offset: 10080)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !363, file: !197, line: 98, baseType: !99, size: 16, offset: 10096)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !363, file: !197, line: 99, baseType: !99, size: 16, offset: 10112)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !363, file: !197, line: 99, baseType: !99, size: 16, offset: 10128)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !363, file: !197, line: 100, baseType: !7, size: 32, offset: 10144)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !363, file: !197, line: 101, baseType: !394, size: 64, offset: 10176)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !363, file: !197, line: 103, baseType: !146, size: 64, offset: 10240)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !363, file: !197, line: 104, baseType: !397, size: 64, offset: 10304)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !121, line: 159, size: 448, elements: !399)
!399 = !{!400, !402, !403, !405, !406, !408}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !398, file: !121, line: 161, baseType: !401, size: 64)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !190)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !398, file: !121, line: 162, baseType: !401, size: 64, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !398, file: !121, line: 163, baseType: !404, size: 32, offset: 128)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 32, elements: !190)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !398, file: !121, line: 164, baseType: !404, size: 32, offset: 160)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !398, file: !121, line: 165, baseType: !407, size: 128, offset: 192)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !394, size: 128, elements: !190)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !398, file: !121, line: 166, baseType: !409, size: 128, offset: 320)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !371, size: 128, elements: !190)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !363, file: !197, line: 107, baseType: !71, size: 32, offset: 10368)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !363, file: !197, line: 108, baseType: !35, size: 32, offset: 10400)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !363, file: !197, line: 109, baseType: !99, size: 16, offset: 10432)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !363, file: !197, line: 110, baseType: !99, size: 16, offset: 10448)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !363, file: !197, line: 113, baseType: !35, size: 32, offset: 10464)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !363, file: !197, line: 113, baseType: !35, size: 32, offset: 10496)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !363, file: !197, line: 114, baseType: !140, size: 8, offset: 10528)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !363, file: !197, line: 114, baseType: !140, size: 8, offset: 10536)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !363, file: !197, line: 115, baseType: !99, size: 16, offset: 10544)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !363, file: !197, line: 116, baseType: !420, size: 128, offset: 10560)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 128, elements: !421)
!421 = !{!275}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !363, file: !197, line: 119, baseType: !71, size: 32, offset: 10688)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !363, file: !197, line: 119, baseType: !71, size: 32, offset: 10720)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !363, file: !197, line: 122, baseType: !425, size: 512, offset: 10752)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !426, line: 182, baseType: !427)
!426 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !426, line: 180, size: 512, elements: !428)
!428 = !{!429}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !427, file: !426, line: 181, baseType: !168, size: 512)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !363, file: !197, line: 123, baseType: !140, size: 8, offset: 11264)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !363, file: !197, line: 125, baseType: !432, size: 56, offset: 11272)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 56, elements: !433)
!433 = !{!434}
!434 = !DISubrange(count: 7)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !363, file: !197, line: 126, baseType: !436, size: 4096, offset: 11328)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !437, size: 4096, elements: !72)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !197, line: 69, baseType: !438)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !197, line: 67, size: 512, elements: !439)
!439 = !{!440}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !438, file: !197, line: 68, baseType: !168, size: 512)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !341, file: !207, line: 201, baseType: !71, size: 32, offset: 960)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !341, file: !207, line: 204, baseType: !35, size: 32, offset: 992)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !206, file: !207, line: 350, baseType: !89, size: 128, offset: 1984)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !206, file: !207, line: 351, baseType: !35, size: 32, offset: 2112)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !206, file: !207, line: 351, baseType: !35, size: 32, offset: 2144)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !206, file: !207, line: 353, baseType: !447, size: 64, offset: 2176)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !207, line: 297, baseType: !449)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !207, line: 295, size: 2048, elements: !450)
!450 = !{!451}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !449, file: !207, line: 296, baseType: !452, size: 2048)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 2048, elements: !453)
!453 = !{!454}
!454 = !DISubrange(count: 256)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !206, file: !207, line: 355, baseType: !456, size: 384, offset: 2240)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !207, line: 338, baseType: !457)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !207, line: 322, size: 384, elements: !458)
!458 = !{!459, !460, !461, !462, !463, !464, !465}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !457, file: !207, line: 323, baseType: !35, size: 32)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !457, file: !207, line: 325, baseType: !99, size: 16, offset: 32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !457, file: !207, line: 326, baseType: !99, size: 16, offset: 48)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !457, file: !207, line: 331, baseType: !89, size: 128, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !457, file: !207, line: 334, baseType: !89, size: 128, offset: 192)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !457, file: !207, line: 335, baseType: !35, size: 32, offset: 320)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !457, file: !207, line: 337, baseType: !35, size: 32, offset: 352)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !117, file: !110, line: 81, baseType: !74, size: 64, offset: 12224)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !117, file: !110, line: 85, baseType: !468, size: 6208, offset: 12288)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !110, line: 55, size: 6208, elements: !469)
!469 = !{!470, !474, !475, !476, !477}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !468, file: !110, line: 56, baseType: !471, size: 6144)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 6144, elements: !472)
!472 = !{!473}
!473 = !DISubrange(count: 768)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !468, file: !110, line: 58, baseType: !99, size: 16, offset: 6144)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !468, file: !110, line: 59, baseType: !99, size: 16, offset: 6160)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !468, file: !110, line: 60, baseType: !99, size: 16, offset: 6176)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !468, file: !110, line: 61, baseType: !99, size: 16, offset: 6192)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !117, file: !110, line: 86, baseType: !35, size: 32, offset: 18496)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !117, file: !110, line: 88, baseType: !35, size: 32, offset: 18528)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !117, file: !110, line: 90, baseType: !35, size: 32, offset: 18560)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !117, file: !110, line: 94, baseType: !35, size: 32, offset: 18592)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !117, file: !110, line: 100, baseType: !425, size: 512, offset: 18624)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "scopes", scope: !78, file: !77, line: 1085, baseType: !484, size: 1088, offset: 576)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipScopes", file: !110, line: 103, size: 1088, elements: !485)
!485 = !{!486, !487, !488, !489, !490, !491, !492, !495, !496, !497, !498, !499, !500, !501, !503}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !484, file: !110, line: 104, baseType: !99, size: 16)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "use_track_mask", scope: !484, file: !110, line: 105, baseType: !99, size: 16, offset: 16)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "track_preview_height", scope: !484, file: !110, line: 106, baseType: !35, size: 32, offset: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "frame_width", scope: !484, file: !110, line: 107, baseType: !35, size: 32, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "frame_height", scope: !484, file: !110, line: 107, baseType: !35, size: 32, offset: 96)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "undist_marker", scope: !484, file: !110, line: 108, baseType: !303, size: 512, offset: 128)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "track_search", scope: !484, file: !110, line: 109, baseType: !493, size: 64, offset: 640)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !426, line: 136, flags: DIFlagFwdDecl)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "track_preview", scope: !484, file: !110, line: 110, baseType: !493, size: 64, offset: 704)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "track_pos", scope: !484, file: !110, line: 111, baseType: !250, size: 64, offset: 768)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "track_disabled", scope: !484, file: !110, line: 112, baseType: !99, size: 16, offset: 832)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "track_locked", scope: !484, file: !110, line: 113, baseType: !99, size: 16, offset: 848)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !484, file: !110, line: 114, baseType: !35, size: 32, offset: 864)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !484, file: !110, line: 115, baseType: !290, size: 64, offset: 896)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !484, file: !110, line: 116, baseType: !502, size: 64, offset: 960)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "slide_scale", scope: !484, file: !110, line: 117, baseType: !250, size: 64, offset: 1024)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !78, file: !77, line: 1087, baseType: !35, size: 32, offset: 1664)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !78, file: !77, line: 1088, baseType: !99, size: 16, offset: 1696)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !78, file: !77, line: 1089, baseType: !99, size: 16, offset: 1712)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "path_length", scope: !78, file: !77, line: 1091, baseType: !35, size: 32, offset: 1728)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !78, file: !77, line: 1094, baseType: !250, size: 64, offset: 1760)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !78, file: !77, line: 1094, baseType: !71, size: 32, offset: 1824)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "angle", scope: !78, file: !77, line: 1094, baseType: !71, size: 32, offset: 1856)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !78, file: !77, line: 1095, baseType: !35, size: 32, offset: 1888)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "stabmat", scope: !78, file: !77, line: 1096, baseType: !273, size: 512, offset: 1920)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "unistabmat", scope: !78, file: !77, line: 1096, baseType: !273, size: 512, offset: 2432)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "postproc_flag", scope: !78, file: !77, line: 1100, baseType: !35, size: 32, offset: 2944)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_src", scope: !78, file: !77, line: 1103, baseType: !99, size: 16, offset: 2976)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !78, file: !77, line: 1103, baseType: !99, size: 16, offset: 2992)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !78, file: !77, line: 1105, baseType: !35, size: 32, offset: 3008)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "pad4", scope: !78, file: !77, line: 1105, baseType: !35, size: 32, offset: 3040)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !78, file: !77, line: 1107, baseType: !250, size: 64, offset: 3072)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "mask_info", scope: !78, file: !77, line: 1109, baseType: !521, size: 128, offset: 3136)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "MaskSpaceInfo", file: !77, line: 554, baseType: !522)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MaskSpaceInfo", file: !77, line: 545, size: 128, elements: !523)
!523 = !{!524, !537, !538, !539, !540}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !522, file: !77, line: 548, baseType: !525, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !6, line: 46, size: 1344, elements: !527)
!527 = !{!528, !529, !530, !531, !532, !533, !534, !535, !536}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !526, file: !6, line: 47, baseType: !120, size: 960)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !526, file: !6, line: 48, baseType: !183, size: 64, offset: 960)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "masklayers", scope: !526, file: !6, line: 49, baseType: !89, size: 128, offset: 1024)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "masklay_act", scope: !526, file: !6, line: 50, baseType: !35, size: 32, offset: 1152)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "masklay_tot", scope: !526, file: !6, line: 51, baseType: !35, size: 32, offset: 1184)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !526, file: !6, line: 53, baseType: !35, size: 32, offset: 1216)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "efra", scope: !526, file: !6, line: 53, baseType: !35, size: 32, offset: 1248)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !526, file: !6, line: 55, baseType: !35, size: 32, offset: 1280)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !526, file: !6, line: 56, baseType: !35, size: 32, offset: 1312)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "draw_flag", scope: !522, file: !77, line: 550, baseType: !140, size: 8, offset: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "draw_type", scope: !522, file: !77, line: 551, baseType: !140, size: 8, offset: 72)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "overlay_mode", scope: !522, file: !77, line: 552, baseType: !140, size: 8, offset: 80)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !522, file: !77, line: 553, baseType: !541, size: 40, offset: 88)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 40, elements: !542)
!542 = !{!543}
!543 = !DISubrange(count: 5)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceImage", file: !77, line: 743, baseType: !546)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceImage", file: !77, line: 710, size: 84672, elements: !547)
!547 = !{!548, !549, !550, !551, !552, !553, !554, !2245, !2246, !2287, !2288, !2289, !2290, !2291, !2292, !2293, !2294, !2295, !2296, !2297, !2298, !2299, !2300, !2301, !2302, !2303, !2304}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !546, file: !77, line: 711, baseType: !81, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !546, file: !77, line: 711, baseType: !81, size: 64, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !546, file: !77, line: 712, baseType: !89, size: 128, offset: 128)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !546, file: !77, line: 713, baseType: !35, size: 32, offset: 256)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !546, file: !77, line: 715, baseType: !35, size: 32, offset: 288)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !546, file: !77, line: 717, baseType: !362, size: 64, offset: 320)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !546, file: !77, line: 718, baseType: !555, size: 320, offset: 384)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !197, line: 50, size: 320, elements: !556)
!556 = !{!557, !2232, !2233, !2234, !2235, !2236, !2237, !2238, !2239, !2240, !2241, !2242, !2243, !2244}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !555, file: !197, line: 51, baseType: !558, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !204, line: 1216, size: 39680, elements: !560)
!560 = !{!561, !562, !563, !566, !1487, !1488, !1489, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1649, !1860, !1863, !2103, !2115, !2116, !2117, !2118, !2119, !2120, !2121, !2122, !2125, !2126, !2127, !2128, !2129, !2137, !2203, !2210, !2211, !2218, !2219, !2225, !2226, !2227, !2228, !2229}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !559, file: !204, line: 1217, baseType: !120, size: 960)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !559, file: !204, line: 1218, baseType: !183, size: 64, offset: 960)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !559, file: !204, line: 1220, baseType: !564, size: 64, offset: 1024)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !45, line: 43, flags: DIFlagFwdDecl)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !559, file: !204, line: 1221, baseType: !567, size: 64, offset: 1088)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !569, line: 52, size: 4224, elements: !570)
!569 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!570 = !{!571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !640, !641, !644, !1482, !1483, !1484, !1485, !1486}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !568, file: !569, line: 53, baseType: !120, size: 960)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !568, file: !569, line: 54, baseType: !183, size: 64, offset: 960)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !568, file: !569, line: 56, baseType: !99, size: 16, offset: 1024)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !568, file: !569, line: 56, baseType: !99, size: 16, offset: 1040)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !568, file: !569, line: 57, baseType: !99, size: 16, offset: 1056)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !568, file: !569, line: 57, baseType: !99, size: 16, offset: 1072)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !568, file: !569, line: 59, baseType: !71, size: 32, offset: 1088)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !568, file: !569, line: 59, baseType: !71, size: 32, offset: 1120)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !568, file: !569, line: 59, baseType: !71, size: 32, offset: 1152)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !568, file: !569, line: 60, baseType: !71, size: 32, offset: 1184)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !568, file: !569, line: 60, baseType: !71, size: 32, offset: 1216)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !568, file: !569, line: 60, baseType: !71, size: 32, offset: 1248)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !568, file: !569, line: 61, baseType: !71, size: 32, offset: 1280)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !568, file: !569, line: 61, baseType: !71, size: 32, offset: 1312)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !568, file: !569, line: 61, baseType: !71, size: 32, offset: 1344)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !568, file: !569, line: 68, baseType: !71, size: 32, offset: 1376)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !568, file: !569, line: 68, baseType: !71, size: 32, offset: 1408)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !568, file: !569, line: 68, baseType: !71, size: 32, offset: 1440)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !568, file: !569, line: 69, baseType: !71, size: 32, offset: 1472)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !568, file: !569, line: 69, baseType: !71, size: 32, offset: 1504)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !568, file: !569, line: 74, baseType: !71, size: 32, offset: 1536)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !568, file: !569, line: 79, baseType: !71, size: 32, offset: 1568)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !568, file: !569, line: 81, baseType: !99, size: 16, offset: 1600)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !568, file: !569, line: 91, baseType: !99, size: 16, offset: 1616)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !568, file: !569, line: 92, baseType: !99, size: 16, offset: 1632)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !568, file: !569, line: 93, baseType: !99, size: 16, offset: 1648)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !568, file: !569, line: 94, baseType: !99, size: 16, offset: 1664)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !568, file: !569, line: 94, baseType: !99, size: 16, offset: 1680)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !568, file: !569, line: 94, baseType: !99, size: 16, offset: 1696)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !568, file: !569, line: 94, baseType: !99, size: 16, offset: 1712)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !568, file: !569, line: 96, baseType: !71, size: 32, offset: 1728)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !568, file: !569, line: 96, baseType: !71, size: 32, offset: 1760)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !568, file: !569, line: 96, baseType: !71, size: 32, offset: 1792)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !568, file: !569, line: 96, baseType: !71, size: 32, offset: 1824)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !568, file: !569, line: 98, baseType: !71, size: 32, offset: 1856)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !568, file: !569, line: 98, baseType: !71, size: 32, offset: 1888)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !568, file: !569, line: 98, baseType: !71, size: 32, offset: 1920)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !568, file: !569, line: 98, baseType: !71, size: 32, offset: 1952)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !568, file: !569, line: 99, baseType: !71, size: 32, offset: 1984)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !568, file: !569, line: 99, baseType: !71, size: 32, offset: 2016)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !568, file: !569, line: 100, baseType: !71, size: 32, offset: 2048)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !568, file: !569, line: 100, baseType: !71, size: 32, offset: 2080)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !568, file: !569, line: 103, baseType: !99, size: 16, offset: 2112)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !568, file: !569, line: 103, baseType: !99, size: 16, offset: 2128)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !568, file: !569, line: 103, baseType: !99, size: 16, offset: 2144)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !568, file: !569, line: 103, baseType: !99, size: 16, offset: 2160)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !568, file: !569, line: 106, baseType: !71, size: 32, offset: 2176)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !568, file: !569, line: 106, baseType: !71, size: 32, offset: 2208)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !568, file: !569, line: 106, baseType: !71, size: 32, offset: 2240)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !568, file: !569, line: 106, baseType: !71, size: 32, offset: 2272)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !568, file: !569, line: 107, baseType: !99, size: 16, offset: 2304)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !568, file: !569, line: 107, baseType: !99, size: 16, offset: 2320)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !568, file: !569, line: 107, baseType: !99, size: 16, offset: 2336)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !568, file: !569, line: 107, baseType: !99, size: 16, offset: 2352)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !568, file: !569, line: 108, baseType: !71, size: 32, offset: 2368)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !568, file: !569, line: 108, baseType: !71, size: 32, offset: 2400)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !568, file: !569, line: 109, baseType: !71, size: 32, offset: 2432)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !568, file: !569, line: 109, baseType: !71, size: 32, offset: 2464)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !568, file: !569, line: 110, baseType: !71, size: 32, offset: 2496)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !568, file: !569, line: 110, baseType: !71, size: 32, offset: 2528)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !568, file: !569, line: 110, baseType: !71, size: 32, offset: 2560)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !568, file: !569, line: 111, baseType: !99, size: 16, offset: 2592)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !568, file: !569, line: 111, baseType: !99, size: 16, offset: 2608)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !568, file: !569, line: 112, baseType: !99, size: 16, offset: 2624)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !568, file: !569, line: 112, baseType: !99, size: 16, offset: 2640)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !568, file: !569, line: 112, baseType: !99, size: 16, offset: 2656)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !568, file: !569, line: 115, baseType: !99, size: 16, offset: 2672)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !568, file: !569, line: 118, baseType: !639, size: 64, offset: 2688)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !568, file: !569, line: 118, baseType: !639, size: 64, offset: 2752)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !568, file: !569, line: 121, baseType: !642, size: 64, offset: 2816)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !45, line: 44, flags: DIFlagFwdDecl)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !568, file: !569, line: 122, baseType: !645, size: 1152, offset: 2880)
!645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !646, size: 1152, elements: !1480)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !648, line: 57, size: 2496, elements: !649)
!648 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!649 = !{!650, !651, !652, !653, !654, !655, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !647, file: !648, line: 59, baseType: !99, size: 16)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !647, file: !648, line: 59, baseType: !99, size: 16, offset: 16)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !647, file: !648, line: 59, baseType: !99, size: 16, offset: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !647, file: !648, line: 59, baseType: !99, size: 16, offset: 48)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !647, file: !648, line: 60, baseType: !564, size: 64, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !647, file: !648, line: 61, baseType: !656, size: 64, offset: 128)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !648, line: 202, size: 3328, elements: !658)
!658 = !{!659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !1267, !1268, !1269, !1295, !1321, !1322, !1390, !1411, !1419, !1420}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !657, file: !648, line: 203, baseType: !120, size: 960)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !657, file: !648, line: 204, baseType: !183, size: 64, offset: 960)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !657, file: !648, line: 206, baseType: !71, size: 32, offset: 1024)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !657, file: !648, line: 206, baseType: !71, size: 32, offset: 1056)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !657, file: !648, line: 207, baseType: !71, size: 32, offset: 1088)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !657, file: !648, line: 207, baseType: !71, size: 32, offset: 1120)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !657, file: !648, line: 207, baseType: !71, size: 32, offset: 1152)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !657, file: !648, line: 207, baseType: !71, size: 32, offset: 1184)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !657, file: !648, line: 207, baseType: !71, size: 32, offset: 1216)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !657, file: !648, line: 207, baseType: !71, size: 32, offset: 1248)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !657, file: !648, line: 208, baseType: !71, size: 32, offset: 1280)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !657, file: !648, line: 208, baseType: !71, size: 32, offset: 1312)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !657, file: !648, line: 211, baseType: !71, size: 32, offset: 1344)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !657, file: !648, line: 211, baseType: !71, size: 32, offset: 1376)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !657, file: !648, line: 211, baseType: !71, size: 32, offset: 1408)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !657, file: !648, line: 211, baseType: !71, size: 32, offset: 1440)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !657, file: !648, line: 211, baseType: !71, size: 32, offset: 1472)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !657, file: !648, line: 214, baseType: !71, size: 32, offset: 1504)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !657, file: !648, line: 214, baseType: !71, size: 32, offset: 1536)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !657, file: !648, line: 217, baseType: !71, size: 32, offset: 1568)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !657, file: !648, line: 218, baseType: !71, size: 32, offset: 1600)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !657, file: !648, line: 219, baseType: !71, size: 32, offset: 1632)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !657, file: !648, line: 220, baseType: !71, size: 32, offset: 1664)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !657, file: !648, line: 221, baseType: !71, size: 32, offset: 1696)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !657, file: !648, line: 222, baseType: !99, size: 16, offset: 1728)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !657, file: !648, line: 222, baseType: !99, size: 16, offset: 1744)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !657, file: !648, line: 224, baseType: !99, size: 16, offset: 1760)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !657, file: !648, line: 224, baseType: !99, size: 16, offset: 1776)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !657, file: !648, line: 227, baseType: !99, size: 16, offset: 1792)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !657, file: !648, line: 227, baseType: !99, size: 16, offset: 1808)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !657, file: !648, line: 229, baseType: !99, size: 16, offset: 1824)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !657, file: !648, line: 229, baseType: !99, size: 16, offset: 1840)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !657, file: !648, line: 230, baseType: !99, size: 16, offset: 1856)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !657, file: !648, line: 230, baseType: !99, size: 16, offset: 1872)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !657, file: !648, line: 232, baseType: !71, size: 32, offset: 1888)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !657, file: !648, line: 232, baseType: !71, size: 32, offset: 1920)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !657, file: !648, line: 232, baseType: !71, size: 32, offset: 1952)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !657, file: !648, line: 232, baseType: !71, size: 32, offset: 1984)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !657, file: !648, line: 233, baseType: !35, size: 32, offset: 2016)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !657, file: !648, line: 234, baseType: !35, size: 32, offset: 2048)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !657, file: !648, line: 235, baseType: !99, size: 16, offset: 2080)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !657, file: !648, line: 235, baseType: !99, size: 16, offset: 2096)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !657, file: !648, line: 236, baseType: !99, size: 16, offset: 2112)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !657, file: !648, line: 239, baseType: !99, size: 16, offset: 2128)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !657, file: !648, line: 240, baseType: !35, size: 32, offset: 2144)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !657, file: !648, line: 241, baseType: !35, size: 32, offset: 2176)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !657, file: !648, line: 241, baseType: !35, size: 32, offset: 2208)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !657, file: !648, line: 241, baseType: !35, size: 32, offset: 2240)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !657, file: !648, line: 243, baseType: !71, size: 32, offset: 2272)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !657, file: !648, line: 243, baseType: !71, size: 32, offset: 2304)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !657, file: !648, line: 244, baseType: !71, size: 32, offset: 2336)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !657, file: !648, line: 246, baseType: !555, size: 320, offset: 2368)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !657, file: !648, line: 248, baseType: !712, size: 64, offset: 2688)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !714, line: 328, size: 3456, elements: !715)
!714 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!715 = !{!716, !717, !718, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1245, !1246, !1247, !1250, !1254, !1258, !1262, !1263, !1264, !1265, !1266}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !713, file: !714, line: 329, baseType: !120, size: 960)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !713, file: !714, line: 330, baseType: !183, size: 64, offset: 960)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !713, file: !714, line: 332, baseType: !719, size: 64, offset: 1024)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !721, line: 283, size: 4096, elements: !722)
!721 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!722 = !{!723, !724, !725, !726, !727, !728, !732, !1184, !1192, !1196, !1202, !1206, !1207, !1208, !1209, !1213, !1214}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !720, file: !721, line: 284, baseType: !35, size: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !720, file: !721, line: 285, baseType: !168, size: 512, offset: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !720, file: !721, line: 287, baseType: !168, size: 512, offset: 544)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !720, file: !721, line: 288, baseType: !452, size: 2048, offset: 1056)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !720, file: !721, line: 289, baseType: !35, size: 32, offset: 3104)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !720, file: !721, line: 292, baseType: !729, size: 64, offset: 3136)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DISubroutineType(types: !731)
!731 = !{null, !712}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !720, file: !721, line: 293, baseType: !733, size: 64, offset: 3200)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DISubroutineType(types: !735)
!735 = !{null, !712, !736}
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !714, line: 167, size: 3712, elements: !738)
!738 = !{!739, !740, !741, !742, !743, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !737, file: !714, line: 168, baseType: !736, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !737, file: !714, line: 168, baseType: !736, size: 64, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !737, file: !714, line: 168, baseType: !736, size: 64, offset: 128)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !737, file: !714, line: 170, baseType: !157, size: 64, offset: 192)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !737, file: !714, line: 172, baseType: !744, size: 64, offset: 256)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !721, line: 144, size: 6016, elements: !746)
!746 = !{!747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !924, !925, !926, !1054, !1058, !1062, !1063, !1067, !1071, !1075, !1076, !1077, !1078, !1082, !1083, !1087, !1091, !1095, !1099, !1103, !1107, !1111, !1112, !1119, !1121, !1130, !1139}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !745, file: !721, line: 145, baseType: !74, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !745, file: !721, line: 145, baseType: !74, size: 64, offset: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !745, file: !721, line: 146, baseType: !99, size: 16, offset: 128)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !745, file: !721, line: 148, baseType: !168, size: 512, offset: 144)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !745, file: !721, line: 149, baseType: !35, size: 32, offset: 672)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !745, file: !721, line: 151, baseType: !168, size: 512, offset: 704)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !745, file: !721, line: 152, baseType: !452, size: 2048, offset: 1216)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !745, file: !721, line: 153, baseType: !35, size: 32, offset: 3264)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !745, file: !721, line: 155, baseType: !71, size: 32, offset: 3296)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !745, file: !721, line: 155, baseType: !71, size: 32, offset: 3328)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !745, file: !721, line: 155, baseType: !71, size: 32, offset: 3360)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !745, file: !721, line: 156, baseType: !71, size: 32, offset: 3392)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !745, file: !721, line: 156, baseType: !71, size: 32, offset: 3424)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !745, file: !721, line: 156, baseType: !71, size: 32, offset: 3456)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !745, file: !721, line: 157, baseType: !99, size: 16, offset: 3488)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !745, file: !721, line: 157, baseType: !99, size: 16, offset: 3504)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !745, file: !721, line: 157, baseType: !99, size: 16, offset: 3520)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !745, file: !721, line: 160, baseType: !765, size: 64, offset: 3584)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !721, line: 109, baseType: !767)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !721, line: 98, size: 1408, elements: !768)
!768 = !{!769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !923}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !767, file: !721, line: 99, baseType: !35, size: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !767, file: !721, line: 99, baseType: !35, size: 32, offset: 32)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !767, file: !721, line: 100, baseType: !168, size: 512, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !767, file: !721, line: 101, baseType: !71, size: 32, offset: 576)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !767, file: !721, line: 101, baseType: !71, size: 32, offset: 608)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !767, file: !721, line: 101, baseType: !71, size: 32, offset: 640)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !767, file: !721, line: 101, baseType: !71, size: 32, offset: 672)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !767, file: !721, line: 102, baseType: !71, size: 32, offset: 704)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !767, file: !721, line: 102, baseType: !71, size: 32, offset: 736)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !767, file: !721, line: 103, baseType: !35, size: 32, offset: 768)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !767, file: !721, line: 104, baseType: !35, size: 32, offset: 800)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !767, file: !721, line: 107, baseType: !781, size: 64, offset: 832)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !714, line: 87, size: 2816, elements: !783)
!783 = !{!784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !908}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !782, file: !714, line: 88, baseType: !781, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !782, file: !714, line: 88, baseType: !781, size: 64, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !782, file: !714, line: 88, baseType: !781, size: 64, offset: 128)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !782, file: !714, line: 90, baseType: !157, size: 64, offset: 192)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !782, file: !714, line: 92, baseType: !168, size: 512, offset: 256)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !782, file: !714, line: 94, baseType: !168, size: 512, offset: 768)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !782, file: !714, line: 99, baseType: !74, size: 64, offset: 1280)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !782, file: !714, line: 101, baseType: !99, size: 16, offset: 1344)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !782, file: !714, line: 101, baseType: !99, size: 16, offset: 1360)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !782, file: !714, line: 102, baseType: !99, size: 16, offset: 1376)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !782, file: !714, line: 103, baseType: !99, size: 16, offset: 1392)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !782, file: !714, line: 104, baseType: !796, size: 64, offset: 1408)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !721, line: 114, size: 1600, elements: !798)
!798 = !{!799, !800, !824, !828, !832, !836, !840, !844, !845, !849, !878, !879, !880}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !797, file: !721, line: 115, baseType: !168, size: 512)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !797, file: !721, line: 117, baseType: !801, size: 64, offset: 512)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DISubroutineType(types: !803)
!803 = !{null, !804, !807, !810, !810, !822}
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !806, line: 46, flags: DIFlagFwdDecl)
!806 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_library.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !809, line: 46, flags: DIFlagFwdDecl)
!809 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !812, line: 55, size: 192, elements: !813)
!812 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!813 = !{!814, !818, !821}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !811, file: !812, line: 58, baseType: !815, size: 64)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !811, file: !812, line: 56, size: 64, elements: !816)
!816 = !{!817}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !815, file: !812, line: 57, baseType: !74, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !811, file: !812, line: 60, baseType: !819, size: 64, offset: 64)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !714, line: 335, flags: DIFlagFwdDecl)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !811, file: !812, line: 61, baseType: !74, size: 64, offset: 128)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !140)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "draw_color", scope: !797, file: !721, line: 118, baseType: !825, size: 64, offset: 576)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DISubroutineType(types: !827)
!827 = !{null, !804, !810, !810, !639}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw", scope: !797, file: !721, line: 120, baseType: !829, size: 64, offset: 640)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DISubroutineType(types: !831)
!831 = !{null, !804, !807, !810}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw_color", scope: !797, file: !721, line: 121, baseType: !833, size: 64, offset: 704)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DISubroutineType(types: !835)
!835 = !{null, !804, !810, !639}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "interface_register_properties", scope: !797, file: !721, line: 122, baseType: !837, size: 64, offset: 768)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DISubroutineType(types: !839)
!839 = !{null, !712, !781, !819}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "interface_init_socket", scope: !797, file: !721, line: 123, baseType: !841, size: 64, offset: 832)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DISubroutineType(types: !843)
!843 = !{null, !712, !781, !736, !781, !822}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "interface_verify_socket", scope: !797, file: !721, line: 124, baseType: !841, size: 64, offset: 896)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "interface_from_socket", scope: !797, file: !721, line: 125, baseType: !846, size: 64, offset: 960)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{null, !712, !781, !736, !781}
