; ModuleID = 'blender/source/blender/bmesh/tools/bmesh_intersect.c'
source_filename = "blender/source/blender/bmesh/tools/bmesh_intersect.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BMesh = type { i32, i32, i32, i32, i32, i32, i32, i8, i8, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BMVert**, %struct.BMEdge**, %struct.BMFace**, i32, i32, i32, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, i32, %struct.BMOperator*, %struct.CustomData, %struct.CustomData, %struct.CustomData, %struct.CustomData, i16, i32, i32, i32, %struct.ListBase, %struct.BMFace*, %struct.ListBase, i8* }
%struct.BMVert = type { %struct.BMHeader, %struct.BMFlagLayer*, [3 x float], [3 x float], %struct.BMEdge* }
%struct.BMHeader = type { i8*, i32, i8, i8, i8 }
%struct.BMFlagLayer = type { i16 }
%struct.BMEdge = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMVert*, %struct.BMVert*, %struct.BMLoop*, %struct.BMDiskLink, %struct.BMDiskLink }
%struct.BMLoop = type { %struct.BMHeader, %struct.BMVert*, %struct.BMEdge*, %struct.BMFace*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop* }
%struct.BMDiskLink = type { %struct.BMEdge*, %struct.BMEdge* }
%struct.BLI_mempool = type opaque

!31 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_FLT", value: 66, isUnsigned: true)
!32 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INT", value: 67, isUnsigned: true)
!33 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_BOOL", value: 68, isUnsigned: true)
!34 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INTERNAL", value: 69, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 182, baseType: !5, size: 32, elements: !36)
!36 = !{!37, !38, !39, !40, !41}
!37 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NOP", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_UNTAN_MULTIRES", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NORMALS_CALC", value: 2, isUnsigned: true)
!40 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_FLUSH", value: 4, isUnsigned: true)
!41 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 249, baseType: !5, size: 32, elements: !44)
!43 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!44 = !{!45, !46, !47, !48}
!45 = !DIEnumerator(name: "BM_VERT", value: 1, isUnsigned: true)
!46 = !DIEnumerator(name: "BM_EDGE", value: 2, isUnsigned: true)
!47 = !DIEnumerator(name: "BM_LOOP", value: 4, isUnsigned: true)
!48 = !DIEnumerator(name: "BM_FACE", value: 8, isUnsigned: true)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 260, baseType: !5, size: 32, elements: !50)
!50 = !{!51, !52, !53, !54, !55, !56, !57}
!51 = !DIEnumerator(name: "BM_ELEM_SELECT", value: 1, isUnsigned: true)
!52 = !DIEnumerator(name: "BM_ELEM_HIDDEN", value: 2, isUnsigned: true)
!53 = !DIEnumerator(name: "BM_ELEM_SEAM", value: 4, isUnsigned: true)
!54 = !DIEnumerator(name: "BM_ELEM_SMOOTH", value: 8, isUnsigned: true)
!55 = !DIEnumerator(name: "BM_ELEM_TAG", value: 16, isUnsigned: true)
!56 = !DIEnumerator(name: "BM_ELEM_DRAW", value: 32, isUnsigned: true)
!57 = !DIEnumerator(name: "BM_ELEM_INTERNAL_TAG", value: 128, isUnsigned: true)
!58 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BMIterType", file: !59, line: 57, baseType: !5, size: 32, elements: !60)
!59 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!60 = !{!61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74}
!61 = !DIEnumerator(name: "BM_VERTS_OF_MESH", value: 1, isUnsigned: true)
!62 = !DIEnumerator(name: "BM_EDGES_OF_MESH", value: 2, isUnsigned: true)
!63 = !DIEnumerator(name: "BM_FACES_OF_MESH", value: 3, isUnsigned: true)
!64 = !DIEnumerator(name: "BM_EDGES_OF_VERT", value: 4, isUnsigned: true)
!65 = !DIEnumerator(name: "BM_FACES_OF_VERT", value: 5, isUnsigned: true)
!66 = !DIEnumerator(name: "BM_LOOPS_OF_VERT", value: 6, isUnsigned: true)
!67 = !DIEnumerator(name: "BM_VERTS_OF_EDGE", value: 7, isUnsigned: true)
!68 = !DIEnumerator(name: "BM_FACES_OF_EDGE", value: 8, isUnsigned: true)
!69 = !DIEnumerator(name: "BM_VERTS_OF_FACE", value: 9, isUnsigned: true)
!70 = !DIEnumerator(name: "BM_EDGES_OF_FACE", value: 10, isUnsigned: true)
!71 = !DIEnumerator(name: "BM_LOOPS_OF_FACE", value: 11, isUnsigned: true)
!72 = !DIEnumerator(name: "BM_ALL_LOOPS_OF_FACE", value: 12, isUnsigned: true)
!73 = !DIEnumerator(name: "BM_LOOPS_OF_LOOP", value: 13, isUnsigned: true)
!74 = !DIEnumerator(name: "BM_LOOPS_OF_EDGE", value: 14, isUnsigned: true)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ISectType", file: !1, line: 107, baseType: !76, size: 32, elements: !77)
!76 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!77 = !{!78, !79, !80, !81, !82, !83}
!78 = !DIEnumerator(name: "IX_NONE", value: -1)
!79 = !DIEnumerator(name: "IX_EDGE_TRI_EDGE0", value: 0)
!80 = !DIEnumerator(name: "IX_EDGE_TRI_EDGE1", value: 1)
!81 = !DIEnumerator(name: "IX_EDGE_TRI_EDGE2", value: 2)
!82 = !DIEnumerator(name: "IX_EDGE_TRI", value: 3)
!83 = !DIEnumerator(name: "IX_TOT", value: 4)
!84 = !{!85, !93, !5, !95, !160, !104, !76, !162, !75, !165, !107, !171, !172, !176, !180, !144, !182, !187}
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSetHashFP", file: !86, line: 178, baseType: !87)
!86 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashHashFP", file: !86, line: 43, baseType: !88)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{!5, !91}
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !43, line: 123, baseType: !97)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !43, line: 110, size: 640, elements: !98)
!98 = !{!99, !110, !116, !129, !130, !153, !159}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !97, file: !43, line: 111, baseType: !100, size: 128)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !43, line: 82, baseType: !101)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !43, line: 64, size: 128, elements: !102)
!102 = !{!103, !105, !106, !108, !109}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !101, file: !43, line: 65, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !101, file: !43, line: 66, baseType: !76, size: 32, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !101, file: !43, line: 73, baseType: !107, size: 8, offset: 96)
!107 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !101, file: !43, line: 74, baseType: !107, size: 8, offset: 104)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !101, file: !43, line: 80, baseType: !107, size: 8, offset: 112)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !97, file: !43, line: 112, baseType: !111, size: 64, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !43, line: 180, size: 16, elements: !113)
!113 = !{!114}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !112, file: !43, line: 181, baseType: !115, size: 16)
!115 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !97, file: !43, line: 114, baseType: !117, size: 64, offset: 192)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !43, line: 90, size: 448, elements: !119)
!119 = !{!120, !121, !122, !126, !127}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !118, file: !43, line: 91, baseType: !100, size: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !118, file: !43, line: 92, baseType: !111, size: 64, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !118, file: !43, line: 94, baseType: !123, size: 96, offset: 192)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 96, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 3)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !118, file: !43, line: 95, baseType: !123, size: 96, offset: 288)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !118, file: !43, line: 102, baseType: !128, size: 64, offset: 384)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !97, file: !43, line: 114, baseType: !117, size: 64, offset: 256)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !97, file: !43, line: 118, baseType: !131, size: 64, offset: 320)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !43, line: 125, size: 576, elements: !133)
!133 = !{!134, !135, !136, !137, !149, !150, !151, !152}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !132, file: !43, line: 126, baseType: !100, size: 128)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !132, file: !43, line: 129, baseType: !117, size: 64, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !132, file: !43, line: 130, baseType: !128, size: 64, offset: 192)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !132, file: !43, line: 131, baseType: !138, size: 64, offset: 256)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !43, line: 164, size: 448, elements: !140)
!140 = !{!141, !142, !143, !146, !147, !148}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !139, file: !43, line: 165, baseType: !100, size: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !139, file: !43, line: 166, baseType: !111, size: 64, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !139, file: !43, line: 172, baseType: !144, size: 64, offset: 192)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !43, line: 140, baseType: !132)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !139, file: !43, line: 174, baseType: !76, size: 32, offset: 256)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !139, file: !43, line: 175, baseType: !123, size: 96, offset: 288)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !139, file: !43, line: 176, baseType: !115, size: 16, offset: 384)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !132, file: !43, line: 135, baseType: !131, size: 64, offset: 320)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !132, file: !43, line: 135, baseType: !131, size: 64, offset: 384)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !132, file: !43, line: 139, baseType: !131, size: 64, offset: 448)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !132, file: !43, line: 139, baseType: !131, size: 64, offset: 512)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !97, file: !43, line: 122, baseType: !154, size: 128, offset: 384)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !43, line: 108, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !43, line: 106, size: 128, elements: !156)
!156 = !{!157, !158}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !155, file: !43, line: 107, baseType: !128, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !155, file: !43, line: 107, baseType: !128, size: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !97, file: !43, line: 122, baseType: !154, size: 128, offset: 512)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !43, line: 103, baseType: !118)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !163, line: 87, baseType: !164)
!163 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!164 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_gh_Entry", file: !86, line: 94, size: 192, elements: !167)
!167 = !{!168, !169, !170}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !166, file: !86, line: 94, baseType: !104, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !166, file: !86, line: 94, baseType: !104, size: 64, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !166, file: !86, line: 94, baseType: !104, size: 64, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !59, line: 79, baseType: !58)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !59, line: 158, baseType: !173)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{null, !104}
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !59, line: 159, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!104, !104}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !43, line: 178, baseType: !139)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashIterator", file: !86, line: 54, baseType: !184)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GHashIterator", file: !86, line: 50, size: 192, elements: !185)
!185 = !{!186, !190, !193}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "gh", scope: !184, file: !86, line: 51, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !86, line: 48, baseType: !189)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !86, line: 48, flags: DIFlagFwdDecl)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "curEntry", scope: !184, file: !86, line: 52, baseType: !191, size: 64, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry", file: !86, line: 52, flags: DIFlagFwdDecl)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "curBucket", scope: !184, file: !86, line: 53, baseType: !5, size: 32, offset: 128)
!194 = !{i32 7, !"Dwarf Version", i32 4}
!195 = !{i32 2, !"Debug Info Version", i32 3}
!196 = !{i32 1, !"wchar_size", i32 4}
!197 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!198 = distinct !DISubprogram(name: "BM_mesh_intersect", scope: !1, file: !1, line: 781, type: !199, scopeLine: 787, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !349)
!199 = !DISubroutineType(types: !200)
!200 = !{!201, !202, !341, !343, !344, !104, !347, !347, !348}
!201 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !43, line: 246, baseType: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !43, line: 186, size: 8064, elements: !205)
!205 = !{!206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !219, !220, !221, !222, !224, !226, !228, !229, !230, !231, !232, !233, !234, !235, !284, !324, !325, !326, !327, !328, !329, !330, !331, !338, !339, !340}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !204, file: !43, line: 187, baseType: !76, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !204, file: !43, line: 187, baseType: !76, size: 32, offset: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !204, file: !43, line: 187, baseType: !76, size: 32, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !204, file: !43, line: 187, baseType: !76, size: 32, offset: 96)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !204, file: !43, line: 188, baseType: !76, size: 32, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !204, file: !43, line: 188, baseType: !76, size: 32, offset: 160)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !204, file: !43, line: 188, baseType: !76, size: 32, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !204, file: !43, line: 193, baseType: !107, size: 8, offset: 224)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !204, file: !43, line: 197, baseType: !107, size: 8, offset: 232)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !204, file: !43, line: 201, baseType: !216, size: 64, offset: 256)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !218, line: 39, flags: DIFlagFwdDecl)
!218 = !DIFile(filename: "blender/source/blender/blenlib/BLI_linklist.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!219 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !204, file: !43, line: 201, baseType: !216, size: 64, offset: 320)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !204, file: !43, line: 201, baseType: !216, size: 64, offset: 384)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !204, file: !43, line: 201, baseType: !216, size: 64, offset: 448)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !204, file: !43, line: 208, baseType: !223, size: 64, offset: 512)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !204, file: !43, line: 209, baseType: !225, size: 64, offset: 576)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !204, file: !43, line: 210, baseType: !227, size: 64, offset: 640)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !204, file: !43, line: 213, baseType: !76, size: 32, offset: 704)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !204, file: !43, line: 214, baseType: !76, size: 32, offset: 736)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !204, file: !43, line: 215, baseType: !76, size: 32, offset: 768)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !204, file: !43, line: 218, baseType: !216, size: 64, offset: 832)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !204, file: !43, line: 218, baseType: !216, size: 64, offset: 896)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !204, file: !43, line: 218, baseType: !216, size: 64, offset: 960)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !204, file: !43, line: 220, baseType: !76, size: 32, offset: 1024)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !204, file: !43, line: 221, baseType: !236, size: 64, offset: 1088)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !4, line: 190, size: 10496, elements: !238)
!238 = !{!239, !271, !272, !276, !280, !281, !283}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !237, file: !4, line: 191, baseType: !240, size: 5120)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 5120, elements: !269)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !4, line: 147, size: 320, elements: !242)
!242 = !{!243, !246, !248, !258, !259}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !241, file: !4, line: 148, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !241, file: !4, line: 149, baseType: !247, size: 32, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !4, line: 112, baseType: !3)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !241, file: !4, line: 150, baseType: !249, size: 32, offset: 96)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !4, line: 142, baseType: !250)
!250 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !4, line: 138, size: 32, elements: !251)
!251 = !{!252, !254, !256}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !250, file: !4, line: 139, baseType: !253, size: 32)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !4, line: 122, baseType: !15)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !250, file: !4, line: 140, baseType: !255, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !4, line: 136, baseType: !21)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !250, file: !4, line: 141, baseType: !257, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !4, line: 130, baseType: !27)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !241, file: !4, line: 152, baseType: !76, size: 32, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !241, file: !4, line: 162, baseType: !260, size: 128, offset: 192)
!260 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !241, file: !4, line: 155, size: 128, elements: !261)
!261 = !{!262, !263, !264, !265, !266, !268}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !260, file: !4, line: 156, baseType: !76, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !260, file: !4, line: 157, baseType: !94, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !260, file: !4, line: 158, baseType: !104, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !260, file: !4, line: 159, baseType: !123, size: 96)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !260, file: !4, line: 160, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !260, file: !4, line: 161, baseType: !187, size: 64)
!269 = !{!270}
!270 = !DISubrange(count: 16)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !237, file: !4, line: 192, baseType: !240, size: 5120, offset: 5120)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !237, file: !4, line: 193, baseType: !273, size: 64, offset: 10240)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{null, !202, !236}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !237, file: !4, line: 194, baseType: !277, size: 64, offset: 10304)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !279, line: 52, flags: DIFlagFwdDecl)
!279 = !DIFile(filename: "blender/source/blender/blenlib/BLI_memarena.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!280 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !237, file: !4, line: 195, baseType: !76, size: 32, offset: 10368)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !237, file: !4, line: 196, baseType: !282, size: 32, offset: 10400)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !4, line: 188, baseType: !35)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !237, file: !4, line: 197, baseType: !76, size: 32, offset: 10432)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !204, file: !43, line: 223, baseType: !285, size: 1600, offset: 1152)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !286, line: 73, baseType: !287)
!286 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !286, line: 64, size: 1600, elements: !288)
!288 = !{!289, !307, !311, !312, !313, !314, !315}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !287, file: !286, line: 65, baseType: !290, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !286, line: 53, baseType: !292)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !286, line: 42, size: 832, elements: !293)
!293 = !{!294, !295, !296, !297, !298, !299, !300, !301, !302, !306}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !292, file: !286, line: 43, baseType: !76, size: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !292, file: !286, line: 44, baseType: !76, size: 32, offset: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !292, file: !286, line: 45, baseType: !76, size: 32, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !292, file: !286, line: 46, baseType: !76, size: 32, offset: 96)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !292, file: !286, line: 47, baseType: !76, size: 32, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !292, file: !286, line: 48, baseType: !76, size: 32, offset: 160)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !292, file: !286, line: 49, baseType: !76, size: 32, offset: 192)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !292, file: !286, line: 50, baseType: !76, size: 32, offset: 224)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !292, file: !286, line: 51, baseType: !303, size: 512, offset: 256)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 512, elements: !304)
!304 = !{!305}
!305 = !DISubrange(count: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !292, file: !286, line: 52, baseType: !104, size: 64, offset: 768)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !287, file: !286, line: 66, baseType: !308, size: 1312, offset: 64)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 1312, elements: !309)
!309 = !{!310}
!310 = !DISubrange(count: 41)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !287, file: !286, line: 69, baseType: !76, size: 32, offset: 1376)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !287, file: !286, line: 69, baseType: !76, size: 32, offset: 1408)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !287, file: !286, line: 70, baseType: !76, size: 32, offset: 1440)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !287, file: !286, line: 71, baseType: !216, size: 64, offset: 1472)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !287, file: !286, line: 72, baseType: !316, size: 64, offset: 1536)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !286, line: 59, baseType: !318)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !286, line: 57, size: 8192, elements: !319)
!319 = !{!320}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !318, file: !286, line: 58, baseType: !321, size: 8192)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 8192, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: 1024)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !204, file: !43, line: 223, baseType: !285, size: 1600, offset: 2752)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !204, file: !43, line: 223, baseType: !285, size: 1600, offset: 4352)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !204, file: !43, line: 223, baseType: !285, size: 1600, offset: 5952)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !204, file: !43, line: 233, baseType: !115, size: 16, offset: 7552)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !204, file: !43, line: 236, baseType: !76, size: 32, offset: 7584)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !204, file: !43, line: 238, baseType: !76, size: 32, offset: 7616)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !204, file: !43, line: 238, baseType: !76, size: 32, offset: 7648)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !204, file: !43, line: 239, baseType: !332, size: 128, offset: 7680)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !333, line: 71, baseType: !334)
!333 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !333, line: 69, size: 128, elements: !335)
!335 = !{!336, !337}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !334, file: !333, line: 70, baseType: !104, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !334, file: !333, line: 70, baseType: !104, size: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !204, file: !43, line: 241, baseType: !180, size: 64, offset: 7808)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !204, file: !43, line: 243, baseType: !332, size: 128, offset: 7872)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !204, file: !43, line: 245, baseType: !104, size: 64, offset: 8000)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 192, elements: !124)
!343 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!76, !180, !104}
!347 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !201)
!348 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !94)
!349 = !{}
!350 = !DILocalVariable(name: "bm", arg: 1, scope: !198, file: !1, line: 782, type: !202)
!351 = !DILocation(line: 782, column: 16, scope: !198)
!352 = !DILocalVariable(name: "looptris", arg: 2, scope: !198, file: !1, line: 783, type: !341)
!353 = !DILocation(line: 783, column: 26, scope: !198)
!354 = !DILocalVariable(name: "looptris_tot", arg: 3, scope: !198, file: !1, line: 783, type: !343)
!355 = !DILocation(line: 783, column: 50, scope: !198)
!356 = !DILocalVariable(name: "test_fn", arg: 4, scope: !198, file: !1, line: 784, type: !344)
!357 = !DILocation(line: 784, column: 15, scope: !198)
!358 = !DILocalVariable(name: "user_data", arg: 5, scope: !198, file: !1, line: 784, type: !104)
!359 = !DILocation(line: 784, column: 59, scope: !198)
!360 = !DILocalVariable(name: "use_self", arg: 6, scope: !198, file: !1, line: 785, type: !347)
!361 = !DILocation(line: 785, column: 20, scope: !198)
!362 = !DILocalVariable(name: "use_separate", arg: 7, scope: !198, file: !1, line: 785, type: !347)
!363 = !DILocation(line: 785, column: 41, scope: !198)
!364 = !DILocalVariable(name: "eps", arg: 8, scope: !198, file: !1, line: 786, type: !348)
!365 = !DILocation(line: 786, column: 21, scope: !198)
!366 = !DILocalVariable(name: "s", scope: !198, file: !1, line: 788, type: !367)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ISectState", file: !1, line: 122, size: 640, elements: !368)
!368 = !{!369, !370, !371, !372, !373, !377, !385, !388}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "bm", scope: !367, file: !1, line: 123, baseType: !202, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "edgetri_cache", scope: !367, file: !1, line: 124, baseType: !187, size: 64, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "edge_verts", scope: !367, file: !1, line: 125, baseType: !187, size: 64, offset: 128)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "face_edges", scope: !367, file: !1, line: 126, baseType: !187, size: 64, offset: 192)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "wire_edges", scope: !367, file: !1, line: 127, baseType: !374, size: 64, offset: 256)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSet", file: !86, line: 176, baseType: !376)
!376 = !DICompositeType(tag: DW_TAG_structure_type, name: "GSet", file: !86, line: 176, flags: DIFlagFwdDecl)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "vert_dissolve", scope: !367, file: !1, line: 128, baseType: !378, size: 64, offset: 320)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "LinkNode", file: !218, line: 48, baseType: !380)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !218, line: 45, size: 128, elements: !381)
!381 = !{!382, !384}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !380, file: !218, line: 46, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !380, file: !218, line: 47, baseType: !104, size: 64, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "mem_arena", scope: !367, file: !1, line: 130, baseType: !386, size: 64, offset: 384)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "MemArena", file: !279, line: 53, baseType: !278)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "epsilon", scope: !367, file: !1, line: 132, baseType: !389, size: 192, offset: 448)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ISectEpsilon", file: !1, line: 116, size: 192, elements: !390)
!390 = !{!391, !392, !393, !394, !395, !396}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "eps", scope: !389, file: !1, line: 117, baseType: !94, size: 32)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "eps_sq", scope: !389, file: !1, line: 117, baseType: !94, size: 32, offset: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "eps2x", scope: !389, file: !1, line: 118, baseType: !94, size: 32, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "eps2x_sq", scope: !389, file: !1, line: 118, baseType: !94, size: 32, offset: 96)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "eps_margin", scope: !389, file: !1, line: 119, baseType: !94, size: 32, offset: 128)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "eps_margin_sq", scope: !389, file: !1, line: 119, baseType: !94, size: 32, offset: 160)
!397 = !DILocation(line: 788, column: 20, scope: !198)
!398 = !DILocalVariable(name: "has_isect", scope: !198, file: !1, line: 789, type: !201)
!399 = !DILocation(line: 789, column: 7, scope: !198)
!400 = !DILocalVariable(name: "totface_orig", scope: !198, file: !1, line: 790, type: !343)
!401 = !DILocation(line: 790, column: 12, scope: !198)
!402 = !DILocation(line: 790, column: 27, scope: !198)
!403 = !DILocation(line: 790, column: 31, scope: !198)
!404 = !DILocalVariable(name: "tree_a", scope: !198, file: !1, line: 793, type: !405)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHTree", file: !407, line: 43, baseType: !408)
!407 = !DIFile(filename: "blender/source/blender/blenlib/BLI_kdopbvh.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "BVHTree", file: !407, line: 42, flags: DIFlagFwdDecl)
!409 = !DILocation(line: 793, column: 11, scope: !198)
!410 = !DILocalVariable(name: "tree_b", scope: !198, file: !1, line: 793, type: !405)
!411 = !DILocation(line: 793, column: 20, scope: !198)
!412 = !DILocalVariable(name: "tree_overlap_tot", scope: !198, file: !1, line: 794, type: !5)
!413 = !DILocation(line: 794, column: 15, scope: !198)
!414 = !DILocalVariable(name: "overlap", scope: !198, file: !1, line: 795, type: !415)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHTreeOverlap", file: !407, line: 48, baseType: !417)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BVHTreeOverlap", file: !407, line: 45, size: 64, elements: !418)
!418 = !{!419, !420}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "indexA", scope: !417, file: !407, line: 46, baseType: !76, size: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "indexB", scope: !417, file: !407, line: 47, baseType: !76, size: 32, offset: 32)
!421 = !DILocation(line: 795, column: 18, scope: !198)
!422 = !DILocation(line: 800, column: 9, scope: !198)
!423 = !DILocation(line: 800, column: 4, scope: !198)
!424 = !DILocation(line: 800, column: 7, scope: !198)
!425 = !DILocation(line: 802, column: 20, scope: !198)
!426 = !DILocation(line: 802, column: 4, scope: !198)
!427 = !DILocation(line: 802, column: 18, scope: !198)
!428 = !DILocation(line: 804, column: 17, scope: !198)
!429 = !DILocation(line: 804, column: 4, scope: !198)
!430 = !DILocation(line: 804, column: 15, scope: !198)
!431 = !DILocation(line: 805, column: 17, scope: !198)
!432 = !DILocation(line: 805, column: 4, scope: !198)
!433 = !DILocation(line: 805, column: 15, scope: !198)
!434 = !DILocation(line: 806, column: 17, scope: !198)
!435 = !DILocation(line: 806, column: 4, scope: !198)
!436 = !DILocation(line: 806, column: 15, scope: !198)
!437 = !DILocation(line: 807, column: 4, scope: !198)
!438 = !DILocation(line: 807, column: 18, scope: !198)
!439 = !DILocation(line: 809, column: 16, scope: !198)
!440 = !DILocation(line: 809, column: 4, scope: !198)
!441 = !DILocation(line: 809, column: 14, scope: !198)
!442 = !DILocation(line: 812, column: 18, scope: !198)
!443 = !DILocation(line: 812, column: 4, scope: !198)
!444 = !DILocation(line: 812, column: 12, scope: !198)
!445 = !DILocation(line: 812, column: 16, scope: !198)
!446 = !DILocation(line: 813, column: 20, scope: !198)
!447 = !DILocation(line: 813, column: 24, scope: !198)
!448 = !DILocation(line: 813, column: 4, scope: !198)
!449 = !DILocation(line: 813, column: 12, scope: !198)
!450 = !DILocation(line: 813, column: 18, scope: !198)
!451 = !DILocation(line: 814, column: 27, scope: !198)
!452 = !DILocation(line: 814, column: 35, scope: !198)
!453 = !DILocation(line: 814, column: 41, scope: !198)
!454 = !DILocation(line: 814, column: 4, scope: !198)
!455 = !DILocation(line: 814, column: 12, scope: !198)
!456 = !DILocation(line: 814, column: 23, scope: !198)
!457 = !DILocation(line: 816, column: 23, scope: !198)
!458 = !DILocation(line: 816, column: 31, scope: !198)
!459 = !DILocation(line: 816, column: 39, scope: !198)
!460 = !DILocation(line: 816, column: 47, scope: !198)
!461 = !DILocation(line: 816, column: 35, scope: !198)
!462 = !DILocation(line: 816, column: 4, scope: !198)
!463 = !DILocation(line: 816, column: 12, scope: !198)
!464 = !DILocation(line: 816, column: 19, scope: !198)
!465 = !DILocation(line: 817, column: 25, scope: !198)
!466 = !DILocation(line: 817, column: 33, scope: !198)
!467 = !DILocation(line: 817, column: 43, scope: !198)
!468 = !DILocation(line: 817, column: 51, scope: !198)
!469 = !DILocation(line: 817, column: 39, scope: !198)
!470 = !DILocation(line: 817, column: 4, scope: !198)
!471 = !DILocation(line: 817, column: 12, scope: !198)
!472 = !DILocation(line: 817, column: 21, scope: !198)
!473 = !DILocation(line: 818, column: 30, scope: !198)
!474 = !DILocation(line: 818, column: 38, scope: !198)
!475 = !DILocation(line: 818, column: 53, scope: !198)
!476 = !DILocation(line: 818, column: 61, scope: !198)
!477 = !DILocation(line: 818, column: 49, scope: !198)
!478 = !DILocation(line: 818, column: 4, scope: !198)
!479 = !DILocation(line: 818, column: 12, scope: !198)
!480 = !DILocation(line: 818, column: 26, scope: !198)
!481 = !DILocation(line: 821, column: 10, scope: !198)
!482 = !DILocation(line: 820, column: 2, scope: !198)
!483 = !DILocation(line: 831, column: 10, scope: !198)
!484 = !DILocation(line: 830, column: 2, scope: !198)
!485 = !DILocation(line: 841, column: 33, scope: !198)
!486 = !DILocation(line: 841, column: 2, scope: !198)
!487 = !DILocalVariable(name: "i", scope: !488, file: !1, line: 850, type: !76)
!488 = distinct !DILexicalBlock(scope: !198, file: !1, line: 849, column: 2)
!489 = !DILocation(line: 850, column: 7, scope: !488)
!490 = !DILocation(line: 851, column: 28, scope: !488)
!491 = !DILocation(line: 851, column: 44, scope: !488)
!492 = !DILocation(line: 851, column: 52, scope: !488)
!493 = !DILocation(line: 851, column: 12, scope: !488)
!494 = !DILocation(line: 851, column: 10, scope: !488)
!495 = !DILocation(line: 852, column: 10, scope: !496)
!496 = distinct !DILexicalBlock(scope: !488, file: !1, line: 852, column: 3)
!497 = !DILocation(line: 852, column: 8, scope: !496)
!498 = !DILocation(line: 852, column: 15, scope: !499)
!499 = distinct !DILexicalBlock(scope: !496, file: !1, line: 852, column: 3)
!500 = !DILocation(line: 852, column: 19, scope: !499)
!501 = !DILocation(line: 852, column: 17, scope: !499)
!502 = !DILocation(line: 852, column: 3, scope: !496)
!503 = !DILocation(line: 853, column: 8, scope: !504)
!504 = distinct !DILexicalBlock(scope: !505, file: !1, line: 853, column: 8)
!505 = distinct !DILexicalBlock(scope: !499, file: !1, line: 852, column: 38)
!506 = !DILocation(line: 853, column: 16, scope: !504)
!507 = !DILocation(line: 853, column: 25, scope: !504)
!508 = !DILocation(line: 853, column: 32, scope: !504)
!509 = !DILocation(line: 853, column: 35, scope: !504)
!510 = !DILocation(line: 853, column: 46, scope: !504)
!511 = !DILocation(line: 853, column: 8, scope: !505)
!512 = !DILocalVariable(name: "t_cos", scope: !513, file: !1, line: 854, type: !514)
!513 = distinct !DILexicalBlock(scope: !504, file: !1, line: 853, column: 52)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !348, size: 288, elements: !515)
!515 = !{!125, !125}
!516 = !DILocation(line: 854, column: 17, scope: !513)
!517 = !DILocation(line: 854, column: 31, scope: !513)
!518 = !DILocation(line: 855, column: 6, scope: !513)
!519 = !DILocation(line: 855, column: 7, scope: !513)
!520 = !DILocation(line: 856, column: 6, scope: !513)
!521 = !DILocation(line: 856, column: 7, scope: !513)
!522 = !DILocation(line: 857, column: 6, scope: !513)
!523 = !DILocation(line: 857, column: 7, scope: !513)
!524 = !DILocation(line: 860, column: 24, scope: !513)
!525 = !DILocation(line: 860, column: 32, scope: !513)
!526 = !DILocation(line: 860, column: 44, scope: !513)
!527 = !DILocation(line: 860, column: 35, scope: !513)
!528 = !DILocation(line: 860, column: 5, scope: !513)
!529 = !DILocation(line: 861, column: 4, scope: !513)
!530 = !DILocation(line: 862, column: 3, scope: !505)
!531 = !DILocation(line: 852, column: 34, scope: !499)
!532 = !DILocation(line: 852, column: 3, scope: !499)
!533 = distinct !{!533, !502, !534}
!534 = !DILocation(line: 862, column: 3, scope: !496)
!535 = !DILocation(line: 863, column: 23, scope: !488)
!536 = !DILocation(line: 863, column: 3, scope: !488)
!537 = !DILocation(line: 866, column: 6, scope: !538)
!538 = distinct !DILexicalBlock(scope: !198, file: !1, line: 866, column: 6)
!539 = !DILocation(line: 866, column: 15, scope: !538)
!540 = !DILocation(line: 866, column: 6, scope: !198)
!541 = !DILocalVariable(name: "i", scope: !542, file: !1, line: 867, type: !76)
!542 = distinct !DILexicalBlock(scope: !538, file: !1, line: 866, column: 25)
!543 = !DILocation(line: 867, column: 7, scope: !542)
!544 = !DILocation(line: 868, column: 28, scope: !542)
!545 = !DILocation(line: 868, column: 44, scope: !542)
!546 = !DILocation(line: 868, column: 52, scope: !542)
!547 = !DILocation(line: 868, column: 12, scope: !542)
!548 = !DILocation(line: 868, column: 10, scope: !542)
!549 = !DILocation(line: 869, column: 10, scope: !550)
!550 = distinct !DILexicalBlock(scope: !542, file: !1, line: 869, column: 3)
!551 = !DILocation(line: 869, column: 8, scope: !550)
!552 = !DILocation(line: 869, column: 15, scope: !553)
!553 = distinct !DILexicalBlock(scope: !550, file: !1, line: 869, column: 3)
!554 = !DILocation(line: 869, column: 19, scope: !553)
!555 = !DILocation(line: 869, column: 17, scope: !553)
!556 = !DILocation(line: 869, column: 3, scope: !550)
!557 = !DILocation(line: 870, column: 8, scope: !558)
!558 = distinct !DILexicalBlock(scope: !559, file: !1, line: 870, column: 8)
!559 = distinct !DILexicalBlock(scope: !553, file: !1, line: 869, column: 38)
!560 = !DILocation(line: 870, column: 16, scope: !558)
!561 = !DILocation(line: 870, column: 25, scope: !558)
!562 = !DILocation(line: 870, column: 32, scope: !558)
!563 = !DILocation(line: 870, column: 35, scope: !558)
!564 = !DILocation(line: 870, column: 46, scope: !558)
!565 = !DILocation(line: 870, column: 8, scope: !559)
!566 = !DILocalVariable(name: "t_cos", scope: !567, file: !1, line: 871, type: !514)
!567 = distinct !DILexicalBlock(scope: !558, file: !1, line: 870, column: 52)
!568 = !DILocation(line: 871, column: 17, scope: !567)
!569 = !DILocation(line: 871, column: 31, scope: !567)
!570 = !DILocation(line: 872, column: 6, scope: !567)
!571 = !DILocation(line: 872, column: 7, scope: !567)
!572 = !DILocation(line: 873, column: 6, scope: !567)
!573 = !DILocation(line: 873, column: 7, scope: !567)
!574 = !DILocation(line: 874, column: 6, scope: !567)
!575 = !DILocation(line: 874, column: 7, scope: !567)
!576 = !DILocation(line: 877, column: 24, scope: !567)
!577 = !DILocation(line: 877, column: 32, scope: !567)
!578 = !DILocation(line: 877, column: 44, scope: !567)
!579 = !DILocation(line: 877, column: 35, scope: !567)
!580 = !DILocation(line: 877, column: 5, scope: !567)
!581 = !DILocation(line: 878, column: 4, scope: !567)
!582 = !DILocation(line: 879, column: 3, scope: !559)
!583 = !DILocation(line: 869, column: 34, scope: !553)
!584 = !DILocation(line: 869, column: 3, scope: !553)
!585 = distinct !{!585, !556, !586}
!586 = !DILocation(line: 879, column: 3, scope: !550)
!587 = !DILocation(line: 880, column: 23, scope: !542)
!588 = !DILocation(line: 880, column: 3, scope: !542)
!589 = !DILocation(line: 881, column: 2, scope: !542)
!590 = !DILocation(line: 883, column: 12, scope: !591)
!591 = distinct !DILexicalBlock(scope: !538, file: !1, line: 882, column: 7)
!592 = !DILocation(line: 883, column: 10, scope: !591)
!593 = !DILocation(line: 886, column: 32, scope: !198)
!594 = !DILocation(line: 886, column: 40, scope: !198)
!595 = !DILocation(line: 886, column: 12, scope: !198)
!596 = !DILocation(line: 886, column: 10, scope: !198)
!597 = !DILocation(line: 888, column: 6, scope: !598)
!598 = distinct !DILexicalBlock(scope: !198, file: !1, line: 888, column: 6)
!599 = !DILocation(line: 888, column: 6, scope: !198)
!600 = !DILocalVariable(name: "i", scope: !601, file: !1, line: 889, type: !5)
!601 = distinct !DILexicalBlock(scope: !598, file: !1, line: 888, column: 15)
!602 = !DILocation(line: 889, column: 16, scope: !601)
!603 = !DILocation(line: 891, column: 10, scope: !604)
!604 = distinct !DILexicalBlock(scope: !601, file: !1, line: 891, column: 3)
!605 = !DILocation(line: 891, column: 8, scope: !604)
!606 = !DILocation(line: 891, column: 15, scope: !607)
!607 = distinct !DILexicalBlock(scope: !604, file: !1, line: 891, column: 3)
!608 = !DILocation(line: 891, column: 19, scope: !607)
!609 = !DILocation(line: 891, column: 17, scope: !607)
!610 = !DILocation(line: 891, column: 3, scope: !604)
!611 = !DILocation(line: 899, column: 12, scope: !612)
!612 = distinct !DILexicalBlock(scope: !607, file: !1, line: 891, column: 42)
!613 = !DILocation(line: 899, column: 20, scope: !612)
!614 = !DILocation(line: 899, column: 23, scope: !612)
!615 = !DILocation(line: 900, column: 12, scope: !612)
!616 = !DILocation(line: 900, column: 20, scope: !612)
!617 = !DILocation(line: 900, column: 23, scope: !612)
!618 = !DILocation(line: 901, column: 12, scope: !612)
!619 = !DILocation(line: 901, column: 21, scope: !612)
!620 = !DILocation(line: 901, column: 29, scope: !612)
!621 = !DILocation(line: 901, column: 32, scope: !612)
!622 = !DILocation(line: 902, column: 12, scope: !612)
!623 = !DILocation(line: 902, column: 21, scope: !612)
!624 = !DILocation(line: 902, column: 29, scope: !612)
!625 = !DILocation(line: 902, column: 32, scope: !612)
!626 = !DILocation(line: 897, column: 4, scope: !612)
!627 = !DILocation(line: 906, column: 3, scope: !612)
!628 = !DILocation(line: 891, column: 38, scope: !607)
!629 = !DILocation(line: 891, column: 3, scope: !607)
!630 = distinct !{!630, !610, !631}
!631 = !DILocation(line: 906, column: 3, scope: !604)
!632 = !DILocation(line: 907, column: 3, scope: !601)
!633 = !DILocation(line: 907, column: 13, scope: !601)
!634 = !DILocation(line: 908, column: 2, scope: !601)
!635 = !DILocation(line: 909, column: 19, scope: !198)
!636 = !DILocation(line: 909, column: 2, scope: !198)
!637 = !DILocation(line: 910, column: 6, scope: !638)
!638 = distinct !DILexicalBlock(scope: !198, file: !1, line: 910, column: 6)
!639 = !DILocation(line: 910, column: 16, scope: !638)
!640 = !DILocation(line: 910, column: 13, scope: !638)
!641 = !DILocation(line: 910, column: 6, scope: !198)
!642 = !DILocation(line: 911, column: 20, scope: !643)
!643 = distinct !DILexicalBlock(scope: !638, file: !1, line: 910, column: 24)
!644 = !DILocation(line: 911, column: 3, scope: !643)
!645 = !DILocation(line: 912, column: 2, scope: !643)
!646 = !DILocalVariable(name: "gh_iter", scope: !647, file: !1, line: 958, type: !183)
!647 = distinct !DILexicalBlock(scope: !198, file: !1, line: 957, column: 2)
!648 = !DILocation(line: 958, column: 17, scope: !647)
!649 = !DILocation(line: 960, column: 3, scope: !650)
!650 = distinct !DILexicalBlock(scope: !647, file: !1, line: 960, column: 3)
!651 = !DILocation(line: 960, column: 3, scope: !652)
!652 = distinct !DILexicalBlock(scope: !650, file: !1, line: 960, column: 3)
!653 = !DILocalVariable(name: "e", scope: !654, file: !1, line: 961, type: !95)
!654 = distinct !DILexicalBlock(scope: !652, file: !1, line: 960, column: 38)
!655 = !DILocation(line: 961, column: 12, scope: !654)
!656 = !DILocation(line: 961, column: 16, scope: !654)
!657 = !DILocalVariable(name: "v_ls_base", scope: !654, file: !1, line: 962, type: !658)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LinkBase", file: !1, line: 139, size: 128, elements: !660)
!660 = !{!661, !662}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !659, file: !1, line: 140, baseType: !378, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "list_len", scope: !659, file: !1, line: 141, baseType: !5, size: 32, offset: 64)
!663 = !DILocation(line: 962, column: 21, scope: !654)
!664 = !DILocation(line: 962, column: 33, scope: !654)
!665 = !DILocalVariable(name: "v_start", scope: !654, file: !1, line: 964, type: !160)
!666 = !DILocation(line: 964, column: 12, scope: !654)
!667 = !DILocalVariable(name: "v_end", scope: !654, file: !1, line: 965, type: !160)
!668 = !DILocation(line: 965, column: 12, scope: !654)
!669 = !DILocalVariable(name: "v_prev", scope: !654, file: !1, line: 966, type: !160)
!670 = !DILocation(line: 966, column: 12, scope: !654)
!671 = !DILocalVariable(name: "is_wire", scope: !654, file: !1, line: 967, type: !201)
!672 = !DILocation(line: 967, column: 9, scope: !654)
!673 = !DILocalVariable(name: "node", scope: !654, file: !1, line: 969, type: !378)
!674 = !DILocation(line: 969, column: 14, scope: !654)
!675 = !DILocation(line: 972, column: 14, scope: !654)
!676 = !DILocation(line: 972, column: 17, scope: !654)
!677 = !DILocation(line: 972, column: 12, scope: !654)
!678 = !DILocation(line: 973, column: 12, scope: !654)
!679 = !DILocation(line: 973, column: 15, scope: !654)
!680 = !DILocation(line: 973, column: 10, scope: !654)
!681 = !DILocation(line: 975, column: 8, scope: !682)
!682 = distinct !DILexicalBlock(scope: !654, file: !1, line: 975, column: 8)
!683 = !DILocation(line: 975, column: 19, scope: !682)
!684 = !DILocation(line: 975, column: 28, scope: !682)
!685 = !DILocation(line: 975, column: 8, scope: !654)
!686 = !DILocation(line: 976, column: 21, scope: !687)
!687 = distinct !DILexicalBlock(scope: !682, file: !1, line: 975, column: 33)
!688 = !DILocation(line: 976, column: 30, scope: !687)
!689 = !DILocation(line: 976, column: 34, scope: !687)
!690 = !DILocation(line: 976, column: 5, scope: !687)
!691 = !DILocation(line: 977, column: 4, scope: !687)
!692 = !DILocation(line: 983, column: 32, scope: !654)
!693 = !DILocation(line: 983, column: 45, scope: !654)
!694 = !DILocation(line: 983, column: 14, scope: !654)
!695 = !DILocation(line: 983, column: 12, scope: !654)
!696 = !DILocation(line: 993, column: 13, scope: !654)
!697 = !DILocation(line: 993, column: 11, scope: !654)
!698 = !DILocation(line: 995, column: 16, scope: !699)
!699 = distinct !DILexicalBlock(scope: !654, file: !1, line: 995, column: 4)
!700 = !DILocation(line: 995, column: 27, scope: !699)
!701 = !DILocation(line: 995, column: 14, scope: !699)
!702 = !DILocation(line: 995, column: 9, scope: !699)
!703 = !DILocation(line: 995, column: 33, scope: !704)
!704 = distinct !DILexicalBlock(scope: !699, file: !1, line: 995, column: 4)
!705 = !DILocation(line: 995, column: 4, scope: !699)
!706 = !DILocalVariable(name: "vi", scope: !707, file: !1, line: 996, type: !160)
!707 = distinct !DILexicalBlock(scope: !704, file: !1, line: 995, column: 58)
!708 = !DILocation(line: 996, column: 13, scope: !707)
!709 = !DILocation(line: 996, column: 18, scope: !707)
!710 = !DILocation(line: 996, column: 24, scope: !707)
!711 = !DILocalVariable(name: "fac", scope: !707, file: !1, line: 997, type: !348)
!712 = !DILocation(line: 997, column: 17, scope: !707)
!713 = !DILocation(line: 997, column: 44, scope: !707)
!714 = !DILocation(line: 997, column: 48, scope: !707)
!715 = !DILocation(line: 997, column: 52, scope: !707)
!716 = !DILocation(line: 997, column: 55, scope: !707)
!717 = !DILocation(line: 997, column: 59, scope: !707)
!718 = !DILocation(line: 997, column: 63, scope: !707)
!719 = !DILocation(line: 997, column: 66, scope: !707)
!720 = !DILocation(line: 997, column: 70, scope: !707)
!721 = !DILocation(line: 997, column: 23, scope: !707)
!722 = !DILocation(line: 999, column: 25, scope: !723)
!723 = distinct !DILexicalBlock(scope: !707, file: !1, line: 999, column: 9)
!724 = !DILocation(line: 999, column: 28, scope: !723)
!725 = !DILocation(line: 999, column: 9, scope: !723)
!726 = !DILocation(line: 999, column: 9, scope: !707)
!727 = !DILocation(line: 1000, column: 29, scope: !728)
!728 = distinct !DILexicalBlock(scope: !723, file: !1, line: 999, column: 37)
!729 = !DILocation(line: 1000, column: 33, scope: !728)
!730 = !DILocation(line: 1000, column: 36, scope: !728)
!731 = !DILocation(line: 1000, column: 50, scope: !728)
!732 = !DILocation(line: 1000, column: 15, scope: !728)
!733 = !DILocation(line: 1000, column: 13, scope: !728)
!734 = !DILocation(line: 1003, column: 26, scope: !735)
!735 = distinct !DILexicalBlock(scope: !728, file: !1, line: 1003, column: 10)
!736 = !DILocation(line: 1003, column: 34, scope: !735)
!737 = !DILocation(line: 1003, column: 11, scope: !735)
!738 = !DILocation(line: 1003, column: 38, scope: !735)
!739 = !DILocation(line: 1004, column: 39, scope: !735)
!740 = !DILocation(line: 1004, column: 47, scope: !735)
!741 = !DILocation(line: 1004, column: 11, scope: !735)
!742 = !DILocation(line: 1004, column: 51, scope: !735)
!743 = !DILocation(line: 1005, column: 41, scope: !735)
!744 = !DILocation(line: 1005, column: 49, scope: !735)
!745 = !DILocation(line: 1005, column: 11, scope: !735)
!746 = !DILocation(line: 1003, column: 10, scope: !728)
!747 = !DILocation(line: 1007, column: 22, scope: !748)
!748 = distinct !DILexicalBlock(scope: !735, file: !1, line: 1006, column: 6)
!749 = !DILocation(line: 1007, column: 26, scope: !748)
!750 = !DILocation(line: 1007, column: 34, scope: !748)
!751 = !DILocation(line: 1007, column: 7, scope: !748)
!752 = !DILocation(line: 1008, column: 6, scope: !748)
!753 = !DILocation(line: 1010, column: 18, scope: !754)
!754 = distinct !DILexicalBlock(scope: !735, file: !1, line: 1009, column: 11)
!755 = !DILocation(line: 1010, column: 26, scope: !754)
!756 = !DILocation(line: 1010, column: 30, scope: !754)
!757 = !DILocation(line: 1010, column: 34, scope: !754)
!758 = !DILocation(line: 1010, column: 7, scope: !754)
!759 = !DILocation(line: 1012, column: 15, scope: !728)
!760 = !DILocation(line: 1012, column: 13, scope: !728)
!761 = !DILocation(line: 1013, column: 10, scope: !762)
!762 = distinct !DILexicalBlock(scope: !728, file: !1, line: 1013, column: 10)
!763 = !DILocation(line: 1013, column: 10, scope: !728)
!764 = !DILocation(line: 1014, column: 25, scope: !765)
!765 = distinct !DILexicalBlock(scope: !762, file: !1, line: 1013, column: 19)
!766 = !DILocation(line: 1014, column: 37, scope: !765)
!767 = !DILocation(line: 1014, column: 7, scope: !765)
!768 = !DILocation(line: 1015, column: 6, scope: !765)
!769 = !DILocation(line: 1016, column: 5, scope: !728)
!770 = !DILocation(line: 1017, column: 4, scope: !707)
!771 = !DILocation(line: 995, column: 46, scope: !704)
!772 = !DILocation(line: 995, column: 52, scope: !704)
!773 = !DILocation(line: 995, column: 44, scope: !704)
!774 = !DILocation(line: 995, column: 4, scope: !704)
!775 = distinct !{!775, !705, !776}
!776 = !DILocation(line: 1017, column: 4, scope: !699)
!777 = !DILocation(line: 1018, column: 3, scope: !654)
!778 = distinct !{!778, !649, !779}
!779 = !DILocation(line: 1018, column: 3, scope: !650)
!780 = !DILocalVariable(name: "splice_ls", scope: !781, file: !1, line: 1027, type: !782)
!781 = distinct !DILexicalBlock(scope: !198, file: !1, line: 1025, column: 2)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 128, elements: !784)
!784 = !{!785}
!785 = !DISubrange(count: 2)
!786 = !DILocation(line: 1027, column: 13, scope: !781)
!787 = !DILocalVariable(name: "_splice_ls_index", scope: !781, file: !1, line: 1028, type: !5)
!788 = !DILocation(line: 1028, column: 3, scope: !781)
!789 = !DILocalVariable(name: "node", scope: !781, file: !1, line: 1029, type: !378)
!790 = !DILocation(line: 1029, column: 13, scope: !781)
!791 = !DILocation(line: 1032, column: 17, scope: !792)
!792 = distinct !DILexicalBlock(scope: !781, file: !1, line: 1032, column: 3)
!793 = !DILocation(line: 1032, column: 13, scope: !792)
!794 = !DILocation(line: 1032, column: 8, scope: !792)
!795 = !DILocation(line: 1032, column: 32, scope: !796)
!796 = distinct !DILexicalBlock(scope: !792, file: !1, line: 1032, column: 3)
!797 = !DILocation(line: 1032, column: 3, scope: !792)
!798 = !DILocalVariable(name: "v", scope: !799, file: !1, line: 1033, type: !160)
!799 = distinct !DILexicalBlock(scope: !796, file: !1, line: 1032, column: 57)
!800 = !DILocation(line: 1033, column: 12, scope: !799)
!801 = !DILocation(line: 1033, column: 16, scope: !799)
!802 = !DILocation(line: 1033, column: 22, scope: !799)
!803 = !DILocation(line: 1034, column: 8, scope: !804)
!804 = distinct !DILexicalBlock(scope: !799, file: !1, line: 1034, column: 8)
!805 = !DILocation(line: 1034, column: 8, scope: !799)
!806 = !DILocation(line: 1035, column: 31, scope: !807)
!807 = distinct !DILexicalBlock(scope: !808, file: !1, line: 1035, column: 9)
!808 = distinct !DILexicalBlock(scope: !804, file: !1, line: 1034, column: 43)
!809 = !DILocation(line: 1035, column: 10, scope: !807)
!810 = !DILocation(line: 1035, column: 9, scope: !808)
!811 = !DILocation(line: 1036, column: 6, scope: !812)
!812 = distinct !DILexicalBlock(scope: !807, file: !1, line: 1035, column: 35)
!813 = !DILocation(line: 1037, column: 5, scope: !812)
!814 = !DILocation(line: 1038, column: 4, scope: !808)
!815 = !DILocation(line: 1039, column: 3, scope: !799)
!816 = !DILocation(line: 1032, column: 45, scope: !796)
!817 = !DILocation(line: 1032, column: 51, scope: !796)
!818 = !DILocation(line: 1032, column: 43, scope: !796)
!819 = !DILocation(line: 1032, column: 3, scope: !796)
!820 = distinct !{!820, !797, !821}
!821 = !DILocation(line: 1039, column: 3, scope: !792)
!822 = !DILocation(line: 1041, column: 15, scope: !781)
!823 = !DILocation(line: 1041, column: 57, scope: !781)
!824 = !DILocation(line: 1041, column: 41, scope: !781)
!825 = !DILocation(line: 1041, column: 27, scope: !781)
!826 = !DILocation(line: 1041, column: 69, scope: !781)
!827 = !DILocation(line: 1041, column: 13, scope: !781)
!828 = !DILocation(line: 1042, column: 3, scope: !781)
!829 = !DILocation(line: 1044, column: 17, scope: !830)
!830 = distinct !DILexicalBlock(scope: !781, file: !1, line: 1044, column: 3)
!831 = !DILocation(line: 1044, column: 13, scope: !830)
!832 = !DILocation(line: 1044, column: 8, scope: !830)
!833 = !DILocation(line: 1044, column: 32, scope: !834)
!834 = distinct !DILexicalBlock(scope: !830, file: !1, line: 1044, column: 3)
!835 = !DILocation(line: 1044, column: 3, scope: !830)
!836 = !DILocalVariable(name: "e_pair", scope: !837, file: !1, line: 1045, type: !838)
!837 = distinct !DILexicalBlock(scope: !834, file: !1, line: 1044, column: 57)
!838 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 128, elements: !784)
!839 = !DILocation(line: 1045, column: 12, scope: !837)
!840 = !DILocalVariable(name: "v", scope: !837, file: !1, line: 1046, type: !160)
!841 = !DILocation(line: 1046, column: 12, scope: !837)
!842 = !DILocation(line: 1046, column: 16, scope: !837)
!843 = !DILocation(line: 1046, column: 22, scope: !837)
!844 = !DILocalVariable(name: "v_a", scope: !837, file: !1, line: 1047, type: !160)
!845 = !DILocation(line: 1047, column: 12, scope: !837)
!846 = !DILocalVariable(name: "v_b", scope: !837, file: !1, line: 1047, type: !160)
!847 = !DILocation(line: 1047, column: 18, scope: !837)
!848 = !DILocation(line: 1049, column: 9, scope: !849)
!849 = distinct !DILexicalBlock(scope: !837, file: !1, line: 1049, column: 8)
!850 = !DILocation(line: 1049, column: 8, scope: !837)
!851 = !DILocation(line: 1050, column: 5, scope: !852)
!852 = distinct !DILexicalBlock(scope: !849, file: !1, line: 1049, column: 44)
!853 = !DILocation(line: 1054, column: 16, scope: !837)
!854 = !DILocation(line: 1054, column: 19, scope: !837)
!855 = !DILocation(line: 1054, column: 4, scope: !837)
!856 = !DILocation(line: 1054, column: 14, scope: !837)
!857 = !DILocation(line: 1055, column: 16, scope: !837)
!858 = !DILocation(line: 1055, column: 4, scope: !837)
!859 = !DILocation(line: 1055, column: 14, scope: !837)
!860 = !DILocation(line: 1057, column: 8, scope: !861)
!861 = distinct !DILexicalBlock(scope: !837, file: !1, line: 1057, column: 8)
!862 = !DILocation(line: 1057, column: 50, scope: !861)
!863 = !DILocation(line: 1058, column: 8, scope: !861)
!864 = !DILocation(line: 1057, column: 8, scope: !837)
!865 = !DILocation(line: 1060, column: 5, scope: !866)
!866 = distinct !DILexicalBlock(scope: !861, file: !1, line: 1059, column: 4)
!867 = !DILocation(line: 1063, column: 29, scope: !837)
!868 = !DILocation(line: 1063, column: 40, scope: !837)
!869 = !DILocation(line: 1063, column: 10, scope: !837)
!870 = !DILocation(line: 1063, column: 8, scope: !837)
!871 = !DILocation(line: 1064, column: 29, scope: !837)
!872 = !DILocation(line: 1064, column: 40, scope: !837)
!873 = !DILocation(line: 1064, column: 10, scope: !837)
!874 = !DILocation(line: 1064, column: 8, scope: !837)
!875 = !DILocation(line: 1067, column: 8, scope: !876)
!876 = distinct !DILexicalBlock(scope: !837, file: !1, line: 1067, column: 8)
!877 = !DILocation(line: 1067, column: 44, scope: !876)
!878 = !DILocation(line: 1068, column: 8, scope: !876)
!879 = !DILocation(line: 1067, column: 8, scope: !837)
!880 = !DILocation(line: 1072, column: 4, scope: !881)
!881 = distinct !DILexicalBlock(scope: !876, file: !1, line: 1069, column: 4)
!882 = !DILocation(line: 1073, column: 15, scope: !883)
!883 = distinct !DILexicalBlock(scope: !876, file: !1, line: 1073, column: 13)
!884 = !DILocation(line: 1073, column: 52, scope: !883)
!885 = !DILocation(line: 1074, column: 15, scope: !883)
!886 = !DILocation(line: 1073, column: 13, scope: !876)
!887 = !DILocalVariable(name: "splice_pair", scope: !888, file: !1, line: 1077, type: !223)
!888 = distinct !DILexicalBlock(scope: !883, file: !1, line: 1075, column: 4)
!889 = !DILocation(line: 1077, column: 14, scope: !888)
!890 = !DILocation(line: 1078, column: 5, scope: !888)
!891 = !DILocation(line: 1079, column: 19, scope: !888)
!892 = !DILocation(line: 1079, column: 17, scope: !888)
!893 = !DILocation(line: 1080, column: 22, scope: !888)
!894 = !DILocation(line: 1080, column: 5, scope: !888)
!895 = !DILocation(line: 1080, column: 20, scope: !888)
!896 = !DILocation(line: 1081, column: 22, scope: !888)
!897 = !DILocation(line: 1081, column: 5, scope: !888)
!898 = !DILocation(line: 1081, column: 20, scope: !888)
!899 = !DILocation(line: 1085, column: 4, scope: !888)
!900 = !DILocalVariable(name: "e", scope: !901, file: !1, line: 1090, type: !95)
!901 = distinct !DILexicalBlock(scope: !883, file: !1, line: 1086, column: 9)
!902 = !DILocation(line: 1090, column: 13, scope: !901)
!903 = !DILocalVariable(name: "e_step", scope: !901, file: !1, line: 1091, type: !95)
!904 = !DILocation(line: 1091, column: 13, scope: !901)
!905 = !DILocalVariable(name: "v_step", scope: !901, file: !1, line: 1092, type: !160)
!906 = !DILocation(line: 1092, column: 13, scope: !901)
!907 = !DILocation(line: 1095, column: 9, scope: !908)
!908 = distinct !DILexicalBlock(scope: !901, file: !1, line: 1095, column: 9)
!909 = !DILocation(line: 1095, column: 9, scope: !901)
!910 = !DILocation(line: 1096, column: 10, scope: !911)
!911 = distinct !DILexicalBlock(scope: !908, file: !1, line: 1095, column: 46)
!912 = !DILocation(line: 1096, column: 8, scope: !911)
!913 = !DILocation(line: 1100, column: 5, scope: !911)
!914 = !DILocalVariable(name: "sw_ap", scope: !915, file: !1, line: 1102, type: !160)
!915 = distinct !DILexicalBlock(scope: !916, file: !1, line: 1102, column: 6)
!916 = distinct !DILexicalBlock(scope: !908, file: !1, line: 1101, column: 10)
!917 = !DILocation(line: 1102, column: 6, scope: !915)
!918 = !DILocation(line: 1103, column: 10, scope: !916)
!919 = !DILocation(line: 1103, column: 8, scope: !916)
!920 = !DILocation(line: 1110, column: 14, scope: !901)
!921 = !DILocation(line: 1110, column: 12, scope: !901)
!922 = !DILocation(line: 1111, column: 14, scope: !901)
!923 = !DILocation(line: 1111, column: 12, scope: !901)
!924 = !DILocation(line: 1113, column: 5, scope: !901)
!925 = !DILocalVariable(name: "e_next", scope: !926, file: !1, line: 1114, type: !95)
!926 = distinct !DILexicalBlock(scope: !901, file: !1, line: 1113, column: 18)
!927 = !DILocation(line: 1114, column: 14, scope: !926)
!928 = !DILocalVariable(name: "v_next", scope: !926, file: !1, line: 1115, type: !160)
!929 = !DILocation(line: 1115, column: 14, scope: !926)
!930 = !DILocation(line: 1117, column: 34, scope: !926)
!931 = !DILocation(line: 1117, column: 42, scope: !926)
!932 = !DILocation(line: 1117, column: 15, scope: !926)
!933 = !DILocation(line: 1117, column: 13, scope: !926)
!934 = !DILocation(line: 1118, column: 6, scope: !926)
!935 = !DILocation(line: 1119, column: 11, scope: !936)
!936 = distinct !DILexicalBlock(scope: !926, file: !1, line: 1119, column: 10)
!937 = !DILocation(line: 1119, column: 10, scope: !926)
!938 = !DILocalVariable(name: "splice_pair", scope: !939, file: !1, line: 1120, type: !223)
!939 = distinct !DILexicalBlock(scope: !936, file: !1, line: 1119, column: 51)
!940 = !DILocation(line: 1120, column: 16, scope: !939)
!941 = !DILocation(line: 1124, column: 21, scope: !939)
!942 = !DILocation(line: 1124, column: 19, scope: !939)
!943 = !DILocation(line: 1125, column: 24, scope: !939)
!944 = !DILocation(line: 1125, column: 7, scope: !939)
!945 = !DILocation(line: 1125, column: 22, scope: !939)
!946 = !DILocation(line: 1126, column: 24, scope: !939)
!947 = !DILocation(line: 1126, column: 7, scope: !939)
!948 = !DILocation(line: 1126, column: 22, scope: !939)
!949 = !DILocation(line: 1127, column: 7, scope: !939)
!950 = !DILocation(line: 1130, column: 35, scope: !951)
!951 = distinct !DILexicalBlock(scope: !936, file: !1, line: 1129, column: 11)
!952 = !DILocation(line: 1130, column: 43, scope: !951)
!953 = !DILocation(line: 1130, column: 16, scope: !951)
!954 = !DILocation(line: 1130, column: 14, scope: !951)
!955 = !DILocation(line: 1133, column: 15, scope: !926)
!956 = !DILocation(line: 1133, column: 13, scope: !926)
!957 = !DILocation(line: 1134, column: 15, scope: !926)
!958 = !DILocation(line: 1134, column: 13, scope: !926)
!959 = !DILocation(line: 1135, column: 6, scope: !926)
!960 = distinct !{!960, !924, !961}
!961 = !DILocation(line: 1142, column: 5, scope: !901)
!962 = !DILocation(line: 1147, column: 3, scope: !837)
!963 = !DILocation(line: 1044, column: 45, scope: !834)
!964 = !DILocation(line: 1044, column: 51, scope: !834)
!965 = !DILocation(line: 1044, column: 43, scope: !834)
!966 = !DILocation(line: 1044, column: 3, scope: !834)
!967 = distinct !{!967, !835, !968}
!968 = !DILocation(line: 1147, column: 3, scope: !830)
!969 = !DILocalVariable(name: "gh_iter", scope: !970, file: !1, line: 1151, type: !183)
!970 = distinct !DILexicalBlock(scope: !781, file: !1, line: 1150, column: 3)
!971 = !DILocation(line: 1151, column: 18, scope: !970)
!972 = !DILocation(line: 1153, column: 4, scope: !973)
!973 = distinct !DILexicalBlock(scope: !970, file: !1, line: 1153, column: 4)
!974 = !DILocation(line: 1153, column: 4, scope: !975)
!975 = distinct !DILexicalBlock(scope: !973, file: !1, line: 1153, column: 4)
!976 = !DILocalVariable(name: "e_ls_base", scope: !977, file: !1, line: 1154, type: !658)
!977 = distinct !DILexicalBlock(scope: !975, file: !1, line: 1153, column: 39)
!978 = !DILocation(line: 1154, column: 22, scope: !977)
!979 = !DILocation(line: 1154, column: 34, scope: !977)
!980 = !DILocalVariable(name: "node_prev_p", scope: !977, file: !1, line: 1155, type: !981)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!982 = !DILocation(line: 1155, column: 16, scope: !977)
!983 = !DILocalVariable(name: "i", scope: !977, file: !1, line: 1156, type: !5)
!984 = !DILocation(line: 1156, column: 18, scope: !977)
!985 = !DILocation(line: 1158, column: 20, scope: !977)
!986 = !DILocation(line: 1158, column: 31, scope: !977)
!987 = !DILocation(line: 1158, column: 17, scope: !977)
!988 = !DILocation(line: 1159, column: 12, scope: !989)
!989 = distinct !DILexicalBlock(scope: !977, file: !1, line: 1159, column: 5)
!990 = !DILocation(line: 1159, column: 24, scope: !989)
!991 = !DILocation(line: 1159, column: 35, scope: !989)
!992 = !DILocation(line: 1159, column: 22, scope: !989)
!993 = !DILocation(line: 1159, column: 10, scope: !989)
!994 = !DILocation(line: 1159, column: 41, scope: !995)
!995 = distinct !DILexicalBlock(scope: !989, file: !1, line: 1159, column: 5)
!996 = !DILocation(line: 1159, column: 5, scope: !989)
!997 = !DILocalVariable(name: "e", scope: !998, file: !1, line: 1160, type: !95)
!998 = distinct !DILexicalBlock(scope: !995, file: !1, line: 1159, column: 71)
!999 = !DILocation(line: 1160, column: 14, scope: !998)
!1000 = !DILocation(line: 1160, column: 18, scope: !998)
!1001 = !DILocation(line: 1160, column: 24, scope: !998)
!1002 = !DILocation(line: 1161, column: 10, scope: !1003)
!1003 = distinct !DILexicalBlock(scope: !998, file: !1, line: 1161, column: 10)
!1004 = !DILocation(line: 1161, column: 10, scope: !998)
!1005 = !DILocation(line: 1163, column: 22, scope: !1006)
!1006 = distinct !DILexicalBlock(scope: !1003, file: !1, line: 1161, column: 45)
!1007 = !DILocation(line: 1163, column: 28, scope: !1006)
!1008 = !DILocation(line: 1163, column: 8, scope: !1006)
!1009 = !DILocation(line: 1163, column: 20, scope: !1006)
!1010 = !DILocation(line: 1164, column: 7, scope: !1006)
!1011 = !DILocation(line: 1164, column: 18, scope: !1006)
!1012 = !DILocation(line: 1164, column: 26, scope: !1006)
!1013 = !DILocation(line: 1165, column: 6, scope: !1006)
!1014 = !DILocation(line: 1167, column: 22, scope: !1015)
!1015 = distinct !DILexicalBlock(scope: !1003, file: !1, line: 1166, column: 11)
!1016 = !DILocation(line: 1167, column: 28, scope: !1015)
!1017 = !DILocation(line: 1167, column: 19, scope: !1015)
!1018 = !DILocation(line: 1169, column: 5, scope: !998)
!1019 = !DILocation(line: 1159, column: 48, scope: !995)
!1020 = !DILocation(line: 1159, column: 59, scope: !995)
!1021 = !DILocation(line: 1159, column: 65, scope: !995)
!1022 = !DILocation(line: 1159, column: 57, scope: !995)
!1023 = !DILocation(line: 1159, column: 5, scope: !995)
!1024 = distinct !{!1024, !996, !1025}
!1025 = !DILocation(line: 1169, column: 5, scope: !989)
!1026 = !DILocation(line: 1170, column: 4, scope: !977)
!1027 = distinct !{!1027, !972, !1028}
!1028 = !DILocation(line: 1170, column: 4, scope: !973)
!1029 = !DILocalVariable(name: "eiter", scope: !1030, file: !1, line: 1174, type: !1031)
!1030 = distinct !DILexicalBlock(scope: !781, file: !1, line: 1173, column: 3)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter", file: !59, line: 186, baseType: !1032)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter", file: !59, line: 164, size: 512, elements: !1033)
!1033 = !{!1034, !1114, !1115, !1116, !1117}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1032, file: !59, line: 179, baseType: !1035, size: 320)
!1035 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1032, file: !59, line: 166, size: 320, elements: !1036)
!1036 = !{!1037, !1052, !1058, !1066, !1074, !1080, !1086, !1092, !1096, !1102, !1108}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "elem_of_mesh", scope: !1035, file: !59, line: 167, baseType: !1038, size: 192)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__elem_of_mesh", file: !59, line: 113, size: 192, elements: !1039)
!1039 = !{!1040}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "pooliter", scope: !1038, file: !59, line: 114, baseType: !1041, size: 192)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool_iter", file: !1042, line: 80, baseType: !1043)
!1042 = !DIFile(filename: "blender/source/blender/blenlib/BLI_mempool.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_iter", file: !1042, line: 76, size: 192, elements: !1044)
!1044 = !{!1045, !1048, !1051}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1043, file: !1042, line: 77, baseType: !1046, size: 64)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool", file: !1042, line: 47, baseType: !217)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "curchunk", scope: !1043, file: !1042, line: 78, baseType: !1049, size: 64, offset: 64)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_chunk", file: !1042, line: 45, flags: DIFlagFwdDecl)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "curindex", scope: !1043, file: !1042, line: 79, baseType: !5, size: 32, offset: 128)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_vert", scope: !1035, file: !59, line: 169, baseType: !1053, size: 192)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_vert", file: !59, line: 116, size: 192, elements: !1054)
!1054 = !{!1055, !1056, !1057}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !1053, file: !59, line: 117, baseType: !160, size: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !1053, file: !59, line: 118, baseType: !95, size: 64, offset: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !1053, file: !59, line: 118, baseType: !95, size: 64, offset: 128)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_vert", scope: !1035, file: !59, line: 170, baseType: !1059, size: 320)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_vert", file: !59, line: 120, size: 320, elements: !1060)
!1060 = !{!1061, !1062, !1063, !1064, !1065}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !1059, file: !59, line: 121, baseType: !160, size: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !1059, file: !59, line: 122, baseType: !144, size: 64, offset: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !1059, file: !59, line: 122, baseType: !144, size: 64, offset: 128)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !1059, file: !59, line: 123, baseType: !95, size: 64, offset: 192)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !1059, file: !59, line: 123, baseType: !95, size: 64, offset: 256)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_vert", scope: !1035, file: !59, line: 171, baseType: !1067, size: 320)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_vert", file: !59, line: 125, size: 320, elements: !1068)
!1068 = !{!1069, !1070, !1071, !1072, !1073}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !1067, file: !59, line: 126, baseType: !160, size: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !1067, file: !59, line: 127, baseType: !144, size: 64, offset: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !1067, file: !59, line: 127, baseType: !144, size: 64, offset: 128)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !1067, file: !59, line: 128, baseType: !95, size: 64, offset: 192)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !1067, file: !59, line: 128, baseType: !95, size: 64, offset: 256)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_edge", scope: !1035, file: !59, line: 172, baseType: !1075, size: 192)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_edge", file: !59, line: 130, size: 192, elements: !1076)
!1076 = !{!1077, !1078, !1079}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !1075, file: !59, line: 131, baseType: !95, size: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !1075, file: !59, line: 132, baseType: !144, size: 64, offset: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !1075, file: !59, line: 132, baseType: !144, size: 64, offset: 128)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_loop", scope: !1035, file: !59, line: 173, baseType: !1081, size: 192)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_loop", file: !59, line: 134, size: 192, elements: !1082)
!1082 = !{!1083, !1084, !1085}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !1081, file: !59, line: 135, baseType: !144, size: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !1081, file: !59, line: 136, baseType: !144, size: 64, offset: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !1081, file: !59, line: 136, baseType: !144, size: 64, offset: 128)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_edge", scope: !1035, file: !59, line: 174, baseType: !1087, size: 192)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_edge", file: !59, line: 138, size: 192, elements: !1088)
!1088 = !{!1089, !1090, !1091}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !1087, file: !59, line: 139, baseType: !95, size: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !1087, file: !59, line: 140, baseType: !144, size: 64, offset: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !1087, file: !59, line: 140, baseType: !144, size: 64, offset: 128)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_edge", scope: !1035, file: !59, line: 175, baseType: !1093, size: 64)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_edge", file: !59, line: 142, size: 64, elements: !1094)
!1094 = !{!1095}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !1093, file: !59, line: 143, baseType: !95, size: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_face", scope: !1035, file: !59, line: 176, baseType: !1097, size: 192)
!1097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_face", file: !59, line: 145, size: 192, elements: !1098)
!1098 = !{!1099, !1100, !1101}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !1097, file: !59, line: 146, baseType: !180, size: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !1097, file: !59, line: 147, baseType: !144, size: 64, offset: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !1097, file: !59, line: 147, baseType: !144, size: 64, offset: 128)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_face", scope: !1035, file: !59, line: 177, baseType: !1103, size: 192)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_face", file: !59, line: 149, size: 192, elements: !1104)
!1104 = !{!1105, !1106, !1107}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !1103, file: !59, line: 150, baseType: !180, size: 64)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !1103, file: !59, line: 151, baseType: !144, size: 64, offset: 64)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !1103, file: !59, line: 151, baseType: !144, size: 64, offset: 128)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_face", scope: !1035, file: !59, line: 178, baseType: !1109, size: 192)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_face", file: !59, line: 153, size: 192, elements: !1110)
!1110 = !{!1111, !1112, !1113}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !1109, file: !59, line: 154, baseType: !180, size: 64)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !1109, file: !59, line: 155, baseType: !144, size: 64, offset: 64)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !1109, file: !59, line: 155, baseType: !144, size: 64, offset: 128)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !1032, file: !59, line: 181, baseType: !172, size: 64, offset: 320)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !1032, file: !59, line: 182, baseType: !176, size: 64, offset: 384)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1032, file: !59, line: 184, baseType: !76, size: 32, offset: 448)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !1032, file: !59, line: 185, baseType: !107, size: 8, offset: 480)
!1118 = !DILocation(line: 1174, column: 11, scope: !1030)
!1119 = !DILocalVariable(name: "e", scope: !1030, file: !1, line: 1175, type: !95)
!1120 = !DILocation(line: 1175, column: 12, scope: !1030)
!1121 = !DILocalVariable(name: "e_next", scope: !1030, file: !1, line: 1175, type: !95)
!1122 = !DILocation(line: 1175, column: 16, scope: !1030)
!1123 = !DILocation(line: 1177, column: 4, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !1030, file: !1, line: 1177, column: 4)
!1125 = !DILocation(line: 1177, column: 4, scope: !1126)
!1126 = distinct !DILexicalBlock(scope: !1124, file: !1, line: 1177, column: 4)
!1127 = !DILocation(line: 1178, column: 9, scope: !1128)
!1128 = distinct !DILexicalBlock(scope: !1129, file: !1, line: 1178, column: 9)
!1129 = distinct !DILexicalBlock(scope: !1126, file: !1, line: 1177, column: 67)
!1130 = !DILocation(line: 1178, column: 9, scope: !1129)
!1131 = !DILocation(line: 1183, column: 10, scope: !1132)
!1132 = distinct !DILexicalBlock(scope: !1133, file: !1, line: 1183, column: 10)
!1133 = distinct !DILexicalBlock(scope: !1128, file: !1, line: 1178, column: 44)
!1134 = !DILocation(line: 1183, column: 13, scope: !1132)
!1135 = !DILocation(line: 1183, column: 10, scope: !1133)
!1136 = !DILocalVariable(name: "l_iter", scope: !1137, file: !1, line: 1184, type: !144)
!1137 = distinct !DILexicalBlock(scope: !1132, file: !1, line: 1183, column: 16)
!1138 = !DILocation(line: 1184, column: 15, scope: !1137)
!1139 = !DILocation(line: 1184, column: 24, scope: !1137)
!1140 = !DILocation(line: 1184, column: 27, scope: !1137)
!1141 = !DILocalVariable(name: "faces", scope: !1137, file: !1, line: 1185, type: !227)
!1142 = !DILocation(line: 1185, column: 16, scope: !1137)
!1143 = !DILocation(line: 1187, column: 15, scope: !1137)
!1144 = !DILocation(line: 1187, column: 19, scope: !1137)
!1145 = !DILocation(line: 1187, column: 13, scope: !1137)
!1146 = !DILocation(line: 1189, column: 7, scope: !1137)
!1147 = !DILocalVariable(name: "f_index", scope: !1148, file: !1, line: 1190, type: !343)
!1148 = distinct !DILexicalBlock(scope: !1137, file: !1, line: 1189, column: 10)
!1149 = !DILocation(line: 1190, column: 18, scope: !1148)
!1150 = !DILocation(line: 1190, column: 28, scope: !1148)
!1151 = !DILocation(line: 1191, column: 12, scope: !1152)
!1152 = distinct !DILexicalBlock(scope: !1148, file: !1, line: 1191, column: 12)
!1153 = !DILocation(line: 1191, column: 20, scope: !1152)
!1154 = !DILocation(line: 1191, column: 12, scope: !1148)
!1155 = !DILocation(line: 1194, column: 9, scope: !1156)
!1156 = distinct !DILexicalBlock(scope: !1152, file: !1, line: 1191, column: 26)
!1157 = !DILocation(line: 1194, column: 15, scope: !1156)
!1158 = !DILocation(line: 1194, column: 24, scope: !1156)
!1159 = !DILocation(line: 1195, column: 8, scope: !1156)
!1160 = !DILocation(line: 1196, column: 7, scope: !1148)
!1161 = !DILocation(line: 1196, column: 26, scope: !1137)
!1162 = !DILocation(line: 1196, column: 34, scope: !1137)
!1163 = !DILocation(line: 1196, column: 24, scope: !1137)
!1164 = !DILocation(line: 1196, column: 50, scope: !1137)
!1165 = !DILocation(line: 1196, column: 53, scope: !1137)
!1166 = !DILocation(line: 1196, column: 47, scope: !1137)
!1167 = distinct !{!1167, !1146, !1168}
!1168 = !DILocation(line: 1196, column: 54, scope: !1137)
!1169 = !DILocation(line: 1197, column: 6, scope: !1137)
!1170 = !DILocation(line: 1199, column: 24, scope: !1133)
!1171 = !DILocation(line: 1199, column: 36, scope: !1133)
!1172 = !DILocation(line: 1199, column: 6, scope: !1133)
!1173 = !DILocation(line: 1200, column: 19, scope: !1133)
!1174 = !DILocation(line: 1200, column: 23, scope: !1133)
!1175 = !DILocation(line: 1200, column: 6, scope: !1133)
!1176 = !DILocation(line: 1201, column: 5, scope: !1133)
!1177 = !DILocation(line: 1202, column: 4, scope: !1129)
!1178 = distinct !{!1178, !1123, !1179}
!1179 = !DILocation(line: 1202, column: 4, scope: !1124)
!1180 = !DILocalVariable(name: "verts_invalid", scope: !1181, file: !1, line: 1207, type: !374)
!1181 = distinct !DILexicalBlock(scope: !781, file: !1, line: 1206, column: 3)
!1182 = !DILocation(line: 1207, column: 10, scope: !1181)
!1183 = !DILocation(line: 1207, column: 26, scope: !1181)
!1184 = !DILocation(line: 1209, column: 18, scope: !1185)
!1185 = distinct !DILexicalBlock(scope: !1181, file: !1, line: 1209, column: 4)
!1186 = !DILocation(line: 1209, column: 14, scope: !1185)
!1187 = !DILocation(line: 1209, column: 9, scope: !1185)
!1188 = !DILocation(line: 1209, column: 33, scope: !1189)
!1189 = distinct !DILexicalBlock(scope: !1185, file: !1, line: 1209, column: 4)
!1190 = !DILocation(line: 1209, column: 4, scope: !1185)
!1191 = !DILocalVariable(name: "v", scope: !1192, file: !1, line: 1211, type: !160)
!1192 = distinct !DILexicalBlock(scope: !1189, file: !1, line: 1209, column: 58)
!1193 = !DILocation(line: 1211, column: 13, scope: !1192)
!1194 = !DILocation(line: 1211, column: 17, scope: !1192)
!1195 = !DILocation(line: 1211, column: 23, scope: !1192)
!1196 = !DILocation(line: 1212, column: 9, scope: !1197)
!1197 = distinct !DILexicalBlock(scope: !1192, file: !1, line: 1212, column: 9)
!1198 = !DILocation(line: 1212, column: 9, scope: !1192)
!1199 = !DILocation(line: 1213, column: 11, scope: !1200)
!1200 = distinct !DILexicalBlock(scope: !1201, file: !1, line: 1213, column: 10)
!1201 = distinct !DILexicalBlock(scope: !1197, file: !1, line: 1212, column: 44)
!1202 = !DILocation(line: 1213, column: 14, scope: !1200)
!1203 = !DILocation(line: 1213, column: 10, scope: !1201)
!1204 = !DILocation(line: 1214, column: 20, scope: !1205)
!1205 = distinct !DILexicalBlock(scope: !1200, file: !1, line: 1213, column: 17)
!1206 = !DILocation(line: 1214, column: 35, scope: !1205)
!1207 = !DILocation(line: 1214, column: 7, scope: !1205)
!1208 = !DILocation(line: 1215, column: 20, scope: !1205)
!1209 = !DILocation(line: 1215, column: 24, scope: !1205)
!1210 = !DILocation(line: 1215, column: 7, scope: !1205)
!1211 = !DILocation(line: 1216, column: 6, scope: !1205)
!1212 = !DILocation(line: 1217, column: 5, scope: !1201)
!1213 = !DILocation(line: 1218, column: 4, scope: !1192)
!1214 = !DILocation(line: 1209, column: 46, scope: !1189)
!1215 = !DILocation(line: 1209, column: 52, scope: !1189)
!1216 = !DILocation(line: 1209, column: 44, scope: !1189)
!1217 = !DILocation(line: 1209, column: 4, scope: !1189)
!1218 = distinct !{!1218, !1190, !1219}
!1219 = !DILocation(line: 1218, column: 4, scope: !1185)
!1220 = !DILocalVariable(name: "i", scope: !1221, file: !1, line: 1221, type: !5)
!1221 = distinct !DILexicalBlock(scope: !1181, file: !1, line: 1220, column: 4)
!1222 = !DILocation(line: 1221, column: 18, scope: !1221)
!1223 = !DILocation(line: 1222, column: 12, scope: !1224)
!1224 = distinct !DILexicalBlock(scope: !1221, file: !1, line: 1222, column: 5)
!1225 = !DILocation(line: 1222, column: 10, scope: !1224)
!1226 = !DILocation(line: 1222, column: 17, scope: !1227)
!1227 = distinct !DILexicalBlock(scope: !1224, file: !1, line: 1222, column: 5)
!1228 = !DILocation(line: 1222, column: 21, scope: !1227)
!1229 = !DILocation(line: 1222, column: 19, scope: !1227)
!1230 = !DILocation(line: 1222, column: 5, scope: !1224)
!1231 = !DILocation(line: 1223, column: 27, scope: !1232)
!1232 = distinct !DILexicalBlock(scope: !1233, file: !1, line: 1223, column: 10)
!1233 = distinct !DILexicalBlock(scope: !1227, file: !1, line: 1222, column: 49)
!1234 = !DILocation(line: 1223, column: 42, scope: !1232)
!1235 = !DILocation(line: 1223, column: 52, scope: !1232)
!1236 = !DILocation(line: 1223, column: 11, scope: !1232)
!1237 = !DILocation(line: 1223, column: 59, scope: !1232)
!1238 = !DILocation(line: 1224, column: 27, scope: !1232)
!1239 = !DILocation(line: 1224, column: 42, scope: !1232)
!1240 = !DILocation(line: 1224, column: 52, scope: !1232)
!1241 = !DILocation(line: 1224, column: 11, scope: !1232)
!1242 = !DILocation(line: 1223, column: 10, scope: !1233)
!1243 = !DILocation(line: 1226, column: 27, scope: !1244)
!1244 = distinct !DILexicalBlock(scope: !1245, file: !1, line: 1226, column: 11)
!1245 = distinct !DILexicalBlock(scope: !1232, file: !1, line: 1225, column: 6)
!1246 = !DILocation(line: 1226, column: 12, scope: !1244)
!1247 = !DILocation(line: 1226, column: 50, scope: !1244)
!1248 = !DILocation(line: 1227, column: 40, scope: !1244)
!1249 = !DILocation(line: 1227, column: 12, scope: !1244)
!1250 = !DILocation(line: 1226, column: 11, scope: !1245)
!1251 = !DILocation(line: 1229, column: 23, scope: !1252)
!1252 = distinct !DILexicalBlock(scope: !1244, file: !1, line: 1228, column: 7)
!1253 = !DILocation(line: 1229, column: 27, scope: !1252)
!1254 = !DILocation(line: 1229, column: 8, scope: !1252)
!1255 = !DILocation(line: 1230, column: 7, scope: !1252)
!1256 = !DILocation(line: 1231, column: 6, scope: !1245)
!1257 = !DILocation(line: 1232, column: 5, scope: !1233)
!1258 = !DILocation(line: 1222, column: 45, scope: !1227)
!1259 = !DILocation(line: 1222, column: 5, scope: !1227)
!1260 = distinct !{!1260, !1230, !1261}
!1261 = !DILocation(line: 1232, column: 5, scope: !1224)
!1262 = !DILocation(line: 1235, column: 18, scope: !1181)
!1263 = !DILocation(line: 1235, column: 4, scope: !1181)
!1264 = !DILocation(line: 1238, column: 3, scope: !781)
!1265 = !DILocation(line: 1238, column: 13, scope: !781)
!1266 = !DILocalVariable(name: "gh_iter", scope: !1267, file: !1, line: 1246, type: !183)
!1267 = distinct !DILexicalBlock(scope: !198, file: !1, line: 1245, column: 2)
!1268 = !DILocation(line: 1246, column: 17, scope: !1267)
!1269 = !DILocalVariable(name: "faces", scope: !1267, file: !1, line: 1247, type: !227)
!1270 = !DILocation(line: 1247, column: 12, scope: !1267)
!1271 = !DILocation(line: 1249, column: 11, scope: !1267)
!1272 = !DILocation(line: 1249, column: 15, scope: !1267)
!1273 = !DILocation(line: 1249, column: 9, scope: !1267)
!1274 = !DILocation(line: 1251, column: 3, scope: !1275)
!1275 = distinct !DILexicalBlock(scope: !1267, file: !1, line: 1251, column: 3)
!1276 = !DILocation(line: 1251, column: 3, scope: !1277)
!1277 = distinct !DILexicalBlock(scope: !1275, file: !1, line: 1251, column: 3)
!1278 = !DILocalVariable(name: "f_index", scope: !1279, file: !1, line: 1252, type: !343)
!1279 = distinct !DILexicalBlock(scope: !1277, file: !1, line: 1251, column: 38)
!1280 = !DILocation(line: 1252, column: 14, scope: !1279)
!1281 = !DILocation(line: 1252, column: 24, scope: !1279)
!1282 = !DILocalVariable(name: "f", scope: !1279, file: !1, line: 1253, type: !180)
!1283 = !DILocation(line: 1253, column: 12, scope: !1279)
!1284 = !DILocalVariable(name: "e_ls_base", scope: !1279, file: !1, line: 1254, type: !658)
!1285 = !DILocation(line: 1254, column: 21, scope: !1279)
!1286 = !DILocation(line: 1254, column: 33, scope: !1279)
!1287 = !DILocation(line: 1258, column: 8, scope: !1279)
!1288 = !DILocation(line: 1258, column: 14, scope: !1279)
!1289 = !DILocation(line: 1258, column: 6, scope: !1279)
!1290 = !DILocation(line: 1259, column: 8, scope: !1291)
!1291 = distinct !DILexicalBlock(scope: !1279, file: !1, line: 1259, column: 8)
!1292 = !DILocation(line: 1259, column: 8, scope: !1279)
!1293 = !DILocation(line: 1260, column: 5, scope: !1294)
!1294 = distinct !DILexicalBlock(scope: !1291, file: !1, line: 1259, column: 29)
!1295 = !DILocation(line: 1265, column: 21, scope: !1279)
!1296 = !DILocation(line: 1265, column: 25, scope: !1279)
!1297 = !DILocation(line: 1265, column: 28, scope: !1279)
!1298 = !DILocation(line: 1265, column: 4, scope: !1279)
!1299 = !DILocation(line: 1266, column: 3, scope: !1279)
!1300 = distinct !{!1300, !1274, !1301}
!1301 = !DILocation(line: 1266, column: 3, scope: !1275)
!1302 = !DILocation(line: 1274, column: 6, scope: !1303)
!1303 = distinct !DILexicalBlock(scope: !198, file: !1, line: 1274, column: 6)
!1304 = !DILocation(line: 1274, column: 6, scope: !198)
!1305 = !DILocalVariable(name: "gs_iter", scope: !1306, file: !1, line: 1275, type: !1307)
!1306 = distinct !DILexicalBlock(scope: !1303, file: !1, line: 1274, column: 20)
!1307 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSetIterator", file: !86, line: 189, baseType: !1308)
!1308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GSetIterator", file: !86, line: 183, size: 192, elements: !1309)
!1309 = !{!1310}
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "_ghi", scope: !1308, file: !86, line: 184, baseType: !183, size: 192)
!1311 = !DILocation(line: 1275, column: 16, scope: !1306)
!1312 = !DILocation(line: 1277, column: 34, scope: !1306)
!1313 = !DILocation(line: 1277, column: 3, scope: !1306)
!1314 = !DILocation(line: 1279, column: 3, scope: !1315)
!1315 = distinct !DILexicalBlock(scope: !1306, file: !1, line: 1279, column: 3)
!1316 = !DILocation(line: 1279, column: 3, scope: !1317)
!1317 = distinct !DILexicalBlock(scope: !1315, file: !1, line: 1279, column: 3)
!1318 = !DILocalVariable(name: "e", scope: !1319, file: !1, line: 1280, type: !95)
!1319 = distinct !DILexicalBlock(scope: !1317, file: !1, line: 1279, column: 37)
!1320 = !DILocation(line: 1280, column: 12, scope: !1319)
!1321 = !DILocation(line: 1280, column: 16, scope: !1319)
!1322 = !DILocation(line: 1281, column: 4, scope: !1319)
!1323 = !DILocation(line: 1282, column: 3, scope: !1319)
!1324 = distinct !{!1324, !1314, !1325}
!1325 = !DILocation(line: 1282, column: 3, scope: !1315)
!1326 = !DILocation(line: 1284, column: 21, scope: !1306)
!1327 = !DILocation(line: 1284, column: 3, scope: !1306)
!1328 = !DILocation(line: 1285, column: 2, scope: !1306)
!1329 = !DILocation(line: 1290, column: 32, scope: !198)
!1330 = !DILocation(line: 1290, column: 15, scope: !198)
!1331 = !DILocation(line: 1290, column: 44, scope: !198)
!1332 = !DILocation(line: 1290, column: 14, scope: !198)
!1333 = !DILocation(line: 1290, column: 12, scope: !198)
!1334 = !DILocation(line: 1293, column: 19, scope: !198)
!1335 = !DILocation(line: 1293, column: 2, scope: !198)
!1336 = !DILocation(line: 1295, column: 19, scope: !198)
!1337 = !DILocation(line: 1295, column: 2, scope: !198)
