; ModuleID = 'blender/source/blender/bmesh/tools/bmesh_triangulate.c'
source_filename = "blender/source/blender/bmesh/tools/bmesh_triangulate.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BMesh = type { i32, i32, i32, i32, i32, i32, i32, i8, i8, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BMVert**, %struct.BMEdge**, %struct.BMFace**, i32, i32, i32, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, i32, %struct.BMOperator*, %struct.CustomData, %struct.CustomData, %struct.CustomData, %struct.CustomData, i16, i32, i32, i32, %struct.ListBase, %struct.BMFace*, %struct.ListBase, i8* }
%struct.BMVert = type { %struct.BMHeader, %struct.BMFlagLayer*, [3 x float], [3 x float], %struct.BMEdge* }
%struct.BMHeader = type { i8*, i32, i8, i8, i8 }
%struct.BMFlagLayer = type { i16 }
%struct.BMEdge = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMVert*, %struct.BMVert*, %struct.BMLoop*, %struct.BMDiskLink, %struct.BMDiskLink }
%struct.BMLoop = type { %struct.BMHeader, %struct.BMVert*, %struct.BMEdge*, %struct.BMFace*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop* }
%struct.BMDiskLink = type { %struct.BMEdge*, %struct.BMEdge* }
%struct.BLI_mempool = type opaque
%struct.CustomData = type { %struct.CustomDataLayer*, [41 x i32], i32, i32, i32, %struct.BLI_mempool*, %struct.CustomDataExternal* }

!17 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_VERT", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_EDGE", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_FACE", value: 8, isUnsigned: true)
!20 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_IS_SINGLE", value: 16, isUnsigned: true)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Ptr", file: !4, line: 131, baseType: !5, size: 32, elements: !22)
!22 = !{!23, !24, !25, !26}
!23 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_BMESH", value: 100, isUnsigned: true)
!24 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_SCENE", value: 101, isUnsigned: true)
!25 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_OBJECT", value: 102, isUnsigned: true)
!26 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_MESH", value: 103, isUnsigned: true)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Map", file: !4, line: 123, baseType: !5, size: 32, elements: !28)
!28 = !{!29, !30, !31, !32, !33, !34}
!29 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_EMPTY", value: 64, isUnsigned: true)
!30 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_ELEM", value: 65, isUnsigned: true)
!31 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_FLT", value: 66, isUnsigned: true)
!32 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INT", value: 67, isUnsigned: true)
!33 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_BOOL", value: 68, isUnsigned: true)
!34 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INTERNAL", value: 69, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 182, baseType: !5, size: 32, elements: !36)
!36 = !{!37, !38, !39, !40, !41}
!37 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NOP", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_UNTAN_MULTIRES", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NORMALS_CALC", value: 2, isUnsigned: true)
!40 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_FLUSH", value: 4, isUnsigned: true)
!41 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BMIterType", file: !43, line: 57, baseType: !5, size: 32, elements: !44)
!43 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!44 = !{!45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58}
!45 = !DIEnumerator(name: "BM_VERTS_OF_MESH", value: 1, isUnsigned: true)
!46 = !DIEnumerator(name: "BM_EDGES_OF_MESH", value: 2, isUnsigned: true)
!47 = !DIEnumerator(name: "BM_FACES_OF_MESH", value: 3, isUnsigned: true)
!48 = !DIEnumerator(name: "BM_EDGES_OF_VERT", value: 4, isUnsigned: true)
!49 = !DIEnumerator(name: "BM_FACES_OF_VERT", value: 5, isUnsigned: true)
!50 = !DIEnumerator(name: "BM_LOOPS_OF_VERT", value: 6, isUnsigned: true)
!51 = !DIEnumerator(name: "BM_VERTS_OF_EDGE", value: 7, isUnsigned: true)
!52 = !DIEnumerator(name: "BM_FACES_OF_EDGE", value: 8, isUnsigned: true)
!53 = !DIEnumerator(name: "BM_VERTS_OF_FACE", value: 9, isUnsigned: true)
!54 = !DIEnumerator(name: "BM_EDGES_OF_FACE", value: 10, isUnsigned: true)
!55 = !DIEnumerator(name: "BM_LOOPS_OF_FACE", value: 11, isUnsigned: true)
!56 = !DIEnumerator(name: "BM_ALL_LOOPS_OF_FACE", value: 12, isUnsigned: true)
!57 = !DIEnumerator(name: "BM_LOOPS_OF_LOOP", value: 13, isUnsigned: true)
!58 = !DIEnumerator(name: "BM_LOOPS_OF_EDGE", value: 14, isUnsigned: true)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !60, line: 260, baseType: !5, size: 32, elements: !61)
!60 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!61 = !{!62, !63, !64, !65, !66, !67, !68}
!62 = !DIEnumerator(name: "BM_ELEM_SELECT", value: 1, isUnsigned: true)
!63 = !DIEnumerator(name: "BM_ELEM_HIDDEN", value: 2, isUnsigned: true)
!64 = !DIEnumerator(name: "BM_ELEM_SEAM", value: 4, isUnsigned: true)
!65 = !DIEnumerator(name: "BM_ELEM_SMOOTH", value: 8, isUnsigned: true)
!66 = !DIEnumerator(name: "BM_ELEM_TAG", value: 16, isUnsigned: true)
!67 = !DIEnumerator(name: "BM_ELEM_DRAW", value: 32, isUnsigned: true)
!68 = !DIEnumerator(name: "BM_ELEM_INTERNAL_TAG", value: 128, isUnsigned: true)
!69 = !{!70, !71, !72, !76, !80, !146, !148, !130}
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !43, line: 79, baseType: !42)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !43, line: 158, baseType: !73)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DISubroutineType(types: !75)
!75 = !{null, !70}
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !43, line: 159, baseType: !77)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{!70, !70}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !60, line: 103, baseType: !82)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !60, line: 90, size: 448, elements: !83)
!83 = !{!84, !95, !101, !106, !107}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !82, file: !60, line: 91, baseType: !85, size: 128)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !60, line: 82, baseType: !86)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !60, line: 64, size: 128, elements: !87)
!87 = !{!88, !89, !91, !93, !94}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !86, file: !60, line: 65, baseType: !70, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !86, file: !60, line: 66, baseType: !90, size: 32, offset: 64)
!90 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !86, file: !60, line: 73, baseType: !92, size: 8, offset: 96)
!92 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !86, file: !60, line: 74, baseType: !92, size: 8, offset: 104)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !86, file: !60, line: 80, baseType: !92, size: 8, offset: 112)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !82, file: !60, line: 92, baseType: !96, size: 64, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !60, line: 180, size: 16, elements: !98)
!98 = !{!99}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !97, file: !60, line: 181, baseType: !100, size: 16)
!100 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !82, file: !60, line: 94, baseType: !102, size: 96, offset: 192)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 96, elements: !104)
!103 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!104 = !{!105}
!105 = !DISubrange(count: 3)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !82, file: !60, line: 95, baseType: !102, size: 96, offset: 288)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !82, file: !60, line: 102, baseType: !108, size: 64, offset: 384)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !60, line: 110, size: 640, elements: !110)
!110 = !{!111, !112, !113, !115, !116, !139, !145}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !109, file: !60, line: 111, baseType: !85, size: 128)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !109, file: !60, line: 112, baseType: !96, size: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !109, file: !60, line: 114, baseType: !114, size: 64, offset: 192)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !109, file: !60, line: 114, baseType: !114, size: 64, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !109, file: !60, line: 118, baseType: !117, size: 64, offset: 320)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !60, line: 125, size: 576, elements: !119)
!119 = !{!120, !121, !122, !123, !135, !136, !137, !138}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !118, file: !60, line: 126, baseType: !85, size: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !118, file: !60, line: 129, baseType: !114, size: 64, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !118, file: !60, line: 130, baseType: !108, size: 64, offset: 192)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !118, file: !60, line: 131, baseType: !124, size: 64, offset: 256)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !60, line: 164, size: 448, elements: !126)
!126 = !{!127, !128, !129, !132, !133, !134}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !125, file: !60, line: 165, baseType: !85, size: 128)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !125, file: !60, line: 166, baseType: !96, size: 64, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !125, file: !60, line: 172, baseType: !130, size: 64, offset: 192)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !60, line: 140, baseType: !118)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !125, file: !60, line: 174, baseType: !90, size: 32, offset: 256)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !125, file: !60, line: 175, baseType: !102, size: 96, offset: 288)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !125, file: !60, line: 176, baseType: !100, size: 16, offset: 384)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !118, file: !60, line: 135, baseType: !117, size: 64, offset: 320)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !118, file: !60, line: 135, baseType: !117, size: 64, offset: 384)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !118, file: !60, line: 139, baseType: !117, size: 64, offset: 448)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !118, file: !60, line: 139, baseType: !117, size: 64, offset: 512)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !109, file: !60, line: 122, baseType: !140, size: 128, offset: 384)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !60, line: 108, baseType: !141)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !60, line: 106, size: 128, elements: !142)
!142 = !{!143, !144}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !141, file: !60, line: 107, baseType: !108, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !141, file: !60, line: 107, baseType: !108, size: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !109, file: !60, line: 122, baseType: !140, size: 128, offset: 512)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !60, line: 123, baseType: !109)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !60, line: 178, baseType: !125)
!150 = !{i32 7, !"Dwarf Version", i32 4}
!151 = !{i32 2, !"Debug Info Version", i32 3}
!152 = !{i32 1, !"wchar_size", i32 4}
!153 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!154 = distinct !DISubprogram(name: "BM_mesh_triangulate", scope: !1, file: !1, line: 66, type: !155, scopeLine: 68, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !306)
!155 = !DISubroutineType(types: !156)
!156 = !{null, !157, !299, !299, !300, !302, !304}
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !60, line: 246, baseType: !159)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !60, line: 186, size: 8064, elements: !160)
!160 = !{!161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !174, !175, !176, !177, !179, !181, !183, !184, !185, !186, !187, !188, !189, !190, !243, !282, !283, !284, !285, !286, !287, !288, !289, !296, !297, !298}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !159, file: !60, line: 187, baseType: !90, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !159, file: !60, line: 187, baseType: !90, size: 32, offset: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !159, file: !60, line: 187, baseType: !90, size: 32, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !159, file: !60, line: 187, baseType: !90, size: 32, offset: 96)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !159, file: !60, line: 188, baseType: !90, size: 32, offset: 128)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !159, file: !60, line: 188, baseType: !90, size: 32, offset: 160)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !159, file: !60, line: 188, baseType: !90, size: 32, offset: 192)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !159, file: !60, line: 193, baseType: !92, size: 8, offset: 224)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !159, file: !60, line: 197, baseType: !92, size: 8, offset: 232)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !159, file: !60, line: 201, baseType: !171, size: 64, offset: 256)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !173, line: 71, flags: DIFlagFwdDecl)
!173 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!174 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !159, file: !60, line: 201, baseType: !171, size: 64, offset: 320)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !159, file: !60, line: 201, baseType: !171, size: 64, offset: 384)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !159, file: !60, line: 201, baseType: !171, size: 64, offset: 448)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !159, file: !60, line: 208, baseType: !178, size: 64, offset: 512)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !159, file: !60, line: 209, baseType: !180, size: 64, offset: 576)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !159, file: !60, line: 210, baseType: !182, size: 64, offset: 640)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !159, file: !60, line: 213, baseType: !90, size: 32, offset: 704)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !159, file: !60, line: 214, baseType: !90, size: 32, offset: 736)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !159, file: !60, line: 215, baseType: !90, size: 32, offset: 768)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !159, file: !60, line: 218, baseType: !171, size: 64, offset: 832)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !159, file: !60, line: 218, baseType: !171, size: 64, offset: 896)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !159, file: !60, line: 218, baseType: !171, size: 64, offset: 960)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !159, file: !60, line: 220, baseType: !90, size: 32, offset: 1024)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !159, file: !60, line: 221, baseType: !191, size: 64, offset: 1088)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !4, line: 190, size: 10496, elements: !193)
!193 = !{!194, !230, !231, !235, !239, !240, !242}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !192, file: !4, line: 191, baseType: !195, size: 5120)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 5120, elements: !228)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !4, line: 147, size: 320, elements: !197)
!197 = !{!198, !201, !203, !213, !214}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !196, file: !4, line: 148, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !92)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !196, file: !4, line: 149, baseType: !202, size: 32, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !4, line: 112, baseType: !3)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !196, file: !4, line: 150, baseType: !204, size: 32, offset: 96)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !4, line: 142, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !4, line: 138, size: 32, elements: !206)
!206 = !{!207, !209, !211}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !205, file: !4, line: 139, baseType: !208, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !4, line: 122, baseType: !15)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !205, file: !4, line: 140, baseType: !210, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !4, line: 136, baseType: !21)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !205, file: !4, line: 141, baseType: !212, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !4, line: 130, baseType: !27)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !196, file: !4, line: 152, baseType: !90, size: 32, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !196, file: !4, line: 162, baseType: !215, size: 128, offset: 192)
!215 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !196, file: !4, line: 155, size: 128, elements: !216)
!216 = !{!217, !218, !219, !220, !221, !223}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !215, file: !4, line: 156, baseType: !90, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !215, file: !4, line: 157, baseType: !103, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !215, file: !4, line: 158, baseType: !70, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !215, file: !4, line: 159, baseType: !102, size: 96)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !215, file: !4, line: 160, baseType: !222, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !215, file: !4, line: 161, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !226, line: 48, baseType: !227)
!226 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !226, line: 48, flags: DIFlagFwdDecl)
!228 = !{!229}
!229 = !DISubrange(count: 16)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !192, file: !4, line: 192, baseType: !195, size: 5120, offset: 5120)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !192, file: !4, line: 193, baseType: !232, size: 64, offset: 10240)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{null, !157, !191}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !192, file: !4, line: 194, baseType: !236, size: 64, offset: 10304)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !238, line: 52, flags: DIFlagFwdDecl)
!238 = !DIFile(filename: "blender/source/blender/blenlib/BLI_memarena.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!239 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !192, file: !4, line: 195, baseType: !90, size: 32, offset: 10368)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !192, file: !4, line: 196, baseType: !241, size: 32, offset: 10400)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !4, line: 188, baseType: !35)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !192, file: !4, line: 197, baseType: !90, size: 32, offset: 10432)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !159, file: !60, line: 223, baseType: !244, size: 1600, offset: 1152)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !173, line: 73, baseType: !245)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !173, line: 64, size: 1600, elements: !246)
!246 = !{!247, !265, !269, !270, !271, !272, !273}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !245, file: !173, line: 65, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !173, line: 53, baseType: !250)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !173, line: 42, size: 832, elements: !251)
!251 = !{!252, !253, !254, !255, !256, !257, !258, !259, !260, !264}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !250, file: !173, line: 43, baseType: !90, size: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !250, file: !173, line: 44, baseType: !90, size: 32, offset: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !250, file: !173, line: 45, baseType: !90, size: 32, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !250, file: !173, line: 46, baseType: !90, size: 32, offset: 96)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !250, file: !173, line: 47, baseType: !90, size: 32, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !250, file: !173, line: 48, baseType: !90, size: 32, offset: 160)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !250, file: !173, line: 49, baseType: !90, size: 32, offset: 192)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !250, file: !173, line: 50, baseType: !90, size: 32, offset: 224)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !250, file: !173, line: 51, baseType: !261, size: 512, offset: 256)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 512, elements: !262)
!262 = !{!263}
!263 = !DISubrange(count: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !250, file: !173, line: 52, baseType: !70, size: 64, offset: 768)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !245, file: !173, line: 66, baseType: !266, size: 1312, offset: 64)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 1312, elements: !267)
!267 = !{!268}
!268 = !DISubrange(count: 41)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !245, file: !173, line: 69, baseType: !90, size: 32, offset: 1376)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !245, file: !173, line: 69, baseType: !90, size: 32, offset: 1408)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !245, file: !173, line: 70, baseType: !90, size: 32, offset: 1440)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !245, file: !173, line: 71, baseType: !171, size: 64, offset: 1472)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !245, file: !173, line: 72, baseType: !274, size: 64, offset: 1536)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !173, line: 59, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !173, line: 57, size: 8192, elements: !277)
!277 = !{!278}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !276, file: !173, line: 58, baseType: !279, size: 8192)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 8192, elements: !280)
!280 = !{!281}
!281 = !DISubrange(count: 1024)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !159, file: !60, line: 223, baseType: !244, size: 1600, offset: 2752)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !159, file: !60, line: 223, baseType: !244, size: 1600, offset: 4352)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !159, file: !60, line: 223, baseType: !244, size: 1600, offset: 5952)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !159, file: !60, line: 233, baseType: !100, size: 16, offset: 7552)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !159, file: !60, line: 236, baseType: !90, size: 32, offset: 7584)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !159, file: !60, line: 238, baseType: !90, size: 32, offset: 7616)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !159, file: !60, line: 238, baseType: !90, size: 32, offset: 7648)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !159, file: !60, line: 239, baseType: !290, size: 128, offset: 7680)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !291, line: 71, baseType: !292)
!291 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !291, line: 69, size: 128, elements: !293)
!293 = !{!294, !295}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !292, file: !291, line: 70, baseType: !70, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !292, file: !291, line: 70, baseType: !70, size: 64, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !159, file: !60, line: 241, baseType: !148, size: 64, offset: 7808)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !159, file: !60, line: 243, baseType: !290, size: 128, offset: 7872)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !159, file: !60, line: 245, baseType: !70, size: 64, offset: 8000)
!299 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !90)
!300 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !301)
!301 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOperator", file: !4, line: 198, baseType: !192)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpSlot", file: !4, line: 163, baseType: !196)
!306 = !{}
!307 = !DILocalVariable(name: "bm", arg: 1, scope: !154, file: !1, line: 66, type: !157)
!308 = !DILocation(line: 66, column: 33, scope: !154)
!309 = !DILocalVariable(name: "quad_method", arg: 2, scope: !154, file: !1, line: 66, type: !299)
!310 = !DILocation(line: 66, column: 47, scope: !154)
!311 = !DILocalVariable(name: "ngon_method", arg: 3, scope: !154, file: !1, line: 66, type: !299)
!312 = !DILocation(line: 66, column: 70, scope: !154)
!313 = !DILocalVariable(name: "tag_only", arg: 4, scope: !154, file: !1, line: 66, type: !300)
!314 = !DILocation(line: 66, column: 94, scope: !154)
!315 = !DILocalVariable(name: "op", arg: 5, scope: !154, file: !1, line: 67, type: !302)
!316 = !DILocation(line: 67, column: 38, scope: !154)
!317 = !DILocalVariable(name: "slot_facemap_out", arg: 6, scope: !154, file: !1, line: 67, type: !304)
!318 = !DILocation(line: 67, column: 52, scope: !154)
!319 = !DILocalVariable(name: "iter", scope: !154, file: !1, line: 69, type: !320)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter", file: !43, line: 186, baseType: !321)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter", file: !43, line: 164, size: 512, elements: !322)
!322 = !{!323, !403, !404, !405, !406}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !321, file: !43, line: 179, baseType: !324, size: 320)
!324 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !321, file: !43, line: 166, size: 320, elements: !325)
!325 = !{!326, !341, !347, !355, !363, !369, !375, !381, !385, !391, !397}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "elem_of_mesh", scope: !324, file: !43, line: 167, baseType: !327, size: 192)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__elem_of_mesh", file: !43, line: 113, size: 192, elements: !328)
!328 = !{!329}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "pooliter", scope: !327, file: !43, line: 114, baseType: !330, size: 192)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool_iter", file: !331, line: 80, baseType: !332)
!331 = !DIFile(filename: "blender/source/blender/blenlib/BLI_mempool.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_iter", file: !331, line: 76, size: 192, elements: !333)
!333 = !{!334, !337, !340}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !332, file: !331, line: 77, baseType: !335, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool", file: !331, line: 47, baseType: !172)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "curchunk", scope: !332, file: !331, line: 78, baseType: !338, size: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_chunk", file: !331, line: 45, flags: DIFlagFwdDecl)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "curindex", scope: !332, file: !331, line: 79, baseType: !5, size: 32, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_vert", scope: !324, file: !43, line: 169, baseType: !342, size: 192)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_vert", file: !43, line: 116, size: 192, elements: !343)
!343 = !{!344, !345, !346}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !342, file: !43, line: 117, baseType: !80, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !342, file: !43, line: 118, baseType: !146, size: 64, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !342, file: !43, line: 118, baseType: !146, size: 64, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_vert", scope: !324, file: !43, line: 170, baseType: !348, size: 320)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_vert", file: !43, line: 120, size: 320, elements: !349)
!349 = !{!350, !351, !352, !353, !354}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !348, file: !43, line: 121, baseType: !80, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !348, file: !43, line: 122, baseType: !130, size: 64, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !348, file: !43, line: 122, baseType: !130, size: 64, offset: 128)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !348, file: !43, line: 123, baseType: !146, size: 64, offset: 192)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !348, file: !43, line: 123, baseType: !146, size: 64, offset: 256)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_vert", scope: !324, file: !43, line: 171, baseType: !356, size: 320)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_vert", file: !43, line: 125, size: 320, elements: !357)
!357 = !{!358, !359, !360, !361, !362}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !356, file: !43, line: 126, baseType: !80, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !356, file: !43, line: 127, baseType: !130, size: 64, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !356, file: !43, line: 127, baseType: !130, size: 64, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !356, file: !43, line: 128, baseType: !146, size: 64, offset: 192)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !356, file: !43, line: 128, baseType: !146, size: 64, offset: 256)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_edge", scope: !324, file: !43, line: 172, baseType: !364, size: 192)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_edge", file: !43, line: 130, size: 192, elements: !365)
!365 = !{!366, !367, !368}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !364, file: !43, line: 131, baseType: !146, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !364, file: !43, line: 132, baseType: !130, size: 64, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !364, file: !43, line: 132, baseType: !130, size: 64, offset: 128)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_loop", scope: !324, file: !43, line: 173, baseType: !370, size: 192)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_loop", file: !43, line: 134, size: 192, elements: !371)
!371 = !{!372, !373, !374}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !370, file: !43, line: 135, baseType: !130, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !370, file: !43, line: 136, baseType: !130, size: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !370, file: !43, line: 136, baseType: !130, size: 64, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_edge", scope: !324, file: !43, line: 174, baseType: !376, size: 192)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_edge", file: !43, line: 138, size: 192, elements: !377)
!377 = !{!378, !379, !380}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !376, file: !43, line: 139, baseType: !146, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !376, file: !43, line: 140, baseType: !130, size: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !376, file: !43, line: 140, baseType: !130, size: 64, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_edge", scope: !324, file: !43, line: 175, baseType: !382, size: 64)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_edge", file: !43, line: 142, size: 64, elements: !383)
!383 = !{!384}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !382, file: !43, line: 143, baseType: !146, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_face", scope: !324, file: !43, line: 176, baseType: !386, size: 192)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_face", file: !43, line: 145, size: 192, elements: !387)
!387 = !{!388, !389, !390}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !386, file: !43, line: 146, baseType: !148, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !386, file: !43, line: 147, baseType: !130, size: 64, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !386, file: !43, line: 147, baseType: !130, size: 64, offset: 128)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_face", scope: !324, file: !43, line: 177, baseType: !392, size: 192)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_face", file: !43, line: 149, size: 192, elements: !393)
!393 = !{!394, !395, !396}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !392, file: !43, line: 150, baseType: !148, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !392, file: !43, line: 151, baseType: !130, size: 64, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !392, file: !43, line: 151, baseType: !130, size: 64, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_face", scope: !324, file: !43, line: 178, baseType: !398, size: 192)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_face", file: !43, line: 153, size: 192, elements: !399)
!399 = !{!400, !401, !402}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !398, file: !43, line: 154, baseType: !148, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !398, file: !43, line: 155, baseType: !130, size: 64, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !398, file: !43, line: 155, baseType: !130, size: 64, offset: 128)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !321, file: !43, line: 181, baseType: !72, size: 64, offset: 320)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !321, file: !43, line: 182, baseType: !76, size: 64, offset: 384)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !321, file: !43, line: 184, baseType: !90, size: 32, offset: 448)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !321, file: !43, line: 185, baseType: !92, size: 8, offset: 480)
!407 = !DILocation(line: 69, column: 9, scope: !154)
!408 = !DILocalVariable(name: "face", scope: !154, file: !1, line: 70, type: !148)
!409 = !DILocation(line: 70, column: 10, scope: !154)
!410 = !DILocalVariable(name: "sf_arena", scope: !154, file: !1, line: 71, type: !411)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "MemArena", file: !238, line: 53, baseType: !237)
!413 = !DILocation(line: 71, column: 12, scope: !154)
!414 = !DILocation(line: 73, column: 13, scope: !154)
!415 = !DILocation(line: 73, column: 11, scope: !154)
!416 = !DILocation(line: 75, column: 6, scope: !417)
!417 = distinct !DILexicalBlock(scope: !154, file: !1, line: 75, column: 6)
!418 = !DILocation(line: 75, column: 6, scope: !154)
!419 = !DILocation(line: 77, column: 3, scope: !420)
!420 = distinct !DILexicalBlock(scope: !421, file: !1, line: 77, column: 3)
!421 = distinct !DILexicalBlock(scope: !417, file: !1, line: 75, column: 24)
!422 = !DILocation(line: 77, column: 3, scope: !423)
!423 = distinct !DILexicalBlock(scope: !420, file: !1, line: 77, column: 3)
!424 = !DILocation(line: 78, column: 8, scope: !425)
!425 = distinct !DILexicalBlock(scope: !426, file: !1, line: 78, column: 8)
!426 = distinct !DILexicalBlock(scope: !423, file: !1, line: 77, column: 52)
!427 = !DILocation(line: 78, column: 14, scope: !425)
!428 = !DILocation(line: 78, column: 18, scope: !425)
!429 = !DILocation(line: 78, column: 8, scope: !426)
!430 = !DILocation(line: 79, column: 9, scope: !431)
!431 = distinct !DILexicalBlock(scope: !432, file: !1, line: 79, column: 9)
!432 = distinct !DILexicalBlock(scope: !425, file: !1, line: 78, column: 23)
!433 = !DILocation(line: 79, column: 18, scope: !431)
!434 = !DILocation(line: 79, column: 27, scope: !431)
!435 = !DILocation(line: 79, column: 30, scope: !431)
!436 = !DILocation(line: 79, column: 9, scope: !432)
!437 = !DILocation(line: 80, column: 34, scope: !438)
!438 = distinct !DILexicalBlock(scope: !431, file: !1, line: 79, column: 68)
!439 = !DILocation(line: 80, column: 38, scope: !438)
!440 = !DILocation(line: 80, column: 44, scope: !438)
!441 = !DILocation(line: 80, column: 54, scope: !438)
!442 = !DILocation(line: 80, column: 67, scope: !438)
!443 = !DILocation(line: 80, column: 80, scope: !438)
!444 = !DILocation(line: 81, column: 34, scope: !438)
!445 = !DILocation(line: 81, column: 38, scope: !438)
!446 = !DILocation(line: 80, column: 6, scope: !438)
!447 = !DILocation(line: 82, column: 5, scope: !438)
!448 = !DILocation(line: 83, column: 4, scope: !432)
!449 = !DILocation(line: 84, column: 3, scope: !426)
!450 = distinct !{!450, !419, !451}
!451 = !DILocation(line: 84, column: 3, scope: !420)
!452 = !DILocation(line: 85, column: 2, scope: !421)
!453 = !DILocation(line: 87, column: 3, scope: !454)
!454 = distinct !DILexicalBlock(scope: !455, file: !1, line: 87, column: 3)
!455 = distinct !DILexicalBlock(scope: !417, file: !1, line: 86, column: 7)
!456 = !DILocation(line: 87, column: 3, scope: !457)
!457 = distinct !DILexicalBlock(scope: !454, file: !1, line: 87, column: 3)
!458 = !DILocation(line: 88, column: 8, scope: !459)
!459 = distinct !DILexicalBlock(scope: !460, file: !1, line: 88, column: 8)
!460 = distinct !DILexicalBlock(scope: !457, file: !1, line: 87, column: 52)
!461 = !DILocation(line: 88, column: 14, scope: !459)
!462 = !DILocation(line: 88, column: 18, scope: !459)
!463 = !DILocation(line: 88, column: 8, scope: !460)
!464 = !DILocation(line: 89, column: 9, scope: !465)
!465 = distinct !DILexicalBlock(scope: !466, file: !1, line: 89, column: 9)
!466 = distinct !DILexicalBlock(scope: !459, file: !1, line: 88, column: 23)
!467 = !DILocation(line: 89, column: 18, scope: !465)
!468 = !DILocation(line: 89, column: 27, scope: !465)
!469 = !DILocation(line: 89, column: 30, scope: !465)
