; ModuleID = 'blender/source/blender/imbuf/intern/thumbs.c'
source_filename = "blender/source/blender/imbuf/intern/thumbs.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ImBuf = type { %struct.ImBuf*, %struct.ImBuf*, i32, i32, i8, i32, i32, i32, i32*, float*, [2 x double], i32, i32, i32, i32, i32**, i32*, float*, float, [20 x %struct.ImBuf*], i32, i32, i32, i32, %struct.ImMetaData*, i8*, i32, [1024 x i8], [1024 x i8], %struct.MEM_CacheLimiterHandle_s*, i32, i8*, i32, i32, %struct.ColorSpace*, %struct.ColorSpace*, i32*, %struct.ColormanageCache*, i32, %struct.rcti, %struct.DDSData }
%struct.ImMetaData = type { %struct.ImMetaData*, %struct.ImMetaData*, i8*, i8*, i32 }
%struct.MEM_CacheLimiterHandle_s = type opaque
%struct.ColorSpace = type opaque
%struct.ColormanageCache = type opaque
%struct.rcti = type { i32, i32, i32, i32 }
%struct.DDSData = type { i32, i32, i8*, i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.anim = type opaque

@.str = private unnamed_addr constant [5 x i8] c"%s%s\00", align 1
@.str.1 = private unnamed_addr constant [20 x i8] c"%sblender_%d_%s.png\00", align 1
@.str.2 = private unnamed_addr constant [4 x i8] c"%ld\00", align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"%d\00", align 1

!25 = !DIEnumerator(name: "IMB_TC_MAX_SLOT", value: 4, isUnsigned: true)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IMB_Proxy_Size", file: !18, line: 224, baseType: !7, size: 32, elements: !27)
!27 = !{!28, !29, !30, !31, !32, !33}
!28 = !DIEnumerator(name: "IMB_PROXY_NONE", value: 0, isUnsigned: true)
!29 = !DIEnumerator(name: "IMB_PROXY_25", value: 1, isUnsigned: true)
!30 = !DIEnumerator(name: "IMB_PROXY_50", value: 2, isUnsigned: true)
!31 = !DIEnumerator(name: "IMB_PROXY_75", value: 4, isUnsigned: true)
!32 = !DIEnumerator(name: "IMB_PROXY_100", value: 8, isUnsigned: true)
!33 = !DIEnumerator(name: "IMB_PROXY_MAX_SLOT", value: 4, isUnsigned: true)
!34 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 139, baseType: !7, size: 32, elements: !35)
!35 = !{!36, !37, !38, !39, !40}
!36 = !DIEnumerator(name: "UNSAFE_ALL", value: 1, isUnsigned: true)
!37 = !DIEnumerator(name: "UNSAFE_ALLOW_PLUS", value: 2, isUnsigned: true)
!38 = !DIEnumerator(name: "UNSAFE_PATH", value: 8, isUnsigned: true)
!39 = !DIEnumerator(name: "UNSAFE_HOST", value: 16, isUnsigned: true)
!40 = !DIEnumerator(name: "UNSAFE_SLASHES", value: 32, isUnsigned: true)
!41 = !{!42, !43, !44, !45, !46}
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!43 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!44 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!45 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!46 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!47 = !{!0, !48}
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(name: "hex", scope: !2, file: !3, line: 163, type: !50, isLocal: true, isDefinition: true)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 136, elements: !53)
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!52 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!53 = !{!54}
!54 = !DISubrange(count: 17)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 768, elements: !57)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!57 = !{!58}
!58 = !DISubrange(count: 96)
!59 = !{i32 7, !"Dwarf Version", i32 4}
!60 = !{i32 2, !"Debug Info Version", i32 3}
!61 = !{i32 1, !"wchar_size", i32 4}
!62 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!63 = distinct !DISubprogram(name: "IMB_thumb_makedirs", scope: !3, file: !3, line: 271, type: !64, scopeLine: 272, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !66)
!64 = !DISubroutineType(types: !65)
!65 = !{null}
!66 = !{}
!67 = !DILocalVariable(name: "tpath", scope: !63, file: !3, line: 273, type: !68)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 8192, elements: !69)
!69 = !{!70}
!70 = !DISubrange(count: 1024)
!71 = !DILocation(line: 273, column: 7, scope: !63)
!72 = !DILocation(line: 274, column: 20, scope: !73)
!73 = distinct !DILexicalBlock(scope: !63, file: !3, line: 274, column: 6)
!74 = !DILocation(line: 274, column: 6, scope: !73)
!75 = !DILocation(line: 274, column: 6, scope: !63)
!76 = !DILocation(line: 275, column: 28, scope: !77)
!77 = distinct !DILexicalBlock(scope: !73, file: !3, line: 274, column: 40)
!78 = !DILocation(line: 275, column: 3, scope: !77)
!79 = !DILocation(line: 276, column: 2, scope: !77)
!80 = !DILocation(line: 277, column: 20, scope: !81)
!81 = distinct !DILexicalBlock(scope: !63, file: !3, line: 277, column: 6)
!82 = !DILocation(line: 277, column: 6, scope: !81)
!83 = !DILocation(line: 277, column: 6, scope: !63)
!84 = !DILocation(line: 278, column: 28, scope: !85)
!85 = distinct !DILexicalBlock(scope: !81, file: !3, line: 277, column: 38)
!86 = !DILocation(line: 278, column: 3, scope: !85)
!87 = !DILocation(line: 279, column: 2, scope: !85)
!88 = !DILocation(line: 280, column: 1, scope: !63)
!89 = distinct !DISubprogram(name: "get_thumb_dir", scope: !3, file: !3, line: 81, type: !90, scopeLine: 82, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !66)
!90 = !DISubroutineType(types: !91)
!91 = !{!46, !92, !93}
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThumbSize", file: !6, line: 52, baseType: !5)
!94 = !DILocalVariable(name: "dir", arg: 1, scope: !89, file: !3, line: 81, type: !92)
!95 = !DILocation(line: 81, column: 33, scope: !89)
!96 = !DILocalVariable(name: "size", arg: 2, scope: !89, file: !3, line: 81, type: !93)
!97 = !DILocation(line: 81, column: 48, scope: !89)
!98 = !DILocation(line: 84, column: 3, scope: !89)
!99 = distinct !DISubprogram(name: "IMB_thumb_create", scope: !3, file: !3, line: 283, type: !100, scopeLine: 284, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !66)
!100 = !DISubroutineType(types: !101)
!101 = !{!102, !191, !93, !192, !102}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImBuf", file: !104, line: 141, baseType: !105)
!104 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !104, line: 70, size: 19840, elements: !106)
!106 = !{!107, !109, !110, !112, !113, !114, !115, !116, !117, !119, !121, !126, !127, !128, !129, !130, !132, !134, !135, !136, !140, !141, !142, !143, !144, !154, !155, !156, !157, !158, !161, !162, !164, !165, !166, !169, !170, !171, !174, !175, !184}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !105, file: !104, line: 71, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !105, file: !104, line: 71, baseType: !108, size: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !105, file: !104, line: 74, baseType: !111, size: 32, offset: 128)
!111 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !105, file: !104, line: 74, baseType: !111, size: 32, offset: 160)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !105, file: !104, line: 79, baseType: !46, size: 8, offset: 192)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !105, file: !104, line: 80, baseType: !111, size: 32, offset: 224)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !105, file: !104, line: 83, baseType: !111, size: 32, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "mall", scope: !105, file: !104, line: 84, baseType: !111, size: 32, offset: 288)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !105, file: !104, line: 87, baseType: !118, size: 64, offset: 320)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "rect_float", scope: !105, file: !104, line: 88, baseType: !120, size: 64, offset: 384)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "ppm", scope: !105, file: !104, line: 93, baseType: !122, size: 128, offset: 448)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 128, elements: !124)
!123 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!124 = !{!125}
!125 = !DISubrange(count: 2)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "tilex", scope: !105, file: !104, line: 96, baseType: !111, size: 32, offset: 576)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "tiley", scope: !105, file: !104, line: 96, baseType: !111, size: 32, offset: 608)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "xtiles", scope: !105, file: !104, line: 97, baseType: !111, size: 32, offset: 640)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "ytiles", scope: !105, file: !104, line: 97, baseType: !111, size: 32, offset: 672)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "tiles", scope: !105, file: !104, line: 98, baseType: !131, size: 64, offset: 704)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !105, file: !104, line: 101, baseType: !133, size: 64, offset: 768)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_float", scope: !105, file: !104, line: 102, baseType: !120, size: 64, offset: 832)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !105, file: !104, line: 105, baseType: !44, size: 32, offset: 896)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "mipmap", scope: !105, file: !104, line: 108, baseType: !137, size: 1280, offset: 960)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 1280, elements: !138)
!138 = !{!139}
!139 = !DISubrange(count: 20)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "miptot", scope: !105, file: !104, line: 109, baseType: !111, size: 32, offset: 2240)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "miplevel", scope: !105, file: !104, line: 109, baseType: !111, size: 32, offset: 2272)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !105, file: !104, line: 112, baseType: !111, size: 32, offset: 2304)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "userflags", scope: !105, file: !104, line: 113, baseType: !111, size: 32, offset: 2336)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !105, file: !104, line: 114, baseType: !145, size: 64, offset: 2368)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImMetaData", file: !147, line: 38, size: 320, elements: !148)
!147 = !DIFile(filename: "blender/source/blender/imbuf/intern/IMB_metadata.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!148 = !{!149, !150, !151, !152, !153}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !146, file: !147, line: 39, baseType: !145, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !146, file: !147, line: 39, baseType: !145, size: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !146, file: !147, line: 40, baseType: !92, size: 64, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !146, file: !147, line: 41, baseType: !92, size: 64, offset: 192)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !146, file: !147, line: 42, baseType: !111, size: 32, offset: 256)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !105, file: !104, line: 115, baseType: !42, size: 64, offset: 2432)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !105, file: !104, line: 118, baseType: !111, size: 32, offset: 2496)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !105, file: !104, line: 119, baseType: !68, size: 8192, offset: 2528)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "cachename", scope: !105, file: !104, line: 120, baseType: !68, size: 8192, offset: 10720)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "c_handle", scope: !105, file: !104, line: 123, baseType: !159, size: 64, offset: 18944)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "MEM_CacheLimiterHandle_s", file: !104, line: 123, flags: DIFlagFwdDecl)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "refcounter", scope: !105, file: !104, line: 124, baseType: !111, size: 32, offset: 19008)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffer", scope: !105, file: !104, line: 127, baseType: !163, size: 64, offset: 19072)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "encodedsize", scope: !105, file: !104, line: 128, baseType: !7, size: 32, offset: 19136)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffersize", scope: !105, file: !104, line: 129, baseType: !7, size: 32, offset: 19168)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "rect_colorspace", scope: !105, file: !104, line: 132, baseType: !167, size: 64, offset: 19200)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !104, line: 132, flags: DIFlagFwdDecl)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "float_colorspace", scope: !105, file: !104, line: 133, baseType: !167, size: 64, offset: 19264)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer_flags", scope: !105, file: !104, line: 134, baseType: !118, size: 64, offset: 19328)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_cache", scope: !105, file: !104, line: 135, baseType: !172, size: 64, offset: 19392)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColormanageCache", file: !104, line: 135, flags: DIFlagFwdDecl)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_flag", scope: !105, file: !104, line: 136, baseType: !111, size: 32, offset: 19456)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_rect", scope: !105, file: !104, line: 137, baseType: !176, size: 128, offset: 19488)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !177, line: 89, baseType: !178)
!177 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !177, line: 86, size: 128, elements: !179)
!179 = !{!180, !181, !182, !183}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !178, file: !177, line: 87, baseType: !111, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !178, file: !177, line: 87, baseType: !111, size: 32, offset: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !178, file: !177, line: 88, baseType: !111, size: 32, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !178, file: !177, line: 88, baseType: !111, size: 32, offset: 96)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "dds_data", scope: !105, file: !104, line: 140, baseType: !185, size: 192, offset: 19648)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DDSData", file: !104, line: 55, size: 192, elements: !186)
!186 = !{!187, !188, !189, !190}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "fourcc", scope: !185, file: !104, line: 56, baseType: !7, size: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "nummipmaps", scope: !185, file: !104, line: 57, baseType: !7, size: 32, offset: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !185, file: !104, line: 58, baseType: !163, size: 64, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !185, file: !104, line: 59, baseType: !7, size: 32, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThumbSource", file: !6, line: 58, baseType: !12)
!193 = !DILocalVariable(name: "path", arg: 1, scope: !99, file: !3, line: 283, type: !191)
!194 = !DILocation(line: 283, column: 37, scope: !99)
!195 = !DILocalVariable(name: "size", arg: 2, scope: !99, file: !3, line: 283, type: !93)
!196 = !DILocation(line: 283, column: 53, scope: !99)
!197 = !DILocalVariable(name: "source", arg: 3, scope: !99, file: !3, line: 283, type: !192)
!198 = !DILocation(line: 283, column: 71, scope: !99)
!199 = !DILocalVariable(name: "img", arg: 4, scope: !99, file: !3, line: 283, type: !102)
!200 = !DILocation(line: 283, column: 86, scope: !99)
!201 = !DILocalVariable(name: "uri", scope: !99, file: !3, line: 285, type: !202)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 24640, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 3080)
!205 = !DILocation(line: 285, column: 7, scope: !99)
!206 = !DILocalVariable(name: "desc", scope: !99, file: !3, line: 286, type: !207)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 24816, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 3102)
!210 = !DILocation(line: 286, column: 7, scope: !99)
!211 = !DILocalVariable(name: "tpath", scope: !99, file: !3, line: 287, type: !68)
!212 = !DILocation(line: 287, column: 7, scope: !99)
!213 = !DILocalVariable(name: "tdir", scope: !99, file: !3, line: 288, type: !68)
!214 = !DILocation(line: 288, column: 7, scope: !99)
!215 = !DILocalVariable(name: "temp", scope: !99, file: !3, line: 289, type: !68)
!216 = !DILocation(line: 289, column: 7, scope: !99)
!217 = !DILocalVariable(name: "mtime", scope: !99, file: !3, line: 290, type: !218)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 320, elements: !219)
!219 = !{!220}
!220 = !DISubrange(count: 40)
!221 = !DILocation(line: 290, column: 7, scope: !99)
!222 = !DILocalVariable(name: "cwidth", scope: !99, file: !3, line: 291, type: !218)
!223 = !DILocation(line: 291, column: 7, scope: !99)
!224 = !DILocalVariable(name: "cheight", scope: !99, file: !3, line: 292, type: !218)
!225 = !DILocation(line: 292, column: 7, scope: !99)
!226 = !DILocalVariable(name: "thumb", scope: !99, file: !3, line: 293, type: !218)
!227 = !DILocation(line: 293, column: 7, scope: !99)
!228 = !DILocalVariable(name: "tsize", scope: !99, file: !3, line: 294, type: !45)
!229 = !DILocation(line: 294, column: 8, scope: !99)
!230 = !DILocalVariable(name: "ex", scope: !99, file: !3, line: 295, type: !45)
!231 = !DILocation(line: 295, column: 8, scope: !99)
!232 = !DILocalVariable(name: "ey", scope: !99, file: !3, line: 295, type: !45)
!233 = !DILocation(line: 295, column: 12, scope: !99)
!234 = !DILocalVariable(name: "scaledx", scope: !99, file: !3, line: 296, type: !44)
!235 = !DILocation(line: 296, column: 8, scope: !99)
!236 = !DILocalVariable(name: "scaledy", scope: !99, file: !3, line: 296, type: !44)
!237 = !DILocation(line: 296, column: 17, scope: !99)
!238 = !DILocalVariable(name: "info", scope: !99, file: !3, line: 297, type: !239)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_stat_t", file: !240, line: 73, baseType: !241)
!240 = !DIFile(filename: "blender/source/blender/blenlib/BLI_fileops.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !242, line: 46, size: 1152, elements: !243)
!242 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!243 = !{!244, !248, !250, !252, !254, !256, !258, !259, !260, !262, !264, !266, !274, !275, !276}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !241, file: !242, line: 48, baseType: !245, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !246, line: 145, baseType: !247)
!246 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!247 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !241, file: !242, line: 53, baseType: !249, size: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !246, line: 148, baseType: !247)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !241, file: !242, line: 61, baseType: !251, size: 64, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !246, line: 151, baseType: !247)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !241, file: !242, line: 62, baseType: !253, size: 32, offset: 192)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !246, line: 150, baseType: !7)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !241, file: !242, line: 64, baseType: !255, size: 32, offset: 224)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !246, line: 146, baseType: !7)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !241, file: !242, line: 65, baseType: !257, size: 32, offset: 256)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !246, line: 147, baseType: !7)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !241, file: !242, line: 67, baseType: !111, size: 32, offset: 288)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !241, file: !242, line: 69, baseType: !245, size: 64, offset: 320)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !241, file: !242, line: 74, baseType: !261, size: 64, offset: 384)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !246, line: 152, baseType: !43)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !241, file: !242, line: 78, baseType: !263, size: 64, offset: 448)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !246, line: 174, baseType: !43)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !241, file: !242, line: 80, baseType: !265, size: 64, offset: 512)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !246, line: 179, baseType: !43)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !241, file: !242, line: 91, baseType: !267, size: 128, offset: 576)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !268, line: 10, size: 128, elements: !269)
!268 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!269 = !{!270, !272}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !267, file: !268, line: 12, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !246, line: 160, baseType: !43)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !267, file: !268, line: 16, baseType: !273, size: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !246, line: 196, baseType: !43)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !241, file: !242, line: 92, baseType: !267, size: 128, offset: 704)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !241, file: !242, line: 93, baseType: !267, size: 128, offset: 832)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !241, file: !242, line: 106, baseType: !277, size: 192, offset: 960)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !273, size: 192, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 3)
!280 = !DILocation(line: 297, column: 13, scope: !99)
!281 = !DILocation(line: 299, column: 10, scope: !99)
!282 = !DILocation(line: 299, column: 2, scope: !99)
!283 = !DILocation(line: 301, column: 10, scope: !284)
!284 = distinct !DILexicalBlock(scope: !99, file: !3, line: 299, column: 16)
!285 = !DILocation(line: 302, column: 4, scope: !284)
!286 = !DILocation(line: 304, column: 10, scope: !284)
!287 = !DILocation(line: 305, column: 4, scope: !284)
!288 = !DILocation(line: 307, column: 10, scope: !284)
!289 = !DILocation(line: 308, column: 4, scope: !284)
!290 = !DILocation(line: 310, column: 4, scope: !284)
!291 = !DILocation(line: 314, column: 6, scope: !292)
!292 = distinct !DILexicalBlock(scope: !99, file: !3, line: 314, column: 6)
!293 = !DILocation(line: 314, column: 13, scope: !292)
!294 = !DILocation(line: 314, column: 6, scope: !99)
!295 = !DILocalVariable(name: "file_size", scope: !296, file: !3, line: 315, type: !297)
!296 = distinct !DILexicalBlock(scope: !292, file: !3, line: 314, column: 34)
!297 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !298)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !299, line: 46, baseType: !247)
!299 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!300 = !DILocation(line: 315, column: 16, scope: !296)
!301 = !DILocation(line: 315, column: 42, scope: !296)
!302 = !DILocation(line: 315, column: 28, scope: !296)
!303 = !DILocation(line: 316, column: 7, scope: !304)
!304 = distinct !DILexicalBlock(scope: !296, file: !3, line: 316, column: 7)
!305 = !DILocation(line: 316, column: 17, scope: !304)
!306 = !DILocation(line: 316, column: 23, scope: !304)
!307 = !DILocation(line: 316, column: 26, scope: !304)
!308 = !DILocation(line: 316, column: 36, scope: !304)
!309 = !DILocation(line: 316, column: 7, scope: !296)
!310 = !DILocation(line: 318, column: 4, scope: !311)
!311 = distinct !DILexicalBlock(scope: !304, file: !3, line: 316, column: 54)
!312 = !DILocation(line: 320, column: 2, scope: !296)
!313 = !DILocation(line: 322, column: 20, scope: !99)
!314 = !DILocation(line: 322, column: 26, scope: !99)
!315 = !DILocation(line: 322, column: 2, scope: !99)
!316 = !DILocation(line: 323, column: 21, scope: !99)
!317 = !DILocation(line: 323, column: 26, scope: !99)
!318 = !DILocation(line: 323, column: 2, scope: !99)
!319 = !DILocation(line: 324, column: 20, scope: !320)
!320 = distinct !DILexicalBlock(scope: !99, file: !3, line: 324, column: 6)
!321 = !DILocation(line: 324, column: 26, scope: !320)
!322 = !DILocation(line: 324, column: 6, scope: !320)
!323 = !DILocation(line: 324, column: 6, scope: !99)
!324 = !DILocation(line: 325, column: 16, scope: !325)
!325 = distinct !DILexicalBlock(scope: !320, file: !3, line: 324, column: 33)
!326 = !DILocation(line: 325, column: 41, scope: !325)
!327 = !DILocation(line: 325, column: 47, scope: !325)
!328 = !DILocation(line: 325, column: 3, scope: !325)
!329 = !DILocation(line: 326, column: 3, scope: !325)
!330 = !DILocation(line: 326, column: 12, scope: !325)
!331 = !DILocation(line: 327, column: 16, scope: !325)
!332 = !DILocation(line: 327, column: 55, scope: !325)
!333 = !DILocation(line: 327, column: 65, scope: !325)
!334 = !DILocation(line: 327, column: 61, scope: !325)
!335 = !DILocation(line: 327, column: 76, scope: !325)
!336 = !DILocation(line: 327, column: 3, scope: !325)
!337 = !DILocation(line: 328, column: 21, scope: !338)
!338 = distinct !DILexicalBlock(scope: !325, file: !3, line: 328, column: 7)
!339 = !DILocation(line: 328, column: 27, scope: !338)
!340 = !DILocation(line: 328, column: 7, scope: !338)
!341 = !DILocation(line: 328, column: 47, scope: !338)
