; ModuleID = 'blender/source/blender/bmesh/operators/bmo_fill_edgeloop.c'
source_filename = "blender/source/blender/bmesh/operators/bmo_fill_edgeloop.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BMesh = type { i32, i32, i32, i32, i32, i32, i32, i8, i8, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BMVert**, %struct.BMEdge**, %struct.BMFace**, i32, i32, i32, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, i32, %struct.BMOperator*, %struct.CustomData, %struct.CustomData, %struct.CustomData, %struct.CustomData, i16, i32, i32, i32, %struct.ListBase, %struct.BMFace*, %struct.ListBase, i8* }
%struct.BMVert = type { %struct.BMHeader, %struct.BMFlagLayer*, [3 x float], [3 x float], %struct.BMEdge* }
%struct.BMHeader = type { i8*, i32, i8, i8, i8 }
%struct.BMFlagLayer = type { i16 }
%struct.BMEdge = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMVert*, %struct.BMVert*, %struct.BMLoop*, %struct.BMDiskLink, %struct.BMDiskLink }
%struct.BMLoop = type { %struct.BMHeader, %struct.BMVert*, %struct.BMEdge*, %struct.BMFace*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop* }
%struct.BMDiskLink = type { %struct.BMEdge*, %struct.BMEdge* }
%struct.BLI_mempool = type opaque

!27 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Map", file: !4, line: 123, baseType: !5, size: 32, elements: !28)
!28 = !{!29, !30, !31, !32, !33, !34}
!29 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_EMPTY", value: 64, isUnsigned: true)
!30 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_ELEM", value: 65, isUnsigned: true)
!31 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_FLT", value: 66, isUnsigned: true)
!32 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INT", value: 67, isUnsigned: true)
!33 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_BOOL", value: 68, isUnsigned: true)
!34 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INTERNAL", value: 69, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 182, baseType: !5, size: 32, elements: !36)
!36 = !{!37, !38, !39, !40, !41}
!37 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NOP", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_UNTAN_MULTIRES", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NORMALS_CALC", value: 2, isUnsigned: true)
!40 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_FLUSH", value: 4, isUnsigned: true)
!41 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 249, baseType: !5, size: 32, elements: !44)
!43 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!44 = !{!45, !46, !47, !48}
!45 = !DIEnumerator(name: "BM_VERT", value: 1, isUnsigned: true)
!46 = !DIEnumerator(name: "BM_EDGE", value: 2, isUnsigned: true)
!47 = !DIEnumerator(name: "BM_LOOP", value: 4, isUnsigned: true)
!48 = !DIEnumerator(name: "BM_FACE", value: 8, isUnsigned: true)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BMIterType", file: !50, line: 57, baseType: !5, size: 32, elements: !51)
!50 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!51 = !{!52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65}
!52 = !DIEnumerator(name: "BM_VERTS_OF_MESH", value: 1, isUnsigned: true)
!53 = !DIEnumerator(name: "BM_EDGES_OF_MESH", value: 2, isUnsigned: true)
!54 = !DIEnumerator(name: "BM_FACES_OF_MESH", value: 3, isUnsigned: true)
!55 = !DIEnumerator(name: "BM_EDGES_OF_VERT", value: 4, isUnsigned: true)
!56 = !DIEnumerator(name: "BM_FACES_OF_VERT", value: 5, isUnsigned: true)
!57 = !DIEnumerator(name: "BM_LOOPS_OF_VERT", value: 6, isUnsigned: true)
!58 = !DIEnumerator(name: "BM_VERTS_OF_EDGE", value: 7, isUnsigned: true)
!59 = !DIEnumerator(name: "BM_FACES_OF_EDGE", value: 8, isUnsigned: true)
!60 = !DIEnumerator(name: "BM_VERTS_OF_FACE", value: 9, isUnsigned: true)
!61 = !DIEnumerator(name: "BM_EDGES_OF_FACE", value: 10, isUnsigned: true)
!62 = !DIEnumerator(name: "BM_LOOPS_OF_FACE", value: 11, isUnsigned: true)
!63 = !DIEnumerator(name: "BM_ALL_LOOPS_OF_FACE", value: 12, isUnsigned: true)
!64 = !DIEnumerator(name: "BM_LOOPS_OF_LOOP", value: 13, isUnsigned: true)
!65 = !DIEnumerator(name: "BM_LOOPS_OF_EDGE", value: 14, isUnsigned: true)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMCreateFlag", file: !67, line: 33, baseType: !5, size: 32, elements: !68)
!67 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_core.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!68 = !{!69, !70, !71}
!69 = !DIEnumerator(name: "BM_CREATE_NOP", value: 0, isUnsigned: true)
!70 = !DIEnumerator(name: "BM_CREATE_NO_DOUBLE", value: 2, isUnsigned: true)
!71 = !DIEnumerator(name: "BM_CREATE_SKIP_CD", value: 4, isUnsigned: true)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 260, baseType: !5, size: 32, elements: !73)
!73 = !{!74, !75, !76, !77, !78, !79, !80}
!74 = !DIEnumerator(name: "BM_ELEM_SELECT", value: 1, isUnsigned: true)
!75 = !DIEnumerator(name: "BM_ELEM_HIDDEN", value: 2, isUnsigned: true)
!76 = !DIEnumerator(name: "BM_ELEM_SEAM", value: 4, isUnsigned: true)
!77 = !DIEnumerator(name: "BM_ELEM_SMOOTH", value: 8, isUnsigned: true)
!78 = !DIEnumerator(name: "BM_ELEM_TAG", value: 16, isUnsigned: true)
!79 = !DIEnumerator(name: "BM_ELEM_DRAW", value: 32, isUnsigned: true)
!80 = !DIEnumerator(name: "BM_ELEM_INTERNAL_TAG", value: 128, isUnsigned: true)
!81 = !{!82, !83, !84, !88, !92, !158, !160, !142, !112}
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !50, line: 79, baseType: !49)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !50, line: 158, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DISubroutineType(types: !87)
!87 = !{null, !82}
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !50, line: 159, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{!82, !82}
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !43, line: 103, baseType: !94)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !43, line: 90, size: 448, elements: !95)
!95 = !{!96, !107, !113, !118, !119}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !94, file: !43, line: 91, baseType: !97, size: 128)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !43, line: 82, baseType: !98)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !43, line: 64, size: 128, elements: !99)
!99 = !{!100, !101, !103, !105, !106}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !98, file: !43, line: 65, baseType: !82, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !98, file: !43, line: 66, baseType: !102, size: 32, offset: 64)
!102 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !98, file: !43, line: 73, baseType: !104, size: 8, offset: 96)
!104 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !98, file: !43, line: 74, baseType: !104, size: 8, offset: 104)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !98, file: !43, line: 80, baseType: !104, size: 8, offset: 112)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !94, file: !43, line: 92, baseType: !108, size: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !43, line: 180, size: 16, elements: !110)
!110 = !{!111}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !109, file: !43, line: 181, baseType: !112, size: 16)
!112 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !94, file: !43, line: 94, baseType: !114, size: 96, offset: 192)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 96, elements: !116)
!115 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!116 = !{!117}
!117 = !DISubrange(count: 3)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !94, file: !43, line: 95, baseType: !114, size: 96, offset: 288)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !94, file: !43, line: 102, baseType: !120, size: 64, offset: 384)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !43, line: 110, size: 640, elements: !122)
!122 = !{!123, !124, !125, !127, !128, !151, !157}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !121, file: !43, line: 111, baseType: !97, size: 128)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !121, file: !43, line: 112, baseType: !108, size: 64, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !121, file: !43, line: 114, baseType: !126, size: 64, offset: 192)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !121, file: !43, line: 114, baseType: !126, size: 64, offset: 256)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !121, file: !43, line: 118, baseType: !129, size: 64, offset: 320)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !43, line: 125, size: 576, elements: !131)
!131 = !{!132, !133, !134, !135, !147, !148, !149, !150}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !130, file: !43, line: 126, baseType: !97, size: 128)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !130, file: !43, line: 129, baseType: !126, size: 64, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !130, file: !43, line: 130, baseType: !120, size: 64, offset: 192)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !130, file: !43, line: 131, baseType: !136, size: 64, offset: 256)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !43, line: 164, size: 448, elements: !138)
!138 = !{!139, !140, !141, !144, !145, !146}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !137, file: !43, line: 165, baseType: !97, size: 128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !137, file: !43, line: 166, baseType: !108, size: 64, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !137, file: !43, line: 172, baseType: !142, size: 64, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !43, line: 140, baseType: !130)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !137, file: !43, line: 174, baseType: !102, size: 32, offset: 256)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !137, file: !43, line: 175, baseType: !114, size: 96, offset: 288)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !137, file: !43, line: 176, baseType: !112, size: 16, offset: 384)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !130, file: !43, line: 135, baseType: !129, size: 64, offset: 320)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !130, file: !43, line: 135, baseType: !129, size: 64, offset: 384)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !130, file: !43, line: 139, baseType: !129, size: 64, offset: 448)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !130, file: !43, line: 139, baseType: !129, size: 64, offset: 512)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !121, file: !43, line: 122, baseType: !152, size: 128, offset: 384)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !43, line: 108, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !43, line: 106, size: 128, elements: !154)
!154 = !{!155, !156}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !153, file: !43, line: 107, baseType: !120, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !153, file: !43, line: 107, baseType: !120, size: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !121, file: !43, line: 122, baseType: !152, size: 128, offset: 512)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !43, line: 123, baseType: !121)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !43, line: 178, baseType: !137)
!162 = !{i32 7, !"Dwarf Version", i32 4}
!163 = !{i32 2, !"Debug Info Version", i32 3}
!164 = !{i32 1, !"wchar_size", i32 4}
!165 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!166 = distinct !DISubprogram(name: "bmo_edgeloop_fill_exec", scope: !1, file: !1, line: 41, type: !167, scopeLine: 42, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !312)
!167 = !DISubroutineType(types: !168)
!168 = !{null, !169, !310}
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !43, line: 246, baseType: !171)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !43, line: 186, size: 8064, elements: !172)
!172 = !{!173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !186, !187, !188, !189, !191, !193, !195, !196, !197, !198, !199, !200, !201, !202, !254, !293, !294, !295, !296, !297, !298, !299, !300, !307, !308, !309}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !171, file: !43, line: 187, baseType: !102, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !171, file: !43, line: 187, baseType: !102, size: 32, offset: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !171, file: !43, line: 187, baseType: !102, size: 32, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !171, file: !43, line: 187, baseType: !102, size: 32, offset: 96)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !171, file: !43, line: 188, baseType: !102, size: 32, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !171, file: !43, line: 188, baseType: !102, size: 32, offset: 160)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !171, file: !43, line: 188, baseType: !102, size: 32, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !171, file: !43, line: 193, baseType: !104, size: 8, offset: 224)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !171, file: !43, line: 197, baseType: !104, size: 8, offset: 232)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !171, file: !43, line: 201, baseType: !183, size: 64, offset: 256)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !185, line: 71, flags: DIFlagFwdDecl)
!185 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!186 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !171, file: !43, line: 201, baseType: !183, size: 64, offset: 320)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !171, file: !43, line: 201, baseType: !183, size: 64, offset: 384)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !171, file: !43, line: 201, baseType: !183, size: 64, offset: 448)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !171, file: !43, line: 208, baseType: !190, size: 64, offset: 512)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !171, file: !43, line: 209, baseType: !192, size: 64, offset: 576)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !171, file: !43, line: 210, baseType: !194, size: 64, offset: 640)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !171, file: !43, line: 213, baseType: !102, size: 32, offset: 704)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !171, file: !43, line: 214, baseType: !102, size: 32, offset: 736)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !171, file: !43, line: 215, baseType: !102, size: 32, offset: 768)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !171, file: !43, line: 218, baseType: !183, size: 64, offset: 832)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !171, file: !43, line: 218, baseType: !183, size: 64, offset: 896)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !171, file: !43, line: 218, baseType: !183, size: 64, offset: 960)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !171, file: !43, line: 220, baseType: !102, size: 32, offset: 1024)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !171, file: !43, line: 221, baseType: !203, size: 64, offset: 1088)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !4, line: 190, size: 10496, elements: !205)
!205 = !{!206, !242, !243, !247, !250, !251, !253}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !204, file: !4, line: 191, baseType: !207, size: 5120)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 5120, elements: !240)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !4, line: 147, size: 320, elements: !209)
!209 = !{!210, !213, !215, !225, !226}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !208, file: !4, line: 148, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !104)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !208, file: !4, line: 149, baseType: !214, size: 32, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !4, line: 112, baseType: !3)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !208, file: !4, line: 150, baseType: !216, size: 32, offset: 96)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !4, line: 142, baseType: !217)
!217 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !4, line: 138, size: 32, elements: !218)
!218 = !{!219, !221, !223}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !217, file: !4, line: 139, baseType: !220, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !4, line: 122, baseType: !15)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !217, file: !4, line: 140, baseType: !222, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !4, line: 136, baseType: !21)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !217, file: !4, line: 141, baseType: !224, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !4, line: 130, baseType: !27)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !208, file: !4, line: 152, baseType: !102, size: 32, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !208, file: !4, line: 162, baseType: !227, size: 128, offset: 192)
!227 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !208, file: !4, line: 155, size: 128, elements: !228)
!228 = !{!229, !230, !231, !232, !233, !235}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !227, file: !4, line: 156, baseType: !102, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !227, file: !4, line: 157, baseType: !115, size: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !227, file: !4, line: 158, baseType: !82, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !227, file: !4, line: 159, baseType: !114, size: 96)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !227, file: !4, line: 160, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !227, file: !4, line: 161, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !238, line: 48, baseType: !239)
!238 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !238, line: 48, flags: DIFlagFwdDecl)
!240 = !{!241}
!241 = !DISubrange(count: 16)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !204, file: !4, line: 192, baseType: !207, size: 5120, offset: 5120)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !204, file: !4, line: 193, baseType: !244, size: 64, offset: 10240)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{null, !169, !203}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !204, file: !4, line: 194, baseType: !248, size: 64, offset: 10304)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !4, line: 194, flags: DIFlagFwdDecl)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !204, file: !4, line: 195, baseType: !102, size: 32, offset: 10368)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !204, file: !4, line: 196, baseType: !252, size: 32, offset: 10400)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !4, line: 188, baseType: !35)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !204, file: !4, line: 197, baseType: !102, size: 32, offset: 10432)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !171, file: !43, line: 223, baseType: !255, size: 1600, offset: 1152)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !185, line: 73, baseType: !256)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !185, line: 64, size: 1600, elements: !257)
!257 = !{!258, !276, !280, !281, !282, !283, !284}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !256, file: !185, line: 65, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !185, line: 53, baseType: !261)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !185, line: 42, size: 832, elements: !262)
!262 = !{!263, !264, !265, !266, !267, !268, !269, !270, !271, !275}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !261, file: !185, line: 43, baseType: !102, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !261, file: !185, line: 44, baseType: !102, size: 32, offset: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !261, file: !185, line: 45, baseType: !102, size: 32, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !261, file: !185, line: 46, baseType: !102, size: 32, offset: 96)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !261, file: !185, line: 47, baseType: !102, size: 32, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !261, file: !185, line: 48, baseType: !102, size: 32, offset: 160)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !261, file: !185, line: 49, baseType: !102, size: 32, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !261, file: !185, line: 50, baseType: !102, size: 32, offset: 224)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !261, file: !185, line: 51, baseType: !272, size: 512, offset: 256)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 512, elements: !273)
!273 = !{!274}
!274 = !DISubrange(count: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !261, file: !185, line: 52, baseType: !82, size: 64, offset: 768)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !256, file: !185, line: 66, baseType: !277, size: 1312, offset: 64)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 1312, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 41)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !256, file: !185, line: 69, baseType: !102, size: 32, offset: 1376)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !256, file: !185, line: 69, baseType: !102, size: 32, offset: 1408)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !256, file: !185, line: 70, baseType: !102, size: 32, offset: 1440)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !256, file: !185, line: 71, baseType: !183, size: 64, offset: 1472)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !256, file: !185, line: 72, baseType: !285, size: 64, offset: 1536)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !185, line: 59, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !185, line: 57, size: 8192, elements: !288)
!288 = !{!289}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !287, file: !185, line: 58, baseType: !290, size: 8192)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 8192, elements: !291)
!291 = !{!292}
!292 = !DISubrange(count: 1024)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !171, file: !43, line: 223, baseType: !255, size: 1600, offset: 2752)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !171, file: !43, line: 223, baseType: !255, size: 1600, offset: 4352)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !171, file: !43, line: 223, baseType: !255, size: 1600, offset: 5952)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !171, file: !43, line: 233, baseType: !112, size: 16, offset: 7552)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !171, file: !43, line: 236, baseType: !102, size: 32, offset: 7584)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !171, file: !43, line: 238, baseType: !102, size: 32, offset: 7616)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !171, file: !43, line: 238, baseType: !102, size: 32, offset: 7648)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !171, file: !43, line: 239, baseType: !301, size: 128, offset: 7680)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !302, line: 71, baseType: !303)
!302 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !302, line: 69, size: 128, elements: !304)
!304 = !{!305, !306}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !303, file: !302, line: 70, baseType: !82, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !303, file: !302, line: 70, baseType: !82, size: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !171, file: !43, line: 241, baseType: !160, size: 64, offset: 7808)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !171, file: !43, line: 243, baseType: !301, size: 128, offset: 7872)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !171, file: !43, line: 245, baseType: !82, size: 64, offset: 8000)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOperator", file: !4, line: 198, baseType: !204)
!312 = !{}
!313 = !DILocalVariable(name: "bm", arg: 1, scope: !166, file: !1, line: 41, type: !169)
!314 = !DILocation(line: 41, column: 36, scope: !166)
!315 = !DILocalVariable(name: "op", arg: 2, scope: !166, file: !1, line: 41, type: !310)
!316 = !DILocation(line: 41, column: 52, scope: !166)
!317 = !DILocalVariable(name: "tote", scope: !166, file: !1, line: 44, type: !318)
!318 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!319 = !DILocation(line: 44, column: 12, scope: !166)
!320 = !DILocation(line: 44, column: 41, scope: !166)
!321 = !DILocation(line: 44, column: 45, scope: !166)
!322 = !DILocation(line: 44, column: 19, scope: !166)
!323 = !DILocalVariable(name: "totv", scope: !166, file: !1, line: 45, type: !318)
!324 = !DILocation(line: 45, column: 12, scope: !166)
!325 = !DILocation(line: 45, column: 19, scope: !166)
!326 = !DILocalVariable(name: "verts", scope: !166, file: !1, line: 46, type: !190)
!327 = !DILocation(line: 46, column: 11, scope: !166)
!328 = !DILocation(line: 46, column: 19, scope: !166)
!329 = !DILocation(line: 46, column: 48, scope: !166)
!330 = !DILocation(line: 46, column: 46, scope: !166)
!331 = !DILocalVariable(name: "v", scope: !166, file: !1, line: 48, type: !92)
!332 = !DILocation(line: 48, column: 10, scope: !166)
!333 = !DILocalVariable(name: "e", scope: !166, file: !1, line: 49, type: !158)
!334 = !DILocation(line: 49, column: 10, scope: !166)
!335 = !DILocalVariable(name: "i", scope: !166, file: !1, line: 50, type: !102)
!336 = !DILocation(line: 50, column: 6, scope: !166)
!337 = !DILocalVariable(name: "ok", scope: !166, file: !1, line: 51, type: !338)
!338 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!339 = !DILocation(line: 51, column: 7, scope: !166)
!340 = !DILocalVariable(name: "oiter", scope: !166, file: !1, line: 53, type: !341)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOIter", file: !4, line: 463, baseType: !342)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOIter", file: !4, line: 457, size: 448, elements: !343)
!343 = !{!344, !347, !348, !357, !358}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !342, file: !4, line: 458, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpSlot", file: !4, line: 163, baseType: !208)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !342, file: !4, line: 459, baseType: !102, size: 32, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "giter", scope: !342, file: !4, line: 460, baseType: !349, size: 192, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashIterator", file: !238, line: 54, baseType: !350)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GHashIterator", file: !238, line: 50, size: 192, elements: !351)
!351 = !{!352, !353, !356}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "gh", scope: !350, file: !238, line: 51, baseType: !236, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "curEntry", scope: !350, file: !238, line: 52, baseType: !354, size: 64, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry", file: !238, line: 52, flags: DIFlagFwdDecl)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "curBucket", scope: !350, file: !238, line: 53, baseType: !5, size: 32, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !342, file: !4, line: 461, baseType: !234, size: 64, offset: 320)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "restrictmask", scope: !342, file: !4, line: 462, baseType: !104, size: 8, offset: 384)
!359 = !DILocation(line: 53, column: 10, scope: !166)
!360 = !DILocalVariable(name: "mat_nr", scope: !166, file: !1, line: 55, type: !361)
!361 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !112)
!362 = !DILocation(line: 55, column: 14, scope: !166)
!363 = !DILocation(line: 55, column: 44, scope: !166)
!364 = !DILocation(line: 55, column: 48, scope: !166)
!365 = !DILocation(line: 55, column: 27, scope: !166)
!366 = !DILocalVariable(name: "use_smooth", scope: !166, file: !1, line: 56, type: !367)
!367 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !338)
!368 = !DILocation(line: 56, column: 13, scope: !166)
!369 = !DILocation(line: 56, column: 45, scope: !166)
!370 = !DILocation(line: 56, column: 49, scope: !166)
!371 = !DILocation(line: 56, column: 27, scope: !166)
!372 = !DILocation(line: 59, column: 4, scope: !166)
!373 = !DILocation(line: 60, column: 2, scope: !374)
!374 = distinct !DILexicalBlock(scope: !166, file: !1, line: 60, column: 2)
!375 = !DILocation(line: 60, column: 2, scope: !376)
!376 = distinct !DILexicalBlock(scope: !374, file: !1, line: 60, column: 2)
!377 = !DILocalVariable(name: "viter", scope: !378, file: !1, line: 61, type: !379)
!378 = distinct !DILexicalBlock(scope: !376, file: !1, line: 60, column: 55)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter", file: !50, line: 186, baseType: !380)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter", file: !50, line: 164, size: 512, elements: !381)
!381 = !{!382, !462, !463, !464, !465}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !380, file: !50, line: 179, baseType: !383, size: 320)
!383 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !380, file: !50, line: 166, size: 320, elements: !384)
!384 = !{!385, !400, !406, !414, !422, !428, !434, !440, !444, !450, !456}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "elem_of_mesh", scope: !383, file: !50, line: 167, baseType: !386, size: 192)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__elem_of_mesh", file: !50, line: 113, size: 192, elements: !387)
!387 = !{!388}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "pooliter", scope: !386, file: !50, line: 114, baseType: !389, size: 192)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool_iter", file: !390, line: 80, baseType: !391)
!390 = !DIFile(filename: "blender/source/blender/blenlib/BLI_mempool.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_iter", file: !390, line: 76, size: 192, elements: !392)
!392 = !{!393, !396, !399}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !391, file: !390, line: 77, baseType: !394, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool", file: !390, line: 47, baseType: !184)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "curchunk", scope: !391, file: !390, line: 78, baseType: !397, size: 64, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_chunk", file: !390, line: 45, flags: DIFlagFwdDecl)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "curindex", scope: !391, file: !390, line: 79, baseType: !5, size: 32, offset: 128)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_vert", scope: !383, file: !50, line: 169, baseType: !401, size: 192)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_vert", file: !50, line: 116, size: 192, elements: !402)
!402 = !{!403, !404, !405}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !401, file: !50, line: 117, baseType: !92, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !401, file: !50, line: 118, baseType: !158, size: 64, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !401, file: !50, line: 118, baseType: !158, size: 64, offset: 128)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_vert", scope: !383, file: !50, line: 170, baseType: !407, size: 320)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_vert", file: !50, line: 120, size: 320, elements: !408)
!408 = !{!409, !410, !411, !412, !413}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !407, file: !50, line: 121, baseType: !92, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !407, file: !50, line: 122, baseType: !142, size: 64, offset: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !407, file: !50, line: 122, baseType: !142, size: 64, offset: 128)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !407, file: !50, line: 123, baseType: !158, size: 64, offset: 192)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !407, file: !50, line: 123, baseType: !158, size: 64, offset: 256)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_vert", scope: !383, file: !50, line: 171, baseType: !415, size: 320)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_vert", file: !50, line: 125, size: 320, elements: !416)
!416 = !{!417, !418, !419, !420, !421}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !415, file: !50, line: 126, baseType: !92, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !415, file: !50, line: 127, baseType: !142, size: 64, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !415, file: !50, line: 127, baseType: !142, size: 64, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !415, file: !50, line: 128, baseType: !158, size: 64, offset: 192)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !415, file: !50, line: 128, baseType: !158, size: 64, offset: 256)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_edge", scope: !383, file: !50, line: 172, baseType: !423, size: 192)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_edge", file: !50, line: 130, size: 192, elements: !424)
!424 = !{!425, !426, !427}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !423, file: !50, line: 131, baseType: !158, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !423, file: !50, line: 132, baseType: !142, size: 64, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !423, file: !50, line: 132, baseType: !142, size: 64, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_loop", scope: !383, file: !50, line: 173, baseType: !429, size: 192)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_loop", file: !50, line: 134, size: 192, elements: !430)
!430 = !{!431, !432, !433}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !429, file: !50, line: 135, baseType: !142, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !429, file: !50, line: 136, baseType: !142, size: 64, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !429, file: !50, line: 136, baseType: !142, size: 64, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_edge", scope: !383, file: !50, line: 174, baseType: !435, size: 192)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_edge", file: !50, line: 138, size: 192, elements: !436)
!436 = !{!437, !438, !439}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !435, file: !50, line: 139, baseType: !158, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !435, file: !50, line: 140, baseType: !142, size: 64, offset: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !435, file: !50, line: 140, baseType: !142, size: 64, offset: 128)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_edge", scope: !383, file: !50, line: 175, baseType: !441, size: 64)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_edge", file: !50, line: 142, size: 64, elements: !442)
!442 = !{!443}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !441, file: !50, line: 143, baseType: !158, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_face", scope: !383, file: !50, line: 176, baseType: !445, size: 192)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_face", file: !50, line: 145, size: 192, elements: !446)
!446 = !{!447, !448, !449}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !445, file: !50, line: 146, baseType: !160, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !445, file: !50, line: 147, baseType: !142, size: 64, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !445, file: !50, line: 147, baseType: !142, size: 64, offset: 128)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_face", scope: !383, file: !50, line: 177, baseType: !451, size: 192)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_face", file: !50, line: 149, size: 192, elements: !452)
!452 = !{!453, !454, !455}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !451, file: !50, line: 150, baseType: !160, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !451, file: !50, line: 151, baseType: !142, size: 64, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !451, file: !50, line: 151, baseType: !142, size: 64, offset: 128)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_face", scope: !383, file: !50, line: 178, baseType: !457, size: 192)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_face", file: !50, line: 153, size: 192, elements: !458)
!458 = !{!459, !460, !461}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !457, file: !50, line: 154, baseType: !160, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !457, file: !50, line: 155, baseType: !142, size: 64, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !457, file: !50, line: 155, baseType: !142, size: 64, offset: 128)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !380, file: !50, line: 181, baseType: !84, size: 64, offset: 320)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !380, file: !50, line: 182, baseType: !88, size: 64, offset: 384)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !380, file: !50, line: 184, baseType: !102, size: 32, offset: 448)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !380, file: !50, line: 185, baseType: !104, size: 8, offset: 480)
!466 = !DILocation(line: 61, column: 10, scope: !378)
!467 = !DILocation(line: 62, column: 3, scope: !378)
!468 = !DILocation(line: 63, column: 3, scope: !469)
!469 = distinct !DILexicalBlock(scope: !378, file: !1, line: 63, column: 3)
!470 = !DILocation(line: 63, column: 3, scope: !471)
!471 = distinct !DILexicalBlock(scope: !469, file: !1, line: 63, column: 3)
!472 = !DILocation(line: 64, column: 8, scope: !473)
!473 = distinct !DILexicalBlock(scope: !474, file: !1, line: 64, column: 8)
!474 = distinct !DILexicalBlock(scope: !471, file: !1, line: 63, column: 49)
!475 = !DILocation(line: 64, column: 45, scope: !473)
!476 = !DILocation(line: 64, column: 8, scope: !474)
!477 = !DILocation(line: 65, column: 9, scope: !478)
!478 = distinct !DILexicalBlock(scope: !479, file: !1, line: 65, column: 9)
!479 = distinct !DILexicalBlock(scope: !473, file: !1, line: 64, column: 55)
!480 = !DILocation(line: 65, column: 14, scope: !478)
!481 = !DILocation(line: 65, column: 11, scope: !478)
!482 = !DILocation(line: 65, column: 9, scope: !479)
!483 = !DILocation(line: 66, column: 6, scope: !484)
!484 = distinct !DILexicalBlock(scope: !478, file: !1, line: 65, column: 20)
!485 = !DILocation(line: 69, column: 5, scope: !479)
!486 = !DILocation(line: 70, column: 18, scope: !479)
!487 = !DILocation(line: 70, column: 5, scope: !479)
!488 = !DILocation(line: 70, column: 12, scope: !479)
!489 = !DILocation(line: 70, column: 16, scope: !479)
!490 = !DILocation(line: 71, column: 4, scope: !479)
!491 = !DILocation(line: 72, column: 3, scope: !474)
!492 = distinct !{!492, !468, !493}
!493 = !DILocation(line: 72, column: 3, scope: !469)
!494 = !DILocation(line: 73, column: 2, scope: !378)
!495 = distinct !{!495, !373, !496}
!496 = !DILocation(line: 73, column: 2, scope: !374)
!497 = !DILocation(line: 76, column: 6, scope: !498)
!498 = distinct !DILexicalBlock(scope: !166, file: !1, line: 76, column: 6)
!499 = !DILocation(line: 76, column: 11, scope: !498)
!500 = !DILocation(line: 76, column: 8, scope: !498)
!501 = !DILocation(line: 76, column: 6, scope: !166)
!502 = !DILocation(line: 77, column: 3, scope: !503)
!503 = distinct !DILexicalBlock(scope: !498, file: !1, line: 76, column: 17)
!504 = !DILocation(line: 84, column: 9, scope: !505)
!505 = distinct !DILexicalBlock(scope: !166, file: !1, line: 84, column: 2)
!506 = !DILocation(line: 84, column: 7, scope: !505)
!507 = !DILocation(line: 84, column: 14, scope: !508)
!508 = distinct !DILexicalBlock(scope: !505, file: !1, line: 84, column: 2)
!509 = !DILocation(line: 84, column: 18, scope: !508)
!510 = !DILocation(line: 84, column: 16, scope: !508)
!511 = !DILocation(line: 84, column: 2, scope: !505)
!512 = !DILocation(line: 85, column: 7, scope: !513)
!513 = distinct !DILexicalBlock(scope: !508, file: !1, line: 84, column: 29)
!514 = !DILocation(line: 85, column: 13, scope: !513)
!515 = !DILocation(line: 85, column: 5, scope: !513)
!516 = !DILocation(line: 87, column: 32, scope: !517)
!517 = distinct !DILexicalBlock(scope: !513, file: !1, line: 87, column: 7)
!518 = !DILocation(line: 87, column: 54, scope: !517)
!519 = !DILocation(line: 87, column: 7, scope: !517)
!520 = !DILocation(line: 87, column: 74, scope: !517)
!521 = !DILocation(line: 87, column: 7, scope: !513)
!522 = !DILocation(line: 88, column: 7, scope: !523)
!523 = distinct !DILexicalBlock(scope: !517, file: !1, line: 87, column: 80)
!524 = !DILocation(line: 89, column: 4, scope: !523)
!525 = !DILocation(line: 91, column: 2, scope: !513)
!526 = !DILocation(line: 84, column: 25, scope: !508)
!527 = !DILocation(line: 84, column: 2, scope: !508)
!528 = distinct !{!528, !511, !529}
!529 = !DILocation(line: 91, column: 2, scope: !505)
!530 = !DILocation(line: 93, column: 6, scope: !531)
!531 = distinct !DILexicalBlock(scope: !166, file: !1, line: 93, column: 6)
!532 = !DILocation(line: 93, column: 6, scope: !166)
