; ModuleID = 'blender/source/blender/editors/space_file/file_ops.c'
source_filename = "blender/source/blender/editors/space_file/file_ops.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }

!294 = !DIEnumerator(name: "WM_OP_EXEC_REGION_WIN", value: 7, isUnsigned: true)
!295 = !DIEnumerator(name: "WM_OP_EXEC_REGION_CHANNELS", value: 8, isUnsigned: true)
!296 = !DIEnumerator(name: "WM_OP_EXEC_REGION_PREVIEW", value: 9, isUnsigned: true)
!297 = !DIEnumerator(name: "WM_OP_EXEC_AREA", value: 10, isUnsigned: true)
!298 = !DIEnumerator(name: "WM_OP_EXEC_SCREEN", value: 11, isUnsigned: true)
!299 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !300, line: 361, baseType: !5, size: 32, elements: !301)
!300 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!301 = !{!302, !303, !304, !305, !306, !307, !308, !309}
!302 = !DIEnumerator(name: "RGN_TYPE_WINDOW", value: 0, isUnsigned: true)
!303 = !DIEnumerator(name: "RGN_TYPE_HEADER", value: 1, isUnsigned: true)
!304 = !DIEnumerator(name: "RGN_TYPE_CHANNELS", value: 2, isUnsigned: true)
!305 = !DIEnumerator(name: "RGN_TYPE_TEMPORARY", value: 3, isUnsigned: true)
!306 = !DIEnumerator(name: "RGN_TYPE_UI", value: 4, isUnsigned: true)
!307 = !DIEnumerator(name: "RGN_TYPE_TOOLS", value: 5, isUnsigned: true)
!308 = !DIEnumerator(name: "RGN_TYPE_TOOL_PROPS", value: 6, isUnsigned: true)
!309 = !DIEnumerator(name: "RGN_TYPE_PREVIEW", value: 7, isUnsigned: true)
!310 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FileSelect", file: !1, line: 105, baseType: !5, size: 32, elements: !311)
!311 = !{!312, !313, !314}
!312 = !DIEnumerator(name: "FILE_SELECT_NOTHING", value: 0, isUnsigned: true)
!313 = !DIEnumerator(name: "FILE_SELECT_DIR", value: 1, isUnsigned: true)
!314 = !DIEnumerator(name: "FILE_SELECT_FILE", value: 2, isUnsigned: true)
!315 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 394, baseType: !5, size: 32, elements: !316)
!316 = !{!317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327}
!317 = !DIEnumerator(name: "GESTURE_MODAL_CANCEL", value: 1, isUnsigned: true)
!318 = !DIEnumerator(name: "GESTURE_MODAL_CONFIRM", value: 2, isUnsigned: true)
!319 = !DIEnumerator(name: "GESTURE_MODAL_SELECT", value: 3, isUnsigned: true)
!320 = !DIEnumerator(name: "GESTURE_MODAL_DESELECT", value: 4, isUnsigned: true)
!321 = !DIEnumerator(name: "GESTURE_MODAL_NOP", value: 5, isUnsigned: true)
!322 = !DIEnumerator(name: "GESTURE_MODAL_CIRCLE_ADD", value: 6, isUnsigned: true)
!323 = !DIEnumerator(name: "GESTURE_MODAL_CIRCLE_SUB", value: 7, isUnsigned: true)
!324 = !DIEnumerator(name: "GESTURE_MODAL_BEGIN", value: 8, isUnsigned: true)
!325 = !DIEnumerator(name: "GESTURE_MODAL_IN", value: 9, isUnsigned: true)
!326 = !DIEnumerator(name: "GESTURE_MODAL_OUT", value: 10, isUnsigned: true)
!327 = !DIEnumerator(name: "GESTURE_MODAL_CIRCLE_SIZE", value: 11, isUnsigned: true)
!328 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eDirEntry_SelectFlag", file: !329, line: 700, baseType: !5, size: 32, elements: !330)
!329 = !DIFile(filename: "blender/source/blender/makesdna/DNA_space_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!330 = !{!331, !332, !333}
!331 = !DIEnumerator(name: "HILITED_FILE", value: 4, isUnsigned: true)
!332 = !DIEnumerator(name: "SELECTED_FILE", value: 8, isUnsigned: true)
!333 = !DIEnumerator(name: "EDITING_FILE", value: 16, isUnsigned: true)
!334 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FileSelType", file: !56, line: 51, baseType: !5, size: 32, elements: !335)
!335 = !{!336, !337, !338}
!336 = !DIEnumerator(name: "FILE_SEL_REMOVE", value: 0, isUnsigned: true)
!337 = !DIEnumerator(name: "FILE_SEL_ADD", value: 1, isUnsigned: true)
!338 = !DIEnumerator(name: "FILE_SEL_TOGGLE", value: 2, isUnsigned: true)
!339 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eFileSel_Params_Flag", file: !329, line: 666, baseType: !5, size: 32, elements: !340)
!340 = !{!341, !342, !343, !344, !345, !346, !347, !348, !349, !350}
!341 = !DIEnumerator(name: "FILE_SHOWSHORT", value: 1, isUnsigned: true)
!342 = !DIEnumerator(name: "FILE_RELPATH", value: 2, isUnsigned: true)
!343 = !DIEnumerator(name: "FILE_LINK", value: 4, isUnsigned: true)
!344 = !DIEnumerator(name: "FILE_HIDE_DOT", value: 8, isUnsigned: true)
!345 = !DIEnumerator(name: "FILE_AUTOSELECT", value: 16, isUnsigned: true)
!346 = !DIEnumerator(name: "FILE_ACTIVELAY", value: 32, isUnsigned: true)
!347 = !DIEnumerator(name: "FILE_DIRSEL_ONLY", value: 128, isUnsigned: true)
!348 = !DIEnumerator(name: "FILE_FILTER", value: 256, isUnsigned: true)
!349 = !DIEnumerator(name: "FILE_BOOKMARKS", value: 512, isUnsigned: true)
!350 = !DIEnumerator(name: "FILE_GROUP_INSTANCE", value: 1024, isUnsigned: true)
!351 = !{!352, !353, !354}
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!353 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceFile", file: !329, line: 622, baseType: !356)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceFile", file: !329, line: 595, size: 832, elements: !357)
!357 = !{!358, !381, !382, !383, !384, !385, !419, !422, !424, !425, !1934, !1935, !1957, !1958, !1959, !1960}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !356, file: !329, line: 596, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceLink", file: !329, line: 91, baseType: !361)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !329, line: 85, size: 448, elements: !362)
!362 = !{!363, !365, !366, !373, !374, !376}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !361, file: !329, line: 86, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !361, file: !329, line: 86, baseType: !364, size: 64, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !361, file: !329, line: 87, baseType: !367, size: 128, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !368, line: 71, baseType: !369)
!368 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !368, line: 69, size: 128, elements: !370)
!370 = !{!371, !372}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !369, file: !368, line: 70, baseType: !352, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !369, file: !368, line: 70, baseType: !352, size: 64, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !361, file: !329, line: 88, baseType: !353, size: 32, offset: 256)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !361, file: !329, line: 89, baseType: !375, size: 32, offset: 288)
!375 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !361, file: !329, line: 90, baseType: !377, size: 128, offset: 320)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !378, size: 128, elements: !379)
!378 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!379 = !{!380}
!380 = !DISubrange(count: 8)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !356, file: !329, line: 596, baseType: !359, size: 64, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !356, file: !329, line: 597, baseType: !367, size: 128, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !356, file: !329, line: 598, baseType: !353, size: 32, offset: 256)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_offset", scope: !356, file: !329, line: 600, baseType: !353, size: 32, offset: 288)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !356, file: !329, line: 602, baseType: !386, size: 64, offset: 320)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FileSelectParams", file: !329, line: 566, size: 16128, elements: !388)
!388 = !{!389, !394, !398, !402, !403, !404, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !387, file: !329, line: 567, baseType: !390, size: 768)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !391, size: 768, elements: !392)
!391 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!392 = !{!393}
!393 = !DISubrange(count: 96)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !387, file: !329, line: 568, baseType: !395, size: 8448, offset: 768)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !391, size: 8448, elements: !396)
!396 = !{!397}
!397 = !DISubrange(count: 1056)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !387, file: !329, line: 570, baseType: !399, size: 2048, offset: 9216)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !391, size: 2048, elements: !400)
!400 = !{!401}
!401 = !DISubrange(count: 256)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "renamefile", scope: !387, file: !329, line: 571, baseType: !399, size: 2048, offset: 11264)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "renameedit", scope: !387, file: !329, line: 572, baseType: !399, size: 2048, offset: 13312)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "filter_glob", scope: !387, file: !329, line: 574, baseType: !405, size: 512, offset: 15360)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !391, size: 512, elements: !406)
!406 = !{!407}
!407 = !DISubrange(count: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "active_file", scope: !387, file: !329, line: 576, baseType: !353, size: 32, offset: 15872)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "sel_first", scope: !387, file: !329, line: 577, baseType: !353, size: 32, offset: 15904)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "sel_last", scope: !387, file: !329, line: 578, baseType: !353, size: 32, offset: 15936)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !387, file: !329, line: 581, baseType: !378, size: 16, offset: 15968)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !387, file: !329, line: 582, baseType: !378, size: 16, offset: 15984)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "sort", scope: !387, file: !329, line: 583, baseType: !378, size: 16, offset: 16000)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "display", scope: !387, file: !329, line: 584, baseType: !378, size: 16, offset: 16016)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !387, file: !329, line: 585, baseType: !378, size: 16, offset: 16032)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "f_fp", scope: !387, file: !329, line: 588, baseType: !378, size: 16, offset: 16048)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "fp_str", scope: !387, file: !329, line: 589, baseType: !418, size: 64, offset: 16064)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !391, size: 64, elements: !379)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !356, file: !329, line: 604, baseType: !420, size: 64, offset: 384)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileList", file: !329, line: 62, flags: DIFlagFwdDecl)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "folders_prev", scope: !356, file: !329, line: 606, baseType: !423, size: 64, offset: 448)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "folders_next", scope: !356, file: !329, line: 607, baseType: !423, size: 64, offset: 512)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !356, file: !329, line: 614, baseType: !426, size: 64, offset: 576)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !47, line: 328, size: 1344, elements: !428)
!428 = !{!429, !430, !431, !432, !456, !608, !609, !610, !611, !1926, !1927, !1928, !1932, !1933}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !427, file: !47, line: 329, baseType: !426, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !427, file: !47, line: 329, baseType: !426, size: 64, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !427, file: !47, line: 332, baseType: !405, size: 512, offset: 128)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !427, file: !47, line: 333, baseType: !433, size: 64, offset: 640)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !435, line: 75, baseType: !436)
!435 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !435, line: 62, size: 1024, elements: !437)
!437 = !{!438, !440, !441, !442, !443, !444, !445, !446, !454, !455}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !436, file: !435, line: 63, baseType: !439, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !436, file: !435, line: 63, baseType: !439, size: 64, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !436, file: !435, line: 64, baseType: !391, size: 8, offset: 128)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !436, file: !435, line: 64, baseType: !391, size: 8, offset: 136)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !436, file: !435, line: 65, baseType: !378, size: 16, offset: 144)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !436, file: !435, line: 66, baseType: !405, size: 512, offset: 160)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !436, file: !435, line: 67, baseType: !353, size: 32, offset: 672)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !436, file: !435, line: 69, baseType: !447, size: 256, offset: 704)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !435, line: 60, baseType: !448)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !435, line: 48, size: 256, elements: !449)
!449 = !{!450, !451, !452, !453}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !448, file: !435, line: 49, baseType: !352, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !448, file: !435, line: 58, baseType: !367, size: 128, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !448, file: !435, line: 59, baseType: !353, size: 32, offset: 192)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !448, file: !435, line: 59, baseType: !353, size: 32, offset: 224)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !436, file: !435, line: 70, baseType: !353, size: 32, offset: 960)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !436, file: !435, line: 74, baseType: !353, size: 32, offset: 992)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !427, file: !47, line: 336, baseType: !457, size: 64, offset: 704)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !285, line: 508, size: 1536, elements: !459)
!459 = !{!460, !463, !464, !465, !466, !473, !478, !530, !534, !535, !539, !540, !543, !544, !548, !549, !564, !565, !569, !607}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !458, file: !285, line: 509, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !391)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !458, file: !285, line: 510, baseType: !461, size: 64, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !458, file: !285, line: 511, baseType: !461, size: 64, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !458, file: !285, line: 512, baseType: !461, size: 64, offset: 192)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !458, file: !285, line: 518, baseType: !467, size: 64, offset: 256)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DISubroutineType(types: !469)
!469 = !{!353, !470, !426}
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !472, line: 48, flags: DIFlagFwdDecl)
!472 = !DIFile(filename: "blender/source/blender/blenloader/BLO_readfile.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!473 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !458, file: !285, line: 524, baseType: !474, size: 64, offset: 320)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DISubroutineType(types: !476)
!476 = !{!477, !470, !426}
!477 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "invoke", scope: !458, file: !285, line: 530, baseType: !479, size: 64, offset: 384)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DISubroutineType(types: !481)
!481 = !{!353, !470, !426, !482}
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !484)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmEvent", file: !285, line: 421, size: 960, elements: !485)
!485 = !{!486, !488, !489, !490, !491, !492, !493, !497, !501, !502, !503, !504, !505, !506, !507, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !526, !527, !528, !529}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !484, file: !285, line: 422, baseType: !487, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !484, file: !285, line: 422, baseType: !487, size: 64, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !484, file: !285, line: 424, baseType: !378, size: 16, offset: 128)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !484, file: !285, line: 425, baseType: !378, size: 16, offset: 144)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !484, file: !285, line: 426, baseType: !353, size: 32, offset: 160)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !484, file: !285, line: 426, baseType: !353, size: 32, offset: 192)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "mval", scope: !484, file: !285, line: 427, baseType: !494, size: 64, offset: 224)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !353, size: 64, elements: !495)
!495 = !{!496}
!496 = !DISubrange(count: 2)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_buf", scope: !484, file: !285, line: 428, baseType: !498, size: 48, offset: 288)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !391, size: 48, elements: !499)
!499 = !{!500}
!500 = !DISubrange(count: 6)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !484, file: !285, line: 431, baseType: !391, size: 8, offset: 336)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !484, file: !285, line: 432, baseType: !391, size: 8, offset: 344)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "prevtype", scope: !484, file: !285, line: 435, baseType: !378, size: 16, offset: 352)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "prevval", scope: !484, file: !285, line: 436, baseType: !378, size: 16, offset: 368)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "prevx", scope: !484, file: !285, line: 437, baseType: !353, size: 32, offset: 384)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "prevy", scope: !484, file: !285, line: 437, baseType: !353, size: 32, offset: 416)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicktime", scope: !484, file: !285, line: 438, baseType: !508, size: 64, offset: 448)
!508 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "prevclickx", scope: !484, file: !285, line: 439, baseType: !353, size: 32, offset: 512)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicky", scope: !484, file: !285, line: 439, baseType: !353, size: 32, offset: 544)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !484, file: !285, line: 442, baseType: !378, size: 16, offset: 576)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !484, file: !285, line: 442, baseType: !378, size: 16, offset: 592)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !484, file: !285, line: 442, baseType: !378, size: 16, offset: 608)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "oskey", scope: !484, file: !285, line: 442, baseType: !378, size: 16, offset: 624)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "keymodifier", scope: !484, file: !285, line: 443, baseType: !378, size: 16, offset: 640)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "check_click", scope: !484, file: !285, line: 446, baseType: !378, size: 16, offset: 656)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "keymap_idname", scope: !484, file: !285, line: 449, baseType: !461, size: 64, offset: 704)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "tablet_data", scope: !484, file: !285, line: 452, baseType: !519, size: 64, offset: 768)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTabletData", file: !285, line: 463, size: 128, elements: !521)
!521 = !{!522, !523, !524, !525}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "Active", scope: !520, file: !285, line: 464, baseType: !353, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "Pressure", scope: !520, file: !285, line: 465, baseType: !375, size: 32, offset: 32)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "Xtilt", scope: !520, file: !285, line: 466, baseType: !375, size: 32, offset: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "Ytilt", scope: !520, file: !285, line: 467, baseType: !375, size: 32, offset: 96)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "custom", scope: !484, file: !285, line: 455, baseType: !378, size: 16, offset: 832)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "customdatafree", scope: !484, file: !285, line: 456, baseType: !378, size: 16, offset: 848)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !484, file: !285, line: 457, baseType: !353, size: 32, offset: 864)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !484, file: !285, line: 458, baseType: !352, size: 64, offset: 896)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "cancel", scope: !458, file: !285, line: 531, baseType: !531, size: 64, offset: 448)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DISubroutineType(types: !533)
!533 = !{null, !470, !426}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "modal", scope: !458, file: !285, line: 532, baseType: !479, size: 64, offset: 512)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !458, file: !285, line: 536, baseType: !536, size: 64, offset: 576)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DISubroutineType(types: !538)
!538 = !{!353, !470}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "ui", scope: !458, file: !285, line: 539, baseType: !531, size: 64, offset: 640)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !458, file: !285, line: 542, baseType: !541, size: 64, offset: 704)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !4, line: 41, flags: DIFlagFwdDecl)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "last_properties", scope: !458, file: !285, line: 545, baseType: !439, size: 64, offset: 768)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !458, file: !285, line: 549, baseType: !545, size: 64, offset: 832)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyRNA", file: !4, line: 333, baseType: !547)
!547 = !DICompositeType(tag: DW_TAG_structure_type, name: "PropertyRNA", file: !4, line: 39, flags: DIFlagFwdDecl)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !458, file: !285, line: 552, baseType: !367, size: 128, offset: 896)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "modalkeymap", scope: !458, file: !285, line: 555, baseType: !550, size: 64, offset: 1024)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmKeyMap", file: !47, line: 281, size: 1088, elements: !552)
!552 = !{!553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !551, file: !47, line: 282, baseType: !550, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !551, file: !47, line: 282, baseType: !550, size: 64, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !551, file: !47, line: 284, baseType: !367, size: 128, offset: 128)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "diff_items", scope: !551, file: !47, line: 285, baseType: !367, size: 128, offset: 256)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !551, file: !47, line: 287, baseType: !405, size: 512, offset: 384)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "spaceid", scope: !551, file: !47, line: 288, baseType: !378, size: 16, offset: 896)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "regionid", scope: !551, file: !47, line: 289, baseType: !378, size: 16, offset: 912)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !551, file: !47, line: 291, baseType: !378, size: 16, offset: 928)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "kmi_id", scope: !551, file: !47, line: 292, baseType: !378, size: 16, offset: 944)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !551, file: !47, line: 295, baseType: !536, size: 64, offset: 960)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "modal_items", scope: !551, file: !47, line: 296, baseType: !352, size: 64, offset: 1024)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "pyop_data", scope: !458, file: !285, line: 559, baseType: !352, size: 64, offset: 1088)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "pyop_poll", scope: !458, file: !285, line: 560, baseType: !566, size: 64, offset: 1152)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{!353, !470, !457}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !458, file: !285, line: 563, baseType: !570, size: 256, offset: 1216)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !4, line: 436, baseType: !571)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !4, line: 430, size: 256, elements: !572)
!572 = !{!573, !574, !577, !602}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !571, file: !4, line: 431, baseType: !352, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !571, file: !4, line: 432, baseType: !575, size: 64, offset: 64)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !4, line: 417, baseType: !542)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !571, file: !4, line: 433, baseType: !578, size: 64, offset: 128)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !4, line: 408, baseType: !579)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DISubroutineType(types: !581)
!581 = !{!353, !470, !582, !591, !593}
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !4, line: 55, size: 192, elements: !584)
!584 = !{!585, !589, !590}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !583, file: !4, line: 58, baseType: !586, size: 64)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !583, file: !4, line: 56, size: 64, elements: !587)
!587 = !{!588}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !586, file: !4, line: 57, baseType: !352, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !583, file: !4, line: 60, baseType: !541, size: 64, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !583, file: !4, line: 61, baseType: !352, size: 64, offset: 128)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !4, line: 38, flags: DIFlagFwdDecl)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !4, line: 348, baseType: !595)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !4, line: 337, size: 256, elements: !596)
!596 = !{!597, !598, !599, !600, !601}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !595, file: !4, line: 339, baseType: !352, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !595, file: !4, line: 342, baseType: !591, size: 64, offset: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !595, file: !4, line: 345, baseType: !353, size: 32, offset: 128)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !595, file: !4, line: 347, baseType: !353, size: 32, offset: 160)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !595, file: !4, line: 347, baseType: !353, size: 32, offset: 192)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !571, file: !4, line: 434, baseType: !603, size: 64, offset: 192)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !4, line: 409, baseType: !604)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{null, !352}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !458, file: !285, line: 566, baseType: !378, size: 16, offset: 1472)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !427, file: !47, line: 337, baseType: !352, size: 64, offset: 768)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !427, file: !47, line: 338, baseType: !352, size: 64, offset: 832)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !427, file: !47, line: 340, baseType: !582, size: 64, offset: 896)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !427, file: !47, line: 341, baseType: !612, size: 64, offset: 960)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !47, line: 106, size: 320, elements: !614)
!614 = !{!615, !616, !617, !618, !619, !620}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !613, file: !47, line: 107, baseType: !367, size: 128)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !613, file: !47, line: 108, baseType: !353, size: 32, offset: 128)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !613, file: !47, line: 109, baseType: !353, size: 32, offset: 160)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !613, file: !47, line: 110, baseType: !353, size: 32, offset: 192)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !613, file: !47, line: 110, baseType: !353, size: 32, offset: 224)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !613, file: !47, line: 111, baseType: !621, size: 64, offset: 256)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !285, line: 490, size: 768, elements: !623)
!623 = !{!624, !625, !626, !1917, !1918, !1919, !1920, !1921, !1922, !1923, !1924, !1925}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !622, file: !285, line: 491, baseType: !621, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !622, file: !285, line: 491, baseType: !621, size: 64, offset: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !622, file: !285, line: 493, baseType: !627, size: 64, offset: 128)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !47, line: 169, size: 2048, elements: !629)
!629 = !{!630, !631, !632, !633, !1874, !1875, !1876, !1877, !1878, !1879, !1880, !1881, !1882, !1883, !1884, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1892, !1895, !1909, !1910, !1911, !1912, !1913, !1914, !1915, !1916}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !628, file: !47, line: 170, baseType: !627, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !628, file: !47, line: 170, baseType: !627, size: 64, offset: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !628, file: !47, line: 172, baseType: !352, size: 64, offset: 128)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !628, file: !47, line: 174, baseType: !634, size: 64, offset: 192)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !300, line: 49, size: 1984, elements: !636)
!636 = !{!637, !673, !674, !675, !676, !677, !1857, !1858, !1859, !1860, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1872, !1873}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !635, file: !300, line: 50, baseType: !638, size: 960)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !435, line: 130, baseType: !639)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !435, line: 117, size: 960, elements: !640)
!640 = !{!641, !642, !643, !645, !664, !668, !669, !670, !671, !672}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !639, file: !435, line: 118, baseType: !352, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !639, file: !435, line: 118, baseType: !352, size: 64, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !639, file: !435, line: 119, baseType: !644, size: 64, offset: 128)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !639, file: !435, line: 120, baseType: !646, size: 64, offset: 192)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !435, line: 136, size: 17600, elements: !648)
!648 = !{!649, !650, !652, !655, !659, !660, !661}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !647, file: !435, line: 137, baseType: !638, size: 960)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !647, file: !435, line: 138, baseType: !651, size: 64, offset: 960)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !647, file: !435, line: 139, baseType: !653, size: 64, offset: 1024)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !472, line: 50, flags: DIFlagFwdDecl)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !647, file: !435, line: 140, baseType: !656, size: 8192, offset: 1088)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !391, size: 8192, elements: !657)
!657 = !{!658}
!658 = !DISubrange(count: 1024)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !647, file: !435, line: 141, baseType: !656, size: 8192, offset: 9280)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !647, file: !435, line: 148, baseType: !646, size: 64, offset: 17472)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !647, file: !435, line: 150, baseType: !662, size: 64, offset: 17536)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !435, line: 45, flags: DIFlagFwdDecl)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !639, file: !435, line: 121, baseType: !665, size: 528, offset: 256)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !391, size: 528, elements: !666)
!666 = !{!667}
!667 = !DISubrange(count: 66)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !639, file: !435, line: 126, baseType: !378, size: 16, offset: 784)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !639, file: !435, line: 127, baseType: !353, size: 32, offset: 800)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !639, file: !435, line: 128, baseType: !353, size: 32, offset: 832)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !639, file: !435, line: 128, baseType: !353, size: 32, offset: 864)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !639, file: !435, line: 129, baseType: !433, size: 64, offset: 896)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !635, file: !300, line: 52, baseType: !367, size: 128, offset: 960)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !635, file: !300, line: 53, baseType: !367, size: 128, offset: 1088)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !635, file: !300, line: 54, baseType: !367, size: 128, offset: 1216)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !635, file: !300, line: 55, baseType: !367, size: 128, offset: 1344)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !635, file: !300, line: 57, baseType: !678, size: 64, offset: 1472)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !680, line: 1216, size: 39680, elements: !681)
!680 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!681 = !{!682, !683, !687, !691, !694, !695, !696, !708, !709, !713, !714, !715, !716, !717, !718, !719, !720, !721, !725, !798, !1226, !1439, !1442, !1727, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1749, !1750, !1751, !1752, !1753, !1761, !1828, !1835, !1836, !1843, !1844, !1850, !1851, !1852, !1853, !1854}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !679, file: !680, line: 1217, baseType: !638, size: 960)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !679, file: !680, line: 1218, baseType: !684, size: 64, offset: 960)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !686, line: 43, flags: DIFlagFwdDecl)
!686 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!687 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !679, file: !680, line: 1220, baseType: !688, size: 64, offset: 1024)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !690, line: 44, flags: DIFlagFwdDecl)
!690 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!691 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !679, file: !680, line: 1221, baseType: !692, size: 64, offset: 1088)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !680, line: 52, flags: DIFlagFwdDecl)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !679, file: !680, line: 1223, baseType: !678, size: 64, offset: 1152)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !679, file: !680, line: 1225, baseType: !367, size: 128, offset: 1216)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !679, file: !680, line: 1226, baseType: !697, size: 64, offset: 1344)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !680, line: 69, size: 320, elements: !699)
!699 = !{!700, !701, !702, !703, !704, !705, !706, !707}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !698, file: !680, line: 70, baseType: !697, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !698, file: !680, line: 70, baseType: !697, size: 64, offset: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !698, file: !680, line: 71, baseType: !5, size: 32, offset: 128)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !698, file: !680, line: 71, baseType: !5, size: 32, offset: 160)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !698, file: !680, line: 72, baseType: !353, size: 32, offset: 192)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !698, file: !680, line: 73, baseType: !378, size: 16, offset: 224)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !698, file: !680, line: 73, baseType: !378, size: 16, offset: 240)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !698, file: !680, line: 74, baseType: !688, size: 64, offset: 256)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !679, file: !680, line: 1227, baseType: !688, size: 64, offset: 1408)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !679, file: !680, line: 1229, baseType: !710, size: 96, offset: 1472)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !375, size: 96, elements: !711)
!711 = !{!712}
!712 = !DISubrange(count: 3)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !679, file: !680, line: 1230, baseType: !710, size: 96, offset: 1568)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !679, file: !680, line: 1231, baseType: !710, size: 96, offset: 1664)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !679, file: !680, line: 1231, baseType: !710, size: 96, offset: 1760)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !679, file: !680, line: 1233, baseType: !5, size: 32, offset: 1856)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !679, file: !680, line: 1234, baseType: !353, size: 32, offset: 1888)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !679, file: !680, line: 1235, baseType: !5, size: 32, offset: 1920)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !679, file: !680, line: 1237, baseType: !378, size: 16, offset: 1952)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !679, file: !680, line: 1239, baseType: !391, size: 8, offset: 1968)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !679, file: !680, line: 1240, baseType: !722, size: 8, offset: 1976)
!722 = !DICompositeType(tag: DW_TAG_array_type, baseType: !391, size: 8, elements: !723)
!723 = !{!724}
!724 = !DISubrange(count: 1)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !679, file: !680, line: 1242, baseType: !726, size: 64, offset: 1984)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !728, line: 328, size: 3456, elements: !729)
!728 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!729 = !{!730, !731, !732, !735, !736, !737, !741, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !766, !767, !768, !771, !776, !777, !780, !784, !789, !793, !794, !795, !796, !797}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !727, file: !728, line: 329, baseType: !638, size: 960)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !727, file: !728, line: 330, baseType: !684, size: 64, offset: 960)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !727, file: !728, line: 332, baseType: !733, size: 64, offset: 1024)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !728, line: 332, flags: DIFlagFwdDecl)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !727, file: !728, line: 333, baseType: !405, size: 512, offset: 1088)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !727, file: !728, line: 335, baseType: !541, size: 64, offset: 1600)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !727, file: !728, line: 337, baseType: !738, size: 64, offset: 1664)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !740, line: 45, flags: DIFlagFwdDecl)
!740 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!741 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !727, file: !728, line: 338, baseType: !742, size: 64, offset: 1728)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !375, size: 64, elements: !495)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !727, file: !728, line: 340, baseType: !367, size: 128, offset: 1792)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !727, file: !728, line: 340, baseType: !367, size: 128, offset: 1920)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !727, file: !728, line: 342, baseType: !353, size: 32, offset: 2048)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !727, file: !728, line: 342, baseType: !353, size: 32, offset: 2080)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !727, file: !728, line: 343, baseType: !353, size: 32, offset: 2112)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !727, file: !728, line: 345, baseType: !353, size: 32, offset: 2144)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !727, file: !728, line: 346, baseType: !353, size: 32, offset: 2176)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !727, file: !728, line: 347, baseType: !378, size: 16, offset: 2208)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !727, file: !728, line: 348, baseType: !378, size: 16, offset: 2224)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !727, file: !728, line: 349, baseType: !353, size: 32, offset: 2240)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !727, file: !728, line: 351, baseType: !353, size: 32, offset: 2272)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !727, file: !728, line: 353, baseType: !378, size: 16, offset: 2304)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !727, file: !728, line: 354, baseType: !378, size: 16, offset: 2320)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !727, file: !728, line: 355, baseType: !353, size: 32, offset: 2336)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !727, file: !728, line: 357, baseType: !758, size: 128, offset: 2368)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !759, line: 95, baseType: !760)
!759 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !759, line: 92, size: 128, elements: !761)
!761 = !{!762, !763, !764, !765}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !760, file: !759, line: 93, baseType: !375, size: 32)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !760, file: !759, line: 93, baseType: !375, size: 32, offset: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !760, file: !759, line: 94, baseType: !375, size: 32, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !760, file: !759, line: 94, baseType: !375, size: 32, offset: 96)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !727, file: !728, line: 363, baseType: !367, size: 128, offset: 2496)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !727, file: !728, line: 363, baseType: !367, size: 128, offset: 2624)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !727, file: !728, line: 368, baseType: !769, size: 64, offset: 2752)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !728, line: 48, flags: DIFlagFwdDecl)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !727, file: !728, line: 372, baseType: !772, size: 32, offset: 2816)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !728, line: 274, baseType: !773)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !728, line: 271, size: 32, elements: !774)
!774 = !{!775}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !773, file: !728, line: 273, baseType: !5, size: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !727, file: !728, line: 373, baseType: !353, size: 32, offset: 2848)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !727, file: !728, line: 382, baseType: !778, size: 64, offset: 2880)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !728, line: 46, flags: DIFlagFwdDecl)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !727, file: !728, line: 385, baseType: !781, size: 64, offset: 2944)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DISubroutineType(types: !783)
!783 = !{null, !352, !375}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !727, file: !728, line: 386, baseType: !785, size: 64, offset: 3008)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DISubroutineType(types: !787)
!787 = !{null, !352, !788}
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !727, file: !728, line: 387, baseType: !790, size: 64, offset: 3072)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DISubroutineType(types: !792)
!792 = !{!353, !352}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !727, file: !728, line: 388, baseType: !604, size: 64, offset: 3136)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !727, file: !728, line: 389, baseType: !352, size: 64, offset: 3200)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !727, file: !728, line: 389, baseType: !352, size: 64, offset: 3264)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !727, file: !728, line: 389, baseType: !352, size: 64, offset: 3328)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !727, file: !728, line: 389, baseType: !352, size: 64, offset: 3392)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !679, file: !680, line: 1244, baseType: !799, size: 64, offset: 2048)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !801, line: 200, size: 17024, elements: !802)
!801 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!802 = !{!803, !804, !805, !806, !1219, !1220, !1221, !1222, !1223, !1224, !1225}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !800, file: !801, line: 201, baseType: !423, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !800, file: !801, line: 202, baseType: !367, size: 128, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !800, file: !801, line: 203, baseType: !367, size: 128, offset: 192)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !800, file: !801, line: 206, baseType: !807, size: 64, offset: 320)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !801, line: 190, baseType: !809)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !801, line: 126, size: 2816, elements: !810)
!810 = !{!811, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !907, !910, !911, !912, !1191, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1218}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !809, file: !801, line: 127, baseType: !812, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !809, file: !801, line: 127, baseType: !812, size: 64, offset: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !809, file: !801, line: 128, baseType: !352, size: 64, offset: 128)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !809, file: !801, line: 129, baseType: !352, size: 64, offset: 192)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !809, file: !801, line: 130, baseType: !405, size: 512, offset: 256)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !809, file: !801, line: 132, baseType: !353, size: 32, offset: 768)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !809, file: !801, line: 132, baseType: !353, size: 32, offset: 800)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !809, file: !801, line: 133, baseType: !353, size: 32, offset: 832)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !809, file: !801, line: 134, baseType: !353, size: 32, offset: 864)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !809, file: !801, line: 134, baseType: !353, size: 32, offset: 896)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !809, file: !801, line: 134, baseType: !353, size: 32, offset: 928)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !809, file: !801, line: 135, baseType: !353, size: 32, offset: 960)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !809, file: !801, line: 135, baseType: !353, size: 32, offset: 992)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !809, file: !801, line: 136, baseType: !353, size: 32, offset: 1024)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !809, file: !801, line: 136, baseType: !353, size: 32, offset: 1056)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !809, file: !801, line: 137, baseType: !353, size: 32, offset: 1088)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !809, file: !801, line: 137, baseType: !353, size: 32, offset: 1120)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !809, file: !801, line: 138, baseType: !375, size: 32, offset: 1152)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !809, file: !801, line: 139, baseType: !375, size: 32, offset: 1184)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !809, file: !801, line: 139, baseType: !375, size: 32, offset: 1216)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !809, file: !801, line: 141, baseType: !378, size: 16, offset: 1248)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !809, file: !801, line: 142, baseType: !378, size: 16, offset: 1264)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !809, file: !801, line: 143, baseType: !353, size: 32, offset: 1280)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !809, file: !801, line: 144, baseType: !353, size: 32, offset: 1312)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !809, file: !801, line: 146, baseType: !837, size: 64, offset: 1344)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !801, line: 114, baseType: !839)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !801, line: 99, size: 7232, elements: !840)
!840 = !{!841, !843, !844, !845, !846, !847, !848, !856, !860, !875, !884, !891, !901}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !839, file: !801, line: 100, baseType: !842, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !839, file: !801, line: 100, baseType: !842, size: 64, offset: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !839, file: !801, line: 101, baseType: !353, size: 32, offset: 128)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !839, file: !801, line: 101, baseType: !353, size: 32, offset: 160)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !839, file: !801, line: 102, baseType: !353, size: 32, offset: 192)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !839, file: !801, line: 102, baseType: !353, size: 32, offset: 224)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !839, file: !801, line: 103, baseType: !849, size: 64, offset: 256)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !801, line: 59, baseType: !851)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !801, line: 56, size: 2112, elements: !852)
!852 = !{!853, !854, !855}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !851, file: !801, line: 57, baseType: !399, size: 2048)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !851, file: !801, line: 58, baseType: !353, size: 32, offset: 2048)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !851, file: !801, line: 58, baseType: !353, size: 32, offset: 2080)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !839, file: !801, line: 106, baseType: !857, size: 6144, offset: 320)
!857 = !DICompositeType(tag: DW_TAG_array_type, baseType: !391, size: 6144, elements: !858)
!858 = !{!859}
!859 = !DISubrange(count: 768)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !839, file: !801, line: 107, baseType: !861, size: 64, offset: 6464)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !801, line: 97, baseType: !863)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !801, line: 83, size: 8320, elements: !864)
!864 = !{!865, !866, !867, !871, !872, !873, !874}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !863, file: !801, line: 84, baseType: !857, size: 6144)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !863, file: !801, line: 87, baseType: !399, size: 2048, offset: 6144)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !863, file: !801, line: 88, baseType: !868, size: 64, offset: 8192)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !870, line: 41, flags: DIFlagFwdDecl)
!870 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!871 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !863, file: !801, line: 90, baseType: !378, size: 16, offset: 8256)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !863, file: !801, line: 92, baseType: !378, size: 16, offset: 8272)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !863, file: !801, line: 93, baseType: !378, size: 16, offset: 8288)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !863, file: !801, line: 95, baseType: !378, size: 16, offset: 8304)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !839, file: !801, line: 108, baseType: !876, size: 64, offset: 6528)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !801, line: 66, baseType: !878)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !801, line: 61, size: 128, elements: !879)
!879 = !{!880, !881, !882, !883}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !878, file: !801, line: 62, baseType: !353, size: 32)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !878, file: !801, line: 63, baseType: !353, size: 32, offset: 32)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !878, file: !801, line: 64, baseType: !353, size: 32, offset: 64)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !878, file: !801, line: 65, baseType: !353, size: 32, offset: 96)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !839, file: !801, line: 109, baseType: !885, size: 64, offset: 6592)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !801, line: 71, baseType: !887)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !801, line: 68, size: 64, elements: !888)
!888 = !{!889, !890}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !887, file: !801, line: 69, baseType: !353, size: 32)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !887, file: !801, line: 70, baseType: !353, size: 32, offset: 32)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !839, file: !801, line: 110, baseType: !892, size: 64, offset: 6656)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !801, line: 81, baseType: !894)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !801, line: 73, size: 352, elements: !895)
!895 = !{!896, !897, !898, !899, !900}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !894, file: !801, line: 74, baseType: !710, size: 96)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !894, file: !801, line: 75, baseType: !710, size: 96, offset: 96)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !894, file: !801, line: 76, baseType: !710, size: 96, offset: 192)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !894, file: !801, line: 77, baseType: !353, size: 32, offset: 288)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !894, file: !801, line: 78, baseType: !353, size: 32, offset: 320)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !839, file: !801, line: 113, baseType: !902, size: 512, offset: 6720)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !903, line: 182, baseType: !904)
!903 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !903, line: 180, size: 512, elements: !905)
!905 = !{!906}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !904, file: !903, line: 181, baseType: !405, size: 512)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !809, file: !801, line: 148, baseType: !908, size: 64, offset: 1408)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !801, line: 49, flags: DIFlagFwdDecl)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !809, file: !801, line: 151, baseType: !678, size: 64, offset: 1472)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !809, file: !801, line: 152, baseType: !688, size: 64, offset: 1536)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !809, file: !801, line: 153, baseType: !913, size: 64, offset: 1600)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !686, line: 64, size: 19136, elements: !915)
!915 = !{!916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !928, !929, !1177, !1178, !1186, !1187, !1188, !1189, !1190}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !914, file: !686, line: 65, baseType: !638, size: 960)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !914, file: !686, line: 66, baseType: !684, size: 64, offset: 960)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !914, file: !686, line: 68, baseType: !656, size: 8192, offset: 1024)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !914, file: !686, line: 70, baseType: !353, size: 32, offset: 9216)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !914, file: !686, line: 71, baseType: !353, size: 32, offset: 9248)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !914, file: !686, line: 72, baseType: !494, size: 64, offset: 9280)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !914, file: !686, line: 74, baseType: !375, size: 32, offset: 9344)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !914, file: !686, line: 74, baseType: !375, size: 32, offset: 9376)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !914, file: !686, line: 76, baseType: !868, size: 64, offset: 9408)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !914, file: !686, line: 77, baseType: !926, size: 64, offset: 9472)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !686, line: 77, flags: DIFlagFwdDecl)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !914, file: !686, line: 78, baseType: !738, size: 64, offset: 9536)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !914, file: !686, line: 80, baseType: !930, size: 2624, offset: 9600)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !740, line: 340, size: 2624, elements: !931)
!931 = !{!932, !960, !978, !979, !980, !998, !1056, !1057, !1157, !1158, !1159, !1160, !1166}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !930, file: !740, line: 341, baseType: !933, size: 576)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !740, line: 251, baseType: !934)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !740, line: 207, size: 576, elements: !935)
!935 = !{!936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !934, file: !740, line: 208, baseType: !353, size: 32)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !934, file: !740, line: 211, baseType: !378, size: 16, offset: 32)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !934, file: !740, line: 212, baseType: !378, size: 16, offset: 48)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !934, file: !740, line: 213, baseType: !375, size: 32, offset: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !934, file: !740, line: 214, baseType: !378, size: 16, offset: 96)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !934, file: !740, line: 215, baseType: !378, size: 16, offset: 112)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !934, file: !740, line: 216, baseType: !378, size: 16, offset: 128)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !934, file: !740, line: 217, baseType: !378, size: 16, offset: 144)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !934, file: !740, line: 218, baseType: !378, size: 16, offset: 160)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !934, file: !740, line: 219, baseType: !378, size: 16, offset: 176)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !934, file: !740, line: 220, baseType: !375, size: 32, offset: 192)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !934, file: !740, line: 222, baseType: !378, size: 16, offset: 224)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !934, file: !740, line: 225, baseType: !378, size: 16, offset: 240)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !934, file: !740, line: 228, baseType: !353, size: 32, offset: 256)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !934, file: !740, line: 229, baseType: !353, size: 32, offset: 288)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !934, file: !740, line: 233, baseType: !353, size: 32, offset: 320)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !934, file: !740, line: 236, baseType: !378, size: 16, offset: 352)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !934, file: !740, line: 236, baseType: !378, size: 16, offset: 368)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !934, file: !740, line: 241, baseType: !375, size: 32, offset: 384)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !934, file: !740, line: 244, baseType: !353, size: 32, offset: 416)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !934, file: !740, line: 244, baseType: !353, size: 32, offset: 448)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !934, file: !740, line: 245, baseType: !375, size: 32, offset: 480)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !934, file: !740, line: 248, baseType: !375, size: 32, offset: 512)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !934, file: !740, line: 250, baseType: !353, size: 32, offset: 544)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !930, file: !740, line: 342, baseType: !961, size: 448, offset: 576)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !740, line: 79, baseType: !962)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !740, line: 61, size: 448, elements: !963)
!963 = !{!964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !962, file: !740, line: 62, baseType: !352, size: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !962, file: !740, line: 64, baseType: !378, size: 16, offset: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !962, file: !740, line: 65, baseType: !378, size: 16, offset: 80)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !962, file: !740, line: 67, baseType: !375, size: 32, offset: 96)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !962, file: !740, line: 68, baseType: !375, size: 32, offset: 128)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !962, file: !740, line: 69, baseType: !375, size: 32, offset: 160)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !962, file: !740, line: 70, baseType: !378, size: 16, offset: 192)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !962, file: !740, line: 71, baseType: !378, size: 16, offset: 208)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !962, file: !740, line: 72, baseType: !742, size: 64, offset: 224)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !962, file: !740, line: 75, baseType: !375, size: 32, offset: 288)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !962, file: !740, line: 75, baseType: !375, size: 32, offset: 320)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !962, file: !740, line: 75, baseType: !375, size: 32, offset: 352)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !962, file: !740, line: 78, baseType: !375, size: 32, offset: 384)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !962, file: !740, line: 78, baseType: !375, size: 32, offset: 416)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !930, file: !740, line: 343, baseType: !367, size: 128, offset: 1024)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !930, file: !740, line: 344, baseType: !367, size: 128, offset: 1152)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !930, file: !740, line: 345, baseType: !981, size: 192, offset: 1280)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !740, line: 278, baseType: !982)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !740, line: 270, size: 192, elements: !983)
!983 = !{!984, !985, !986, !987, !988}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !982, file: !740, line: 271, baseType: !353, size: 32)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !982, file: !740, line: 273, baseType: !375, size: 32, offset: 32)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !982, file: !740, line: 275, baseType: !353, size: 32, offset: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !982, file: !740, line: 276, baseType: !353, size: 32, offset: 96)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !982, file: !740, line: 277, baseType: !989, size: 64, offset: 128)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !740, line: 55, size: 576, elements: !991)
!991 = !{!992, !993, !994}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !990, file: !740, line: 56, baseType: !353, size: 32)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !990, file: !740, line: 57, baseType: !375, size: 32, offset: 32)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !990, file: !740, line: 58, baseType: !995, size: 512, offset: 64)
!995 = !DICompositeType(tag: DW_TAG_array_type, baseType: !375, size: 512, elements: !996)
!996 = !{!997, !997}
!997 = !DISubrange(count: 4)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !930, file: !740, line: 346, baseType: !999, size: 384, offset: 1472)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !740, line: 268, baseType: !1000)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !740, line: 253, size: 384, elements: !1001)
!1001 = !{!1002, !1003, !1004, !1005, !1006, !1050, !1051, !1052, !1053, !1054, !1055}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1000, file: !740, line: 254, baseType: !353, size: 32)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !1000, file: !740, line: 255, baseType: !353, size: 32, offset: 32)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !1000, file: !740, line: 255, baseType: !353, size: 32, offset: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !1000, file: !740, line: 258, baseType: !375, size: 32, offset: 96)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !1000, file: !740, line: 259, baseType: !1007, size: 64, offset: 128)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !740, line: 164, baseType: !1009)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !740, line: 108, size: 1664, elements: !1010)
!1010 = !{!1011, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1009, file: !740, line: 109, baseType: !1012, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1009, file: !740, line: 109, baseType: !1012, size: 64, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1009, file: !740, line: 111, baseType: !405, size: 512, offset: 128)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !1009, file: !740, line: 119, baseType: !742, size: 64, offset: 640)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !1009, file: !740, line: 119, baseType: !742, size: 64, offset: 704)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !1009, file: !740, line: 125, baseType: !742, size: 64, offset: 768)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !1009, file: !740, line: 125, baseType: !742, size: 64, offset: 832)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1009, file: !740, line: 127, baseType: !742, size: 64, offset: 896)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !1009, file: !740, line: 130, baseType: !353, size: 32, offset: 960)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !1009, file: !740, line: 131, baseType: !353, size: 32, offset: 992)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1009, file: !740, line: 132, baseType: !1023, size: 64, offset: 1024)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !740, line: 106, baseType: !1025)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !740, line: 81, size: 512, elements: !1026)
!1026 = !{!1027, !1028, !1031, !1032, !1033, !1034}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1025, file: !740, line: 82, baseType: !742, size: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !1025, file: !740, line: 97, baseType: !1029, size: 256, offset: 64)
!1029 = !DICompositeType(tag: DW_TAG_array_type, baseType: !375, size: 256, elements: !1030)
!1030 = !{!997, !496}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !1025, file: !740, line: 102, baseType: !742, size: 64, offset: 320)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !1025, file: !740, line: 102, baseType: !742, size: 64, offset: 384)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1025, file: !740, line: 104, baseType: !353, size: 32, offset: 448)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1025, file: !740, line: 105, baseType: !353, size: 32, offset: 480)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !1009, file: !740, line: 135, baseType: !710, size: 96, offset: 1088)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1009, file: !740, line: 136, baseType: !375, size: 32, offset: 1184)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1009, file: !740, line: 139, baseType: !353, size: 32, offset: 1216)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !1009, file: !740, line: 139, baseType: !353, size: 32, offset: 1248)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !1009, file: !740, line: 139, baseType: !353, size: 32, offset: 1280)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !1009, file: !740, line: 140, baseType: !710, size: 96, offset: 1312)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !1009, file: !740, line: 143, baseType: !378, size: 16, offset: 1408)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !1009, file: !740, line: 144, baseType: !378, size: 16, offset: 1424)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !1009, file: !740, line: 145, baseType: !378, size: 16, offset: 1440)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !1009, file: !740, line: 148, baseType: !378, size: 16, offset: 1456)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !1009, file: !740, line: 149, baseType: !353, size: 32, offset: 1472)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !1009, file: !740, line: 150, baseType: !375, size: 32, offset: 1504)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1009, file: !740, line: 152, baseType: !738, size: 64, offset: 1536)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !1009, file: !740, line: 163, baseType: !375, size: 32, offset: 1600)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1009, file: !740, line: 163, baseType: !375, size: 32, offset: 1632)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !1000, file: !740, line: 261, baseType: !375, size: 32, offset: 192)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !1000, file: !740, line: 261, baseType: !375, size: 32, offset: 224)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !1000, file: !740, line: 261, baseType: !375, size: 32, offset: 256)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1000, file: !740, line: 263, baseType: !353, size: 32, offset: 288)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1000, file: !740, line: 266, baseType: !353, size: 32, offset: 320)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1000, file: !740, line: 267, baseType: !375, size: 32, offset: 352)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !930, file: !740, line: 347, baseType: !1007, size: 64, offset: 1856)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !930, file: !740, line: 348, baseType: !1058, size: 64, offset: 1920)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !740, line: 205, baseType: !1060)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !740, line: 186, size: 1024, elements: !1061)
!1061 = !{!1062, !1064, !1065, !1066, !1068, !1069, !1070, !1078, !1079, !1080, !1155, !1156}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1060, file: !740, line: 187, baseType: !1063, size: 64)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1060, file: !740, line: 187, baseType: !1063, size: 64, offset: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1060, file: !740, line: 189, baseType: !405, size: 512, offset: 128)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !1060, file: !740, line: 191, baseType: !1067, size: 64, offset: 640)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !1060, file: !740, line: 193, baseType: !353, size: 32, offset: 704)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1060, file: !740, line: 193, baseType: !353, size: 32, offset: 736)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1060, file: !740, line: 195, baseType: !1071, size: 64, offset: 768)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !740, line: 184, baseType: !1073)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !740, line: 166, size: 320, elements: !1074)
!1074 = !{!1075, !1076, !1077}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !1073, file: !740, line: 180, baseType: !1029, size: 256)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1073, file: !740, line: 182, baseType: !353, size: 32, offset: 256)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1073, file: !740, line: 183, baseType: !353, size: 32, offset: 288)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !1060, file: !740, line: 196, baseType: !353, size: 32, offset: 832)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1060, file: !740, line: 198, baseType: !353, size: 32, offset: 864)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !1060, file: !740, line: 200, baseType: !1081, size: 64, offset: 896)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !870, line: 77, size: 15424, elements: !1083)
!1083 = !{!1084, !1085, !1086, !1089, !1092, !1093, !1096, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1114, !1115, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1141, !1142, !1143, !1144, !1145, !1149}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1082, file: !870, line: 78, baseType: !638, size: 960)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1082, file: !870, line: 80, baseType: !656, size: 8192, offset: 960)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1082, file: !870, line: 82, baseType: !1087, size: 64, offset: 9152)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64)
!1088 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !870, line: 43, flags: DIFlagFwdDecl)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1082, file: !870, line: 83, baseType: !1090, size: 64, offset: 9216)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64)
!1091 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !435, line: 46, flags: DIFlagFwdDecl)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1082, file: !870, line: 86, baseType: !868, size: 64, offset: 9280)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !1082, file: !870, line: 87, baseType: !1094, size: 64, offset: 9344)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64)
!1095 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !870, line: 44, flags: DIFlagFwdDecl)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !1082, file: !870, line: 89, baseType: !1097, size: 512, offset: 9408)
!1097 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1094, size: 512, elements: !379)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !1082, file: !870, line: 90, baseType: !378, size: 16, offset: 9920)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !1082, file: !870, line: 90, baseType: !378, size: 16, offset: 9936)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1082, file: !870, line: 92, baseType: !378, size: 16, offset: 9952)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1082, file: !870, line: 92, baseType: !378, size: 16, offset: 9968)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1082, file: !870, line: 93, baseType: !378, size: 16, offset: 9984)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1082, file: !870, line: 93, baseType: !378, size: 16, offset: 10000)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1082, file: !870, line: 94, baseType: !353, size: 32, offset: 10016)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !1082, file: !870, line: 97, baseType: !378, size: 16, offset: 10048)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !1082, file: !870, line: 97, baseType: !378, size: 16, offset: 10064)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !1082, file: !870, line: 98, baseType: !378, size: 16, offset: 10080)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !1082, file: !870, line: 98, baseType: !378, size: 16, offset: 10096)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !1082, file: !870, line: 99, baseType: !378, size: 16, offset: 10112)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !1082, file: !870, line: 99, baseType: !378, size: 16, offset: 10128)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !1082, file: !870, line: 100, baseType: !5, size: 32, offset: 10144)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !1082, file: !870, line: 101, baseType: !1113, size: 64, offset: 10176)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1082, file: !870, line: 103, baseType: !662, size: 64, offset: 10240)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !1082, file: !870, line: 104, baseType: !1116, size: 64, offset: 10304)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !435, line: 159, size: 448, elements: !1118)
!1118 = !{!1119, !1121, !1122, !1124, !1125, !1127}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1117, file: !435, line: 161, baseType: !1120, size: 64)
!1120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !495)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1117, file: !435, line: 162, baseType: !1120, size: 64, offset: 64)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !1117, file: !435, line: 163, baseType: !1123, size: 32, offset: 128)
!1123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !378, size: 32, elements: !495)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !1117, file: !435, line: 164, baseType: !1123, size: 32, offset: 160)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !1117, file: !435, line: 165, baseType: !1126, size: 128, offset: 192)
!1126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1113, size: 128, elements: !495)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1117, file: !435, line: 166, baseType: !1128, size: 128, offset: 320)
!1128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1090, size: 128, elements: !495)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !1082, file: !870, line: 107, baseType: !375, size: 32, offset: 10368)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !1082, file: !870, line: 108, baseType: !353, size: 32, offset: 10400)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !1082, file: !870, line: 109, baseType: !378, size: 16, offset: 10432)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1082, file: !870, line: 110, baseType: !378, size: 16, offset: 10448)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !1082, file: !870, line: 113, baseType: !353, size: 32, offset: 10464)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !1082, file: !870, line: 113, baseType: !353, size: 32, offset: 10496)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !1082, file: !870, line: 114, baseType: !391, size: 8, offset: 10528)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !1082, file: !870, line: 114, baseType: !391, size: 8, offset: 10536)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !1082, file: !870, line: 115, baseType: !378, size: 16, offset: 10544)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !1082, file: !870, line: 116, baseType: !1139, size: 128, offset: 10560)
!1139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !375, size: 128, elements: !1140)
!1140 = !{!997}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !1082, file: !870, line: 119, baseType: !375, size: 32, offset: 10688)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !1082, file: !870, line: 119, baseType: !375, size: 32, offset: 10720)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1082, file: !870, line: 122, baseType: !902, size: 512, offset: 10752)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !1082, file: !870, line: 123, baseType: !391, size: 8, offset: 11264)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1082, file: !870, line: 125, baseType: !1146, size: 56, offset: 11272)
!1146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !391, size: 56, elements: !1147)
!1147 = !{!1148}
!1148 = !DISubrange(count: 7)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !1082, file: !870, line: 126, baseType: !1150, size: 4096, offset: 11328)
!1150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1151, size: 4096, elements: !379)
!1151 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !870, line: 69, baseType: !1152)
!1152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !870, line: 67, size: 512, elements: !1153)
!1153 = !{!1154}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1152, file: !870, line: 68, baseType: !405, size: 512)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !1060, file: !740, line: 201, baseType: !375, size: 32, offset: 960)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !1060, file: !740, line: 204, baseType: !353, size: 32, offset: 992)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !930, file: !740, line: 350, baseType: !367, size: 128, offset: 1984)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !930, file: !740, line: 351, baseType: !353, size: 32, offset: 2112)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !930, file: !740, line: 351, baseType: !353, size: 32, offset: 2144)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !930, file: !740, line: 353, baseType: !1161, size: 64, offset: 2176)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64)
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !740, line: 297, baseType: !1163)
