; ModuleID = 'blender/source/blender/editors/space_action/action_edit.c'
source_filename = "blender/source/blender/editors/space_action/action_edit.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }

!150 = !DIEnumerator(name: "ANIMTYPE_DSLAT", value: 22, isUnsigned: true)
!151 = !DIEnumerator(name: "ANIMTYPE_DSLINESTYLE", value: 23, isUnsigned: true)
!152 = !DIEnumerator(name: "ANIMTYPE_DSSPK", value: 24, isUnsigned: true)
!153 = !DIEnumerator(name: "ANIMTYPE_SHAPEKEY", value: 25, isUnsigned: true)
!154 = !DIEnumerator(name: "ANIMTYPE_GPDATABLOCK", value: 26, isUnsigned: true)
!155 = !DIEnumerator(name: "ANIMTYPE_GPLAYER", value: 27, isUnsigned: true)
!156 = !DIEnumerator(name: "ANIMTYPE_MASKDATABLOCK", value: 28, isUnsigned: true)
!157 = !DIEnumerator(name: "ANIMTYPE_MASKLAYER", value: 29, isUnsigned: true)
!158 = !DIEnumerator(name: "ANIMTYPE_NLATRACK", value: 30, isUnsigned: true)
!159 = !DIEnumerator(name: "ANIMTYPE_NLAACTION", value: 31, isUnsigned: true)
!160 = !DIEnumerator(name: "ANIMTYPE_NUM_TYPES", value: 32, isUnsigned: true)
!161 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eFMI_Action_Types", file: !162, line: 147, baseType: !7, size: 32, elements: !163)
!162 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_fcurve.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!163 = !{!164, !165, !166, !167}
!164 = !DIEnumerator(name: "FMI_TYPE_EXTRAPOLATION", value: 0, isUnsigned: true)
!165 = !DIEnumerator(name: "FMI_TYPE_INTERPOLATION", value: 1, isUnsigned: true)
!166 = !DIEnumerator(name: "FMI_TYPE_REPLACE_VALUES", value: 2, isUnsigned: true)
!167 = !DIEnumerator(name: "FMI_TYPE_GENERATE_CURVE", value: 3, isUnsigned: true)
!168 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eFModifier_Types", file: !169, line: 72, baseType: !7, size: 32, elements: !170)
!169 = !DIFile(filename: "blender/source/blender/makesdna/DNA_anim_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!170 = !{!171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181}
!171 = !DIEnumerator(name: "FMODIFIER_TYPE_NULL", value: 0, isUnsigned: true)
!172 = !DIEnumerator(name: "FMODIFIER_TYPE_GENERATOR", value: 1, isUnsigned: true)
!173 = !DIEnumerator(name: "FMODIFIER_TYPE_FN_GENERATOR", value: 2, isUnsigned: true)
!174 = !DIEnumerator(name: "FMODIFIER_TYPE_ENVELOPE", value: 3, isUnsigned: true)
!175 = !DIEnumerator(name: "FMODIFIER_TYPE_CYCLES", value: 4, isUnsigned: true)
!176 = !DIEnumerator(name: "FMODIFIER_TYPE_NOISE", value: 5, isUnsigned: true)
!177 = !DIEnumerator(name: "FMODIFIER_TYPE_FILTER", value: 6, isUnsigned: true)
!178 = !DIEnumerator(name: "FMODIFIER_TYPE_PYTHON", value: 7, isUnsigned: true)
!179 = !DIEnumerator(name: "FMODIFIER_TYPE_LIMITS", value: 8, isUnsigned: true)
!180 = !DIEnumerator(name: "FMODIFIER_TYPE_STEPPED", value: 9, isUnsigned: true)
!181 = !DIEnumerator(name: "FMODIFIER_NUM_TYPES", value: 10, isUnsigned: true)
!182 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eEditKeyframes_Validate", file: !6, line: 53, baseType: !7, size: 32, elements: !183)
!183 = !{!184, !185, !186, !187, !188, !189, !190}
!184 = !DIEnumerator(name: "BEZT_OK_FRAME", value: 1, isUnsigned: true)
!185 = !DIEnumerator(name: "BEZT_OK_FRAMERANGE", value: 2, isUnsigned: true)
!186 = !DIEnumerator(name: "BEZT_OK_SELECTED", value: 3, isUnsigned: true)
!187 = !DIEnumerator(name: "BEZT_OK_VALUE", value: 4, isUnsigned: true)
!188 = !DIEnumerator(name: "BEZT_OK_VALUERANGE", value: 5, isUnsigned: true)
!189 = !DIEnumerator(name: "BEZT_OK_REGION", value: 6, isUnsigned: true)
!190 = !DIEnumerator(name: "BEZT_OK_REGION_LASSO", value: 7, isUnsigned: true)
!191 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eActKeys_Snap_Mode", file: !192, line: 110, baseType: !7, size: 32, elements: !193)
!192 = !DIFile(filename: "blender/source/blender/editors/space_action/action_intern.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!193 = !{!194, !195, !196, !197}
!194 = !DIEnumerator(name: "ACTKEYS_SNAP_CFRA", value: 1, isUnsigned: true)
!195 = !DIEnumerator(name: "ACTKEYS_SNAP_NEAREST_FRAME", value: 2, isUnsigned: true)
!196 = !DIEnumerator(name: "ACTKEYS_SNAP_NEAREST_SECOND", value: 3, isUnsigned: true)
!197 = !DIEnumerator(name: "ACTKEYS_SNAP_NEAREST_MARKER", value: 4, isUnsigned: true)
!198 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eActKeys_Mirror_Mode", file: !192, line: 120, baseType: !7, size: 32, elements: !199)
!199 = !{!200, !201, !202, !203}
!200 = !DIEnumerator(name: "ACTKEYS_MIRROR_CFRA", value: 1, isUnsigned: true)
!201 = !DIEnumerator(name: "ACTKEYS_MIRROR_YAXIS", value: 2, isUnsigned: true)
!202 = !DIEnumerator(name: "ACTKEYS_MIRROR_XAXIS", value: 3, isUnsigned: true)
!203 = !DIEnumerator(name: "ACTKEYS_MIRROR_MARKER", value: 4, isUnsigned: true)
!204 = !{!205, !288, !289, !215, !290, !291, !50, !387, !416}
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !29, line: 499, baseType: !207)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !29, line: 486, size: 1600, elements: !208)
!208 = !{!209, !280, !281, !282, !283, !284, !285, !286, !287}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !207, file: !29, line: 487, baseType: !210, size: 960)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !211, line: 130, baseType: !212)
!211 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !211, line: 117, size: 960, elements: !213)
!213 = !{!214, !216, !217, !219, !239, !243, !245, !246, !247, !248}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !212, file: !211, line: 118, baseType: !215, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !212, file: !211, line: 118, baseType: !215, size: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !212, file: !211, line: 119, baseType: !218, size: 64, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !212, file: !211, line: 120, baseType: !220, size: 64, offset: 192)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !211, line: 136, size: 17600, elements: !222)
!222 = !{!223, !224, !226, !229, !234, !235, !236}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !221, file: !211, line: 137, baseType: !210, size: 960)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !221, file: !211, line: 138, baseType: !225, size: 64, offset: 960)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !221, file: !211, line: 139, baseType: !227, size: 64, offset: 1024)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !211, line: 43, flags: DIFlagFwdDecl)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !221, file: !211, line: 140, baseType: !230, size: 8192, offset: 1088)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 8192, elements: !232)
!231 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!232 = !{!233}
!233 = !DISubrange(count: 1024)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !221, file: !211, line: 141, baseType: !230, size: 8192, offset: 9280)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !221, file: !211, line: 148, baseType: !220, size: 64, offset: 17472)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !221, file: !211, line: 150, baseType: !237, size: 64, offset: 17536)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !211, line: 45, flags: DIFlagFwdDecl)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !212, file: !211, line: 121, baseType: !240, size: 528, offset: 256)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 528, elements: !241)
!241 = !{!242}
!242 = !DISubrange(count: 66)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !212, file: !211, line: 126, baseType: !244, size: 16, offset: 784)
!244 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !212, file: !211, line: 127, baseType: !50, size: 32, offset: 800)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !212, file: !211, line: 128, baseType: !50, size: 32, offset: 832)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !212, file: !211, line: 128, baseType: !50, size: 32, offset: 864)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !212, file: !211, line: 129, baseType: !249, size: 64, offset: 896)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !211, line: 75, baseType: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !211, line: 62, size: 1024, elements: !252)
!252 = !{!253, !255, !256, !257, !258, !259, !263, !264, !278, !279}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !251, file: !211, line: 63, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !251, file: !211, line: 63, baseType: !254, size: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !251, file: !211, line: 64, baseType: !231, size: 8, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !251, file: !211, line: 64, baseType: !231, size: 8, offset: 136)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !251, file: !211, line: 65, baseType: !244, size: 16, offset: 144)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !251, file: !211, line: 66, baseType: !260, size: 512, offset: 160)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 512, elements: !261)
!261 = !{!262}
!262 = !DISubrange(count: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !251, file: !211, line: 67, baseType: !50, size: 32, offset: 672)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !251, file: !211, line: 69, baseType: !265, size: 256, offset: 704)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !211, line: 60, baseType: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !211, line: 48, size: 256, elements: !267)
!267 = !{!268, !269, !276, !277}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !266, file: !211, line: 49, baseType: !215, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !266, file: !211, line: 58, baseType: !270, size: 128, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !271, line: 71, baseType: !272)
!271 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !271, line: 69, size: 128, elements: !273)
!273 = !{!274, !275}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !272, file: !271, line: 70, baseType: !215, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !272, file: !271, line: 70, baseType: !215, size: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !266, file: !211, line: 59, baseType: !50, size: 32, offset: 192)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !266, file: !211, line: 59, baseType: !50, size: 32, offset: 224)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !251, file: !211, line: 70, baseType: !50, size: 32, offset: 960)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !251, file: !211, line: 74, baseType: !50, size: 32, offset: 992)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !207, file: !29, line: 489, baseType: !270, size: 128, offset: 960)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !207, file: !29, line: 490, baseType: !270, size: 128, offset: 1088)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !207, file: !29, line: 491, baseType: !270, size: 128, offset: 1216)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !207, file: !29, line: 492, baseType: !270, size: 128, offset: 1344)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !207, file: !29, line: 494, baseType: !50, size: 32, offset: 1472)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !207, file: !29, line: 495, baseType: !50, size: 32, offset: 1504)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !207, file: !29, line: 497, baseType: !50, size: 32, offset: 1536)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !207, file: !29, line: 498, baseType: !50, size: 32, offset: 1568)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!290 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "FCurve", file: !169, line: 463, baseType: !293)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FCurve", file: !169, line: 433, size: 896, elements: !294)
!294 = !{!295, !297, !298, !323, !338, !339, !364, !375, !376, !377, !378, !379, !380, !381, !382, !385, !386}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !293, file: !169, line: 434, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !293, file: !169, line: 434, baseType: !296, size: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "grp", scope: !293, file: !169, line: 437, baseType: !299, size: 64, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "bActionGroup", file: !29, line: 450, baseType: !301)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bActionGroup", file: !29, line: 440, size: 960, elements: !302)
!302 = !{!303, !305, !306, !307, !308, !309, !310}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !301, file: !29, line: 441, baseType: !304, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !301, file: !29, line: 441, baseType: !304, size: 64, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !301, file: !29, line: 443, baseType: !270, size: 128, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !301, file: !29, line: 445, baseType: !50, size: 32, offset: 256)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "customCol", scope: !301, file: !29, line: 446, baseType: !50, size: 32, offset: 288)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !301, file: !29, line: 447, baseType: !260, size: 512, offset: 320)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !301, file: !29, line: 449, baseType: !311, size: 128, offset: 832)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThemeWireColor", file: !312, line: 347, baseType: !313)
!312 = !DIFile(filename: "blender/source/blender/makesdna/DNA_userdef_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ThemeWireColor", file: !312, line: 340, size: 128, elements: !314)
!314 = !{!315, !319, !320, !321, !322}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "solid", scope: !313, file: !312, line: 341, baseType: !316, size: 32)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 32, elements: !317)
!317 = !{!318}
!318 = !DISubrange(count: 4)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "select", scope: !313, file: !312, line: 342, baseType: !316, size: 32, offset: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !313, file: !312, line: 343, baseType: !316, size: 32, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !313, file: !312, line: 345, baseType: !244, size: 16, offset: 96)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !313, file: !312, line: 346, baseType: !244, size: 16, offset: 112)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "driver", scope: !293, file: !169, line: 440, baseType: !324, size: 64, offset: 192)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelDriver", file: !169, line: 386, baseType: !326)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ChannelDriver", file: !169, line: 371, size: 2368, elements: !327)
!327 = !{!328, !329, !333, !334, !335, !336, !337}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "variables", scope: !326, file: !169, line: 372, baseType: !270, size: 128)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "expression", scope: !326, file: !169, line: 377, baseType: !330, size: 2048, offset: 128)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 2048, elements: !331)
!331 = !{!332}
!332 = !DISubrange(count: 256)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "expr_comp", scope: !326, file: !169, line: 378, baseType: !215, size: 64, offset: 2176)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "curval", scope: !326, file: !169, line: 380, baseType: !290, size: 32, offset: 2240)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !326, file: !169, line: 381, baseType: !290, size: 32, offset: 2272)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !326, file: !169, line: 384, baseType: !50, size: 32, offset: 2304)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !326, file: !169, line: 385, baseType: !50, size: 32, offset: 2336)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !293, file: !169, line: 442, baseType: !270, size: 128, offset: 256)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "bezt", scope: !293, file: !169, line: 445, baseType: !340, size: 64, offset: 384)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "BezTriple", file: !342, line: 133, baseType: !343)
!342 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BezTriple", file: !342, line: 117, size: 576, elements: !344)
!344 = !{!345, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !343, file: !342, line: 118, baseType: !346, size: 288)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !290, size: 288, elements: !347)
!347 = !{!348, !348}
!348 = !DISubrange(count: 3)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "alfa", scope: !343, file: !342, line: 119, baseType: !290, size: 32, offset: 288)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !343, file: !342, line: 119, baseType: !290, size: 32, offset: 320)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !343, file: !342, line: 119, baseType: !290, size: 32, offset: 352)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !343, file: !342, line: 121, baseType: !231, size: 8, offset: 384)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "h1", scope: !343, file: !342, line: 123, baseType: !231, size: 8, offset: 392)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "h2", scope: !343, file: !342, line: 123, baseType: !231, size: 8, offset: 400)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "f1", scope: !343, file: !342, line: 124, baseType: !231, size: 8, offset: 408)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "f2", scope: !343, file: !342, line: 124, baseType: !231, size: 8, offset: 416)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "f3", scope: !343, file: !342, line: 124, baseType: !231, size: 8, offset: 424)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "hide", scope: !343, file: !342, line: 126, baseType: !231, size: 8, offset: 432)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "easing", scope: !343, file: !342, line: 128, baseType: !231, size: 8, offset: 440)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !343, file: !342, line: 129, baseType: !290, size: 32, offset: 448)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "amplitude", scope: !343, file: !342, line: 130, baseType: !290, size: 32, offset: 480)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !343, file: !342, line: 130, baseType: !290, size: 32, offset: 512)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !343, file: !342, line: 132, baseType: !316, size: 32, offset: 544)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "fpt", scope: !293, file: !169, line: 446, baseType: !365, size: 64, offset: 448)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "FPoint", file: !169, line: 430, baseType: !367)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FPoint", file: !169, line: 426, size: 128, elements: !368)
!368 = !{!369, !373, !374}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !367, file: !169, line: 427, baseType: !370, size: 64)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !290, size: 64, elements: !371)
!371 = !{!372}
!372 = !DISubrange(count: 2)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !367, file: !169, line: 428, baseType: !50, size: 32, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !367, file: !169, line: 429, baseType: !50, size: 32, offset: 96)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !293, file: !169, line: 447, baseType: !7, size: 32, offset: 512)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "curval", scope: !293, file: !169, line: 450, baseType: !290, size: 32, offset: 544)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !293, file: !169, line: 451, baseType: !244, size: 16, offset: 576)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !293, file: !169, line: 452, baseType: !244, size: 16, offset: 592)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "array_index", scope: !293, file: !169, line: 455, baseType: !50, size: 32, offset: 608)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "rna_path", scope: !293, file: !169, line: 456, baseType: !288, size: 64, offset: 640)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !293, file: !169, line: 459, baseType: !50, size: 32, offset: 704)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !293, file: !169, line: 460, baseType: !383, size: 96, offset: 736)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !290, size: 96, elements: !384)
!384 = !{!348}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "prev_norm_factor", scope: !293, file: !169, line: 462, baseType: !290, size: 32, offset: 832)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !293, file: !169, line: 462, baseType: !290, size: 32, offset: 864)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "bGPDlayer", file: !389, line: 108, baseType: !390)
!389 = !DIFile(filename: "blender/source/blender/makesdna/DNA_gpencil_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bGPDlayer", file: !389, line: 94, size: 1536, elements: !391)
!391 = !{!392, !394, !395, !396, !407, !408, !409, !410, !412}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !390, file: !389, line: 95, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !390, file: !389, line: 95, baseType: !393, size: 64, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !390, file: !389, line: 97, baseType: !270, size: 128, offset: 128)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "actframe", scope: !390, file: !389, line: 98, baseType: !397, size: 64, offset: 256)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "bGPDframe", file: !389, line: 84, baseType: !399)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bGPDframe", file: !389, line: 77, size: 320, elements: !400)
!400 = !{!401, !403, !404, !405, !406}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !399, file: !389, line: 78, baseType: !402, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !399, file: !389, line: 78, baseType: !402, size: 64, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "strokes", scope: !399, file: !389, line: 80, baseType: !270, size: 128, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "framenum", scope: !399, file: !389, line: 82, baseType: !50, size: 32, offset: 256)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !399, file: !389, line: 83, baseType: !50, size: 32, offset: 288)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !390, file: !389, line: 100, baseType: !50, size: 32, offset: 320)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "thickness", scope: !390, file: !389, line: 101, baseType: !244, size: 16, offset: 352)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "gstep", scope: !390, file: !389, line: 102, baseType: !244, size: 16, offset: 368)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !390, file: !389, line: 104, baseType: !411, size: 128, offset: 384)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !290, size: 128, elements: !317)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !390, file: !389, line: 106, baseType: !413, size: 1024, offset: 512)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 1024, elements: !414)
!414 = !{!415}
!415 = !DISubrange(count: 128)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "MaskLayer", file: !418, line: 142, baseType: !419)
!418 = !DIFile(filename: "blender/source/blender/makesdna/DNA_mask_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MaskLayer", file: !418, line: 122, size: 1152, elements: !420)
!420 = !{!421, !423, !424, !425, !426, !427, !468, !470, !471, !472, !473, !474, !478, !479}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !419, file: !418, line: 123, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !419, file: !418, line: 123, baseType: !422, size: 64, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !419, file: !418, line: 125, baseType: !260, size: 512, offset: 128)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "splines", scope: !419, file: !418, line: 127, baseType: !270, size: 128, offset: 640)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "splines_shapes", scope: !419, file: !418, line: 128, baseType: !270, size: 128, offset: 768)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "act_spline", scope: !419, file: !418, line: 130, baseType: !428, size: 64, offset: 896)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MaskSpline", file: !418, line: 88, size: 1792, elements: !430)
!430 = !{!431, !432, !433, !434, !435, !436, !437, !466, !467}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !429, file: !418, line: 89, baseType: !428, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !429, file: !418, line: 89, baseType: !428, size: 64, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !429, file: !418, line: 91, baseType: !244, size: 16, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "offset_mode", scope: !429, file: !418, line: 92, baseType: !231, size: 8, offset: 144)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "weight_interp", scope: !429, file: !418, line: 93, baseType: !231, size: 8, offset: 152)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "tot_point", scope: !429, file: !418, line: 95, baseType: !50, size: 32, offset: 160)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !429, file: !418, line: 96, baseType: !438, size: 64, offset: 192)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "MaskSplinePoint", file: !418, line: 86, baseType: !440)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MaskSplinePoint", file: !418, line: 80, size: 2176, elements: !441)
!441 = !{!442, !443, !444, !445, !453}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "bezt", scope: !440, file: !418, line: 81, baseType: !341, size: 576)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !440, file: !418, line: 82, baseType: !50, size: 32, offset: 576)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "tot_uw", scope: !440, file: !418, line: 83, baseType: !50, size: 32, offset: 608)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "uw", scope: !440, file: !418, line: 84, baseType: !446, size: 64, offset: 640)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "MaskSplinePointUW", file: !418, line: 78, baseType: !448)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MaskSplinePointUW", file: !418, line: 75, size: 96, elements: !449)
!449 = !{!450, !451, !452}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !448, file: !418, line: 76, baseType: !290, size: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !448, file: !418, line: 76, baseType: !290, size: 32, offset: 32)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !448, file: !418, line: 77, baseType: !50, size: 32, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !440, file: !418, line: 85, baseType: !454, size: 1472, offset: 704)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "MaskParent", file: !418, line: 73, baseType: !455)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MaskParent", file: !418, line: 59, size: 1472, elements: !456)
!456 = !{!457, !458, !459, !460, !461, !462, !463}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "id_type", scope: !455, file: !418, line: 61, baseType: !50, size: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !455, file: !418, line: 62, baseType: !50, size: 32, offset: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !455, file: !418, line: 63, baseType: !225, size: 64, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !455, file: !418, line: 65, baseType: !260, size: 512, offset: 128)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "sub_parent", scope: !455, file: !418, line: 67, baseType: !260, size: 512, offset: 640)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "parent_orig", scope: !455, file: !418, line: 69, baseType: !370, size: 64, offset: 1152)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "parent_corners_orig", scope: !455, file: !418, line: 72, baseType: !464, size: 256, offset: 1216)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !290, size: 256, elements: !465)
!465 = !{!318, !372}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !429, file: !418, line: 97, baseType: !454, size: 1472, offset: 256)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "points_deform", scope: !429, file: !418, line: 99, baseType: !438, size: 64, offset: 1728)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "act_point", scope: !419, file: !418, line: 131, baseType: !469, size: 64, offset: 960)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !419, file: !418, line: 134, baseType: !290, size: 32, offset: 1024)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "blend", scope: !419, file: !418, line: 135, baseType: !231, size: 8, offset: 1056)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "blend_flag", scope: !419, file: !418, line: 136, baseType: !231, size: 8, offset: 1064)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "falloff", scope: !419, file: !418, line: 137, baseType: !231, size: 8, offset: 1072)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !419, file: !418, line: 138, baseType: !475, size: 56, offset: 1080)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 56, elements: !476)
!476 = !{!477}
!477 = !DISubrange(count: 7)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !419, file: !418, line: 140, baseType: !231, size: 8, offset: 1136)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !419, file: !418, line: 141, baseType: !231, size: 8, offset: 1144)
!480 = !{!0, !481, !497, !499}
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(name: "prop_actkeys_expo_types", scope: !2, file: !3, line: 1072, type: !483, isLocal: true, isDefinition: true)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !484, size: 1600, elements: !495)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "EnumPropertyItem", file: !485, line: 308, baseType: !486)
!485 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EnumPropertyItem", file: !485, line: 302, size: 320, elements: !487)
!487 = !{!488, !489, !492, !493, !494}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !486, file: !485, line: 303, baseType: !50, size: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !486, file: !485, line: 304, baseType: !490, size: 64, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !231)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !486, file: !485, line: 305, baseType: !50, size: 32, offset: 128)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !486, file: !485, line: 306, baseType: !490, size: 64, offset: 192)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !486, file: !485, line: 307, baseType: !490, size: 64, offset: 256)
!495 = !{!496}
!496 = !DISubrange(count: 5)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(name: "prop_actkeys_snap_types", scope: !2, file: !3, line: 1472, type: !483, isLocal: true, isDefinition: true)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(name: "prop_actkeys_mirror_types", scope: !2, file: !3, line: 1581, type: !501, isLocal: true, isDefinition: true)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !484, size: 1280, elements: !317)
!502 = !{i32 7, !"Dwarf Version", i32 4}
!503 = !{i32 2, !"Debug Info Version", i32 3}
!504 = !{i32 1, !"wchar_size", i32 4}
!505 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!506 = distinct !DISubprogram(name: "ACTION_OT_new", scope: !3, file: !3, line: 128, type: !507, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !2013)
!507 = !DISubroutineType(types: !508)
!508 = !{null, !509}
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorType", file: !511, line: 568, baseType: !512)
!511 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !511, line: 508, size: 1536, elements: !513)
!513 = !{!514, !515, !516, !517, !518, !1939, !1943, !1949, !1953, !1954, !1958, !1959, !1960, !1961, !1965, !1966, !1981, !1982, !1986, !2012}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !512, file: !511, line: 509, baseType: !490, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !512, file: !511, line: 510, baseType: !490, size: 64, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !512, file: !511, line: 511, baseType: !490, size: 64, offset: 128)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !512, file: !511, line: 512, baseType: !490, size: 64, offset: 192)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !512, file: !511, line: 518, baseType: !519, size: 64, offset: 256)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DISubroutineType(types: !521)
!521 = !{!50, !522, !524}
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !485, line: 44, flags: DIFlagFwdDecl)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !20, line: 328, size: 1344, elements: !526)
!526 = !{!527, !528, !529, !530, !531, !533, !534, !535, !547, !1932, !1933, !1934, !1937, !1938}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !525, file: !20, line: 329, baseType: !524, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !525, file: !20, line: 329, baseType: !524, size: 64, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !525, file: !20, line: 332, baseType: !260, size: 512, offset: 128)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !525, file: !20, line: 333, baseType: !249, size: 64, offset: 640)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !525, file: !20, line: 336, baseType: !532, size: 64, offset: 704)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !525, file: !20, line: 337, baseType: !215, size: 64, offset: 768)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !525, file: !20, line: 338, baseType: !215, size: 64, offset: 832)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !525, file: !20, line: 340, baseType: !536, size: 64, offset: 896)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !485, line: 55, size: 192, elements: !538)
!538 = !{!539, !543, !546}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !537, file: !485, line: 58, baseType: !540, size: 64)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !537, file: !485, line: 56, size: 64, elements: !541)
!541 = !{!542}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !540, file: !485, line: 57, baseType: !215, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !537, file: !485, line: 60, baseType: !544, size: 64, offset: 64)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !485, line: 41, flags: DIFlagFwdDecl)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !537, file: !485, line: 61, baseType: !215, size: 64, offset: 128)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !525, file: !20, line: 341, baseType: !548, size: 64, offset: 960)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !20, line: 106, size: 320, elements: !550)
!550 = !{!551, !552, !553, !554, !555, !556}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !549, file: !20, line: 107, baseType: !270, size: 128)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !549, file: !20, line: 108, baseType: !50, size: 32, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !549, file: !20, line: 109, baseType: !50, size: 32, offset: 160)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !549, file: !20, line: 110, baseType: !50, size: 32, offset: 192)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !549, file: !20, line: 110, baseType: !50, size: 32, offset: 224)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !549, file: !20, line: 111, baseType: !557, size: 64, offset: 256)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !511, line: 490, size: 768, elements: !559)
!559 = !{!560, !561, !562, !1923, !1924, !1925, !1926, !1927, !1928, !1929, !1930, !1931}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !558, file: !511, line: 491, baseType: !557, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !558, file: !511, line: 491, baseType: !557, size: 64, offset: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !558, file: !511, line: 493, baseType: !563, size: 64, offset: 128)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !20, line: 169, size: 2048, elements: !565)
!565 = !{!566, !567, !568, !569, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1855, !1856, !1857, !1898, !1901, !1915, !1916, !1917, !1918, !1919, !1920, !1921, !1922}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !564, file: !20, line: 170, baseType: !563, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !564, file: !20, line: 170, baseType: !563, size: 64, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !564, file: !20, line: 172, baseType: !215, size: 64, offset: 128)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !564, file: !20, line: 174, baseType: !570, size: 64, offset: 192)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !572, line: 49, size: 1984, elements: !573)
!572 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!573 = !{!574, !575, !576, !577, !578, !579, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !571, file: !572, line: 50, baseType: !210, size: 960)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !571, file: !572, line: 52, baseType: !270, size: 128, offset: 960)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !571, file: !572, line: 53, baseType: !270, size: 128, offset: 1088)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !571, file: !572, line: 54, baseType: !270, size: 128, offset: 1216)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !571, file: !572, line: 55, baseType: !270, size: 128, offset: 1344)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !571, file: !572, line: 57, baseType: !580, size: 64, offset: 1472)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !582, line: 1216, size: 39680, elements: !583)
!582 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!583 = !{!584, !585, !640, !644, !647, !648, !649, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !675, !756, !1192, !1405, !1408, !1693, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1715, !1716, !1717, !1718, !1719, !1727, !1794, !1801, !1802, !1809, !1810, !1816, !1817, !1818, !1819, !1820}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !581, file: !582, line: 1217, baseType: !210, size: 960)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !581, file: !582, line: 1218, baseType: !586, size: 64, offset: 960)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !169, line: 838, size: 768, elements: !588)
!588 = !{!589, !590, !591, !601, !602, !633, !634, !635, !636, !637, !638, !639}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !587, file: !169, line: 840, baseType: !205, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !587, file: !169, line: 844, baseType: !205, size: 64, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !587, file: !169, line: 848, baseType: !592, size: 64, offset: 128)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !169, line: 549, baseType: !594)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !169, line: 544, size: 320, elements: !595)
!595 = !{!596, !598, !599, !600}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !594, file: !169, line: 545, baseType: !597, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !594, file: !169, line: 545, baseType: !597, size: 64, offset: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !594, file: !169, line: 547, baseType: !205, size: 64, offset: 128)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !594, file: !169, line: 548, baseType: !270, size: 128, offset: 192)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !587, file: !169, line: 851, baseType: !270, size: 128, offset: 192)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !587, file: !169, line: 853, baseType: !603, size: 64, offset: 320)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !169, line: 594, baseType: !605)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !169, line: 561, size: 1664, elements: !606)
!606 = !{!607, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !605, file: !169, line: 562, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !605, file: !169, line: 562, baseType: !608, size: 64, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !605, file: !169, line: 564, baseType: !270, size: 128, offset: 128)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !605, file: !169, line: 565, baseType: !205, size: 64, offset: 256)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !605, file: !169, line: 566, baseType: !592, size: 64, offset: 320)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !605, file: !169, line: 568, baseType: !270, size: 128, offset: 384)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !605, file: !169, line: 569, baseType: !270, size: 128, offset: 512)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !605, file: !169, line: 571, baseType: !260, size: 512, offset: 640)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !605, file: !169, line: 573, baseType: !290, size: 32, offset: 1152)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "strip_time", scope: !605, file: !169, line: 574, baseType: !290, size: 32, offset: 1184)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !605, file: !169, line: 576, baseType: !290, size: 32, offset: 1216)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !605, file: !169, line: 576, baseType: !290, size: 32, offset: 1248)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "actstart", scope: !605, file: !169, line: 577, baseType: !290, size: 32, offset: 1280)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "actend", scope: !605, file: !169, line: 577, baseType: !290, size: 32, offset: 1312)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !605, file: !169, line: 579, baseType: !290, size: 32, offset: 1344)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !605, file: !169, line: 580, baseType: !290, size: 32, offset: 1376)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !605, file: !169, line: 582, baseType: !290, size: 32, offset: 1408)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !605, file: !169, line: 582, baseType: !290, size: 32, offset: 1440)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "blendmode", scope: !605, file: !169, line: 583, baseType: !244, size: 16, offset: 1472)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "extendmode", scope: !605, file: !169, line: 585, baseType: !244, size: 16, offset: 1488)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !605, file: !169, line: 586, baseType: !244, size: 16, offset: 1504)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !605, file: !169, line: 588, baseType: !244, size: 16, offset: 1520)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handle", scope: !605, file: !169, line: 590, baseType: !215, size: 64, offset: 1536)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !605, file: !169, line: 592, baseType: !50, size: 32, offset: 1600)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !605, file: !169, line: 593, baseType: !50, size: 32, offset: 1632)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "drivers", scope: !587, file: !169, line: 858, baseType: !270, size: 128, offset: 384)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "overrides", scope: !587, file: !169, line: 859, baseType: !270, size: 128, offset: 512)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !587, file: !169, line: 862, baseType: !50, size: 32, offset: 640)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !587, file: !169, line: 863, baseType: !50, size: 32, offset: 672)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "act_blendmode", scope: !587, file: !169, line: 866, baseType: !244, size: 16, offset: 704)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "act_extendmode", scope: !587, file: !169, line: 867, baseType: !244, size: 16, offset: 720)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "act_influence", scope: !587, file: !169, line: 868, baseType: !290, size: 32, offset: 736)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !581, file: !582, line: 1220, baseType: !641, size: 64, offset: 1024)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !643, line: 49, flags: DIFlagFwdDecl)
!643 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!644 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !581, file: !582, line: 1221, baseType: !645, size: 64, offset: 1088)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !582, line: 52, flags: DIFlagFwdDecl)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !581, file: !582, line: 1223, baseType: !580, size: 64, offset: 1152)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !581, file: !582, line: 1225, baseType: !270, size: 128, offset: 1216)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !581, file: !582, line: 1226, baseType: !650, size: 64, offset: 1344)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !582, line: 69, size: 320, elements: !652)
!652 = !{!653, !654, !655, !656, !657, !658, !659, !660}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !651, file: !582, line: 70, baseType: !650, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !651, file: !582, line: 70, baseType: !650, size: 64, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !651, file: !582, line: 71, baseType: !7, size: 32, offset: 128)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !651, file: !582, line: 71, baseType: !7, size: 32, offset: 160)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !651, file: !582, line: 72, baseType: !50, size: 32, offset: 192)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !651, file: !582, line: 73, baseType: !244, size: 16, offset: 224)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !651, file: !582, line: 73, baseType: !244, size: 16, offset: 240)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !651, file: !582, line: 74, baseType: !641, size: 64, offset: 256)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !581, file: !582, line: 1227, baseType: !641, size: 64, offset: 1408)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !581, file: !582, line: 1229, baseType: !383, size: 96, offset: 1472)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !581, file: !582, line: 1230, baseType: !383, size: 96, offset: 1568)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !581, file: !582, line: 1231, baseType: !383, size: 96, offset: 1664)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !581, file: !582, line: 1231, baseType: !383, size: 96, offset: 1760)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !581, file: !582, line: 1233, baseType: !7, size: 32, offset: 1856)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !581, file: !582, line: 1234, baseType: !50, size: 32, offset: 1888)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !581, file: !582, line: 1235, baseType: !7, size: 32, offset: 1920)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !581, file: !582, line: 1237, baseType: !244, size: 16, offset: 1952)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !581, file: !582, line: 1239, baseType: !231, size: 8, offset: 1968)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !581, file: !582, line: 1240, baseType: !672, size: 8, offset: 1976)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 8, elements: !673)
!673 = !{!674}
!674 = !DISubrange(count: 1)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !581, file: !582, line: 1242, baseType: !676, size: 64, offset: 1984)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !678, line: 328, size: 3456, elements: !679)
!678 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!679 = !{!680, !681, !682, !686, !687, !688, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !722, !723, !724, !727, !732, !733, !736, !740, !744, !748, !752, !753, !754, !755}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !677, file: !678, line: 329, baseType: !210, size: 960)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !677, file: !678, line: 330, baseType: !586, size: 64, offset: 960)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !677, file: !678, line: 332, baseType: !683, size: 64, offset: 1024)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !685, line: 32, flags: DIFlagFwdDecl)
!685 = !DIFile(filename: "blender/source/blender/makesrna/RNA_enum_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!686 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !677, file: !678, line: 333, baseType: !260, size: 512, offset: 1088)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !677, file: !678, line: 335, baseType: !544, size: 64, offset: 1600)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !677, file: !678, line: 337, baseType: !689, size: 64, offset: 1664)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !389, line: 130, size: 1216, elements: !691)
!691 = !{!692, !693, !694, !695, !696, !697}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !690, file: !389, line: 131, baseType: !210, size: 960)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !690, file: !389, line: 134, baseType: !270, size: 128, offset: 960)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !690, file: !389, line: 135, baseType: !50, size: 32, offset: 1088)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "sbuffer_size", scope: !690, file: !389, line: 141, baseType: !244, size: 16, offset: 1120)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "sbuffer_sflag", scope: !690, file: !389, line: 142, baseType: !244, size: 16, offset: 1136)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "sbuffer", scope: !690, file: !389, line: 143, baseType: !215, size: 64, offset: 1152)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !677, file: !678, line: 338, baseType: !370, size: 64, offset: 1728)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !677, file: !678, line: 340, baseType: !270, size: 128, offset: 1792)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !677, file: !678, line: 340, baseType: !270, size: 128, offset: 1920)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !677, file: !678, line: 342, baseType: !50, size: 32, offset: 2048)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !677, file: !678, line: 342, baseType: !50, size: 32, offset: 2080)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !677, file: !678, line: 343, baseType: !50, size: 32, offset: 2112)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !677, file: !678, line: 345, baseType: !50, size: 32, offset: 2144)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !677, file: !678, line: 346, baseType: !50, size: 32, offset: 2176)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !677, file: !678, line: 347, baseType: !244, size: 16, offset: 2208)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !677, file: !678, line: 348, baseType: !244, size: 16, offset: 2224)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !677, file: !678, line: 349, baseType: !50, size: 32, offset: 2240)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !677, file: !678, line: 351, baseType: !50, size: 32, offset: 2272)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !677, file: !678, line: 353, baseType: !244, size: 16, offset: 2304)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !677, file: !678, line: 354, baseType: !244, size: 16, offset: 2320)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !677, file: !678, line: 355, baseType: !50, size: 32, offset: 2336)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !677, file: !678, line: 357, baseType: !714, size: 128, offset: 2368)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !715, line: 95, baseType: !716)
!715 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !715, line: 92, size: 128, elements: !717)
!717 = !{!718, !719, !720, !721}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !716, file: !715, line: 93, baseType: !290, size: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !716, file: !715, line: 93, baseType: !290, size: 32, offset: 32)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !716, file: !715, line: 94, baseType: !290, size: 32, offset: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !716, file: !715, line: 94, baseType: !290, size: 32, offset: 96)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !677, file: !678, line: 363, baseType: !270, size: 128, offset: 2496)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !677, file: !678, line: 363, baseType: !270, size: 128, offset: 2624)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !677, file: !678, line: 368, baseType: !725, size: 64, offset: 2752)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !678, line: 48, flags: DIFlagFwdDecl)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !677, file: !678, line: 372, baseType: !728, size: 32, offset: 2816)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !678, line: 274, baseType: !729)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !678, line: 271, size: 32, elements: !730)
!730 = !{!731}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !729, file: !678, line: 273, baseType: !7, size: 32)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !677, file: !678, line: 373, baseType: !50, size: 32, offset: 2848)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !677, file: !678, line: 382, baseType: !734, size: 64, offset: 2880)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !678, line: 46, flags: DIFlagFwdDecl)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !677, file: !678, line: 385, baseType: !737, size: 64, offset: 2944)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{null, !215, !290}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !677, file: !678, line: 386, baseType: !741, size: 64, offset: 3008)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DISubroutineType(types: !743)
!743 = !{null, !215, !288}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !677, file: !678, line: 387, baseType: !745, size: 64, offset: 3072)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DISubroutineType(types: !747)
!747 = !{!50, !215}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !677, file: !678, line: 388, baseType: !749, size: 64, offset: 3136)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{null, !215}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !677, file: !678, line: 389, baseType: !215, size: 64, offset: 3200)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !677, file: !678, line: 389, baseType: !215, size: 64, offset: 3264)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !677, file: !678, line: 389, baseType: !215, size: 64, offset: 3328)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !677, file: !678, line: 389, baseType: !215, size: 64, offset: 3392)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !581, file: !582, line: 1244, baseType: !757, size: 64, offset: 2048)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !759, line: 200, size: 17024, elements: !760)
!759 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!760 = !{!761, !763, !764, !765, !1185, !1186, !1187, !1188, !1189, !1190, !1191}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !758, file: !759, line: 201, baseType: !762, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !758, file: !759, line: 202, baseType: !270, size: 128, offset: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !758, file: !759, line: 203, baseType: !270, size: 128, offset: 192)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !758, file: !759, line: 206, baseType: !766, size: 64, offset: 320)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !759, line: 190, baseType: !768)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !759, line: 126, size: 2816, elements: !769)
!769 = !{!770, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !866, !869, !870, !871, !1147, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1184}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !768, file: !759, line: 127, baseType: !771, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !768, file: !759, line: 127, baseType: !771, size: 64, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !768, file: !759, line: 128, baseType: !215, size: 64, offset: 128)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !768, file: !759, line: 129, baseType: !215, size: 64, offset: 192)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !768, file: !759, line: 130, baseType: !260, size: 512, offset: 256)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !768, file: !759, line: 132, baseType: !50, size: 32, offset: 768)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !768, file: !759, line: 132, baseType: !50, size: 32, offset: 800)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !768, file: !759, line: 133, baseType: !50, size: 32, offset: 832)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !768, file: !759, line: 134, baseType: !50, size: 32, offset: 864)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !768, file: !759, line: 134, baseType: !50, size: 32, offset: 896)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !768, file: !759, line: 134, baseType: !50, size: 32, offset: 928)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !768, file: !759, line: 135, baseType: !50, size: 32, offset: 960)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !768, file: !759, line: 135, baseType: !50, size: 32, offset: 992)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !768, file: !759, line: 136, baseType: !50, size: 32, offset: 1024)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !768, file: !759, line: 136, baseType: !50, size: 32, offset: 1056)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !768, file: !759, line: 137, baseType: !50, size: 32, offset: 1088)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !768, file: !759, line: 137, baseType: !50, size: 32, offset: 1120)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !768, file: !759, line: 138, baseType: !290, size: 32, offset: 1152)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !768, file: !759, line: 139, baseType: !290, size: 32, offset: 1184)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !768, file: !759, line: 139, baseType: !290, size: 32, offset: 1216)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !768, file: !759, line: 141, baseType: !244, size: 16, offset: 1248)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !768, file: !759, line: 142, baseType: !244, size: 16, offset: 1264)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !768, file: !759, line: 143, baseType: !50, size: 32, offset: 1280)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !768, file: !759, line: 144, baseType: !50, size: 32, offset: 1312)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !768, file: !759, line: 146, baseType: !796, size: 64, offset: 1344)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !759, line: 114, baseType: !798)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !759, line: 99, size: 7232, elements: !799)
!799 = !{!800, !802, !803, !804, !805, !806, !807, !815, !819, !834, !843, !850, !860}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !798, file: !759, line: 100, baseType: !801, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !798, file: !759, line: 100, baseType: !801, size: 64, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !798, file: !759, line: 101, baseType: !50, size: 32, offset: 128)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !798, file: !759, line: 101, baseType: !50, size: 32, offset: 160)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !798, file: !759, line: 102, baseType: !50, size: 32, offset: 192)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !798, file: !759, line: 102, baseType: !50, size: 32, offset: 224)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !798, file: !759, line: 103, baseType: !808, size: 64, offset: 256)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !759, line: 59, baseType: !810)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !759, line: 56, size: 2112, elements: !811)
!811 = !{!812, !813, !814}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !810, file: !759, line: 57, baseType: !330, size: 2048)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !810, file: !759, line: 58, baseType: !50, size: 32, offset: 2048)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !810, file: !759, line: 58, baseType: !50, size: 32, offset: 2080)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !798, file: !759, line: 106, baseType: !816, size: 6144, offset: 320)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 6144, elements: !817)
!817 = !{!818}
!818 = !DISubrange(count: 768)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !798, file: !759, line: 107, baseType: !820, size: 64, offset: 6464)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !759, line: 97, baseType: !822)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !759, line: 83, size: 8320, elements: !823)
!823 = !{!824, !825, !826, !830, !831, !832, !833}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !822, file: !759, line: 84, baseType: !816, size: 6144)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !822, file: !759, line: 87, baseType: !330, size: 2048, offset: 6144)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !822, file: !759, line: 88, baseType: !827, size: 64, offset: 8192)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !829, line: 41, flags: DIFlagFwdDecl)
!829 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!830 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !822, file: !759, line: 90, baseType: !244, size: 16, offset: 8256)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !822, file: !759, line: 92, baseType: !244, size: 16, offset: 8272)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !822, file: !759, line: 93, baseType: !244, size: 16, offset: 8288)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !822, file: !759, line: 95, baseType: !244, size: 16, offset: 8304)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !798, file: !759, line: 108, baseType: !835, size: 64, offset: 6528)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !759, line: 66, baseType: !837)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !759, line: 61, size: 128, elements: !838)
!838 = !{!839, !840, !841, !842}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !837, file: !759, line: 62, baseType: !50, size: 32)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !837, file: !759, line: 63, baseType: !50, size: 32, offset: 32)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !837, file: !759, line: 64, baseType: !50, size: 32, offset: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !837, file: !759, line: 65, baseType: !50, size: 32, offset: 96)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !798, file: !759, line: 109, baseType: !844, size: 64, offset: 6592)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !759, line: 71, baseType: !846)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !759, line: 68, size: 64, elements: !847)
!847 = !{!848, !849}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !846, file: !759, line: 69, baseType: !50, size: 32)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !846, file: !759, line: 70, baseType: !50, size: 32, offset: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !798, file: !759, line: 110, baseType: !851, size: 64, offset: 6656)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !759, line: 81, baseType: !853)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !759, line: 73, size: 352, elements: !854)
!854 = !{!855, !856, !857, !858, !859}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !853, file: !759, line: 74, baseType: !383, size: 96)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !853, file: !759, line: 75, baseType: !383, size: 96, offset: 96)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !853, file: !759, line: 76, baseType: !383, size: 96, offset: 192)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !853, file: !759, line: 77, baseType: !50, size: 32, offset: 288)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !853, file: !759, line: 78, baseType: !50, size: 32, offset: 320)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !798, file: !759, line: 113, baseType: !861, size: 512, offset: 6720)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !862, line: 182, baseType: !863)
!862 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !862, line: 180, size: 512, elements: !864)
!864 = !{!865}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !863, file: !862, line: 181, baseType: !260, size: 512)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !768, file: !759, line: 148, baseType: !867, size: 64, offset: 1408)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !643, line: 46, flags: DIFlagFwdDecl)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !768, file: !759, line: 151, baseType: !580, size: 64, offset: 1472)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !768, file: !759, line: 152, baseType: !641, size: 64, offset: 1536)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !768, file: !759, line: 153, baseType: !872, size: 64, offset: 1600)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !874, line: 64, size: 19136, elements: !875)
!874 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!875 = !{!876, !877, !878, !879, !880, !881, !883, !884, !885, !886, !889, !890, !1133, !1134, !1142, !1143, !1144, !1145, !1146}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !873, file: !874, line: 65, baseType: !210, size: 960)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !873, file: !874, line: 66, baseType: !586, size: 64, offset: 960)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !873, file: !874, line: 68, baseType: !230, size: 8192, offset: 1024)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !873, file: !874, line: 70, baseType: !50, size: 32, offset: 9216)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !873, file: !874, line: 71, baseType: !50, size: 32, offset: 9248)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !873, file: !874, line: 72, baseType: !882, size: 64, offset: 9280)
!882 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 64, elements: !371)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !873, file: !874, line: 74, baseType: !290, size: 32, offset: 9344)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !873, file: !874, line: 74, baseType: !290, size: 32, offset: 9376)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !873, file: !874, line: 76, baseType: !827, size: 64, offset: 9408)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !873, file: !874, line: 77, baseType: !887, size: 64, offset: 9472)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !874, line: 77, flags: DIFlagFwdDecl)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !873, file: !874, line: 78, baseType: !689, size: 64, offset: 9536)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !873, file: !874, line: 80, baseType: !891, size: 2624, offset: 9600)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !892, line: 340, size: 2624, elements: !893)
!892 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!893 = !{!894, !922, !940, !941, !942, !959, !1015, !1016, !1113, !1114, !1115, !1116, !1122}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !891, file: !892, line: 341, baseType: !895, size: 576)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !892, line: 251, baseType: !896)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !892, line: 207, size: 576, elements: !897)
!897 = !{!898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !896, file: !892, line: 208, baseType: !50, size: 32)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !896, file: !892, line: 211, baseType: !244, size: 16, offset: 32)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !896, file: !892, line: 212, baseType: !244, size: 16, offset: 48)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !896, file: !892, line: 213, baseType: !290, size: 32, offset: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !896, file: !892, line: 214, baseType: !244, size: 16, offset: 96)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !896, file: !892, line: 215, baseType: !244, size: 16, offset: 112)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !896, file: !892, line: 216, baseType: !244, size: 16, offset: 128)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !896, file: !892, line: 217, baseType: !244, size: 16, offset: 144)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !896, file: !892, line: 218, baseType: !244, size: 16, offset: 160)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !896, file: !892, line: 219, baseType: !244, size: 16, offset: 176)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !896, file: !892, line: 220, baseType: !290, size: 32, offset: 192)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !896, file: !892, line: 222, baseType: !244, size: 16, offset: 224)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !896, file: !892, line: 225, baseType: !244, size: 16, offset: 240)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !896, file: !892, line: 228, baseType: !50, size: 32, offset: 256)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !896, file: !892, line: 229, baseType: !50, size: 32, offset: 288)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !896, file: !892, line: 233, baseType: !50, size: 32, offset: 320)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !896, file: !892, line: 236, baseType: !244, size: 16, offset: 352)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !896, file: !892, line: 236, baseType: !244, size: 16, offset: 368)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !896, file: !892, line: 241, baseType: !290, size: 32, offset: 384)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !896, file: !892, line: 244, baseType: !50, size: 32, offset: 416)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !896, file: !892, line: 244, baseType: !50, size: 32, offset: 448)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !896, file: !892, line: 245, baseType: !290, size: 32, offset: 480)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !896, file: !892, line: 248, baseType: !290, size: 32, offset: 512)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !896, file: !892, line: 250, baseType: !50, size: 32, offset: 544)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !891, file: !892, line: 342, baseType: !923, size: 448, offset: 576)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !892, line: 79, baseType: !924)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !892, line: 61, size: 448, elements: !925)
!925 = !{!926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !924, file: !892, line: 62, baseType: !215, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !924, file: !892, line: 64, baseType: !244, size: 16, offset: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !924, file: !892, line: 65, baseType: !244, size: 16, offset: 80)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !924, file: !892, line: 67, baseType: !290, size: 32, offset: 96)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !924, file: !892, line: 68, baseType: !290, size: 32, offset: 128)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !924, file: !892, line: 69, baseType: !290, size: 32, offset: 160)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !924, file: !892, line: 70, baseType: !244, size: 16, offset: 192)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !924, file: !892, line: 71, baseType: !244, size: 16, offset: 208)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !924, file: !892, line: 72, baseType: !370, size: 64, offset: 224)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !924, file: !892, line: 75, baseType: !290, size: 32, offset: 288)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !924, file: !892, line: 75, baseType: !290, size: 32, offset: 320)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !924, file: !892, line: 75, baseType: !290, size: 32, offset: 352)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !924, file: !892, line: 78, baseType: !290, size: 32, offset: 384)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !924, file: !892, line: 78, baseType: !290, size: 32, offset: 416)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !891, file: !892, line: 343, baseType: !270, size: 128, offset: 1024)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !891, file: !892, line: 344, baseType: !270, size: 128, offset: 1152)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !891, file: !892, line: 345, baseType: !943, size: 192, offset: 1280)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !892, line: 278, baseType: !944)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !892, line: 270, size: 192, elements: !945)
!945 = !{!946, !947, !948, !949, !950}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !944, file: !892, line: 271, baseType: !50, size: 32)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !944, file: !892, line: 273, baseType: !290, size: 32, offset: 32)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !944, file: !892, line: 275, baseType: !50, size: 32, offset: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !944, file: !892, line: 276, baseType: !50, size: 32, offset: 96)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !944, file: !892, line: 277, baseType: !951, size: 64, offset: 128)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !892, line: 55, size: 576, elements: !953)
!953 = !{!954, !955, !956}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !952, file: !892, line: 56, baseType: !50, size: 32)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !952, file: !892, line: 57, baseType: !290, size: 32, offset: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !952, file: !892, line: 58, baseType: !957, size: 512, offset: 64)
!957 = !DICompositeType(tag: DW_TAG_array_type, baseType: !290, size: 512, elements: !958)
!958 = !{!318, !318}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !891, file: !892, line: 346, baseType: !960, size: 384, offset: 1472)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !892, line: 268, baseType: !961)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !892, line: 253, size: 384, elements: !962)
!962 = !{!963, !964, !965, !966, !967, !1009, !1010, !1011, !1012, !1013, !1014}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !961, file: !892, line: 254, baseType: !50, size: 32)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !961, file: !892, line: 255, baseType: !50, size: 32, offset: 32)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !961, file: !892, line: 255, baseType: !50, size: 32, offset: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !961, file: !892, line: 258, baseType: !290, size: 32, offset: 96)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !961, file: !892, line: 259, baseType: !968, size: 64, offset: 128)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !892, line: 164, baseType: !970)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !892, line: 108, size: 1664, elements: !971)
!971 = !{!972, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !970, file: !892, line: 109, baseType: !973, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !970, file: !892, line: 109, baseType: !973, size: 64, offset: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !970, file: !892, line: 111, baseType: !260, size: 512, offset: 128)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !970, file: !892, line: 119, baseType: !370, size: 64, offset: 640)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !970, file: !892, line: 119, baseType: !370, size: 64, offset: 704)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !970, file: !892, line: 125, baseType: !370, size: 64, offset: 768)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !970, file: !892, line: 125, baseType: !370, size: 64, offset: 832)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !970, file: !892, line: 127, baseType: !370, size: 64, offset: 896)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !970, file: !892, line: 130, baseType: !50, size: 32, offset: 960)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !970, file: !892, line: 131, baseType: !50, size: 32, offset: 992)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !970, file: !892, line: 132, baseType: !984, size: 64, offset: 1024)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !892, line: 106, baseType: !986)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !892, line: 81, size: 512, elements: !987)
!987 = !{!988, !989, !990, !991, !992, !993}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !986, file: !892, line: 82, baseType: !370, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !986, file: !892, line: 97, baseType: !464, size: 256, offset: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !986, file: !892, line: 102, baseType: !370, size: 64, offset: 320)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !986, file: !892, line: 102, baseType: !370, size: 64, offset: 384)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !986, file: !892, line: 104, baseType: !50, size: 32, offset: 448)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !986, file: !892, line: 105, baseType: !50, size: 32, offset: 480)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !970, file: !892, line: 135, baseType: !383, size: 96, offset: 1088)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !970, file: !892, line: 136, baseType: !290, size: 32, offset: 1184)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !970, file: !892, line: 139, baseType: !50, size: 32, offset: 1216)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !970, file: !892, line: 139, baseType: !50, size: 32, offset: 1248)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !970, file: !892, line: 139, baseType: !50, size: 32, offset: 1280)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !970, file: !892, line: 140, baseType: !383, size: 96, offset: 1312)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !970, file: !892, line: 143, baseType: !244, size: 16, offset: 1408)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !970, file: !892, line: 144, baseType: !244, size: 16, offset: 1424)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !970, file: !892, line: 145, baseType: !244, size: 16, offset: 1440)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !970, file: !892, line: 148, baseType: !244, size: 16, offset: 1456)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !970, file: !892, line: 149, baseType: !50, size: 32, offset: 1472)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !970, file: !892, line: 150, baseType: !290, size: 32, offset: 1504)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !970, file: !892, line: 152, baseType: !689, size: 64, offset: 1536)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !970, file: !892, line: 163, baseType: !290, size: 32, offset: 1600)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !970, file: !892, line: 163, baseType: !290, size: 32, offset: 1632)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !961, file: !892, line: 261, baseType: !290, size: 32, offset: 192)
