; ModuleID = 'blender/source/blender/editors/space_view3d/view3d_ops.c'
source_filename = "blender/source/blender/editors/space_view3d/view3d_ops.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.wmOperatorType = type { i8*, i8*, i8*, i8*, i32 (%struct.bContext*, %struct.wmOperator*)*, i8 (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, void (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, i32 (%struct.bContext*)*, void (%struct.bContext*, %struct.wmOperator*)*, %struct.StructRNA*, %struct.IDProperty*, %struct.PropertyRNA*, %struct.ListBase, %struct.wmKeyMap*, i8*, i32 (%struct.bContext*, %struct.wmOperatorType*)*, %struct.ExtensionRNA, i16 }
%struct.bContext = type opaque
%struct.wmOperator = type { %struct.wmOperator*, %struct.wmOperator*, [64 x i8], %struct.IDProperty*, %struct.wmOperatorType*, i8*, i8*, %struct.PointerRNA*, %struct.ReportList*, %struct.ListBase, %struct.wmOperator*, %struct.uiLayout*, i16, [3 x i16] }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }
%struct.ReportList = type { %struct.ListBase, i32, i32, i32, i32, %struct.wmTimer* }
%struct.wmTimer = type { %struct.wmTimer*, %struct.wmTimer*, %struct.wmWindow*, double, i32, i8*, double, double, double, double, double, i32 }

!238 = !DIEnumerator(name: "RPT_ERROR", value: 32, isUnsigned: true)
!239 = !DIEnumerator(name: "RPT_ERROR_INVALID_INPUT", value: 64, isUnsigned: true)
!240 = !DIEnumerator(name: "RPT_ERROR_INVALID_CONTEXT", value: 128, isUnsigned: true)
!241 = !DIEnumerator(name: "RPT_ERROR_OUT_OF_MEMORY", value: 256, isUnsigned: true)
!242 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !231, line: 351, baseType: !5, size: 32, elements: !243)
!243 = !{!244, !245, !246, !247, !248, !249}
!244 = !DIEnumerator(name: "OPERATOR_RUNNING_MODAL", value: 1, isUnsigned: true)
!245 = !DIEnumerator(name: "OPERATOR_CANCELLED", value: 2, isUnsigned: true)
!246 = !DIEnumerator(name: "OPERATOR_FINISHED", value: 4, isUnsigned: true)
!247 = !DIEnumerator(name: "OPERATOR_PASS_THROUGH", value: 8, isUnsigned: true)
!248 = !DIEnumerator(name: "OPERATOR_HANDLED", value: 16, isUnsigned: true)
!249 = !DIEnumerator(name: "OPERATOR_INTERFACE", value: 32, isUnsigned: true)
!250 = !{!251}
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!252 = !{i32 7, !"Dwarf Version", i32 4}
!253 = !{i32 2, !"Debug Info Version", i32 3}
!254 = !{i32 1, !"wchar_size", i32 4}
!255 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!256 = distinct !DISubprogram(name: "view3d_operatortypes", scope: !1, file: !1, line: 137, type: !257, scopeLine: 138, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !259)
!257 = !DISubroutineType(types: !258)
!258 = !{null}
!259 = !{}
!260 = !DILocation(line: 139, column: 2, scope: !256)
!261 = !DILocation(line: 140, column: 2, scope: !256)
!262 = !DILocation(line: 141, column: 2, scope: !256)
!263 = !DILocation(line: 142, column: 2, scope: !256)
!264 = !DILocation(line: 143, column: 2, scope: !256)
!265 = !DILocation(line: 144, column: 2, scope: !256)
!266 = !DILocation(line: 145, column: 2, scope: !256)
!267 = !DILocation(line: 146, column: 2, scope: !256)
!268 = !DILocation(line: 147, column: 2, scope: !256)
!269 = !DILocation(line: 148, column: 2, scope: !256)
!270 = !DILocation(line: 149, column: 2, scope: !256)
!271 = !DILocation(line: 150, column: 2, scope: !256)
!272 = !DILocation(line: 151, column: 2, scope: !256)
!273 = !DILocation(line: 152, column: 2, scope: !256)
!274 = !DILocation(line: 153, column: 2, scope: !256)
!275 = !DILocation(line: 154, column: 2, scope: !256)
!276 = !DILocation(line: 155, column: 2, scope: !256)
!277 = !DILocation(line: 156, column: 2, scope: !256)
!278 = !DILocation(line: 157, column: 2, scope: !256)
!279 = !DILocation(line: 158, column: 2, scope: !256)
!280 = !DILocation(line: 159, column: 2, scope: !256)
!281 = !DILocation(line: 160, column: 2, scope: !256)
!282 = !DILocation(line: 161, column: 2, scope: !256)
!283 = !DILocation(line: 162, column: 2, scope: !256)
!284 = !DILocation(line: 163, column: 2, scope: !256)
!285 = !DILocation(line: 164, column: 2, scope: !256)
!286 = !DILocation(line: 165, column: 2, scope: !256)
!287 = !DILocation(line: 166, column: 2, scope: !256)
!288 = !DILocation(line: 167, column: 2, scope: !256)
!289 = !DILocation(line: 168, column: 2, scope: !256)
!290 = !DILocation(line: 169, column: 2, scope: !256)
!291 = !DILocation(line: 170, column: 2, scope: !256)
!292 = !DILocation(line: 171, column: 2, scope: !256)
!293 = !DILocation(line: 172, column: 2, scope: !256)
!294 = !DILocation(line: 173, column: 2, scope: !256)
!295 = !DILocation(line: 174, column: 2, scope: !256)
!296 = !DILocation(line: 175, column: 2, scope: !256)
!297 = !DILocation(line: 176, column: 2, scope: !256)
!298 = !DILocation(line: 177, column: 2, scope: !256)
!299 = !DILocation(line: 178, column: 2, scope: !256)
!300 = !DILocation(line: 179, column: 2, scope: !256)
!301 = !DILocation(line: 180, column: 2, scope: !256)
!302 = !DILocation(line: 181, column: 2, scope: !256)
!303 = !DILocation(line: 182, column: 2, scope: !256)
!304 = !DILocation(line: 183, column: 2, scope: !256)
!305 = !DILocation(line: 184, column: 2, scope: !256)
!306 = !DILocation(line: 185, column: 2, scope: !256)
!307 = !DILocation(line: 186, column: 2, scope: !256)
!308 = !DILocation(line: 187, column: 2, scope: !256)
!309 = !DILocation(line: 189, column: 2, scope: !256)
!310 = !DILocation(line: 190, column: 2, scope: !256)
!311 = !DILocation(line: 192, column: 2, scope: !256)
!312 = !DILocation(line: 193, column: 2, scope: !256)
!313 = !DILocation(line: 194, column: 2, scope: !256)
!314 = !DILocation(line: 195, column: 2, scope: !256)
!315 = !DILocation(line: 196, column: 2, scope: !256)
!316 = !DILocation(line: 197, column: 2, scope: !256)
!317 = !DILocation(line: 199, column: 2, scope: !256)
!318 = !DILocation(line: 200, column: 1, scope: !256)
!319 = distinct !DISubprogram(name: "VIEW3D_OT_copybuffer", scope: !1, file: !1, line: 88, type: !320, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !259)
!320 = !DISubroutineType(types: !321)
!321 = !{null, !322}
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorType", file: !324, line: 568, baseType: !325)
!324 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !324, line: 508, size: 1536, elements: !326)
!326 = !{!327, !331, !332, !333, !334, !2045, !2049, !2055, !2059, !2060, !2064, !2065, !2066, !2067, !2071, !2072, !2087, !2088, !2092, !2118}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !325, file: !324, line: 509, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !330)
!330 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !325, file: !324, line: 510, baseType: !328, size: 64, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !325, file: !324, line: 511, baseType: !328, size: 64, offset: 128)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !325, file: !324, line: 512, baseType: !328, size: 64, offset: 192)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !325, file: !324, line: 518, baseType: !335, size: 64, offset: 256)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!338, !339, !342}
!338 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !341, line: 60, flags: DIFlagFwdDecl)
!341 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_blender.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !231, line: 328, size: 1344, elements: !344)
!344 = !{!345, !346, !347, !351, !382, !384, !385, !386, !400, !2038, !2039, !2040, !2043, !2044}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !343, file: !231, line: 329, baseType: !342, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !343, file: !231, line: 329, baseType: !342, size: 64, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !343, file: !231, line: 332, baseType: !348, size: 512, offset: 128)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !330, size: 512, elements: !349)
!349 = !{!350}
!350 = !DISubrange(count: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !343, file: !231, line: 333, baseType: !352, size: 64, offset: 640)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !354, line: 75, baseType: !355)
!354 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !354, line: 62, size: 1024, elements: !356)
!356 = !{!357, !359, !360, !361, !362, !364, !365, !366, !380, !381}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !355, file: !354, line: 63, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !355, file: !354, line: 63, baseType: !358, size: 64, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !355, file: !354, line: 64, baseType: !330, size: 8, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !355, file: !354, line: 64, baseType: !330, size: 8, offset: 136)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !355, file: !354, line: 65, baseType: !363, size: 16, offset: 144)
!363 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !355, file: !354, line: 66, baseType: !348, size: 512, offset: 160)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !355, file: !354, line: 67, baseType: !338, size: 32, offset: 672)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !355, file: !354, line: 69, baseType: !367, size: 256, offset: 704)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !354, line: 60, baseType: !368)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !354, line: 48, size: 256, elements: !369)
!369 = !{!370, !371, !378, !379}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !368, file: !354, line: 49, baseType: !251, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !368, file: !354, line: 58, baseType: !372, size: 128, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !373, line: 71, baseType: !374)
!373 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !373, line: 69, size: 128, elements: !375)
!375 = !{!376, !377}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !374, file: !373, line: 70, baseType: !251, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !374, file: !373, line: 70, baseType: !251, size: 64, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !368, file: !354, line: 59, baseType: !338, size: 32, offset: 192)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !368, file: !354, line: 59, baseType: !338, size: 32, offset: 224)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !355, file: !354, line: 70, baseType: !338, size: 32, offset: 960)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !355, file: !354, line: 74, baseType: !338, size: 32, offset: 992)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !343, file: !231, line: 336, baseType: !383, size: 64, offset: 704)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !343, file: !231, line: 337, baseType: !251, size: 64, offset: 768)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !343, file: !231, line: 338, baseType: !251, size: 64, offset: 832)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !343, file: !231, line: 340, baseType: !387, size: 64, offset: 896)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !389, line: 55, size: 192, elements: !390)
!389 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!390 = !{!391, !395, !399}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !388, file: !389, line: 58, baseType: !392, size: 64)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !388, file: !389, line: 56, size: 64, elements: !393)
!393 = !{!394}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !392, file: !389, line: 57, baseType: !251, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !388, file: !389, line: 60, baseType: !396, size: 64, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !398, line: 335, flags: DIFlagFwdDecl)
!398 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!399 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !388, file: !389, line: 61, baseType: !251, size: 64, offset: 128)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !343, file: !231, line: 341, baseType: !401, size: 64, offset: 960)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !231, line: 106, size: 320, elements: !403)
!403 = !{!404, !405, !406, !407, !408, !409}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !402, file: !231, line: 107, baseType: !372, size: 128)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !402, file: !231, line: 108, baseType: !338, size: 32, offset: 128)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !402, file: !231, line: 109, baseType: !338, size: 32, offset: 160)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !402, file: !231, line: 110, baseType: !338, size: 32, offset: 192)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !402, file: !231, line: 110, baseType: !338, size: 32, offset: 224)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !402, file: !231, line: 111, baseType: !410, size: 64, offset: 256)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !324, line: 490, size: 768, elements: !412)
!412 = !{!413, !414, !415, !2029, !2030, !2031, !2032, !2033, !2034, !2035, !2036, !2037}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !411, file: !324, line: 491, baseType: !410, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !411, file: !324, line: 491, baseType: !410, size: 64, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !411, file: !324, line: 493, baseType: !416, size: 64, offset: 128)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !231, line: 169, size: 2048, elements: !418)
!418 = !{!419, !420, !421, !422, !1946, !1947, !1948, !1949, !1950, !1951, !1952, !1953, !1954, !1955, !1956, !1957, !1958, !1959, !1960, !1961, !1962, !1963, !2004, !2007, !2021, !2022, !2023, !2024, !2025, !2026, !2027, !2028}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !417, file: !231, line: 170, baseType: !416, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !417, file: !231, line: 170, baseType: !416, size: 64, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !417, file: !231, line: 172, baseType: !251, size: 64, offset: 128)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !417, file: !231, line: 174, baseType: !423, size: 64, offset: 192)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !425, line: 49, size: 1984, elements: !426)
!425 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!426 = !{!427, !463, !464, !465, !466, !467, !1929, !1930, !1931, !1932, !1933, !1934, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !424, file: !425, line: 50, baseType: !428, size: 960)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !354, line: 130, baseType: !429)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !354, line: 117, size: 960, elements: !430)
!430 = !{!431, !432, !433, !435, !454, !458, !459, !460, !461, !462}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !429, file: !354, line: 118, baseType: !251, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !429, file: !354, line: 118, baseType: !251, size: 64, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !429, file: !354, line: 119, baseType: !434, size: 64, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !429, file: !354, line: 120, baseType: !436, size: 64, offset: 192)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !354, line: 136, size: 17600, elements: !438)
!438 = !{!439, !440, !442, !445, !449, !450, !451}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !437, file: !354, line: 137, baseType: !428, size: 960)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !437, file: !354, line: 138, baseType: !441, size: 64, offset: 960)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !437, file: !354, line: 139, baseType: !443, size: 64, offset: 1024)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !354, line: 43, flags: DIFlagFwdDecl)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !437, file: !354, line: 140, baseType: !446, size: 8192, offset: 1088)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !330, size: 8192, elements: !447)
!447 = !{!448}
!448 = !DISubrange(count: 1024)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !437, file: !354, line: 141, baseType: !446, size: 8192, offset: 9280)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !437, file: !354, line: 148, baseType: !436, size: 64, offset: 17472)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !437, file: !354, line: 150, baseType: !452, size: 64, offset: 17536)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !354, line: 45, flags: DIFlagFwdDecl)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !429, file: !354, line: 121, baseType: !455, size: 528, offset: 256)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !330, size: 528, elements: !456)
!456 = !{!457}
!457 = !DISubrange(count: 66)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !429, file: !354, line: 126, baseType: !363, size: 16, offset: 784)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !429, file: !354, line: 127, baseType: !338, size: 32, offset: 800)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !429, file: !354, line: 128, baseType: !338, size: 32, offset: 832)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !429, file: !354, line: 128, baseType: !338, size: 32, offset: 864)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !429, file: !354, line: 129, baseType: !352, size: 64, offset: 896)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !424, file: !425, line: 52, baseType: !372, size: 128, offset: 960)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !424, file: !425, line: 53, baseType: !372, size: 128, offset: 1088)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !424, file: !425, line: 54, baseType: !372, size: 128, offset: 1216)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !424, file: !425, line: 55, baseType: !372, size: 128, offset: 1344)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !424, file: !425, line: 57, baseType: !468, size: 64, offset: 1472)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !470, line: 1216, size: 39680, elements: !471)
!470 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!471 = !{!472, !473, !477, !769, !772, !773, !774, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !800, !870, !1297, !1512, !1515, !1804, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1826, !1827, !1828, !1829, !1830, !1838, !1905, !1912, !1913, !1920, !1921, !1922, !1923, !1924, !1925, !1926}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !469, file: !470, line: 1217, baseType: !428, size: 960)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !469, file: !470, line: 1218, baseType: !474, size: 64, offset: 960)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !476, line: 45, flags: DIFlagFwdDecl)
!476 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!477 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !469, file: !470, line: 1220, baseType: !478, size: 64, offset: 1024)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !480, line: 115, size: 11392, elements: !481)
!480 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!481 = !{!482, !483, !484, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !501, !513, !527, !528, !571, !572, !575, !576, !592, !593, !594, !595, !596, !597, !598, !602, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !618, !619, !620, !621, !622, !623, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !683, !684, !685, !686, !687, !688, !689, !690, !691, !694, !697, !700, !701, !702, !703, !704, !707, !710, !713, !714, !720, !721, !722, !723, !724, !725, !727, !730, !733, !737, !757, !758}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !479, file: !480, line: 116, baseType: !428, size: 960)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !479, file: !480, line: 117, baseType: !474, size: 64, offset: 960)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !479, file: !480, line: 119, baseType: !485, size: 64, offset: 1024)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !480, line: 57, flags: DIFlagFwdDecl)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !479, file: !480, line: 121, baseType: !363, size: 16, offset: 1088)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !479, file: !480, line: 121, baseType: !363, size: 16, offset: 1104)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !479, file: !480, line: 122, baseType: !338, size: 32, offset: 1120)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !479, file: !480, line: 122, baseType: !338, size: 32, offset: 1152)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !479, file: !480, line: 122, baseType: !338, size: 32, offset: 1184)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !479, file: !480, line: 123, baseType: !348, size: 512, offset: 1216)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !479, file: !480, line: 124, baseType: !478, size: 64, offset: 1728)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !479, file: !480, line: 124, baseType: !478, size: 64, offset: 1792)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !479, file: !480, line: 127, baseType: !478, size: 64, offset: 1856)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !479, file: !480, line: 127, baseType: !478, size: 64, offset: 1920)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !479, file: !480, line: 127, baseType: !478, size: 64, offset: 1984)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !479, file: !480, line: 128, baseType: !499, size: 64, offset: 2048)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !476, line: 46, flags: DIFlagFwdDecl)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !479, file: !480, line: 130, baseType: !502, size: 64, offset: 2112)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !480, line: 97, size: 832, elements: !504)
!504 = !{!505, !511, !512}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !503, file: !480, line: 98, baseType: !506, size: 768)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !507, size: 768, elements: !508)
!507 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!508 = !{!509, !510}
!509 = !DISubrange(count: 8)
!510 = !DISubrange(count: 3)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !503, file: !480, line: 99, baseType: !338, size: 32, offset: 768)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !503, file: !480, line: 99, baseType: !338, size: 32, offset: 800)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !479, file: !480, line: 131, baseType: !514, size: 64, offset: 2176)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !516, line: 486, size: 1600, elements: !517)
!516 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!517 = !{!518, !519, !520, !521, !522, !523, !524, !525, !526}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !515, file: !516, line: 487, baseType: !428, size: 960)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !515, file: !516, line: 489, baseType: !372, size: 128, offset: 960)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !515, file: !516, line: 490, baseType: !372, size: 128, offset: 1088)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !515, file: !516, line: 491, baseType: !372, size: 128, offset: 1216)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !515, file: !516, line: 492, baseType: !372, size: 128, offset: 1344)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !515, file: !516, line: 494, baseType: !338, size: 32, offset: 1472)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !515, file: !516, line: 495, baseType: !338, size: 32, offset: 1504)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !515, file: !516, line: 497, baseType: !338, size: 32, offset: 1536)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !515, file: !516, line: 498, baseType: !338, size: 32, offset: 1568)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !479, file: !480, line: 132, baseType: !514, size: 64, offset: 2240)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !479, file: !480, line: 133, baseType: !529, size: 64, offset: 2304)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !516, line: 334, size: 1728, elements: !531)
!531 = !{!532, !533, !536, !537, !538, !539, !540, !541, !544, !545, !546, !547, !548, !549, !550, !570}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !530, file: !516, line: 335, baseType: !372, size: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !530, file: !516, line: 336, baseType: !534, size: 64, offset: 128)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !516, line: 47, flags: DIFlagFwdDecl)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !530, file: !516, line: 338, baseType: !363, size: 16, offset: 192)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !530, file: !516, line: 338, baseType: !363, size: 16, offset: 208)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !530, file: !516, line: 339, baseType: !5, size: 32, offset: 224)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !530, file: !516, line: 340, baseType: !338, size: 32, offset: 256)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !530, file: !516, line: 342, baseType: !507, size: 32, offset: 288)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !530, file: !516, line: 343, baseType: !542, size: 96, offset: 320)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !507, size: 96, elements: !543)
!543 = !{!510}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !530, file: !516, line: 344, baseType: !542, size: 96, offset: 416)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !530, file: !516, line: 347, baseType: !372, size: 128, offset: 512)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !530, file: !516, line: 349, baseType: !338, size: 32, offset: 640)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !530, file: !516, line: 350, baseType: !338, size: 32, offset: 672)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !530, file: !516, line: 351, baseType: !251, size: 64, offset: 704)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !530, file: !516, line: 352, baseType: !251, size: 64, offset: 768)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !530, file: !516, line: 354, baseType: !551, size: 384, offset: 832)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !516, line: 116, baseType: !552)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !516, line: 94, size: 384, elements: !553)
!553 = !{!554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !552, file: !516, line: 96, baseType: !338, size: 32)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !552, file: !516, line: 96, baseType: !338, size: 32, offset: 32)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !552, file: !516, line: 97, baseType: !338, size: 32, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !552, file: !516, line: 97, baseType: !338, size: 32, offset: 96)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !552, file: !516, line: 99, baseType: !363, size: 16, offset: 128)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !552, file: !516, line: 100, baseType: !363, size: 16, offset: 144)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !552, file: !516, line: 102, baseType: !363, size: 16, offset: 160)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !552, file: !516, line: 105, baseType: !363, size: 16, offset: 176)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !552, file: !516, line: 108, baseType: !363, size: 16, offset: 192)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !552, file: !516, line: 109, baseType: !363, size: 16, offset: 208)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !552, file: !516, line: 111, baseType: !363, size: 16, offset: 224)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !552, file: !516, line: 112, baseType: !363, size: 16, offset: 240)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !552, file: !516, line: 114, baseType: !338, size: 32, offset: 256)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !552, file: !516, line: 114, baseType: !338, size: 32, offset: 288)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !552, file: !516, line: 115, baseType: !338, size: 32, offset: 320)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !552, file: !516, line: 115, baseType: !338, size: 32, offset: 352)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !530, file: !516, line: 355, baseType: !348, size: 512, offset: 1216)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !479, file: !480, line: 134, baseType: !251, size: 64, offset: 2368)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !479, file: !480, line: 136, baseType: !573, size: 64, offset: 2432)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !480, line: 58, flags: DIFlagFwdDecl)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !479, file: !480, line: 138, baseType: !551, size: 384, offset: 2496)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !479, file: !480, line: 139, baseType: !577, size: 64, offset: 2880)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !516, line: 80, baseType: !579)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !516, line: 72, size: 192, elements: !580)
!580 = !{!581, !588, !589, !590, !591}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !579, file: !516, line: 73, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !516, line: 59, baseType: !584)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !516, line: 56, size: 128, elements: !585)
!585 = !{!586, !587}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !584, file: !516, line: 57, baseType: !542, size: 96)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !584, file: !516, line: 58, baseType: !338, size: 32, offset: 96)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !579, file: !516, line: 74, baseType: !338, size: 32, offset: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !579, file: !516, line: 76, baseType: !338, size: 32, offset: 96)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !579, file: !516, line: 77, baseType: !338, size: 32, offset: 128)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !579, file: !516, line: 79, baseType: !338, size: 32, offset: 160)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !479, file: !480, line: 141, baseType: !372, size: 128, offset: 2944)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !479, file: !480, line: 142, baseType: !372, size: 128, offset: 3072)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !479, file: !480, line: 143, baseType: !372, size: 128, offset: 3200)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !479, file: !480, line: 144, baseType: !372, size: 128, offset: 3328)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !479, file: !480, line: 146, baseType: !338, size: 32, offset: 3456)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !479, file: !480, line: 147, baseType: !338, size: 32, offset: 3488)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !479, file: !480, line: 150, baseType: !599, size: 64, offset: 3520)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !480, line: 50, flags: DIFlagFwdDecl)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !479, file: !480, line: 151, baseType: !603, size: 64, offset: 3584)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !479, file: !480, line: 152, baseType: !338, size: 32, offset: 3648)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !479, file: !480, line: 153, baseType: !338, size: 32, offset: 3680)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !479, file: !480, line: 156, baseType: !542, size: 96, offset: 3712)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !479, file: !480, line: 156, baseType: !542, size: 96, offset: 3808)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !479, file: !480, line: 156, baseType: !542, size: 96, offset: 3904)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !479, file: !480, line: 157, baseType: !542, size: 96, offset: 4000)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !479, file: !480, line: 158, baseType: !542, size: 96, offset: 4096)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !479, file: !480, line: 159, baseType: !542, size: 96, offset: 4192)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !479, file: !480, line: 160, baseType: !542, size: 96, offset: 4288)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !479, file: !480, line: 160, baseType: !542, size: 96, offset: 4384)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !479, file: !480, line: 161, baseType: !615, size: 128, offset: 4480)
!615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !507, size: 128, elements: !616)
!616 = !{!617}
!617 = !DISubrange(count: 4)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !479, file: !480, line: 161, baseType: !615, size: 128, offset: 4608)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !479, file: !480, line: 162, baseType: !542, size: 96, offset: 4736)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !479, file: !480, line: 162, baseType: !542, size: 96, offset: 4832)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !479, file: !480, line: 163, baseType: !507, size: 32, offset: 4928)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !479, file: !480, line: 163, baseType: !507, size: 32, offset: 4960)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !479, file: !480, line: 164, baseType: !624, size: 512, offset: 4992)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !507, size: 512, elements: !625)
!625 = !{!617, !617}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !479, file: !480, line: 165, baseType: !624, size: 512, offset: 5504)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !479, file: !480, line: 166, baseType: !624, size: 512, offset: 6016)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !479, file: !480, line: 167, baseType: !624, size: 512, offset: 6528)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !479, file: !480, line: 176, baseType: !624, size: 512, offset: 7040)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !479, file: !480, line: 178, baseType: !5, size: 32, offset: 7552)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !479, file: !480, line: 180, baseType: !363, size: 16, offset: 7584)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !479, file: !480, line: 181, baseType: !363, size: 16, offset: 7600)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !479, file: !480, line: 183, baseType: !363, size: 16, offset: 7616)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !479, file: !480, line: 183, baseType: !363, size: 16, offset: 7632)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !479, file: !480, line: 184, baseType: !363, size: 16, offset: 7648)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !479, file: !480, line: 184, baseType: !363, size: 16, offset: 7664)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !479, file: !480, line: 185, baseType: !363, size: 16, offset: 7680)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !479, file: !480, line: 186, baseType: !363, size: 16, offset: 7696)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !479, file: !480, line: 187, baseType: !363, size: 16, offset: 7712)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !479, file: !480, line: 188, baseType: !330, size: 8, offset: 7728)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !479, file: !480, line: 189, baseType: !330, size: 8, offset: 7736)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !479, file: !480, line: 192, baseType: !338, size: 32, offset: 7744)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !479, file: !480, line: 192, baseType: !338, size: 32, offset: 7776)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !479, file: !480, line: 192, baseType: !338, size: 32, offset: 7808)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !479, file: !480, line: 192, baseType: !338, size: 32, offset: 7840)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !479, file: !480, line: 194, baseType: !338, size: 32, offset: 7872)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !479, file: !480, line: 202, baseType: !507, size: 32, offset: 7904)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !479, file: !480, line: 202, baseType: !507, size: 32, offset: 7936)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !479, file: !480, line: 202, baseType: !507, size: 32, offset: 7968)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !479, file: !480, line: 211, baseType: !507, size: 32, offset: 8000)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !479, file: !480, line: 212, baseType: !507, size: 32, offset: 8032)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !479, file: !480, line: 213, baseType: !507, size: 32, offset: 8064)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !479, file: !480, line: 214, baseType: !507, size: 32, offset: 8096)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !479, file: !480, line: 215, baseType: !507, size: 32, offset: 8128)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !479, file: !480, line: 216, baseType: !507, size: 32, offset: 8160)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !479, file: !480, line: 219, baseType: !507, size: 32, offset: 8192)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !479, file: !480, line: 220, baseType: !507, size: 32, offset: 8224)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !479, file: !480, line: 221, baseType: !507, size: 32, offset: 8256)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !479, file: !480, line: 224, baseType: !660, size: 16, offset: 8288)
!660 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !479, file: !480, line: 224, baseType: !660, size: 16, offset: 8304)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !479, file: !480, line: 226, baseType: !363, size: 16, offset: 8320)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !479, file: !480, line: 228, baseType: !330, size: 8, offset: 8336)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !479, file: !480, line: 229, baseType: !330, size: 8, offset: 8344)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !479, file: !480, line: 231, baseType: !363, size: 16, offset: 8352)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !479, file: !480, line: 232, baseType: !330, size: 8, offset: 8368)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !479, file: !480, line: 233, baseType: !330, size: 8, offset: 8376)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !479, file: !480, line: 234, baseType: !507, size: 32, offset: 8384)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !479, file: !480, line: 235, baseType: !507, size: 32, offset: 8416)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !479, file: !480, line: 237, baseType: !372, size: 128, offset: 8448)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !479, file: !480, line: 238, baseType: !372, size: 128, offset: 8576)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !479, file: !480, line: 239, baseType: !372, size: 128, offset: 8704)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !479, file: !480, line: 240, baseType: !372, size: 128, offset: 8832)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !479, file: !480, line: 242, baseType: !507, size: 32, offset: 8960)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !479, file: !480, line: 244, baseType: !363, size: 16, offset: 8992)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !479, file: !480, line: 245, baseType: !660, size: 16, offset: 9008)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !479, file: !480, line: 246, baseType: !615, size: 128, offset: 9024)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !479, file: !480, line: 248, baseType: !338, size: 32, offset: 9152)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !479, file: !480, line: 249, baseType: !338, size: 32, offset: 9184)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !479, file: !480, line: 251, baseType: !681, size: 64, offset: 9216)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !480, line: 251, flags: DIFlagFwdDecl)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !479, file: !480, line: 253, baseType: !330, size: 8, offset: 9280)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !479, file: !480, line: 254, baseType: !330, size: 8, offset: 9288)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !479, file: !480, line: 255, baseType: !363, size: 16, offset: 9296)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !479, file: !480, line: 256, baseType: !542, size: 96, offset: 9312)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !479, file: !480, line: 258, baseType: !372, size: 128, offset: 9408)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !479, file: !480, line: 259, baseType: !372, size: 128, offset: 9536)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !479, file: !480, line: 260, baseType: !372, size: 128, offset: 9664)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !479, file: !480, line: 261, baseType: !372, size: 128, offset: 9792)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !479, file: !480, line: 263, baseType: !692, size: 64, offset: 9920)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !480, line: 52, flags: DIFlagFwdDecl)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !479, file: !480, line: 264, baseType: !695, size: 64, offset: 9984)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !480, line: 53, flags: DIFlagFwdDecl)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !479, file: !480, line: 265, baseType: !698, size: 64, offset: 10048)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !516, line: 46, flags: DIFlagFwdDecl)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !479, file: !480, line: 267, baseType: !330, size: 8, offset: 10112)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !479, file: !480, line: 268, baseType: !330, size: 8, offset: 10120)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !479, file: !480, line: 269, baseType: !363, size: 16, offset: 10128)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !479, file: !480, line: 270, baseType: !507, size: 32, offset: 10144)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !479, file: !480, line: 272, baseType: !705, size: 64, offset: 10176)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !480, line: 54, flags: DIFlagFwdDecl)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !479, file: !480, line: 275, baseType: !708, size: 64, offset: 10240)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !480, line: 275, flags: DIFlagFwdDecl)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !479, file: !480, line: 277, baseType: !711, size: 64, offset: 10304)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !480, line: 56, flags: DIFlagFwdDecl)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !479, file: !480, line: 277, baseType: !711, size: 64, offset: 10368)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !479, file: !480, line: 278, baseType: !715, size: 64, offset: 10432)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !716, line: 27, baseType: !717)
!716 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !718, line: 45, baseType: !719)
!718 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!719 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !479, file: !480, line: 279, baseType: !715, size: 64, offset: 10496)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !479, file: !480, line: 280, baseType: !5, size: 32, offset: 10560)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !479, file: !480, line: 281, baseType: !5, size: 32, offset: 10592)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !479, file: !480, line: 283, baseType: !372, size: 128, offset: 10624)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !479, file: !480, line: 284, baseType: !372, size: 128, offset: 10752)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !479, file: !480, line: 285, baseType: !726, size: 64, offset: 10880)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !479, file: !480, line: 287, baseType: !728, size: 64, offset: 10944)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !480, line: 59, flags: DIFlagFwdDecl)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !479, file: !480, line: 288, baseType: !731, size: 64, offset: 11008)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !480, line: 288, flags: DIFlagFwdDecl)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !479, file: !480, line: 290, baseType: !734, size: 64, offset: 11072)
!734 = !DICompositeType(tag: DW_TAG_array_type, baseType: !507, size: 64, elements: !735)
!735 = !{!736}
!736 = !DISubrange(count: 2)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !479, file: !480, line: 291, baseType: !738, size: 64, offset: 11136)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !740, line: 65, baseType: !741)
!740 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !740, line: 50, size: 320, elements: !742)
!742 = !{!743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !741, file: !740, line: 51, baseType: !468, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !741, file: !740, line: 53, baseType: !338, size: 32, offset: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !741, file: !740, line: 54, baseType: !338, size: 32, offset: 96)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !741, file: !740, line: 55, baseType: !338, size: 32, offset: 128)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !741, file: !740, line: 55, baseType: !338, size: 32, offset: 160)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !741, file: !740, line: 56, baseType: !330, size: 8, offset: 192)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !741, file: !740, line: 56, baseType: !330, size: 8, offset: 200)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !741, file: !740, line: 57, baseType: !330, size: 8, offset: 208)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !741, file: !740, line: 57, baseType: !330, size: 8, offset: 216)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !741, file: !740, line: 59, baseType: !363, size: 16, offset: 224)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !741, file: !740, line: 59, baseType: !363, size: 16, offset: 240)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !741, file: !740, line: 59, baseType: !363, size: 16, offset: 256)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !741, file: !740, line: 61, baseType: !363, size: 16, offset: 272)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !741, file: !740, line: 63, baseType: !338, size: 32, offset: 288)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !479, file: !480, line: 293, baseType: !372, size: 128, offset: 11200)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !479, file: !480, line: 294, baseType: !759, size: 64, offset: 11328)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !480, line: 113, baseType: !761)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !480, line: 108, size: 256, elements: !762)
!762 = !{!763, !765, !766, !767, !768}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !761, file: !480, line: 109, baseType: !764, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !761, file: !480, line: 109, baseType: !764, size: 64, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !761, file: !480, line: 110, baseType: !478, size: 64, offset: 128)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !761, file: !480, line: 111, baseType: !338, size: 32, offset: 192)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !761, file: !480, line: 112, baseType: !507, size: 32, offset: 224)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !469, file: !470, line: 1221, baseType: !770, size: 64, offset: 1088)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !470, line: 52, flags: DIFlagFwdDecl)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !469, file: !470, line: 1223, baseType: !468, size: 64, offset: 1152)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !469, file: !470, line: 1225, baseType: !372, size: 128, offset: 1216)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !469, file: !470, line: 1226, baseType: !775, size: 64, offset: 1344)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !470, line: 69, size: 320, elements: !777)
!777 = !{!778, !779, !780, !781, !782, !783, !784, !785}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !776, file: !470, line: 70, baseType: !775, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !776, file: !470, line: 70, baseType: !775, size: 64, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !776, file: !470, line: 71, baseType: !5, size: 32, offset: 128)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !776, file: !470, line: 71, baseType: !5, size: 32, offset: 160)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !776, file: !470, line: 72, baseType: !338, size: 32, offset: 192)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !776, file: !470, line: 73, baseType: !363, size: 16, offset: 224)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !776, file: !470, line: 73, baseType: !363, size: 16, offset: 240)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !776, file: !470, line: 74, baseType: !478, size: 64, offset: 256)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !469, file: !470, line: 1227, baseType: !478, size: 64, offset: 1408)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !469, file: !470, line: 1229, baseType: !542, size: 96, offset: 1472)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !469, file: !470, line: 1230, baseType: !542, size: 96, offset: 1568)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !469, file: !470, line: 1231, baseType: !542, size: 96, offset: 1664)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !469, file: !470, line: 1231, baseType: !542, size: 96, offset: 1760)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !469, file: !470, line: 1233, baseType: !5, size: 32, offset: 1856)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !469, file: !470, line: 1234, baseType: !338, size: 32, offset: 1888)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !469, file: !470, line: 1235, baseType: !5, size: 32, offset: 1920)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !469, file: !470, line: 1237, baseType: !363, size: 16, offset: 1952)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !469, file: !470, line: 1239, baseType: !330, size: 8, offset: 1968)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !469, file: !470, line: 1240, baseType: !797, size: 8, offset: 1976)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !330, size: 8, elements: !798)
!798 = !{!799}
!799 = !DISubrange(count: 1)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !469, file: !470, line: 1242, baseType: !801, size: 64, offset: 1984)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !398, line: 328, size: 3456, elements: !803)
!803 = !{!804, !805, !806, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !836, !837, !838, !841, !846, !847, !850, !854, !858, !862, !866, !867, !868, !869}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !802, file: !398, line: 329, baseType: !428, size: 960)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !802, file: !398, line: 330, baseType: !474, size: 64, offset: 960)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !802, file: !398, line: 332, baseType: !807, size: 64, offset: 1024)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !398, line: 332, flags: DIFlagFwdDecl)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !802, file: !398, line: 333, baseType: !348, size: 512, offset: 1088)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !802, file: !398, line: 335, baseType: !396, size: 64, offset: 1600)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !802, file: !398, line: 337, baseType: !573, size: 64, offset: 1664)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !802, file: !398, line: 338, baseType: !734, size: 64, offset: 1728)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !802, file: !398, line: 340, baseType: !372, size: 128, offset: 1792)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !802, file: !398, line: 340, baseType: !372, size: 128, offset: 1920)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !802, file: !398, line: 342, baseType: !338, size: 32, offset: 2048)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !802, file: !398, line: 342, baseType: !338, size: 32, offset: 2080)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !802, file: !398, line: 343, baseType: !338, size: 32, offset: 2112)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !802, file: !398, line: 345, baseType: !338, size: 32, offset: 2144)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !802, file: !398, line: 346, baseType: !338, size: 32, offset: 2176)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !802, file: !398, line: 347, baseType: !363, size: 16, offset: 2208)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !802, file: !398, line: 348, baseType: !363, size: 16, offset: 2224)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !802, file: !398, line: 349, baseType: !338, size: 32, offset: 2240)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !802, file: !398, line: 351, baseType: !338, size: 32, offset: 2272)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !802, file: !398, line: 353, baseType: !363, size: 16, offset: 2304)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !802, file: !398, line: 354, baseType: !363, size: 16, offset: 2320)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !802, file: !398, line: 355, baseType: !338, size: 32, offset: 2336)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !802, file: !398, line: 357, baseType: !828, size: 128, offset: 2368)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !829, line: 95, baseType: !830)
!829 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !829, line: 92, size: 128, elements: !831)
!831 = !{!832, !833, !834, !835}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !830, file: !829, line: 93, baseType: !507, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !830, file: !829, line: 93, baseType: !507, size: 32, offset: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !830, file: !829, line: 94, baseType: !507, size: 32, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !830, file: !829, line: 94, baseType: !507, size: 32, offset: 96)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !802, file: !398, line: 363, baseType: !372, size: 128, offset: 2496)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !802, file: !398, line: 363, baseType: !372, size: 128, offset: 2624)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !802, file: !398, line: 368, baseType: !839, size: 64, offset: 2752)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !398, line: 48, flags: DIFlagFwdDecl)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !802, file: !398, line: 372, baseType: !842, size: 32, offset: 2816)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !398, line: 274, baseType: !843)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !398, line: 271, size: 32, elements: !844)
!844 = !{!845}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !843, file: !398, line: 273, baseType: !5, size: 32)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !802, file: !398, line: 373, baseType: !338, size: 32, offset: 2848)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !802, file: !398, line: 382, baseType: !848, size: 64, offset: 2880)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !398, line: 46, flags: DIFlagFwdDecl)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !802, file: !398, line: 385, baseType: !851, size: 64, offset: 2944)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DISubroutineType(types: !853)
!853 = !{null, !251, !507}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !802, file: !398, line: 386, baseType: !855, size: 64, offset: 3008)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DISubroutineType(types: !857)
!857 = !{null, !251, !603}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !802, file: !398, line: 387, baseType: !859, size: 64, offset: 3072)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{!338, !251}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !802, file: !398, line: 388, baseType: !863, size: 64, offset: 3136)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DISubroutineType(types: !865)
!865 = !{null, !251}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !802, file: !398, line: 389, baseType: !251, size: 64, offset: 3200)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !802, file: !398, line: 389, baseType: !251, size: 64, offset: 3264)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !802, file: !398, line: 389, baseType: !251, size: 64, offset: 3328)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !802, file: !398, line: 389, baseType: !251, size: 64, offset: 3392)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !469, file: !470, line: 1244, baseType: !871, size: 64, offset: 2048)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !873, line: 200, size: 17024, elements: !874)
!873 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!874 = !{!875, !876, !877, !878, !1290, !1291, !1292, !1293, !1294, !1295, !1296}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !872, file: !873, line: 201, baseType: !726, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !872, file: !873, line: 202, baseType: !372, size: 128, offset: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !872, file: !873, line: 203, baseType: !372, size: 128, offset: 192)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !872, file: !873, line: 206, baseType: !879, size: 64, offset: 320)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !873, line: 190, baseType: !881)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !873, line: 126, size: 2816, elements: !882)
!882 = !{!883, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !981, !982, !983, !984, !1262, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1289}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !881, file: !873, line: 127, baseType: !884, size: 64)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !881, file: !873, line: 127, baseType: !884, size: 64, offset: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !881, file: !873, line: 128, baseType: !251, size: 64, offset: 128)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !881, file: !873, line: 129, baseType: !251, size: 64, offset: 192)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !881, file: !873, line: 130, baseType: !348, size: 512, offset: 256)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !881, file: !873, line: 132, baseType: !338, size: 32, offset: 768)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !881, file: !873, line: 132, baseType: !338, size: 32, offset: 800)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !881, file: !873, line: 133, baseType: !338, size: 32, offset: 832)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !881, file: !873, line: 134, baseType: !338, size: 32, offset: 864)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !881, file: !873, line: 134, baseType: !338, size: 32, offset: 896)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !881, file: !873, line: 134, baseType: !338, size: 32, offset: 928)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !881, file: !873, line: 135, baseType: !338, size: 32, offset: 960)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !881, file: !873, line: 135, baseType: !338, size: 32, offset: 992)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !881, file: !873, line: 136, baseType: !338, size: 32, offset: 1024)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !881, file: !873, line: 136, baseType: !338, size: 32, offset: 1056)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !881, file: !873, line: 137, baseType: !338, size: 32, offset: 1088)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !881, file: !873, line: 137, baseType: !338, size: 32, offset: 1120)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !881, file: !873, line: 138, baseType: !507, size: 32, offset: 1152)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !881, file: !873, line: 139, baseType: !507, size: 32, offset: 1184)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !881, file: !873, line: 139, baseType: !507, size: 32, offset: 1216)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !881, file: !873, line: 141, baseType: !363, size: 16, offset: 1248)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !881, file: !873, line: 142, baseType: !363, size: 16, offset: 1264)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !881, file: !873, line: 143, baseType: !338, size: 32, offset: 1280)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !881, file: !873, line: 144, baseType: !338, size: 32, offset: 1312)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !881, file: !873, line: 146, baseType: !909, size: 64, offset: 1344)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !873, line: 114, baseType: !911)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !873, line: 99, size: 7232, elements: !912)
!912 = !{!913, !915, !916, !917, !918, !919, !920, !931, !935, !949, !958, !965, !975}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !911, file: !873, line: 100, baseType: !914, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !911, file: !873, line: 100, baseType: !914, size: 64, offset: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !911, file: !873, line: 101, baseType: !338, size: 32, offset: 128)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !911, file: !873, line: 101, baseType: !338, size: 32, offset: 160)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !911, file: !873, line: 102, baseType: !338, size: 32, offset: 192)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !911, file: !873, line: 102, baseType: !338, size: 32, offset: 224)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !911, file: !873, line: 103, baseType: !921, size: 64, offset: 256)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !873, line: 59, baseType: !923)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !873, line: 56, size: 2112, elements: !924)
!924 = !{!925, !929, !930}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !923, file: !873, line: 57, baseType: !926, size: 2048)
!926 = !DICompositeType(tag: DW_TAG_array_type, baseType: !330, size: 2048, elements: !927)
!927 = !{!928}
!928 = !DISubrange(count: 256)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !923, file: !873, line: 58, baseType: !338, size: 32, offset: 2048)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !923, file: !873, line: 58, baseType: !338, size: 32, offset: 2080)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !911, file: !873, line: 106, baseType: !932, size: 6144, offset: 320)
!932 = !DICompositeType(tag: DW_TAG_array_type, baseType: !330, size: 6144, elements: !933)
!933 = !{!934}
!934 = !DISubrange(count: 768)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !911, file: !873, line: 107, baseType: !936, size: 64, offset: 6464)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !873, line: 97, baseType: !938)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !873, line: 83, size: 8320, elements: !939)
!939 = !{!940, !941, !942, !945, !946, !947, !948}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !938, file: !873, line: 84, baseType: !932, size: 6144)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !938, file: !873, line: 87, baseType: !926, size: 2048, offset: 6144)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !938, file: !873, line: 88, baseType: !943, size: 64, offset: 8192)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !740, line: 41, flags: DIFlagFwdDecl)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !938, file: !873, line: 90, baseType: !363, size: 16, offset: 8256)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !938, file: !873, line: 92, baseType: !363, size: 16, offset: 8272)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !938, file: !873, line: 93, baseType: !363, size: 16, offset: 8288)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !938, file: !873, line: 95, baseType: !363, size: 16, offset: 8304)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !911, file: !873, line: 108, baseType: !950, size: 64, offset: 6528)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !873, line: 66, baseType: !952)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !873, line: 61, size: 128, elements: !953)
!953 = !{!954, !955, !956, !957}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !952, file: !873, line: 62, baseType: !338, size: 32)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !952, file: !873, line: 63, baseType: !338, size: 32, offset: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !952, file: !873, line: 64, baseType: !338, size: 32, offset: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !952, file: !873, line: 65, baseType: !338, size: 32, offset: 96)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !911, file: !873, line: 109, baseType: !959, size: 64, offset: 6592)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !873, line: 71, baseType: !961)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !873, line: 68, size: 64, elements: !962)
!962 = !{!963, !964}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !961, file: !873, line: 69, baseType: !338, size: 32)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !961, file: !873, line: 70, baseType: !338, size: 32, offset: 32)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !911, file: !873, line: 110, baseType: !966, size: 64, offset: 6656)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !873, line: 81, baseType: !968)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !873, line: 73, size: 352, elements: !969)
!969 = !{!970, !971, !972, !973, !974}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !968, file: !873, line: 74, baseType: !542, size: 96)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !968, file: !873, line: 75, baseType: !542, size: 96, offset: 96)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !968, file: !873, line: 76, baseType: !542, size: 96, offset: 192)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !968, file: !873, line: 77, baseType: !338, size: 32, offset: 288)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !968, file: !873, line: 78, baseType: !338, size: 32, offset: 320)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !911, file: !873, line: 113, baseType: !976, size: 512, offset: 6720)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !977, line: 182, baseType: !978)
!977 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !977, line: 180, size: 512, elements: !979)
!979 = !{!980}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !978, file: !977, line: 181, baseType: !348, size: 512)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !881, file: !873, line: 148, baseType: !499, size: 64, offset: 1408)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !881, file: !873, line: 151, baseType: !468, size: 64, offset: 1472)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !881, file: !873, line: 152, baseType: !478, size: 64, offset: 1536)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !881, file: !873, line: 153, baseType: !985, size: 64, offset: 1600)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !987, line: 64, size: 19136, elements: !988)
!987 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!988 = !{!989, !990, !991, !992, !993, !994, !996, !997, !998, !999, !1002, !1003, !1248, !1249, !1257, !1258, !1259, !1260, !1261}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !986, file: !987, line: 65, baseType: !428, size: 960)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !986, file: !987, line: 66, baseType: !474, size: 64, offset: 960)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !986, file: !987, line: 68, baseType: !446, size: 8192, offset: 1024)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !986, file: !987, line: 70, baseType: !338, size: 32, offset: 9216)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !986, file: !987, line: 71, baseType: !338, size: 32, offset: 9248)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !986, file: !987, line: 72, baseType: !995, size: 64, offset: 9280)
!995 = !DICompositeType(tag: DW_TAG_array_type, baseType: !338, size: 64, elements: !735)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !986, file: !987, line: 74, baseType: !507, size: 32, offset: 9344)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !986, file: !987, line: 74, baseType: !507, size: 32, offset: 9376)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !986, file: !987, line: 76, baseType: !943, size: 64, offset: 9408)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !986, file: !987, line: 77, baseType: !1000, size: 64, offset: 9472)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !987, line: 77, flags: DIFlagFwdDecl)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !986, file: !987, line: 78, baseType: !573, size: 64, offset: 9536)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !986, file: !987, line: 80, baseType: !1004, size: 2624, offset: 9600)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !1005, line: 340, size: 2624, elements: !1006)
!1005 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1006 = !{!1007, !1035, !1053, !1054, !1055, !1070, !1128, !1129, !1228, !1229, !1230, !1231, !1237}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !1004, file: !1005, line: 341, baseType: !1008, size: 576)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !1005, line: 251, baseType: !1009)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !1005, line: 207, size: 576, elements: !1010)
!1010 = !{!1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1009, file: !1005, line: 208, baseType: !338, size: 32)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !1009, file: !1005, line: 211, baseType: !363, size: 16, offset: 32)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !1009, file: !1005, line: 212, baseType: !363, size: 16, offset: 48)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !1009, file: !1005, line: 213, baseType: !507, size: 32, offset: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !1009, file: !1005, line: 214, baseType: !363, size: 16, offset: 96)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !1009, file: !1005, line: 215, baseType: !363, size: 16, offset: 112)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !1009, file: !1005, line: 216, baseType: !363, size: 16, offset: 128)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !1009, file: !1005, line: 217, baseType: !363, size: 16, offset: 144)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !1009, file: !1005, line: 218, baseType: !363, size: 16, offset: 160)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !1009, file: !1005, line: 219, baseType: !363, size: 16, offset: 176)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !1009, file: !1005, line: 220, baseType: !507, size: 32, offset: 192)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !1009, file: !1005, line: 222, baseType: !363, size: 16, offset: 224)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !1009, file: !1005, line: 225, baseType: !363, size: 16, offset: 240)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !1009, file: !1005, line: 228, baseType: !338, size: 32, offset: 256)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !1009, file: !1005, line: 229, baseType: !338, size: 32, offset: 288)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !1009, file: !1005, line: 233, baseType: !338, size: 32, offset: 320)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !1009, file: !1005, line: 236, baseType: !363, size: 16, offset: 352)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1009, file: !1005, line: 236, baseType: !363, size: 16, offset: 368)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !1009, file: !1005, line: 241, baseType: !507, size: 32, offset: 384)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !1009, file: !1005, line: 244, baseType: !338, size: 32, offset: 416)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !1009, file: !1005, line: 244, baseType: !338, size: 32, offset: 448)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !1009, file: !1005, line: 245, baseType: !507, size: 32, offset: 480)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !1009, file: !1005, line: 248, baseType: !507, size: 32, offset: 512)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !1009, file: !1005, line: 250, baseType: !338, size: 32, offset: 544)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1004, file: !1005, line: 342, baseType: !1036, size: 448, offset: 576)
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !1005, line: 79, baseType: !1037)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !1005, line: 61, size: 448, elements: !1038)
!1038 = !{!1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !1037, file: !1005, line: 62, baseType: !251, size: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !1037, file: !1005, line: 64, baseType: !363, size: 16, offset: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1037, file: !1005, line: 65, baseType: !363, size: 16, offset: 80)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !1037, file: !1005, line: 67, baseType: !507, size: 32, offset: 96)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !1037, file: !1005, line: 68, baseType: !507, size: 32, offset: 128)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !1037, file: !1005, line: 69, baseType: !507, size: 32, offset: 160)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !1037, file: !1005, line: 70, baseType: !363, size: 16, offset: 192)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1037, file: !1005, line: 71, baseType: !363, size: 16, offset: 208)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !1037, file: !1005, line: 72, baseType: !734, size: 64, offset: 224)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !1037, file: !1005, line: 75, baseType: !507, size: 32, offset: 288)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !1037, file: !1005, line: 75, baseType: !507, size: 32, offset: 320)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !1037, file: !1005, line: 75, baseType: !507, size: 32, offset: 352)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !1037, file: !1005, line: 78, baseType: !507, size: 32, offset: 384)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !1037, file: !1005, line: 78, baseType: !507, size: 32, offset: 416)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !1004, file: !1005, line: 343, baseType: !372, size: 128, offset: 1024)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !1004, file: !1005, line: 344, baseType: !372, size: 128, offset: 1152)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !1004, file: !1005, line: 345, baseType: !1056, size: 192, offset: 1280)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !1005, line: 278, baseType: !1057)
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !1005, line: 270, size: 192, elements: !1058)
!1058 = !{!1059, !1060, !1061, !1062, !1063}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1057, file: !1005, line: 271, baseType: !338, size: 32)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1057, file: !1005, line: 273, baseType: !507, size: 32, offset: 32)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !1057, file: !1005, line: 275, baseType: !338, size: 32, offset: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !1057, file: !1005, line: 276, baseType: !338, size: 32, offset: 96)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !1057, file: !1005, line: 277, baseType: !1064, size: 64, offset: 128)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !1005, line: 55, size: 576, elements: !1066)
!1066 = !{!1067, !1068, !1069}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1065, file: !1005, line: 56, baseType: !338, size: 32)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1065, file: !1005, line: 57, baseType: !507, size: 32, offset: 32)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1065, file: !1005, line: 58, baseType: !624, size: 512, offset: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !1004, file: !1005, line: 346, baseType: !1071, size: 384, offset: 1472)
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !1005, line: 268, baseType: !1072)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !1005, line: 253, size: 384, elements: !1073)
!1073 = !{!1074, !1075, !1076, !1077, !1078, !1122, !1123, !1124, !1125, !1126, !1127}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1072, file: !1005, line: 254, baseType: !338, size: 32)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !1072, file: !1005, line: 255, baseType: !338, size: 32, offset: 32)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !1072, file: !1005, line: 255, baseType: !338, size: 32, offset: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !1072, file: !1005, line: 258, baseType: !507, size: 32, offset: 96)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !1072, file: !1005, line: 259, baseType: !1079, size: 64, offset: 128)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64)
!1080 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !1005, line: 164, baseType: !1081)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !1005, line: 108, size: 1664, elements: !1082)
!1082 = !{!1083, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1081, file: !1005, line: 109, baseType: !1084, size: 64)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1081, file: !1005, line: 109, baseType: !1084, size: 64, offset: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1081, file: !1005, line: 111, baseType: !348, size: 512, offset: 128)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !1081, file: !1005, line: 119, baseType: !734, size: 64, offset: 640)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !1081, file: !1005, line: 119, baseType: !734, size: 64, offset: 704)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !1081, file: !1005, line: 125, baseType: !734, size: 64, offset: 768)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !1081, file: !1005, line: 125, baseType: !734, size: 64, offset: 832)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1081, file: !1005, line: 127, baseType: !734, size: 64, offset: 896)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !1081, file: !1005, line: 130, baseType: !338, size: 32, offset: 960)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !1081, file: !1005, line: 131, baseType: !338, size: 32, offset: 992)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1081, file: !1005, line: 132, baseType: !1095, size: 64, offset: 1024)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !1005, line: 106, baseType: !1097)
