; ModuleID = 'blender/source/blender/imbuf/intern/metadata.c'
source_filename = "blender/source/blender/imbuf/intern/metadata.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ImBuf = type { %struct.ImBuf*, %struct.ImBuf*, i32, i32, i8, i32, i32, i32, i32*, float*, [2 x double], i32, i32, i32, i32, i32**, i32*, float*, float, [20 x %struct.ImBuf*], i32, i32, i32, i32, %struct.ImMetaData*, i8*, i32, [1024 x i8], [1024 x i8], %struct.MEM_CacheLimiterHandle_s*, i32, i8*, i32, i32, %struct.ColorSpace*, %struct.ColorSpace*, i32*, %struct.ColormanageCache*, i32, %struct.rcti, %struct.DDSData }
%struct.ImMetaData = type { %struct.ImMetaData*, %struct.ImMetaData*, i8*, i8*, i32 }
%struct.MEM_CacheLimiterHandle_s = type opaque
%struct.ColorSpace = type opaque
%struct.ColormanageCache = type opaque
%struct.rcti = type { i32, i32, i32, i32 }
%struct.DDSData = type { i32, i32, i8*, i32 }

@MEM_freeN = external dso_local global void (i8*)*, align 8
@MEM_callocN = external dso_local global i8* (i64, i8*)*, align 8
@.str = private unnamed_addr constant [11 x i8] c"ImMetaData\00", align 1

; Function Attrs: noinline nounwind uwtable
define dso_local void @IMB_metadata_free(%struct.ImBuf* %img) #0 !dbg !7 {
entry:
  %img.addr = alloca %struct.ImBuf*, align 8
  %info = alloca %struct.ImMetaData*, align 8
  %next = alloca %struct.ImMetaData*, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/imbuf/intern/metadata.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{}
!3 = !{i32 7, !"Dwarf Version", i32 4}
!4 = !{i32 2, !"Debug Info Version", i32 3}
!5 = !{i32 1, !"wchar_size", i32 4}
!6 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!7 = distinct !DISubprogram(name: "IMB_metadata_free", scope: !1, file: !1, line: 48, type: !8, scopeLine: 49, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!8 = !DISubroutineType(types: !9)
!9 = !{null, !10}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !12, line: 70, size: 19840, elements: !13)
!12 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!13 = !{!14, !15, !16, !18, !19, !21, !22, !23, !24, !27, !30, !35, !36, !37, !38, !39, !41, !43, !44, !45, !49, !50, !51, !52, !53, !65, !67, !68, !72, !73, !76, !77, !79, !80, !81, !84, !85, !86, !89, !90, !99}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !11, file: !12, line: 71, baseType: !10, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !11, file: !12, line: 71, baseType: !10, size: 64, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !11, file: !12, line: 74, baseType: !17, size: 32, offset: 128)
!17 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !11, file: !12, line: 74, baseType: !17, size: 32, offset: 160)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !11, file: !12, line: 79, baseType: !20, size: 8, offset: 192)
!20 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !11, file: !12, line: 80, baseType: !17, size: 32, offset: 224)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !11, file: !12, line: 83, baseType: !17, size: 32, offset: 256)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "mall", scope: !11, file: !12, line: 84, baseType: !17, size: 32, offset: 288)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !11, file: !12, line: 87, baseType: !25, size: 64, offset: 320)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "rect_float", scope: !11, file: !12, line: 88, baseType: !28, size: 64, offset: 384)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "ppm", scope: !11, file: !12, line: 93, baseType: !31, size: 128, offset: 448)
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 128, elements: !33)
!32 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!33 = !{!34}
!34 = !DISubrange(count: 2)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "tilex", scope: !11, file: !12, line: 96, baseType: !17, size: 32, offset: 576)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "tiley", scope: !11, file: !12, line: 96, baseType: !17, size: 32, offset: 608)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "xtiles", scope: !11, file: !12, line: 97, baseType: !17, size: 32, offset: 640)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "ytiles", scope: !11, file: !12, line: 97, baseType: !17, size: 32, offset: 672)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tiles", scope: !11, file: !12, line: 98, baseType: !40, size: 64, offset: 704)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !11, file: !12, line: 101, baseType: !42, size: 64, offset: 768)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_float", scope: !11, file: !12, line: 102, baseType: !28, size: 64, offset: 832)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !11, file: !12, line: 105, baseType: !29, size: 32, offset: 896)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "mipmap", scope: !11, file: !12, line: 108, baseType: !46, size: 1280, offset: 960)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 1280, elements: !47)
!47 = !{!48}
!48 = !DISubrange(count: 20)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "miptot", scope: !11, file: !12, line: 109, baseType: !17, size: 32, offset: 2240)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "miplevel", scope: !11, file: !12, line: 109, baseType: !17, size: 32, offset: 2272)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !11, file: !12, line: 112, baseType: !17, size: 32, offset: 2304)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "userflags", scope: !11, file: !12, line: 113, baseType: !17, size: 32, offset: 2336)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !11, file: !12, line: 114, baseType: !54, size: 64, offset: 2368)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImMetaData", file: !56, line: 38, size: 320, elements: !57)
!56 = !DIFile(filename: "blender/source/blender/imbuf/intern/IMB_metadata.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!57 = !{!58, !59, !60, !63, !64}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !55, file: !56, line: 39, baseType: !54, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !55, file: !56, line: 39, baseType: !54, size: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !55, file: !56, line: 40, baseType: !61, size: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !55, file: !56, line: 41, baseType: !61, size: 64, offset: 192)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !55, file: !56, line: 42, baseType: !17, size: 32, offset: 256)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !11, file: !12, line: 115, baseType: !66, size: 64, offset: 2432)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !11, file: !12, line: 118, baseType: !17, size: 32, offset: 2496)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !11, file: !12, line: 119, baseType: !69, size: 8192, offset: 2528)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 8192, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 1024)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "cachename", scope: !11, file: !12, line: 120, baseType: !69, size: 8192, offset: 10720)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "c_handle", scope: !11, file: !12, line: 123, baseType: !74, size: 64, offset: 18944)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "MEM_CacheLimiterHandle_s", file: !12, line: 123, flags: DIFlagFwdDecl)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "refcounter", scope: !11, file: !12, line: 124, baseType: !17, size: 32, offset: 19008)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffer", scope: !11, file: !12, line: 127, baseType: !78, size: 64, offset: 19072)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "encodedsize", scope: !11, file: !12, line: 128, baseType: !26, size: 32, offset: 19136)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffersize", scope: !11, file: !12, line: 129, baseType: !26, size: 32, offset: 19168)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "rect_colorspace", scope: !11, file: !12, line: 132, baseType: !82, size: 64, offset: 19200)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !12, line: 132, flags: DIFlagFwdDecl)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "float_colorspace", scope: !11, file: !12, line: 133, baseType: !82, size: 64, offset: 19264)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer_flags", scope: !11, file: !12, line: 134, baseType: !25, size: 64, offset: 19328)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_cache", scope: !11, file: !12, line: 135, baseType: !87, size: 64, offset: 19392)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColormanageCache", file: !12, line: 135, flags: DIFlagFwdDecl)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_flag", scope: !11, file: !12, line: 136, baseType: !17, size: 32, offset: 19456)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_rect", scope: !11, file: !12, line: 137, baseType: !91, size: 128, offset: 19488)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !92, line: 89, baseType: !93)
!92 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !92, line: 86, size: 128, elements: !94)
!94 = !{!95, !96, !97, !98}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !93, file: !92, line: 87, baseType: !17, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !93, file: !92, line: 87, baseType: !17, size: 32, offset: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !93, file: !92, line: 88, baseType: !17, size: 32, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !93, file: !92, line: 88, baseType: !17, size: 32, offset: 96)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "dds_data", scope: !11, file: !12, line: 140, baseType: !100, size: 192, offset: 19648)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DDSData", file: !12, line: 55, size: 192, elements: !101)
!101 = !{!102, !103, !104, !105}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "fourcc", scope: !100, file: !12, line: 56, baseType: !26, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "nummipmaps", scope: !100, file: !12, line: 57, baseType: !26, size: 32, offset: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !100, file: !12, line: 58, baseType: !78, size: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !100, file: !12, line: 59, baseType: !26, size: 32, offset: 128)
!106 = !DILocalVariable(name: "img", arg: 1, scope: !7, file: !1, line: 48, type: !10)
!107 = !DILocation(line: 48, column: 38, scope: !7)
!108 = !DILocalVariable(name: "info", scope: !7, file: !1, line: 50, type: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImMetaData", file: !56, line: 43, baseType: !55)
!111 = !DILocation(line: 50, column: 14, scope: !7)
!112 = !DILocation(line: 52, column: 7, scope: !113)
!113 = distinct !DILexicalBlock(scope: !7, file: !1, line: 52, column: 6)
!114 = !DILocation(line: 52, column: 6, scope: !7)
!115 = !DILocation(line: 53, column: 3, scope: !113)
!116 = !DILocation(line: 54, column: 7, scope: !117)
!117 = distinct !DILexicalBlock(scope: !7, file: !1, line: 54, column: 6)
!118 = !DILocation(line: 54, column: 12, scope: !117)
!119 = !DILocation(line: 54, column: 6, scope: !7)
!120 = !DILocation(line: 55, column: 3, scope: !121)
!121 = distinct !DILexicalBlock(scope: !117, file: !1, line: 54, column: 22)
!122 = !DILocation(line: 57, column: 9, scope: !7)
!123 = !DILocation(line: 57, column: 14, scope: !7)
!124 = !DILocation(line: 57, column: 7, scope: !7)
!125 = !DILocation(line: 58, column: 2, scope: !7)
!126 = !DILocation(line: 58, column: 9, scope: !7)
!127 = !DILocalVariable(name: "next", scope: !128, file: !1, line: 59, type: !109)
!128 = distinct !DILexicalBlock(scope: !7, file: !1, line: 58, column: 15)
!129 = !DILocation(line: 59, column: 15, scope: !128)
!130 = !DILocation(line: 59, column: 22, scope: !128)
!131 = !DILocation(line: 59, column: 28, scope: !128)
!132 = !DILocation(line: 60, column: 3, scope: !128)
!133 = !DILocation(line: 60, column: 13, scope: !128)
!134 = !DILocation(line: 60, column: 19, scope: !128)
!135 = !DILocation(line: 61, column: 3, scope: !128)
!136 = !DILocation(line: 61, column: 13, scope: !128)
!137 = !DILocation(line: 61, column: 19, scope: !128)
!138 = !DILocation(line: 62, column: 3, scope: !128)
!139 = !DILocation(line: 62, column: 13, scope: !128)
!140 = !DILocation(line: 63, column: 10, scope: !128)
!141 = !DILocation(line: 63, column: 8, scope: !128)
!142 = distinct !{!142, !125, !143}
!143 = !DILocation(line: 64, column: 2, scope: !7)
!144 = !DILocation(line: 65, column: 1, scope: !7)
!145 = distinct !DISubprogram(name: "IMB_metadata_get_field", scope: !1, file: !1, line: 67, type: !146, scopeLine: 68, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!146 = !DISubroutineType(types: !147)
!147 = !{!20, !10, !148, !61, !150}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!150 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !152, line: 46, baseType: !153)
!152 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!153 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!154 = !DILocalVariable(name: "img", arg: 1, scope: !145, file: !1, line: 67, type: !10)
!155 = !DILocation(line: 67, column: 43, scope: !145)
!156 = !DILocalVariable(name: "key", arg: 2, scope: !145, file: !1, line: 67, type: !148)
!157 = !DILocation(line: 67, column: 60, scope: !145)
!158 = !DILocalVariable(name: "field", arg: 3, scope: !145, file: !1, line: 67, type: !61)
!159 = !DILocation(line: 67, column: 71, scope: !145)
!160 = !DILocalVariable(name: "len", arg: 4, scope: !145, file: !1, line: 67, type: !150)
!161 = !DILocation(line: 67, column: 91, scope: !145)
!162 = !DILocalVariable(name: "info", scope: !145, file: !1, line: 69, type: !109)
!163 = !DILocation(line: 69, column: 14, scope: !145)
!164 = !DILocalVariable(name: "retval", scope: !145, file: !1, line: 70, type: !20)
