; ModuleID = 'blender/source/blender/blenkernel/intern/brush.c'
source_filename = "blender/source/blender/blenkernel/intern/brush.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.RNG = type opaque
%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }

!40 = !{!41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71}
!41 = !DIEnumerator(name: "BRUSH_AIRBRUSH", value: 1)
!42 = !DIEnumerator(name: "BRUSH_TORUS", value: 2)
!43 = !DIEnumerator(name: "BRUSH_ALPHA_PRESSURE", value: 4)
!44 = !DIEnumerator(name: "BRUSH_SIZE_PRESSURE", value: 8)
!45 = !DIEnumerator(name: "BRUSH_JITTER_PRESSURE", value: 16)
!46 = !DIEnumerator(name: "BRUSH_SPACING_PRESSURE", value: 32)
!47 = !DIEnumerator(name: "BRUSH_UNUSED", value: 64)
!48 = !DIEnumerator(name: "BRUSH_RAKE", value: 128)
!49 = !DIEnumerator(name: "BRUSH_ANCHORED", value: 256)
!50 = !DIEnumerator(name: "BRUSH_DIR_IN", value: 512)
!51 = !DIEnumerator(name: "BRUSH_SPACE", value: 1024)
!52 = !DIEnumerator(name: "BRUSH_SMOOTH_STROKE", value: 2048)
!53 = !DIEnumerator(name: "BRUSH_PERSISTENT", value: 4096)
!54 = !DIEnumerator(name: "BRUSH_ACCUMULATE", value: 8192)
!55 = !DIEnumerator(name: "BRUSH_LOCK_ALPHA", value: 16384)
!56 = !DIEnumerator(name: "BRUSH_ORIGINAL_NORMAL", value: 32768)
!57 = !DIEnumerator(name: "BRUSH_OFFSET_PRESSURE", value: 65536)
!58 = !DIEnumerator(name: "BRUSH_SPACE_ATTEN", value: 262144)
!59 = !DIEnumerator(name: "BRUSH_ADAPTIVE_SPACE", value: 524288)
!60 = !DIEnumerator(name: "BRUSH_LOCK_SIZE", value: 1048576)
!61 = !DIEnumerator(name: "BRUSH_USE_GRADIENT", value: 2097152)
!62 = !DIEnumerator(name: "BRUSH_EDGE_TO_EDGE", value: 4194304)
!63 = !DIEnumerator(name: "BRUSH_DRAG_DOT", value: 8388608)
!64 = !DIEnumerator(name: "BRUSH_INVERSE_SMOOTH_PRESSURE", value: 16777216)
!65 = !DIEnumerator(name: "BRUSH_RANDOM_ROTATION", value: 33554432)
!66 = !DIEnumerator(name: "BRUSH_PLANE_TRIM", value: 67108864)
!67 = !DIEnumerator(name: "BRUSH_FRONTFACE", value: 134217728)
!68 = !DIEnumerator(name: "BRUSH_CUSTOM_ICON", value: 268435456)
!69 = !DIEnumerator(name: "BRUSH_LINE", value: 536870912)
!70 = !DIEnumerator(name: "BRUSH_ABSOLUTE_JITTER", value: 1073741824)
!71 = !DIEnumerator(name: "BRUSH_CURVE", value: -2147483648)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "OverlayFlags", file: !6, line: 227, baseType: !7, size: 32, elements: !73)
!73 = !{!74, !75, !76, !77, !78, !79}
!74 = !DIEnumerator(name: "BRUSH_OVERLAY_CURSOR", value: 1, isUnsigned: true)
!75 = !DIEnumerator(name: "BRUSH_OVERLAY_PRIMARY", value: 2, isUnsigned: true)
!76 = !DIEnumerator(name: "BRUSH_OVERLAY_SECONDARY", value: 4, isUnsigned: true)
!77 = !DIEnumerator(name: "BRUSH_OVERLAY_CURSOR_OVERRIDE_ON_STROKE", value: 8, isUnsigned: true)
!78 = !DIEnumerator(name: "BRUSH_OVERLAY_PRIMARY_OVERRIDE_ON_STROKE", value: 16, isUnsigned: true)
!79 = !DIEnumerator(name: "BRUSH_OVERLAY_SECONDARY_OVERRIDE_ON_STROKE", value: 32, isUnsigned: true)
!80 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !81, line: 1027, baseType: !7, size: 32, elements: !82)
!81 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!82 = !{!83, !84, !85, !86, !87, !88, !89}
!83 = !DIEnumerator(name: "UNIFIED_PAINT_SIZE", value: 1, isUnsigned: true)
!84 = !DIEnumerator(name: "UNIFIED_PAINT_ALPHA", value: 2, isUnsigned: true)
!85 = !DIEnumerator(name: "UNIFIED_PAINT_WEIGHT", value: 32, isUnsigned: true)
!86 = !DIEnumerator(name: "UNIFIED_PAINT_COLOR", value: 64, isUnsigned: true)
!87 = !DIEnumerator(name: "UNIFIED_PAINT_BRUSH_LOCK_SIZE", value: 4, isUnsigned: true)
!88 = !DIEnumerator(name: "UNIFIED_PAINT_BRUSH_SIZE_PRESSURE", value: 8, isUnsigned: true)
!89 = !DIEnumerator(name: "UNIFIED_PAINT_BRUSH_ALPHA_PRESSURE", value: 16, isUnsigned: true)
!90 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ObjectMode", file: !91, line: 666, baseType: !7, size: 32, elements: !92)
!91 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!92 = !{!93, !94, !95, !96, !97, !98, !99, !100}
!93 = !DIEnumerator(name: "OB_MODE_OBJECT", value: 0, isUnsigned: true)
!94 = !DIEnumerator(name: "OB_MODE_EDIT", value: 1, isUnsigned: true)
!95 = !DIEnumerator(name: "OB_MODE_SCULPT", value: 2, isUnsigned: true)
!96 = !DIEnumerator(name: "OB_MODE_VERTEX_PAINT", value: 4, isUnsigned: true)
!97 = !DIEnumerator(name: "OB_MODE_WEIGHT_PAINT", value: 8, isUnsigned: true)
!98 = !DIEnumerator(name: "OB_MODE_TEXTURE_PAINT", value: 16, isUnsigned: true)
!99 = !DIEnumerator(name: "OB_MODE_PARTICLE_EDIT", value: 32, isUnsigned: true)
!100 = !DIEnumerator(name: "OB_MODE_POSE", value: 64, isUnsigned: true)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 274, baseType: !7, size: 32, elements: !102)
!102 = !{!103, !104, !105, !106, !107}
!103 = !DIEnumerator(name: "SCULPT_DISP_DIR_AREA", value: 0, isUnsigned: true)
!104 = !DIEnumerator(name: "SCULPT_DISP_DIR_VIEW", value: 1, isUnsigned: true)
!105 = !DIEnumerator(name: "SCULPT_DISP_DIR_X", value: 2, isUnsigned: true)
!106 = !DIEnumerator(name: "SCULPT_DISP_DIR_Y", value: 3, isUnsigned: true)
!107 = !DIEnumerator(name: "SCULPT_DISP_DIR_Z", value: 4, isUnsigned: true)
!108 = !{!109, !115, !179, !1707, !39, !189, !130, !441}
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !111, line: 130, baseType: !112)
!111 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !111, line: 117, size: 960, elements: !113)
!113 = !{!114, !116, !117, !119, !138, !142, !144, !145, !146, !147}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !112, file: !111, line: 118, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !112, file: !111, line: 118, baseType: !115, size: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !112, file: !111, line: 119, baseType: !118, size: 64, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !112, file: !111, line: 120, baseType: !120, size: 64, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !111, line: 136, size: 17600, elements: !122)
!122 = !{!123, !124, !125, !128, !133, !134, !135}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !121, file: !111, line: 137, baseType: !110, size: 960)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !121, file: !111, line: 138, baseType: !109, size: 64, offset: 960)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !121, file: !111, line: 139, baseType: !126, size: 64, offset: 1024)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !111, line: 43, flags: DIFlagFwdDecl)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !121, file: !111, line: 140, baseType: !129, size: 8192, offset: 1088)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 8192, elements: !131)
!130 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!131 = !{!132}
!132 = !DISubrange(count: 1024)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !121, file: !111, line: 141, baseType: !129, size: 8192, offset: 9280)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !121, file: !111, line: 148, baseType: !120, size: 64, offset: 17472)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !121, file: !111, line: 150, baseType: !136, size: 64, offset: 17536)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !111, line: 45, flags: DIFlagFwdDecl)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !112, file: !111, line: 121, baseType: !139, size: 528, offset: 256)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 528, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 66)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !112, file: !111, line: 126, baseType: !143, size: 16, offset: 784)
!143 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !112, file: !111, line: 127, baseType: !39, size: 32, offset: 800)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !112, file: !111, line: 128, baseType: !39, size: 32, offset: 832)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !112, file: !111, line: 128, baseType: !39, size: 32, offset: 864)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !112, file: !111, line: 129, baseType: !148, size: 64, offset: 896)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !111, line: 75, baseType: !150)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !111, line: 62, size: 1024, elements: !151)
!151 = !{!152, !154, !155, !156, !157, !158, !162, !163, !177, !178}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !150, file: !111, line: 63, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !150, file: !111, line: 63, baseType: !153, size: 64, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !150, file: !111, line: 64, baseType: !130, size: 8, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !150, file: !111, line: 64, baseType: !130, size: 8, offset: 136)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !150, file: !111, line: 65, baseType: !143, size: 16, offset: 144)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !150, file: !111, line: 66, baseType: !159, size: 512, offset: 160)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 512, elements: !160)
!160 = !{!161}
!161 = !DISubrange(count: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !150, file: !111, line: 67, baseType: !39, size: 32, offset: 672)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !150, file: !111, line: 69, baseType: !164, size: 256, offset: 704)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !111, line: 60, baseType: !165)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !111, line: 48, size: 256, elements: !166)
!166 = !{!167, !168, !175, !176}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !165, file: !111, line: 49, baseType: !115, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !165, file: !111, line: 58, baseType: !169, size: 128, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !170, line: 71, baseType: !171)
!170 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !170, line: 69, size: 128, elements: !172)
!172 = !{!173, !174}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !171, file: !170, line: 70, baseType: !115, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !171, file: !170, line: 70, baseType: !115, size: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !165, file: !111, line: 59, baseType: !39, size: 32, offset: 192)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !165, file: !111, line: 59, baseType: !39, size: 32, offset: 224)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !150, file: !111, line: 70, baseType: !39, size: 32, offset: 960)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !150, file: !111, line: 74, baseType: !39, size: 32, offset: 992)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tex", file: !181, line: 261, baseType: !182)
!181 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !181, line: 202, size: 3328, elements: !183)
!183 = !{!184, !185, !188, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !1621, !1622, !1623, !1624, !1625, !1647, !1648, !1677, !1697, !1705, !1706}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !182, file: !181, line: 203, baseType: !110, size: 960)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !182, file: !181, line: 204, baseType: !186, size: 64, offset: 960)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !181, line: 45, flags: DIFlagFwdDecl)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !182, file: !181, line: 206, baseType: !189, size: 32, offset: 1024)
!189 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !182, file: !181, line: 206, baseType: !189, size: 32, offset: 1056)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !182, file: !181, line: 207, baseType: !189, size: 32, offset: 1088)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !182, file: !181, line: 207, baseType: !189, size: 32, offset: 1120)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !182, file: !181, line: 207, baseType: !189, size: 32, offset: 1152)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !182, file: !181, line: 207, baseType: !189, size: 32, offset: 1184)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !182, file: !181, line: 207, baseType: !189, size: 32, offset: 1216)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !182, file: !181, line: 207, baseType: !189, size: 32, offset: 1248)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !182, file: !181, line: 208, baseType: !189, size: 32, offset: 1280)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !182, file: !181, line: 208, baseType: !189, size: 32, offset: 1312)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !182, file: !181, line: 211, baseType: !189, size: 32, offset: 1344)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !182, file: !181, line: 211, baseType: !189, size: 32, offset: 1376)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !182, file: !181, line: 211, baseType: !189, size: 32, offset: 1408)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !182, file: !181, line: 211, baseType: !189, size: 32, offset: 1440)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !182, file: !181, line: 211, baseType: !189, size: 32, offset: 1472)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !182, file: !181, line: 214, baseType: !189, size: 32, offset: 1504)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !182, file: !181, line: 214, baseType: !189, size: 32, offset: 1536)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !182, file: !181, line: 217, baseType: !189, size: 32, offset: 1568)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !182, file: !181, line: 218, baseType: !189, size: 32, offset: 1600)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !182, file: !181, line: 219, baseType: !189, size: 32, offset: 1632)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !182, file: !181, line: 220, baseType: !189, size: 32, offset: 1664)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !182, file: !181, line: 221, baseType: !189, size: 32, offset: 1696)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !182, file: !181, line: 222, baseType: !143, size: 16, offset: 1728)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !182, file: !181, line: 222, baseType: !143, size: 16, offset: 1744)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !182, file: !181, line: 224, baseType: !143, size: 16, offset: 1760)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !182, file: !181, line: 224, baseType: !143, size: 16, offset: 1776)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !182, file: !181, line: 227, baseType: !143, size: 16, offset: 1792)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !182, file: !181, line: 227, baseType: !143, size: 16, offset: 1808)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !182, file: !181, line: 229, baseType: !143, size: 16, offset: 1824)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !182, file: !181, line: 229, baseType: !143, size: 16, offset: 1840)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !182, file: !181, line: 230, baseType: !143, size: 16, offset: 1856)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !182, file: !181, line: 230, baseType: !143, size: 16, offset: 1872)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !182, file: !181, line: 232, baseType: !189, size: 32, offset: 1888)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !182, file: !181, line: 232, baseType: !189, size: 32, offset: 1920)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !182, file: !181, line: 232, baseType: !189, size: 32, offset: 1952)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !182, file: !181, line: 232, baseType: !189, size: 32, offset: 1984)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !182, file: !181, line: 233, baseType: !39, size: 32, offset: 2016)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !182, file: !181, line: 234, baseType: !39, size: 32, offset: 2048)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !182, file: !181, line: 235, baseType: !143, size: 16, offset: 2080)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !182, file: !181, line: 235, baseType: !143, size: 16, offset: 2096)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !182, file: !181, line: 236, baseType: !143, size: 16, offset: 2112)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !182, file: !181, line: 239, baseType: !143, size: 16, offset: 2128)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !182, file: !181, line: 240, baseType: !39, size: 32, offset: 2144)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !182, file: !181, line: 241, baseType: !39, size: 32, offset: 2176)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !182, file: !181, line: 241, baseType: !39, size: 32, offset: 2208)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !182, file: !181, line: 241, baseType: !39, size: 32, offset: 2240)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !182, file: !181, line: 243, baseType: !189, size: 32, offset: 2272)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !182, file: !181, line: 243, baseType: !189, size: 32, offset: 2304)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !182, file: !181, line: 244, baseType: !189, size: 32, offset: 2336)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !182, file: !181, line: 246, baseType: !239, size: 320, offset: 2368)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !240, line: 50, size: 320, elements: !241)
!240 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!241 = !{!242, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !239, file: !240, line: 51, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !81, line: 1216, size: 39680, elements: !245)
!245 = !{!246, !247, !248, !591, !594, !595, !596, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !622, !625, !628, !1234, !1237, !1481, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1503, !1504, !1505, !1506, !1507, !1515, !1582, !1589, !1590, !1597, !1600, !1601, !1602, !1603, !1604, !1605}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !244, file: !81, line: 1217, baseType: !110, size: 960)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !244, file: !81, line: 1218, baseType: !186, size: 64, offset: 960)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !244, file: !81, line: 1220, baseType: !249, size: 64, offset: 1024)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !91, line: 115, size: 11392, elements: !251)
!251 = !{!252, !253, !254, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !342, !352, !366, !367, !409, !410, !413, !414, !430, !431, !432, !433, !434, !435, !436, !440, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !456, !457, !458, !459, !460, !461, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !521, !522, !523, !524, !525, !526, !527, !528, !529, !532, !535, !539, !540, !541, !542, !543, !546, !549, !552, !553, !559, !560, !561, !562, !563, !564, !566, !569, !572, !576, !579, !580}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !250, file: !91, line: 116, baseType: !110, size: 960)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !250, file: !91, line: 117, baseType: !186, size: 64, offset: 960)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !250, file: !91, line: 119, baseType: !255, size: 64, offset: 1024)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !257, line: 155, size: 1856, elements: !258)
!257 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_paint.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!258 = !{!259, !262, !265, !268, !271, !272, !273, !278, !281, !283, !287, !290, !291, !292, !294, !297, !300, !301, !302, !303, !304, !308, !309, !310, !312, !313, !317, !318, !321, !324, !325, !326, !327}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "multires", scope: !256, file: !257, line: 157, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DICompositeType(tag: DW_TAG_structure_type, name: "MultiresModifierData", file: !257, line: 157, flags: DIFlagFwdDecl)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "mvert", scope: !256, file: !257, line: 158, baseType: !263, size: 64, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !257, line: 49, flags: DIFlagFwdDecl)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "mpoly", scope: !256, file: !257, line: 159, baseType: !266, size: 64, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !257, line: 159, flags: DIFlagFwdDecl)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "mloop", scope: !256, file: !257, line: 160, baseType: !269, size: 64, offset: 192)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !257, line: 160, flags: DIFlagFwdDecl)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !256, file: !257, line: 161, baseType: !39, size: 32, offset: 256)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "totpoly", scope: !256, file: !257, line: 161, baseType: !39, size: 32, offset: 288)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "face_normals", scope: !256, file: !257, line: 162, baseType: !274, size: 64, offset: 320)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 96, elements: !276)
!276 = !{!277}
!277 = !DISubrange(count: 3)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "kb", scope: !256, file: !257, line: 163, baseType: !279, size: 64, offset: 384)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "KeyBlock", file: !257, line: 163, flags: DIFlagFwdDecl)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "vmask", scope: !256, file: !257, line: 164, baseType: !282, size: 64, offset: 448)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "pmap", scope: !256, file: !257, line: 167, baseType: !284, size: 64, offset: 512)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !286)
!286 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !257, line: 44, flags: DIFlagFwdDecl)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "bm", scope: !256, file: !257, line: 170, baseType: !288, size: 64, offset: 576)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !257, line: 39, flags: DIFlagFwdDecl)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "cd_vert_node_offset", scope: !256, file: !257, line: 171, baseType: !39, size: 32, offset: 640)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "cd_face_node_offset", scope: !256, file: !257, line: 172, baseType: !39, size: 32, offset: 672)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "bm_smooth_shading", scope: !256, file: !257, line: 173, baseType: !293, size: 8, offset: 704)
!293 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "bm_log", scope: !256, file: !257, line: 175, baseType: !295, size: 64, offset: 768)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMLog", file: !257, line: 175, flags: DIFlagFwdDecl)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "pbvh", scope: !256, file: !257, line: 178, baseType: !298, size: 64, offset: 832)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !257, line: 55, flags: DIFlagFwdDecl)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "show_diffuse_color", scope: !256, file: !257, line: 179, baseType: !293, size: 8, offset: 896)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers_active", scope: !256, file: !257, line: 182, baseType: !293, size: 8, offset: 904)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "orig_cos", scope: !256, file: !257, line: 183, baseType: !274, size: 64, offset: 960)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "deform_cos", scope: !256, file: !257, line: 184, baseType: !274, size: 64, offset: 1024)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "deform_imats", scope: !256, file: !257, line: 185, baseType: !305, size: 64, offset: 1088)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 288, elements: !307)
!307 = !{!277, !277}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "partial_redraw", scope: !256, file: !257, line: 188, baseType: !293, size: 8, offset: 1152)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_side", scope: !256, file: !257, line: 191, baseType: !7, size: 32, offset: 1184)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "texcache", scope: !256, file: !257, line: 191, baseType: !311, size: 64, offset: 1216)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_actual", scope: !256, file: !257, line: 191, baseType: !7, size: 32, offset: 1280)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "tex_pool", scope: !256, file: !257, line: 192, baseType: !314, size: 64, offset: 1344)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePool", file: !316, line: 33, flags: DIFlagFwdDecl)
!316 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_brush.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!317 = !DIDerivedType(tag: DW_TAG_member, name: "layer_co", scope: !256, file: !257, line: 195, baseType: !274, size: 64, offset: 1408)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "stroke", scope: !256, file: !257, line: 197, baseType: !319, size: 64, offset: 1472)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptStroke", file: !257, line: 197, flags: DIFlagFwdDecl)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !256, file: !257, line: 198, baseType: !322, size: 64, offset: 1536)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "StrokeCache", file: !257, line: 59, flags: DIFlagFwdDecl)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke_valid", scope: !256, file: !257, line: 201, baseType: !293, size: 8, offset: 1600)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke", scope: !256, file: !257, line: 202, baseType: !275, size: 96, offset: 1632)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_accum", scope: !256, file: !257, line: 204, baseType: !275, size: 96, offset: 1728)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_counter", scope: !256, file: !257, line: 205, baseType: !39, size: 32, offset: 1824)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !250, file: !91, line: 121, baseType: !143, size: 16, offset: 1088)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !250, file: !91, line: 121, baseType: !143, size: 16, offset: 1104)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !250, file: !91, line: 122, baseType: !39, size: 32, offset: 1120)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !250, file: !91, line: 122, baseType: !39, size: 32, offset: 1152)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !250, file: !91, line: 122, baseType: !39, size: 32, offset: 1184)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !250, file: !91, line: 123, baseType: !159, size: 512, offset: 1216)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !250, file: !91, line: 124, baseType: !249, size: 64, offset: 1728)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !250, file: !91, line: 124, baseType: !249, size: 64, offset: 1792)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !250, file: !91, line: 127, baseType: !249, size: 64, offset: 1856)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !250, file: !91, line: 127, baseType: !249, size: 64, offset: 1920)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !250, file: !91, line: 127, baseType: !249, size: 64, offset: 1984)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !250, file: !91, line: 128, baseType: !340, size: 64, offset: 2048)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !181, line: 46, flags: DIFlagFwdDecl)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !250, file: !91, line: 130, baseType: !343, size: 64, offset: 2112)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !91, line: 97, size: 832, elements: !345)
!345 = !{!346, !350, !351}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !344, file: !91, line: 98, baseType: !347, size: 768)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 768, elements: !348)
!348 = !{!349, !277}
!349 = !DISubrange(count: 8)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !344, file: !91, line: 99, baseType: !39, size: 32, offset: 768)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !344, file: !91, line: 99, baseType: !39, size: 32, offset: 800)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !250, file: !91, line: 131, baseType: !353, size: 64, offset: 2176)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !355, line: 486, size: 1600, elements: !356)
!355 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!356 = !{!357, !358, !359, !360, !361, !362, !363, !364, !365}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !354, file: !355, line: 487, baseType: !110, size: 960)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !354, file: !355, line: 489, baseType: !169, size: 128, offset: 960)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !354, file: !355, line: 490, baseType: !169, size: 128, offset: 1088)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !354, file: !355, line: 491, baseType: !169, size: 128, offset: 1216)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !354, file: !355, line: 492, baseType: !169, size: 128, offset: 1344)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !354, file: !355, line: 494, baseType: !39, size: 32, offset: 1472)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !354, file: !355, line: 495, baseType: !39, size: 32, offset: 1504)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !354, file: !355, line: 497, baseType: !39, size: 32, offset: 1536)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !354, file: !355, line: 498, baseType: !39, size: 32, offset: 1568)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !250, file: !91, line: 132, baseType: !353, size: 64, offset: 2240)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !250, file: !91, line: 133, baseType: !368, size: 64, offset: 2304)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !355, line: 334, size: 1728, elements: !370)
!370 = !{!371, !372, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !408}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !369, file: !355, line: 335, baseType: !169, size: 128)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !369, file: !355, line: 336, baseType: !373, size: 64, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !375, line: 51, flags: DIFlagFwdDecl)
!375 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!376 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !369, file: !355, line: 338, baseType: !143, size: 16, offset: 192)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !369, file: !355, line: 338, baseType: !143, size: 16, offset: 208)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !369, file: !355, line: 339, baseType: !7, size: 32, offset: 224)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !369, file: !355, line: 340, baseType: !39, size: 32, offset: 256)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !369, file: !355, line: 342, baseType: !189, size: 32, offset: 288)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !369, file: !355, line: 343, baseType: !275, size: 96, offset: 320)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !369, file: !355, line: 344, baseType: !275, size: 96, offset: 416)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !369, file: !355, line: 347, baseType: !169, size: 128, offset: 512)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !369, file: !355, line: 349, baseType: !39, size: 32, offset: 640)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !369, file: !355, line: 350, baseType: !39, size: 32, offset: 672)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !369, file: !355, line: 351, baseType: !115, size: 64, offset: 704)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !369, file: !355, line: 352, baseType: !115, size: 64, offset: 768)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !369, file: !355, line: 354, baseType: !389, size: 384, offset: 832)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !355, line: 116, baseType: !390)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !355, line: 94, size: 384, elements: !391)
!391 = !{!392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !390, file: !355, line: 96, baseType: !39, size: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !390, file: !355, line: 96, baseType: !39, size: 32, offset: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !390, file: !355, line: 97, baseType: !39, size: 32, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !390, file: !355, line: 97, baseType: !39, size: 32, offset: 96)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !390, file: !355, line: 99, baseType: !143, size: 16, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !390, file: !355, line: 100, baseType: !143, size: 16, offset: 144)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !390, file: !355, line: 102, baseType: !143, size: 16, offset: 160)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !390, file: !355, line: 105, baseType: !143, size: 16, offset: 176)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !390, file: !355, line: 108, baseType: !143, size: 16, offset: 192)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !390, file: !355, line: 109, baseType: !143, size: 16, offset: 208)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !390, file: !355, line: 111, baseType: !143, size: 16, offset: 224)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !390, file: !355, line: 112, baseType: !143, size: 16, offset: 240)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !390, file: !355, line: 114, baseType: !39, size: 32, offset: 256)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !390, file: !355, line: 114, baseType: !39, size: 32, offset: 288)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !390, file: !355, line: 115, baseType: !39, size: 32, offset: 320)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !390, file: !355, line: 115, baseType: !39, size: 32, offset: 352)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !369, file: !355, line: 355, baseType: !159, size: 512, offset: 1216)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !250, file: !91, line: 134, baseType: !115, size: 64, offset: 2368)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !250, file: !91, line: 136, baseType: !411, size: 64, offset: 2432)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !81, line: 61, flags: DIFlagFwdDecl)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !250, file: !91, line: 138, baseType: !389, size: 384, offset: 2496)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !250, file: !91, line: 139, baseType: !415, size: 64, offset: 2880)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !355, line: 80, baseType: !417)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !355, line: 72, size: 192, elements: !418)
!418 = !{!419, !426, !427, !428, !429}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !417, file: !355, line: 73, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !355, line: 59, baseType: !422)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !355, line: 56, size: 128, elements: !423)
!423 = !{!424, !425}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !422, file: !355, line: 57, baseType: !275, size: 96)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !422, file: !355, line: 58, baseType: !39, size: 32, offset: 96)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !417, file: !355, line: 74, baseType: !39, size: 32, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !417, file: !355, line: 76, baseType: !39, size: 32, offset: 96)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !417, file: !355, line: 77, baseType: !39, size: 32, offset: 128)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !417, file: !355, line: 79, baseType: !39, size: 32, offset: 160)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !250, file: !91, line: 141, baseType: !169, size: 128, offset: 2944)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !250, file: !91, line: 142, baseType: !169, size: 128, offset: 3072)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !250, file: !91, line: 143, baseType: !169, size: 128, offset: 3200)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !250, file: !91, line: 144, baseType: !169, size: 128, offset: 3328)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !250, file: !91, line: 146, baseType: !39, size: 32, offset: 3456)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !250, file: !91, line: 147, baseType: !39, size: 32, offset: 3488)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !250, file: !91, line: 150, baseType: !437, size: 64, offset: 3520)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !375, line: 46, flags: DIFlagFwdDecl)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !250, file: !91, line: 151, baseType: !441, size: 64, offset: 3584)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !250, file: !91, line: 152, baseType: !39, size: 32, offset: 3648)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !250, file: !91, line: 153, baseType: !39, size: 32, offset: 3680)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !250, file: !91, line: 156, baseType: !275, size: 96, offset: 3712)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !250, file: !91, line: 156, baseType: !275, size: 96, offset: 3808)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !250, file: !91, line: 156, baseType: !275, size: 96, offset: 3904)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !250, file: !91, line: 157, baseType: !275, size: 96, offset: 4000)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !250, file: !91, line: 158, baseType: !275, size: 96, offset: 4096)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !250, file: !91, line: 159, baseType: !275, size: 96, offset: 4192)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !250, file: !91, line: 160, baseType: !275, size: 96, offset: 4288)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !250, file: !91, line: 160, baseType: !275, size: 96, offset: 4384)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !250, file: !91, line: 161, baseType: !453, size: 128, offset: 4480)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 128, elements: !454)
!454 = !{!455}
!455 = !DISubrange(count: 4)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !250, file: !91, line: 161, baseType: !453, size: 128, offset: 4608)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !250, file: !91, line: 162, baseType: !275, size: 96, offset: 4736)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !250, file: !91, line: 162, baseType: !275, size: 96, offset: 4832)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !250, file: !91, line: 163, baseType: !189, size: 32, offset: 4928)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !250, file: !91, line: 163, baseType: !189, size: 32, offset: 4960)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !250, file: !91, line: 164, baseType: !462, size: 512, offset: 4992)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 512, elements: !463)
!463 = !{!455, !455}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !250, file: !91, line: 165, baseType: !462, size: 512, offset: 5504)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !250, file: !91, line: 166, baseType: !462, size: 512, offset: 6016)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !250, file: !91, line: 167, baseType: !462, size: 512, offset: 6528)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !250, file: !91, line: 176, baseType: !462, size: 512, offset: 7040)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !250, file: !91, line: 178, baseType: !7, size: 32, offset: 7552)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !250, file: !91, line: 180, baseType: !143, size: 16, offset: 7584)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !250, file: !91, line: 181, baseType: !143, size: 16, offset: 7600)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !250, file: !91, line: 183, baseType: !143, size: 16, offset: 7616)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !250, file: !91, line: 183, baseType: !143, size: 16, offset: 7632)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !250, file: !91, line: 184, baseType: !143, size: 16, offset: 7648)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !250, file: !91, line: 184, baseType: !143, size: 16, offset: 7664)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !250, file: !91, line: 185, baseType: !143, size: 16, offset: 7680)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !250, file: !91, line: 186, baseType: !143, size: 16, offset: 7696)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !250, file: !91, line: 187, baseType: !143, size: 16, offset: 7712)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !250, file: !91, line: 188, baseType: !130, size: 8, offset: 7728)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !250, file: !91, line: 189, baseType: !130, size: 8, offset: 7736)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !250, file: !91, line: 192, baseType: !39, size: 32, offset: 7744)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !250, file: !91, line: 192, baseType: !39, size: 32, offset: 7776)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !250, file: !91, line: 192, baseType: !39, size: 32, offset: 7808)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !250, file: !91, line: 192, baseType: !39, size: 32, offset: 7840)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !250, file: !91, line: 194, baseType: !39, size: 32, offset: 7872)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !250, file: !91, line: 202, baseType: !189, size: 32, offset: 7904)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !250, file: !91, line: 202, baseType: !189, size: 32, offset: 7936)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !250, file: !91, line: 202, baseType: !189, size: 32, offset: 7968)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !250, file: !91, line: 211, baseType: !189, size: 32, offset: 8000)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !250, file: !91, line: 212, baseType: !189, size: 32, offset: 8032)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !250, file: !91, line: 213, baseType: !189, size: 32, offset: 8064)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !250, file: !91, line: 214, baseType: !189, size: 32, offset: 8096)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !250, file: !91, line: 215, baseType: !189, size: 32, offset: 8128)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !250, file: !91, line: 216, baseType: !189, size: 32, offset: 8160)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !250, file: !91, line: 219, baseType: !189, size: 32, offset: 8192)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !250, file: !91, line: 220, baseType: !189, size: 32, offset: 8224)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !250, file: !91, line: 221, baseType: !189, size: 32, offset: 8256)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !250, file: !91, line: 224, baseType: !498, size: 16, offset: 8288)
!498 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !250, file: !91, line: 224, baseType: !498, size: 16, offset: 8304)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !250, file: !91, line: 226, baseType: !143, size: 16, offset: 8320)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !250, file: !91, line: 228, baseType: !130, size: 8, offset: 8336)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !250, file: !91, line: 229, baseType: !130, size: 8, offset: 8344)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !250, file: !91, line: 231, baseType: !143, size: 16, offset: 8352)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !250, file: !91, line: 232, baseType: !130, size: 8, offset: 8368)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !250, file: !91, line: 233, baseType: !130, size: 8, offset: 8376)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !250, file: !91, line: 234, baseType: !189, size: 32, offset: 8384)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !250, file: !91, line: 235, baseType: !189, size: 32, offset: 8416)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !250, file: !91, line: 237, baseType: !169, size: 128, offset: 8448)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !250, file: !91, line: 238, baseType: !169, size: 128, offset: 8576)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !250, file: !91, line: 239, baseType: !169, size: 128, offset: 8704)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !250, file: !91, line: 240, baseType: !169, size: 128, offset: 8832)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !250, file: !91, line: 242, baseType: !189, size: 32, offset: 8960)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !250, file: !91, line: 244, baseType: !143, size: 16, offset: 8992)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !250, file: !91, line: 245, baseType: !498, size: 16, offset: 9008)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !250, file: !91, line: 246, baseType: !453, size: 128, offset: 9024)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !250, file: !91, line: 248, baseType: !39, size: 32, offset: 9152)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !250, file: !91, line: 249, baseType: !39, size: 32, offset: 9184)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !250, file: !91, line: 251, baseType: !519, size: 64, offset: 9216)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !91, line: 251, flags: DIFlagFwdDecl)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !250, file: !91, line: 253, baseType: !130, size: 8, offset: 9280)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !250, file: !91, line: 254, baseType: !130, size: 8, offset: 9288)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !250, file: !91, line: 255, baseType: !143, size: 16, offset: 9296)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !250, file: !91, line: 256, baseType: !275, size: 96, offset: 9312)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !250, file: !91, line: 258, baseType: !169, size: 128, offset: 9408)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !250, file: !91, line: 259, baseType: !169, size: 128, offset: 9536)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !250, file: !91, line: 260, baseType: !169, size: 128, offset: 9664)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !250, file: !91, line: 261, baseType: !169, size: 128, offset: 9792)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !250, file: !91, line: 263, baseType: !530, size: 64, offset: 9920)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !91, line: 52, flags: DIFlagFwdDecl)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !250, file: !91, line: 264, baseType: !533, size: 64, offset: 9984)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !91, line: 53, flags: DIFlagFwdDecl)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !250, file: !91, line: 265, baseType: !536, size: 64, offset: 10048)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !538, line: 43, flags: DIFlagFwdDecl)
!538 = !DIFile(filename: "blender/source/blender/makesdna/DNA_freestyle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!539 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !250, file: !91, line: 267, baseType: !130, size: 8, offset: 10112)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !250, file: !91, line: 268, baseType: !130, size: 8, offset: 10120)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !250, file: !91, line: 269, baseType: !143, size: 16, offset: 10128)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !250, file: !91, line: 270, baseType: !189, size: 32, offset: 10144)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !250, file: !91, line: 272, baseType: !544, size: 64, offset: 10176)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !91, line: 54, flags: DIFlagFwdDecl)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !250, file: !91, line: 275, baseType: !547, size: 64, offset: 10240)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !91, line: 275, flags: DIFlagFwdDecl)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !250, file: !91, line: 277, baseType: !550, size: 64, offset: 10304)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !91, line: 56, flags: DIFlagFwdDecl)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !250, file: !91, line: 277, baseType: !550, size: 64, offset: 10368)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !250, file: !91, line: 278, baseType: !554, size: 64, offset: 10432)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !555, line: 27, baseType: !556)
!555 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !557, line: 45, baseType: !558)
!557 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!558 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !250, file: !91, line: 279, baseType: !554, size: 64, offset: 10496)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !250, file: !91, line: 280, baseType: !7, size: 32, offset: 10560)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !250, file: !91, line: 281, baseType: !7, size: 32, offset: 10592)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !250, file: !91, line: 283, baseType: !169, size: 128, offset: 10624)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !250, file: !91, line: 284, baseType: !169, size: 128, offset: 10752)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !250, file: !91, line: 285, baseType: !565, size: 64, offset: 10880)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !250, file: !91, line: 287, baseType: !567, size: 64, offset: 10944)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !91, line: 59, flags: DIFlagFwdDecl)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !250, file: !91, line: 288, baseType: !570, size: 64, offset: 11008)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !91, line: 288, flags: DIFlagFwdDecl)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !250, file: !91, line: 290, baseType: !573, size: 64, offset: 11072)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 64, elements: !574)
!574 = !{!575}
!575 = !DISubrange(count: 2)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !250, file: !91, line: 291, baseType: !577, size: 64, offset: 11136)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !240, line: 65, baseType: !239)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !250, file: !91, line: 293, baseType: !169, size: 128, offset: 11200)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !250, file: !91, line: 294, baseType: !581, size: 64, offset: 11328)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !91, line: 113, baseType: !583)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !91, line: 108, size: 256, elements: !584)
!584 = !{!585, !587, !588, !589, !590}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !583, file: !91, line: 109, baseType: !586, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !583, file: !91, line: 109, baseType: !586, size: 64, offset: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !583, file: !91, line: 110, baseType: !249, size: 64, offset: 128)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !583, file: !91, line: 111, baseType: !39, size: 32, offset: 192)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !583, file: !91, line: 112, baseType: !189, size: 32, offset: 224)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !244, file: !81, line: 1221, baseType: !592, size: 64, offset: 1088)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !81, line: 52, flags: DIFlagFwdDecl)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !244, file: !81, line: 1223, baseType: !243, size: 64, offset: 1152)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !244, file: !81, line: 1225, baseType: !169, size: 128, offset: 1216)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !244, file: !81, line: 1226, baseType: !597, size: 64, offset: 1344)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !81, line: 69, size: 320, elements: !599)
!599 = !{!600, !601, !602, !603, !604, !605, !606, !607}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !598, file: !81, line: 70, baseType: !597, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !598, file: !81, line: 70, baseType: !597, size: 64, offset: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !598, file: !81, line: 71, baseType: !7, size: 32, offset: 128)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !598, file: !81, line: 71, baseType: !7, size: 32, offset: 160)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !598, file: !81, line: 72, baseType: !39, size: 32, offset: 192)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !598, file: !81, line: 73, baseType: !143, size: 16, offset: 224)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !598, file: !81, line: 73, baseType: !143, size: 16, offset: 240)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !598, file: !81, line: 74, baseType: !249, size: 64, offset: 256)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !244, file: !81, line: 1227, baseType: !249, size: 64, offset: 1408)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !244, file: !81, line: 1229, baseType: !275, size: 96, offset: 1472)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !244, file: !81, line: 1230, baseType: !275, size: 96, offset: 1568)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !244, file: !81, line: 1231, baseType: !275, size: 96, offset: 1664)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !244, file: !81, line: 1231, baseType: !275, size: 96, offset: 1760)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !244, file: !81, line: 1233, baseType: !7, size: 32, offset: 1856)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !244, file: !81, line: 1234, baseType: !39, size: 32, offset: 1888)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !244, file: !81, line: 1235, baseType: !7, size: 32, offset: 1920)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !244, file: !81, line: 1237, baseType: !143, size: 16, offset: 1952)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !244, file: !81, line: 1239, baseType: !130, size: 8, offset: 1968)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !244, file: !81, line: 1240, baseType: !619, size: 8, offset: 1976)
!619 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 8, elements: !620)
!620 = !{!621}
!621 = !DISubrange(count: 1)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !244, file: !81, line: 1242, baseType: !623, size: 64, offset: 1984)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !181, line: 248, flags: DIFlagFwdDecl)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !244, file: !81, line: 1244, baseType: !626, size: 64, offset: 2048)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !81, line: 59, flags: DIFlagFwdDecl)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !244, file: !81, line: 1246, baseType: !629, size: 64, offset: 2112)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !81, line: 1067, size: 5184, elements: !631)
!631 = !{!632, !1054, !1055, !1070, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1092, !1108, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1217}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !630, file: !81, line: 1068, baseType: !633, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !81, line: 934, baseType: !635)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !81, line: 925, size: 576, elements: !636)
!636 = !{!637, !1046, !1047, !1048, !1049, !1050, !1053}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !635, file: !81, line: 926, baseType: !638, size: 320)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !81, line: 830, baseType: !639)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !81, line: 813, size: 320, elements: !640)
!640 = !{!641, !1031, !1040, !1041, !1043, !1044, !1045}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !639, file: !81, line: 814, baseType: !642, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !6, line: 54, size: 16448, elements: !644)
!644 = !{!645, !646, !731, !778, !847, !848, !849, !924, !927, !950, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !643, file: !6, line: 55, baseType: !110, size: 960)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !643, file: !6, line: 57, baseType: !647, size: 192, offset: 960)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BrushClone", file: !6, line: 48, size: 192, elements: !648)
!648 = !{!649, !728, !729, !730}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !647, file: !6, line: 49, baseType: !650, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !240, line: 77, size: 15424, elements: !652)
!652 = !{!653, !654, !655, !658, !661, !664, !667, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !717, !718, !722}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !651, file: !240, line: 78, baseType: !110, size: 960)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !651, file: !240, line: 80, baseType: !129, size: 8192, offset: 960)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !651, file: !240, line: 82, baseType: !656, size: 64, offset: 9152)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !240, line: 43, flags: DIFlagFwdDecl)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !651, file: !240, line: 83, baseType: !659, size: 64, offset: 9216)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !111, line: 46, flags: DIFlagFwdDecl)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !651, file: !240, line: 86, baseType: !662, size: 64, offset: 9280)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !240, line: 41, flags: DIFlagFwdDecl)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !651, file: !240, line: 87, baseType: !665, size: 64, offset: 9344)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !240, line: 44, flags: DIFlagFwdDecl)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !651, file: !240, line: 89, baseType: !668, size: 512, offset: 9408)
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !665, size: 512, elements: !669)
!669 = !{!349}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !651, file: !240, line: 90, baseType: !143, size: 16, offset: 9920)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !651, file: !240, line: 90, baseType: !143, size: 16, offset: 9936)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !651, file: !240, line: 92, baseType: !143, size: 16, offset: 9952)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !651, file: !240, line: 92, baseType: !143, size: 16, offset: 9968)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !651, file: !240, line: 93, baseType: !143, size: 16, offset: 9984)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !651, file: !240, line: 93, baseType: !143, size: 16, offset: 10000)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !651, file: !240, line: 94, baseType: !39, size: 32, offset: 10016)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !651, file: !240, line: 97, baseType: !143, size: 16, offset: 10048)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !651, file: !240, line: 97, baseType: !143, size: 16, offset: 10064)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !651, file: !240, line: 98, baseType: !143, size: 16, offset: 10080)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !651, file: !240, line: 98, baseType: !143, size: 16, offset: 10096)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !651, file: !240, line: 99, baseType: !143, size: 16, offset: 10112)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !651, file: !240, line: 99, baseType: !143, size: 16, offset: 10128)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !651, file: !240, line: 100, baseType: !7, size: 32, offset: 10144)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !651, file: !240, line: 101, baseType: !311, size: 64, offset: 10176)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !651, file: !240, line: 103, baseType: !136, size: 64, offset: 10240)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !651, file: !240, line: 104, baseType: !687, size: 64, offset: 10304)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !111, line: 159, size: 448, elements: !689)
!689 = !{!690, !692, !693, !695, !696, !698}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !688, file: !111, line: 161, baseType: !691, size: 64)
!691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !574)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !688, file: !111, line: 162, baseType: !691, size: 64, offset: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !688, file: !111, line: 163, baseType: !694, size: 32, offset: 128)
!694 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 32, elements: !574)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !688, file: !111, line: 164, baseType: !694, size: 32, offset: 160)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !688, file: !111, line: 165, baseType: !697, size: 128, offset: 192)
!697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !311, size: 128, elements: !574)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !688, file: !111, line: 166, baseType: !699, size: 128, offset: 320)
!699 = !DICompositeType(tag: DW_TAG_array_type, baseType: !659, size: 128, elements: !574)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !651, file: !240, line: 107, baseType: !189, size: 32, offset: 10368)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !651, file: !240, line: 108, baseType: !39, size: 32, offset: 10400)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !651, file: !240, line: 109, baseType: !143, size: 16, offset: 10432)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !651, file: !240, line: 110, baseType: !143, size: 16, offset: 10448)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !651, file: !240, line: 113, baseType: !39, size: 32, offset: 10464)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !651, file: !240, line: 113, baseType: !39, size: 32, offset: 10496)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !651, file: !240, line: 114, baseType: !130, size: 8, offset: 10528)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !651, file: !240, line: 114, baseType: !130, size: 8, offset: 10536)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !651, file: !240, line: 115, baseType: !143, size: 16, offset: 10544)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !651, file: !240, line: 116, baseType: !453, size: 128, offset: 10560)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !651, file: !240, line: 119, baseType: !189, size: 32, offset: 10688)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !651, file: !240, line: 119, baseType: !189, size: 32, offset: 10720)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !651, file: !240, line: 122, baseType: !713, size: 512, offset: 10752)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !29, line: 182, baseType: !714)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !29, line: 180, size: 512, elements: !715)
!715 = !{!716}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !714, file: !29, line: 181, baseType: !159, size: 512)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !651, file: !240, line: 123, baseType: !130, size: 8, offset: 11264)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !651, file: !240, line: 125, baseType: !719, size: 56, offset: 11272)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 56, elements: !720)
!720 = !{!721}
!721 = !DISubrange(count: 7)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !651, file: !240, line: 126, baseType: !723, size: 4096, offset: 11328)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !724, size: 4096, elements: !669)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !240, line: 69, baseType: !725)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !240, line: 67, size: 512, elements: !726)
!726 = !{!727}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !725, file: !240, line: 68, baseType: !159, size: 512)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !647, file: !6, line: 50, baseType: !573, size: 64, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !647, file: !6, line: 51, baseType: !189, size: 32, offset: 128)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !647, file: !6, line: 51, baseType: !189, size: 32, offset: 160)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !643, file: !6, line: 58, baseType: !732, size: 64, offset: 1152)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapping", file: !29, line: 72, size: 3072, elements: !734)
!734 = !{!735, !736, !737, !738, !739, !748, !749, !774, !775, !776, !777}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !733, file: !29, line: 73, baseType: !39, size: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !733, file: !29, line: 73, baseType: !39, size: 32, offset: 32)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "preset", scope: !733, file: !29, line: 74, baseType: !39, size: 32, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !733, file: !29, line: 75, baseType: !39, size: 32, offset: 96)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !733, file: !29, line: 77, baseType: !740, size: 128, offset: 128)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !741, line: 95, baseType: !742)
!741 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !741, line: 92, size: 128, elements: !743)
!743 = !{!744, !745, !746, !747}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !742, file: !741, line: 93, baseType: !189, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !742, file: !741, line: 93, baseType: !189, size: 32, offset: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !742, file: !741, line: 94, baseType: !189, size: 32, offset: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !742, file: !741, line: 94, baseType: !189, size: 32, offset: 96)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "clipr", scope: !733, file: !29, line: 77, baseType: !740, size: 128, offset: 256)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "cm", scope: !733, file: !29, line: 79, baseType: !750, size: 2304, offset: 384)
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !751, size: 2304, elements: !454)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMap", file: !29, line: 67, baseType: !752)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMap", file: !29, line: 55, size: 576, elements: !753)
!753 = !{!754, !755, !756, !757, !758, !759, !760, !761, !770, !771, !772, !773}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "totpoint", scope: !752, file: !29, line: 56, baseType: !143, size: 16)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !752, file: !29, line: 56, baseType: !143, size: 16, offset: 16)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !752, file: !29, line: 58, baseType: !189, size: 32, offset: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "mintable", scope: !752, file: !29, line: 59, baseType: !189, size: 32, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "maxtable", scope: !752, file: !29, line: 59, baseType: !189, size: 32, offset: 96)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "ext_in", scope: !752, file: !29, line: 60, baseType: !573, size: 64, offset: 128)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "ext_out", scope: !752, file: !29, line: 60, baseType: !573, size: 64, offset: 192)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !752, file: !29, line: 61, baseType: !762, size: 64, offset: 256)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMapPoint", file: !29, line: 47, baseType: !764)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapPoint", file: !29, line: 44, size: 96, elements: !765)
!765 = !{!766, !767, !768, !769}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !764, file: !29, line: 45, baseType: !189, size: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !764, file: !29, line: 45, baseType: !189, size: 32, offset: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !764, file: !29, line: 46, baseType: !143, size: 16, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "shorty", scope: !764, file: !29, line: 46, baseType: !143, size: 16, offset: 80)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !752, file: !29, line: 62, baseType: !762, size: 64, offset: 320)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "premultable", scope: !752, file: !29, line: 64, baseType: !762, size: 64, offset: 384)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_in", scope: !752, file: !29, line: 65, baseType: !573, size: 64, offset: 448)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_out", scope: !752, file: !29, line: 66, baseType: !573, size: 64, offset: 512)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "black", scope: !733, file: !29, line: 80, baseType: !275, size: 96, offset: 2688)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "white", scope: !733, file: !29, line: 80, baseType: !275, size: 96, offset: 2784)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "bwmul", scope: !733, file: !29, line: 81, baseType: !275, size: 96, offset: 2880)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "sample", scope: !733, file: !29, line: 83, baseType: !275, size: 96, offset: 2976)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !643, file: !6, line: 59, baseType: !779, size: 2496, offset: 1216)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !181, line: 57, size: 2496, elements: !780)
!780 = !{!781, !782, !783, !784, !785, !786, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !779, file: !181, line: 59, baseType: !143, size: 16)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !779, file: !181, line: 59, baseType: !143, size: 16, offset: 16)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !779, file: !181, line: 59, baseType: !143, size: 16, offset: 32)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !779, file: !181, line: 59, baseType: !143, size: 16, offset: 48)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !779, file: !181, line: 60, baseType: !249, size: 64, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !779, file: !181, line: 61, baseType: !787, size: 64, offset: 128)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "uvname", scope: !779, file: !181, line: 62, baseType: !159, size: 512, offset: 192)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "projx", scope: !779, file: !181, line: 64, baseType: !130, size: 8, offset: 704)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "projy", scope: !779, file: !181, line: 64, baseType: !130, size: 8, offset: 712)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "projz", scope: !779, file: !181, line: 64, baseType: !130, size: 8, offset: 720)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !779, file: !181, line: 64, baseType: !130, size: 8, offset: 728)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "ofs", scope: !779, file: !181, line: 65, baseType: !275, size: 96, offset: 736)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !779, file: !181, line: 65, baseType: !275, size: 96, offset: 832)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !779, file: !181, line: 65, baseType: !189, size: 32, offset: 928)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "texflag", scope: !779, file: !181, line: 67, baseType: !143, size: 16, offset: 960)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !779, file: !181, line: 67, baseType: !143, size: 16, offset: 976)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "pmapto", scope: !779, file: !181, line: 67, baseType: !143, size: 16, offset: 992)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "pmaptoneg", scope: !779, file: !181, line: 67, baseType: !143, size: 16, offset: 1008)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "normapspace", scope: !779, file: !181, line: 68, baseType: !143, size: 16, offset: 1024)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "which_output", scope: !779, file: !181, line: 68, baseType: !143, size: 16, offset: 1040)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "brush_map_mode", scope: !779, file: !181, line: 69, baseType: !130, size: 8, offset: 1056)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !779, file: !181, line: 69, baseType: !719, size: 56, offset: 1064)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !779, file: !181, line: 70, baseType: !189, size: 32, offset: 1120)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !779, file: !181, line: 70, baseType: !189, size: 32, offset: 1152)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !779, file: !181, line: 70, baseType: !189, size: 32, offset: 1184)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !779, file: !181, line: 70, baseType: !189, size: 32, offset: 1216)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "def_var", scope: !779, file: !181, line: 71, baseType: !189, size: 32, offset: 1248)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !779, file: !181, line: 71, baseType: !189, size: 32, offset: 1280)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "colfac", scope: !779, file: !181, line: 74, baseType: !189, size: 32, offset: 1312)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "varfac", scope: !779, file: !181, line: 74, baseType: !189, size: 32, offset: 1344)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "norfac", scope: !779, file: !181, line: 77, baseType: !189, size: 32, offset: 1376)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "dispfac", scope: !779, file: !181, line: 77, baseType: !189, size: 32, offset: 1408)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "warpfac", scope: !779, file: !181, line: 77, baseType: !189, size: 32, offset: 1440)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "colspecfac", scope: !779, file: !181, line: 78, baseType: !189, size: 32, offset: 1472)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "mirrfac", scope: !779, file: !181, line: 78, baseType: !189, size: 32, offset: 1504)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "alphafac", scope: !779, file: !181, line: 78, baseType: !189, size: 32, offset: 1536)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "difffac", scope: !779, file: !181, line: 79, baseType: !189, size: 32, offset: 1568)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "specfac", scope: !779, file: !181, line: 79, baseType: !189, size: 32, offset: 1600)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "emitfac", scope: !779, file: !181, line: 79, baseType: !189, size: 32, offset: 1632)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "hardfac", scope: !779, file: !181, line: 79, baseType: !189, size: 32, offset: 1664)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "raymirrfac", scope: !779, file: !181, line: 80, baseType: !189, size: 32, offset: 1696)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "translfac", scope: !779, file: !181, line: 80, baseType: !189, size: 32, offset: 1728)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "ambfac", scope: !779, file: !181, line: 80, baseType: !189, size: 32, offset: 1760)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "colemitfac", scope: !779, file: !181, line: 81, baseType: !189, size: 32, offset: 1792)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "colreflfac", scope: !779, file: !181, line: 81, baseType: !189, size: 32, offset: 1824)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "coltransfac", scope: !779, file: !181, line: 81, baseType: !189, size: 32, offset: 1856)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "densfac", scope: !779, file: !181, line: 82, baseType: !189, size: 32, offset: 1888)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "scatterfac", scope: !779, file: !181, line: 82, baseType: !189, size: 32, offset: 1920)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "reflfac", scope: !779, file: !181, line: 82, baseType: !189, size: 32, offset: 1952)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "timefac", scope: !779, file: !181, line: 85, baseType: !189, size: 32, offset: 1984)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "lengthfac", scope: !779, file: !181, line: 85, baseType: !189, size: 32, offset: 2016)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "clumpfac", scope: !779, file: !181, line: 85, baseType: !189, size: 32, offset: 2048)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "dampfac", scope: !779, file: !181, line: 85, baseType: !189, size: 32, offset: 2080)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "kinkfac", scope: !779, file: !181, line: 86, baseType: !189, size: 32, offset: 2112)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "roughfac", scope: !779, file: !181, line: 86, baseType: !189, size: 32, offset: 2144)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "padensfac", scope: !779, file: !181, line: 86, baseType: !189, size: 32, offset: 2176)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "gravityfac", scope: !779, file: !181, line: 86, baseType: !189, size: 32, offset: 2208)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "lifefac", scope: !779, file: !181, line: 87, baseType: !189, size: 32, offset: 2240)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "sizefac", scope: !779, file: !181, line: 87, baseType: !189, size: 32, offset: 2272)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "ivelfac", scope: !779, file: !181, line: 87, baseType: !189, size: 32, offset: 2304)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "fieldfac", scope: !779, file: !181, line: 87, baseType: !189, size: 32, offset: 2336)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "shadowfac", scope: !779, file: !181, line: 90, baseType: !189, size: 32, offset: 2368)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "zenupfac", scope: !779, file: !181, line: 93, baseType: !189, size: 32, offset: 2400)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "zendownfac", scope: !779, file: !181, line: 93, baseType: !189, size: 32, offset: 2432)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "blendfac", scope: !779, file: !181, line: 93, baseType: !189, size: 32, offset: 2464)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "mask_mtex", scope: !643, file: !6, line: 60, baseType: !779, size: 2496, offset: 3712)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "toggle_brush", scope: !643, file: !6, line: 62, baseType: !642, size: 64, offset: 6208)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "icon_imbuf", scope: !643, file: !6, line: 64, baseType: !850, size: 64, offset: 6272)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !852, line: 70, size: 19840, elements: !853)
!852 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!853 = !{!854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !867, !868, !869, !870, !871, !873, !875, !876, !877, !881, !882, !883, !884, !885, !888, !889, !890, !891, !892, !895, !896, !898, !899, !900, !903, !904, !905, !908, !909, !917}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !851, file: !852, line: 71, baseType: !850, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !851, file: !852, line: 71, baseType: !850, size: 64, offset: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !851, file: !852, line: 74, baseType: !39, size: 32, offset: 128)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !851, file: !852, line: 74, baseType: !39, size: 32, offset: 160)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !851, file: !852, line: 79, baseType: !293, size: 8, offset: 192)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !851, file: !852, line: 80, baseType: !39, size: 32, offset: 224)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !851, file: !852, line: 83, baseType: !39, size: 32, offset: 256)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "mall", scope: !851, file: !852, line: 84, baseType: !39, size: 32, offset: 288)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !851, file: !852, line: 87, baseType: !311, size: 64, offset: 320)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "rect_float", scope: !851, file: !852, line: 88, baseType: !282, size: 64, offset: 384)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "ppm", scope: !851, file: !852, line: 93, baseType: !865, size: 128, offset: 448)
!865 = !DICompositeType(tag: DW_TAG_array_type, baseType: !866, size: 128, elements: !574)
!866 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "tilex", scope: !851, file: !852, line: 96, baseType: !39, size: 32, offset: 576)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "tiley", scope: !851, file: !852, line: 96, baseType: !39, size: 32, offset: 608)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "xtiles", scope: !851, file: !852, line: 97, baseType: !39, size: 32, offset: 640)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "ytiles", scope: !851, file: !852, line: 97, baseType: !39, size: 32, offset: 672)
