; ModuleID = 'blender/source/blender/bmesh/operators/bmo_dissolve.c'
source_filename = "blender/source/blender/bmesh/operators/bmo_dissolve.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BMesh = type { i32, i32, i32, i32, i32, i32, i32, i8, i8, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BMVert**, %struct.BMEdge**, %struct.BMFace**, i32, i32, i32, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, i32, %struct.BMOperator*, %struct.CustomData, %struct.CustomData, %struct.CustomData, %struct.CustomData, i16, i32, i32, i32, %struct.ListBase, %struct.BMFace*, %struct.ListBase, i8* }
%struct.BMVert = type { %struct.BMHeader, %struct.BMFlagLayer*, [3 x float], [3 x float], %struct.BMEdge* }
%struct.BMHeader = type { i8*, i32, i8, i8, i8 }
%struct.BMFlagLayer = type { i16 }
%struct.BMEdge = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMVert*, %struct.BMVert*, %struct.BMLoop*, %struct.BMDiskLink, %struct.BMDiskLink }
%struct.BMLoop = type { %struct.BMHeader, %struct.BMVert*, %struct.BMEdge*, %struct.BMFace*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop* }
%struct.BMDiskLink = type { %struct.BMEdge*, %struct.BMEdge* }
%struct.BLI_mempool = type opaque
%struct.CustomData = type { %struct.CustomDataLayer*, [41 x i32], i32, i32, i32, %struct.BLI_mempool*, %struct.CustomDataExternal* }

!69 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!70 = !{!71, !72, !73, !74}
!71 = !DIEnumerator(name: "BM_VERT", value: 1, isUnsigned: true)
!72 = !DIEnumerator(name: "BM_EDGE", value: 2, isUnsigned: true)
!73 = !DIEnumerator(name: "BM_LOOP", value: 4, isUnsigned: true)
!74 = !DIEnumerator(name: "BM_FACE", value: 8, isUnsigned: true)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 109, baseType: !5, size: 32, elements: !76)
!76 = !{!77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88}
!77 = !DIEnumerator(name: "BMW_VERT_SHELL", value: 0, isUnsigned: true)
!78 = !DIEnumerator(name: "BMW_FACE_SHELL", value: 1, isUnsigned: true)
!79 = !DIEnumerator(name: "BMW_LOOP", value: 2, isUnsigned: true)
!80 = !DIEnumerator(name: "BMW_FACELOOP", value: 3, isUnsigned: true)
!81 = !DIEnumerator(name: "BMW_EDGERING", value: 4, isUnsigned: true)
!82 = !DIEnumerator(name: "BMW_EDGEBOUNDARY", value: 5, isUnsigned: true)
!83 = !DIEnumerator(name: "BMW_LOOPDATA_ISLAND", value: 6, isUnsigned: true)
!84 = !DIEnumerator(name: "BMW_ISLANDBOUND", value: 7, isUnsigned: true)
!85 = !DIEnumerator(name: "BMW_ISLAND", value: 8, isUnsigned: true)
!86 = !DIEnumerator(name: "BMW_CONNECTED_VERTEX", value: 9, isUnsigned: true)
!87 = !DIEnumerator(name: "BMW_CUSTOM", value: 10, isUnsigned: true)
!88 = !DIEnumerator(name: "BMW_MAXWALKERS", value: 11, isUnsigned: true)
!89 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !90, line: 62, baseType: !5, size: 32, elements: !91)
!90 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_error.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!91 = !{!92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102}
!92 = !DIEnumerator(name: "BMERR_SELF_INTERSECTING", value: 1, isUnsigned: true)
!93 = !DIEnumerator(name: "BMERR_DISSOLVEDISK_FAILED", value: 2, isUnsigned: true)
!94 = !DIEnumerator(name: "BMERR_CONNECTVERT_FAILED", value: 3, isUnsigned: true)
!95 = !DIEnumerator(name: "BMERR_WALKER_FAILED", value: 4, isUnsigned: true)
!96 = !DIEnumerator(name: "BMERR_DISSOLVEFACES_FAILED", value: 5, isUnsigned: true)
!97 = !DIEnumerator(name: "BMERR_TESSELLATION", value: 6, isUnsigned: true)
!98 = !DIEnumerator(name: "BMERR_NONMANIFOLD", value: 7, isUnsigned: true)
!99 = !DIEnumerator(name: "BMERR_INVALID_SELECTION", value: 8, isUnsigned: true)
!100 = !DIEnumerator(name: "BMERR_MESH_ERROR", value: 9, isUnsigned: true)
!101 = !DIEnumerator(name: "BMERR_CONVEX_HULL_FAILED", value: 10, isUnsigned: true)
!102 = !DIEnumerator(name: "BMERR_TOTAL", value: 11, isUnsigned: true)
!103 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 281, baseType: !5, size: 32, elements: !104)
!104 = !{!105, !106, !107, !108, !109, !110}
!105 = !DIEnumerator(name: "DEL_VERTS", value: 1, isUnsigned: true)
!106 = !DIEnumerator(name: "DEL_EDGES", value: 2, isUnsigned: true)
!107 = !DIEnumerator(name: "DEL_ONLYFACES", value: 3, isUnsigned: true)
!108 = !DIEnumerator(name: "DEL_EDGESFACES", value: 4, isUnsigned: true)
!109 = !DIEnumerator(name: "DEL_FACES", value: 5, isUnsigned: true)
!110 = !DIEnumerator(name: "DEL_ONLYTAGGED", value: 6, isUnsigned: true)
!111 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 300, baseType: !5, size: 32, elements: !112)
!112 = !{!113, !114, !115}
!113 = !DIEnumerator(name: "BMO_DELIM_NORMAL", value: 1, isUnsigned: true)
!114 = !DIEnumerator(name: "BMO_DELIM_MATERIAL", value: 2, isUnsigned: true)
!115 = !DIEnumerator(name: "BMO_DELIM_SEAM", value: 4, isUnsigned: true)
!116 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !69, line: 260, baseType: !5, size: 32, elements: !117)
!117 = !{!118, !119, !120, !121, !122, !123, !124}
!118 = !DIEnumerator(name: "BM_ELEM_SELECT", value: 1, isUnsigned: true)
!119 = !DIEnumerator(name: "BM_ELEM_HIDDEN", value: 2, isUnsigned: true)
!120 = !DIEnumerator(name: "BM_ELEM_SEAM", value: 4, isUnsigned: true)
!121 = !DIEnumerator(name: "BM_ELEM_SMOOTH", value: 8, isUnsigned: true)
!122 = !DIEnumerator(name: "BM_ELEM_TAG", value: 16, isUnsigned: true)
!123 = !DIEnumerator(name: "BM_ELEM_DRAW", value: 32, isUnsigned: true)
!124 = !DIEnumerator(name: "BM_ELEM_INTERNAL_TAG", value: 128, isUnsigned: true)
!125 = !{!126, !127, !130, !131, !133, !198, !161, !200, !201, !202, !203, !207, !211, !182, !152, !132}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !128, line: 46, baseType: !129)
!128 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!129 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !69, line: 123, baseType: !135)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !69, line: 110, size: 640, elements: !136)
!136 = !{!137, !147, !153, !167, !168, !191, !197}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !135, file: !69, line: 111, baseType: !138, size: 128)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !69, line: 82, baseType: !139)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !69, line: 64, size: 128, elements: !140)
!140 = !{!141, !142, !144, !145, !146}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !139, file: !69, line: 65, baseType: !126, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !139, file: !69, line: 66, baseType: !143, size: 32, offset: 64)
!143 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !139, file: !69, line: 73, baseType: !132, size: 8, offset: 96)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !139, file: !69, line: 74, baseType: !132, size: 8, offset: 104)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !139, file: !69, line: 80, baseType: !132, size: 8, offset: 112)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !135, file: !69, line: 112, baseType: !148, size: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !69, line: 180, size: 16, elements: !150)
!150 = !{!151}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !149, file: !69, line: 181, baseType: !152, size: 16)
!152 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !135, file: !69, line: 114, baseType: !154, size: 64, offset: 192)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !69, line: 90, size: 448, elements: !156)
!156 = !{!157, !158, !159, !164, !165}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !155, file: !69, line: 91, baseType: !138, size: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !155, file: !69, line: 92, baseType: !148, size: 64, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !155, file: !69, line: 94, baseType: !160, size: 96, offset: 192)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 96, elements: !162)
!161 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!162 = !{!163}
!163 = !DISubrange(count: 3)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !155, file: !69, line: 95, baseType: !160, size: 96, offset: 288)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !155, file: !69, line: 102, baseType: !166, size: 64, offset: 384)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !135, file: !69, line: 114, baseType: !154, size: 64, offset: 256)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !135, file: !69, line: 118, baseType: !169, size: 64, offset: 320)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !69, line: 125, size: 576, elements: !171)
!171 = !{!172, !173, !174, !175, !187, !188, !189, !190}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !170, file: !69, line: 126, baseType: !138, size: 128)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !170, file: !69, line: 129, baseType: !154, size: 64, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !170, file: !69, line: 130, baseType: !166, size: 64, offset: 192)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !170, file: !69, line: 131, baseType: !176, size: 64, offset: 256)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !69, line: 164, size: 448, elements: !178)
!178 = !{!179, !180, !181, !184, !185, !186}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !177, file: !69, line: 165, baseType: !138, size: 128)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !177, file: !69, line: 166, baseType: !148, size: 64, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !177, file: !69, line: 172, baseType: !182, size: 64, offset: 192)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !69, line: 140, baseType: !170)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !177, file: !69, line: 174, baseType: !143, size: 32, offset: 256)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !177, file: !69, line: 175, baseType: !160, size: 96, offset: 288)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !177, file: !69, line: 176, baseType: !152, size: 16, offset: 384)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !170, file: !69, line: 135, baseType: !169, size: 64, offset: 320)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !170, file: !69, line: 135, baseType: !169, size: 64, offset: 384)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !170, file: !69, line: 139, baseType: !169, size: 64, offset: 448)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !170, file: !69, line: 139, baseType: !169, size: 64, offset: 512)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !135, file: !69, line: 122, baseType: !192, size: 128, offset: 384)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !69, line: 108, baseType: !193)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !69, line: 106, size: 128, elements: !194)
!194 = !{!195, !196}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !193, file: !69, line: 107, baseType: !166, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !193, file: !69, line: 107, baseType: !166, size: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !135, file: !69, line: 122, baseType: !192, size: 128, offset: 512)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !69, line: 103, baseType: !155)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !52, line: 79, baseType: !51)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !52, line: 158, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{null, !126}
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !52, line: 159, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!126, !126}
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !69, line: 178, baseType: !177)
!213 = !{i32 7, !"Dwarf Version", i32 4}
!214 = !{i32 2, !"Debug Info Version", i32 3}
!215 = !{i32 1, !"wchar_size", i32 4}
!216 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!217 = distinct !DISubprogram(name: "bmo_dissolve_faces_exec", scope: !1, file: !1, line: 134, type: !218, scopeLine: 135, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !360)
!218 = !DISubroutineType(types: !219)
!219 = !{null, !220, !358}
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !69, line: 246, baseType: !222)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !69, line: 186, size: 8064, elements: !223)
!223 = !{!224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !237, !238, !239, !240, !241, !242, !244, !245, !246, !247, !248, !249, !250, !251, !302, !341, !342, !343, !344, !345, !346, !347, !348, !355, !356, !357}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !222, file: !69, line: 187, baseType: !143, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !222, file: !69, line: 187, baseType: !143, size: 32, offset: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !222, file: !69, line: 187, baseType: !143, size: 32, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !222, file: !69, line: 187, baseType: !143, size: 32, offset: 96)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !222, file: !69, line: 188, baseType: !143, size: 32, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !222, file: !69, line: 188, baseType: !143, size: 32, offset: 160)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !222, file: !69, line: 188, baseType: !143, size: 32, offset: 192)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !222, file: !69, line: 193, baseType: !132, size: 8, offset: 224)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !222, file: !69, line: 197, baseType: !132, size: 8, offset: 232)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !222, file: !69, line: 201, baseType: !234, size: 64, offset: 256)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !236, line: 71, flags: DIFlagFwdDecl)
!236 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!237 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !222, file: !69, line: 201, baseType: !234, size: 64, offset: 320)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !222, file: !69, line: 201, baseType: !234, size: 64, offset: 384)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !222, file: !69, line: 201, baseType: !234, size: 64, offset: 448)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !222, file: !69, line: 208, baseType: !200, size: 64, offset: 512)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !222, file: !69, line: 209, baseType: !201, size: 64, offset: 576)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !222, file: !69, line: 210, baseType: !243, size: 64, offset: 640)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !222, file: !69, line: 213, baseType: !143, size: 32, offset: 704)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !222, file: !69, line: 214, baseType: !143, size: 32, offset: 736)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !222, file: !69, line: 215, baseType: !143, size: 32, offset: 768)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !222, file: !69, line: 218, baseType: !234, size: 64, offset: 832)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !222, file: !69, line: 218, baseType: !234, size: 64, offset: 896)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !222, file: !69, line: 218, baseType: !234, size: 64, offset: 960)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !222, file: !69, line: 220, baseType: !143, size: 32, offset: 1024)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !222, file: !69, line: 221, baseType: !252, size: 64, offset: 1088)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !4, line: 190, size: 10496, elements: !254)
!254 = !{!255, !290, !291, !295, !298, !299, !301}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !253, file: !4, line: 191, baseType: !256, size: 5120)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !257, size: 5120, elements: !288)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !4, line: 147, size: 320, elements: !258)
!258 = !{!259, !262, !264, !274, !275}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !257, file: !4, line: 148, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !132)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !257, file: !4, line: 149, baseType: !263, size: 32, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !4, line: 112, baseType: !3)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !257, file: !4, line: 150, baseType: !265, size: 32, offset: 96)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !4, line: 142, baseType: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !4, line: 138, size: 32, elements: !267)
!267 = !{!268, !270, !272}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !266, file: !4, line: 139, baseType: !269, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !4, line: 122, baseType: !15)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !266, file: !4, line: 140, baseType: !271, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !4, line: 136, baseType: !21)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !266, file: !4, line: 141, baseType: !273, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !4, line: 130, baseType: !27)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !257, file: !4, line: 152, baseType: !143, size: 32, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !257, file: !4, line: 162, baseType: !276, size: 128, offset: 192)
!276 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !257, file: !4, line: 155, size: 128, elements: !277)
!277 = !{!278, !279, !280, !281, !282, !283}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !276, file: !4, line: 156, baseType: !143, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !276, file: !4, line: 157, baseType: !161, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !276, file: !4, line: 158, baseType: !126, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !276, file: !4, line: 159, baseType: !160, size: 96)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !276, file: !4, line: 160, baseType: !130, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !276, file: !4, line: 161, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !286, line: 48, baseType: !287)
!286 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !286, line: 48, flags: DIFlagFwdDecl)
!288 = !{!289}
!289 = !DISubrange(count: 16)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !253, file: !4, line: 192, baseType: !256, size: 5120, offset: 5120)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !253, file: !4, line: 193, baseType: !292, size: 64, offset: 10240)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DISubroutineType(types: !294)
!294 = !{null, !220, !252}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !253, file: !4, line: 194, baseType: !296, size: 64, offset: 10304)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !4, line: 194, flags: DIFlagFwdDecl)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !253, file: !4, line: 195, baseType: !143, size: 32, offset: 10368)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !253, file: !4, line: 196, baseType: !300, size: 32, offset: 10400)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !4, line: 188, baseType: !35)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !253, file: !4, line: 197, baseType: !143, size: 32, offset: 10432)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !222, file: !69, line: 223, baseType: !303, size: 1600, offset: 1152)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !236, line: 73, baseType: !304)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !236, line: 64, size: 1600, elements: !305)
!305 = !{!306, !324, !328, !329, !330, !331, !332}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !304, file: !236, line: 65, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !236, line: 53, baseType: !309)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !236, line: 42, size: 832, elements: !310)
!310 = !{!311, !312, !313, !314, !315, !316, !317, !318, !319, !323}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !309, file: !236, line: 43, baseType: !143, size: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !309, file: !236, line: 44, baseType: !143, size: 32, offset: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !309, file: !236, line: 45, baseType: !143, size: 32, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !309, file: !236, line: 46, baseType: !143, size: 32, offset: 96)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !309, file: !236, line: 47, baseType: !143, size: 32, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !309, file: !236, line: 48, baseType: !143, size: 32, offset: 160)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !309, file: !236, line: 49, baseType: !143, size: 32, offset: 192)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !309, file: !236, line: 50, baseType: !143, size: 32, offset: 224)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !309, file: !236, line: 51, baseType: !320, size: 512, offset: 256)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 512, elements: !321)
!321 = !{!322}
!322 = !DISubrange(count: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !309, file: !236, line: 52, baseType: !126, size: 64, offset: 768)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !304, file: !236, line: 66, baseType: !325, size: 1312, offset: 64)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 1312, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 41)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !304, file: !236, line: 69, baseType: !143, size: 32, offset: 1376)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !304, file: !236, line: 69, baseType: !143, size: 32, offset: 1408)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !304, file: !236, line: 70, baseType: !143, size: 32, offset: 1440)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !304, file: !236, line: 71, baseType: !234, size: 64, offset: 1472)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !304, file: !236, line: 72, baseType: !333, size: 64, offset: 1536)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !236, line: 59, baseType: !335)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !236, line: 57, size: 8192, elements: !336)
!336 = !{!337}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !335, file: !236, line: 58, baseType: !338, size: 8192)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 8192, elements: !339)
!339 = !{!340}
!340 = !DISubrange(count: 1024)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !222, file: !69, line: 223, baseType: !303, size: 1600, offset: 2752)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !222, file: !69, line: 223, baseType: !303, size: 1600, offset: 4352)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !222, file: !69, line: 223, baseType: !303, size: 1600, offset: 5952)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !222, file: !69, line: 233, baseType: !152, size: 16, offset: 7552)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !222, file: !69, line: 236, baseType: !143, size: 32, offset: 7584)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !222, file: !69, line: 238, baseType: !143, size: 32, offset: 7616)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !222, file: !69, line: 238, baseType: !143, size: 32, offset: 7648)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !222, file: !69, line: 239, baseType: !349, size: 128, offset: 7680)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !350, line: 71, baseType: !351)
!350 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !350, line: 69, size: 128, elements: !352)
!352 = !{!353, !354}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !351, file: !350, line: 70, baseType: !126, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !351, file: !350, line: 70, baseType: !126, size: 64, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !222, file: !69, line: 241, baseType: !211, size: 64, offset: 7808)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !222, file: !69, line: 243, baseType: !349, size: 128, offset: 7872)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !222, file: !69, line: 245, baseType: !126, size: 64, offset: 8000)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOperator", file: !4, line: 198, baseType: !253)
!360 = !{}
!361 = !DILocalVariable(name: "bm", arg: 1, scope: !217, file: !1, line: 134, type: !220)
!362 = !DILocation(line: 134, column: 37, scope: !217)
!363 = !DILocalVariable(name: "op", arg: 2, scope: !217, file: !1, line: 134, type: !358)
!364 = !DILocation(line: 134, column: 53, scope: !217)
!365 = !DILocalVariable(name: "oiter", scope: !217, file: !1, line: 136, type: !366)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOIter", file: !4, line: 463, baseType: !367)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOIter", file: !4, line: 457, size: 448, elements: !368)
!368 = !{!369, !372, !373, !382, !383}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !367, file: !4, line: 458, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpSlot", file: !4, line: 163, baseType: !257)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !367, file: !4, line: 459, baseType: !143, size: 32, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "giter", scope: !367, file: !4, line: 460, baseType: !374, size: 192, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashIterator", file: !286, line: 54, baseType: !375)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GHashIterator", file: !286, line: 50, size: 192, elements: !376)
!376 = !{!377, !378, !381}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "gh", scope: !375, file: !286, line: 51, baseType: !284, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "curEntry", scope: !375, file: !286, line: 52, baseType: !379, size: 64, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry", file: !286, line: 52, flags: DIFlagFwdDecl)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "curBucket", scope: !375, file: !286, line: 53, baseType: !5, size: 32, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !367, file: !4, line: 461, baseType: !130, size: 64, offset: 320)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "restrictmask", scope: !367, file: !4, line: 462, baseType: !132, size: 8, offset: 384)
!384 = !DILocation(line: 136, column: 10, scope: !217)
!385 = !DILocalVariable(name: "f", scope: !217, file: !1, line: 137, type: !211)
!386 = !DILocation(line: 137, column: 10, scope: !217)
!387 = !DILocalVariable(name: "regions", scope: !217, file: !1, line: 138, type: !388)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!389 = !DILocation(line: 138, column: 12, scope: !217)
!390 = !DILocalVariable(name: "faces", scope: !217, file: !1, line: 139, type: !243)
!391 = !DILocation(line: 139, column: 11, scope: !217)
!392 = !DILocalVariable(name: "_regions_count", scope: !217, file: !1, line: 140, type: !143)
!393 = !DILocation(line: 140, column: 2, scope: !217)
!394 = !DILocalVariable(name: "_regions_static", scope: !217, file: !1, line: 140, type: !126)
!395 = !DILocalVariable(name: "_faces_count", scope: !217, file: !1, line: 141, type: !143)
!396 = !DILocation(line: 141, column: 2, scope: !217)
!397 = !DILocalVariable(name: "_faces_static", scope: !217, file: !1, line: 141, type: !126)
!398 = !DILocalVariable(name: "act_face", scope: !217, file: !1, line: 142, type: !211)
!399 = !DILocation(line: 142, column: 10, scope: !217)
!400 = !DILocation(line: 142, column: 21, scope: !217)
!401 = !DILocation(line: 142, column: 25, scope: !217)
!402 = !DILocalVariable(name: "regwalker", scope: !217, file: !1, line: 143, type: !403)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMWalker", file: !43, line: 72, baseType: !404)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMWalker", file: !43, line: 45, size: 960, elements: !405)
!405 = !{!406, !407, !412, !416, !417, !418, !420, !421, !422, !423, !427, !428, !429, !430, !431, !433, !436, !437}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "begin_htype", scope: !404, file: !43, line: 46, baseType: !132, size: 8)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !404, file: !43, line: 47, baseType: !408, size: 64, offset: 64)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{null, !411, !126}
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !404, file: !43, line: 48, baseType: !413, size: 64, offset: 128)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!126, !411}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "yield", scope: !404, file: !43, line: 49, baseType: !413, size: 64, offset: 192)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "structsize", scope: !404, file: !43, line: 50, baseType: !143, size: 32, offset: 256)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !404, file: !43, line: 51, baseType: !419, size: 32, offset: 288)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMWOrder", file: !43, line: 37, baseType: !42)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "valid_mask", scope: !404, file: !43, line: 52, baseType: !143, size: 32, offset: 320)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !404, file: !43, line: 55, baseType: !143, size: 32, offset: 352)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "bm", scope: !404, file: !43, line: 57, baseType: !220, size: 64, offset: 384)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "worklist", scope: !404, file: !43, line: 58, baseType: !424, size: 64, offset: 448)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool", file: !426, line: 47, baseType: !235)
!426 = !DIFile(filename: "blender/source/blender/blenlib/BLI_mempool.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!427 = !DIDerivedType(tag: DW_TAG_member, name: "states", scope: !404, file: !43, line: 59, baseType: !349, size: 128, offset: 512)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "mask_vert", scope: !404, file: !43, line: 63, baseType: !152, size: 16, offset: 640)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "mask_edge", scope: !404, file: !43, line: 64, baseType: !152, size: 16, offset: 656)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "mask_face", scope: !404, file: !43, line: 65, baseType: !152, size: 16, offset: 672)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !404, file: !43, line: 67, baseType: !432, size: 32, offset: 704)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMWFlag", file: !43, line: 42, baseType: !47)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "visit_set", scope: !404, file: !43, line: 69, baseType: !434, size: 64, offset: 768)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: "GSet", file: !286, line: 176, flags: DIFlagFwdDecl)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "visit_set_alt", scope: !404, file: !43, line: 70, baseType: !434, size: 64, offset: 832)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !404, file: !43, line: 71, baseType: !143, size: 32, offset: 896)
!438 = !DILocation(line: 143, column: 11, scope: !217)
!439 = !DILocalVariable(name: "i", scope: !217, file: !1, line: 144, type: !143)
!440 = !DILocation(line: 144, column: 6, scope: !217)
!441 = !DILocalVariable(name: "use_verts", scope: !217, file: !1, line: 146, type: !442)
!442 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !443)
!443 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!444 = !DILocation(line: 146, column: 13, scope: !217)
!445 = !DILocation(line: 146, column: 43, scope: !217)
!446 = !DILocation(line: 146, column: 47, scope: !217)
!447 = !DILocation(line: 146, column: 25, scope: !217)
!448 = !DILocation(line: 148, column: 6, scope: !449)
!449 = distinct !DILexicalBlock(scope: !217, file: !1, line: 148, column: 6)
!450 = !DILocation(line: 148, column: 6, scope: !217)
!451 = !DILocalVariable(name: "viter", scope: !452, file: !1, line: 151, type: !453)
!452 = distinct !DILexicalBlock(scope: !449, file: !1, line: 148, column: 17)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter", file: !52, line: 186, baseType: !454)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter", file: !52, line: 164, size: 512, elements: !455)
!455 = !{!456, !533, !534, !535, !536}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !454, file: !52, line: 179, baseType: !457, size: 320)
!457 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !454, file: !52, line: 166, size: 320, elements: !458)
!458 = !{!459, !471, !477, !485, !493, !499, !505, !511, !515, !521, !527}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "elem_of_mesh", scope: !457, file: !52, line: 167, baseType: !460, size: 192)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__elem_of_mesh", file: !52, line: 113, size: 192, elements: !461)
!461 = !{!462}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "pooliter", scope: !460, file: !52, line: 114, baseType: !463, size: 192)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool_iter", file: !426, line: 80, baseType: !464)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_iter", file: !426, line: 76, size: 192, elements: !465)
!465 = !{!466, !467, !470}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !464, file: !426, line: 77, baseType: !424, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "curchunk", scope: !464, file: !426, line: 78, baseType: !468, size: 64, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_chunk", file: !426, line: 45, flags: DIFlagFwdDecl)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "curindex", scope: !464, file: !426, line: 79, baseType: !5, size: 32, offset: 128)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_vert", scope: !457, file: !52, line: 169, baseType: !472, size: 192)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_vert", file: !52, line: 116, size: 192, elements: !473)
!473 = !{!474, !475, !476}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !472, file: !52, line: 117, baseType: !198, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !472, file: !52, line: 118, baseType: !133, size: 64, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !472, file: !52, line: 118, baseType: !133, size: 64, offset: 128)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_vert", scope: !457, file: !52, line: 170, baseType: !478, size: 320)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_vert", file: !52, line: 120, size: 320, elements: !479)
!479 = !{!480, !481, !482, !483, !484}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !478, file: !52, line: 121, baseType: !198, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !478, file: !52, line: 122, baseType: !182, size: 64, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !478, file: !52, line: 122, baseType: !182, size: 64, offset: 128)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !478, file: !52, line: 123, baseType: !133, size: 64, offset: 192)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !478, file: !52, line: 123, baseType: !133, size: 64, offset: 256)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_vert", scope: !457, file: !52, line: 171, baseType: !486, size: 320)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_vert", file: !52, line: 125, size: 320, elements: !487)
!487 = !{!488, !489, !490, !491, !492}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !486, file: !52, line: 126, baseType: !198, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !486, file: !52, line: 127, baseType: !182, size: 64, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !486, file: !52, line: 127, baseType: !182, size: 64, offset: 128)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !486, file: !52, line: 128, baseType: !133, size: 64, offset: 192)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !486, file: !52, line: 128, baseType: !133, size: 64, offset: 256)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_edge", scope: !457, file: !52, line: 172, baseType: !494, size: 192)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_edge", file: !52, line: 130, size: 192, elements: !495)
!495 = !{!496, !497, !498}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !494, file: !52, line: 131, baseType: !133, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !494, file: !52, line: 132, baseType: !182, size: 64, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !494, file: !52, line: 132, baseType: !182, size: 64, offset: 128)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_loop", scope: !457, file: !52, line: 173, baseType: !500, size: 192)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_loop", file: !52, line: 134, size: 192, elements: !501)
!501 = !{!502, !503, !504}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !500, file: !52, line: 135, baseType: !182, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !500, file: !52, line: 136, baseType: !182, size: 64, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !500, file: !52, line: 136, baseType: !182, size: 64, offset: 128)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_edge", scope: !457, file: !52, line: 174, baseType: !506, size: 192)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_edge", file: !52, line: 138, size: 192, elements: !507)
!507 = !{!508, !509, !510}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !506, file: !52, line: 139, baseType: !133, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !506, file: !52, line: 140, baseType: !182, size: 64, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !506, file: !52, line: 140, baseType: !182, size: 64, offset: 128)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_edge", scope: !457, file: !52, line: 175, baseType: !512, size: 64)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_edge", file: !52, line: 142, size: 64, elements: !513)
!513 = !{!514}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !512, file: !52, line: 143, baseType: !133, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_face", scope: !457, file: !52, line: 176, baseType: !516, size: 192)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_face", file: !52, line: 145, size: 192, elements: !517)
!517 = !{!518, !519, !520}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !516, file: !52, line: 146, baseType: !211, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !516, file: !52, line: 147, baseType: !182, size: 64, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !516, file: !52, line: 147, baseType: !182, size: 64, offset: 128)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_face", scope: !457, file: !52, line: 177, baseType: !522, size: 192)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_face", file: !52, line: 149, size: 192, elements: !523)
!523 = !{!524, !525, !526}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !522, file: !52, line: 150, baseType: !211, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !522, file: !52, line: 151, baseType: !182, size: 64, offset: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !522, file: !52, line: 151, baseType: !182, size: 64, offset: 128)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_face", scope: !457, file: !52, line: 178, baseType: !528, size: 192)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_face", file: !52, line: 153, size: 192, elements: !529)
!529 = !{!530, !531, !532}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !528, file: !52, line: 154, baseType: !211, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !528, file: !52, line: 155, baseType: !182, size: 64, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !528, file: !52, line: 155, baseType: !182, size: 64, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !454, file: !52, line: 181, baseType: !203, size: 64, offset: 320)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !454, file: !52, line: 182, baseType: !207, size: 64, offset: 384)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !454, file: !52, line: 184, baseType: !143, size: 32, offset: 448)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !454, file: !52, line: 185, baseType: !132, size: 8, offset: 480)
!537 = !DILocation(line: 151, column: 10, scope: !452)
!538 = !DILocalVariable(name: "v", scope: !452, file: !1, line: 152, type: !198)
!539 = !DILocation(line: 152, column: 11, scope: !452)
!540 = !DILocation(line: 154, column: 3, scope: !541)
!541 = distinct !DILexicalBlock(scope: !452, file: !1, line: 154, column: 3)
!542 = !DILocation(line: 154, column: 3, scope: !543)
!543 = distinct !DILexicalBlock(scope: !541, file: !1, line: 154, column: 3)
!544 = !DILocation(line: 155, column: 4, scope: !545)
!545 = distinct !DILexicalBlock(scope: !543, file: !1, line: 154, column: 50)
!546 = !DILocation(line: 156, column: 3, scope: !545)
!547 = distinct !{!547, !540, !548}
!548 = !DILocation(line: 156, column: 3, scope: !541)
!549 = !DILocation(line: 157, column: 2, scope: !452)
!550 = !DILocation(line: 159, column: 30, scope: !217)
!551 = !DILocation(line: 159, column: 34, scope: !217)
!552 = !DILocation(line: 159, column: 38, scope: !217)
!553 = !DILocation(line: 159, column: 2, scope: !217)
!554 = !DILocation(line: 162, column: 2, scope: !555)
!555 = distinct !DILexicalBlock(scope: !217, file: !1, line: 162, column: 2)
!556 = !DILocation(line: 162, column: 2, scope: !557)
!557 = distinct !DILexicalBlock(scope: !555, file: !1, line: 162, column: 2)
!558 = !DILocalVariable(name: "f_iter", scope: !559, file: !1, line: 163, type: !211)
!559 = distinct !DILexicalBlock(scope: !557, file: !1, line: 162, column: 55)
!560 = !DILocation(line: 163, column: 11, scope: !559)
!561 = !DILocation(line: 164, column: 8, scope: !562)
!562 = distinct !DILexicalBlock(scope: !559, file: !1, line: 164, column: 7)
!563 = !DILocation(line: 164, column: 7, scope: !559)
!564 = !DILocation(line: 165, column: 4, scope: !565)
!565 = distinct !DILexicalBlock(scope: !562, file: !1, line: 164, column: 46)
!566 = !DILocation(line: 168, column: 3, scope: !567)
!567 = distinct !DILexicalBlock(scope: !559, file: !1, line: 168, column: 3)
!568 = !DILocation(line: 169, column: 9, scope: !559)
!569 = !DILocation(line: 171, column: 24, scope: !559)
!570 = !DILocation(line: 171, column: 3, scope: !559)
!571 = !DILocation(line: 176, column: 39, scope: !572)
!572 = distinct !DILexicalBlock(scope: !559, file: !1, line: 176, column: 3)
!573 = !DILocation(line: 176, column: 17, scope: !572)
!574 = !DILocation(line: 176, column: 15, scope: !572)
!575 = !DILocation(line: 176, column: 8, scope: !572)
!576 = !DILocation(line: 176, column: 43, scope: !577)
!577 = distinct !DILexicalBlock(scope: !572, file: !1, line: 176, column: 3)
!578 = !DILocation(line: 176, column: 3, scope: !572)
!579 = !DILocation(line: 177, column: 4, scope: !580)
!580 = distinct !DILexicalBlock(scope: !577, file: !1, line: 176, column: 82)
!581 = !DILocation(line: 178, column: 3, scope: !580)
!582 = !DILocation(line: 176, column: 60, scope: !577)
!583 = !DILocation(line: 176, column: 58, scope: !577)
!584 = !DILocation(line: 176, column: 3, scope: !577)
!585 = distinct !{!585, !578, !586}
!586 = !DILocation(line: 178, column: 3, scope: !572)
!587 = !DILocation(line: 179, column: 3, scope: !559)
!588 = !DILocation(line: 181, column: 10, scope: !589)
!589 = distinct !DILexicalBlock(scope: !559, file: !1, line: 181, column: 3)
!590 = !DILocation(line: 181, column: 8, scope: !589)
!591 = !DILocation(line: 181, column: 15, scope: !592)
!592 = distinct !DILexicalBlock(scope: !589, file: !1, line: 181, column: 3)
!593 = !DILocation(line: 181, column: 19, scope: !592)
!594 = !DILocation(line: 181, column: 17, scope: !592)
!595 = !DILocation(line: 181, column: 3, scope: !589)
!596 = !DILocation(line: 182, column: 13, scope: !597)
!597 = distinct !DILexicalBlock(scope: !592, file: !1, line: 181, column: 48)
!598 = !DILocation(line: 182, column: 19, scope: !597)
!599 = !DILocation(line: 182, column: 11, scope: !597)
!600 = !DILocation(line: 183, column: 4, scope: !597)
