; ModuleID = 'blender/source/blender/windowmanager/intern/wm_subwindow.c'
source_filename = "blender/source/blender/windowmanager/intern/wm_subwindow.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.wmSubWindow = type { %struct.wmSubWindow*, %struct.wmSubWindow*, %struct.rcti, i32 }
%struct.rcti = type { i32, i32, i32, i32 }
%struct.wmWindow = type { %struct.wmWindow*, %struct.wmWindow*, i8*, %struct.bScreen*, %struct.bScreen*, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i32, i16, i16, %struct.wmEvent*, %struct.wmSubWindow*, %struct.wmGesture*, i32, i32, i8*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase }
%struct.bScreen = type { %struct.ID, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.Scene*, %struct.Scene*, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, %struct.wmTimer*, i8* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.FileData = type opaque
%struct.PackedFile = type opaque
%struct.IDProperty = type { %struct.IDProperty*, %struct.IDProperty*, i8, i8, i16, [64 x i8], i32, %struct.IDPropertyData, i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_curswin", scope: !2, file: !3, line: 287, type: !170, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !9, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "blender/source/blender/windowmanager/intern/wm_subwindow.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{}
!5 = !{!6, !7, !8}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!9 = !{!0, !10}
!10 = !DIGlobalVariableExpression(var: !11, expr: !DIExpression())
!11 = distinct !DIGlobalVariable(name: "_curwindow", scope: !2, file: !3, line: 286, type: !12, isLocal: true, isDefinition: true)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmWindow", file: !14, line: 209, baseType: !15)
!14 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !14, line: 169, size: 2048, elements: !16)
!16 = !{!17, !19, !20, !21, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !143, !159, !162, !163, !164, !165, !166, !167, !168, !169}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !15, file: !14, line: 170, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !15, file: !14, line: 170, baseType: !18, size: 64, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !15, file: !14, line: 172, baseType: !6, size: 64, offset: 128)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !15, file: !14, line: 174, baseType: !22, size: 64, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !24, line: 49, size: 1984, elements: !25)
!24 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!25 = !{!26, !97, !98, !99, !100, !101, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !122}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !23, file: !24, line: 50, baseType: !27, size: 960)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !28, line: 130, baseType: !29)
!28 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !28, line: 117, size: 960, elements: !30)
!30 = !{!31, !32, !33, !35, !55, !59, !61, !63, !64, !65}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !29, file: !28, line: 118, baseType: !6, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !29, file: !28, line: 118, baseType: !6, size: 64, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !29, file: !28, line: 119, baseType: !34, size: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !29, file: !28, line: 120, baseType: !36, size: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !28, line: 136, size: 17600, elements: !38)
!38 = !{!39, !40, !42, !45, !50, !51, !52}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !37, file: !28, line: 137, baseType: !27, size: 960)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !37, file: !28, line: 138, baseType: !41, size: 64, offset: 960)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !37, file: !28, line: 139, baseType: !43, size: 64, offset: 1024)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !28, line: 43, flags: DIFlagFwdDecl)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !37, file: !28, line: 140, baseType: !46, size: 8192, offset: 1088)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 8192, elements: !48)
!47 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!48 = !{!49}
!49 = !DISubrange(count: 1024)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !37, file: !28, line: 141, baseType: !46, size: 8192, offset: 9280)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !37, file: !28, line: 148, baseType: !36, size: 64, offset: 17472)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !37, file: !28, line: 150, baseType: !53, size: 64, offset: 17536)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !28, line: 45, flags: DIFlagFwdDecl)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !29, file: !28, line: 121, baseType: !56, size: 528, offset: 256)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 528, elements: !57)
!57 = !{!58}
!58 = !DISubrange(count: 66)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !29, file: !28, line: 126, baseType: !60, size: 16, offset: 784)
!60 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !29, file: !28, line: 127, baseType: !62, size: 32, offset: 800)
!62 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !29, file: !28, line: 128, baseType: !62, size: 32, offset: 832)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !29, file: !28, line: 128, baseType: !62, size: 32, offset: 864)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !29, file: !28, line: 129, baseType: !66, size: 64, offset: 896)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !28, line: 75, baseType: !68)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !28, line: 62, size: 1024, elements: !69)
!69 = !{!70, !72, !73, !74, !75, !76, !80, !81, !95, !96}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !68, file: !28, line: 63, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !68, file: !28, line: 63, baseType: !71, size: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !68, file: !28, line: 64, baseType: !47, size: 8, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !68, file: !28, line: 64, baseType: !47, size: 8, offset: 136)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !68, file: !28, line: 65, baseType: !60, size: 16, offset: 144)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !68, file: !28, line: 66, baseType: !77, size: 512, offset: 160)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 512, elements: !78)
!78 = !{!79}
!79 = !DISubrange(count: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !68, file: !28, line: 67, baseType: !62, size: 32, offset: 672)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !68, file: !28, line: 69, baseType: !82, size: 256, offset: 704)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !28, line: 60, baseType: !83)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !28, line: 48, size: 256, elements: !84)
!84 = !{!85, !86, !93, !94}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !83, file: !28, line: 49, baseType: !6, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !83, file: !28, line: 58, baseType: !87, size: 128, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !88, line: 71, baseType: !89)
!88 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !88, line: 69, size: 128, elements: !90)
!90 = !{!91, !92}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !89, file: !88, line: 70, baseType: !6, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !89, file: !88, line: 70, baseType: !6, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !83, file: !28, line: 59, baseType: !62, size: 32, offset: 192)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !83, file: !28, line: 59, baseType: !62, size: 32, offset: 224)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !68, file: !28, line: 70, baseType: !62, size: 32, offset: 960)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !68, file: !28, line: 74, baseType: !62, size: 32, offset: 992)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !23, file: !24, line: 52, baseType: !87, size: 128, offset: 960)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !23, file: !24, line: 53, baseType: !87, size: 128, offset: 1088)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !23, file: !24, line: 54, baseType: !87, size: 128, offset: 1216)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !23, file: !24, line: 55, baseType: !87, size: 128, offset: 1344)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !23, file: !24, line: 57, baseType: !102, size: 64, offset: 1472)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !24, line: 45, flags: DIFlagFwdDecl)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "newscene", scope: !23, file: !24, line: 58, baseType: !102, size: 64, offset: 1536)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "redraws_flag", scope: !23, file: !24, line: 60, baseType: !62, size: 32, offset: 1600)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !23, file: !24, line: 61, baseType: !62, size: 32, offset: 1632)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !23, file: !24, line: 63, baseType: !60, size: 16, offset: 1664)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !23, file: !24, line: 64, baseType: !60, size: 16, offset: 1680)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "winid", scope: !23, file: !24, line: 65, baseType: !60, size: 16, offset: 1696)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw", scope: !23, file: !24, line: 66, baseType: !60, size: 16, offset: 1712)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "do_refresh", scope: !23, file: !24, line: 67, baseType: !60, size: 16, offset: 1728)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw_gesture", scope: !23, file: !24, line: 68, baseType: !60, size: 16, offset: 1744)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw_paintcursor", scope: !23, file: !24, line: 69, baseType: !60, size: 16, offset: 1760)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw_drag", scope: !23, file: !24, line: 70, baseType: !60, size: 16, offset: 1776)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !23, file: !24, line: 71, baseType: !60, size: 16, offset: 1792)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "mainwin", scope: !23, file: !24, line: 73, baseType: !60, size: 16, offset: 1808)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "subwinactive", scope: !23, file: !24, line: 74, baseType: !60, size: 16, offset: 1824)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !23, file: !24, line: 76, baseType: !60, size: 16, offset: 1840)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "animtimer", scope: !23, file: !24, line: 78, baseType: !120, size: 64, offset: 1856)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !14, line: 56, flags: DIFlagFwdDecl)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !23, file: !24, line: 79, baseType: !6, size: 64, offset: 1920)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "newscreen", scope: !15, file: !14, line: 175, baseType: !22, size: 64, offset: 256)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "screenname", scope: !15, file: !14, line: 176, baseType: !77, size: 512, offset: 320)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "posx", scope: !15, file: !14, line: 178, baseType: !60, size: 16, offset: 832)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "posy", scope: !15, file: !14, line: 178, baseType: !60, size: 16, offset: 848)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !15, file: !14, line: 178, baseType: !60, size: 16, offset: 864)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !15, file: !14, line: 178, baseType: !60, size: 16, offset: 880)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "windowstate", scope: !15, file: !14, line: 179, baseType: !60, size: 16, offset: 896)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !15, file: !14, line: 180, baseType: !60, size: 16, offset: 912)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !15, file: !14, line: 181, baseType: !60, size: 16, offset: 928)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !15, file: !14, line: 182, baseType: !60, size: 16, offset: 944)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "lastcursor", scope: !15, file: !14, line: 183, baseType: !60, size: 16, offset: 960)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "modalcursor", scope: !15, file: !14, line: 184, baseType: !60, size: 16, offset: 976)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "grabcursor", scope: !15, file: !14, line: 185, baseType: !60, size: 16, offset: 992)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "addmousemove", scope: !15, file: !14, line: 186, baseType: !60, size: 16, offset: 1008)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "winid", scope: !15, file: !14, line: 188, baseType: !62, size: 32, offset: 1024)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "lock_pie_event", scope: !15, file: !14, line: 190, baseType: !60, size: 16, offset: 1056)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "last_pie_event", scope: !15, file: !14, line: 191, baseType: !60, size: 16, offset: 1072)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "eventstate", scope: !15, file: !14, line: 194, baseType: !141, size: 64, offset: 1088)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmEvent", file: !14, line: 43, flags: DIFlagFwdDecl)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "curswin", scope: !15, file: !14, line: 196, baseType: !144, size: 64, offset: 1152)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmSubWindow", file: !3, line: 69, size: 320, elements: !146)
!146 = !{!147, !148, !149, !158}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !145, file: !3, line: 70, baseType: !144, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !145, file: !3, line: 70, baseType: !144, size: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "winrct", scope: !145, file: !3, line: 72, baseType: !150, size: 128, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !151, line: 89, baseType: !152)
!151 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !151, line: 86, size: 128, elements: !153)
!153 = !{!154, !155, !156, !157}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !152, file: !151, line: 87, baseType: !62, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !152, file: !151, line: 87, baseType: !62, size: 32, offset: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !152, file: !151, line: 88, baseType: !62, size: 32, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !152, file: !151, line: 88, baseType: !62, size: 32, offset: 96)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "swinid", scope: !145, file: !3, line: 73, baseType: !62, size: 32, offset: 256)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "tweak", scope: !15, file: !14, line: 198, baseType: !160, size: 64, offset: 1216)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmGesture", file: !14, line: 44, flags: DIFlagFwdDecl)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "drawmethod", scope: !15, file: !14, line: 200, baseType: !62, size: 32, offset: 1280)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "drawfail", scope: !15, file: !14, line: 200, baseType: !62, size: 32, offset: 1312)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "drawdata", scope: !15, file: !14, line: 201, baseType: !6, size: 64, offset: 1344)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !15, file: !14, line: 203, baseType: !87, size: 128, offset: 1408)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !15, file: !14, line: 204, baseType: !87, size: 128, offset: 1536)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "modalhandlers", scope: !15, file: !14, line: 205, baseType: !87, size: 128, offset: 1664)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "subwindows", scope: !15, file: !14, line: 207, baseType: !87, size: 128, offset: 1792)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "gesture", scope: !15, file: !14, line: 208, baseType: !87, size: 128, offset: 1920)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmSubWindow", file: !3, line: 74, baseType: !145)
!172 = !{i32 7, !"Dwarf Version", i32 4}
!173 = !{i32 2, !"Debug Info Version", i32 3}
!174 = !{i32 1, !"wchar_size", i32 4}
!175 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!176 = distinct !DISubprogram(name: "wm_subwindows_free", scope: !3, file: !3, line: 85, type: !177, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!177 = !DISubroutineType(types: !178)
!178 = !{null, !12}
!179 = !DILocalVariable(name: "win", arg: 1, scope: !176, file: !3, line: 85, type: !12)
!180 = !DILocation(line: 85, column: 35, scope: !176)
!181 = !DILocalVariable(name: "swin", scope: !176, file: !3, line: 87, type: !170)
!182 = !DILocation(line: 87, column: 15, scope: !176)
!183 = !DILocation(line: 89, column: 14, scope: !184)
!184 = distinct !DILexicalBlock(scope: !176, file: !3, line: 89, column: 2)
!185 = !DILocation(line: 89, column: 19, scope: !184)
!186 = !DILocation(line: 89, column: 30, scope: !184)
!187 = !DILocation(line: 89, column: 12, scope: !184)
!188 = !DILocation(line: 89, column: 7, scope: !184)
!189 = !DILocation(line: 89, column: 37, scope: !190)
!190 = distinct !DILexicalBlock(scope: !184, file: !3, line: 89, column: 2)
!191 = !DILocation(line: 89, column: 2, scope: !184)
!192 = !DILocation(line: 90, column: 21, scope: !190)
!193 = !DILocation(line: 90, column: 3, scope: !190)
!194 = !DILocation(line: 89, column: 50, scope: !190)
!195 = !DILocation(line: 89, column: 56, scope: !190)
!196 = !DILocation(line: 89, column: 48, scope: !190)
!197 = !DILocation(line: 89, column: 2, scope: !190)
!198 = distinct !{!198, !191, !199}
!199 = !DILocation(line: 90, column: 25, scope: !184)
!200 = !DILocation(line: 92, column: 17, scope: !176)
!201 = !DILocation(line: 92, column: 22, scope: !176)
!202 = !DILocation(line: 92, column: 2, scope: !176)
!203 = !DILocation(line: 93, column: 1, scope: !176)
!204 = distinct !DISubprogram(name: "wm_subwindow_free", scope: !3, file: !3, line: 80, type: !205, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!205 = !DISubroutineType(types: !206)
!206 = !{null, !170}
!207 = !DILocalVariable(name: "UNUSED_swin", arg: 1, scope: !204, file: !3, line: 80, type: !170)
!208 = !DILocation(line: 80, column: 44, scope: !204)
!209 = !DILocation(line: 83, column: 1, scope: !204)
!210 = distinct !DISubprogram(name: "wm_subwindow_get_id", scope: !3, file: !3, line: 96, type: !211, scopeLine: 97, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!211 = !DISubroutineType(types: !212)
!212 = !{!62, !12}
!213 = !DILocalVariable(name: "win", arg: 1, scope: !210, file: !3, line: 96, type: !12)
!214 = !DILocation(line: 96, column: 35, scope: !210)
!215 = !DILocation(line: 98, column: 6, scope: !216)
!216 = distinct !DILexicalBlock(scope: !210, file: !3, line: 98, column: 6)
!217 = !DILocation(line: 98, column: 11, scope: !216)
!218 = !DILocation(line: 98, column: 6, scope: !210)
!219 = !DILocation(line: 99, column: 10, scope: !216)
!220 = !DILocation(line: 99, column: 15, scope: !216)
!221 = !DILocation(line: 99, column: 24, scope: !216)
!222 = !DILocation(line: 99, column: 3, scope: !216)
!223 = !DILocation(line: 100, column: 2, scope: !210)
!224 = !DILocation(line: 101, column: 1, scope: !210)
!225 = distinct !DISubprogram(name: "wm_subwindow_size_get", scope: !3, file: !3, line: 119, type: !226, scopeLine: 120, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!226 = !DISubroutineType(types: !227)
!227 = !{null, !12, !62, !228, !228}
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!229 = !DILocalVariable(name: "win", arg: 1, scope: !225, file: !3, line: 119, type: !12)
!230 = !DILocation(line: 119, column: 38, scope: !225)
!231 = !DILocalVariable(name: "swinid", arg: 2, scope: !225, file: !3, line: 119, type: !62)
!232 = !DILocation(line: 119, column: 47, scope: !225)
!233 = !DILocalVariable(name: "x", arg: 3, scope: !225, file: !3, line: 119, type: !228)
!234 = !DILocation(line: 119, column: 60, scope: !225)
!235 = !DILocalVariable(name: "y", arg: 4, scope: !225, file: !3, line: 119, type: !228)
!236 = !DILocation(line: 119, column: 68, scope: !225)
!237 = !DILocalVariable(name: "swin", scope: !225, file: !3, line: 121, type: !170)
!238 = !DILocation(line: 121, column: 15, scope: !225)
!239 = !DILocation(line: 121, column: 39, scope: !225)
!240 = !DILocation(line: 121, column: 44, scope: !225)
!241 = !DILocation(line: 121, column: 22, scope: !225)
!242 = !DILocation(line: 123, column: 6, scope: !243)
!243 = distinct !DILexicalBlock(scope: !225, file: !3, line: 123, column: 6)
!244 = !DILocation(line: 123, column: 6, scope: !225)
!245 = !DILocation(line: 124, column: 20, scope: !246)
!246 = distinct !DILexicalBlock(scope: !243, file: !3, line: 123, column: 12)
!247 = !DILocation(line: 124, column: 26, scope: !246)
!248 = !DILocation(line: 124, column: 29, scope: !246)
!249 = !DILocation(line: 124, column: 3, scope: !246)
!250 = !DILocation(line: 125, column: 2, scope: !246)
!251 = !DILocation(line: 126, column: 1, scope: !225)
!252 = distinct !DISubprogram(name: "swin_from_swinid", scope: !3, file: !3, line: 103, type: !253, scopeLine: 104, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!253 = !DISubroutineType(types: !254)
!254 = !{!170, !12, !62}
!255 = !DILocalVariable(name: "win", arg: 1, scope: !252, file: !3, line: 103, type: !12)
!256 = !DILocation(line: 103, column: 48, scope: !252)
!257 = !DILocalVariable(name: "swinid", arg: 2, scope: !252, file: !3, line: 103, type: !62)
!258 = !DILocation(line: 103, column: 57, scope: !252)
!259 = !DILocalVariable(name: "swin", scope: !252, file: !3, line: 105, type: !170)
!260 = !DILocation(line: 105, column: 15, scope: !252)
!261 = !DILocation(line: 107, column: 14, scope: !262)
!262 = distinct !DILexicalBlock(scope: !252, file: !3, line: 107, column: 2)
!263 = !DILocation(line: 107, column: 19, scope: !262)
!264 = !DILocation(line: 107, column: 30, scope: !262)
!265 = !DILocation(line: 107, column: 12, scope: !262)
!266 = !DILocation(line: 107, column: 7, scope: !262)
!267 = !DILocation(line: 107, column: 37, scope: !268)
!268 = distinct !DILexicalBlock(scope: !262, file: !3, line: 107, column: 2)
!269 = !DILocation(line: 107, column: 2, scope: !262)
!270 = !DILocation(line: 108, column: 7, scope: !271)
!271 = distinct !DILexicalBlock(scope: !268, file: !3, line: 108, column: 7)
!272 = !DILocation(line: 108, column: 13, scope: !271)
!273 = !DILocation(line: 108, column: 23, scope: !271)
!274 = !DILocation(line: 108, column: 20, scope: !271)
!275 = !DILocation(line: 108, column: 7, scope: !268)
!276 = !DILocation(line: 109, column: 4, scope: !271)
!277 = !DILocation(line: 107, column: 50, scope: !268)
!278 = !DILocation(line: 107, column: 56, scope: !268)
!279 = !DILocation(line: 107, column: 48, scope: !268)
!280 = !DILocation(line: 107, column: 2, scope: !268)
!281 = distinct !{!281, !269, !282}
!282 = !DILocation(line: 109, column: 4, scope: !262)
!283 = !DILocation(line: 110, column: 9, scope: !252)
!284 = !DILocation(line: 110, column: 2, scope: !252)
!285 = distinct !DISubprogram(name: "wm_swin_size_get", scope: !3, file: !3, line: 114, type: !286, scopeLine: 115, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!286 = !DISubroutineType(types: !287)
!287 = !{null, !170, !228, !228}
!288 = !DILocalVariable(name: "swin", arg: 1, scope: !285, file: !3, line: 114, type: !170)
!289 = !DILocation(line: 114, column: 43, scope: !285)
!290 = !DILocalVariable(name: "x", arg: 2, scope: !285, file: !3, line: 114, type: !228)
!291 = !DILocation(line: 114, column: 54, scope: !285)
!292 = !DILocalVariable(name: "y", arg: 3, scope: !285, file: !3, line: 114, type: !228)
!293 = !DILocation(line: 114, column: 62, scope: !285)
!294 = !DILocation(line: 116, column: 24, scope: !285)
!295 = !DILocation(line: 116, column: 30, scope: !285)
!296 = !DILocation(line: 116, column: 7, scope: !285)
!297 = !DILocation(line: 116, column: 38, scope: !285)
!298 = !DILocation(line: 116, column: 3, scope: !285)
!299 = !DILocation(line: 116, column: 5, scope: !285)
!300 = !DILocation(line: 117, column: 24, scope: !285)
!301 = !DILocation(line: 117, column: 30, scope: !285)
!302 = !DILocation(line: 117, column: 7, scope: !285)
!303 = !DILocation(line: 117, column: 38, scope: !285)
!304 = !DILocation(line: 117, column: 3, scope: !285)
!305 = !DILocation(line: 117, column: 5, scope: !285)
!306 = !DILocation(line: 118, column: 1, scope: !285)
!307 = distinct !DISubprogram(name: "wm_subwindow_origin_get", scope: !3, file: !3, line: 134, type: !226, scopeLine: 135, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!308 = !DILocalVariable(name: "win", arg: 1, scope: !307, file: !3, line: 134, type: !12)
!309 = !DILocation(line: 134, column: 40, scope: !307)
!310 = !DILocalVariable(name: "swinid", arg: 2, scope: !307, file: !3, line: 134, type: !62)
!311 = !DILocation(line: 134, column: 49, scope: !307)
!312 = !DILocalVariable(name: "x", arg: 3, scope: !307, file: !3, line: 134, type: !228)
!313 = !DILocation(line: 134, column: 62, scope: !307)
!314 = !DILocalVariable(name: "y", arg: 4, scope: !307, file: !3, line: 134, type: !228)
!315 = !DILocation(line: 134, column: 70, scope: !307)
!316 = !DILocalVariable(name: "swin", scope: !307, file: !3, line: 136, type: !170)
!317 = !DILocation(line: 136, column: 15, scope: !307)
!318 = !DILocation(line: 136, column: 39, scope: !307)
!319 = !DILocation(line: 136, column: 44, scope: !307)
!320 = !DILocation(line: 136, column: 22, scope: !307)
!321 = !DILocation(line: 138, column: 6, scope: !322)
!322 = distinct !DILexicalBlock(scope: !307, file: !3, line: 138, column: 6)
!323 = !DILocation(line: 138, column: 6, scope: !307)
!324 = !DILocation(line: 139, column: 22, scope: !325)
!325 = distinct !DILexicalBlock(scope: !322, file: !3, line: 138, column: 12)
!326 = !DILocation(line: 139, column: 28, scope: !325)
!327 = !DILocation(line: 139, column: 31, scope: !325)
!328 = !DILocation(line: 139, column: 3, scope: !325)
!329 = !DILocation(line: 140, column: 2, scope: !325)
!330 = !DILocation(line: 141, column: 1, scope: !307)
!331 = distinct !DISubprogram(name: "wm_swin_origin_get", scope: !3, file: !3, line: 129, type: !286, scopeLine: 130, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!332 = !DILocalVariable(name: "swin", arg: 1, scope: !331, file: !3, line: 129, type: !170)
!333 = !DILocation(line: 129, column: 45, scope: !331)
!334 = !DILocalVariable(name: "x", arg: 2, scope: !331, file: !3, line: 129, type: !228)
!335 = !DILocation(line: 129, column: 56, scope: !331)
!336 = !DILocalVariable(name: "y", arg: 3, scope: !331, file: !3, line: 129, type: !228)
!337 = !DILocation(line: 129, column: 64, scope: !331)
!338 = !DILocation(line: 131, column: 7, scope: !331)
!339 = !DILocation(line: 131, column: 13, scope: !331)
!340 = !DILocation(line: 131, column: 20, scope: !331)
!341 = !DILocation(line: 131, column: 3, scope: !331)
!342 = !DILocation(line: 131, column: 5, scope: !331)
!343 = !DILocation(line: 132, column: 7, scope: !331)
!344 = !DILocation(line: 132, column: 13, scope: !331)
!345 = !DILocation(line: 132, column: 20, scope: !331)
!346 = !DILocation(line: 132, column: 3, scope: !331)
!347 = !DILocation(line: 132, column: 5, scope: !331)
!348 = !DILocation(line: 133, column: 1, scope: !331)
!349 = distinct !DISubprogram(name: "wm_subwindow_matrix_get", scope: !3, file: !3, line: 157, type: !350, scopeLine: 158, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!350 = !DISubroutineType(types: !351)
!351 = !{null, !12, !62, !352}
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128, elements: !354)
!354 = !{!355}
!355 = !DISubrange(count: 4)
!356 = !DILocalVariable(name: "win", arg: 1, scope: !349, file: !3, line: 157, type: !12)
!357 = !DILocation(line: 157, column: 40, scope: !349)
!358 = !DILocalVariable(name: "swinid", arg: 2, scope: !349, file: !3, line: 157, type: !62)
!359 = !DILocation(line: 157, column: 49, scope: !349)
!360 = !DILocalVariable(name: "mat", arg: 3, scope: !349, file: !3, line: 157, type: !352)
!361 = !DILocation(line: 157, column: 63, scope: !349)
!362 = !DILocalVariable(name: "swin", scope: !349, file: !3, line: 159, type: !170)
!363 = !DILocation(line: 159, column: 15, scope: !349)
!364 = !DILocation(line: 159, column: 39, scope: !349)
!365 = !DILocation(line: 159, column: 44, scope: !349)
!366 = !DILocation(line: 159, column: 22, scope: !349)
!367 = !DILocation(line: 161, column: 6, scope: !368)
!368 = distinct !DILexicalBlock(scope: !349, file: !3, line: 161, column: 6)
!369 = !DILocation(line: 161, column: 6, scope: !349)
!370 = !DILocation(line: 162, column: 22, scope: !371)
!371 = distinct !DILexicalBlock(scope: !368, file: !3, line: 161, column: 12)
!372 = !DILocation(line: 162, column: 27, scope: !371)
!373 = !DILocation(line: 162, column: 33, scope: !371)
!374 = !DILocation(line: 162, column: 3, scope: !371)
!375 = !DILocation(line: 163, column: 2, scope: !371)
!376 = !DILocation(line: 164, column: 1, scope: !349)
!377 = distinct !DISubprogram(name: "wm_swin_matrix_get", scope: !3, file: !3, line: 144, type: !378, scopeLine: 145, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!378 = !DISubroutineType(types: !379)
!379 = !{null, !12, !170, !352}
!380 = !DILocalVariable(name: "win", arg: 1, scope: !377, file: !3, line: 144, type: !12)
!381 = !DILocation(line: 144, column: 42, scope: !377)
!382 = !DILocalVariable(name: "swin", arg: 2, scope: !377, file: !3, line: 144, type: !170)
!383 = !DILocation(line: 144, column: 60, scope: !377)
!384 = !DILocalVariable(name: "mat", arg: 3, scope: !377, file: !3, line: 144, type: !352)
!385 = !DILocation(line: 144, column: 72, scope: !377)
!386 = !DILocation(line: 147, column: 6, scope: !387)
!387 = distinct !DILexicalBlock(scope: !377, file: !3, line: 147, column: 6)
!388 = !DILocation(line: 147, column: 12, scope: !387)
!389 = !DILocation(line: 147, column: 22, scope: !387)
!390 = !DILocation(line: 147, column: 27, scope: !387)
!391 = !DILocation(line: 147, column: 35, scope: !387)
!392 = !DILocation(line: 147, column: 19, scope: !387)
!393 = !DILocation(line: 147, column: 6, scope: !377)
!394 = !DILocalVariable(name: "width", scope: !395, file: !3, line: 148, type: !62)
!395 = distinct !DILexicalBlock(scope: !387, file: !3, line: 147, column: 44)
!396 = !DILocation(line: 148, column: 7, scope: !395)
!397 = !DILocalVariable(name: "height", scope: !395, file: !3, line: 148, type: !62)
!398 = !DILocation(line: 148, column: 14, scope: !395)
!399 = !DILocation(line: 150, column: 20, scope: !395)
!400 = !DILocation(line: 150, column: 3, scope: !395)
!401 = !DILocation(line: 151, column: 19, scope: !395)
!402 = !DILocation(line: 151, column: 47, scope: !395)
!403 = !DILocation(line: 151, column: 40, scope: !395)
!404 = !DILocation(line: 151, column: 53, scope: !395)
!405 = !DILocation(line: 151, column: 93, scope: !395)
!406 = !DILocation(line: 151, column: 86, scope: !395)
!407 = !DILocation(line: 151, column: 100, scope: !395)
!408 = !DILocation(line: 151, column: 3, scope: !395)
!409 = !DILocation(line: 152, column: 2, scope: !395)
!410 = !DILocation(line: 154, column: 46, scope: !411)
!411 = distinct !DILexicalBlock(scope: !387, file: !3, line: 153, column: 7)
!412 = !DILocation(line: 154, column: 37, scope: !411)
!413 = !DILocation(line: 154, column: 3, scope: !411)
!414 = !DILocation(line: 156, column: 1, scope: !377)
!415 = distinct !DISubprogram(name: "wm_subwindow_rect_get", scope: !3, file: !3, line: 171, type: !416, scopeLine: 172, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!416 = !DISubroutineType(types: !417)
!417 = !{null, !12, !62, !418}
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!419 = !DILocalVariable(name: "win", arg: 1, scope: !415, file: !3, line: 171, type: !12)
!420 = !DILocation(line: 171, column: 38, scope: !415)
!421 = !DILocalVariable(name: "swinid", arg: 2, scope: !415, file: !3, line: 171, type: !62)
!422 = !DILocation(line: 171, column: 47, scope: !415)
!423 = !DILocalVariable(name: "r_rect", arg: 3, scope: !415, file: !3, line: 171, type: !418)
!424 = !DILocation(line: 171, column: 61, scope: !415)
!425 = !DILocalVariable(name: "swin", scope: !415, file: !3, line: 173, type: !170)
!426 = !DILocation(line: 173, column: 15, scope: !415)
!427 = !DILocation(line: 173, column: 39, scope: !415)
!428 = !DILocation(line: 173, column: 44, scope: !415)
!429 = !DILocation(line: 173, column: 22, scope: !415)
!430 = !DILocation(line: 175, column: 6, scope: !431)
!431 = distinct !DILexicalBlock(scope: !415, file: !3, line: 175, column: 6)
!432 = !DILocation(line: 175, column: 6, scope: !415)
!433 = !DILocation(line: 176, column: 20, scope: !434)
!434 = distinct !DILexicalBlock(scope: !431, file: !3, line: 175, column: 12)
!435 = !DILocation(line: 176, column: 26, scope: !434)
!436 = !DILocation(line: 176, column: 3, scope: !434)
!437 = !DILocation(line: 177, column: 2, scope: !434)
!438 = !DILocation(line: 178, column: 1, scope: !415)
!439 = distinct !DISubprogram(name: "wm_swin_rect_get", scope: !3, file: !3, line: 167, type: !440, scopeLine: 168, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!440 = !DISubroutineType(types: !441)
!441 = !{null, !170, !418}
!442 = !DILocalVariable(name: "swin", arg: 1, scope: !439, file: !3, line: 167, type: !170)
!443 = !DILocation(line: 167, column: 43, scope: !439)
!444 = !DILocalVariable(name: "r_rect", arg: 2, scope: !439, file: !3, line: 167, type: !418)
!445 = !DILocation(line: 167, column: 55, scope: !439)
!446 = !DILocation(line: 169, column: 3, scope: !439)
!447 = !DILocation(line: 169, column: 12, scope: !439)
!448 = !DILocation(line: 169, column: 18, scope: !439)
!449 = !DILocation(line: 170, column: 1, scope: !439)
!450 = distinct !DISubprogram(name: "wm_subwindow_rect_set", scope: !3, file: !3, line: 185, type: !451, scopeLine: 186, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!451 = !DISubroutineType(types: !452)
!452 = !{null, !12, !62, !453}
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!455 = !DILocalVariable(name: "win", arg: 1, scope: !450, file: !3, line: 185, type: !12)
!456 = !DILocation(line: 185, column: 38, scope: !450)
!457 = !DILocalVariable(name: "swinid", arg: 2, scope: !450, file: !3, line: 185, type: !62)
!458 = !DILocation(line: 185, column: 47, scope: !450)
!459 = !DILocalVariable(name: "rect", arg: 3, scope: !450, file: !3, line: 185, type: !453)
!460 = !DILocation(line: 185, column: 67, scope: !450)
!461 = !DILocalVariable(name: "swin", scope: !450, file: !3, line: 187, type: !170)
!462 = !DILocation(line: 187, column: 15, scope: !450)
!463 = !DILocation(line: 187, column: 39, scope: !450)
!464 = !DILocation(line: 187, column: 44, scope: !450)
!465 = !DILocation(line: 187, column: 22, scope: !450)
!466 = !DILocation(line: 189, column: 6, scope: !467)
!467 = distinct !DILexicalBlock(scope: !450, file: !3, line: 189, column: 6)
!468 = !DILocation(line: 189, column: 6, scope: !450)
!469 = !DILocation(line: 190, column: 20, scope: !470)
!470 = distinct !DILexicalBlock(scope: !467, file: !3, line: 189, column: 12)
!471 = !DILocation(line: 190, column: 26, scope: !470)
!472 = !DILocation(line: 190, column: 3, scope: !470)
!473 = !DILocation(line: 191, column: 2, scope: !470)
!474 = !DILocation(line: 192, column: 1, scope: !450)
!475 = distinct !DISubprogram(name: "wm_swin_rect_set", scope: !3, file: !3, line: 181, type: !476, scopeLine: 182, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!476 = !DISubroutineType(types: !477)
!477 = !{null, !170, !453}
!478 = !DILocalVariable(name: "swin", arg: 1, scope: !475, file: !3, line: 181, type: !170)
!479 = !DILocation(line: 181, column: 43, scope: !475)
!480 = !DILocalVariable(name: "rect", arg: 2, scope: !475, file: !3, line: 181, type: !453)
!481 = !DILocation(line: 181, column: 61, scope: !475)
!482 = !DILocation(line: 183, column: 2, scope: !475)
!483 = !DILocation(line: 183, column: 8, scope: !475)
!484 = !DILocation(line: 183, column: 18, scope: !475)
!485 = !DILocation(line: 183, column: 17, scope: !475)
!486 = !DILocation(line: 184, column: 1, scope: !475)
!487 = distinct !DISubprogram(name: "wm_subwindow_open", scope: !3, file: !3, line: 197, type: !488, scopeLine: 198, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!488 = !DISubroutineType(types: !489)
!489 = !{!62, !12, !453}
!490 = !DILocalVariable(name: "win", arg: 1, scope: !487, file: !3, line: 197, type: !12)
!491 = !DILocation(line: 197, column: 33, scope: !487)
!492 = !DILocalVariable(name: "winrct", arg: 2, scope: !487, file: !3, line: 197, type: !453)
!493 = !DILocation(line: 197, column: 50, scope: !487)
!494 = !DILocalVariable(name: "swin", scope: !487, file: !3, line: 199, type: !170)
!495 = !DILocation(line: 199, column: 15, scope: !487)
!496 = !DILocalVariable(name: "width", scope: !487, file: !3, line: 200, type: !62)
!497 = !DILocation(line: 200, column: 6, scope: !487)
!498 = !DILocalVariable(name: "height", scope: !487, file: !3, line: 200, type: !62)
!499 = !DILocation(line: 200, column: 13, scope: !487)
!500 = !DILocalVariable(name: "freewinid", scope: !487, file: !3, line: 201, type: !62)
!501 = !DILocation(line: 201, column: 6, scope: !487)
!502 = !DILocation(line: 203, column: 14, scope: !503)
!503 = distinct !DILexicalBlock(scope: !487, file: !3, line: 203, column: 2)
!504 = !DILocation(line: 203, column: 19, scope: !503)
!505 = !DILocation(line: 203, column: 30, scope: !503)
!506 = !DILocation(line: 203, column: 12, scope: !503)
!507 = !DILocation(line: 203, column: 7, scope: !503)
!508 = !DILocation(line: 203, column: 37, scope: !509)
!509 = distinct !DILexicalBlock(scope: !503, file: !3, line: 203, column: 2)
!510 = !DILocation(line: 203, column: 2, scope: !503)
!511 = !DILocation(line: 204, column: 7, scope: !512)
!512 = distinct !DILexicalBlock(scope: !509, file: !3, line: 204, column: 7)
!513 = !DILocation(line: 204, column: 20, scope: !512)
!514 = !DILocation(line: 204, column: 26, scope: !512)
!515 = !DILocation(line: 204, column: 17, scope: !512)
!516 = !DILocation(line: 204, column: 7, scope: !509)
!517 = !DILocation(line: 205, column: 16, scope: !512)
!518 = !DILocation(line: 205, column: 22, scope: !512)
!519 = !DILocation(line: 205, column: 29, scope: !512)
!520 = !DILocation(line: 205, column: 14, scope: !512)
!521 = !DILocation(line: 205, column: 4, scope: !512)
!522 = !DILocation(line: 203, column: 50, scope: !509)
!523 = !DILocation(line: 203, column: 56, scope: !509)
!524 = !DILocation(line: 203, column: 48, scope: !509)
!525 = !DILocation(line: 203, column: 2, scope: !509)
!526 = distinct !{!526, !510, !527}
!527 = !DILocation(line: 205, column: 31, scope: !503)
!528 = !DILocation(line: 207, column: 24, scope: !487)
!529 = !DILocation(line: 207, column: 22, scope: !487)
!530 = !DILocation(line: 207, column: 2, scope: !487)
!531 = !DILocation(line: 207, column: 7, scope: !487)
!532 = !DILocation(line: 207, column: 15, scope: !487)
!533 = !DILocation(line: 208, column: 15, scope: !487)
!534 = !DILocation(line: 208, column: 20, scope: !487)
!535 = !DILocation(line: 208, column: 32, scope: !487)
!536 = !DILocation(line: 208, column: 2, scope: !487)
!537 = !DILocation(line: 210, column: 17, scope: !487)
!538 = !DILocation(line: 210, column: 2, scope: !487)
!539 = !DILocation(line: 210, column: 8, scope: !487)
!540 = !DILocation(line: 210, column: 15, scope: !487)
!541 = !DILocation(line: 211, column: 2, scope: !487)
!542 = !DILocation(line: 211, column: 8, scope: !487)
!543 = !DILocation(line: 211, column: 18, scope: !487)
!544 = !DILocation(line: 211, column: 17, scope: !487)
!545 = !DILocation(line: 214, column: 17, scope: !487)
!546 = !DILocation(line: 214, column: 22, scope: !487)
!547 = !DILocation(line: 214, column: 28, scope: !487)
!548 = !DILocation(line: 214, column: 2, scope: !487)
!549 = !DILocation(line: 217, column: 19, scope: !487)
!550 = !DILocation(line: 217, column: 2, scope: !487)
!551 = !DILocation(line: 218, column: 22, scope: !487)
!552 = !DILocation(line: 218, column: 29, scope: !487)
!553 = !DILocation(line: 218, column: 2, scope: !487)
!554 = !DILocation(line: 219, column: 2, scope: !487)
!555 = !DILocation(line: 221, column: 9, scope: !487)
!556 = !DILocation(line: 221, column: 15, scope: !487)
!557 = !DILocation(line: 221, column: 2, scope: !487)
!558 = distinct !DISubprogram(name: "wmSubWindowSet", scope: !3, file: !3, line: 329, type: !559, scopeLine: 330, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!559 = !DISubroutineType(types: !560)
!560 = !{null, !12, !62}
!561 = !DILocalVariable(name: "win", arg: 1, scope: !558, file: !3, line: 329, type: !12)
!562 = !DILocation(line: 329, column: 31, scope: !558)
!563 = !DILocalVariable(name: "swinid", arg: 2, scope: !558, file: !3, line: 329, type: !62)
!564 = !DILocation(line: 329, column: 40, scope: !558)
!565 = !DILocation(line: 331, column: 24, scope: !558)
!566 = !DILocation(line: 331, column: 29, scope: !558)
!567 = !DILocation(line: 331, column: 2, scope: !558)
!568 = !DILocation(line: 332, column: 1, scope: !558)
!569 = distinct !DISubprogram(name: "wmOrtho2_pixelspace", scope: !3, file: !3, line: 374, type: !570, scopeLine: 375, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!570 = !DISubroutineType(types: !571)
!571 = !{null, !572, !572}
!572 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!573 = !DILocalVariable(name: "x", arg: 1, scope: !569, file: !3, line: 374, type: !572)
!574 = !DILocation(line: 374, column: 38, scope: !569)
!575 = !DILocalVariable(name: "y", arg: 2, scope: !569, file: !3, line: 374, type: !572)
!576 = !DILocation(line: 374, column: 53, scope: !569)
!577 = !DILocation(line: 376, column: 18, scope: !569)
!578 = !DILocation(line: 376, column: 21, scope: !569)
!579 = !DILocation(line: 376, column: 2, scope: !569)
!580 = !DILocation(line: 377, column: 1, scope: !569)
!581 = distinct !DISubprogram(name: "wm_subwindow_close", scope: !3, file: !3, line: 225, type: !559, scopeLine: 226, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!582 = !DILocalVariable(name: "win", arg: 1, scope: !581, file: !3, line: 225, type: !12)
!583 = !DILocation(line: 225, column: 35, scope: !581)
!584 = !DILocalVariable(name: "swinid", arg: 2, scope: !581, file: !3, line: 225, type: !62)
!585 = !DILocation(line: 225, column: 44, scope: !581)
!586 = !DILocalVariable(name: "swin", scope: !581, file: !3, line: 227, type: !170)
!587 = !DILocation(line: 227, column: 15, scope: !581)
!588 = !DILocation(line: 227, column: 39, scope: !581)
!589 = !DILocation(line: 227, column: 44, scope: !581)
!590 = !DILocation(line: 227, column: 22, scope: !581)
!591 = !DILocation(line: 229, column: 6, scope: !592)
!592 = distinct !DILexicalBlock(scope: !581, file: !3, line: 229, column: 6)
!593 = !DILocation(line: 229, column: 6, scope: !581)
!594 = !DILocation(line: 230, column: 7, scope: !595)
!595 = distinct !DILexicalBlock(scope: !596, file: !3, line: 230, column: 7)
!596 = distinct !DILexicalBlock(scope: !592, file: !3, line: 229, column: 12)
!597 = !DILocation(line: 230, column: 15, scope: !595)
!598 = !DILocation(line: 230, column: 20, scope: !595)
!599 = !DILocation(line: 230, column: 12, scope: !595)
!600 = !DILocation(line: 230, column: 7, scope: !596)
!601 = !DILocation(line: 231, column: 4, scope: !595)
!602 = !DILocation(line: 231, column: 9, scope: !595)
!603 = !DILocation(line: 231, column: 17, scope: !595)
!604 = !DILocation(line: 232, column: 21, scope: !596)
!605 = !DILocation(line: 232, column: 3, scope: !596)
!606 = !DILocation(line: 233, column: 16, scope: !596)
!607 = !DILocation(line: 233, column: 21, scope: !596)
!608 = !DILocation(line: 233, column: 33, scope: !596)
!609 = !DILocation(line: 233, column: 3, scope: !596)
!610 = !DILocation(line: 234, column: 3, scope: !596)
!611 = !DILocation(line: 234, column: 13, scope: !596)
!612 = !DILocation(line: 235, column: 2, scope: !596)
!613 = !DILocation(line: 237, column: 59, scope: !614)
!614 = distinct !DILexicalBlock(scope: !592, file: !3, line: 236, column: 7)
!615 = !DILocation(line: 237, column: 3, scope: !614)
!616 = !DILocation(line: 239, column: 1, scope: !581)
!617 = distinct !DISubprogram(name: "wm_subwindow_position", scope: !3, file: !3, line: 242, type: !451, scopeLine: 243, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!618 = !DILocalVariable(name: "win", arg: 1, scope: !617, file: !3, line: 242, type: !12)
!619 = !DILocation(line: 242, column: 38, scope: !617)
!620 = !DILocalVariable(name: "swinid", arg: 2, scope: !617, file: !3, line: 242, type: !62)
!621 = !DILocation(line: 242, column: 47, scope: !617)
!622 = !DILocalVariable(name: "winrct", arg: 3, scope: !617, file: !3, line: 242, type: !453)
!623 = !DILocation(line: 242, column: 67, scope: !617)
!624 = !DILocalVariable(name: "swin", scope: !617, file: !3, line: 244, type: !170)
!625 = !DILocation(line: 244, column: 15, scope: !617)
!626 = !DILocation(line: 244, column: 39, scope: !617)
!627 = !DILocation(line: 244, column: 44, scope: !617)
!628 = !DILocation(line: 244, column: 22, scope: !617)
!629 = !DILocation(line: 246, column: 6, scope: !630)
!630 = distinct !DILexicalBlock(scope: !617, file: !3, line: 246, column: 6)
!631 = !DILocation(line: 246, column: 6, scope: !617)
!632 = !DILocalVariable(name: "winsize_x", scope: !633, file: !3, line: 247, type: !634)
!633 = distinct !DILexicalBlock(scope: !630, file: !3, line: 246, column: 12)
!634 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!635 = !DILocation(line: 247, column: 13, scope: !633)
!636 = !DILocation(line: 247, column: 44, scope: !633)
!637 = !DILocation(line: 247, column: 25, scope: !633)
!638 = !DILocalVariable(name: "winsize_y", scope: !633, file: !3, line: 248, type: !634)
!639 = !DILocation(line: 248, column: 13, scope: !633)
!640 = !DILocation(line: 248, column: 44, scope: !633)
!641 = !DILocation(line: 248, column: 25, scope: !633)
!642 = !DILocalVariable(name: "width", scope: !633, file: !3, line: 250, type: !62)
!643 = !DILocation(line: 250, column: 7, scope: !633)
!644 = !DILocalVariable(name: "height", scope: !633, file: !3, line: 250, type: !62)
!645 = !DILocation(line: 250, column: 14, scope: !633)
!646 = !DILocation(line: 252, column: 3, scope: !633)
!647 = !DILocation(line: 252, column: 9, scope: !633)
!648 = !DILocation(line: 252, column: 19, scope: !633)
!649 = !DILocation(line: 252, column: 18, scope: !633)
!650 = !DILocation(line: 267, column: 7, scope: !651)
!651 = distinct !DILexicalBlock(scope: !633, file: !3, line: 267, column: 7)
!652 = !DILocation(line: 267, column: 13, scope: !651)
!653 = !DILocation(line: 267, column: 20, scope: !651)
!654 = !DILocation(line: 267, column: 27, scope: !651)
!655 = !DILocation(line: 267, column: 25, scope: !651)
!656 = !DILocation(line: 267, column: 7, scope: !633)
!657 = !DILocation(line: 268, column: 24, scope: !651)
!658 = !DILocation(line: 268, column: 4, scope: !651)
!659 = !DILocation(line: 268, column: 10, scope: !651)
!660 = !DILocation(line: 268, column: 17, scope: !651)
!661 = !DILocation(line: 268, column: 22, scope: !651)
!662 = !DILocation(line: 269, column: 7, scope: !663)
!663 = distinct !DILexicalBlock(scope: !633, file: !3, line: 269, column: 7)
!664 = !DILocation(line: 269, column: 13, scope: !663)
!665 = !DILocation(line: 269, column: 20, scope: !663)
!666 = !DILocation(line: 269, column: 27, scope: !663)
!667 = !DILocation(line: 269, column: 25, scope: !663)
!668 = !DILocation(line: 269, column: 7, scope: !633)
!669 = !DILocation(line: 270, column: 24, scope: !663)
!670 = !DILocation(line: 270, column: 4, scope: !663)
!671 = !DILocation(line: 270, column: 10, scope: !663)
!672 = !DILocation(line: 270, column: 17, scope: !663)
!673 = !DILocation(line: 270, column: 22, scope: !663)
!674 = !DILocation(line: 273, column: 18, scope: !633)
!675 = !DILocation(line: 273, column: 23, scope: !633)
!676 = !DILocation(line: 273, column: 3, scope: !633)
!677 = !DILocation(line: 274, column: 20, scope: !633)
!678 = !DILocation(line: 274, column: 3, scope: !633)
!679 = !DILocation(line: 275, column: 23, scope: !633)
!680 = !DILocation(line: 275, column: 30, scope: !633)
!681 = !DILocation(line: 275, column: 3, scope: !633)
!682 = !DILocation(line: 276, column: 2, scope: !633)
!683 = !DILocation(line: 278, column: 59, scope: !684)
!684 = distinct !DILexicalBlock(scope: !630, file: !3, line: 277, column: 7)
!685 = !DILocation(line: 278, column: 3, scope: !684)
!686 = !DILocation(line: 280, column: 1, scope: !617)
!687 = distinct !DISubprogram(name: "wmSubWindowScissorSet", scope: !3, file: !3, line: 289, type: !688, scopeLine: 290, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!688 = !DISubroutineType(types: !689)
!689 = !{null, !12, !62, !453, !690}
!690 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!691 = !DILocalVariable(name: "win", arg: 1, scope: !687, file: !3, line: 289, type: !12)
!692 = !DILocation(line: 289, column: 38, scope: !687)
!693 = !DILocalVariable(name: "swinid", arg: 2, scope: !687, file: !3, line: 289, type: !62)
!694 = !DILocation(line: 289, column: 47, scope: !687)
!695 = !DILocalVariable(name: "srct", arg: 3, scope: !687, file: !3, line: 289, type: !453)
!696 = !DILocation(line: 289, column: 67, scope: !687)
!697 = !DILocalVariable(name: "srct_pad", arg: 4, scope: !687, file: !3, line: 289, type: !690)
!698 = !DILocation(line: 289, column: 78, scope: !687)
!699 = !DILocalVariable(name: "width", scope: !687, file: !3, line: 291, type: !62)
!700 = !DILocation(line: 291, column: 6, scope: !687)
!701 = !DILocalVariable(name: "height", scope: !687, file: !3, line: 291, type: !62)
!702 = !DILocation(line: 291, column: 13, scope: !687)
!703 = !DILocation(line: 292, column: 30, scope: !687)
!704 = !DILocation(line: 292, column: 35, scope: !687)
!705 = !DILocation(line: 292, column: 13, scope: !687)
!706 = !DILocation(line: 292, column: 11, scope: !687)
!707 = !DILocation(line: 294, column: 6, scope: !708)
!708 = distinct !DILexicalBlock(scope: !687, file: !3, line: 294, column: 6)
!709 = !DILocation(line: 294, column: 15, scope: !708)
!710 = !DILocation(line: 294, column: 6, scope: !687)
!711 = !DILocation(line: 295, column: 46, scope: !712)
!712 = distinct !DILexicalBlock(scope: !708, file: !3, line: 294, column: 24)
!713 = !DILocation(line: 295, column: 3, scope: !712)
!714 = !DILocation(line: 296, column: 3, scope: !712)
!715 = !DILocation(line: 299, column: 17, scope: !687)
!716 = !DILocation(line: 299, column: 2, scope: !687)
!717 = !DILocation(line: 299, column: 7, scope: !687)
!718 = !DILocation(line: 299, column: 15, scope: !687)
!719 = !DILocation(line: 300, column: 15, scope: !687)
!720 = !DILocation(line: 300, column: 13, scope: !687)
!721 = !DILocation(line: 302, column: 28, scope: !687)
!722 = !DILocation(line: 302, column: 38, scope: !687)
!723 = !DILocation(line: 302, column: 11, scope: !687)
!724 = !DILocation(line: 302, column: 46, scope: !687)
!725 = !DILocation(line: 302, column: 9, scope: !687)
!726 = !DILocation(line: 303, column: 28, scope: !687)
!727 = !DILocation(line: 303, column: 38, scope: !687)
!728 = !DILocation(line: 303, column: 11, scope: !687)
!729 = !DILocation(line: 303, column: 46, scope: !687)
!730 = !DILocation(line: 303, column: 9, scope: !687)
!731 = !DILocation(line: 304, column: 13, scope: !687)
!732 = !DILocation(line: 304, column: 23, scope: !687)
!733 = !DILocation(line: 304, column: 30, scope: !687)
!734 = !DILocation(line: 304, column: 36, scope: !687)
!735 = !DILocation(line: 304, column: 46, scope: !687)
!736 = !DILocation(line: 304, column: 53, scope: !687)
!737 = !DILocation(line: 304, column: 59, scope: !687)
!738 = !DILocation(line: 304, column: 66, scope: !687)
!739 = !DILocation(line: 304, column: 2, scope: !687)
!740 = !DILocation(line: 306, column: 6, scope: !741)
!741 = distinct !DILexicalBlock(scope: !687, file: !3, line: 306, column: 6)
!742 = !DILocation(line: 306, column: 6, scope: !687)
!743 = !DILocalVariable(name: "scissor_width", scope: !744, file: !3, line: 307, type: !62)
!744 = distinct !DILexicalBlock(scope: !741, file: !3, line: 306, column: 12)
!745 = !DILocation(line: 307, column: 7, scope: !744)
!746 = !DILocation(line: 307, column: 40, scope: !744)
!747 = !DILocation(line: 307, column: 24, scope: !744)
!748 = !DILocalVariable(name: "scissor_height", scope: !744, file: !3, line: 308, type: !62)
!749 = !DILocation(line: 308, column: 7, scope: !744)
!750 = !DILocation(line: 308, column: 40, scope: !744)
!751 = !DILocation(line: 308, column: 24, scope: !744)
!752 = !DILocation(line: 312, column: 7, scope: !753)
!753 = distinct !DILexicalBlock(scope: !744, file: !3, line: 312, column: 7)
!754 = !DILocation(line: 312, column: 7, scope: !744)
!755 = !DILocation(line: 313, column: 19, scope: !756)
!756 = distinct !DILexicalBlock(scope: !753, file: !3, line: 312, column: 17)
!757 = !DILocation(line: 314, column: 19, scope: !756)
!758 = !DILocation(line: 315, column: 3, scope: !756)
!759 = !DILocation(line: 317, column: 13, scope: !744)
!760 = !DILocation(line: 317, column: 19, scope: !744)
!761 = !DILocation(line: 317, column: 25, scope: !744)
!762 = !DILocation(line: 317, column: 31, scope: !744)
!763 = !DILocation(line: 317, column: 37, scope: !744)
!764 = !DILocation(line: 317, column: 52, scope: !744)
!765 = !DILocation(line: 317, column: 3, scope: !744)
!766 = !DILocation(line: 318, column: 2, scope: !744)
!767 = !DILocation(line: 320, column: 13, scope: !741)
!768 = !DILocation(line: 320, column: 23, scope: !741)
!769 = !DILocation(line: 320, column: 30, scope: !741)
!770 = !DILocation(line: 320, column: 36, scope: !741)
!771 = !DILocation(line: 320, column: 46, scope: !741)
!772 = !DILocation(line: 320, column: 53, scope: !741)
!773 = !DILocation(line: 320, column: 59, scope: !741)
!774 = !DILocation(line: 320, column: 66, scope: !741)
!775 = !DILocation(line: 320, column: 3, scope: !741)
!776 = !DILocation(line: 322, column: 22, scope: !687)
!777 = !DILocation(line: 322, column: 29, scope: !687)
!778 = !DILocation(line: 322, column: 2, scope: !687)
!779 = !DILocation(line: 323, column: 2, scope: !687)
!780 = !DILocation(line: 325, column: 2, scope: !687)
!781 = !DILocation(line: 326, column: 1, scope: !687)
!782 = distinct !DISubprogram(name: "BLI_rcti_size_x", scope: !783, file: !783, line: 105, type: !784, scopeLine: 105, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!783 = !DIFile(filename: "blender/source/blender/blenlib/BLI_rect.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!784 = !DISubroutineType(types: !785)
!785 = !{!62, !786}
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !152)
!788 = !DILocalVariable(name: "rct", arg: 1, scope: !782, file: !783, line: 105, type: !786)
!789 = !DILocation(line: 105, column: 53, scope: !782)
!790 = !DILocation(line: 105, column: 68, scope: !782)
!791 = !DILocation(line: 105, column: 73, scope: !782)
!792 = !DILocation(line: 105, column: 80, scope: !782)
!793 = !DILocation(line: 105, column: 85, scope: !782)
!794 = !DILocation(line: 105, column: 78, scope: !782)
!795 = !DILocation(line: 105, column: 60, scope: !782)
!796 = distinct !DISubprogram(name: "BLI_rcti_size_y", scope: !783, file: !783, line: 106, type: !784, scopeLine: 106, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!797 = !DILocalVariable(name: "rct", arg: 1, scope: !796, file: !783, line: 106, type: !786)
!798 = !DILocation(line: 106, column: 53, scope: !796)
!799 = !DILocation(line: 106, column: 68, scope: !796)
!800 = !DILocation(line: 106, column: 73, scope: !796)
!801 = !DILocation(line: 106, column: 80, scope: !796)
!802 = !DILocation(line: 106, column: 85, scope: !796)
!803 = !DILocation(line: 106, column: 78, scope: !796)
!804 = !DILocation(line: 106, column: 60, scope: !796)
!805 = distinct !DISubprogram(name: "wmFrustum", scope: !3, file: !3, line: 334, type: !806, scopeLine: 335, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!806 = !DISubroutineType(types: !807)
!807 = !{null, !7, !7, !7, !7, !7, !7}
!808 = !DILocalVariable(name: "x1", arg: 1, scope: !805, file: !3, line: 334, type: !7)
!809 = !DILocation(line: 334, column: 22, scope: !805)
!810 = !DILocalVariable(name: "x2", arg: 2, scope: !805, file: !3, line: 334, type: !7)
!811 = !DILocation(line: 334, column: 32, scope: !805)
!812 = !DILocalVariable(name: "y1", arg: 3, scope: !805, file: !3, line: 334, type: !7)
!813 = !DILocation(line: 334, column: 42, scope: !805)
!814 = !DILocalVariable(name: "y2", arg: 4, scope: !805, file: !3, line: 334, type: !7)
!815 = !DILocation(line: 334, column: 52, scope: !805)
!816 = !DILocalVariable(name: "n", arg: 5, scope: !805, file: !3, line: 334, type: !7)
!817 = !DILocation(line: 334, column: 62, scope: !805)
!818 = !DILocalVariable(name: "f", arg: 6, scope: !805, file: !3, line: 334, type: !7)
!819 = !DILocation(line: 334, column: 71, scope: !805)
!820 = !DILocation(line: 336, column: 2, scope: !805)
!821 = !DILocation(line: 337, column: 2, scope: !805)
!822 = !DILocation(line: 338, column: 12, scope: !805)
!823 = !DILocation(line: 338, column: 16, scope: !805)
!824 = !DILocation(line: 338, column: 20, scope: !805)
!825 = !DILocation(line: 338, column: 24, scope: !805)
!826 = !DILocation(line: 338, column: 28, scope: !805)
!827 = !DILocation(line: 338, column: 31, scope: !805)
!828 = !DILocation(line: 338, column: 2, scope: !805)
!829 = !DILocation(line: 339, column: 2, scope: !805)
!830 = !DILocation(line: 340, column: 1, scope: !805)
!831 = distinct !DISubprogram(name: "wmOrtho", scope: !3, file: !3, line: 342, type: !806, scopeLine: 343, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!832 = !DILocalVariable(name: "x1", arg: 1, scope: !831, file: !3, line: 342, type: !7)
!833 = !DILocation(line: 342, column: 20, scope: !831)
!834 = !DILocalVariable(name: "x2", arg: 2, scope: !831, file: !3, line: 342, type: !7)
!835 = !DILocation(line: 342, column: 30, scope: !831)
!836 = !DILocalVariable(name: "y1", arg: 3, scope: !831, file: !3, line: 342, type: !7)
!837 = !DILocation(line: 342, column: 40, scope: !831)
!838 = !DILocalVariable(name: "y2", arg: 4, scope: !831, file: !3, line: 342, type: !7)
!839 = !DILocation(line: 342, column: 50, scope: !831)
!840 = !DILocalVariable(name: "n", arg: 5, scope: !831, file: !3, line: 342, type: !7)
!841 = !DILocation(line: 342, column: 60, scope: !831)
!842 = !DILocalVariable(name: "f", arg: 6, scope: !831, file: !3, line: 342, type: !7)
!843 = !DILocation(line: 342, column: 69, scope: !831)
!844 = !DILocation(line: 344, column: 2, scope: !831)
!845 = !DILocation(line: 345, column: 2, scope: !831)
!846 = !DILocation(line: 347, column: 10, scope: !831)
!847 = !DILocation(line: 347, column: 14, scope: !831)
!848 = !DILocation(line: 347, column: 18, scope: !831)
!849 = !DILocation(line: 347, column: 22, scope: !831)
!850 = !DILocation(line: 347, column: 26, scope: !831)
!851 = !DILocation(line: 347, column: 29, scope: !831)
!852 = !DILocation(line: 347, column: 2, scope: !831)
!853 = !DILocation(line: 349, column: 2, scope: !831)
!854 = !DILocation(line: 350, column: 1, scope: !831)
!855 = distinct !DISubprogram(name: "wmOrtho2", scope: !3, file: !3, line: 352, type: !856, scopeLine: 353, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!856 = !DISubroutineType(types: !857)
!857 = !{null, !7, !7, !7, !7}
!858 = !DILocalVariable(name: "x1", arg: 1, scope: !855, file: !3, line: 352, type: !7)
!859 = !DILocation(line: 352, column: 21, scope: !855)
!860 = !DILocalVariable(name: "x2", arg: 2, scope: !855, file: !3, line: 352, type: !7)
!861 = !DILocation(line: 352, column: 31, scope: !855)
!862 = !DILocalVariable(name: "y1", arg: 3, scope: !855, file: !3, line: 352, type: !7)
!863 = !DILocation(line: 352, column: 41, scope: !855)
!864 = !DILocalVariable(name: "y2", arg: 4, scope: !855, file: !3, line: 352, type: !7)
!865 = !DILocation(line: 352, column: 51, scope: !855)
!866 = !DILocation(line: 355, column: 6, scope: !867)
!867 = distinct !DILexicalBlock(scope: !855, file: !3, line: 355, column: 6)
!868 = !DILocation(line: 355, column: 12, scope: !867)
!869 = !DILocation(line: 355, column: 9, scope: !867)
!870 = !DILocation(line: 355, column: 6, scope: !855)
!871 = !DILocation(line: 355, column: 19, scope: !867)
!872 = !DILocation(line: 355, column: 16, scope: !867)
!873 = !DILocation(line: 356, column: 6, scope: !874)
!874 = distinct !DILexicalBlock(scope: !855, file: !3, line: 356, column: 6)
!875 = !DILocation(line: 356, column: 12, scope: !874)
!876 = !DILocation(line: 356, column: 9, scope: !874)
!877 = !DILocation(line: 356, column: 6, scope: !855)
!878 = !DILocation(line: 356, column: 19, scope: !874)
!879 = !DILocation(line: 356, column: 16, scope: !874)
!880 = !DILocation(line: 358, column: 10, scope: !855)
!881 = !DILocation(line: 358, column: 14, scope: !855)
!882 = !DILocation(line: 358, column: 18, scope: !855)
!883 = !DILocation(line: 358, column: 22, scope: !855)
!884 = !DILocation(line: 358, column: 2, scope: !855)
!885 = !DILocation(line: 359, column: 1, scope: !855)
!886 = distinct !DISubprogram(name: "wmOrtho2_region_pixelspace", scope: !3, file: !3, line: 369, type: !887, scopeLine: 370, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!887 = !DISubroutineType(types: !888)
!888 = !{null, !889}
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !891)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !24, line: 230, size: 3072, elements: !892)
!892 = !{!893, !895, !896, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !959, !960, !961, !962, !963, !964, !965, !966, !967, !969}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !891, file: !24, line: 231, baseType: !894, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !891, file: !24, line: 231, baseType: !894, size: 64, offset: 64)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !891, file: !24, line: 233, baseType: !897, size: 1280, offset: 128)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "View2D", file: !898, line: 71, baseType: !899)
!898 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view2d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View2D", file: !898, line: 40, size: 1280, elements: !900)
!900 = !{!901, !909, !910, !911, !912, !913, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !938}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !899, file: !898, line: 41, baseType: !902, size: 128)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !151, line: 95, baseType: !903)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !151, line: 92, size: 128, elements: !904)
!904 = !{!905, !906, !907, !908}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !903, file: !151, line: 93, baseType: !7, size: 32)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !903, file: !151, line: 93, baseType: !7, size: 32, offset: 32)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !903, file: !151, line: 94, baseType: !7, size: 32, offset: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !903, file: !151, line: 94, baseType: !7, size: 32, offset: 96)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !899, file: !898, line: 41, baseType: !902, size: 128, offset: 128)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "vert", scope: !899, file: !898, line: 42, baseType: !150, size: 128, offset: 256)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "hor", scope: !899, file: !898, line: 42, baseType: !150, size: 128, offset: 384)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !899, file: !898, line: 43, baseType: !150, size: 128, offset: 512)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !899, file: !898, line: 45, baseType: !914, size: 64, offset: 640)
!914 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !915)
!915 = !{!916}
!916 = !DISubrange(count: 2)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !899, file: !898, line: 45, baseType: !914, size: 64, offset: 704)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "minzoom", scope: !899, file: !898, line: 46, baseType: !7, size: 32, offset: 768)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "maxzoom", scope: !899, file: !898, line: 46, baseType: !7, size: 32, offset: 800)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !899, file: !898, line: 48, baseType: !60, size: 16, offset: 832)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_ui", scope: !899, file: !898, line: 49, baseType: !60, size: 16, offset: 848)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "keeptot", scope: !899, file: !898, line: 51, baseType: !60, size: 16, offset: 864)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "keepzoom", scope: !899, file: !898, line: 52, baseType: !60, size: 16, offset: 880)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "keepofs", scope: !899, file: !898, line: 53, baseType: !60, size: 16, offset: 896)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !899, file: !898, line: 55, baseType: !60, size: 16, offset: 912)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !899, file: !898, line: 56, baseType: !60, size: 16, offset: 928)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !899, file: !898, line: 58, baseType: !60, size: 16, offset: 944)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !899, file: !898, line: 58, baseType: !60, size: 16, offset: 960)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "oldwinx", scope: !899, file: !898, line: 59, baseType: !60, size: 16, offset: 976)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "oldwiny", scope: !899, file: !898, line: 59, baseType: !60, size: 16, offset: 992)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !899, file: !898, line: 61, baseType: !60, size: 16, offset: 1008)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "tab_offset", scope: !899, file: !898, line: 63, baseType: !8, size: 64, offset: 1024)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "tab_num", scope: !899, file: !898, line: 64, baseType: !62, size: 32, offset: 1088)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "tab_cur", scope: !899, file: !898, line: 65, baseType: !62, size: 32, offset: 1120)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "sms", scope: !899, file: !898, line: 68, baseType: !936, size: 64, offset: 1152)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmoothView2DStore", file: !898, line: 68, flags: DIFlagFwdDecl)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_timer", scope: !899, file: !898, line: 69, baseType: !120, size: 64, offset: 1216)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "winrct", scope: !891, file: !24, line: 234, baseType: !150, size: 128, offset: 1408)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "drawrct", scope: !891, file: !24, line: 235, baseType: !150, size: 128, offset: 1536)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !891, file: !24, line: 236, baseType: !60, size: 16, offset: 1664)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !891, file: !24, line: 236, baseType: !60, size: 16, offset: 1680)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "swinid", scope: !891, file: !24, line: 238, baseType: !60, size: 16, offset: 1696)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "regiontype", scope: !891, file: !24, line: 239, baseType: !60, size: 16, offset: 1712)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !891, file: !24, line: 240, baseType: !60, size: 16, offset: 1728)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !891, file: !24, line: 241, baseType: !60, size: 16, offset: 1744)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "fsize", scope: !891, file: !24, line: 243, baseType: !7, size: 32, offset: 1760)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !891, file: !24, line: 244, baseType: !60, size: 16, offset: 1792)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !891, file: !24, line: 244, baseType: !60, size: 16, offset: 1808)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw", scope: !891, file: !24, line: 246, baseType: !60, size: 16, offset: 1824)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw_overlay", scope: !891, file: !24, line: 247, baseType: !60, size: 16, offset: 1840)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !891, file: !24, line: 248, baseType: !60, size: 16, offset: 1856)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "overlap", scope: !891, file: !24, line: 249, baseType: !60, size: 16, offset: 1872)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "flagfullscreen", scope: !891, file: !24, line: 250, baseType: !60, size: 16, offset: 1888)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !891, file: !24, line: 251, baseType: !60, size: 16, offset: 1904)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !891, file: !24, line: 253, baseType: !957, size: 64, offset: 1920)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DICompositeType(tag: DW_TAG_structure_type, name: "ARegionType", file: !24, line: 42, flags: DIFlagFwdDecl)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "uiblocks", scope: !891, file: !24, line: 255, baseType: !87, size: 128, offset: 1984)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "panels", scope: !891, file: !24, line: 256, baseType: !87, size: 128, offset: 2112)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "panels_category_active", scope: !891, file: !24, line: 257, baseType: !87, size: 128, offset: 2240)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "ui_lists", scope: !891, file: !24, line: 258, baseType: !87, size: 128, offset: 2368)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "ui_previews", scope: !891, file: !24, line: 259, baseType: !87, size: 128, offset: 2496)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !891, file: !24, line: 260, baseType: !87, size: 128, offset: 2624)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "panels_category", scope: !891, file: !24, line: 261, baseType: !87, size: 128, offset: 2752)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "regiontimer", scope: !891, file: !24, line: 263, baseType: !120, size: 64, offset: 2880)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "headerstr", scope: !891, file: !24, line: 265, baseType: !968, size: 64, offset: 2944)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "regiondata", scope: !891, file: !24, line: 266, baseType: !6, size: 64, offset: 3008)
!970 = !DILocalVariable(name: "ar", arg: 1, scope: !886, file: !3, line: 369, type: !889)
!971 = !DILocation(line: 369, column: 55, scope: !886)
!972 = !DILocation(line: 371, column: 18, scope: !886)
!973 = !DILocation(line: 371, column: 22, scope: !886)
!974 = !DILocation(line: 371, column: 27, scope: !886)
!975 = !DILocation(line: 371, column: 32, scope: !886)
!976 = !DILocation(line: 371, column: 36, scope: !886)
!977 = !DILocation(line: 371, column: 41, scope: !886)
!978 = !DILocation(line: 371, column: 2, scope: !886)
!979 = !DILocation(line: 372, column: 1, scope: !886)
!980 = distinct !DISubprogram(name: "wmOrtho2_offset", scope: !3, file: !3, line: 361, type: !981, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!981 = !DISubroutineType(types: !982)
!982 = !{null, !572, !572, !572}
!983 = !DILocalVariable(name: "x", arg: 1, scope: !980, file: !3, line: 361, type: !572)
!984 = !DILocation(line: 361, column: 41, scope: !980)
!985 = !DILocalVariable(name: "y", arg: 2, scope: !980, file: !3, line: 361, type: !572)
!986 = !DILocation(line: 361, column: 56, scope: !980)
!987 = !DILocalVariable(name: "ofs", arg: 3, scope: !980, file: !3, line: 361, type: !572)
!988 = !DILocation(line: 361, column: 71, scope: !980)
!989 = !DILocation(line: 363, column: 11, scope: !980)
!990 = !DILocation(line: 363, column: 16, scope: !980)
!991 = !DILocation(line: 363, column: 20, scope: !980)
!992 = !DILocation(line: 363, column: 18, scope: !980)
!993 = !DILocation(line: 363, column: 25, scope: !980)
!994 = !DILocation(line: 363, column: 30, scope: !980)
!995 = !DILocation(line: 363, column: 34, scope: !980)
!996 = !DILocation(line: 363, column: 32, scope: !980)
!997 = !DILocation(line: 363, column: 2, scope: !980)
!998 = !DILocation(line: 364, column: 1, scope: !980)
!999 = distinct !DISubprogram(name: "wmOrtho2_region_ui", scope: !3, file: !3, line: 383, type: !1000, scopeLine: 384, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{null, !1002}
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1004)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "ARegion", file: !24, line: 267, baseType: !891)
!1005 = !DILocalVariable(name: "ar", arg: 1, scope: !999, file: !3, line: 383, type: !1002)
!1006 = !DILocation(line: 383, column: 40, scope: !999)
!1007 = !DILocation(line: 387, column: 18, scope: !999)
!1008 = !DILocation(line: 387, column: 22, scope: !999)
!1009 = !DILocation(line: 387, column: 28, scope: !999)
!1010 = !DILocation(line: 387, column: 32, scope: !999)
!1011 = !DILocation(line: 387, column: 2, scope: !999)
!1012 = !DILocation(line: 388, column: 1, scope: !999)
!1013 = distinct !DISubprogram(name: "index_to_framebuffer", scope: !3, file: !3, line: 426, type: !1014, scopeLine: 427, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!1016, !62}
!1016 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!1017 = !DILocalVariable(name: "index", arg: 1, scope: !1013, file: !3, line: 426, type: !62)
!1018 = !DILocation(line: 426, column: 39, scope: !1013)
!1019 = !DILocalVariable(name: "i", scope: !1013, file: !3, line: 428, type: !1016)
!1020 = !DILocation(line: 428, column: 15, scope: !1013)
!1021 = !DILocation(line: 428, column: 19, scope: !1013)
!1022 = !DILocation(line: 430, column: 10, scope: !1013)
!1023 = !DILocation(line: 430, column: 2, scope: !1013)
!1024 = !DILocation(line: 432, column: 10, scope: !1025)
!1025 = distinct !DILexicalBlock(scope: !1013, file: !3, line: 430, column: 29)
!1026 = !DILocation(line: 432, column: 12, scope: !1025)
