; ModuleID = 'blender/source/blender/editors/sculpt_paint/paint_ops.c'
source_filename = "blender/source/blender/editors/sculpt_paint/paint_ops.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.wmOperatorType = type { i8*, i8*, i8*, i8*, i32 (%struct.bContext*, %struct.wmOperator*)*, i8 (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, void (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, i32 (%struct.bContext*)*, void (%struct.bContext*, %struct.wmOperator*)*, %struct.StructRNA*, %struct.IDProperty*, %struct.PropertyRNA*, %struct.ListBase, %struct.wmKeyMap*, i8*, i32 (%struct.bContext*, %struct.wmOperatorType*)*, %struct.ExtensionRNA, i16 }
%struct.bContext = type opaque
%struct.wmOperator = type { %struct.wmOperator*, %struct.wmOperator*, [64 x i8], %struct.IDProperty*, %struct.wmOperatorType*, i8*, i8*, %struct.PointerRNA*, %struct.ReportList*, %struct.ListBase, %struct.wmOperator*, %struct.uiLayout*, i16, [3 x i16] }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }
%struct.ReportList = type { %struct.ListBase, i32, i32, i32, i32, %struct.wmTimer* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "stencil_control_items", scope: !2, file: !3, line: 849, type: !2573, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "BRUSH_OT_stencil_control", scope: !3, file: !3, line: 847, type: !4, scopeLine: 848, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2226, retainedNodes: !2571)
!3 = !DIFile(filename: "blender/source/blender/editors/sculpt_paint/paint_ops.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorType", file: !8, line: 568, baseType: !9)
!8 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !8, line: 508, size: 1536, elements: !10)
!10 = !{!11, !15, !16, !17, !18, !2152, !2156, !2162, !2166, !2167, !2171, !2172, !2173, !2174, !2178, !2179, !2194, !2195, !2199, !2225}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !9, file: !8, line: 509, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!14 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !9, file: !8, line: 510, baseType: !12, size: 64, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !9, file: !8, line: 511, baseType: !12, size: 64, offset: 128)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !9, file: !8, line: 512, baseType: !12, size: 64, offset: 192)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !9, file: !8, line: 518, baseType: !19, size: 64, offset: 256)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DISubroutineType(types: !21)
!21 = !{!22, !23, !26}
!22 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !25, line: 44, flags: DIFlagFwdDecl)
!25 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !28, line: 328, size: 1344, elements: !29)
!28 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!29 = !{!30, !31, !32, !36, !68, !70, !71, !72, !84, !2145, !2146, !2147, !2150, !2151}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !27, file: !28, line: 329, baseType: !26, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !27, file: !28, line: 329, baseType: !26, size: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !27, file: !28, line: 332, baseType: !33, size: 512, offset: 128)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 512, elements: !34)
!34 = !{!35}
!35 = !DISubrange(count: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !27, file: !28, line: 333, baseType: !37, size: 64, offset: 640)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !39, line: 75, baseType: !40)
!39 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !39, line: 62, size: 1024, elements: !41)
!41 = !{!42, !44, !45, !46, !47, !49, !50, !51, !66, !67}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !40, file: !39, line: 63, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !40, file: !39, line: 63, baseType: !43, size: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !40, file: !39, line: 64, baseType: !14, size: 8, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !40, file: !39, line: 64, baseType: !14, size: 8, offset: 136)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !40, file: !39, line: 65, baseType: !48, size: 16, offset: 144)
!48 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !40, file: !39, line: 66, baseType: !33, size: 512, offset: 160)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !40, file: !39, line: 67, baseType: !22, size: 32, offset: 672)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !40, file: !39, line: 69, baseType: !52, size: 256, offset: 704)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !39, line: 60, baseType: !53)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !39, line: 48, size: 256, elements: !54)
!54 = !{!55, !57, !64, !65}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !53, file: !39, line: 49, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !53, file: !39, line: 58, baseType: !58, size: 128, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !59, line: 71, baseType: !60)
!59 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !59, line: 69, size: 128, elements: !61)
!61 = !{!62, !63}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !60, file: !59, line: 70, baseType: !56, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !60, file: !59, line: 70, baseType: !56, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !53, file: !39, line: 59, baseType: !22, size: 32, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !53, file: !39, line: 59, baseType: !22, size: 32, offset: 224)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !40, file: !39, line: 70, baseType: !22, size: 32, offset: 960)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !40, file: !39, line: 74, baseType: !22, size: 32, offset: 992)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !27, file: !28, line: 336, baseType: !69, size: 64, offset: 704)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !27, file: !28, line: 337, baseType: !56, size: 64, offset: 768)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !27, file: !28, line: 338, baseType: !56, size: 64, offset: 832)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !27, file: !28, line: 340, baseType: !73, size: 64, offset: 896)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !25, line: 55, size: 192, elements: !75)
!75 = !{!76, !80, !83}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !74, file: !25, line: 58, baseType: !77, size: 64)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !74, file: !25, line: 56, size: 64, elements: !78)
!78 = !{!79}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !77, file: !25, line: 57, baseType: !56, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !74, file: !25, line: 60, baseType: !81, size: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !25, line: 41, flags: DIFlagFwdDecl)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !74, file: !25, line: 61, baseType: !56, size: 64, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !27, file: !28, line: 341, baseType: !85, size: 64, offset: 960)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !28, line: 106, size: 320, elements: !87)
!87 = !{!88, !89, !90, !91, !92, !93}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !86, file: !28, line: 107, baseType: !58, size: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !86, file: !28, line: 108, baseType: !22, size: 32, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !86, file: !28, line: 109, baseType: !22, size: 32, offset: 160)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !86, file: !28, line: 110, baseType: !22, size: 32, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !86, file: !28, line: 110, baseType: !22, size: 32, offset: 224)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !86, file: !28, line: 111, baseType: !94, size: 64, offset: 256)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !8, line: 490, size: 768, elements: !96)
!96 = !{!97, !98, !99, !2136, !2137, !2138, !2139, !2140, !2141, !2142, !2143, !2144}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !95, file: !8, line: 491, baseType: !94, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !95, file: !8, line: 491, baseType: !94, size: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !95, file: !8, line: 493, baseType: !100, size: 64, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !28, line: 169, size: 2048, elements: !102)
!102 = !{!103, !104, !105, !106, !2053, !2054, !2055, !2056, !2057, !2058, !2059, !2060, !2061, !2062, !2063, !2064, !2065, !2066, !2067, !2068, !2069, !2070, !2111, !2114, !2128, !2129, !2130, !2131, !2132, !2133, !2134, !2135}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !101, file: !28, line: 170, baseType: !100, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !101, file: !28, line: 170, baseType: !100, size: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !101, file: !28, line: 172, baseType: !56, size: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !101, file: !28, line: 174, baseType: !107, size: 64, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !109, line: 49, size: 1984, elements: !110)
!109 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!110 = !{!111, !147, !148, !149, !150, !151, !2036, !2037, !2038, !2039, !2040, !2041, !2042, !2043, !2044, !2045, !2046, !2047, !2048, !2049, !2050, !2051, !2052}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !108, file: !109, line: 50, baseType: !112, size: 960)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !39, line: 130, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !39, line: 117, size: 960, elements: !114)
!114 = !{!115, !116, !117, !119, !138, !142, !143, !144, !145, !146}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !113, file: !39, line: 118, baseType: !56, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !113, file: !39, line: 118, baseType: !56, size: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !113, file: !39, line: 119, baseType: !118, size: 64, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !113, file: !39, line: 120, baseType: !120, size: 64, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !39, line: 136, size: 17600, elements: !122)
!122 = !{!123, !124, !126, !129, !133, !134, !135}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !121, file: !39, line: 137, baseType: !112, size: 960)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !121, file: !39, line: 138, baseType: !125, size: 64, offset: 960)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !121, file: !39, line: 139, baseType: !127, size: 64, offset: 1024)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !39, line: 43, flags: DIFlagFwdDecl)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !121, file: !39, line: 140, baseType: !130, size: 8192, offset: 1088)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8192, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 1024)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !121, file: !39, line: 141, baseType: !130, size: 8192, offset: 9280)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !121, file: !39, line: 148, baseType: !120, size: 64, offset: 17472)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !121, file: !39, line: 150, baseType: !136, size: 64, offset: 17536)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !39, line: 45, flags: DIFlagFwdDecl)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !113, file: !39, line: 121, baseType: !139, size: 528, offset: 256)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 528, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 66)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !113, file: !39, line: 126, baseType: !48, size: 16, offset: 784)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !113, file: !39, line: 127, baseType: !22, size: 32, offset: 800)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !113, file: !39, line: 128, baseType: !22, size: 32, offset: 832)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !113, file: !39, line: 128, baseType: !22, size: 32, offset: 864)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !113, file: !39, line: 129, baseType: !37, size: 64, offset: 896)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !108, file: !109, line: 52, baseType: !58, size: 128, offset: 960)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !108, file: !109, line: 53, baseType: !58, size: 128, offset: 1088)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !108, file: !109, line: 54, baseType: !58, size: 128, offset: 1216)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !108, file: !109, line: 55, baseType: !58, size: 128, offset: 1344)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !108, file: !109, line: 57, baseType: !152, size: 64, offset: 1472)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !154, line: 1216, size: 39680, elements: !155)
!154 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!155 = !{!156, !157, !161, !539, !542, !543, !544, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !570, !641, !1068, !1662, !1665, !1912, !1924, !1925, !1926, !1927, !1928, !1929, !1930, !1931, !1934, !1935, !1936, !1937, !1938, !1946, !2012, !2019, !2020, !2027, !2028, !2029, !2030, !2031, !2032, !2033}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !153, file: !154, line: 1217, baseType: !112, size: 960)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !153, file: !154, line: 1218, baseType: !158, size: 64, offset: 960)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !160, line: 45, flags: DIFlagFwdDecl)
!160 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!161 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !153, file: !154, line: 1220, baseType: !162, size: 64, offset: 1024)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !164, line: 115, size: 11392, elements: !165)
!164 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!165 = !{!166, !167, !168, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !275, !285, !299, !300, !341, !342, !345, !346, !362, !363, !364, !365, !366, !367, !368, !372, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !388, !389, !390, !391, !392, !393, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !453, !454, !455, !456, !457, !458, !459, !460, !461, !464, !467, !470, !471, !472, !473, !474, !477, !480, !483, !484, !490, !491, !492, !493, !494, !495, !497, !500, !503, !507, !527, !528}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !163, file: !164, line: 116, baseType: !112, size: 960)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !163, file: !164, line: 117, baseType: !158, size: 64, offset: 960)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !163, file: !164, line: 119, baseType: !169, size: 64, offset: 1024)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !171, line: 155, size: 1856, elements: !172)
!171 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_paint.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!172 = !{!173, !176, !179, !182, !185, !186, !187, !193, !213, !215, !219, !222, !223, !224, !226, !229, !232, !233, !234, !235, !236, !240, !241, !243, !245, !246, !250, !251, !254, !257, !258, !259, !260}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "multires", scope: !170, file: !171, line: 157, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "MultiresModifierData", file: !171, line: 157, flags: DIFlagFwdDecl)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "mvert", scope: !170, file: !171, line: 158, baseType: !177, size: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !171, line: 49, flags: DIFlagFwdDecl)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "mpoly", scope: !170, file: !171, line: 159, baseType: !180, size: 64, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !171, line: 159, flags: DIFlagFwdDecl)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "mloop", scope: !170, file: !171, line: 160, baseType: !183, size: 64, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !171, line: 160, flags: DIFlagFwdDecl)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !170, file: !171, line: 161, baseType: !22, size: 32, offset: 256)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "totpoly", scope: !170, file: !171, line: 161, baseType: !22, size: 32, offset: 288)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "face_normals", scope: !170, file: !171, line: 162, baseType: !188, size: 64, offset: 320)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 96, elements: !191)
!190 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!191 = !{!192}
!192 = !DISubrange(count: 3)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "kb", scope: !170, file: !171, line: 163, baseType: !194, size: 64, offset: 384)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "KeyBlock", file: !196, line: 45, size: 1472, elements: !197)
!196 = !DIFile(filename: "blender/source/blender/makesdna/DNA_key_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!197 = !{!198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !195, file: !196, line: 46, baseType: !194, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !195, file: !196, line: 46, baseType: !194, size: 64, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !195, file: !196, line: 48, baseType: !190, size: 32, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "curval", scope: !195, file: !196, line: 51, baseType: !190, size: 32, offset: 160)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !195, file: !196, line: 53, baseType: !48, size: 16, offset: 192)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !195, file: !196, line: 54, baseType: !48, size: 16, offset: 208)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "relative", scope: !195, file: !196, line: 56, baseType: !48, size: 16, offset: 224)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !195, file: !196, line: 57, baseType: !48, size: 16, offset: 240)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "totelem", scope: !195, file: !196, line: 59, baseType: !22, size: 32, offset: 256)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !195, file: !196, line: 60, baseType: !22, size: 32, offset: 288)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !195, file: !196, line: 62, baseType: !56, size: 64, offset: 320)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !195, file: !196, line: 63, baseType: !33, size: 512, offset: 384)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup", scope: !195, file: !196, line: 64, baseType: !33, size: 512, offset: 896)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "slidermin", scope: !195, file: !196, line: 67, baseType: !190, size: 32, offset: 1408)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "slidermax", scope: !195, file: !196, line: 68, baseType: !190, size: 32, offset: 1440)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "vmask", scope: !170, file: !171, line: 164, baseType: !214, size: 64, offset: 448)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "pmap", scope: !170, file: !171, line: 167, baseType: !216, size: 64, offset: 512)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !218)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !171, line: 44, flags: DIFlagFwdDecl)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "bm", scope: !170, file: !171, line: 170, baseType: !220, size: 64, offset: 576)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !171, line: 39, flags: DIFlagFwdDecl)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "cd_vert_node_offset", scope: !170, file: !171, line: 171, baseType: !22, size: 32, offset: 640)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "cd_face_node_offset", scope: !170, file: !171, line: 172, baseType: !22, size: 32, offset: 672)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "bm_smooth_shading", scope: !170, file: !171, line: 173, baseType: !225, size: 8, offset: 704)
!225 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "bm_log", scope: !170, file: !171, line: 175, baseType: !227, size: 64, offset: 768)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMLog", file: !171, line: 175, flags: DIFlagFwdDecl)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "pbvh", scope: !170, file: !171, line: 178, baseType: !230, size: 64, offset: 832)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !171, line: 55, flags: DIFlagFwdDecl)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "show_diffuse_color", scope: !170, file: !171, line: 179, baseType: !225, size: 8, offset: 896)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers_active", scope: !170, file: !171, line: 182, baseType: !225, size: 8, offset: 904)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "orig_cos", scope: !170, file: !171, line: 183, baseType: !188, size: 64, offset: 960)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "deform_cos", scope: !170, file: !171, line: 184, baseType: !188, size: 64, offset: 1024)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "deform_imats", scope: !170, file: !171, line: 185, baseType: !237, size: 64, offset: 1088)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 288, elements: !239)
!239 = !{!192, !192}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "partial_redraw", scope: !170, file: !171, line: 188, baseType: !225, size: 8, offset: 1152)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_side", scope: !170, file: !171, line: 191, baseType: !242, size: 32, offset: 1184)
!242 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "texcache", scope: !170, file: !171, line: 191, baseType: !244, size: 64, offset: 1216)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_actual", scope: !170, file: !171, line: 191, baseType: !242, size: 32, offset: 1280)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "tex_pool", scope: !170, file: !171, line: 192, baseType: !247, size: 64, offset: 1344)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePool", file: !249, line: 33, flags: DIFlagFwdDecl)
!249 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_brush.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!250 = !DIDerivedType(tag: DW_TAG_member, name: "layer_co", scope: !170, file: !171, line: 195, baseType: !188, size: 64, offset: 1408)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "stroke", scope: !170, file: !171, line: 197, baseType: !252, size: 64, offset: 1472)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptStroke", file: !171, line: 197, flags: DIFlagFwdDecl)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !170, file: !171, line: 198, baseType: !255, size: 64, offset: 1536)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DICompositeType(tag: DW_TAG_structure_type, name: "StrokeCache", file: !171, line: 59, flags: DIFlagFwdDecl)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke_valid", scope: !170, file: !171, line: 201, baseType: !225, size: 8, offset: 1600)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke", scope: !170, file: !171, line: 202, baseType: !189, size: 96, offset: 1632)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_accum", scope: !170, file: !171, line: 204, baseType: !189, size: 96, offset: 1728)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_counter", scope: !170, file: !171, line: 205, baseType: !22, size: 32, offset: 1824)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !163, file: !164, line: 121, baseType: !48, size: 16, offset: 1088)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !163, file: !164, line: 121, baseType: !48, size: 16, offset: 1104)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !163, file: !164, line: 122, baseType: !22, size: 32, offset: 1120)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !163, file: !164, line: 122, baseType: !22, size: 32, offset: 1152)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !163, file: !164, line: 122, baseType: !22, size: 32, offset: 1184)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !163, file: !164, line: 123, baseType: !33, size: 512, offset: 1216)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !163, file: !164, line: 124, baseType: !162, size: 64, offset: 1728)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !163, file: !164, line: 124, baseType: !162, size: 64, offset: 1792)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !163, file: !164, line: 127, baseType: !162, size: 64, offset: 1856)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !163, file: !164, line: 127, baseType: !162, size: 64, offset: 1920)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !163, file: !164, line: 127, baseType: !162, size: 64, offset: 1984)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !163, file: !164, line: 128, baseType: !273, size: 64, offset: 2048)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !160, line: 46, flags: DIFlagFwdDecl)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !163, file: !164, line: 130, baseType: !276, size: 64, offset: 2112)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !164, line: 97, size: 832, elements: !278)
!278 = !{!279, !283, !284}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !277, file: !164, line: 98, baseType: !280, size: 768)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 768, elements: !281)
!281 = !{!282, !192}
!282 = !DISubrange(count: 8)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !277, file: !164, line: 99, baseType: !22, size: 32, offset: 768)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !277, file: !164, line: 99, baseType: !22, size: 32, offset: 800)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !163, file: !164, line: 131, baseType: !286, size: 64, offset: 2176)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !288, line: 486, size: 1600, elements: !289)
!288 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!289 = !{!290, !291, !292, !293, !294, !295, !296, !297, !298}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !287, file: !288, line: 487, baseType: !112, size: 960)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !287, file: !288, line: 489, baseType: !58, size: 128, offset: 960)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !287, file: !288, line: 490, baseType: !58, size: 128, offset: 1088)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !287, file: !288, line: 491, baseType: !58, size: 128, offset: 1216)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !287, file: !288, line: 492, baseType: !58, size: 128, offset: 1344)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !287, file: !288, line: 494, baseType: !22, size: 32, offset: 1472)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !287, file: !288, line: 495, baseType: !22, size: 32, offset: 1504)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !287, file: !288, line: 497, baseType: !22, size: 32, offset: 1536)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !287, file: !288, line: 498, baseType: !22, size: 32, offset: 1568)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !163, file: !164, line: 132, baseType: !286, size: 64, offset: 2240)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !163, file: !164, line: 133, baseType: !301, size: 64, offset: 2304)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !288, line: 334, size: 1728, elements: !303)
!303 = !{!304, !305, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !340}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !302, file: !288, line: 335, baseType: !58, size: 128)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !302, file: !288, line: 336, baseType: !306, size: 64, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !288, line: 47, flags: DIFlagFwdDecl)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !302, file: !288, line: 338, baseType: !48, size: 16, offset: 192)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !302, file: !288, line: 338, baseType: !48, size: 16, offset: 208)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !302, file: !288, line: 339, baseType: !242, size: 32, offset: 224)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !302, file: !288, line: 340, baseType: !22, size: 32, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !302, file: !288, line: 342, baseType: !190, size: 32, offset: 288)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !302, file: !288, line: 343, baseType: !189, size: 96, offset: 320)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !302, file: !288, line: 344, baseType: !189, size: 96, offset: 416)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !302, file: !288, line: 347, baseType: !58, size: 128, offset: 512)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !302, file: !288, line: 349, baseType: !22, size: 32, offset: 640)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !302, file: !288, line: 350, baseType: !22, size: 32, offset: 672)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !302, file: !288, line: 351, baseType: !56, size: 64, offset: 704)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !302, file: !288, line: 352, baseType: !56, size: 64, offset: 768)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !302, file: !288, line: 354, baseType: !321, size: 384, offset: 832)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !288, line: 116, baseType: !322)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !288, line: 94, size: 384, elements: !323)
!323 = !{!324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !322, file: !288, line: 96, baseType: !22, size: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !322, file: !288, line: 96, baseType: !22, size: 32, offset: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !322, file: !288, line: 97, baseType: !22, size: 32, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !322, file: !288, line: 97, baseType: !22, size: 32, offset: 96)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !322, file: !288, line: 99, baseType: !48, size: 16, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !322, file: !288, line: 100, baseType: !48, size: 16, offset: 144)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !322, file: !288, line: 102, baseType: !48, size: 16, offset: 160)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !322, file: !288, line: 105, baseType: !48, size: 16, offset: 176)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !322, file: !288, line: 108, baseType: !48, size: 16, offset: 192)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !322, file: !288, line: 109, baseType: !48, size: 16, offset: 208)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !322, file: !288, line: 111, baseType: !48, size: 16, offset: 224)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !322, file: !288, line: 112, baseType: !48, size: 16, offset: 240)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !322, file: !288, line: 114, baseType: !22, size: 32, offset: 256)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !322, file: !288, line: 114, baseType: !22, size: 32, offset: 288)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !322, file: !288, line: 115, baseType: !22, size: 32, offset: 320)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !322, file: !288, line: 115, baseType: !22, size: 32, offset: 352)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !302, file: !288, line: 355, baseType: !33, size: 512, offset: 1216)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !163, file: !164, line: 134, baseType: !56, size: 64, offset: 2368)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !163, file: !164, line: 136, baseType: !343, size: 64, offset: 2432)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !164, line: 58, flags: DIFlagFwdDecl)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !163, file: !164, line: 138, baseType: !321, size: 384, offset: 2496)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !163, file: !164, line: 139, baseType: !347, size: 64, offset: 2880)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !288, line: 80, baseType: !349)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !288, line: 72, size: 192, elements: !350)
!350 = !{!351, !358, !359, !360, !361}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !349, file: !288, line: 73, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !288, line: 59, baseType: !354)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !288, line: 56, size: 128, elements: !355)
!355 = !{!356, !357}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !354, file: !288, line: 57, baseType: !189, size: 96)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !354, file: !288, line: 58, baseType: !22, size: 32, offset: 96)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !349, file: !288, line: 74, baseType: !22, size: 32, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !349, file: !288, line: 76, baseType: !22, size: 32, offset: 96)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !349, file: !288, line: 77, baseType: !22, size: 32, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !349, file: !288, line: 79, baseType: !22, size: 32, offset: 160)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !163, file: !164, line: 141, baseType: !58, size: 128, offset: 2944)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !163, file: !164, line: 142, baseType: !58, size: 128, offset: 3072)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !163, file: !164, line: 143, baseType: !58, size: 128, offset: 3200)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !163, file: !164, line: 144, baseType: !58, size: 128, offset: 3328)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !163, file: !164, line: 146, baseType: !22, size: 32, offset: 3456)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !163, file: !164, line: 147, baseType: !22, size: 32, offset: 3488)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !163, file: !164, line: 150, baseType: !369, size: 64, offset: 3520)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !164, line: 50, flags: DIFlagFwdDecl)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !163, file: !164, line: 151, baseType: !373, size: 64, offset: 3584)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !163, file: !164, line: 152, baseType: !22, size: 32, offset: 3648)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !163, file: !164, line: 153, baseType: !22, size: 32, offset: 3680)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !163, file: !164, line: 156, baseType: !189, size: 96, offset: 3712)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !163, file: !164, line: 156, baseType: !189, size: 96, offset: 3808)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !163, file: !164, line: 156, baseType: !189, size: 96, offset: 3904)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !163, file: !164, line: 157, baseType: !189, size: 96, offset: 4000)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !163, file: !164, line: 158, baseType: !189, size: 96, offset: 4096)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !163, file: !164, line: 159, baseType: !189, size: 96, offset: 4192)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !163, file: !164, line: 160, baseType: !189, size: 96, offset: 4288)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !163, file: !164, line: 160, baseType: !189, size: 96, offset: 4384)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !163, file: !164, line: 161, baseType: !385, size: 128, offset: 4480)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 128, elements: !386)
!386 = !{!387}
!387 = !DISubrange(count: 4)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !163, file: !164, line: 161, baseType: !385, size: 128, offset: 4608)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !163, file: !164, line: 162, baseType: !189, size: 96, offset: 4736)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !163, file: !164, line: 162, baseType: !189, size: 96, offset: 4832)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !163, file: !164, line: 163, baseType: !190, size: 32, offset: 4928)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !163, file: !164, line: 163, baseType: !190, size: 32, offset: 4960)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !163, file: !164, line: 164, baseType: !394, size: 512, offset: 4992)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 512, elements: !395)
!395 = !{!387, !387}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !163, file: !164, line: 165, baseType: !394, size: 512, offset: 5504)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !163, file: !164, line: 166, baseType: !394, size: 512, offset: 6016)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !163, file: !164, line: 167, baseType: !394, size: 512, offset: 6528)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !163, file: !164, line: 176, baseType: !394, size: 512, offset: 7040)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !163, file: !164, line: 178, baseType: !242, size: 32, offset: 7552)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !163, file: !164, line: 180, baseType: !48, size: 16, offset: 7584)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !163, file: !164, line: 181, baseType: !48, size: 16, offset: 7600)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !163, file: !164, line: 183, baseType: !48, size: 16, offset: 7616)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !163, file: !164, line: 183, baseType: !48, size: 16, offset: 7632)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !163, file: !164, line: 184, baseType: !48, size: 16, offset: 7648)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !163, file: !164, line: 184, baseType: !48, size: 16, offset: 7664)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !163, file: !164, line: 185, baseType: !48, size: 16, offset: 7680)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !163, file: !164, line: 186, baseType: !48, size: 16, offset: 7696)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !163, file: !164, line: 187, baseType: !48, size: 16, offset: 7712)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !163, file: !164, line: 188, baseType: !14, size: 8, offset: 7728)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !163, file: !164, line: 189, baseType: !14, size: 8, offset: 7736)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !163, file: !164, line: 192, baseType: !22, size: 32, offset: 7744)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !163, file: !164, line: 192, baseType: !22, size: 32, offset: 7776)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !163, file: !164, line: 192, baseType: !22, size: 32, offset: 7808)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !163, file: !164, line: 192, baseType: !22, size: 32, offset: 7840)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !163, file: !164, line: 194, baseType: !22, size: 32, offset: 7872)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !163, file: !164, line: 202, baseType: !190, size: 32, offset: 7904)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !163, file: !164, line: 202, baseType: !190, size: 32, offset: 7936)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !163, file: !164, line: 202, baseType: !190, size: 32, offset: 7968)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !163, file: !164, line: 211, baseType: !190, size: 32, offset: 8000)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !163, file: !164, line: 212, baseType: !190, size: 32, offset: 8032)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !163, file: !164, line: 213, baseType: !190, size: 32, offset: 8064)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !163, file: !164, line: 214, baseType: !190, size: 32, offset: 8096)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !163, file: !164, line: 215, baseType: !190, size: 32, offset: 8128)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !163, file: !164, line: 216, baseType: !190, size: 32, offset: 8160)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !163, file: !164, line: 219, baseType: !190, size: 32, offset: 8192)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !163, file: !164, line: 220, baseType: !190, size: 32, offset: 8224)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !163, file: !164, line: 221, baseType: !190, size: 32, offset: 8256)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !163, file: !164, line: 224, baseType: !430, size: 16, offset: 8288)
!430 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !163, file: !164, line: 224, baseType: !430, size: 16, offset: 8304)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !163, file: !164, line: 226, baseType: !48, size: 16, offset: 8320)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !163, file: !164, line: 228, baseType: !14, size: 8, offset: 8336)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !163, file: !164, line: 229, baseType: !14, size: 8, offset: 8344)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !163, file: !164, line: 231, baseType: !48, size: 16, offset: 8352)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !163, file: !164, line: 232, baseType: !14, size: 8, offset: 8368)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !163, file: !164, line: 233, baseType: !14, size: 8, offset: 8376)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !163, file: !164, line: 234, baseType: !190, size: 32, offset: 8384)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !163, file: !164, line: 235, baseType: !190, size: 32, offset: 8416)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !163, file: !164, line: 237, baseType: !58, size: 128, offset: 8448)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !163, file: !164, line: 238, baseType: !58, size: 128, offset: 8576)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !163, file: !164, line: 239, baseType: !58, size: 128, offset: 8704)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !163, file: !164, line: 240, baseType: !58, size: 128, offset: 8832)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !163, file: !164, line: 242, baseType: !190, size: 32, offset: 8960)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !163, file: !164, line: 244, baseType: !48, size: 16, offset: 8992)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !163, file: !164, line: 245, baseType: !430, size: 16, offset: 9008)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !163, file: !164, line: 246, baseType: !385, size: 128, offset: 9024)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !163, file: !164, line: 248, baseType: !22, size: 32, offset: 9152)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !163, file: !164, line: 249, baseType: !22, size: 32, offset: 9184)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !163, file: !164, line: 251, baseType: !451, size: 64, offset: 9216)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !164, line: 251, flags: DIFlagFwdDecl)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !163, file: !164, line: 253, baseType: !14, size: 8, offset: 9280)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !163, file: !164, line: 254, baseType: !14, size: 8, offset: 9288)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !163, file: !164, line: 255, baseType: !48, size: 16, offset: 9296)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !163, file: !164, line: 256, baseType: !189, size: 96, offset: 9312)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !163, file: !164, line: 258, baseType: !58, size: 128, offset: 9408)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !163, file: !164, line: 259, baseType: !58, size: 128, offset: 9536)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !163, file: !164, line: 260, baseType: !58, size: 128, offset: 9664)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !163, file: !164, line: 261, baseType: !58, size: 128, offset: 9792)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !163, file: !164, line: 263, baseType: !462, size: 64, offset: 9920)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !164, line: 52, flags: DIFlagFwdDecl)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !163, file: !164, line: 264, baseType: !465, size: 64, offset: 9984)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !164, line: 53, flags: DIFlagFwdDecl)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !163, file: !164, line: 265, baseType: !468, size: 64, offset: 10048)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !288, line: 46, flags: DIFlagFwdDecl)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !163, file: !164, line: 267, baseType: !14, size: 8, offset: 10112)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !163, file: !164, line: 268, baseType: !14, size: 8, offset: 10120)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !163, file: !164, line: 269, baseType: !48, size: 16, offset: 10128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !163, file: !164, line: 270, baseType: !190, size: 32, offset: 10144)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !163, file: !164, line: 272, baseType: !475, size: 64, offset: 10176)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !164, line: 54, flags: DIFlagFwdDecl)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !163, file: !164, line: 275, baseType: !478, size: 64, offset: 10240)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !164, line: 275, flags: DIFlagFwdDecl)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !163, file: !164, line: 277, baseType: !481, size: 64, offset: 10304)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !164, line: 56, flags: DIFlagFwdDecl)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !163, file: !164, line: 277, baseType: !481, size: 64, offset: 10368)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !163, file: !164, line: 278, baseType: !485, size: 64, offset: 10432)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !486, line: 27, baseType: !487)
!486 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !488, line: 45, baseType: !489)
!488 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!489 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !163, file: !164, line: 279, baseType: !485, size: 64, offset: 10496)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !163, file: !164, line: 280, baseType: !242, size: 32, offset: 10560)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !163, file: !164, line: 281, baseType: !242, size: 32, offset: 10592)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !163, file: !164, line: 283, baseType: !58, size: 128, offset: 10624)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !163, file: !164, line: 284, baseType: !58, size: 128, offset: 10752)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !163, file: !164, line: 285, baseType: !496, size: 64, offset: 10880)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !163, file: !164, line: 287, baseType: !498, size: 64, offset: 10944)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !164, line: 59, flags: DIFlagFwdDecl)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !163, file: !164, line: 288, baseType: !501, size: 64, offset: 11008)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !164, line: 288, flags: DIFlagFwdDecl)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !163, file: !164, line: 290, baseType: !504, size: 64, offset: 11072)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 64, elements: !505)
!505 = !{!506}
!506 = !DISubrange(count: 2)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !163, file: !164, line: 291, baseType: !508, size: 64, offset: 11136)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !510, line: 65, baseType: !511)
!510 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !510, line: 50, size: 320, elements: !512)
!512 = !{!513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !511, file: !510, line: 51, baseType: !152, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !511, file: !510, line: 53, baseType: !22, size: 32, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !511, file: !510, line: 54, baseType: !22, size: 32, offset: 96)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !511, file: !510, line: 55, baseType: !22, size: 32, offset: 128)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !511, file: !510, line: 55, baseType: !22, size: 32, offset: 160)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !511, file: !510, line: 56, baseType: !14, size: 8, offset: 192)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !511, file: !510, line: 56, baseType: !14, size: 8, offset: 200)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !511, file: !510, line: 57, baseType: !14, size: 8, offset: 208)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !511, file: !510, line: 57, baseType: !14, size: 8, offset: 216)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !511, file: !510, line: 59, baseType: !48, size: 16, offset: 224)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !511, file: !510, line: 59, baseType: !48, size: 16, offset: 240)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !511, file: !510, line: 59, baseType: !48, size: 16, offset: 256)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !511, file: !510, line: 61, baseType: !48, size: 16, offset: 272)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !511, file: !510, line: 63, baseType: !22, size: 32, offset: 288)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !163, file: !164, line: 293, baseType: !58, size: 128, offset: 11200)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !163, file: !164, line: 294, baseType: !529, size: 64, offset: 11328)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !164, line: 113, baseType: !531)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !164, line: 108, size: 256, elements: !532)
!532 = !{!533, !535, !536, !537, !538}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !531, file: !164, line: 109, baseType: !534, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !531, file: !164, line: 109, baseType: !534, size: 64, offset: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !531, file: !164, line: 110, baseType: !162, size: 64, offset: 128)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !531, file: !164, line: 111, baseType: !22, size: 32, offset: 192)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !531, file: !164, line: 112, baseType: !190, size: 32, offset: 224)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !153, file: !154, line: 1221, baseType: !540, size: 64, offset: 1088)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !154, line: 52, flags: DIFlagFwdDecl)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !153, file: !154, line: 1223, baseType: !152, size: 64, offset: 1152)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !153, file: !154, line: 1225, baseType: !58, size: 128, offset: 1216)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !153, file: !154, line: 1226, baseType: !545, size: 64, offset: 1344)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !154, line: 69, size: 320, elements: !547)
!547 = !{!548, !549, !550, !551, !552, !553, !554, !555}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !546, file: !154, line: 70, baseType: !545, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !546, file: !154, line: 70, baseType: !545, size: 64, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !546, file: !154, line: 71, baseType: !242, size: 32, offset: 128)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !546, file: !154, line: 71, baseType: !242, size: 32, offset: 160)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !546, file: !154, line: 72, baseType: !22, size: 32, offset: 192)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !546, file: !154, line: 73, baseType: !48, size: 16, offset: 224)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !546, file: !154, line: 73, baseType: !48, size: 16, offset: 240)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !546, file: !154, line: 74, baseType: !162, size: 64, offset: 256)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !153, file: !154, line: 1227, baseType: !162, size: 64, offset: 1408)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !153, file: !154, line: 1229, baseType: !189, size: 96, offset: 1472)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !153, file: !154, line: 1230, baseType: !189, size: 96, offset: 1568)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !153, file: !154, line: 1231, baseType: !189, size: 96, offset: 1664)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !153, file: !154, line: 1231, baseType: !189, size: 96, offset: 1760)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !153, file: !154, line: 1233, baseType: !242, size: 32, offset: 1856)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !153, file: !154, line: 1234, baseType: !22, size: 32, offset: 1888)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !153, file: !154, line: 1235, baseType: !242, size: 32, offset: 1920)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !153, file: !154, line: 1237, baseType: !48, size: 16, offset: 1952)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !153, file: !154, line: 1239, baseType: !14, size: 8, offset: 1968)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !153, file: !154, line: 1240, baseType: !567, size: 8, offset: 1976)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8, elements: !568)
!568 = !{!569}
!569 = !DISubrange(count: 1)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !153, file: !154, line: 1242, baseType: !571, size: 64, offset: 1984)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !573, line: 328, size: 3456, elements: !574)
!573 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!574 = !{!575, !576, !577, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !607, !608, !609, !612, !617, !618, !621, !625, !629, !633, !637, !638, !639, !640}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !572, file: !573, line: 329, baseType: !112, size: 960)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !572, file: !573, line: 330, baseType: !158, size: 64, offset: 960)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !572, file: !573, line: 332, baseType: !578, size: 64, offset: 1024)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !573, line: 332, flags: DIFlagFwdDecl)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !572, file: !573, line: 333, baseType: !33, size: 512, offset: 1088)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !572, file: !573, line: 335, baseType: !81, size: 64, offset: 1600)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !572, file: !573, line: 337, baseType: !343, size: 64, offset: 1664)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !572, file: !573, line: 338, baseType: !504, size: 64, offset: 1728)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !572, file: !573, line: 340, baseType: !58, size: 128, offset: 1792)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !572, file: !573, line: 340, baseType: !58, size: 128, offset: 1920)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !572, file: !573, line: 342, baseType: !22, size: 32, offset: 2048)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !572, file: !573, line: 342, baseType: !22, size: 32, offset: 2080)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !572, file: !573, line: 343, baseType: !22, size: 32, offset: 2112)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !572, file: !573, line: 345, baseType: !22, size: 32, offset: 2144)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !572, file: !573, line: 346, baseType: !22, size: 32, offset: 2176)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !572, file: !573, line: 347, baseType: !48, size: 16, offset: 2208)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !572, file: !573, line: 348, baseType: !48, size: 16, offset: 2224)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !572, file: !573, line: 349, baseType: !22, size: 32, offset: 2240)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !572, file: !573, line: 351, baseType: !22, size: 32, offset: 2272)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !572, file: !573, line: 353, baseType: !48, size: 16, offset: 2304)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !572, file: !573, line: 354, baseType: !48, size: 16, offset: 2320)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !572, file: !573, line: 355, baseType: !22, size: 32, offset: 2336)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !572, file: !573, line: 357, baseType: !599, size: 128, offset: 2368)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !600, line: 95, baseType: !601)
!600 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !600, line: 92, size: 128, elements: !602)
!602 = !{!603, !604, !605, !606}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !601, file: !600, line: 93, baseType: !190, size: 32)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !601, file: !600, line: 93, baseType: !190, size: 32, offset: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !601, file: !600, line: 94, baseType: !190, size: 32, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !601, file: !600, line: 94, baseType: !190, size: 32, offset: 96)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !572, file: !573, line: 363, baseType: !58, size: 128, offset: 2496)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !572, file: !573, line: 363, baseType: !58, size: 128, offset: 2624)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !572, file: !573, line: 368, baseType: !610, size: 64, offset: 2752)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !573, line: 48, flags: DIFlagFwdDecl)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !572, file: !573, line: 372, baseType: !613, size: 32, offset: 2816)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !573, line: 274, baseType: !614)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !573, line: 271, size: 32, elements: !615)
!615 = !{!616}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !614, file: !573, line: 273, baseType: !242, size: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !572, file: !573, line: 373, baseType: !22, size: 32, offset: 2848)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !572, file: !573, line: 382, baseType: !619, size: 64, offset: 2880)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !573, line: 46, flags: DIFlagFwdDecl)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !572, file: !573, line: 385, baseType: !622, size: 64, offset: 2944)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DISubroutineType(types: !624)
!624 = !{null, !56, !190}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !572, file: !573, line: 386, baseType: !626, size: 64, offset: 3008)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DISubroutineType(types: !628)
!628 = !{null, !56, !373}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !572, file: !573, line: 387, baseType: !630, size: 64, offset: 3072)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DISubroutineType(types: !632)
!632 = !{!22, !56}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !572, file: !573, line: 388, baseType: !634, size: 64, offset: 3136)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{null, !56}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !572, file: !573, line: 389, baseType: !56, size: 64, offset: 3200)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !572, file: !573, line: 389, baseType: !56, size: 64, offset: 3264)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !572, file: !573, line: 389, baseType: !56, size: 64, offset: 3328)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !572, file: !573, line: 389, baseType: !56, size: 64, offset: 3392)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !153, file: !154, line: 1244, baseType: !642, size: 64, offset: 2048)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !644, line: 200, size: 17024, elements: !645)
!644 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!645 = !{!646, !647, !648, !649, !1061, !1062, !1063, !1064, !1065, !1066, !1067}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !643, file: !644, line: 201, baseType: !496, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !643, file: !644, line: 202, baseType: !58, size: 128, offset: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !643, file: !644, line: 203, baseType: !58, size: 128, offset: 192)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !643, file: !644, line: 206, baseType: !650, size: 64, offset: 320)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !644, line: 190, baseType: !652)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !644, line: 126, size: 2816, elements: !653)
!653 = !{!654, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !752, !753, !754, !755, !1032, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1060}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !652, file: !644, line: 127, baseType: !655, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !652, file: !644, line: 127, baseType: !655, size: 64, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !652, file: !644, line: 128, baseType: !56, size: 64, offset: 128)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !652, file: !644, line: 129, baseType: !56, size: 64, offset: 192)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !652, file: !644, line: 130, baseType: !33, size: 512, offset: 256)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !652, file: !644, line: 132, baseType: !22, size: 32, offset: 768)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !652, file: !644, line: 132, baseType: !22, size: 32, offset: 800)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !652, file: !644, line: 133, baseType: !22, size: 32, offset: 832)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !652, file: !644, line: 134, baseType: !22, size: 32, offset: 864)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !652, file: !644, line: 134, baseType: !22, size: 32, offset: 896)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !652, file: !644, line: 134, baseType: !22, size: 32, offset: 928)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !652, file: !644, line: 135, baseType: !22, size: 32, offset: 960)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !652, file: !644, line: 135, baseType: !22, size: 32, offset: 992)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !652, file: !644, line: 136, baseType: !22, size: 32, offset: 1024)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !652, file: !644, line: 136, baseType: !22, size: 32, offset: 1056)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !652, file: !644, line: 137, baseType: !22, size: 32, offset: 1088)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !652, file: !644, line: 137, baseType: !22, size: 32, offset: 1120)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !652, file: !644, line: 138, baseType: !190, size: 32, offset: 1152)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !652, file: !644, line: 139, baseType: !190, size: 32, offset: 1184)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !652, file: !644, line: 139, baseType: !190, size: 32, offset: 1216)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !652, file: !644, line: 141, baseType: !48, size: 16, offset: 1248)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !652, file: !644, line: 142, baseType: !48, size: 16, offset: 1264)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !652, file: !644, line: 143, baseType: !22, size: 32, offset: 1280)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !652, file: !644, line: 144, baseType: !22, size: 32, offset: 1312)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !652, file: !644, line: 146, baseType: !680, size: 64, offset: 1344)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !644, line: 114, baseType: !682)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !644, line: 99, size: 7232, elements: !683)
!683 = !{!684, !686, !687, !688, !689, !690, !691, !702, !706, !720, !729, !736, !746}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !682, file: !644, line: 100, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !682, file: !644, line: 100, baseType: !685, size: 64, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !682, file: !644, line: 101, baseType: !22, size: 32, offset: 128)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !682, file: !644, line: 101, baseType: !22, size: 32, offset: 160)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !682, file: !644, line: 102, baseType: !22, size: 32, offset: 192)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !682, file: !644, line: 102, baseType: !22, size: 32, offset: 224)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !682, file: !644, line: 103, baseType: !692, size: 64, offset: 256)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !644, line: 59, baseType: !694)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !644, line: 56, size: 2112, elements: !695)
!695 = !{!696, !700, !701}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !694, file: !644, line: 57, baseType: !697, size: 2048)
!697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 2048, elements: !698)
!698 = !{!699}
!699 = !DISubrange(count: 256)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !694, file: !644, line: 58, baseType: !22, size: 32, offset: 2048)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !694, file: !644, line: 58, baseType: !22, size: 32, offset: 2080)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !682, file: !644, line: 106, baseType: !703, size: 6144, offset: 320)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 6144, elements: !704)
!704 = !{!705}
!705 = !DISubrange(count: 768)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !682, file: !644, line: 107, baseType: !707, size: 64, offset: 6464)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !644, line: 97, baseType: !709)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !644, line: 83, size: 8320, elements: !710)
!710 = !{!711, !712, !713, !716, !717, !718, !719}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !709, file: !644, line: 84, baseType: !703, size: 6144)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !709, file: !644, line: 87, baseType: !697, size: 2048, offset: 6144)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !709, file: !644, line: 88, baseType: !714, size: 64, offset: 8192)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !510, line: 41, flags: DIFlagFwdDecl)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !709, file: !644, line: 90, baseType: !48, size: 16, offset: 8256)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !709, file: !644, line: 92, baseType: !48, size: 16, offset: 8272)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !709, file: !644, line: 93, baseType: !48, size: 16, offset: 8288)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !709, file: !644, line: 95, baseType: !48, size: 16, offset: 8304)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !682, file: !644, line: 108, baseType: !721, size: 64, offset: 6528)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !644, line: 66, baseType: !723)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !644, line: 61, size: 128, elements: !724)
!724 = !{!725, !726, !727, !728}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !723, file: !644, line: 62, baseType: !22, size: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !723, file: !644, line: 63, baseType: !22, size: 32, offset: 32)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !723, file: !644, line: 64, baseType: !22, size: 32, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !723, file: !644, line: 65, baseType: !22, size: 32, offset: 96)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !682, file: !644, line: 109, baseType: !730, size: 64, offset: 6592)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !644, line: 71, baseType: !732)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !644, line: 68, size: 64, elements: !733)
!733 = !{!734, !735}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !732, file: !644, line: 69, baseType: !22, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !732, file: !644, line: 70, baseType: !22, size: 32, offset: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !682, file: !644, line: 110, baseType: !737, size: 64, offset: 6656)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !644, line: 81, baseType: !739)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !644, line: 73, size: 352, elements: !740)
!740 = !{!741, !742, !743, !744, !745}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !739, file: !644, line: 74, baseType: !189, size: 96)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !739, file: !644, line: 75, baseType: !189, size: 96, offset: 96)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !739, file: !644, line: 76, baseType: !189, size: 96, offset: 192)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !739, file: !644, line: 77, baseType: !22, size: 32, offset: 288)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !739, file: !644, line: 78, baseType: !22, size: 32, offset: 320)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !682, file: !644, line: 113, baseType: !747, size: 512, offset: 6720)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !748, line: 182, baseType: !749)
!748 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !748, line: 180, size: 512, elements: !750)
!750 = !{!751}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !749, file: !748, line: 181, baseType: !33, size: 512)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !652, file: !644, line: 148, baseType: !273, size: 64, offset: 1408)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !652, file: !644, line: 151, baseType: !152, size: 64, offset: 1472)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !652, file: !644, line: 152, baseType: !162, size: 64, offset: 1536)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !652, file: !644, line: 153, baseType: !756, size: 64, offset: 1600)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !758, line: 64, size: 19136, elements: !759)
!758 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!759 = !{!760, !761, !762, !763, !764, !765, !767, !768, !769, !770, !773, !774, !1018, !1019, !1027, !1028, !1029, !1030, !1031}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !757, file: !758, line: 65, baseType: !112, size: 960)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !757, file: !758, line: 66, baseType: !158, size: 64, offset: 960)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !757, file: !758, line: 68, baseType: !130, size: 8192, offset: 1024)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !757, file: !758, line: 70, baseType: !22, size: 32, offset: 9216)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !757, file: !758, line: 71, baseType: !22, size: 32, offset: 9248)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !757, file: !758, line: 72, baseType: !766, size: 64, offset: 9280)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 64, elements: !505)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !757, file: !758, line: 74, baseType: !190, size: 32, offset: 9344)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !757, file: !758, line: 74, baseType: !190, size: 32, offset: 9376)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !757, file: !758, line: 76, baseType: !714, size: 64, offset: 9408)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !757, file: !758, line: 77, baseType: !771, size: 64, offset: 9472)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !758, line: 77, flags: DIFlagFwdDecl)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !757, file: !758, line: 78, baseType: !343, size: 64, offset: 9536)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !757, file: !758, line: 80, baseType: !775, size: 2624, offset: 9600)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !776, line: 340, size: 2624, elements: !777)
!776 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!777 = !{!778, !806, !824, !825, !826, !841, !899, !900, !998, !999, !1000, !1001, !1007}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !775, file: !776, line: 341, baseType: !779, size: 576)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !776, line: 251, baseType: !780)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !776, line: 207, size: 576, elements: !781)
!781 = !{!782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !780, file: !776, line: 208, baseType: !22, size: 32)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !780, file: !776, line: 211, baseType: !48, size: 16, offset: 32)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !780, file: !776, line: 212, baseType: !48, size: 16, offset: 48)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !780, file: !776, line: 213, baseType: !190, size: 32, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !780, file: !776, line: 214, baseType: !48, size: 16, offset: 96)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !780, file: !776, line: 215, baseType: !48, size: 16, offset: 112)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !780, file: !776, line: 216, baseType: !48, size: 16, offset: 128)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !780, file: !776, line: 217, baseType: !48, size: 16, offset: 144)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !780, file: !776, line: 218, baseType: !48, size: 16, offset: 160)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !780, file: !776, line: 219, baseType: !48, size: 16, offset: 176)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !780, file: !776, line: 220, baseType: !190, size: 32, offset: 192)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !780, file: !776, line: 222, baseType: !48, size: 16, offset: 224)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !780, file: !776, line: 225, baseType: !48, size: 16, offset: 240)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !780, file: !776, line: 228, baseType: !22, size: 32, offset: 256)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !780, file: !776, line: 229, baseType: !22, size: 32, offset: 288)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !780, file: !776, line: 233, baseType: !22, size: 32, offset: 320)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !780, file: !776, line: 236, baseType: !48, size: 16, offset: 352)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !780, file: !776, line: 236, baseType: !48, size: 16, offset: 368)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !780, file: !776, line: 241, baseType: !190, size: 32, offset: 384)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !780, file: !776, line: 244, baseType: !22, size: 32, offset: 416)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !780, file: !776, line: 244, baseType: !22, size: 32, offset: 448)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !780, file: !776, line: 245, baseType: !190, size: 32, offset: 480)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !780, file: !776, line: 248, baseType: !190, size: 32, offset: 512)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !780, file: !776, line: 250, baseType: !22, size: 32, offset: 544)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !775, file: !776, line: 342, baseType: !807, size: 448, offset: 576)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !776, line: 79, baseType: !808)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !776, line: 61, size: 448, elements: !809)
!809 = !{!810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !808, file: !776, line: 62, baseType: !56, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !808, file: !776, line: 64, baseType: !48, size: 16, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !808, file: !776, line: 65, baseType: !48, size: 16, offset: 80)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !808, file: !776, line: 67, baseType: !190, size: 32, offset: 96)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !808, file: !776, line: 68, baseType: !190, size: 32, offset: 128)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !808, file: !776, line: 69, baseType: !190, size: 32, offset: 160)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !808, file: !776, line: 70, baseType: !48, size: 16, offset: 192)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !808, file: !776, line: 71, baseType: !48, size: 16, offset: 208)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !808, file: !776, line: 72, baseType: !504, size: 64, offset: 224)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !808, file: !776, line: 75, baseType: !190, size: 32, offset: 288)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !808, file: !776, line: 75, baseType: !190, size: 32, offset: 320)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !808, file: !776, line: 75, baseType: !190, size: 32, offset: 352)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !808, file: !776, line: 78, baseType: !190, size: 32, offset: 384)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !808, file: !776, line: 78, baseType: !190, size: 32, offset: 416)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !775, file: !776, line: 343, baseType: !58, size: 128, offset: 1024)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !775, file: !776, line: 344, baseType: !58, size: 128, offset: 1152)
