; ModuleID = 'blender/source/blender/editors/animation/anim_ipo_utils.c'
source_filename = "blender/source/blender/editors/animation/anim_ipo_utils.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.FileData = type opaque
%struct.PackedFile = type opaque
%struct.IDProperty = type { %struct.IDProperty*, %struct.IDProperty*, i8, i8, i16, [64 x i8], i32, %struct.IDPropertyData, i32, i32 }
%struct.IDPropertyData = type { i8*, %struct.ListBase, i32, i32 }
%struct.ListBase = type { i8*, i8* }
%struct.FCurve = type { %struct.FCurve*, %struct.FCurve*, %struct.bActionGroup*, %struct.ChannelDriver*, %struct.ListBase, %struct.BezTriple*, %struct.FPoint*, i32, float, i16, i16, i32, i8*, i32, [3 x float], float, float }
%struct.bActionGroup = type { %struct.bActionGroup*, %struct.bActionGroup*, %struct.ListBase, i32, i32, [64 x i8], %struct.ThemeWireColor }
%struct.ThemeWireColor = type { [4 x i8], [4 x i8], [4 x i8], i16, i16 }
%struct.ChannelDriver = type { %struct.ListBase, [256 x i8], i8*, float, float, i32, i32 }
%struct.BezTriple = type { [3 x [3 x float]], float, float, float, i8, i8, i8, i8, i8, i8, i8, i8, float, float, float, [4 x i8] }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !17, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/editors/animation/anim_ipo_utils.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eFCurve_Flags", file: !4, line: 467, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "blender/source/blender/makesdna/DNA_anim_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16}
!7 = !DIEnumerator(name: "FCURVE_VISIBLE", value: 1, isUnsigned: true)
!8 = !DIEnumerator(name: "FCURVE_SELECTED", value: 2, isUnsigned: true)
!9 = !DIEnumerator(name: "FCURVE_ACTIVE", value: 4, isUnsigned: true)
!10 = !DIEnumerator(name: "FCURVE_PROTECTED", value: 8, isUnsigned: true)
!11 = !DIEnumerator(name: "FCURVE_MUTED", value: 16, isUnsigned: true)
!12 = !DIEnumerator(name: "FCURVE_AUTO_HANDLES", value: 32, isUnsigned: true)
!13 = !DIEnumerator(name: "FCURVE_DISABLED", value: 1024, isUnsigned: true)
!14 = !DIEnumerator(name: "FCURVE_INT_VALUES", value: 2048, isUnsigned: true)
!15 = !DIEnumerator(name: "FCURVE_DISCRETE_VALUES", value: 4096, isUnsigned: true)
!16 = !DIEnumerator(name: "FCURVE_TAGGED", value: 32768, isUnsigned: true)
!17 = !{!18, !19}
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!19 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!20 = !{i32 7, !"Dwarf Version", i32 4}
!21 = !{i32 2, !"Debug Info Version", i32 3}
!22 = !{i32 1, !"wchar_size", i32 4}
!23 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!24 = distinct !DISubprogram(name: "getname_anim_fcurve", scope: !1, file: !1, line: 59, type: !25, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !195)
!25 = !DISubroutineType(types: !26)
!26 = !{!27, !28, !30, !98}
!27 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !32, line: 130, baseType: !33)
!32 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !32, line: 117, size: 960, elements: !34)
!34 = !{!35, !36, !37, !39, !57, !61, !63, !64, !65, !66}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !33, file: !32, line: 118, baseType: !18, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !33, file: !32, line: 118, baseType: !18, size: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !33, file: !32, line: 119, baseType: !38, size: 64, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !33, file: !32, line: 120, baseType: !40, size: 64, offset: 192)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !32, line: 136, size: 17600, elements: !42)
!42 = !{!43, !44, !45, !48, !52, !53, !54}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !41, file: !32, line: 137, baseType: !31, size: 960)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !41, file: !32, line: 138, baseType: !30, size: 64, offset: 960)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !41, file: !32, line: 139, baseType: !46, size: 64, offset: 1024)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !32, line: 43, flags: DIFlagFwdDecl)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !41, file: !32, line: 140, baseType: !49, size: 8192, offset: 1088)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 8192, elements: !50)
!50 = !{!51}
!51 = !DISubrange(count: 1024)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !41, file: !32, line: 141, baseType: !49, size: 8192, offset: 9280)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !41, file: !32, line: 148, baseType: !40, size: 64, offset: 17472)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !41, file: !32, line: 150, baseType: !55, size: 64, offset: 17536)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !32, line: 45, flags: DIFlagFwdDecl)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !33, file: !32, line: 121, baseType: !58, size: 528, offset: 256)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 528, elements: !59)
!59 = !{!60}
!60 = !DISubrange(count: 66)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !33, file: !32, line: 126, baseType: !62, size: 16, offset: 784)
!62 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !33, file: !32, line: 127, baseType: !27, size: 32, offset: 800)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !33, file: !32, line: 128, baseType: !27, size: 32, offset: 832)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !33, file: !32, line: 128, baseType: !27, size: 32, offset: 864)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !33, file: !32, line: 129, baseType: !67, size: 64, offset: 896)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !32, line: 75, baseType: !69)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !32, line: 62, size: 1024, elements: !70)
!70 = !{!71, !73, !74, !75, !76, !77, !81, !82, !96, !97}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !69, file: !32, line: 63, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !69, file: !32, line: 63, baseType: !72, size: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !69, file: !32, line: 64, baseType: !29, size: 8, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !69, file: !32, line: 64, baseType: !29, size: 8, offset: 136)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !69, file: !32, line: 65, baseType: !62, size: 16, offset: 144)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !69, file: !32, line: 66, baseType: !78, size: 512, offset: 160)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 512, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !69, file: !32, line: 67, baseType: !27, size: 32, offset: 672)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !69, file: !32, line: 69, baseType: !83, size: 256, offset: 704)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !32, line: 60, baseType: !84)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !32, line: 48, size: 256, elements: !85)
!85 = !{!86, !87, !94, !95}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !84, file: !32, line: 49, baseType: !18, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !84, file: !32, line: 58, baseType: !88, size: 128, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !89, line: 71, baseType: !90)
!89 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !89, line: 69, size: 128, elements: !91)
!91 = !{!92, !93}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !90, file: !89, line: 70, baseType: !18, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !90, file: !89, line: 70, baseType: !18, size: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !84, file: !32, line: 59, baseType: !27, size: 32, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !84, file: !32, line: 59, baseType: !27, size: 32, offset: 224)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !69, file: !32, line: 70, baseType: !27, size: 32, offset: 960)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !69, file: !32, line: 74, baseType: !27, size: 32, offset: 992)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "FCurve", file: !4, line: 463, baseType: !100)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FCurve", file: !4, line: 433, size: 896, elements: !101)
!101 = !{!102, !104, !105, !131, !146, !147, !172, !183, !184, !185, !186, !187, !188, !189, !190, !193, !194}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !100, file: !4, line: 434, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !100, file: !4, line: 434, baseType: !103, size: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "grp", scope: !100, file: !4, line: 437, baseType: !106, size: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "bActionGroup", file: !108, line: 450, baseType: !109)
!108 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bActionGroup", file: !108, line: 440, size: 960, elements: !110)
!110 = !{!111, !113, !114, !115, !116, !117, !118}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !109, file: !108, line: 441, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !109, file: !108, line: 441, baseType: !112, size: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !109, file: !108, line: 443, baseType: !88, size: 128, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !109, file: !108, line: 445, baseType: !27, size: 32, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "customCol", scope: !109, file: !108, line: 446, baseType: !27, size: 32, offset: 288)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !109, file: !108, line: 447, baseType: !78, size: 512, offset: 320)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !109, file: !108, line: 449, baseType: !119, size: 128, offset: 832)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThemeWireColor", file: !120, line: 347, baseType: !121)
!120 = !DIFile(filename: "blender/source/blender/makesdna/DNA_userdef_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ThemeWireColor", file: !120, line: 340, size: 128, elements: !122)
!122 = !{!123, !127, !128, !129, !130}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "solid", scope: !121, file: !120, line: 341, baseType: !124, size: 32)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 32, elements: !125)
!125 = !{!126}
!126 = !DISubrange(count: 4)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "select", scope: !121, file: !120, line: 342, baseType: !124, size: 32, offset: 32)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !121, file: !120, line: 343, baseType: !124, size: 32, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !121, file: !120, line: 345, baseType: !62, size: 16, offset: 96)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !121, file: !120, line: 346, baseType: !62, size: 16, offset: 112)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "driver", scope: !100, file: !4, line: 440, baseType: !132, size: 64, offset: 192)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelDriver", file: !4, line: 386, baseType: !134)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ChannelDriver", file: !4, line: 371, size: 2368, elements: !135)
!135 = !{!136, !137, !141, !142, !143, !144, !145}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "variables", scope: !134, file: !4, line: 372, baseType: !88, size: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "expression", scope: !134, file: !4, line: 377, baseType: !138, size: 2048, offset: 128)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 2048, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 256)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "expr_comp", scope: !134, file: !4, line: 378, baseType: !18, size: 64, offset: 2176)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "curval", scope: !134, file: !4, line: 380, baseType: !19, size: 32, offset: 2240)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !134, file: !4, line: 381, baseType: !19, size: 32, offset: 2272)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !134, file: !4, line: 384, baseType: !27, size: 32, offset: 2304)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !134, file: !4, line: 385, baseType: !27, size: 32, offset: 2336)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !100, file: !4, line: 442, baseType: !88, size: 128, offset: 256)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "bezt", scope: !100, file: !4, line: 445, baseType: !148, size: 64, offset: 384)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "BezTriple", file: !150, line: 133, baseType: !151)
!150 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BezTriple", file: !150, line: 117, size: 576, elements: !152)
!152 = !{!153, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !151, file: !150, line: 118, baseType: !154, size: 288)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 288, elements: !155)
!155 = !{!156, !156}
!156 = !DISubrange(count: 3)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "alfa", scope: !151, file: !150, line: 119, baseType: !19, size: 32, offset: 288)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !151, file: !150, line: 119, baseType: !19, size: 32, offset: 320)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !151, file: !150, line: 119, baseType: !19, size: 32, offset: 352)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !151, file: !150, line: 121, baseType: !29, size: 8, offset: 384)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "h1", scope: !151, file: !150, line: 123, baseType: !29, size: 8, offset: 392)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "h2", scope: !151, file: !150, line: 123, baseType: !29, size: 8, offset: 400)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "f1", scope: !151, file: !150, line: 124, baseType: !29, size: 8, offset: 408)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "f2", scope: !151, file: !150, line: 124, baseType: !29, size: 8, offset: 416)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "f3", scope: !151, file: !150, line: 124, baseType: !29, size: 8, offset: 424)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "hide", scope: !151, file: !150, line: 126, baseType: !29, size: 8, offset: 432)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "easing", scope: !151, file: !150, line: 128, baseType: !29, size: 8, offset: 440)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !151, file: !150, line: 129, baseType: !19, size: 32, offset: 448)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "amplitude", scope: !151, file: !150, line: 130, baseType: !19, size: 32, offset: 480)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !151, file: !150, line: 130, baseType: !19, size: 32, offset: 512)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !151, file: !150, line: 132, baseType: !124, size: 32, offset: 544)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "fpt", scope: !100, file: !4, line: 446, baseType: !173, size: 64, offset: 448)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "FPoint", file: !4, line: 430, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FPoint", file: !4, line: 426, size: 128, elements: !176)
!176 = !{!177, !181, !182}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !175, file: !4, line: 427, baseType: !178, size: 64)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 64, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 2)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !175, file: !4, line: 428, baseType: !27, size: 32, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !175, file: !4, line: 429, baseType: !27, size: 32, offset: 96)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !100, file: !4, line: 447, baseType: !5, size: 32, offset: 512)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "curval", scope: !100, file: !4, line: 450, baseType: !19, size: 32, offset: 544)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !100, file: !4, line: 451, baseType: !62, size: 16, offset: 576)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !100, file: !4, line: 452, baseType: !62, size: 16, offset: 592)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "array_index", scope: !100, file: !4, line: 455, baseType: !27, size: 32, offset: 608)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "rna_path", scope: !100, file: !4, line: 456, baseType: !28, size: 64, offset: 640)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !100, file: !4, line: 459, baseType: !27, size: 32, offset: 704)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !100, file: !4, line: 460, baseType: !191, size: 96, offset: 736)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 96, elements: !192)
!192 = !{!156}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "prev_norm_factor", scope: !100, file: !4, line: 462, baseType: !19, size: 32, offset: 832)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !100, file: !4, line: 462, baseType: !19, size: 32, offset: 864)
!195 = !{}
!196 = !DILocalVariable(name: "name", arg: 1, scope: !24, file: !1, line: 59, type: !28)
!197 = !DILocation(line: 59, column: 31, scope: !24)
!198 = !DILocalVariable(name: "id", arg: 2, scope: !24, file: !1, line: 59, type: !30)
!199 = !DILocation(line: 59, column: 41, scope: !24)
!200 = !DILocalVariable(name: "fcu", arg: 3, scope: !24, file: !1, line: 59, type: !98)
!201 = !DILocation(line: 59, column: 53, scope: !24)
!202 = !DILocalVariable(name: "icon", scope: !24, file: !1, line: 61, type: !27)
!203 = !DILocation(line: 61, column: 6, scope: !24)
!204 = !DILocation(line: 64, column: 6, scope: !205)
!205 = distinct !DILexicalBlock(scope: !24, file: !1, line: 64, column: 6)
!206 = !DILocation(line: 64, column: 11, scope: !205)
!207 = !DILocation(line: 64, column: 6, scope: !24)
!208 = !DILocation(line: 65, column: 10, scope: !205)
!209 = !DILocation(line: 65, column: 3, scope: !205)
!210 = !DILocation(line: 66, column: 11, scope: !211)
!211 = distinct !DILexicalBlock(scope: !205, file: !1, line: 66, column: 11)
!212 = !DILocation(line: 66, column: 11, scope: !205)
!213 = !DILocation(line: 67, column: 7, scope: !214)
!214 = distinct !DILexicalBlock(scope: !215, file: !1, line: 67, column: 7)
!215 = distinct !DILexicalBlock(scope: !211, file: !1, line: 66, column: 47)
!216 = !DILocation(line: 67, column: 11, scope: !214)
!217 = !DILocation(line: 67, column: 7, scope: !215)
!218 = !DILocation(line: 68, column: 11, scope: !214)
!219 = !DILocation(line: 68, column: 4, scope: !214)
!220 = !DILocation(line: 69, column: 12, scope: !221)
!221 = distinct !DILexicalBlock(scope: !214, file: !1, line: 69, column: 12)
!222 = !DILocation(line: 69, column: 17, scope: !221)
!223 = !DILocation(line: 69, column: 26, scope: !221)
!224 = !DILocation(line: 69, column: 12, scope: !214)
!225 = !DILocation(line: 70, column: 11, scope: !221)
!226 = !DILocation(line: 70, column: 4, scope: !221)
!227 = !DILocation(line: 72, column: 17, scope: !221)
!228 = !DILocation(line: 72, column: 38, scope: !221)
!229 = !DILocation(line: 72, column: 43, scope: !221)
!230 = !DILocation(line: 72, column: 53, scope: !221)
!231 = !DILocation(line: 72, column: 58, scope: !221)
!232 = !DILocation(line: 72, column: 4, scope: !221)
!233 = !DILocation(line: 73, column: 2, scope: !215)
!234 = !DILocalVariable(name: "id_ptr", scope: !235, file: !1, line: 75, type: !236)
!235 = distinct !DILexicalBlock(scope: !211, file: !1, line: 74, column: 7)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "PointerRNA", file: !237, line: 62, baseType: !238)
!237 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !237, line: 55, size: 192, elements: !239)
!239 = !{!240, !244, !247}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !238, file: !237, line: 58, baseType: !241, size: 64)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !238, file: !237, line: 56, size: 64, elements: !242)
!242 = !{!243}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !241, file: !237, line: 57, baseType: !18, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !238, file: !237, line: 60, baseType: !245, size: 64, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !237, line: 41, flags: DIFlagFwdDecl)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !238, file: !237, line: 61, baseType: !18, size: 64, offset: 128)
!248 = !DILocation(line: 75, column: 14, scope: !235)
!249 = !DILocalVariable(name: "ptr", scope: !235, file: !1, line: 75, type: !236)
!250 = !DILocation(line: 75, column: 22, scope: !235)
!251 = !DILocalVariable(name: "prop", scope: !235, file: !1, line: 76, type: !252)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyRNA", file: !237, line: 333, baseType: !254)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "PropertyRNA", file: !237, line: 39, flags: DIFlagFwdDecl)
!255 = !DILocation(line: 76, column: 16, scope: !235)
!256 = !DILocation(line: 79, column: 25, scope: !235)
!257 = !DILocation(line: 79, column: 3, scope: !235)
!258 = !DILocation(line: 82, column: 42, scope: !259)
!259 = distinct !DILexicalBlock(scope: !235, file: !1, line: 82, column: 7)
!260 = !DILocation(line: 82, column: 47, scope: !259)
!261 = !DILocation(line: 82, column: 7, scope: !259)
!262 = !DILocation(line: 82, column: 7, scope: !235)
!263 = !DILocalVariable(name: "structname", scope: !264, file: !1, line: 83, type: !265)
!264 = distinct !DILexicalBlock(scope: !259, file: !1, line: 82, column: 71)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!267 = !DILocation(line: 83, column: 16, scope: !264)
!268 = !DILocalVariable(name: "propname", scope: !264, file: !1, line: 83, type: !265)
!269 = !DILocation(line: 83, column: 36, scope: !264)
!270 = !DILocalVariable(name: "arrayindbuf", scope: !264, file: !1, line: 84, type: !271)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 128, elements: !272)
!272 = !{!273}
!273 = !DISubrange(count: 16)
!274 = !DILocation(line: 84, column: 9, scope: !264)
!275 = !DILocalVariable(name: "arrayname", scope: !264, file: !1, line: 85, type: !265)
!276 = !DILocation(line: 85, column: 16, scope: !264)
!277 = !DILocalVariable(name: "free_structname", scope: !264, file: !1, line: 86, type: !62)
!278 = !DILocation(line: 86, column: 10, scope: !264)
!279 = !DILocation(line: 107, column: 15, scope: !280)
!280 = distinct !DILexicalBlock(scope: !264, file: !1, line: 107, column: 8)
!281 = !DILocation(line: 107, column: 20, scope: !280)
!282 = !DILocation(line: 107, column: 8, scope: !280)
!283 = !DILocation(line: 107, column: 39, scope: !280)
!284 = !DILocation(line: 107, column: 49, scope: !280)
!285 = !DILocation(line: 107, column: 54, scope: !280)
!286 = !DILocation(line: 107, column: 42, scope: !280)
!287 = !DILocation(line: 107, column: 8, scope: !264)
!288 = !DILocalVariable(name: "pchanName", scope: !289, file: !1, line: 109, type: !28)
!289 = distinct !DILexicalBlock(scope: !280, file: !1, line: 107, column: 80)
!290 = !DILocation(line: 109, column: 11, scope: !289)
!291 = !DILocation(line: 109, column: 46, scope: !289)
!292 = !DILocation(line: 109, column: 51, scope: !289)
!293 = !DILocation(line: 109, column: 23, scope: !289)
!294 = !DILocalVariable(name: "constName", scope: !289, file: !1, line: 110, type: !28)
!295 = !DILocation(line: 110, column: 11, scope: !289)
!296 = !DILocation(line: 110, column: 46, scope: !289)
!297 = !DILocation(line: 110, column: 51, scope: !289)
!298 = !DILocation(line: 110, column: 23, scope: !289)
!299 = !DILocation(line: 113, column: 42, scope: !289)
!300 = !DILocation(line: 113, column: 53, scope: !289)
!301 = !DILocation(line: 113, column: 18, scope: !289)
!302 = !DILocation(line: 113, column: 16, scope: !289)
!303 = !DILocation(line: 114, column: 21, scope: !289)
!304 = !DILocation(line: 117, column: 9, scope: !305)
!305 = distinct !DILexicalBlock(scope: !289, file: !1, line: 117, column: 9)
!306 = !DILocation(line: 117, column: 9, scope: !289)
!307 = !DILocation(line: 117, column: 20, scope: !305)
!308 = !DILocation(line: 117, column: 30, scope: !305)
