; ModuleID = 'blender/source/blender/bmesh/operators/bmo_fill_attribute.c'
source_filename = "blender/source/blender/bmesh/operators/bmo_fill_attribute.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BMesh = type { i32, i32, i32, i32, i32, i32, i32, i8, i8, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BMVert**, %struct.BMEdge**, %struct.BMFace**, i32, i32, i32, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, i32, %struct.BMOperator*, %struct.CustomData, %struct.CustomData, %struct.CustomData, %struct.CustomData, i16, i32, i32, i32, %struct.ListBase, %struct.BMFace*, %struct.ListBase, i8* }
%struct.BMVert = type { %struct.BMHeader, %struct.BMFlagLayer*, [3 x float], [3 x float], %struct.BMEdge* }
%struct.BMHeader = type { i8*, i32, i8, i8, i8 }
%struct.BMFlagLayer = type { i16 }
%struct.BMEdge = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMVert*, %struct.BMVert*, %struct.BMLoop*, %struct.BMDiskLink, %struct.BMDiskLink }
%struct.BMLoop = type { %struct.BMHeader, %struct.BMVert*, %struct.BMEdge*, %struct.BMFace*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop* }
%struct.BMDiskLink = type { %struct.BMEdge*, %struct.BMEdge* }
%struct.BLI_mempool = type opaque

!27 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Map", file: !4, line: 123, baseType: !5, size: 32, elements: !28)
!28 = !{!29, !30, !31, !32, !33, !34}
!29 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_EMPTY", value: 64, isUnsigned: true)
!30 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_ELEM", value: 65, isUnsigned: true)
!31 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_FLT", value: 66, isUnsigned: true)
!32 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INT", value: 67, isUnsigned: true)
!33 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_BOOL", value: 68, isUnsigned: true)
!34 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INTERNAL", value: 69, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 182, baseType: !5, size: 32, elements: !36)
!36 = !{!37, !38, !39, !40, !41}
!37 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NOP", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_UNTAN_MULTIRES", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NORMALS_CALC", value: 2, isUnsigned: true)
!40 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_FLUSH", value: 4, isUnsigned: true)
!41 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 249, baseType: !5, size: 32, elements: !44)
!43 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!44 = !{!45, !46, !47, !48}
!45 = !DIEnumerator(name: "BM_VERT", value: 1, isUnsigned: true)
!46 = !DIEnumerator(name: "BM_EDGE", value: 2, isUnsigned: true)
!47 = !DIEnumerator(name: "BM_LOOP", value: 4, isUnsigned: true)
!48 = !DIEnumerator(name: "BM_FACE", value: 8, isUnsigned: true)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 260, baseType: !5, size: 32, elements: !50)
!50 = !{!51, !52, !53, !54, !55, !56, !57}
!51 = !DIEnumerator(name: "BM_ELEM_SELECT", value: 1, isUnsigned: true)
!52 = !DIEnumerator(name: "BM_ELEM_HIDDEN", value: 2, isUnsigned: true)
!53 = !DIEnumerator(name: "BM_ELEM_SEAM", value: 4, isUnsigned: true)
!54 = !DIEnumerator(name: "BM_ELEM_SMOOTH", value: 8, isUnsigned: true)
!55 = !DIEnumerator(name: "BM_ELEM_TAG", value: 16, isUnsigned: true)
!56 = !DIEnumerator(name: "BM_ELEM_DRAW", value: 32, isUnsigned: true)
!57 = !DIEnumerator(name: "BM_ELEM_INTERNAL_TAG", value: 128, isUnsigned: true)
!58 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !59, line: 83, baseType: !5, size: 32, elements: !60)
!59 = !DIFile(filename: "blender/source/blender/blenlib/BLI_mempool.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!60 = !{!61, !62}
!61 = !DIEnumerator(name: "BLI_MEMPOOL_NOP", value: 0, isUnsigned: true)
!62 = !DIEnumerator(name: "BLI_MEMPOOL_ALLOW_ITER", value: 1, isUnsigned: true)
!63 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BMIterType", file: !64, line: 57, baseType: !5, size: 32, elements: !65)
!64 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!65 = !{!66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79}
!66 = !DIEnumerator(name: "BM_VERTS_OF_MESH", value: 1, isUnsigned: true)
!67 = !DIEnumerator(name: "BM_EDGES_OF_MESH", value: 2, isUnsigned: true)
!68 = !DIEnumerator(name: "BM_FACES_OF_MESH", value: 3, isUnsigned: true)
!69 = !DIEnumerator(name: "BM_EDGES_OF_VERT", value: 4, isUnsigned: true)
!70 = !DIEnumerator(name: "BM_FACES_OF_VERT", value: 5, isUnsigned: true)
!71 = !DIEnumerator(name: "BM_LOOPS_OF_VERT", value: 6, isUnsigned: true)
!72 = !DIEnumerator(name: "BM_VERTS_OF_EDGE", value: 7, isUnsigned: true)
!73 = !DIEnumerator(name: "BM_FACES_OF_EDGE", value: 8, isUnsigned: true)
!74 = !DIEnumerator(name: "BM_VERTS_OF_FACE", value: 9, isUnsigned: true)
!75 = !DIEnumerator(name: "BM_EDGES_OF_FACE", value: 10, isUnsigned: true)
!76 = !DIEnumerator(name: "BM_LOOPS_OF_FACE", value: 11, isUnsigned: true)
!77 = !DIEnumerator(name: "BM_ALL_LOOPS_OF_FACE", value: 12, isUnsigned: true)
!78 = !DIEnumerator(name: "BM_LOOPS_OF_LOOP", value: 13, isUnsigned: true)
!79 = !DIEnumerator(name: "BM_LOOPS_OF_EDGE", value: 14, isUnsigned: true)
!80 = !{!81, !82, !83, !87, !91, !157, !159, !141, !103}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !64, line: 79, baseType: !63)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !64, line: 158, baseType: !84)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DISubroutineType(types: !86)
!86 = !{null, !81}
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !64, line: 159, baseType: !88)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{!81, !81}
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !43, line: 103, baseType: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !43, line: 90, size: 448, elements: !94)
!94 = !{!95, !106, !112, !117, !118}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !93, file: !43, line: 91, baseType: !96, size: 128)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !43, line: 82, baseType: !97)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !43, line: 64, size: 128, elements: !98)
!98 = !{!99, !100, !102, !104, !105}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !97, file: !43, line: 65, baseType: !81, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !97, file: !43, line: 66, baseType: !101, size: 32, offset: 64)
!101 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !97, file: !43, line: 73, baseType: !103, size: 8, offset: 96)
!103 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !97, file: !43, line: 74, baseType: !103, size: 8, offset: 104)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !97, file: !43, line: 80, baseType: !103, size: 8, offset: 112)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !93, file: !43, line: 92, baseType: !107, size: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !43, line: 180, size: 16, elements: !109)
!109 = !{!110}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !108, file: !43, line: 181, baseType: !111, size: 16)
!111 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !93, file: !43, line: 94, baseType: !113, size: 96, offset: 192)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 96, elements: !115)
!114 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!115 = !{!116}
!116 = !DISubrange(count: 3)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !93, file: !43, line: 95, baseType: !113, size: 96, offset: 288)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !93, file: !43, line: 102, baseType: !119, size: 64, offset: 384)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !43, line: 110, size: 640, elements: !121)
!121 = !{!122, !123, !124, !126, !127, !150, !156}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !120, file: !43, line: 111, baseType: !96, size: 128)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !120, file: !43, line: 112, baseType: !107, size: 64, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !120, file: !43, line: 114, baseType: !125, size: 64, offset: 192)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !120, file: !43, line: 114, baseType: !125, size: 64, offset: 256)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !120, file: !43, line: 118, baseType: !128, size: 64, offset: 320)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !43, line: 125, size: 576, elements: !130)
!130 = !{!131, !132, !133, !134, !146, !147, !148, !149}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !129, file: !43, line: 126, baseType: !96, size: 128)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !129, file: !43, line: 129, baseType: !125, size: 64, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !129, file: !43, line: 130, baseType: !119, size: 64, offset: 192)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !129, file: !43, line: 131, baseType: !135, size: 64, offset: 256)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !43, line: 164, size: 448, elements: !137)
!137 = !{!138, !139, !140, !143, !144, !145}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !136, file: !43, line: 165, baseType: !96, size: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !136, file: !43, line: 166, baseType: !107, size: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !136, file: !43, line: 172, baseType: !141, size: 64, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !43, line: 140, baseType: !129)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !136, file: !43, line: 174, baseType: !101, size: 32, offset: 256)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !136, file: !43, line: 175, baseType: !113, size: 96, offset: 288)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !136, file: !43, line: 176, baseType: !111, size: 16, offset: 384)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !129, file: !43, line: 135, baseType: !128, size: 64, offset: 320)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !129, file: !43, line: 135, baseType: !128, size: 64, offset: 384)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !129, file: !43, line: 139, baseType: !128, size: 64, offset: 448)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !129, file: !43, line: 139, baseType: !128, size: 64, offset: 512)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !120, file: !43, line: 122, baseType: !151, size: 128, offset: 384)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !43, line: 108, baseType: !152)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !43, line: 106, size: 128, elements: !153)
!153 = !{!154, !155}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !152, file: !43, line: 107, baseType: !119, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !152, file: !43, line: 107, baseType: !119, size: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !120, file: !43, line: 122, baseType: !151, size: 128, offset: 512)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !43, line: 123, baseType: !120)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !43, line: 178, baseType: !136)
!161 = !{i32 7, !"Dwarf Version", i32 4}
!162 = !{i32 2, !"Debug Info Version", i32 3}
!163 = !{i32 1, !"wchar_size", i32 4}
!164 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!165 = distinct !DISubprogram(name: "bmo_face_attribute_fill_exec", scope: !1, file: !1, line: 157, type: !166, scopeLine: 158, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !312)
!166 = !DISubroutineType(types: !167)
!167 = !{null, !168, !310}
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !43, line: 246, baseType: !170)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !43, line: 186, size: 8064, elements: !171)
!171 = !{!172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !185, !186, !187, !188, !190, !192, !194, !195, !196, !197, !198, !199, !200, !201, !253, !293, !294, !295, !296, !297, !298, !299, !300, !307, !308, !309}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !170, file: !43, line: 187, baseType: !101, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !170, file: !43, line: 187, baseType: !101, size: 32, offset: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !170, file: !43, line: 187, baseType: !101, size: 32, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !170, file: !43, line: 187, baseType: !101, size: 32, offset: 96)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !170, file: !43, line: 188, baseType: !101, size: 32, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !170, file: !43, line: 188, baseType: !101, size: 32, offset: 160)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !170, file: !43, line: 188, baseType: !101, size: 32, offset: 192)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !170, file: !43, line: 193, baseType: !103, size: 8, offset: 224)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !170, file: !43, line: 197, baseType: !103, size: 8, offset: 232)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !170, file: !43, line: 201, baseType: !182, size: 64, offset: 256)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !184, line: 39, flags: DIFlagFwdDecl)
!184 = !DIFile(filename: "blender/source/blender/blenlib/BLI_linklist.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!185 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !170, file: !43, line: 201, baseType: !182, size: 64, offset: 320)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !170, file: !43, line: 201, baseType: !182, size: 64, offset: 384)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !170, file: !43, line: 201, baseType: !182, size: 64, offset: 448)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !170, file: !43, line: 208, baseType: !189, size: 64, offset: 512)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !170, file: !43, line: 209, baseType: !191, size: 64, offset: 576)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !170, file: !43, line: 210, baseType: !193, size: 64, offset: 640)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !170, file: !43, line: 213, baseType: !101, size: 32, offset: 704)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !170, file: !43, line: 214, baseType: !101, size: 32, offset: 736)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !170, file: !43, line: 215, baseType: !101, size: 32, offset: 768)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !170, file: !43, line: 218, baseType: !182, size: 64, offset: 832)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !170, file: !43, line: 218, baseType: !182, size: 64, offset: 896)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !170, file: !43, line: 218, baseType: !182, size: 64, offset: 960)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !170, file: !43, line: 220, baseType: !101, size: 32, offset: 1024)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !170, file: !43, line: 221, baseType: !202, size: 64, offset: 1088)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !4, line: 190, size: 10496, elements: !204)
!204 = !{!205, !241, !242, !246, !249, !250, !252}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !203, file: !4, line: 191, baseType: !206, size: 5120)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 5120, elements: !239)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !4, line: 147, size: 320, elements: !208)
!208 = !{!209, !212, !214, !224, !225}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !207, file: !4, line: 148, baseType: !210, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !207, file: !4, line: 149, baseType: !213, size: 32, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !4, line: 112, baseType: !3)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !207, file: !4, line: 150, baseType: !215, size: 32, offset: 96)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !4, line: 142, baseType: !216)
!216 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !4, line: 138, size: 32, elements: !217)
!217 = !{!218, !220, !222}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !216, file: !4, line: 139, baseType: !219, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !4, line: 122, baseType: !15)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !216, file: !4, line: 140, baseType: !221, size: 32)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !4, line: 136, baseType: !21)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !216, file: !4, line: 141, baseType: !223, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !4, line: 130, baseType: !27)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !207, file: !4, line: 152, baseType: !101, size: 32, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !207, file: !4, line: 162, baseType: !226, size: 128, offset: 192)
!226 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !207, file: !4, line: 155, size: 128, elements: !227)
!227 = !{!228, !229, !230, !231, !232, !234}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !226, file: !4, line: 156, baseType: !101, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !226, file: !4, line: 157, baseType: !114, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !226, file: !4, line: 158, baseType: !81, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !226, file: !4, line: 159, baseType: !113, size: 96)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !226, file: !4, line: 160, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !226, file: !4, line: 161, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !237, line: 48, baseType: !238)
!237 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !237, line: 48, flags: DIFlagFwdDecl)
!239 = !{!240}
!240 = !DISubrange(count: 16)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !203, file: !4, line: 192, baseType: !206, size: 5120, offset: 5120)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !203, file: !4, line: 193, baseType: !243, size: 64, offset: 10240)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{null, !168, !202}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !203, file: !4, line: 194, baseType: !247, size: 64, offset: 10304)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !184, line: 38, flags: DIFlagFwdDecl)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !203, file: !4, line: 195, baseType: !101, size: 32, offset: 10368)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !203, file: !4, line: 196, baseType: !251, size: 32, offset: 10400)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !4, line: 188, baseType: !35)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !203, file: !4, line: 197, baseType: !101, size: 32, offset: 10432)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !170, file: !43, line: 223, baseType: !254, size: 1600, offset: 1152)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !255, line: 73, baseType: !256)
!255 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !255, line: 64, size: 1600, elements: !257)
!257 = !{!258, !276, !280, !281, !282, !283, !284}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !256, file: !255, line: 65, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !255, line: 53, baseType: !261)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !255, line: 42, size: 832, elements: !262)
!262 = !{!263, !264, !265, !266, !267, !268, !269, !270, !271, !275}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !261, file: !255, line: 43, baseType: !101, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !261, file: !255, line: 44, baseType: !101, size: 32, offset: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !261, file: !255, line: 45, baseType: !101, size: 32, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !261, file: !255, line: 46, baseType: !101, size: 32, offset: 96)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !261, file: !255, line: 47, baseType: !101, size: 32, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !261, file: !255, line: 48, baseType: !101, size: 32, offset: 160)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !261, file: !255, line: 49, baseType: !101, size: 32, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !261, file: !255, line: 50, baseType: !101, size: 32, offset: 224)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !261, file: !255, line: 51, baseType: !272, size: 512, offset: 256)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 512, elements: !273)
!273 = !{!274}
!274 = !DISubrange(count: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !261, file: !255, line: 52, baseType: !81, size: 64, offset: 768)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !256, file: !255, line: 66, baseType: !277, size: 1312, offset: 64)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 1312, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 41)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !256, file: !255, line: 69, baseType: !101, size: 32, offset: 1376)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !256, file: !255, line: 69, baseType: !101, size: 32, offset: 1408)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !256, file: !255, line: 70, baseType: !101, size: 32, offset: 1440)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !256, file: !255, line: 71, baseType: !182, size: 64, offset: 1472)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !256, file: !255, line: 72, baseType: !285, size: 64, offset: 1536)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !255, line: 59, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !255, line: 57, size: 8192, elements: !288)
!288 = !{!289}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !287, file: !255, line: 58, baseType: !290, size: 8192)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 8192, elements: !291)
!291 = !{!292}
!292 = !DISubrange(count: 1024)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !170, file: !43, line: 223, baseType: !254, size: 1600, offset: 2752)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !170, file: !43, line: 223, baseType: !254, size: 1600, offset: 4352)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !170, file: !43, line: 223, baseType: !254, size: 1600, offset: 5952)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !170, file: !43, line: 233, baseType: !111, size: 16, offset: 7552)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !170, file: !43, line: 236, baseType: !101, size: 32, offset: 7584)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !170, file: !43, line: 238, baseType: !101, size: 32, offset: 7616)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !170, file: !43, line: 238, baseType: !101, size: 32, offset: 7648)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !170, file: !43, line: 239, baseType: !301, size: 128, offset: 7680)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !302, line: 71, baseType: !303)
!302 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !302, line: 69, size: 128, elements: !304)
!304 = !{!305, !306}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !303, file: !302, line: 70, baseType: !81, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !303, file: !302, line: 70, baseType: !81, size: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !170, file: !43, line: 241, baseType: !159, size: 64, offset: 7808)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !170, file: !43, line: 243, baseType: !301, size: 128, offset: 7872)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !170, file: !43, line: 245, baseType: !81, size: 64, offset: 8000)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOperator", file: !4, line: 198, baseType: !203)
!312 = !{}
!313 = !DILocalVariable(name: "bm", arg: 1, scope: !165, file: !1, line: 157, type: !168)
!314 = !DILocation(line: 157, column: 43, scope: !165)
!315 = !DILocalVariable(name: "op", arg: 2, scope: !165, file: !1, line: 157, type: !310)
!316 = !DILocation(line: 157, column: 59, scope: !165)
!317 = !DILocalVariable(name: "use_normals", scope: !165, file: !1, line: 159, type: !318)
!318 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !319)
!319 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!320 = !DILocation(line: 159, column: 13, scope: !165)
!321 = !DILocation(line: 159, column: 45, scope: !165)
!322 = !DILocation(line: 159, column: 49, scope: !165)
!323 = !DILocation(line: 159, column: 27, scope: !165)
!324 = !DILocalVariable(name: "use_data", scope: !165, file: !1, line: 160, type: !318)
!325 = !DILocation(line: 160, column: 13, scope: !165)
!326 = !DILocation(line: 160, column: 42, scope: !165)
!327 = !DILocation(line: 160, column: 46, scope: !165)
!328 = !DILocation(line: 160, column: 24, scope: !165)
!329 = !DILocalVariable(name: "face_tot", scope: !165, file: !1, line: 162, type: !101)
!330 = !DILocation(line: 162, column: 6, scope: !165)
!331 = !DILocation(line: 164, column: 33, scope: !165)
!332 = !DILocation(line: 164, column: 2, scope: !165)
!333 = !DILocation(line: 165, column: 31, scope: !165)
!334 = !DILocation(line: 165, column: 35, scope: !165)
!335 = !DILocation(line: 165, column: 39, scope: !165)
!336 = !DILocation(line: 165, column: 2, scope: !165)
!337 = !DILocation(line: 168, column: 39, scope: !165)
!338 = !DILocation(line: 168, column: 43, scope: !165)
!339 = !DILocation(line: 168, column: 56, scope: !165)
!340 = !DILocation(line: 168, column: 13, scope: !165)
!341 = !DILocation(line: 168, column: 11, scope: !165)
!342 = !DILocation(line: 170, column: 6, scope: !343)
!343 = distinct !DILexicalBlock(scope: !165, file: !1, line: 170, column: 6)
!344 = !DILocation(line: 170, column: 40, scope: !343)
!345 = !DILocation(line: 170, column: 44, scope: !343)
!346 = !DILocation(line: 170, column: 18, scope: !343)
!347 = !DILocation(line: 170, column: 15, scope: !343)
!348 = !DILocation(line: 170, column: 6, scope: !165)
!349 = !DILocation(line: 172, column: 38, scope: !350)
!350 = distinct !DILexicalBlock(scope: !343, file: !1, line: 170, column: 64)
!351 = !DILocation(line: 172, column: 42, scope: !350)
!352 = !DILocation(line: 172, column: 46, scope: !350)
!353 = !DILocation(line: 172, column: 50, scope: !350)
!354 = !DILocation(line: 172, column: 3, scope: !350)
!355 = !DILocation(line: 173, column: 2, scope: !350)
!356 = !DILocation(line: 174, column: 1, scope: !165)
!357 = distinct !DISubprogram(name: "bmesh_face_attribute_fill", scope: !1, file: !1, line: 93, type: !358, scopeLine: 95, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !312)
!358 = !DISubroutineType(types: !359)
!359 = !{!5, !168, !318, !318}
!360 = !DILocalVariable(name: "bm", arg: 1, scope: !357, file: !1, line: 93, type: !168)
!361 = !DILocation(line: 93, column: 54, scope: !357)
!362 = !DILocalVariable(name: "use_normals", arg: 2, scope: !357, file: !1, line: 94, type: !318)
!363 = !DILocation(line: 94, column: 58, scope: !357)
!364 = !DILocalVariable(name: "use_data", arg: 3, scope: !357, file: !1, line: 94, type: !318)
!365 = !DILocation(line: 94, column: 82, scope: !357)
!366 = !DILocalVariable(name: "loop_queue_prev", scope: !357, file: !1, line: 96, type: !367)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "LinkNode", file: !184, line: 48, baseType: !369)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !184, line: 45, size: 128, elements: !370)
!370 = !{!371, !373}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !369, file: !184, line: 46, baseType: !372, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !369, file: !184, line: 47, baseType: !81, size: 64, offset: 64)
!374 = !DILocation(line: 96, column: 2, scope: !357)
!375 = !DILocalVariable(name: "_loop_queue_prev_pool", scope: !357, file: !1, line: 96, type: !376)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool", file: !59, line: 47, baseType: !183)
!378 = !DILocalVariable(name: "_loop_queue_prev_type", scope: !357, file: !1, line: 96, type: !141)
!379 = !DILocalVariable(name: "loop_queue_next", scope: !357, file: !1, line: 97, type: !367)
!380 = !DILocation(line: 97, column: 2, scope: !357)
!381 = !DILocalVariable(name: "_loop_queue_next_pool", scope: !357, file: !1, line: 97, type: !376)
!382 = !DILocalVariable(name: "_loop_queue_next_type", scope: !357, file: !1, line: 97, type: !141)
!383 = !DILocalVariable(name: "f", scope: !357, file: !1, line: 99, type: !159)
!384 = !DILocation(line: 99, column: 10, scope: !357)
!385 = !DILocalVariable(name: "iter", scope: !357, file: !1, line: 100, type: !386)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter", file: !64, line: 186, baseType: !387)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter", file: !64, line: 164, size: 512, elements: !388)
!388 = !{!389, !466, !467, !468, !469}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !387, file: !64, line: 179, baseType: !390, size: 320)
!390 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !387, file: !64, line: 166, size: 320, elements: !391)
!391 = !{!392, !404, !410, !418, !426, !432, !438, !444, !448, !454, !460}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "elem_of_mesh", scope: !390, file: !64, line: 167, baseType: !393, size: 192)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__elem_of_mesh", file: !64, line: 113, size: 192, elements: !394)
!394 = !{!395}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "pooliter", scope: !393, file: !64, line: 114, baseType: !396, size: 192)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool_iter", file: !59, line: 80, baseType: !397)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_iter", file: !59, line: 76, size: 192, elements: !398)
!398 = !{!399, !400, !403}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !397, file: !59, line: 77, baseType: !376, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "curchunk", scope: !397, file: !59, line: 78, baseType: !401, size: 64, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_chunk", file: !59, line: 45, flags: DIFlagFwdDecl)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "curindex", scope: !397, file: !59, line: 79, baseType: !5, size: 32, offset: 128)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_vert", scope: !390, file: !64, line: 169, baseType: !405, size: 192)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_vert", file: !64, line: 116, size: 192, elements: !406)
!406 = !{!407, !408, !409}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !405, file: !64, line: 117, baseType: !91, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !405, file: !64, line: 118, baseType: !157, size: 64, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !405, file: !64, line: 118, baseType: !157, size: 64, offset: 128)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_vert", scope: !390, file: !64, line: 170, baseType: !411, size: 320)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_vert", file: !64, line: 120, size: 320, elements: !412)
!412 = !{!413, !414, !415, !416, !417}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !411, file: !64, line: 121, baseType: !91, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !411, file: !64, line: 122, baseType: !141, size: 64, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !411, file: !64, line: 122, baseType: !141, size: 64, offset: 128)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !411, file: !64, line: 123, baseType: !157, size: 64, offset: 192)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !411, file: !64, line: 123, baseType: !157, size: 64, offset: 256)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_vert", scope: !390, file: !64, line: 171, baseType: !419, size: 320)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_vert", file: !64, line: 125, size: 320, elements: !420)
!420 = !{!421, !422, !423, !424, !425}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !419, file: !64, line: 126, baseType: !91, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !419, file: !64, line: 127, baseType: !141, size: 64, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !419, file: !64, line: 127, baseType: !141, size: 64, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !419, file: !64, line: 128, baseType: !157, size: 64, offset: 192)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !419, file: !64, line: 128, baseType: !157, size: 64, offset: 256)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_edge", scope: !390, file: !64, line: 172, baseType: !427, size: 192)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_edge", file: !64, line: 130, size: 192, elements: !428)
!428 = !{!429, !430, !431}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !427, file: !64, line: 131, baseType: !157, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !427, file: !64, line: 132, baseType: !141, size: 64, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !427, file: !64, line: 132, baseType: !141, size: 64, offset: 128)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_loop", scope: !390, file: !64, line: 173, baseType: !433, size: 192)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_loop", file: !64, line: 134, size: 192, elements: !434)
!434 = !{!435, !436, !437}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !433, file: !64, line: 135, baseType: !141, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !433, file: !64, line: 136, baseType: !141, size: 64, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !433, file: !64, line: 136, baseType: !141, size: 64, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_edge", scope: !390, file: !64, line: 174, baseType: !439, size: 192)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_edge", file: !64, line: 138, size: 192, elements: !440)
!440 = !{!441, !442, !443}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !439, file: !64, line: 139, baseType: !157, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !439, file: !64, line: 140, baseType: !141, size: 64, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !439, file: !64, line: 140, baseType: !141, size: 64, offset: 128)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_edge", scope: !390, file: !64, line: 175, baseType: !445, size: 64)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_edge", file: !64, line: 142, size: 64, elements: !446)
!446 = !{!447}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !445, file: !64, line: 143, baseType: !157, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_face", scope: !390, file: !64, line: 176, baseType: !449, size: 192)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_face", file: !64, line: 145, size: 192, elements: !450)
!450 = !{!451, !452, !453}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !449, file: !64, line: 146, baseType: !159, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !449, file: !64, line: 147, baseType: !141, size: 64, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !449, file: !64, line: 147, baseType: !141, size: 64, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_face", scope: !390, file: !64, line: 177, baseType: !455, size: 192)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_face", file: !64, line: 149, size: 192, elements: !456)
!456 = !{!457, !458, !459}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !455, file: !64, line: 150, baseType: !159, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !455, file: !64, line: 151, baseType: !141, size: 64, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !455, file: !64, line: 151, baseType: !141, size: 64, offset: 128)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_face", scope: !390, file: !64, line: 178, baseType: !461, size: 192)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_face", file: !64, line: 153, size: 192, elements: !462)
!462 = !{!463, !464, !465}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !461, file: !64, line: 154, baseType: !159, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !461, file: !64, line: 155, baseType: !141, size: 64, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !461, file: !64, line: 155, baseType: !141, size: 64, offset: 128)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !387, file: !64, line: 181, baseType: !83, size: 64, offset: 320)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !387, file: !64, line: 182, baseType: !87, size: 64, offset: 384)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !387, file: !64, line: 184, baseType: !101, size: 32, offset: 448)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !387, file: !64, line: 185, baseType: !103, size: 8, offset: 480)
!470 = !DILocation(line: 100, column: 9, scope: !357)
!471 = !DILocalVariable(name: "l", scope: !357, file: !1, line: 101, type: !141)
!472 = !DILocation(line: 101, column: 10, scope: !357)
!473 = !DILocalVariable(name: "face_tot", scope: !357, file: !1, line: 103, type: !5)
!474 = !DILocation(line: 103, column: 15, scope: !357)
!475 = !DILocation(line: 106, column: 2, scope: !476)
!476 = distinct !DILexicalBlock(scope: !357, file: !1, line: 106, column: 2)
!477 = !DILocation(line: 107, column: 2, scope: !478)
!478 = distinct !DILexicalBlock(scope: !357, file: !1, line: 107, column: 2)
!479 = !DILocation(line: 109, column: 2, scope: !480)
!480 = distinct !DILexicalBlock(scope: !357, file: !1, line: 109, column: 2)
!481 = !DILocation(line: 109, column: 2, scope: !482)
!482 = distinct !DILexicalBlock(scope: !480, file: !1, line: 109, column: 2)
!483 = !DILocation(line: 110, column: 7, scope: !484)
!484 = distinct !DILexicalBlock(scope: !485, file: !1, line: 110, column: 7)
!485 = distinct !DILexicalBlock(scope: !482, file: !1, line: 109, column: 48)
!486 = !DILocation(line: 110, column: 7, scope: !485)
!487 = !DILocalVariable(name: "l_iter", scope: !488, file: !1, line: 111, type: !141)
!488 = distinct !DILexicalBlock(scope: !484, file: !1, line: 110, column: 42)
!489 = !DILocation(line: 111, column: 12, scope: !488)
!490 = !DILocalVariable(name: "l_first", scope: !488, file: !1, line: 111, type: !141)
!491 = !DILocation(line: 111, column: 21, scope: !488)
!492 = !DILocation(line: 112, column: 23, scope: !488)
!493 = !DILocation(line: 112, column: 21, scope: !488)
!494 = !DILocation(line: 112, column: 11, scope: !488)
!495 = !DILocation(line: 113, column: 4, scope: !488)
!496 = !DILocation(line: 114, column: 35, scope: !497)
!497 = distinct !DILexicalBlock(scope: !498, file: !1, line: 114, column: 9)
!498 = distinct !DILexicalBlock(scope: !488, file: !1, line: 113, column: 7)
!499 = !DILocation(line: 114, column: 9, scope: !497)
!500 = !DILocation(line: 114, column: 43, scope: !497)
!501 = !DILocation(line: 114, column: 9, scope: !498)
!502 = !DILocation(line: 115, column: 6, scope: !503)
!503 = distinct !DILexicalBlock(scope: !497, file: !1, line: 114, column: 53)
!504 = !DILocation(line: 116, column: 5, scope: !503)
!505 = !DILocation(line: 117, column: 4, scope: !498)
!506 = !DILocation(line: 117, column: 23, scope: !488)
!507 = !DILocation(line: 117, column: 31, scope: !488)
!508 = !DILocation(line: 117, column: 21, scope: !488)
!509 = !DILocation(line: 117, column: 40, scope: !488)
!510 = !DILocation(line: 117, column: 37, scope: !488)
!511 = distinct !{!511, !495, !512}
!512 = !DILocation(line: 117, column: 47, scope: !488)
!513 = !DILocation(line: 118, column: 3, scope: !488)
!514 = !DILocation(line: 119, column: 2, scope: !485)
!515 = distinct !{!515, !479, !516}
!516 = !DILocation(line: 119, column: 2, scope: !480)
!517 = !DILocation(line: 121, column: 2, scope: !357)
!518 = !DILocation(line: 121, column: 9, scope: !357)
!519 = !DILocation(line: 122, column: 3, scope: !520)
!520 = distinct !DILexicalBlock(scope: !357, file: !1, line: 121, column: 46)
!521 = !DILocation(line: 122, column: 15, scope: !520)
!522 = !DILocation(line: 122, column: 13, scope: !520)
!523 = !DILocation(line: 124, column: 8, scope: !524)
!524 = distinct !DILexicalBlock(scope: !525, file: !1, line: 124, column: 8)
!525 = distinct !DILexicalBlock(scope: !520, file: !1, line: 122, column: 52)
!526 = !DILocation(line: 124, column: 8, scope: !525)
!527 = !DILocalVariable(name: "l_iter", scope: !528, file: !1, line: 125, type: !141)
!528 = distinct !DILexicalBlock(scope: !524, file: !1, line: 124, column: 46)
!529 = !DILocation(line: 125, column: 13, scope: !528)
!530 = !DILocation(line: 127, column: 5, scope: !528)
!531 = !DILocation(line: 129, column: 14, scope: !528)
!532 = !DILocation(line: 129, column: 17, scope: !528)
