; ModuleID = 'blender_bin/source/blender/makesrna/intern/rna_lattice_gen.c'
source_filename = "blender_bin/source/blender/makesrna/intern/rna_lattice_gen.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.StructRNA = type { %struct.ContainerRNA, i8*, i8*, i8*, i32, i8*, i8*, i8*, i32, %struct.PropertyRNA*, %struct.PropertyRNA*, %struct.StructRNA*, %struct.StructRNA*, %struct.StructRNA* (%struct.PointerRNA*)*, i8* (%struct.PointerRNA*)*, %struct.StructRNA* (%struct.Main*, %struct.ReportList*, i8*, i8*, i32 (%struct.PointerRNA*, i8*, i32*)*, i32 (%struct.bContext*, %struct.PointerRNA*, %struct.FunctionRNA*, %struct.ParameterList*)*, void (i8*)*)*, void (%struct.Main*, %struct.StructRNA*)*, i8** (%struct.PointerRNA*)*, %struct.IDProperty* (%struct.PointerRNA*, i8)*, %struct.ListBase }
%struct.ContainerRNA = type { i8*, i8*, %struct.GHash*, %struct.ListBase }
%struct.GHash = type opaque
%struct.PropertyRNA = type { %struct.PropertyRNA*, %struct.PropertyRNA*, i32, i8*, i32, i8*, i8*, i32, i8*, i32, i32, i32 (%struct.PointerRNA*, i32*)*, i32, [3 x i32], i32, void (%struct.Main*, %struct.Scene*, %struct.PointerRNA*)*, i32, {}*, i32 (%struct.PointerRNA*, i32)*, i32, i32, %struct.StructRNA*, i8* }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }

!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !56, globals: !1633, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "blender_bin/source/blender/makesrna/intern/rna_lattice_gen.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{!5, !16, !47}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertyType", file: !6, line: 71, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15}
!9 = !DIEnumerator(name: "PROP_BOOLEAN", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "PROP_INT", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "PROP_FLOAT", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "PROP_STRING", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "PROP_ENUM", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "PROP_POINTER", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "PROP_COLLECTION", value: 6, isUnsigned: true)
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertySubType", file: !6, line: 107, baseType: !7, size: 32, elements: !17)
!17 = !{!18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46}
!18 = !DIEnumerator(name: "PROP_NONE", value: 0, isUnsigned: true)
!19 = !DIEnumerator(name: "PROP_FILEPATH", value: 1, isUnsigned: true)
!20 = !DIEnumerator(name: "PROP_DIRPATH", value: 2, isUnsigned: true)
!21 = !DIEnumerator(name: "PROP_FILENAME", value: 3, isUnsigned: true)
!22 = !DIEnumerator(name: "PROP_BYTESTRING", value: 4, isUnsigned: true)
!23 = !DIEnumerator(name: "PROP_PASSWORD", value: 6, isUnsigned: true)
!24 = !DIEnumerator(name: "PROP_PIXEL", value: 12, isUnsigned: true)
!25 = !DIEnumerator(name: "PROP_UNSIGNED", value: 13, isUnsigned: true)
!26 = !DIEnumerator(name: "PROP_PERCENTAGE", value: 14, isUnsigned: true)
!27 = !DIEnumerator(name: "PROP_FACTOR", value: 15, isUnsigned: true)
!28 = !DIEnumerator(name: "PROP_ANGLE", value: 327696, isUnsigned: true)
!29 = !DIEnumerator(name: "PROP_TIME", value: 393233, isUnsigned: true)
!30 = !DIEnumerator(name: "PROP_DISTANCE", value: 65554, isUnsigned: true)
!31 = !DIEnumerator(name: "PROP_DISTANCE_CAMERA", value: 589843, isUnsigned: true)
!32 = !DIEnumerator(name: "PROP_COLOR", value: 20, isUnsigned: true)
!33 = !DIEnumerator(name: "PROP_TRANSLATION", value: 65557, isUnsigned: true)
!34 = !DIEnumerator(name: "PROP_DIRECTION", value: 22, isUnsigned: true)
!35 = !DIEnumerator(name: "PROP_VELOCITY", value: 458775, isUnsigned: true)
!36 = !DIEnumerator(name: "PROP_ACCELERATION", value: 524312, isUnsigned: true)
!37 = !DIEnumerator(name: "PROP_MATRIX", value: 25, isUnsigned: true)
!38 = !DIEnumerator(name: "PROP_EULER", value: 327706, isUnsigned: true)
!39 = !DIEnumerator(name: "PROP_QUATERNION", value: 27, isUnsigned: true)
!40 = !DIEnumerator(name: "PROP_AXISANGLE", value: 28, isUnsigned: true)
!41 = !DIEnumerator(name: "PROP_XYZ", value: 29, isUnsigned: true)
!42 = !DIEnumerator(name: "PROP_XYZ_LENGTH", value: 65565, isUnsigned: true)
!43 = !DIEnumerator(name: "PROP_COLOR_GAMMA", value: 30, isUnsigned: true)
!44 = !DIEnumerator(name: "PROP_COORDS", value: 31, isUnsigned: true)
!45 = !DIEnumerator(name: "PROP_LAYER", value: 40, isUnsigned: true)
!46 = !DIEnumerator(name: "PROP_LAYER_MEMBER", value: 41, isUnsigned: true)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RawPropertyType", file: !6, line: 286, baseType: !48, size: 32, elements: !49)
!48 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!49 = !{!50, !51, !52, !53, !54, !55}
!50 = !DIEnumerator(name: "PROP_RAW_UNSET", value: -1)
!51 = !DIEnumerator(name: "PROP_RAW_INT", value: 0)
!52 = !DIEnumerator(name: "PROP_RAW_SHORT", value: 1)
!53 = !DIEnumerator(name: "PROP_RAW_CHAR", value: 2)
!54 = !DIEnumerator(name: "PROP_RAW_DOUBLE", value: 3)
!55 = !DIEnumerator(name: "PROP_RAW_FLOAT", value: 4)
!56 = !{!57, !48, !241, !1629, !151, !1631, !237, !310, !515, !68, !1632}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "Lattice", file: !59, line: 72, baseType: !60)
!59 = !DIFile(filename: "blender/source/blender/makesdna/DNA_lattice_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Lattice", file: !59, line: 52, size: 2240, elements: !61)
!61 = !{!62, !133, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !152, !153, !154, !155, !156, !157, !172, !175, !218, !231, !232}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !60, file: !59, line: 53, baseType: !63, size: 960)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !64, line: 130, baseType: !65)
!64 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !64, line: 117, size: 960, elements: !66)
!66 = !{!67, !69, !70, !72, !92, !96, !98, !99, !100, !101}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !65, file: !64, line: 118, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !65, file: !64, line: 118, baseType: !68, size: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !65, file: !64, line: 119, baseType: !71, size: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !65, file: !64, line: 120, baseType: !73, size: 64, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !64, line: 136, size: 17600, elements: !75)
!75 = !{!76, !77, !79, !82, !87, !88, !89}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !74, file: !64, line: 137, baseType: !63, size: 960)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !74, file: !64, line: 138, baseType: !78, size: 64, offset: 960)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !74, file: !64, line: 139, baseType: !80, size: 64, offset: 1024)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !64, line: 43, flags: DIFlagFwdDecl)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !74, file: !64, line: 140, baseType: !83, size: 8192, offset: 1088)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 8192, elements: !85)
!84 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!85 = !{!86}
!86 = !DISubrange(count: 1024)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !74, file: !64, line: 141, baseType: !83, size: 8192, offset: 9280)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !74, file: !64, line: 148, baseType: !73, size: 64, offset: 17472)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !74, file: !64, line: 150, baseType: !90, size: 64, offset: 17536)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !64, line: 45, flags: DIFlagFwdDecl)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !65, file: !64, line: 121, baseType: !93, size: 528, offset: 256)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 528, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 66)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !65, file: !64, line: 126, baseType: !97, size: 16, offset: 784)
!97 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !65, file: !64, line: 127, baseType: !48, size: 32, offset: 800)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !65, file: !64, line: 128, baseType: !48, size: 32, offset: 832)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !65, file: !64, line: 128, baseType: !48, size: 32, offset: 864)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !65, file: !64, line: 129, baseType: !102, size: 64, offset: 896)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !64, line: 75, baseType: !104)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !64, line: 62, size: 1024, elements: !105)
!105 = !{!106, !108, !109, !110, !111, !112, !116, !117, !131, !132}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !104, file: !64, line: 63, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !104, file: !64, line: 63, baseType: !107, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !104, file: !64, line: 64, baseType: !84, size: 8, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !104, file: !64, line: 64, baseType: !84, size: 8, offset: 136)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !104, file: !64, line: 65, baseType: !97, size: 16, offset: 144)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !104, file: !64, line: 66, baseType: !113, size: 512, offset: 160)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 512, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !104, file: !64, line: 67, baseType: !48, size: 32, offset: 672)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !104, file: !64, line: 69, baseType: !118, size: 256, offset: 704)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !64, line: 60, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !64, line: 48, size: 256, elements: !120)
!120 = !{!121, !122, !129, !130}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !119, file: !64, line: 49, baseType: !68, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !119, file: !64, line: 58, baseType: !123, size: 128, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !124, line: 71, baseType: !125)
!124 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !124, line: 69, size: 128, elements: !126)
!126 = !{!127, !128}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !125, file: !124, line: 70, baseType: !68, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !125, file: !124, line: 70, baseType: !68, size: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !119, file: !64, line: 59, baseType: !48, size: 32, offset: 192)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !119, file: !64, line: 59, baseType: !48, size: 32, offset: 224)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !104, file: !64, line: 70, baseType: !48, size: 32, offset: 960)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !104, file: !64, line: 74, baseType: !48, size: 32, offset: 992)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !60, file: !59, line: 54, baseType: !134, size: 64, offset: 960)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !136, line: 58, flags: DIFlagFwdDecl)
!136 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!137 = !DIDerivedType(tag: DW_TAG_member, name: "pntsu", scope: !60, file: !59, line: 56, baseType: !97, size: 16, offset: 1024)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "pntsv", scope: !60, file: !59, line: 56, baseType: !97, size: 16, offset: 1040)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "pntsw", scope: !60, file: !59, line: 56, baseType: !97, size: 16, offset: 1056)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !60, file: !59, line: 56, baseType: !97, size: 16, offset: 1072)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "opntsu", scope: !60, file: !59, line: 57, baseType: !97, size: 16, offset: 1088)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "opntsv", scope: !60, file: !59, line: 57, baseType: !97, size: 16, offset: 1104)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "opntsw", scope: !60, file: !59, line: 57, baseType: !97, size: 16, offset: 1120)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !60, file: !59, line: 57, baseType: !97, size: 16, offset: 1136)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "typeu", scope: !60, file: !59, line: 58, baseType: !84, size: 8, offset: 1152)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "typev", scope: !60, file: !59, line: 58, baseType: !84, size: 8, offset: 1160)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "typew", scope: !60, file: !59, line: 58, baseType: !84, size: 8, offset: 1168)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !60, file: !59, line: 58, baseType: !84, size: 8, offset: 1176)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "actbp", scope: !60, file: !59, line: 59, baseType: !48, size: 32, offset: 1184)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "fu", scope: !60, file: !59, line: 61, baseType: !151, size: 32, offset: 1216)
!151 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !60, file: !59, line: 61, baseType: !151, size: 32, offset: 1248)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "fw", scope: !60, file: !59, line: 61, baseType: !151, size: 32, offset: 1280)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "du", scope: !60, file: !59, line: 61, baseType: !151, size: 32, offset: 1312)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "dv", scope: !60, file: !59, line: 61, baseType: !151, size: 32, offset: 1344)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "dw", scope: !60, file: !59, line: 61, baseType: !151, size: 32, offset: 1376)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !60, file: !59, line: 63, baseType: !158, size: 64, offset: 1408)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BPoint", file: !160, line: 136, size: 288, elements: !161)
!160 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!161 = !{!162, !166, !167, !168, !169, !170, !171}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !159, file: !160, line: 137, baseType: !163, size: 128)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 128, elements: !164)
!164 = !{!165}
!165 = !DISubrange(count: 4)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "alfa", scope: !159, file: !160, line: 138, baseType: !151, size: 32, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !159, file: !160, line: 138, baseType: !151, size: 32, offset: 160)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "f1", scope: !159, file: !160, line: 139, baseType: !97, size: 16, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "hide", scope: !159, file: !160, line: 139, baseType: !97, size: 16, offset: 208)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !159, file: !160, line: 140, baseType: !151, size: 32, offset: 224)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !159, file: !160, line: 140, baseType: !151, size: 32, offset: 256)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !60, file: !59, line: 65, baseType: !173, size: 64, offset: 1472)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !160, line: 44, flags: DIFlagFwdDecl)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !60, file: !59, line: 66, baseType: !176, size: 64, offset: 1536)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Key", file: !178, line: 73, size: 1792, elements: !179)
!178 = !DIFile(filename: "blender/source/blender/makesdna/DNA_key_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!179 = !{!180, !181, !182, !203, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !177, file: !178, line: 74, baseType: !63, size: 960)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !177, file: !178, line: 75, baseType: !134, size: 64, offset: 960)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "refkey", scope: !177, file: !178, line: 80, baseType: !183, size: 64, offset: 1024)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "KeyBlock", file: !178, line: 70, baseType: !185)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "KeyBlock", file: !178, line: 45, size: 1472, elements: !186)
!186 = !{!187, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !185, file: !178, line: 46, baseType: !188, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !185, file: !178, line: 46, baseType: !188, size: 64, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !185, file: !178, line: 48, baseType: !151, size: 32, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "curval", scope: !185, file: !178, line: 51, baseType: !151, size: 32, offset: 160)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !185, file: !178, line: 53, baseType: !97, size: 16, offset: 192)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !185, file: !178, line: 54, baseType: !97, size: 16, offset: 208)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "relative", scope: !185, file: !178, line: 56, baseType: !97, size: 16, offset: 224)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !185, file: !178, line: 57, baseType: !97, size: 16, offset: 240)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "totelem", scope: !185, file: !178, line: 59, baseType: !48, size: 32, offset: 256)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !185, file: !178, line: 60, baseType: !48, size: 32, offset: 288)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !185, file: !178, line: 62, baseType: !68, size: 64, offset: 320)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !185, file: !178, line: 63, baseType: !113, size: 512, offset: 384)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup", scope: !185, file: !178, line: 64, baseType: !113, size: 512, offset: 896)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "slidermin", scope: !185, file: !178, line: 67, baseType: !151, size: 32, offset: 1408)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "slidermax", scope: !185, file: !178, line: 68, baseType: !151, size: 32, offset: 1440)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "elemstr", scope: !177, file: !178, line: 85, baseType: !204, size: 256, offset: 1088)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 256, elements: !205)
!205 = !{!206}
!206 = !DISubrange(count: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "elemsize", scope: !177, file: !178, line: 86, baseType: !48, size: 32, offset: 1344)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !177, file: !178, line: 87, baseType: !48, size: 32, offset: 1376)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !177, file: !178, line: 89, baseType: !123, size: 128, offset: 1408)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !177, file: !178, line: 90, baseType: !173, size: 64, offset: 1536)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !177, file: !178, line: 92, baseType: !78, size: 64, offset: 1600)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !177, file: !178, line: 94, baseType: !97, size: 16, offset: 1664)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "totkey", scope: !177, file: !178, line: 95, baseType: !97, size: 16, offset: 1680)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "slurph", scope: !177, file: !178, line: 96, baseType: !97, size: 16, offset: 1696)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !177, file: !178, line: 97, baseType: !97, size: 16, offset: 1712)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !177, file: !178, line: 101, baseType: !151, size: 32, offset: 1728)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "uidgen", scope: !177, file: !178, line: 104, baseType: !48, size: 32, offset: 1760)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "dvert", scope: !60, file: !59, line: 68, baseType: !219, size: 64, offset: 1600)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !221, line: 59, size: 128, elements: !222)
!221 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!222 = !{!223, !229, !230}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "dw", scope: !220, file: !221, line: 60, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformWeight", file: !221, line: 54, size: 64, elements: !226)
!226 = !{!227, !228}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "def_nr", scope: !225, file: !221, line: 55, baseType: !48, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !225, file: !221, line: 56, baseType: !151, size: 32, offset: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "totweight", scope: !220, file: !221, line: 61, baseType: !48, size: 32, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !220, file: !221, line: 62, baseType: !48, size: 32, offset: 96)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup", scope: !60, file: !59, line: 69, baseType: !113, size: 512, offset: 1664)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "editlatt", scope: !60, file: !59, line: 71, baseType: !233, size: 64, offset: 2176)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EditLatt", file: !59, line: 44, size: 128, elements: !235)
!235 = !{!236, !238, !239}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "latt", scope: !234, file: !59, line: 45, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !234, file: !59, line: 47, baseType: !48, size: 32, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !234, file: !59, line: 49, baseType: !240, size: 32, offset: 96)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 32, elements: !164)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyRNA", file: !6, line: 333, baseType: !243)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PropertyRNA", file: !244, line: 157, size: 1344, elements: !245)
!244 = !DIFile(filename: "blender/source/blender/makesrna/intern/rna_internal_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!245 = !{!246, !248, !249, !250, !253, !254, !255, !256, !257, !258, !260, !262, !569, !570, !574, !575, !1613, !1614, !1619, !1624, !1625, !1627, !1628}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !243, file: !244, line: 158, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !243, file: !244, line: 158, baseType: !247, size: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !243, file: !244, line: 161, baseType: !48, size: 32, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !243, file: !244, line: 164, baseType: !251, size: 64, offset: 192)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !84)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !243, file: !244, line: 166, baseType: !48, size: 32, offset: 256)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !243, file: !244, line: 169, baseType: !251, size: 64, offset: 320)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !243, file: !244, line: 171, baseType: !251, size: 64, offset: 384)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !243, file: !244, line: 173, baseType: !48, size: 32, offset: 448)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !243, file: !244, line: 175, baseType: !251, size: 64, offset: 512)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !243, file: !244, line: 178, baseType: !259, size: 32, offset: 576)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyType", file: !6, line: 79, baseType: !5)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !243, file: !244, line: 180, baseType: !261, size: 32, offset: 608)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertySubType", file: !6, line: 147, baseType: !16)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "getlength", scope: !243, file: !244, line: 182, baseType: !263, size: 64, offset: 640)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropArrayLengthGetFunc", file: !244, line: 73, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!48, !267, !515}
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !6, line: 55, size: 192, elements: !269)
!269 = !{!270, !274, !568}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !268, file: !6, line: 58, baseType: !271, size: 64)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !268, file: !6, line: 56, size: 64, elements: !272)
!272 = !{!273}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !271, file: !6, line: 57, baseType: !68, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !268, file: !6, line: 60, baseType: !275, size: 64, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !244, line: 339, size: 1600, elements: !277)
!277 = !{!278, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !305, !311, !550, !555, !561, !567}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !276, file: !244, line: 341, baseType: !279, size: 320)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "ContainerRNA", file: !244, line: 135, baseType: !280)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ContainerRNA", file: !244, line: 130, size: 320, elements: !281)
!281 = !{!282, !283, !284, !287}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !280, file: !244, line: 131, baseType: !68, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !280, file: !244, line: 131, baseType: !68, size: 64, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "prophash", scope: !280, file: !244, line: 133, baseType: !285, size: 64, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !244, line: 46, flags: DIFlagFwdDecl)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !280, file: !244, line: 134, baseType: !123, size: 128, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !276, file: !244, line: 344, baseType: !251, size: 64, offset: 320)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "py_type", scope: !276, file: !244, line: 348, baseType: !68, size: 64, offset: 384)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "blender_type", scope: !276, file: !244, line: 349, baseType: !68, size: 64, offset: 448)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !276, file: !244, line: 352, baseType: !48, size: 32, offset: 512)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !276, file: !244, line: 355, baseType: !251, size: 64, offset: 576)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !276, file: !244, line: 357, baseType: !251, size: 64, offset: 640)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !276, file: !244, line: 359, baseType: !251, size: 64, offset: 704)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !276, file: !244, line: 361, baseType: !48, size: 32, offset: 768)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "nameproperty", scope: !276, file: !244, line: 364, baseType: !241, size: 64, offset: 832)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "iteratorproperty", scope: !276, file: !244, line: 367, baseType: !241, size: 64, offset: 896)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !276, file: !244, line: 370, baseType: !275, size: 64, offset: 960)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "nested", scope: !276, file: !244, line: 376, baseType: !275, size: 64, offset: 1024)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "refine", scope: !276, file: !244, line: 379, baseType: !301, size: 64, offset: 1088)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRefineFunc", file: !244, line: 70, baseType: !302)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DISubroutineType(types: !304)
!304 = !{!275, !267}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !276, file: !244, line: 382, baseType: !306, size: 64, offset: 1152)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructPathFunc", file: !244, line: 71, baseType: !307)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DISubroutineType(types: !309)
!309 = !{!310, !267}
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !276, file: !244, line: 385, baseType: !312, size: 64, offset: 1216)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRegisterFunc", file: !6, line: 410, baseType: !313)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DISubroutineType(types: !315)
!315 = !{!275, !316, !386, !68, !251, !511, !516, !546}
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Main", file: !318, line: 53, size: 15232, elements: !319)
!318 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_main.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!319 = !{!320, !321, !322, !323, !324, !325, !326, !327, !333, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !377, !383}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !317, file: !318, line: 54, baseType: !316, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !317, file: !318, line: 54, baseType: !316, size: 64, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !317, file: !318, line: 55, baseType: !83, size: 8192, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "versionfile", scope: !317, file: !318, line: 56, baseType: !97, size: 16, offset: 8320)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "subversionfile", scope: !317, file: !318, line: 56, baseType: !97, size: 16, offset: 8336)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "minversionfile", scope: !317, file: !318, line: 57, baseType: !97, size: 16, offset: 8352)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "minsubversionfile", scope: !317, file: !318, line: 57, baseType: !97, size: 16, offset: 8368)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "build_commit_timestamp", scope: !317, file: !318, line: 58, baseType: !328, size: 64, offset: 8384)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !329, line: 27, baseType: !330)
!329 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !331, line: 45, baseType: !332)
!331 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!332 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "build_hash", scope: !317, file: !318, line: 59, baseType: !334, size: 128, offset: 8448)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 128, elements: !335)
!335 = !{!336}
!336 = !DISubrange(count: 16)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", scope: !317, file: !318, line: 60, baseType: !97, size: 16, offset: 8576)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "curlib", scope: !317, file: !318, line: 62, baseType: !73, size: 64, offset: 8640)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !317, file: !318, line: 63, baseType: !123, size: 128, offset: 8704)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "library", scope: !317, file: !318, line: 64, baseType: !123, size: 128, offset: 8832)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !317, file: !318, line: 65, baseType: !123, size: 128, offset: 8960)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "mesh", scope: !317, file: !318, line: 66, baseType: !123, size: 128, offset: 9088)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !317, file: !318, line: 67, baseType: !123, size: 128, offset: 9216)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "mball", scope: !317, file: !318, line: 68, baseType: !123, size: 128, offset: 9344)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !317, file: !318, line: 69, baseType: !123, size: 128, offset: 9472)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !317, file: !318, line: 70, baseType: !123, size: 128, offset: 9600)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !317, file: !318, line: 71, baseType: !123, size: 128, offset: 9728)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "latt", scope: !317, file: !318, line: 72, baseType: !123, size: 128, offset: 9856)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "lamp", scope: !317, file: !318, line: 73, baseType: !123, size: 128, offset: 9984)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !317, file: !318, line: 74, baseType: !123, size: 128, offset: 10112)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !317, file: !318, line: 75, baseType: !123, size: 128, offset: 10240)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !317, file: !318, line: 76, baseType: !123, size: 128, offset: 10368)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !317, file: !318, line: 77, baseType: !123, size: 128, offset: 10496)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !317, file: !318, line: 78, baseType: !123, size: 128, offset: 10624)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !317, file: !318, line: 79, baseType: !123, size: 128, offset: 10752)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "vfont", scope: !317, file: !318, line: 80, baseType: !123, size: 128, offset: 10880)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !317, file: !318, line: 81, baseType: !123, size: 128, offset: 11008)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "speaker", scope: !317, file: !318, line: 82, baseType: !123, size: 128, offset: 11136)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !317, file: !318, line: 83, baseType: !123, size: 128, offset: 11264)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !317, file: !318, line: 84, baseType: !123, size: 128, offset: 11392)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "armature", scope: !317, file: !318, line: 85, baseType: !123, size: 128, offset: 11520)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !317, file: !318, line: 86, baseType: !123, size: 128, offset: 11648)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !317, file: !318, line: 87, baseType: !123, size: 128, offset: 11776)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !317, file: !318, line: 88, baseType: !123, size: 128, offset: 11904)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !317, file: !318, line: 89, baseType: !123, size: 128, offset: 12032)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "palettes", scope: !317, file: !318, line: 90, baseType: !123, size: 128, offset: 12160)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "paintcurves", scope: !317, file: !318, line: 91, baseType: !123, size: 128, offset: 12288)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "wm", scope: !317, file: !318, line: 92, baseType: !123, size: 128, offset: 12416)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil", scope: !317, file: !318, line: 93, baseType: !123, size: 128, offset: 12544)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "movieclip", scope: !317, file: !318, line: 94, baseType: !123, size: 128, offset: 12672)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !317, file: !318, line: 95, baseType: !123, size: 128, offset: 12800)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "linestyle", scope: !317, file: !318, line: 96, baseType: !123, size: 128, offset: 12928)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "id_tag_update", scope: !317, file: !318, line: 98, baseType: !374, size: 2048, offset: 13056)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 2048, elements: !375)
!375 = !{!376}
!376 = !DISubrange(count: 256)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "eval_ctx", scope: !317, file: !318, line: 101, baseType: !378, size: 64, offset: 15104)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EvaluationContext", file: !380, line: 58, size: 32, elements: !381)
!380 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_depsgraph.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!381 = !{!382}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !379, file: !380, line: 59, baseType: !48, size: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !317, file: !318, line: 103, baseType: !384, size: 64, offset: 15168)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: "MainLock", file: !318, line: 51, flags: DIFlagFwdDecl)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !388, line: 106, size: 320, elements: !389)
!388 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!389 = !{!390, !391, !392, !393, !394, !395}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !387, file: !388, line: 107, baseType: !123, size: 128)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !387, file: !388, line: 108, baseType: !48, size: 32, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !387, file: !388, line: 109, baseType: !48, size: 32, offset: 160)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !387, file: !388, line: 110, baseType: !48, size: 32, offset: 192)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !387, file: !388, line: 110, baseType: !48, size: 32, offset: 224)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !387, file: !388, line: 111, baseType: !396, size: 64, offset: 256)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !398, line: 490, size: 768, elements: !399)
!398 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!399 = !{!400, !401, !402, !502, !503, !504, !505, !506, !507, !508, !509, !510}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !397, file: !398, line: 491, baseType: !396, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !397, file: !398, line: 491, baseType: !396, size: 64, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !397, file: !398, line: 493, baseType: !403, size: 64, offset: 128)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !388, line: 169, size: 2048, elements: !405)
!405 = !{!406, !407, !408, !409, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !477, !480, !494, !495, !496, !497, !498, !499, !500, !501}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !404, file: !388, line: 170, baseType: !403, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !404, file: !388, line: 170, baseType: !403, size: 64, offset: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !404, file: !388, line: 172, baseType: !68, size: 64, offset: 128)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !404, file: !388, line: 174, baseType: !410, size: 64, offset: 192)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !412, line: 41, flags: DIFlagFwdDecl)
!412 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!413 = !DIDerivedType(tag: DW_TAG_member, name: "newscreen", scope: !404, file: !388, line: 175, baseType: !410, size: 64, offset: 256)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "screenname", scope: !404, file: !388, line: 176, baseType: !113, size: 512, offset: 320)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "posx", scope: !404, file: !388, line: 178, baseType: !97, size: 16, offset: 832)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "posy", scope: !404, file: !388, line: 178, baseType: !97, size: 16, offset: 848)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !404, file: !388, line: 178, baseType: !97, size: 16, offset: 864)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !404, file: !388, line: 178, baseType: !97, size: 16, offset: 880)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "windowstate", scope: !404, file: !388, line: 179, baseType: !97, size: 16, offset: 896)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !404, file: !388, line: 180, baseType: !97, size: 16, offset: 912)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !404, file: !388, line: 181, baseType: !97, size: 16, offset: 928)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !404, file: !388, line: 182, baseType: !97, size: 16, offset: 944)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "lastcursor", scope: !404, file: !388, line: 183, baseType: !97, size: 16, offset: 960)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "modalcursor", scope: !404, file: !388, line: 184, baseType: !97, size: 16, offset: 976)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "grabcursor", scope: !404, file: !388, line: 185, baseType: !97, size: 16, offset: 992)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "addmousemove", scope: !404, file: !388, line: 186, baseType: !97, size: 16, offset: 1008)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "winid", scope: !404, file: !388, line: 188, baseType: !48, size: 32, offset: 1024)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "lock_pie_event", scope: !404, file: !388, line: 190, baseType: !97, size: 16, offset: 1056)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "last_pie_event", scope: !404, file: !388, line: 191, baseType: !97, size: 16, offset: 1072)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "eventstate", scope: !404, file: !388, line: 194, baseType: !431, size: 64, offset: 1088)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmEvent", file: !398, line: 421, size: 960, elements: !433)
!433 = !{!434, !435, !436, !437, !438, !439, !440, !444, !448, !449, !450, !451, !452, !453, !454, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !473, !474, !475, !476}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !432, file: !398, line: 422, baseType: !431, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !432, file: !398, line: 422, baseType: !431, size: 64, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !432, file: !398, line: 424, baseType: !97, size: 16, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !432, file: !398, line: 425, baseType: !97, size: 16, offset: 144)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !432, file: !398, line: 426, baseType: !48, size: 32, offset: 160)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !432, file: !398, line: 426, baseType: !48, size: 32, offset: 192)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "mval", scope: !432, file: !398, line: 427, baseType: !441, size: 64, offset: 224)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 64, elements: !442)
!442 = !{!443}
!443 = !DISubrange(count: 2)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_buf", scope: !432, file: !398, line: 428, baseType: !445, size: 48, offset: 288)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 48, elements: !446)
!446 = !{!447}
!447 = !DISubrange(count: 6)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !432, file: !398, line: 431, baseType: !84, size: 8, offset: 336)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !432, file: !398, line: 432, baseType: !84, size: 8, offset: 344)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "prevtype", scope: !432, file: !398, line: 435, baseType: !97, size: 16, offset: 352)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "prevval", scope: !432, file: !398, line: 436, baseType: !97, size: 16, offset: 368)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "prevx", scope: !432, file: !398, line: 437, baseType: !48, size: 32, offset: 384)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "prevy", scope: !432, file: !398, line: 437, baseType: !48, size: 32, offset: 416)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicktime", scope: !432, file: !398, line: 438, baseType: !455, size: 64, offset: 448)
!455 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "prevclickx", scope: !432, file: !398, line: 439, baseType: !48, size: 32, offset: 512)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicky", scope: !432, file: !398, line: 439, baseType: !48, size: 32, offset: 544)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !432, file: !398, line: 442, baseType: !97, size: 16, offset: 576)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !432, file: !398, line: 442, baseType: !97, size: 16, offset: 592)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !432, file: !398, line: 442, baseType: !97, size: 16, offset: 608)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "oskey", scope: !432, file: !398, line: 442, baseType: !97, size: 16, offset: 624)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "keymodifier", scope: !432, file: !398, line: 443, baseType: !97, size: 16, offset: 640)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "check_click", scope: !432, file: !398, line: 446, baseType: !97, size: 16, offset: 656)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "keymap_idname", scope: !432, file: !398, line: 449, baseType: !251, size: 64, offset: 704)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "tablet_data", scope: !432, file: !398, line: 452, baseType: !466, size: 64, offset: 768)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTabletData", file: !398, line: 463, size: 128, elements: !468)
!468 = !{!469, !470, !471, !472}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "Active", scope: !467, file: !398, line: 464, baseType: !48, size: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "Pressure", scope: !467, file: !398, line: 465, baseType: !151, size: 32, offset: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "Xtilt", scope: !467, file: !398, line: 466, baseType: !151, size: 32, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "Ytilt", scope: !467, file: !398, line: 467, baseType: !151, size: 32, offset: 96)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "custom", scope: !432, file: !398, line: 455, baseType: !97, size: 16, offset: 832)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "customdatafree", scope: !432, file: !398, line: 456, baseType: !97, size: 16, offset: 848)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !432, file: !398, line: 457, baseType: !48, size: 32, offset: 864)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !432, file: !398, line: 458, baseType: !68, size: 64, offset: 896)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "curswin", scope: !404, file: !388, line: 196, baseType: !478, size: 64, offset: 1152)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmSubWindow", file: !388, line: 55, flags: DIFlagFwdDecl)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "tweak", scope: !404, file: !388, line: 198, baseType: !481, size: 64, offset: 1216)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmGesture", file: !398, line: 398, size: 448, elements: !483)
!483 = !{!484, !485, !486, !487, !488, !489, !490, !491, !492, !493}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !482, file: !398, line: 399, baseType: !481, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !482, file: !398, line: 399, baseType: !481, size: 64, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !482, file: !398, line: 400, baseType: !48, size: 32, offset: 128)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !482, file: !398, line: 401, baseType: !48, size: 32, offset: 160)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !482, file: !398, line: 402, baseType: !48, size: 32, offset: 192)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "swinid", scope: !482, file: !398, line: 403, baseType: !48, size: 32, offset: 224)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !482, file: !398, line: 404, baseType: !48, size: 32, offset: 256)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !482, file: !398, line: 405, baseType: !48, size: 32, offset: 288)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !482, file: !398, line: 407, baseType: !68, size: 64, offset: 320)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !482, file: !398, line: 414, baseType: !68, size: 64, offset: 384)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "drawmethod", scope: !404, file: !388, line: 200, baseType: !48, size: 32, offset: 1280)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "drawfail", scope: !404, file: !388, line: 200, baseType: !48, size: 32, offset: 1312)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "drawdata", scope: !404, file: !388, line: 201, baseType: !68, size: 64, offset: 1344)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !404, file: !388, line: 203, baseType: !123, size: 128, offset: 1408)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !404, file: !388, line: 204, baseType: !123, size: 128, offset: 1536)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "modalhandlers", scope: !404, file: !388, line: 205, baseType: !123, size: 128, offset: 1664)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "subwindows", scope: !404, file: !388, line: 207, baseType: !123, size: 128, offset: 1792)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "gesture", scope: !404, file: !388, line: 208, baseType: !123, size: 128, offset: 1920)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "timestep", scope: !397, file: !398, line: 495, baseType: !455, size: 64, offset: 192)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !397, file: !398, line: 496, baseType: !48, size: 32, offset: 256)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !397, file: !398, line: 497, baseType: !68, size: 64, offset: 320)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !397, file: !398, line: 499, baseType: !455, size: 64, offset: 384)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !397, file: !398, line: 500, baseType: !455, size: 64, offset: 448)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "ltime", scope: !397, file: !398, line: 502, baseType: !455, size: 64, offset: 512)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "ntime", scope: !397, file: !398, line: 503, baseType: !455, size: 64, offset: 576)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !397, file: !398, line: 504, baseType: !455, size: 64, offset: 640)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "sleep", scope: !397, file: !398, line: 505, baseType: !48, size: 32, offset: 704)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructValidateFunc", file: !6, line: 407, baseType: !512)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DISubroutineType(types: !514)
!514 = !{!48, !267, !68, !515}
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !6, line: 408, baseType: !517)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DISubroutineType(types: !519)
!519 = !{!48, !520, !267, !522, !536}
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !6, line: 44, flags: DIFlagFwdDecl)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !244, line: 137, size: 640, elements: !524)
!524 = !{!525, !526, !527, !528, !529, !545}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !523, file: !244, line: 139, baseType: !279, size: 320)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !523, file: !244, line: 142, baseType: !251, size: 64, offset: 320)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !523, file: !244, line: 144, baseType: !48, size: 32, offset: 384)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !523, file: !244, line: 147, baseType: !251, size: 64, offset: 448)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !523, file: !244, line: 150, baseType: !530, size: 64, offset: 512)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "CallFunc", file: !6, line: 388, baseType: !531)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DISubroutineType(types: !533)
!533 = !{null, !520, !386, !534, !536}
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "PointerRNA", file: !6, line: 62, baseType: !268)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !6, line: 348, baseType: !538)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !6, line: 337, size: 256, elements: !539)
!539 = !{!540, !541, !542, !543, !544}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !538, file: !6, line: 339, baseType: !68, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !538, file: !6, line: 342, baseType: !522, size: 64, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !538, file: !6, line: 345, baseType: !48, size: 32, offset: 128)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !538, file: !6, line: 347, baseType: !48, size: 32, offset: 160)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !538, file: !6, line: 347, baseType: !48, size: 32, offset: 192)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "c_ret", scope: !523, file: !244, line: 154, baseType: !241, size: 64, offset: 576)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !6, line: 409, baseType: !547)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DISubroutineType(types: !549)
!549 = !{null, !68}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "unreg", scope: !276, file: !244, line: 386, baseType: !551, size: 64, offset: 1280)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructUnregisterFunc", file: !6, line: 414, baseType: !552)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DISubroutineType(types: !554)
!554 = !{null, !316, !275}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !276, file: !244, line: 387, baseType: !556, size: 64, offset: 1344)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructInstanceFunc", file: !6, line: 415, baseType: !557)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DISubroutineType(types: !559)
!559 = !{!560, !534}
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "idproperties", scope: !276, file: !244, line: 390, baseType: !562, size: 64, offset: 1408)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertiesFunc", file: !244, line: 69, baseType: !563)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DISubroutineType(types: !565)
!565 = !{!107, !267, !566}
!566 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "functions", scope: !276, file: !244, line: 393, baseType: !123, size: 128, offset: 1472)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !268, file: !6, line: 61, baseType: !68, size: 64, offset: 128)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "arraydimension", scope: !243, file: !244, line: 184, baseType: !7, size: 32, offset: 704)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !243, file: !244, line: 186, baseType: !571, size: 96, offset: 736)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 96, elements: !572)
!572 = !{!573}
!573 = !DISubrange(count: 3)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "totarraylength", scope: !243, file: !244, line: 187, baseType: !7, size: 32, offset: 832)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !243, file: !244, line: 190, baseType: !576, size: 64, offset: 896)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "UpdateFunc", file: !244, line: 64, baseType: !577)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DISubroutineType(types: !579)
!579 = !{null, !316, !580, !267}
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !136, line: 1216, size: 39680, elements: !582)
!582 = !{!583, !584, !585, !860, !863, !864, !865, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !891, !894, !897, !1190, !1193, !1486, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1508, !1509, !1510, !1511, !1512, !1520, !1587, !1594, !1595, !1602, !1605, !1606, !1607, !1608, !1609, !1610}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !581, file: !136, line: 1217, baseType: !63, size: 960)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !581, file: !136, line: 1218, baseType: !134, size: 64, offset: 960)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !581, file: !136, line: 1220, baseType: !586, size: 64, offset: 1024)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !588, line: 115, size: 11392, elements: !589)
!588 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!589 = !{!590, !591, !592, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !617, !631, !632, !672, !673, !676, !677, !693, !694, !695, !696, !697, !698, !699, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !780, !781, !782, !783, !784, !785, !786, !787, !788, !791, !794, !798, !799, !800, !801, !802, !805, !808, !811, !812, !813, !814, !815, !816, !817, !818, !820, !823, !826, !828, !848, !849}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !587, file: !588, line: 116, baseType: !63, size: 960)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !587, file: !588, line: 117, baseType: !134, size: 64, offset: 960)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !587, file: !588, line: 119, baseType: !593, size: 64, offset: 1024)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !588, line: 57, flags: DIFlagFwdDecl)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !587, file: !588, line: 121, baseType: !97, size: 16, offset: 1088)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !587, file: !588, line: 121, baseType: !97, size: 16, offset: 1104)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !587, file: !588, line: 122, baseType: !48, size: 32, offset: 1120)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !587, file: !588, line: 122, baseType: !48, size: 32, offset: 1152)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !587, file: !588, line: 122, baseType: !48, size: 32, offset: 1184)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !587, file: !588, line: 123, baseType: !113, size: 512, offset: 1216)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !587, file: !588, line: 124, baseType: !586, size: 64, offset: 1728)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !587, file: !588, line: 124, baseType: !586, size: 64, offset: 1792)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !587, file: !588, line: 127, baseType: !586, size: 64, offset: 1856)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !587, file: !588, line: 127, baseType: !586, size: 64, offset: 1920)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !587, file: !588, line: 127, baseType: !586, size: 64, offset: 1984)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !587, file: !588, line: 128, baseType: !173, size: 64, offset: 2048)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !587, file: !588, line: 130, baseType: !608, size: 64, offset: 2112)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !588, line: 97, size: 832, elements: !610)
!610 = !{!611, !615, !616}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !609, file: !588, line: 98, baseType: !612, size: 768)
!612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 768, elements: !613)
!613 = !{!614, !573}
!614 = !DISubrange(count: 8)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !609, file: !588, line: 99, baseType: !48, size: 32, offset: 768)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !609, file: !588, line: 99, baseType: !48, size: 32, offset: 800)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !587, file: !588, line: 131, baseType: !618, size: 64, offset: 2176)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !620, line: 486, size: 1600, elements: !621)
!620 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!621 = !{!622, !623, !624, !625, !626, !627, !628, !629, !630}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !619, file: !620, line: 487, baseType: !63, size: 960)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !619, file: !620, line: 489, baseType: !123, size: 128, offset: 960)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !619, file: !620, line: 490, baseType: !123, size: 128, offset: 1088)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !619, file: !620, line: 491, baseType: !123, size: 128, offset: 1216)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !619, file: !620, line: 492, baseType: !123, size: 128, offset: 1344)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !619, file: !620, line: 494, baseType: !48, size: 32, offset: 1472)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !619, file: !620, line: 495, baseType: !48, size: 32, offset: 1504)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !619, file: !620, line: 497, baseType: !48, size: 32, offset: 1536)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !619, file: !620, line: 498, baseType: !48, size: 32, offset: 1568)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !587, file: !588, line: 132, baseType: !618, size: 64, offset: 2240)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !587, file: !588, line: 133, baseType: !633, size: 64, offset: 2304)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !620, line: 334, size: 1728, elements: !635)
!635 = !{!636, !637, !638, !639, !640, !641, !642, !643, !645, !646, !647, !648, !649, !650, !651, !671}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !634, file: !620, line: 335, baseType: !123, size: 128)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !634, file: !620, line: 336, baseType: !285, size: 64, offset: 128)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !634, file: !620, line: 338, baseType: !97, size: 16, offset: 192)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !634, file: !620, line: 338, baseType: !97, size: 16, offset: 208)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !634, file: !620, line: 339, baseType: !7, size: 32, offset: 224)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !634, file: !620, line: 340, baseType: !48, size: 32, offset: 256)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !634, file: !620, line: 342, baseType: !151, size: 32, offset: 288)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !634, file: !620, line: 343, baseType: !644, size: 96, offset: 320)
!644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 96, elements: !572)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !634, file: !620, line: 344, baseType: !644, size: 96, offset: 416)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !634, file: !620, line: 347, baseType: !123, size: 128, offset: 512)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !634, file: !620, line: 349, baseType: !48, size: 32, offset: 640)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !634, file: !620, line: 350, baseType: !48, size: 32, offset: 672)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !634, file: !620, line: 351, baseType: !68, size: 64, offset: 704)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !634, file: !620, line: 352, baseType: !68, size: 64, offset: 768)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !634, file: !620, line: 354, baseType: !652, size: 384, offset: 832)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !620, line: 116, baseType: !653)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !620, line: 94, size: 384, elements: !654)
!654 = !{!655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !653, file: !620, line: 96, baseType: !48, size: 32)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !653, file: !620, line: 96, baseType: !48, size: 32, offset: 32)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !653, file: !620, line: 97, baseType: !48, size: 32, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !653, file: !620, line: 97, baseType: !48, size: 32, offset: 96)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !653, file: !620, line: 99, baseType: !97, size: 16, offset: 128)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !653, file: !620, line: 100, baseType: !97, size: 16, offset: 144)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !653, file: !620, line: 102, baseType: !97, size: 16, offset: 160)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !653, file: !620, line: 105, baseType: !97, size: 16, offset: 176)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !653, file: !620, line: 108, baseType: !97, size: 16, offset: 192)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !653, file: !620, line: 109, baseType: !97, size: 16, offset: 208)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !653, file: !620, line: 111, baseType: !97, size: 16, offset: 224)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !653, file: !620, line: 112, baseType: !97, size: 16, offset: 240)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !653, file: !620, line: 114, baseType: !48, size: 32, offset: 256)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !653, file: !620, line: 114, baseType: !48, size: 32, offset: 288)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !653, file: !620, line: 115, baseType: !48, size: 32, offset: 320)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !653, file: !620, line: 115, baseType: !48, size: 32, offset: 352)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !634, file: !620, line: 355, baseType: !113, size: 512, offset: 1216)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !587, file: !588, line: 134, baseType: !68, size: 64, offset: 2368)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !587, file: !588, line: 136, baseType: !674, size: 64, offset: 2432)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !136, line: 61, flags: DIFlagFwdDecl)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !587, file: !588, line: 138, baseType: !652, size: 384, offset: 2496)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !587, file: !588, line: 139, baseType: !678, size: 64, offset: 2880)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !620, line: 80, baseType: !680)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !620, line: 72, size: 192, elements: !681)
!681 = !{!682, !689, !690, !691, !692}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !680, file: !620, line: 73, baseType: !683, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !620, line: 59, baseType: !685)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !620, line: 56, size: 128, elements: !686)
!686 = !{!687, !688}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !685, file: !620, line: 57, baseType: !644, size: 96)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !685, file: !620, line: 58, baseType: !48, size: 32, offset: 96)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !680, file: !620, line: 74, baseType: !48, size: 32, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !680, file: !620, line: 76, baseType: !48, size: 32, offset: 96)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !680, file: !620, line: 77, baseType: !48, size: 32, offset: 128)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !680, file: !620, line: 79, baseType: !48, size: 32, offset: 160)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !587, file: !588, line: 141, baseType: !123, size: 128, offset: 2944)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !587, file: !588, line: 142, baseType: !123, size: 128, offset: 3072)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !587, file: !588, line: 143, baseType: !123, size: 128, offset: 3200)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !587, file: !588, line: 144, baseType: !123, size: 128, offset: 3328)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !587, file: !588, line: 146, baseType: !48, size: 32, offset: 3456)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !587, file: !588, line: 147, baseType: !48, size: 32, offset: 3488)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !587, file: !588, line: 150, baseType: !700, size: 64, offset: 3520)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !136, line: 179, flags: DIFlagFwdDecl)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !587, file: !588, line: 151, baseType: !310, size: 64, offset: 3584)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !587, file: !588, line: 152, baseType: !48, size: 32, offset: 3648)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !587, file: !588, line: 153, baseType: !48, size: 32, offset: 3680)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !587, file: !588, line: 156, baseType: !644, size: 96, offset: 3712)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !587, file: !588, line: 156, baseType: !644, size: 96, offset: 3808)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !587, file: !588, line: 156, baseType: !644, size: 96, offset: 3904)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !587, file: !588, line: 157, baseType: !644, size: 96, offset: 4000)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !587, file: !588, line: 158, baseType: !644, size: 96, offset: 4096)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !587, file: !588, line: 159, baseType: !644, size: 96, offset: 4192)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !587, file: !588, line: 160, baseType: !644, size: 96, offset: 4288)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !587, file: !588, line: 160, baseType: !644, size: 96, offset: 4384)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !587, file: !588, line: 161, baseType: !163, size: 128, offset: 4480)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !587, file: !588, line: 161, baseType: !163, size: 128, offset: 4608)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !587, file: !588, line: 162, baseType: !644, size: 96, offset: 4736)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !587, file: !588, line: 162, baseType: !644, size: 96, offset: 4832)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !587, file: !588, line: 163, baseType: !151, size: 32, offset: 4928)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !587, file: !588, line: 163, baseType: !151, size: 32, offset: 4960)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !587, file: !588, line: 164, baseType: !721, size: 512, offset: 4992)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 512, elements: !722)
!722 = !{!165, !165}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !587, file: !588, line: 165, baseType: !721, size: 512, offset: 5504)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !587, file: !588, line: 166, baseType: !721, size: 512, offset: 6016)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !587, file: !588, line: 167, baseType: !721, size: 512, offset: 6528)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !587, file: !588, line: 176, baseType: !721, size: 512, offset: 7040)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !587, file: !588, line: 178, baseType: !7, size: 32, offset: 7552)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !587, file: !588, line: 180, baseType: !97, size: 16, offset: 7584)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !587, file: !588, line: 181, baseType: !97, size: 16, offset: 7600)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !587, file: !588, line: 183, baseType: !97, size: 16, offset: 7616)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !587, file: !588, line: 183, baseType: !97, size: 16, offset: 7632)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !587, file: !588, line: 184, baseType: !97, size: 16, offset: 7648)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !587, file: !588, line: 184, baseType: !97, size: 16, offset: 7664)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !587, file: !588, line: 185, baseType: !97, size: 16, offset: 7680)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !587, file: !588, line: 186, baseType: !97, size: 16, offset: 7696)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !587, file: !588, line: 187, baseType: !97, size: 16, offset: 7712)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !587, file: !588, line: 188, baseType: !84, size: 8, offset: 7728)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !587, file: !588, line: 189, baseType: !84, size: 8, offset: 7736)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !587, file: !588, line: 192, baseType: !48, size: 32, offset: 7744)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !587, file: !588, line: 192, baseType: !48, size: 32, offset: 7776)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !587, file: !588, line: 192, baseType: !48, size: 32, offset: 7808)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !587, file: !588, line: 192, baseType: !48, size: 32, offset: 7840)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !587, file: !588, line: 194, baseType: !48, size: 32, offset: 7872)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !587, file: !588, line: 202, baseType: !151, size: 32, offset: 7904)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !587, file: !588, line: 202, baseType: !151, size: 32, offset: 7936)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !587, file: !588, line: 202, baseType: !151, size: 32, offset: 7968)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !587, file: !588, line: 211, baseType: !151, size: 32, offset: 8000)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !587, file: !588, line: 212, baseType: !151, size: 32, offset: 8032)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !587, file: !588, line: 213, baseType: !151, size: 32, offset: 8064)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !587, file: !588, line: 214, baseType: !151, size: 32, offset: 8096)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !587, file: !588, line: 215, baseType: !151, size: 32, offset: 8128)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !587, file: !588, line: 216, baseType: !151, size: 32, offset: 8160)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !587, file: !588, line: 219, baseType: !151, size: 32, offset: 8192)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !587, file: !588, line: 220, baseType: !151, size: 32, offset: 8224)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !587, file: !588, line: 221, baseType: !151, size: 32, offset: 8256)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !587, file: !588, line: 224, baseType: !757, size: 16, offset: 8288)
!757 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !587, file: !588, line: 224, baseType: !757, size: 16, offset: 8304)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !587, file: !588, line: 226, baseType: !97, size: 16, offset: 8320)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !587, file: !588, line: 228, baseType: !84, size: 8, offset: 8336)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !587, file: !588, line: 229, baseType: !84, size: 8, offset: 8344)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !587, file: !588, line: 231, baseType: !97, size: 16, offset: 8352)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !587, file: !588, line: 232, baseType: !84, size: 8, offset: 8368)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !587, file: !588, line: 233, baseType: !84, size: 8, offset: 8376)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !587, file: !588, line: 234, baseType: !151, size: 32, offset: 8384)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !587, file: !588, line: 235, baseType: !151, size: 32, offset: 8416)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !587, file: !588, line: 237, baseType: !123, size: 128, offset: 8448)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !587, file: !588, line: 238, baseType: !123, size: 128, offset: 8576)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !587, file: !588, line: 239, baseType: !123, size: 128, offset: 8704)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !587, file: !588, line: 240, baseType: !123, size: 128, offset: 8832)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !587, file: !588, line: 242, baseType: !151, size: 32, offset: 8960)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !587, file: !588, line: 244, baseType: !97, size: 16, offset: 8992)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !587, file: !588, line: 245, baseType: !757, size: 16, offset: 9008)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !587, file: !588, line: 246, baseType: !163, size: 128, offset: 9024)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !587, file: !588, line: 248, baseType: !48, size: 32, offset: 9152)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !587, file: !588, line: 249, baseType: !48, size: 32, offset: 9184)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !587, file: !588, line: 251, baseType: !778, size: 64, offset: 9216)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !588, line: 251, flags: DIFlagFwdDecl)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !587, file: !588, line: 253, baseType: !84, size: 8, offset: 9280)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !587, file: !588, line: 254, baseType: !84, size: 8, offset: 9288)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !587, file: !588, line: 255, baseType: !97, size: 16, offset: 9296)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !587, file: !588, line: 256, baseType: !644, size: 96, offset: 9312)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !587, file: !588, line: 258, baseType: !123, size: 128, offset: 9408)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !587, file: !588, line: 259, baseType: !123, size: 128, offset: 9536)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !587, file: !588, line: 260, baseType: !123, size: 128, offset: 9664)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !587, file: !588, line: 261, baseType: !123, size: 128, offset: 9792)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !587, file: !588, line: 263, baseType: !789, size: 64, offset: 9920)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !588, line: 52, flags: DIFlagFwdDecl)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !587, file: !588, line: 264, baseType: !792, size: 64, offset: 9984)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !588, line: 53, flags: DIFlagFwdDecl)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !587, file: !588, line: 265, baseType: !795, size: 64, offset: 10048)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !797, line: 43, flags: DIFlagFwdDecl)
!797 = !DIFile(filename: "blender/source/blender/makesdna/DNA_freestyle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!798 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !587, file: !588, line: 267, baseType: !84, size: 8, offset: 10112)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !587, file: !588, line: 268, baseType: !84, size: 8, offset: 10120)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !587, file: !588, line: 269, baseType: !97, size: 16, offset: 10128)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !587, file: !588, line: 270, baseType: !151, size: 32, offset: 10144)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !587, file: !588, line: 272, baseType: !803, size: 64, offset: 10176)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !588, line: 54, flags: DIFlagFwdDecl)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !587, file: !588, line: 275, baseType: !806, size: 64, offset: 10240)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !588, line: 275, flags: DIFlagFwdDecl)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !587, file: !588, line: 277, baseType: !809, size: 64, offset: 10304)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !588, line: 56, flags: DIFlagFwdDecl)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !587, file: !588, line: 277, baseType: !809, size: 64, offset: 10368)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !587, file: !588, line: 278, baseType: !328, size: 64, offset: 10432)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !587, file: !588, line: 279, baseType: !328, size: 64, offset: 10496)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !587, file: !588, line: 280, baseType: !7, size: 32, offset: 10560)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !587, file: !588, line: 281, baseType: !7, size: 32, offset: 10592)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !587, file: !588, line: 283, baseType: !123, size: 128, offset: 10624)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !587, file: !588, line: 284, baseType: !123, size: 128, offset: 10752)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !587, file: !588, line: 285, baseType: !819, size: 64, offset: 10880)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !587, file: !588, line: 287, baseType: !821, size: 64, offset: 10944)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !588, line: 59, flags: DIFlagFwdDecl)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !587, file: !588, line: 288, baseType: !824, size: 64, offset: 11008)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !588, line: 288, flags: DIFlagFwdDecl)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !587, file: !588, line: 290, baseType: !827, size: 64, offset: 11072)
!827 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 64, elements: !442)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !587, file: !588, line: 291, baseType: !829, size: 64, offset: 11136)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !831, line: 65, baseType: !832)
!831 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !831, line: 50, size: 320, elements: !833)
!833 = !{!834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !832, file: !831, line: 51, baseType: !580, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !832, file: !831, line: 53, baseType: !48, size: 32, offset: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !832, file: !831, line: 54, baseType: !48, size: 32, offset: 96)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !832, file: !831, line: 55, baseType: !48, size: 32, offset: 128)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !832, file: !831, line: 55, baseType: !48, size: 32, offset: 160)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !832, file: !831, line: 56, baseType: !84, size: 8, offset: 192)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !832, file: !831, line: 56, baseType: !84, size: 8, offset: 200)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !832, file: !831, line: 57, baseType: !84, size: 8, offset: 208)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !832, file: !831, line: 57, baseType: !84, size: 8, offset: 216)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !832, file: !831, line: 59, baseType: !97, size: 16, offset: 224)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !832, file: !831, line: 59, baseType: !97, size: 16, offset: 240)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !832, file: !831, line: 59, baseType: !97, size: 16, offset: 256)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !832, file: !831, line: 61, baseType: !97, size: 16, offset: 272)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !832, file: !831, line: 63, baseType: !48, size: 32, offset: 288)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !587, file: !588, line: 293, baseType: !123, size: 128, offset: 11200)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !587, file: !588, line: 294, baseType: !850, size: 64, offset: 11328)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !588, line: 113, baseType: !852)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !588, line: 108, size: 256, elements: !853)
!853 = !{!854, !856, !857, !858, !859}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !852, file: !588, line: 109, baseType: !855, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !852, file: !588, line: 109, baseType: !855, size: 64, offset: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !852, file: !588, line: 110, baseType: !586, size: 64, offset: 128)
