; ModuleID = 'blender/source/blender/editors/space_image/image_draw.c'
source_filename = "blender/source/blender/editors/space_image/image_draw.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }
%struct.WalkNavigation = type { float, float, float, float, float, float, i16, [3 x i16] }

!224 = !DIEnumerator(name: "TH_AXIS_X", value: 176, isUnsigned: true)
!225 = !DIEnumerator(name: "TH_AXIS_Y", value: 177, isUnsigned: true)
!226 = !DIEnumerator(name: "TH_AXIS_Z", value: 178, isUnsigned: true)
!227 = !DIEnumerator(name: "TH_LOW_GRAD", value: 179, isUnsigned: true)
!228 = !DIEnumerator(name: "TH_HIGH_GRAD", value: 180, isUnsigned: true)
!229 = !DIEnumerator(name: "TH_SHOW_BACK_GRAD", value: 181, isUnsigned: true)
!230 = !DIEnumerator(name: "TH_INFO_SELECTED", value: 182, isUnsigned: true)
!231 = !DIEnumerator(name: "TH_INFO_SELECTED_TEXT", value: 183, isUnsigned: true)
!232 = !DIEnumerator(name: "TH_INFO_ERROR", value: 184, isUnsigned: true)
!233 = !DIEnumerator(name: "TH_INFO_ERROR_TEXT", value: 185, isUnsigned: true)
!234 = !DIEnumerator(name: "TH_INFO_WARNING", value: 186, isUnsigned: true)
!235 = !DIEnumerator(name: "TH_INFO_WARNING_TEXT", value: 187, isUnsigned: true)
!236 = !DIEnumerator(name: "TH_INFO_INFO", value: 188, isUnsigned: true)
!237 = !DIEnumerator(name: "TH_INFO_INFO_TEXT", value: 189, isUnsigned: true)
!238 = !DIEnumerator(name: "TH_INFO_DEBUG", value: 190, isUnsigned: true)
!239 = !DIEnumerator(name: "TH_INFO_DEBUG_TEXT", value: 191, isUnsigned: true)
!240 = !DIEnumerator(name: "TH_VIEW_OVERLAY", value: 192, isUnsigned: true)
!241 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !242, line: 133, baseType: !5, size: 32, elements: !243)
!242 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!243 = !{!244, !245, !246, !247, !248, !249, !250, !251, !252, !253}
!244 = !DIEnumerator(name: "IMA_FIELDS", value: 1, isUnsigned: true)
!245 = !DIEnumerator(name: "IMA_STD_FIELD", value: 2, isUnsigned: true)
!246 = !DIEnumerator(name: "IMA_DO_PREMUL", value: 4, isUnsigned: true)
!247 = !DIEnumerator(name: "IMA_REFLECT", value: 16, isUnsigned: true)
!248 = !DIEnumerator(name: "IMA_NOCOLLECT", value: 32, isUnsigned: true)
!249 = !DIEnumerator(name: "IMA_OLD_PREMUL", value: 128, isUnsigned: true)
!250 = !DIEnumerator(name: "IMA_USED_FOR_RENDER", value: 512, isUnsigned: true)
!251 = !DIEnumerator(name: "IMA_USER_FRAME_IN_RANGE", value: 1024, isUnsigned: true)
!252 = !DIEnumerator(name: "IMA_VIEW_AS_RENDER", value: 2048, isUnsigned: true)
!253 = !DIEnumerator(name: "IMA_IGNORE_ALPHA", value: 4096, isUnsigned: true)
!254 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !255, line: 339, baseType: !5, size: 32, elements: !256)
!255 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!256 = !{!257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267}
!257 = !DIEnumerator(name: "OB_EMPTY", value: 0, isUnsigned: true)
!258 = !DIEnumerator(name: "OB_MESH", value: 1, isUnsigned: true)
!259 = !DIEnumerator(name: "OB_CURVE", value: 2, isUnsigned: true)
!260 = !DIEnumerator(name: "OB_SURF", value: 3, isUnsigned: true)
!261 = !DIEnumerator(name: "OB_FONT", value: 4, isUnsigned: true)
!262 = !DIEnumerator(name: "OB_MBALL", value: 5, isUnsigned: true)
!263 = !DIEnumerator(name: "OB_LAMP", value: 10, isUnsigned: true)
!264 = !DIEnumerator(name: "OB_CAMERA", value: 11, isUnsigned: true)
!265 = !DIEnumerator(name: "OB_SPEAKER", value: 12, isUnsigned: true)
!266 = !DIEnumerator(name: "OB_LATTICE", value: 22, isUnsigned: true)
!267 = !DIEnumerator(name: "OB_ARMATURE", value: 25, isUnsigned: true)
!268 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BrushImagePaintTool", file: !269, line: 264, baseType: !5, size: 32, elements: !270)
!269 = !DIFile(filename: "blender/source/blender/makesdna/DNA_brush_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!270 = !{!271, !272, !273, !274, !275, !276}
!271 = !DIEnumerator(name: "PAINT_TOOL_DRAW", value: 0, isUnsigned: true)
!272 = !DIEnumerator(name: "PAINT_TOOL_SOFTEN", value: 1, isUnsigned: true)
!273 = !DIEnumerator(name: "PAINT_TOOL_SMEAR", value: 2, isUnsigned: true)
!274 = !DIEnumerator(name: "PAINT_TOOL_CLONE", value: 3, isUnsigned: true)
!275 = !DIEnumerator(name: "PAINT_TOOL_FILL", value: 4, isUnsigned: true)
!276 = !DIEnumerator(name: "PAINT_TOOL_MASK", value: 5, isUnsigned: true)
!277 = !{!278, !279, !280, !281, !422, !322}
!278 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "Camera", file: !283, line: 71, baseType: !284)
!283 = !DIFile(filename: "blender/source/blender/makesdna/DNA_camera_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Camera", file: !283, line: 47, size: 1600, elements: !285)
!285 = !{!286, !357, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !377, !2359, !2360}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !284, file: !283, line: 48, baseType: !287, size: 960)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !288, line: 130, baseType: !289)
!288 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !288, line: 117, size: 960, elements: !290)
!290 = !{!291, !292, !293, !295, !315, !319, !321, !323, !324, !325}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !289, file: !288, line: 118, baseType: !279, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !289, file: !288, line: 118, baseType: !279, size: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !289, file: !288, line: 119, baseType: !294, size: 64, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !289, file: !288, line: 120, baseType: !296, size: 64, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !288, line: 136, size: 17600, elements: !298)
!298 = !{!299, !300, !302, !305, !310, !311, !312}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !297, file: !288, line: 137, baseType: !287, size: 960)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !297, file: !288, line: 138, baseType: !301, size: 64, offset: 960)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !297, file: !288, line: 139, baseType: !303, size: 64, offset: 1024)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !288, line: 43, flags: DIFlagFwdDecl)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !297, file: !288, line: 140, baseType: !306, size: 8192, offset: 1088)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !307, size: 8192, elements: !308)
!307 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!308 = !{!309}
!309 = !DISubrange(count: 1024)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !297, file: !288, line: 141, baseType: !306, size: 8192, offset: 9280)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !297, file: !288, line: 148, baseType: !296, size: 64, offset: 17472)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !297, file: !288, line: 150, baseType: !313, size: 64, offset: 17536)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !288, line: 45, flags: DIFlagFwdDecl)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !289, file: !288, line: 121, baseType: !316, size: 528, offset: 256)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !307, size: 528, elements: !317)
!317 = !{!318}
!318 = !DISubrange(count: 66)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !289, file: !288, line: 126, baseType: !320, size: 16, offset: 784)
!320 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !289, file: !288, line: 127, baseType: !322, size: 32, offset: 800)
!322 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !289, file: !288, line: 128, baseType: !322, size: 32, offset: 832)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !289, file: !288, line: 128, baseType: !322, size: 32, offset: 864)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !289, file: !288, line: 129, baseType: !326, size: 64, offset: 896)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !288, line: 75, baseType: !328)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !288, line: 62, size: 1024, elements: !329)
!329 = !{!330, !332, !333, !334, !335, !336, !340, !341, !355, !356}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !328, file: !288, line: 63, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !328, file: !288, line: 63, baseType: !331, size: 64, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !328, file: !288, line: 64, baseType: !307, size: 8, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !328, file: !288, line: 64, baseType: !307, size: 8, offset: 136)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !328, file: !288, line: 65, baseType: !320, size: 16, offset: 144)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !328, file: !288, line: 66, baseType: !337, size: 512, offset: 160)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !307, size: 512, elements: !338)
!338 = !{!339}
!339 = !DISubrange(count: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !328, file: !288, line: 67, baseType: !322, size: 32, offset: 672)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !328, file: !288, line: 69, baseType: !342, size: 256, offset: 704)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !288, line: 60, baseType: !343)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !288, line: 48, size: 256, elements: !344)
!344 = !{!345, !346, !353, !354}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !343, file: !288, line: 49, baseType: !279, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !343, file: !288, line: 58, baseType: !347, size: 128, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !348, line: 71, baseType: !349)
!348 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !348, line: 69, size: 128, elements: !350)
!350 = !{!351, !352}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !349, file: !348, line: 70, baseType: !279, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !349, file: !348, line: 70, baseType: !279, size: 64, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !343, file: !288, line: 59, baseType: !322, size: 32, offset: 192)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !343, file: !288, line: 59, baseType: !322, size: 32, offset: 224)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !328, file: !288, line: 70, baseType: !322, size: 32, offset: 960)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !328, file: !288, line: 74, baseType: !322, size: 32, offset: 992)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !284, file: !283, line: 49, baseType: !358, size: 64, offset: 960)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !283, line: 44, flags: DIFlagFwdDecl)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !284, file: !283, line: 51, baseType: !307, size: 8, offset: 1024)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !284, file: !283, line: 52, baseType: !307, size: 8, offset: 1032)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !284, file: !283, line: 53, baseType: !320, size: 16, offset: 1040)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "passepartalpha", scope: !284, file: !283, line: 54, baseType: !278, size: 32, offset: 1056)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "clipsta", scope: !284, file: !283, line: 55, baseType: !278, size: 32, offset: 1088)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "clipend", scope: !284, file: !283, line: 55, baseType: !278, size: 32, offset: 1120)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "lens", scope: !284, file: !283, line: 56, baseType: !278, size: 32, offset: 1152)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "ortho_scale", scope: !284, file: !283, line: 56, baseType: !278, size: 32, offset: 1184)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "drawsize", scope: !284, file: !283, line: 56, baseType: !278, size: 32, offset: 1216)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_x", scope: !284, file: !283, line: 57, baseType: !278, size: 32, offset: 1248)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_y", scope: !284, file: !283, line: 57, baseType: !278, size: 32, offset: 1280)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "shiftx", scope: !284, file: !283, line: 58, baseType: !278, size: 32, offset: 1312)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "shifty", scope: !284, file: !283, line: 58, baseType: !278, size: 32, offset: 1344)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "YF_dofdist", scope: !284, file: !283, line: 63, baseType: !278, size: 32, offset: 1376)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !284, file: !283, line: 65, baseType: !375, size: 64, offset: 1408)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !283, line: 45, flags: DIFlagFwdDecl)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "dof_ob", scope: !284, file: !283, line: 67, baseType: !378, size: 64, offset: 1472)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !255, line: 115, size: 11392, elements: !380)
!380 = !{!381, !382, !383, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !478, !492, !493, !534, !535, !538, !539, !555, !556, !557, !558, !559, !560, !561, !565, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !581, !582, !583, !584, !585, !586, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !646, !647, !648, !649, !650, !651, !652, !653, !654, !657, !660, !663, !664, !665, !666, !667, !670, !673, !676, !677, !683, !684, !685, !686, !687, !688, !690, !693, !696, !700, !2347, !2348}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !379, file: !255, line: 116, baseType: !287, size: 960)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !379, file: !255, line: 117, baseType: !358, size: 64, offset: 960)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !379, file: !255, line: 119, baseType: !384, size: 64, offset: 1024)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !386, line: 155, size: 1856, elements: !387)
!386 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_paint.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!387 = !{!388, !391, !394, !397, !400, !401, !402, !407, !410, !412, !416, !419, !420, !421, !423, !426, !429, !430, !431, !432, !433, !437, !438, !439, !440, !441, !445, !446, !449, !452, !453, !454, !455}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "multires", scope: !385, file: !386, line: 157, baseType: !389, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "MultiresModifierData", file: !386, line: 157, flags: DIFlagFwdDecl)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "mvert", scope: !385, file: !386, line: 158, baseType: !392, size: 64, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !386, line: 49, flags: DIFlagFwdDecl)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "mpoly", scope: !385, file: !386, line: 159, baseType: !395, size: 64, offset: 128)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !386, line: 159, flags: DIFlagFwdDecl)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "mloop", scope: !385, file: !386, line: 160, baseType: !398, size: 64, offset: 192)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !386, line: 160, flags: DIFlagFwdDecl)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !385, file: !386, line: 161, baseType: !322, size: 32, offset: 256)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "totpoly", scope: !385, file: !386, line: 161, baseType: !322, size: 32, offset: 288)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "face_normals", scope: !385, file: !386, line: 162, baseType: !403, size: 64, offset: 320)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 96, elements: !405)
!405 = !{!406}
!406 = !DISubrange(count: 3)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "kb", scope: !385, file: !386, line: 163, baseType: !408, size: 64, offset: 384)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DICompositeType(tag: DW_TAG_structure_type, name: "KeyBlock", file: !386, line: 163, flags: DIFlagFwdDecl)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "vmask", scope: !385, file: !386, line: 164, baseType: !411, size: 64, offset: 448)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "pmap", scope: !385, file: !386, line: 167, baseType: !413, size: 64, offset: 512)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !415)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !386, line: 44, flags: DIFlagFwdDecl)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "bm", scope: !385, file: !386, line: 170, baseType: !417, size: 64, offset: 576)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !386, line: 39, flags: DIFlagFwdDecl)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "cd_vert_node_offset", scope: !385, file: !386, line: 171, baseType: !322, size: 32, offset: 640)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "cd_face_node_offset", scope: !385, file: !386, line: 172, baseType: !322, size: 32, offset: 672)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "bm_smooth_shading", scope: !385, file: !386, line: 173, baseType: !422, size: 8, offset: 704)
!422 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "bm_log", scope: !385, file: !386, line: 175, baseType: !424, size: 64, offset: 768)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMLog", file: !386, line: 175, flags: DIFlagFwdDecl)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "pbvh", scope: !385, file: !386, line: 178, baseType: !427, size: 64, offset: 832)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !386, line: 55, flags: DIFlagFwdDecl)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "show_diffuse_color", scope: !385, file: !386, line: 179, baseType: !422, size: 8, offset: 896)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers_active", scope: !385, file: !386, line: 182, baseType: !422, size: 8, offset: 904)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "orig_cos", scope: !385, file: !386, line: 183, baseType: !403, size: 64, offset: 960)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "deform_cos", scope: !385, file: !386, line: 184, baseType: !403, size: 64, offset: 1024)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "deform_imats", scope: !385, file: !386, line: 185, baseType: !434, size: 64, offset: 1088)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 288, elements: !436)
!436 = !{!406, !406}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "partial_redraw", scope: !385, file: !386, line: 188, baseType: !422, size: 8, offset: 1152)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_side", scope: !385, file: !386, line: 191, baseType: !5, size: 32, offset: 1184)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "texcache", scope: !385, file: !386, line: 191, baseType: !280, size: 64, offset: 1216)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_actual", scope: !385, file: !386, line: 191, baseType: !5, size: 32, offset: 1280)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "tex_pool", scope: !385, file: !386, line: 192, baseType: !442, size: 64, offset: 1344)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePool", file: !444, line: 47, flags: DIFlagFwdDecl)
!444 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_image.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!445 = !DIDerivedType(tag: DW_TAG_member, name: "layer_co", scope: !385, file: !386, line: 195, baseType: !403, size: 64, offset: 1408)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "stroke", scope: !385, file: !386, line: 197, baseType: !447, size: 64, offset: 1472)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptStroke", file: !386, line: 197, flags: DIFlagFwdDecl)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !385, file: !386, line: 198, baseType: !450, size: 64, offset: 1536)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DICompositeType(tag: DW_TAG_structure_type, name: "StrokeCache", file: !386, line: 59, flags: DIFlagFwdDecl)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke_valid", scope: !385, file: !386, line: 201, baseType: !422, size: 8, offset: 1600)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke", scope: !385, file: !386, line: 202, baseType: !404, size: 96, offset: 1632)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_accum", scope: !385, file: !386, line: 204, baseType: !404, size: 96, offset: 1728)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_counter", scope: !385, file: !386, line: 205, baseType: !322, size: 32, offset: 1824)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !379, file: !255, line: 121, baseType: !320, size: 16, offset: 1088)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !379, file: !255, line: 121, baseType: !320, size: 16, offset: 1104)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !379, file: !255, line: 122, baseType: !322, size: 32, offset: 1120)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !379, file: !255, line: 122, baseType: !322, size: 32, offset: 1152)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !379, file: !255, line: 122, baseType: !322, size: 32, offset: 1184)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !379, file: !255, line: 123, baseType: !337, size: 512, offset: 1216)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !379, file: !255, line: 124, baseType: !378, size: 64, offset: 1728)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !379, file: !255, line: 124, baseType: !378, size: 64, offset: 1792)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !379, file: !255, line: 127, baseType: !378, size: 64, offset: 1856)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !379, file: !255, line: 127, baseType: !378, size: 64, offset: 1920)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !379, file: !255, line: 127, baseType: !378, size: 64, offset: 1984)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !379, file: !255, line: 128, baseType: !375, size: 64, offset: 2048)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !379, file: !255, line: 130, baseType: !469, size: 64, offset: 2112)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !255, line: 97, size: 832, elements: !471)
!471 = !{!472, !476, !477}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !470, file: !255, line: 98, baseType: !473, size: 768)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 768, elements: !474)
!474 = !{!475, !406}
!475 = !DISubrange(count: 8)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !470, file: !255, line: 99, baseType: !322, size: 32, offset: 768)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !470, file: !255, line: 99, baseType: !322, size: 32, offset: 800)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !379, file: !255, line: 131, baseType: !479, size: 64, offset: 2176)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !481, line: 486, size: 1600, elements: !482)
!481 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!482 = !{!483, !484, !485, !486, !487, !488, !489, !490, !491}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !480, file: !481, line: 487, baseType: !287, size: 960)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !480, file: !481, line: 489, baseType: !347, size: 128, offset: 960)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !480, file: !481, line: 490, baseType: !347, size: 128, offset: 1088)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !480, file: !481, line: 491, baseType: !347, size: 128, offset: 1216)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !480, file: !481, line: 492, baseType: !347, size: 128, offset: 1344)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !480, file: !481, line: 494, baseType: !322, size: 32, offset: 1472)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !480, file: !481, line: 495, baseType: !322, size: 32, offset: 1504)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !480, file: !481, line: 497, baseType: !322, size: 32, offset: 1536)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !480, file: !481, line: 498, baseType: !322, size: 32, offset: 1568)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !379, file: !255, line: 132, baseType: !479, size: 64, offset: 2240)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !379, file: !255, line: 133, baseType: !494, size: 64, offset: 2304)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !481, line: 334, size: 1728, elements: !496)
!496 = !{!497, !498, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !533}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !495, file: !481, line: 335, baseType: !347, size: 128)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !495, file: !481, line: 336, baseType: !499, size: 64, offset: 128)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !481, line: 47, flags: DIFlagFwdDecl)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !495, file: !481, line: 338, baseType: !320, size: 16, offset: 192)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !495, file: !481, line: 338, baseType: !320, size: 16, offset: 208)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !495, file: !481, line: 339, baseType: !5, size: 32, offset: 224)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !495, file: !481, line: 340, baseType: !322, size: 32, offset: 256)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !495, file: !481, line: 342, baseType: !278, size: 32, offset: 288)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !495, file: !481, line: 343, baseType: !404, size: 96, offset: 320)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !495, file: !481, line: 344, baseType: !404, size: 96, offset: 416)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !495, file: !481, line: 347, baseType: !347, size: 128, offset: 512)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !495, file: !481, line: 349, baseType: !322, size: 32, offset: 640)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !495, file: !481, line: 350, baseType: !322, size: 32, offset: 672)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !495, file: !481, line: 351, baseType: !279, size: 64, offset: 704)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !495, file: !481, line: 352, baseType: !279, size: 64, offset: 768)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !495, file: !481, line: 354, baseType: !514, size: 384, offset: 832)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !481, line: 116, baseType: !515)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !481, line: 94, size: 384, elements: !516)
!516 = !{!517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !515, file: !481, line: 96, baseType: !322, size: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !515, file: !481, line: 96, baseType: !322, size: 32, offset: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !515, file: !481, line: 97, baseType: !322, size: 32, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !515, file: !481, line: 97, baseType: !322, size: 32, offset: 96)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !515, file: !481, line: 99, baseType: !320, size: 16, offset: 128)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !515, file: !481, line: 100, baseType: !320, size: 16, offset: 144)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !515, file: !481, line: 102, baseType: !320, size: 16, offset: 160)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !515, file: !481, line: 105, baseType: !320, size: 16, offset: 176)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !515, file: !481, line: 108, baseType: !320, size: 16, offset: 192)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !515, file: !481, line: 109, baseType: !320, size: 16, offset: 208)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !515, file: !481, line: 111, baseType: !320, size: 16, offset: 224)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !515, file: !481, line: 112, baseType: !320, size: 16, offset: 240)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !515, file: !481, line: 114, baseType: !322, size: 32, offset: 256)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !515, file: !481, line: 114, baseType: !322, size: 32, offset: 288)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !515, file: !481, line: 115, baseType: !322, size: 32, offset: 320)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !515, file: !481, line: 115, baseType: !322, size: 32, offset: 352)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !495, file: !481, line: 355, baseType: !337, size: 512, offset: 1216)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !379, file: !255, line: 134, baseType: !279, size: 64, offset: 2368)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !379, file: !255, line: 136, baseType: !536, size: 64, offset: 2432)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !255, line: 58, flags: DIFlagFwdDecl)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !379, file: !255, line: 138, baseType: !514, size: 384, offset: 2496)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !379, file: !255, line: 139, baseType: !540, size: 64, offset: 2880)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !481, line: 80, baseType: !542)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !481, line: 72, size: 192, elements: !543)
!543 = !{!544, !551, !552, !553, !554}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !542, file: !481, line: 73, baseType: !545, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !481, line: 59, baseType: !547)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !481, line: 56, size: 128, elements: !548)
!548 = !{!549, !550}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !547, file: !481, line: 57, baseType: !404, size: 96)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !547, file: !481, line: 58, baseType: !322, size: 32, offset: 96)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !542, file: !481, line: 74, baseType: !322, size: 32, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !542, file: !481, line: 76, baseType: !322, size: 32, offset: 96)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !542, file: !481, line: 77, baseType: !322, size: 32, offset: 128)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !542, file: !481, line: 79, baseType: !322, size: 32, offset: 160)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !379, file: !255, line: 141, baseType: !347, size: 128, offset: 2944)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !379, file: !255, line: 142, baseType: !347, size: 128, offset: 3072)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !379, file: !255, line: 143, baseType: !347, size: 128, offset: 3200)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !379, file: !255, line: 144, baseType: !347, size: 128, offset: 3328)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !379, file: !255, line: 146, baseType: !322, size: 32, offset: 3456)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !379, file: !255, line: 147, baseType: !322, size: 32, offset: 3488)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !379, file: !255, line: 150, baseType: !562, size: 64, offset: 3520)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !255, line: 50, flags: DIFlagFwdDecl)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !379, file: !255, line: 151, baseType: !566, size: 64, offset: 3584)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !379, file: !255, line: 152, baseType: !322, size: 32, offset: 3648)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !379, file: !255, line: 153, baseType: !322, size: 32, offset: 3680)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !379, file: !255, line: 156, baseType: !404, size: 96, offset: 3712)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !379, file: !255, line: 156, baseType: !404, size: 96, offset: 3808)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !379, file: !255, line: 156, baseType: !404, size: 96, offset: 3904)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !379, file: !255, line: 157, baseType: !404, size: 96, offset: 4000)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !379, file: !255, line: 158, baseType: !404, size: 96, offset: 4096)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !379, file: !255, line: 159, baseType: !404, size: 96, offset: 4192)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !379, file: !255, line: 160, baseType: !404, size: 96, offset: 4288)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !379, file: !255, line: 160, baseType: !404, size: 96, offset: 4384)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !379, file: !255, line: 161, baseType: !578, size: 128, offset: 4480)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 128, elements: !579)
!579 = !{!580}
!580 = !DISubrange(count: 4)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !379, file: !255, line: 161, baseType: !578, size: 128, offset: 4608)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !379, file: !255, line: 162, baseType: !404, size: 96, offset: 4736)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !379, file: !255, line: 162, baseType: !404, size: 96, offset: 4832)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !379, file: !255, line: 163, baseType: !278, size: 32, offset: 4928)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !379, file: !255, line: 163, baseType: !278, size: 32, offset: 4960)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !379, file: !255, line: 164, baseType: !587, size: 512, offset: 4992)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 512, elements: !588)
!588 = !{!580, !580}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !379, file: !255, line: 165, baseType: !587, size: 512, offset: 5504)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !379, file: !255, line: 166, baseType: !587, size: 512, offset: 6016)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !379, file: !255, line: 167, baseType: !587, size: 512, offset: 6528)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !379, file: !255, line: 176, baseType: !587, size: 512, offset: 7040)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !379, file: !255, line: 178, baseType: !5, size: 32, offset: 7552)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !379, file: !255, line: 180, baseType: !320, size: 16, offset: 7584)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !379, file: !255, line: 181, baseType: !320, size: 16, offset: 7600)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !379, file: !255, line: 183, baseType: !320, size: 16, offset: 7616)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !379, file: !255, line: 183, baseType: !320, size: 16, offset: 7632)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !379, file: !255, line: 184, baseType: !320, size: 16, offset: 7648)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !379, file: !255, line: 184, baseType: !320, size: 16, offset: 7664)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !379, file: !255, line: 185, baseType: !320, size: 16, offset: 7680)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !379, file: !255, line: 186, baseType: !320, size: 16, offset: 7696)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !379, file: !255, line: 187, baseType: !320, size: 16, offset: 7712)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !379, file: !255, line: 188, baseType: !307, size: 8, offset: 7728)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !379, file: !255, line: 189, baseType: !307, size: 8, offset: 7736)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !379, file: !255, line: 192, baseType: !322, size: 32, offset: 7744)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !379, file: !255, line: 192, baseType: !322, size: 32, offset: 7776)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !379, file: !255, line: 192, baseType: !322, size: 32, offset: 7808)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !379, file: !255, line: 192, baseType: !322, size: 32, offset: 7840)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !379, file: !255, line: 194, baseType: !322, size: 32, offset: 7872)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !379, file: !255, line: 202, baseType: !278, size: 32, offset: 7904)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !379, file: !255, line: 202, baseType: !278, size: 32, offset: 7936)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !379, file: !255, line: 202, baseType: !278, size: 32, offset: 7968)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !379, file: !255, line: 211, baseType: !278, size: 32, offset: 8000)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !379, file: !255, line: 212, baseType: !278, size: 32, offset: 8032)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !379, file: !255, line: 213, baseType: !278, size: 32, offset: 8064)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !379, file: !255, line: 214, baseType: !278, size: 32, offset: 8096)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !379, file: !255, line: 215, baseType: !278, size: 32, offset: 8128)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !379, file: !255, line: 216, baseType: !278, size: 32, offset: 8160)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !379, file: !255, line: 219, baseType: !278, size: 32, offset: 8192)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !379, file: !255, line: 220, baseType: !278, size: 32, offset: 8224)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !379, file: !255, line: 221, baseType: !278, size: 32, offset: 8256)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !379, file: !255, line: 224, baseType: !623, size: 16, offset: 8288)
!623 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !379, file: !255, line: 224, baseType: !623, size: 16, offset: 8304)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !379, file: !255, line: 226, baseType: !320, size: 16, offset: 8320)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !379, file: !255, line: 228, baseType: !307, size: 8, offset: 8336)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !379, file: !255, line: 229, baseType: !307, size: 8, offset: 8344)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !379, file: !255, line: 231, baseType: !320, size: 16, offset: 8352)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !379, file: !255, line: 232, baseType: !307, size: 8, offset: 8368)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !379, file: !255, line: 233, baseType: !307, size: 8, offset: 8376)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !379, file: !255, line: 234, baseType: !278, size: 32, offset: 8384)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !379, file: !255, line: 235, baseType: !278, size: 32, offset: 8416)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !379, file: !255, line: 237, baseType: !347, size: 128, offset: 8448)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !379, file: !255, line: 238, baseType: !347, size: 128, offset: 8576)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !379, file: !255, line: 239, baseType: !347, size: 128, offset: 8704)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !379, file: !255, line: 240, baseType: !347, size: 128, offset: 8832)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !379, file: !255, line: 242, baseType: !278, size: 32, offset: 8960)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !379, file: !255, line: 244, baseType: !320, size: 16, offset: 8992)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !379, file: !255, line: 245, baseType: !623, size: 16, offset: 9008)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !379, file: !255, line: 246, baseType: !578, size: 128, offset: 9024)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !379, file: !255, line: 248, baseType: !322, size: 32, offset: 9152)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !379, file: !255, line: 249, baseType: !322, size: 32, offset: 9184)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !379, file: !255, line: 251, baseType: !644, size: 64, offset: 9216)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !255, line: 251, flags: DIFlagFwdDecl)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !379, file: !255, line: 253, baseType: !307, size: 8, offset: 9280)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !379, file: !255, line: 254, baseType: !307, size: 8, offset: 9288)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !379, file: !255, line: 255, baseType: !320, size: 16, offset: 9296)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !379, file: !255, line: 256, baseType: !404, size: 96, offset: 9312)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !379, file: !255, line: 258, baseType: !347, size: 128, offset: 9408)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !379, file: !255, line: 259, baseType: !347, size: 128, offset: 9536)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !379, file: !255, line: 260, baseType: !347, size: 128, offset: 9664)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !379, file: !255, line: 261, baseType: !347, size: 128, offset: 9792)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !379, file: !255, line: 263, baseType: !655, size: 64, offset: 9920)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !255, line: 52, flags: DIFlagFwdDecl)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !379, file: !255, line: 264, baseType: !658, size: 64, offset: 9984)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !255, line: 53, flags: DIFlagFwdDecl)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !379, file: !255, line: 265, baseType: !661, size: 64, offset: 10048)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !481, line: 46, flags: DIFlagFwdDecl)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !379, file: !255, line: 267, baseType: !307, size: 8, offset: 10112)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !379, file: !255, line: 268, baseType: !307, size: 8, offset: 10120)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !379, file: !255, line: 269, baseType: !320, size: 16, offset: 10128)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !379, file: !255, line: 270, baseType: !278, size: 32, offset: 10144)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !379, file: !255, line: 272, baseType: !668, size: 64, offset: 10176)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !255, line: 54, flags: DIFlagFwdDecl)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !379, file: !255, line: 275, baseType: !671, size: 64, offset: 10240)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !255, line: 275, flags: DIFlagFwdDecl)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !379, file: !255, line: 277, baseType: !674, size: 64, offset: 10304)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !255, line: 56, flags: DIFlagFwdDecl)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !379, file: !255, line: 277, baseType: !674, size: 64, offset: 10368)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !379, file: !255, line: 278, baseType: !678, size: 64, offset: 10432)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !679, line: 27, baseType: !680)
!679 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !681, line: 45, baseType: !682)
!681 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!682 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !379, file: !255, line: 279, baseType: !678, size: 64, offset: 10496)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !379, file: !255, line: 280, baseType: !5, size: 32, offset: 10560)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !379, file: !255, line: 281, baseType: !5, size: 32, offset: 10592)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !379, file: !255, line: 283, baseType: !347, size: 128, offset: 10624)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !379, file: !255, line: 284, baseType: !347, size: 128, offset: 10752)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !379, file: !255, line: 285, baseType: !689, size: 64, offset: 10880)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !379, file: !255, line: 287, baseType: !691, size: 64, offset: 10944)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !255, line: 59, flags: DIFlagFwdDecl)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !379, file: !255, line: 288, baseType: !694, size: 64, offset: 11008)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !255, line: 288, flags: DIFlagFwdDecl)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !379, file: !255, line: 290, baseType: !697, size: 64, offset: 11072)
!697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 64, elements: !698)
!698 = !{!699}
!699 = !DISubrange(count: 2)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !379, file: !255, line: 291, baseType: !701, size: 64, offset: 11136)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !242, line: 65, baseType: !703)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !242, line: 50, size: 320, elements: !704)
!704 = !{!705, !2334, !2335, !2336, !2337, !2338, !2339, !2340, !2341, !2342, !2343, !2344, !2345, !2346}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !703, file: !242, line: 51, baseType: !706, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !708, line: 1216, size: 39680, elements: !709)
!708 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!709 = !{!710, !711, !712, !713, !716, !717, !718, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !744, !817, !1311, !1967, !1970, !2210, !2222, !2223, !2224, !2225, !2226, !2227, !2228, !2229, !2232, !2233, !2234, !2235, !2236, !2244, !2310, !2317, !2318, !2325, !2326, !2327, !2328, !2329, !2330, !2331}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !707, file: !708, line: 1217, baseType: !287, size: 960)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !707, file: !708, line: 1218, baseType: !358, size: 64, offset: 960)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !707, file: !708, line: 1220, baseType: !378, size: 64, offset: 1024)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !707, file: !708, line: 1221, baseType: !714, size: 64, offset: 1088)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !708, line: 52, flags: DIFlagFwdDecl)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !707, file: !708, line: 1223, baseType: !706, size: 64, offset: 1152)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !707, file: !708, line: 1225, baseType: !347, size: 128, offset: 1216)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !707, file: !708, line: 1226, baseType: !719, size: 64, offset: 1344)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !708, line: 69, size: 320, elements: !721)
!721 = !{!722, !723, !724, !725, !726, !727, !728, !729}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !720, file: !708, line: 70, baseType: !719, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !720, file: !708, line: 70, baseType: !719, size: 64, offset: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !720, file: !708, line: 71, baseType: !5, size: 32, offset: 128)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !720, file: !708, line: 71, baseType: !5, size: 32, offset: 160)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !720, file: !708, line: 72, baseType: !322, size: 32, offset: 192)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !720, file: !708, line: 73, baseType: !320, size: 16, offset: 224)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !720, file: !708, line: 73, baseType: !320, size: 16, offset: 240)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !720, file: !708, line: 74, baseType: !378, size: 64, offset: 256)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !707, file: !708, line: 1227, baseType: !378, size: 64, offset: 1408)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !707, file: !708, line: 1229, baseType: !404, size: 96, offset: 1472)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !707, file: !708, line: 1230, baseType: !404, size: 96, offset: 1568)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !707, file: !708, line: 1231, baseType: !404, size: 96, offset: 1664)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !707, file: !708, line: 1231, baseType: !404, size: 96, offset: 1760)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !707, file: !708, line: 1233, baseType: !5, size: 32, offset: 1856)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !707, file: !708, line: 1234, baseType: !322, size: 32, offset: 1888)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !707, file: !708, line: 1235, baseType: !5, size: 32, offset: 1920)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !707, file: !708, line: 1237, baseType: !320, size: 16, offset: 1952)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !707, file: !708, line: 1239, baseType: !307, size: 8, offset: 1968)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !707, file: !708, line: 1240, baseType: !741, size: 8, offset: 1976)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !307, size: 8, elements: !742)
!742 = !{!743}
!743 = !DISubrange(count: 1)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !707, file: !708, line: 1242, baseType: !745, size: 64, offset: 1984)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !747, line: 328, size: 3456, elements: !748)
!747 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!748 = !{!749, !750, !751, !754, !755, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !783, !784, !785, !788, !793, !794, !797, !801, !805, !809, !813, !814, !815, !816}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !746, file: !747, line: 329, baseType: !287, size: 960)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !746, file: !747, line: 330, baseType: !358, size: 64, offset: 960)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !746, file: !747, line: 332, baseType: !752, size: 64, offset: 1024)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !747, line: 332, flags: DIFlagFwdDecl)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !746, file: !747, line: 333, baseType: !337, size: 512, offset: 1088)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !746, file: !747, line: 335, baseType: !756, size: 64, offset: 1600)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !747, line: 335, flags: DIFlagFwdDecl)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !746, file: !747, line: 337, baseType: !536, size: 64, offset: 1664)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !746, file: !747, line: 338, baseType: !697, size: 64, offset: 1728)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !746, file: !747, line: 340, baseType: !347, size: 128, offset: 1792)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !746, file: !747, line: 340, baseType: !347, size: 128, offset: 1920)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !746, file: !747, line: 342, baseType: !322, size: 32, offset: 2048)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !746, file: !747, line: 342, baseType: !322, size: 32, offset: 2080)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !746, file: !747, line: 343, baseType: !322, size: 32, offset: 2112)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !746, file: !747, line: 345, baseType: !322, size: 32, offset: 2144)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !746, file: !747, line: 346, baseType: !322, size: 32, offset: 2176)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !746, file: !747, line: 347, baseType: !320, size: 16, offset: 2208)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !746, file: !747, line: 348, baseType: !320, size: 16, offset: 2224)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !746, file: !747, line: 349, baseType: !322, size: 32, offset: 2240)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !746, file: !747, line: 351, baseType: !322, size: 32, offset: 2272)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !746, file: !747, line: 353, baseType: !320, size: 16, offset: 2304)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !746, file: !747, line: 354, baseType: !320, size: 16, offset: 2320)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !746, file: !747, line: 355, baseType: !322, size: 32, offset: 2336)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !746, file: !747, line: 357, baseType: !775, size: 128, offset: 2368)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !776, line: 95, baseType: !777)
!776 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !776, line: 92, size: 128, elements: !778)
!778 = !{!779, !780, !781, !782}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !777, file: !776, line: 93, baseType: !278, size: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !777, file: !776, line: 93, baseType: !278, size: 32, offset: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !777, file: !776, line: 94, baseType: !278, size: 32, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !777, file: !776, line: 94, baseType: !278, size: 32, offset: 96)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !746, file: !747, line: 363, baseType: !347, size: 128, offset: 2496)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !746, file: !747, line: 363, baseType: !347, size: 128, offset: 2624)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !746, file: !747, line: 368, baseType: !786, size: 64, offset: 2752)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !747, line: 48, flags: DIFlagFwdDecl)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !746, file: !747, line: 372, baseType: !789, size: 32, offset: 2816)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !747, line: 274, baseType: !790)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !747, line: 271, size: 32, elements: !791)
!791 = !{!792}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !790, file: !747, line: 273, baseType: !5, size: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !746, file: !747, line: 373, baseType: !322, size: 32, offset: 2848)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !746, file: !747, line: 382, baseType: !795, size: 64, offset: 2880)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !747, line: 46, flags: DIFlagFwdDecl)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !746, file: !747, line: 385, baseType: !798, size: 64, offset: 2944)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DISubroutineType(types: !800)
!800 = !{null, !279, !278}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !746, file: !747, line: 386, baseType: !802, size: 64, offset: 3008)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DISubroutineType(types: !804)
!804 = !{null, !279, !566}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !746, file: !747, line: 387, baseType: !806, size: 64, offset: 3072)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DISubroutineType(types: !808)
!808 = !{!322, !279}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !746, file: !747, line: 388, baseType: !810, size: 64, offset: 3136)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DISubroutineType(types: !812)
!812 = !{null, !279}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !746, file: !747, line: 389, baseType: !279, size: 64, offset: 3200)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !746, file: !747, line: 389, baseType: !279, size: 64, offset: 3264)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !746, file: !747, line: 389, baseType: !279, size: 64, offset: 3328)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !746, file: !747, line: 389, baseType: !279, size: 64, offset: 3392)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !707, file: !708, line: 1244, baseType: !818, size: 64, offset: 2048)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !820, line: 200, size: 17024, elements: !821)
!820 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!821 = !{!822, !823, !824, !825, !1304, !1305, !1306, !1307, !1308, !1309, !1310}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !819, file: !820, line: 201, baseType: !689, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !819, file: !820, line: 202, baseType: !347, size: 128, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !819, file: !820, line: 203, baseType: !347, size: 128, offset: 192)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !819, file: !820, line: 206, baseType: !826, size: 64, offset: 320)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !820, line: 190, baseType: !828)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !820, line: 126, size: 2816, elements: !829)
!829 = !{!830, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !927, !928, !929, !930, !1265, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1303}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !828, file: !820, line: 127, baseType: !831, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !828, file: !820, line: 127, baseType: !831, size: 64, offset: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !828, file: !820, line: 128, baseType: !279, size: 64, offset: 128)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !828, file: !820, line: 129, baseType: !279, size: 64, offset: 192)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !828, file: !820, line: 130, baseType: !337, size: 512, offset: 256)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !828, file: !820, line: 132, baseType: !322, size: 32, offset: 768)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !828, file: !820, line: 132, baseType: !322, size: 32, offset: 800)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !828, file: !820, line: 133, baseType: !322, size: 32, offset: 832)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !828, file: !820, line: 134, baseType: !322, size: 32, offset: 864)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !828, file: !820, line: 134, baseType: !322, size: 32, offset: 896)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !828, file: !820, line: 134, baseType: !322, size: 32, offset: 928)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !828, file: !820, line: 135, baseType: !322, size: 32, offset: 960)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !828, file: !820, line: 135, baseType: !322, size: 32, offset: 992)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !828, file: !820, line: 136, baseType: !322, size: 32, offset: 1024)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !828, file: !820, line: 136, baseType: !322, size: 32, offset: 1056)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !828, file: !820, line: 137, baseType: !322, size: 32, offset: 1088)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !828, file: !820, line: 137, baseType: !322, size: 32, offset: 1120)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !828, file: !820, line: 138, baseType: !278, size: 32, offset: 1152)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !828, file: !820, line: 139, baseType: !278, size: 32, offset: 1184)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !828, file: !820, line: 139, baseType: !278, size: 32, offset: 1216)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !828, file: !820, line: 141, baseType: !320, size: 16, offset: 1248)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !828, file: !820, line: 142, baseType: !320, size: 16, offset: 1264)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !828, file: !820, line: 143, baseType: !322, size: 32, offset: 1280)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !828, file: !820, line: 144, baseType: !322, size: 32, offset: 1312)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !828, file: !820, line: 146, baseType: !856, size: 64, offset: 1344)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !820, line: 114, baseType: !858)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !820, line: 99, size: 7232, elements: !859)
!859 = !{!860, !862, !863, !864, !865, !866, !867, !878, !882, !896, !905, !912, !922}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !858, file: !820, line: 100, baseType: !861, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !858, file: !820, line: 100, baseType: !861, size: 64, offset: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !858, file: !820, line: 101, baseType: !322, size: 32, offset: 128)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !858, file: !820, line: 101, baseType: !322, size: 32, offset: 160)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !858, file: !820, line: 102, baseType: !322, size: 32, offset: 192)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !858, file: !820, line: 102, baseType: !322, size: 32, offset: 224)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !858, file: !820, line: 103, baseType: !868, size: 64, offset: 256)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !820, line: 59, baseType: !870)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !820, line: 56, size: 2112, elements: !871)
!871 = !{!872, !876, !877}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !870, file: !820, line: 57, baseType: !873, size: 2048)
!873 = !DICompositeType(tag: DW_TAG_array_type, baseType: !307, size: 2048, elements: !874)
!874 = !{!875}
!875 = !DISubrange(count: 256)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !870, file: !820, line: 58, baseType: !322, size: 32, offset: 2048)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !870, file: !820, line: 58, baseType: !322, size: 32, offset: 2080)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !858, file: !820, line: 106, baseType: !879, size: 6144, offset: 320)
!879 = !DICompositeType(tag: DW_TAG_array_type, baseType: !307, size: 6144, elements: !880)
!880 = !{!881}
!881 = !DISubrange(count: 768)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !858, file: !820, line: 107, baseType: !883, size: 64, offset: 6464)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !820, line: 97, baseType: !885)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !820, line: 83, size: 8320, elements: !886)
!886 = !{!887, !888, !889, !892, !893, !894, !895}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !885, file: !820, line: 84, baseType: !879, size: 6144)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !885, file: !820, line: 87, baseType: !873, size: 2048, offset: 6144)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !885, file: !820, line: 88, baseType: !890, size: 64, offset: 8192)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !242, line: 41, flags: DIFlagFwdDecl)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !885, file: !820, line: 90, baseType: !320, size: 16, offset: 8256)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !885, file: !820, line: 92, baseType: !320, size: 16, offset: 8272)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !885, file: !820, line: 93, baseType: !320, size: 16, offset: 8288)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !885, file: !820, line: 95, baseType: !320, size: 16, offset: 8304)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !858, file: !820, line: 108, baseType: !897, size: 64, offset: 6528)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !820, line: 66, baseType: !899)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !820, line: 61, size: 128, elements: !900)
!900 = !{!901, !902, !903, !904}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !899, file: !820, line: 62, baseType: !322, size: 32)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !899, file: !820, line: 63, baseType: !322, size: 32, offset: 32)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !899, file: !820, line: 64, baseType: !322, size: 32, offset: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !899, file: !820, line: 65, baseType: !322, size: 32, offset: 96)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !858, file: !820, line: 109, baseType: !906, size: 64, offset: 6592)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !820, line: 71, baseType: !908)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !820, line: 68, size: 64, elements: !909)
!909 = !{!910, !911}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !908, file: !820, line: 69, baseType: !322, size: 32)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !908, file: !820, line: 70, baseType: !322, size: 32, offset: 32)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !858, file: !820, line: 110, baseType: !913, size: 64, offset: 6656)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !820, line: 81, baseType: !915)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !820, line: 73, size: 352, elements: !916)
!916 = !{!917, !918, !919, !920, !921}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !915, file: !820, line: 74, baseType: !404, size: 96)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !915, file: !820, line: 75, baseType: !404, size: 96, offset: 96)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !915, file: !820, line: 76, baseType: !404, size: 96, offset: 192)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !915, file: !820, line: 77, baseType: !322, size: 32, offset: 288)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !915, file: !820, line: 78, baseType: !322, size: 32, offset: 320)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !858, file: !820, line: 113, baseType: !923, size: 512, offset: 6720)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !4, line: 182, baseType: !924)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !4, line: 180, size: 512, elements: !925)
!925 = !{!926}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !924, file: !4, line: 181, baseType: !337, size: 512)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !828, file: !820, line: 148, baseType: !375, size: 64, offset: 1408)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !828, file: !820, line: 151, baseType: !706, size: 64, offset: 1472)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !828, file: !820, line: 152, baseType: !378, size: 64, offset: 1536)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !828, file: !820, line: 153, baseType: !931, size: 64, offset: 1600)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !933, line: 64, size: 19136, elements: !934)
!933 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!934 = !{!935, !936, !937, !938, !939, !940, !942, !943, !944, !945, !948, !949, !1251, !1252, !1260, !1261, !1262, !1263, !1264}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !932, file: !933, line: 65, baseType: !287, size: 960)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !932, file: !933, line: 66, baseType: !358, size: 64, offset: 960)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !932, file: !933, line: 68, baseType: !306, size: 8192, offset: 1024)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !932, file: !933, line: 70, baseType: !322, size: 32, offset: 9216)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !932, file: !933, line: 71, baseType: !322, size: 32, offset: 9248)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !932, file: !933, line: 72, baseType: !941, size: 64, offset: 9280)
!941 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 64, elements: !698)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !932, file: !933, line: 74, baseType: !278, size: 32, offset: 9344)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !932, file: !933, line: 74, baseType: !278, size: 32, offset: 9376)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !932, file: !933, line: 76, baseType: !890, size: 64, offset: 9408)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !932, file: !933, line: 77, baseType: !946, size: 64, offset: 9472)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !933, line: 77, flags: DIFlagFwdDecl)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !932, file: !933, line: 78, baseType: !536, size: 64, offset: 9536)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !932, file: !933, line: 80, baseType: !950, size: 2624, offset: 9600)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !951, line: 340, size: 2624, elements: !952)
!951 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!952 = !{!953, !981, !999, !1000, !1001, !1016, !1074, !1075, !1231, !1232, !1233, !1234, !1240}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !950, file: !951, line: 341, baseType: !954, size: 576)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !951, line: 251, baseType: !955)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !951, line: 207, size: 576, elements: !956)
!956 = !{!957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !955, file: !951, line: 208, baseType: !322, size: 32)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !955, file: !951, line: 211, baseType: !320, size: 16, offset: 32)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !955, file: !951, line: 212, baseType: !320, size: 16, offset: 48)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !955, file: !951, line: 213, baseType: !278, size: 32, offset: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !955, file: !951, line: 214, baseType: !320, size: 16, offset: 96)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !955, file: !951, line: 215, baseType: !320, size: 16, offset: 112)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !955, file: !951, line: 216, baseType: !320, size: 16, offset: 128)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !955, file: !951, line: 217, baseType: !320, size: 16, offset: 144)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !955, file: !951, line: 218, baseType: !320, size: 16, offset: 160)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !955, file: !951, line: 219, baseType: !320, size: 16, offset: 176)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !955, file: !951, line: 220, baseType: !278, size: 32, offset: 192)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !955, file: !951, line: 222, baseType: !320, size: 16, offset: 224)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !955, file: !951, line: 225, baseType: !320, size: 16, offset: 240)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !955, file: !951, line: 228, baseType: !322, size: 32, offset: 256)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !955, file: !951, line: 229, baseType: !322, size: 32, offset: 288)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !955, file: !951, line: 233, baseType: !322, size: 32, offset: 320)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !955, file: !951, line: 236, baseType: !320, size: 16, offset: 352)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !955, file: !951, line: 236, baseType: !320, size: 16, offset: 368)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !955, file: !951, line: 241, baseType: !278, size: 32, offset: 384)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !955, file: !951, line: 244, baseType: !322, size: 32, offset: 416)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !955, file: !951, line: 244, baseType: !322, size: 32, offset: 448)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !955, file: !951, line: 245, baseType: !278, size: 32, offset: 480)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !955, file: !951, line: 248, baseType: !278, size: 32, offset: 512)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !955, file: !951, line: 250, baseType: !322, size: 32, offset: 544)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !950, file: !951, line: 342, baseType: !982, size: 448, offset: 576)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !951, line: 79, baseType: !983)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !951, line: 61, size: 448, elements: !984)
!984 = !{!985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !983, file: !951, line: 62, baseType: !279, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !983, file: !951, line: 64, baseType: !320, size: 16, offset: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !983, file: !951, line: 65, baseType: !320, size: 16, offset: 80)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !983, file: !951, line: 67, baseType: !278, size: 32, offset: 96)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !983, file: !951, line: 68, baseType: !278, size: 32, offset: 128)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !983, file: !951, line: 69, baseType: !278, size: 32, offset: 160)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !983, file: !951, line: 70, baseType: !320, size: 16, offset: 192)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !983, file: !951, line: 71, baseType: !320, size: 16, offset: 208)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !983, file: !951, line: 72, baseType: !697, size: 64, offset: 224)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !983, file: !951, line: 75, baseType: !278, size: 32, offset: 288)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !983, file: !951, line: 75, baseType: !278, size: 32, offset: 320)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !983, file: !951, line: 75, baseType: !278, size: 32, offset: 352)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !983, file: !951, line: 78, baseType: !278, size: 32, offset: 384)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !983, file: !951, line: 78, baseType: !278, size: 32, offset: 416)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !950, file: !951, line: 343, baseType: !347, size: 128, offset: 1024)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !950, file: !951, line: 344, baseType: !347, size: 128, offset: 1152)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !950, file: !951, line: 345, baseType: !1002, size: 192, offset: 1280)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !951, line: 278, baseType: !1003)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !951, line: 270, size: 192, elements: !1004)
!1004 = !{!1005, !1006, !1007, !1008, !1009}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1003, file: !951, line: 271, baseType: !322, size: 32)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1003, file: !951, line: 273, baseType: !278, size: 32, offset: 32)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !1003, file: !951, line: 275, baseType: !322, size: 32, offset: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !1003, file: !951, line: 276, baseType: !322, size: 32, offset: 96)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !1003, file: !951, line: 277, baseType: !1010, size: 64, offset: 128)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !951, line: 55, size: 576, elements: !1012)
!1012 = !{!1013, !1014, !1015}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1011, file: !951, line: 56, baseType: !322, size: 32)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1011, file: !951, line: 57, baseType: !278, size: 32, offset: 32)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1011, file: !951, line: 58, baseType: !587, size: 512, offset: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !950, file: !951, line: 346, baseType: !1017, size: 384, offset: 1472)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !951, line: 268, baseType: !1018)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !951, line: 253, size: 384, elements: !1019)
!1019 = !{!1020, !1021, !1022, !1023, !1024, !1068, !1069, !1070, !1071, !1072, !1073}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1018, file: !951, line: 254, baseType: !322, size: 32)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !1018, file: !951, line: 255, baseType: !322, size: 32, offset: 32)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !1018, file: !951, line: 255, baseType: !322, size: 32, offset: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !1018, file: !951, line: 258, baseType: !278, size: 32, offset: 96)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !1018, file: !951, line: 259, baseType: !1025, size: 64, offset: 128)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !951, line: 164, baseType: !1027)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !951, line: 108, size: 1664, elements: !1028)
!1028 = !{!1029, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1027, file: !951, line: 109, baseType: !1030, size: 64)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1027, file: !951, line: 109, baseType: !1030, size: 64, offset: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1027, file: !951, line: 111, baseType: !337, size: 512, offset: 128)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !1027, file: !951, line: 119, baseType: !697, size: 64, offset: 640)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !1027, file: !951, line: 119, baseType: !697, size: 64, offset: 704)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !1027, file: !951, line: 125, baseType: !697, size: 64, offset: 768)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !1027, file: !951, line: 125, baseType: !697, size: 64, offset: 832)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1027, file: !951, line: 127, baseType: !697, size: 64, offset: 896)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !1027, file: !951, line: 130, baseType: !322, size: 32, offset: 960)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !1027, file: !951, line: 131, baseType: !322, size: 32, offset: 992)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1027, file: !951, line: 132, baseType: !1041, size: 64, offset: 1024)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !951, line: 106, baseType: !1043)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !951, line: 81, size: 512, elements: !1044)
!1044 = !{!1045, !1046, !1049, !1050, !1051, !1052}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1043, file: !951, line: 82, baseType: !697, size: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !1043, file: !951, line: 97, baseType: !1047, size: 256, offset: 64)
!1047 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 256, elements: !1048)
!1048 = !{!580, !699}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !1043, file: !951, line: 102, baseType: !697, size: 64, offset: 320)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !1043, file: !951, line: 102, baseType: !697, size: 64, offset: 384)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1043, file: !951, line: 104, baseType: !322, size: 32, offset: 448)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1043, file: !951, line: 105, baseType: !322, size: 32, offset: 480)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !1027, file: !951, line: 135, baseType: !404, size: 96, offset: 1088)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1027, file: !951, line: 136, baseType: !278, size: 32, offset: 1184)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1027, file: !951, line: 139, baseType: !322, size: 32, offset: 1216)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !1027, file: !951, line: 139, baseType: !322, size: 32, offset: 1248)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !1027, file: !951, line: 139, baseType: !322, size: 32, offset: 1280)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !1027, file: !951, line: 140, baseType: !404, size: 96, offset: 1312)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !1027, file: !951, line: 143, baseType: !320, size: 16, offset: 1408)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !1027, file: !951, line: 144, baseType: !320, size: 16, offset: 1424)
