; ModuleID = 'blender/source/blender/blenkernel/intern/mask_rasterize.c'
source_filename = "blender/source/blender/blenkernel/intern/mask_rasterize.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.rctf = type { float, float, float, float }
%struct.MaskRasterHandle = type { %struct.MaskRasterLayer*, i32, %struct.rctf }
%struct.MaskRasterLayer = type { i32, [4 x i32]*, [3 x float]*, %struct.rctf, i32**, [2 x float], i32, i32, float, i8, i8, i8 }
%struct.Mask = type { %struct.ID, %struct.AnimData*, %struct.ListBase, i32, i32, i32, i32, i32, i32 }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.FileData = type opaque
%struct.PackedFile = type opaque
%struct.IDProperty = type { %struct.IDProperty*, %struct.IDProperty*, i8, i8, i16, [64 x i8], i32, %struct.IDPropertyData, i32, i32 }
%struct.IDPropertyData = type { i8*, %struct.ListBase, i32, i32 }
%struct.AnimData = type opaque
%struct.ListBase = type { i8*, i8* }
%struct.MaskLayer = type { %struct.MaskLayer*, %struct.MaskLayer*, [64 x i8], %struct.ListBase, %struct.ListBase, %struct.MaskSpline*, %struct.MaskSplinePoint*, float, i8, i8, i8, [7 x i8], i8, i8 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !38, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/blenkernel/intern/mask_rasterize.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !10, !16, !24, !35}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 155, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "blender/source/blender/makesdna/DNA_mask_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9}
!7 = !DIEnumerator(name: "MASK_SPLINE_CYCLIC", value: 2, isUnsigned: true)
!8 = !DIEnumerator(name: "MASK_SPLINE_NOFILL", value: 4, isUnsigned: true)
!9 = !DIEnumerator(name: "MASK_SPLINE_NOINTERSECT", value: 8, isUnsigned: true)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 217, baseType: !5, size: 32, elements: !11)
!11 = !{!12, !13, !14, !15}
!12 = !DIEnumerator(name: "MASK_LAYERFLAG_LOCKED", value: 16, isUnsigned: true)
!13 = !DIEnumerator(name: "MASK_LAYERFLAG_SELECT", value: 32, isUnsigned: true)
!14 = !DIEnumerator(name: "MASK_LAYERFLAG_FILL_DISCRETE", value: 64, isUnsigned: true)
!15 = !DIEnumerator(name: "MASK_LAYERFLAG_FILL_OVERLAP", value: 128, isUnsigned: true)
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !17, line: 103, baseType: !5, size: 32, elements: !18)
!17 = !DIFile(filename: "blender/source/blender/blenlib/BLI_scanfill.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!18 = !{!19, !20, !21, !22, !23}
!19 = !DIEnumerator(name: "BLI_SCANFILL_CALC_QUADTRI_FASTPATH", value: 1, isUnsigned: true)
!20 = !DIEnumerator(name: "BLI_SCANFILL_CALC_REMOVE_DOUBLES", value: 2, isUnsigned: true)
!21 = !DIEnumerator(name: "BLI_SCANFILL_CALC_POLYS", value: 4, isUnsigned: true)
!22 = !DIEnumerator(name: "BLI_SCANFILL_CALC_HOLES", value: 8, isUnsigned: true)
!23 = !DIEnumerator(name: "BLI_SCANFILL_CALC_LOOSE", value: 16, isUnsigned: true)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 199, baseType: !5, size: 32, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34}
!26 = !DIEnumerator(name: "MASK_BLEND_ADD", value: 0, isUnsigned: true)
!27 = !DIEnumerator(name: "MASK_BLEND_SUBTRACT", value: 1, isUnsigned: true)
!28 = !DIEnumerator(name: "MASK_BLEND_LIGHTEN", value: 2, isUnsigned: true)
!29 = !DIEnumerator(name: "MASK_BLEND_DARKEN", value: 3, isUnsigned: true)
!30 = !DIEnumerator(name: "MASK_BLEND_MUL", value: 4, isUnsigned: true)
!31 = !DIEnumerator(name: "MASK_BLEND_REPLACE", value: 5, isUnsigned: true)
!32 = !DIEnumerator(name: "MASK_BLEND_DIFFERENCE", value: 6, isUnsigned: true)
!33 = !DIEnumerator(name: "MASK_BLEND_MERGE_ADD", value: 7, isUnsigned: true)
!34 = !DIEnumerator(name: "MASK_BLEND_MERGE_SUBTRACT", value: 8, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 212, baseType: !5, size: 32, elements: !36)
!36 = !{!37}
!37 = !DIEnumerator(name: "MASK_BLENDFLAG_INVERT", value: 1, isUnsigned: true)
!38 = !{!39, !5, !40, !43, !44, !45, !46}
!39 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !41, line: 46, baseType: !42)
!41 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!42 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !47, line: 90, baseType: !42)
!47 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!48 = !{i32 7, !"Dwarf Version", i32 4}
!49 = !{i32 2, !"Debug Info Version", i32 3}
!50 = !{i32 1, !"wchar_size", i32 4}
!51 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!52 = distinct !DISubprogram(name: "BKE_maskrasterize_handle_new", scope: !1, file: !1, line: 214, type: !53, scopeLine: 215, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !100)
!53 = !DISubroutineType(types: !54)
!54 = !{!55}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "MaskRasterHandle", file: !57, line: 233, baseType: !58)
!57 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_mask.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MaskRasterHandle", file: !1, line: 202, size: 256, elements: !59)
!59 = !{!60, !98, !99}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !58, file: !1, line: 203, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "MaskRasterLayer", file: !1, line: 185, baseType: !63)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MaskRasterLayer", file: !1, line: 159, size: 576, elements: !64)
!64 = !{!65, !66, !71, !76, !85, !87, !91, !92, !93, !94, !96, !97}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "face_tot", scope: !63, file: !1, line: 161, baseType: !5, size: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "face_array", scope: !63, file: !1, line: 162, baseType: !67, size: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 128, elements: !69)
!69 = !{!70}
!70 = !DISubrange(count: 4)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "face_coords", scope: !63, file: !1, line: 163, baseType: !72, size: 64, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 96, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 3)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !63, file: !1, line: 167, baseType: !77, size: 128, offset: 192)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !78, line: 95, baseType: !79)
!78 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !78, line: 92, size: 128, elements: !80)
!80 = !{!81, !82, !83, !84}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !79, file: !78, line: 93, baseType: !39, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !79, file: !78, line: 93, baseType: !39, size: 32, offset: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !79, file: !78, line: 94, baseType: !39, size: 32, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !79, file: !78, line: 94, baseType: !39, size: 32, offset: 96)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "buckets_face", scope: !63, file: !1, line: 171, baseType: !86, size: 64, offset: 320)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "buckets_xy_scalar", scope: !63, file: !1, line: 173, baseType: !88, size: 64, offset: 384)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 64, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 2)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "buckets_x", scope: !63, file: !1, line: 174, baseType: !5, size: 32, offset: 448)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "buckets_y", scope: !63, file: !1, line: 175, baseType: !5, size: 32, offset: 480)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !63, file: !1, line: 180, baseType: !39, size: 32, offset: 512)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "blend", scope: !63, file: !1, line: 181, baseType: !95, size: 8, offset: 544)
!95 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "blend_flag", scope: !63, file: !1, line: 182, baseType: !95, size: 8, offset: 552)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "falloff", scope: !63, file: !1, line: 183, baseType: !95, size: 8, offset: 560)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "layers_tot", scope: !58, file: !1, line: 204, baseType: !5, size: 32, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !58, file: !1, line: 207, baseType: !77, size: 128, offset: 96)
!100 = !{}
!101 = !DILocalVariable(name: "mr_handle", scope: !52, file: !1, line: 216, type: !55)
!102 = !DILocation(line: 216, column: 20, scope: !52)
!103 = !DILocation(line: 218, column: 14, scope: !52)
!104 = !DILocation(line: 218, column: 12, scope: !52)
!105 = !DILocation(line: 220, column: 9, scope: !52)
!106 = !DILocation(line: 220, column: 2, scope: !52)
!107 = distinct !DISubprogram(name: "BKE_maskrasterize_handle_free", scope: !1, file: !1, line: 223, type: !108, scopeLine: 224, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !100)
!108 = !DISubroutineType(types: !109)
!109 = !{null, !55}
!110 = !DILocalVariable(name: "mr_handle", arg: 1, scope: !107, file: !1, line: 223, type: !55)
!111 = !DILocation(line: 223, column: 54, scope: !107)
!112 = !DILocalVariable(name: "layers_tot", scope: !107, file: !1, line: 225, type: !113)
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!114 = !DILocation(line: 225, column: 21, scope: !107)
!115 = !DILocation(line: 225, column: 34, scope: !107)
!116 = !DILocation(line: 225, column: 45, scope: !107)
!117 = !DILocalVariable(name: "i", scope: !107, file: !1, line: 226, type: !5)
!118 = !DILocation(line: 226, column: 15, scope: !107)
!119 = !DILocalVariable(name: "layer", scope: !107, file: !1, line: 227, type: !61)
!120 = !DILocation(line: 227, column: 19, scope: !107)
!121 = !DILocation(line: 227, column: 27, scope: !107)
!122 = !DILocation(line: 227, column: 38, scope: !107)
!123 = !DILocation(line: 229, column: 9, scope: !124)
!124 = distinct !DILexicalBlock(scope: !107, file: !1, line: 229, column: 2)
!125 = !DILocation(line: 229, column: 7, scope: !124)
!126 = !DILocation(line: 229, column: 14, scope: !127)
!127 = distinct !DILexicalBlock(scope: !124, file: !1, line: 229, column: 2)
!128 = !DILocation(line: 229, column: 18, scope: !127)
!129 = !DILocation(line: 229, column: 16, scope: !127)
!130 = !DILocation(line: 229, column: 2, scope: !124)
!131 = !DILocation(line: 231, column: 7, scope: !132)
!132 = distinct !DILexicalBlock(scope: !133, file: !1, line: 231, column: 7)
!133 = distinct !DILexicalBlock(scope: !127, file: !1, line: 229, column: 44)
!134 = !DILocation(line: 231, column: 14, scope: !132)
!135 = !DILocation(line: 231, column: 7, scope: !133)
!136 = !DILocation(line: 232, column: 4, scope: !137)
!137 = distinct !DILexicalBlock(scope: !132, file: !1, line: 231, column: 26)
!138 = !DILocation(line: 232, column: 14, scope: !137)
!139 = !DILocation(line: 232, column: 21, scope: !137)
!140 = !DILocation(line: 233, column: 3, scope: !137)
!141 = !DILocation(line: 235, column: 7, scope: !142)
!142 = distinct !DILexicalBlock(scope: !133, file: !1, line: 235, column: 7)
!143 = !DILocation(line: 235, column: 14, scope: !142)
!144 = !DILocation(line: 235, column: 7, scope: !133)
!145 = !DILocation(line: 236, column: 4, scope: !146)
!146 = distinct !DILexicalBlock(scope: !142, file: !1, line: 235, column: 27)
!147 = !DILocation(line: 236, column: 14, scope: !146)
!148 = !DILocation(line: 236, column: 21, scope: !146)
!149 = !DILocation(line: 237, column: 3, scope: !146)
!150 = !DILocation(line: 239, column: 7, scope: !151)
!151 = distinct !DILexicalBlock(scope: !133, file: !1, line: 239, column: 7)
!152 = !DILocation(line: 239, column: 14, scope: !151)
!153 = !DILocation(line: 239, column: 7, scope: !133)
!154 = !DILocalVariable(name: "bucket_tot", scope: !155, file: !1, line: 240, type: !113)
!155 = distinct !DILexicalBlock(scope: !151, file: !1, line: 239, column: 28)
!156 = !DILocation(line: 240, column: 25, scope: !155)
!157 = !DILocation(line: 240, column: 38, scope: !155)
!158 = !DILocation(line: 240, column: 45, scope: !155)
!159 = !DILocation(line: 240, column: 57, scope: !155)
!160 = !DILocation(line: 240, column: 64, scope: !155)
!161 = !DILocation(line: 240, column: 55, scope: !155)
!162 = !DILocalVariable(name: "bucket_index", scope: !155, file: !1, line: 241, type: !5)
!163 = !DILocation(line: 241, column: 17, scope: !155)
!164 = !DILocation(line: 242, column: 22, scope: !165)
!165 = distinct !DILexicalBlock(scope: !155, file: !1, line: 242, column: 4)
!166 = !DILocation(line: 242, column: 9, scope: !165)
!167 = !DILocation(line: 242, column: 27, scope: !168)
!168 = distinct !DILexicalBlock(scope: !165, file: !1, line: 242, column: 4)
!169 = !DILocation(line: 242, column: 42, scope: !168)
!170 = !DILocation(line: 242, column: 40, scope: !168)
!171 = !DILocation(line: 242, column: 4, scope: !165)
!172 = !DILocalVariable(name: "face_index", scope: !173, file: !1, line: 243, type: !44)
!173 = distinct !DILexicalBlock(scope: !168, file: !1, line: 242, column: 70)
!174 = !DILocation(line: 243, column: 19, scope: !173)
!175 = !DILocation(line: 243, column: 32, scope: !173)
!176 = !DILocation(line: 243, column: 39, scope: !173)
!177 = !DILocation(line: 243, column: 52, scope: !173)
!178 = !DILocation(line: 244, column: 9, scope: !179)
!179 = distinct !DILexicalBlock(scope: !173, file: !1, line: 244, column: 9)
!180 = !DILocation(line: 244, column: 9, scope: !173)
!181 = !DILocation(line: 245, column: 6, scope: !182)
!182 = distinct !DILexicalBlock(scope: !179, file: !1, line: 244, column: 21)
!183 = !DILocation(line: 245, column: 16, scope: !182)
!184 = !DILocation(line: 246, column: 5, scope: !182)
!185 = !DILocation(line: 247, column: 4, scope: !173)
!186 = !DILocation(line: 242, column: 66, scope: !168)
!187 = !DILocation(line: 242, column: 4, scope: !168)
!188 = distinct !{!188, !171, !189}
!189 = !DILocation(line: 247, column: 4, scope: !165)
!190 = !DILocation(line: 249, column: 4, scope: !155)
!191 = !DILocation(line: 249, column: 14, scope: !155)
!192 = !DILocation(line: 249, column: 21, scope: !155)
!193 = !DILocation(line: 250, column: 3, scope: !155)
!194 = !DILocation(line: 251, column: 2, scope: !133)
!195 = !DILocation(line: 229, column: 31, scope: !127)
!196 = !DILocation(line: 229, column: 40, scope: !127)
!197 = !DILocation(line: 229, column: 2, scope: !127)
!198 = distinct !{!198, !130, !199}
!199 = !DILocation(line: 251, column: 2, scope: !124)
!200 = !DILocation(line: 253, column: 2, scope: !107)
!201 = !DILocation(line: 253, column: 12, scope: !107)
!202 = !DILocation(line: 253, column: 23, scope: !107)
!203 = !DILocation(line: 254, column: 2, scope: !107)
!204 = !DILocation(line: 254, column: 12, scope: !107)
!205 = !DILocation(line: 255, column: 1, scope: !107)
!206 = distinct !DISubprogram(name: "BKE_maskrasterize_handle_init", scope: !1, file: !1, line: 560, type: !207, scopeLine: 564, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !100)
!207 = !DISubroutineType(types: !208)
!208 = !{null, !55, !209, !293, !293, !294, !294, !294}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !4, line: 46, size: 1344, elements: !211)
!211 = !{!212, !282, !286, !287, !288, !289, !290, !291, !292}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !210, file: !4, line: 47, baseType: !213, size: 960)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !214, line: 130, baseType: !215)
!214 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !214, line: 117, size: 960, elements: !216)
!216 = !{!217, !218, !219, !221, !240, !244, !246, !248, !249, !250}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !215, file: !214, line: 118, baseType: !45, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !215, file: !214, line: 118, baseType: !45, size: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !215, file: !214, line: 119, baseType: !220, size: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !215, file: !214, line: 120, baseType: !222, size: 64, offset: 192)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !214, line: 136, size: 17600, elements: !224)
!224 = !{!225, !226, !228, !231, !235, !236, !237}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !223, file: !214, line: 137, baseType: !213, size: 960)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !223, file: !214, line: 138, baseType: !227, size: 64, offset: 960)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !223, file: !214, line: 139, baseType: !229, size: 64, offset: 1024)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !214, line: 43, flags: DIFlagFwdDecl)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !223, file: !214, line: 140, baseType: !232, size: 8192, offset: 1088)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 8192, elements: !233)
!233 = !{!234}
!234 = !DISubrange(count: 1024)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !223, file: !214, line: 141, baseType: !232, size: 8192, offset: 9280)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !223, file: !214, line: 148, baseType: !222, size: 64, offset: 17472)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !223, file: !214, line: 150, baseType: !238, size: 64, offset: 17536)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !214, line: 45, flags: DIFlagFwdDecl)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !215, file: !214, line: 121, baseType: !241, size: 528, offset: 256)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 528, elements: !242)
!242 = !{!243}
!243 = !DISubrange(count: 66)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !215, file: !214, line: 126, baseType: !245, size: 16, offset: 784)
!245 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !215, file: !214, line: 127, baseType: !247, size: 32, offset: 800)
!247 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !215, file: !214, line: 128, baseType: !247, size: 32, offset: 832)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !215, file: !214, line: 128, baseType: !247, size: 32, offset: 864)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !215, file: !214, line: 129, baseType: !251, size: 64, offset: 896)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !214, line: 75, baseType: !253)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !214, line: 62, size: 1024, elements: !254)
!254 = !{!255, !257, !258, !259, !260, !261, !265, !266, !280, !281}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !253, file: !214, line: 63, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !253, file: !214, line: 63, baseType: !256, size: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !253, file: !214, line: 64, baseType: !95, size: 8, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !253, file: !214, line: 64, baseType: !95, size: 8, offset: 136)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !253, file: !214, line: 65, baseType: !245, size: 16, offset: 144)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !253, file: !214, line: 66, baseType: !262, size: 512, offset: 160)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 512, elements: !263)
!263 = !{!264}
!264 = !DISubrange(count: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !253, file: !214, line: 67, baseType: !247, size: 32, offset: 672)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !253, file: !214, line: 69, baseType: !267, size: 256, offset: 704)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !214, line: 60, baseType: !268)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !214, line: 48, size: 256, elements: !269)
!269 = !{!270, !271, !278, !279}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !268, file: !214, line: 49, baseType: !45, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !268, file: !214, line: 58, baseType: !272, size: 128, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !273, line: 71, baseType: !274)
!273 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !273, line: 69, size: 128, elements: !275)
!275 = !{!276, !277}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !274, file: !273, line: 70, baseType: !45, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !274, file: !273, line: 70, baseType: !45, size: 64, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !268, file: !214, line: 59, baseType: !247, size: 32, offset: 192)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !268, file: !214, line: 59, baseType: !247, size: 32, offset: 224)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !253, file: !214, line: 70, baseType: !247, size: 32, offset: 960)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !253, file: !214, line: 74, baseType: !247, size: 32, offset: 992)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !210, file: !4, line: 48, baseType: !283, size: 64, offset: 960)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !285, line: 48, flags: DIFlagFwdDecl)
!285 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!286 = !DIDerivedType(tag: DW_TAG_member, name: "masklayers", scope: !210, file: !4, line: 49, baseType: !272, size: 128, offset: 1024)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "masklay_act", scope: !210, file: !4, line: 50, baseType: !247, size: 32, offset: 1152)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "masklay_tot", scope: !210, file: !4, line: 51, baseType: !247, size: 32, offset: 1184)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !210, file: !4, line: 53, baseType: !247, size: 32, offset: 1216)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "efra", scope: !210, file: !4, line: 53, baseType: !247, size: 32, offset: 1248)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !210, file: !4, line: 55, baseType: !247, size: 32, offset: 1280)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !210, file: !4, line: 56, baseType: !247, size: 32, offset: 1312)
!293 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !247)
!294 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !295)
!295 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!296 = !DILocalVariable(name: "mr_handle", arg: 1, scope: !206, file: !1, line: 560, type: !55)
!297 = !DILocation(line: 560, column: 54, scope: !206)
!298 = !DILocalVariable(name: "mask", arg: 2, scope: !206, file: !1, line: 560, type: !209)
!299 = !DILocation(line: 560, column: 78, scope: !206)
!300 = !DILocalVariable(name: "width", arg: 3, scope: !206, file: !1, line: 561, type: !293)
!301 = !DILocation(line: 561, column: 46, scope: !206)
!302 = !DILocalVariable(name: "height", arg: 4, scope: !206, file: !1, line: 561, type: !293)
!303 = !DILocation(line: 561, column: 63, scope: !206)
!304 = !DILocalVariable(name: "do_aspect_correct", arg: 5, scope: !206, file: !1, line: 562, type: !294)
!305 = !DILocation(line: 562, column: 47, scope: !206)
!306 = !DILocalVariable(name: "do_mask_aa", arg: 6, scope: !206, file: !1, line: 562, type: !294)
!307 = !DILocation(line: 562, column: 77, scope: !206)
!308 = !DILocalVariable(name: "do_feather", arg: 7, scope: !206, file: !1, line: 563, type: !294)
!309 = !DILocation(line: 563, column: 47, scope: !206)
!310 = !DILocalVariable(name: "default_bounds", scope: !206, file: !1, line: 565, type: !311)
!311 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !77)
!312 = !DILocation(line: 565, column: 13, scope: !206)
!313 = !DILocalVariable(name: "pixel_size", scope: !206, file: !1, line: 566, type: !314)
!314 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!315 = !DILocation(line: 566, column: 14, scope: !206)
!316 = !DILocation(line: 566, column: 48, scope: !206)
!317 = !DILocation(line: 566, column: 55, scope: !206)
!318 = !DILocation(line: 566, column: 41, scope: !206)
!319 = !DILocation(line: 566, column: 34, scope: !206)
!320 = !DILocation(line: 566, column: 32, scope: !206)
!321 = !DILocalVariable(name: "asp_xy", scope: !206, file: !1, line: 567, type: !322)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 64, elements: !89)
!323 = !DILocation(line: 567, column: 14, scope: !206)
!324 = !DILocation(line: 567, column: 26, scope: !206)
!325 = !DILocation(line: 567, column: 28, scope: !206)
!326 = !DILocation(line: 567, column: 46, scope: !206)
!327 = !DILocation(line: 567, column: 49, scope: !206)
!328 = !DILocation(line: 567, column: 57, scope: !206)
!329 = !DILocation(line: 567, column: 55, scope: !206)
!330 = !DILocation(line: 567, column: 27, scope: !206)
!331 = !DILocation(line: 567, column: 74, scope: !206)
!332 = !DILocation(line: 567, column: 67, scope: !206)
!333 = !DILocation(line: 567, column: 90, scope: !206)
!334 = !DILocation(line: 567, column: 83, scope: !206)
!335 = !DILocation(line: 567, column: 81, scope: !206)
!336 = !DILocation(line: 568, column: 28, scope: !206)
!337 = !DILocation(line: 568, column: 46, scope: !206)
!338 = !DILocation(line: 568, column: 49, scope: !206)
!339 = !DILocation(line: 568, column: 57, scope: !206)
!340 = !DILocation(line: 568, column: 55, scope: !206)
!341 = !DILocation(line: 568, column: 27, scope: !206)
!342 = !DILocation(line: 568, column: 74, scope: !206)
!343 = !DILocation(line: 568, column: 67, scope: !206)
!344 = !DILocation(line: 568, column: 90, scope: !206)
!345 = !DILocation(line: 568, column: 83, scope: !206)
!346 = !DILocation(line: 568, column: 81, scope: !206)
!347 = !DILocalVariable(name: "zvec", scope: !206, file: !1, line: 570, type: !348)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 96, elements: !74)
!349 = !DILocation(line: 570, column: 14, scope: !206)
!350 = !DILocalVariable(name: "masklay", scope: !206, file: !1, line: 571, type: !351)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "MaskLayer", file: !4, line: 142, baseType: !353)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MaskLayer", file: !4, line: 122, size: 1152, elements: !354)
!354 = !{!355, !357, !358, !359, !360, !361, !424, !426, !427, !428, !429, !430, !434, !435}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !353, file: !4, line: 123, baseType: !356, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !353, file: !4, line: 123, baseType: !356, size: 64, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !353, file: !4, line: 125, baseType: !262, size: 512, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "splines", scope: !353, file: !4, line: 127, baseType: !272, size: 128, offset: 640)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "splines_shapes", scope: !353, file: !4, line: 128, baseType: !272, size: 128, offset: 768)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "act_spline", scope: !353, file: !4, line: 130, baseType: !362, size: 64, offset: 896)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MaskSpline", file: !4, line: 88, size: 1792, elements: !364)
!364 = !{!365, !366, !367, !368, !369, !370, !371, !422, !423}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !363, file: !4, line: 89, baseType: !362, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !363, file: !4, line: 89, baseType: !362, size: 64, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !363, file: !4, line: 91, baseType: !245, size: 16, offset: 128)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "offset_mode", scope: !363, file: !4, line: 92, baseType: !95, size: 8, offset: 144)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "weight_interp", scope: !363, file: !4, line: 93, baseType: !95, size: 8, offset: 152)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "tot_point", scope: !363, file: !4, line: 95, baseType: !247, size: 32, offset: 160)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !363, file: !4, line: 96, baseType: !372, size: 64, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "MaskSplinePoint", file: !4, line: 86, baseType: !374)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MaskSplinePoint", file: !4, line: 80, size: 2176, elements: !375)
!375 = !{!376, !399, !400, !401, !409}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "bezt", scope: !374, file: !4, line: 81, baseType: !377, size: 576)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "BezTriple", file: !285, line: 133, baseType: !378)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BezTriple", file: !285, line: 117, size: 576, elements: !379)
!379 = !{!380, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !378, file: !285, line: 118, baseType: !381, size: 288)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 288, elements: !382)
!382 = !{!75, !75}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "alfa", scope: !378, file: !285, line: 119, baseType: !39, size: 32, offset: 288)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !378, file: !285, line: 119, baseType: !39, size: 32, offset: 320)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !378, file: !285, line: 119, baseType: !39, size: 32, offset: 352)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !378, file: !285, line: 121, baseType: !95, size: 8, offset: 384)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "h1", scope: !378, file: !285, line: 123, baseType: !95, size: 8, offset: 392)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "h2", scope: !378, file: !285, line: 123, baseType: !95, size: 8, offset: 400)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "f1", scope: !378, file: !285, line: 124, baseType: !95, size: 8, offset: 408)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "f2", scope: !378, file: !285, line: 124, baseType: !95, size: 8, offset: 416)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "f3", scope: !378, file: !285, line: 124, baseType: !95, size: 8, offset: 424)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "hide", scope: !378, file: !285, line: 126, baseType: !95, size: 8, offset: 432)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "easing", scope: !378, file: !285, line: 128, baseType: !95, size: 8, offset: 440)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !378, file: !285, line: 129, baseType: !39, size: 32, offset: 448)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "amplitude", scope: !378, file: !285, line: 130, baseType: !39, size: 32, offset: 480)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !378, file: !285, line: 130, baseType: !39, size: 32, offset: 512)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !378, file: !285, line: 132, baseType: !398, size: 32, offset: 544)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 32, elements: !69)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !374, file: !4, line: 82, baseType: !247, size: 32, offset: 576)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "tot_uw", scope: !374, file: !4, line: 83, baseType: !247, size: 32, offset: 608)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "uw", scope: !374, file: !4, line: 84, baseType: !402, size: 64, offset: 640)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "MaskSplinePointUW", file: !4, line: 78, baseType: !404)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MaskSplinePointUW", file: !4, line: 75, size: 96, elements: !405)
!405 = !{!406, !407, !408}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !404, file: !4, line: 76, baseType: !39, size: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !404, file: !4, line: 76, baseType: !39, size: 32, offset: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !404, file: !4, line: 77, baseType: !247, size: 32, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !374, file: !4, line: 85, baseType: !410, size: 1472, offset: 704)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "MaskParent", file: !4, line: 73, baseType: !411)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MaskParent", file: !4, line: 59, size: 1472, elements: !412)
!412 = !{!413, !414, !415, !416, !417, !418, !419}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "id_type", scope: !411, file: !4, line: 61, baseType: !247, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !411, file: !4, line: 62, baseType: !247, size: 32, offset: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !411, file: !4, line: 63, baseType: !227, size: 64, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !411, file: !4, line: 65, baseType: !262, size: 512, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "sub_parent", scope: !411, file: !4, line: 67, baseType: !262, size: 512, offset: 640)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "parent_orig", scope: !411, file: !4, line: 69, baseType: !88, size: 64, offset: 1152)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "parent_corners_orig", scope: !411, file: !4, line: 72, baseType: !420, size: 256, offset: 1216)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 256, elements: !421)
!421 = !{!70, !90}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !363, file: !4, line: 97, baseType: !410, size: 1472, offset: 256)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "points_deform", scope: !363, file: !4, line: 99, baseType: !372, size: 64, offset: 1728)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "act_point", scope: !353, file: !4, line: 131, baseType: !425, size: 64, offset: 960)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !353, file: !4, line: 134, baseType: !39, size: 32, offset: 1024)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "blend", scope: !353, file: !4, line: 135, baseType: !95, size: 8, offset: 1056)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "blend_flag", scope: !353, file: !4, line: 136, baseType: !95, size: 8, offset: 1064)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "falloff", scope: !353, file: !4, line: 137, baseType: !95, size: 8, offset: 1072)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !353, file: !4, line: 138, baseType: !431, size: 56, offset: 1080)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 56, elements: !432)
!432 = !{!433}
!433 = !DISubrange(count: 7)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !353, file: !4, line: 140, baseType: !95, size: 8, offset: 1136)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !353, file: !4, line: 141, baseType: !95, size: 8, offset: 1144)
!436 = !DILocation(line: 571, column: 13, scope: !206)
!437 = !DILocalVariable(name: "masklay_index", scope: !206, file: !1, line: 572, type: !5)
!438 = !DILocation(line: 572, column: 15, scope: !206)
!439 = !DILocalVariable(name: "sf_arena", scope: !206, file: !1, line: 573, type: !440)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "MemArena", file: !442, line: 53, baseType: !443)
!442 = !DIFile(filename: "blender/source/blender/blenlib/BLI_memarena.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!443 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !17, line: 54, flags: DIFlagFwdDecl)
!444 = !DILocation(line: 573, column: 12, scope: !206)
!445 = !DILocation(line: 575, column: 55, scope: !206)
!446 = !DILocation(line: 575, column: 61, scope: !206)
!447 = !DILocation(line: 575, column: 40, scope: !206)
!448 = !DILocation(line: 575, column: 2, scope: !206)
!449 = !DILocation(line: 575, column: 13, scope: !206)
!450 = !DILocation(line: 575, column: 24, scope: !206)
!451 = !DILocation(line: 576, column: 22, scope: !206)
!452 = !DILocation(line: 576, column: 60, scope: !206)
!453 = !DILocation(line: 576, column: 71, scope: !206)
!454 = !DILocation(line: 576, column: 58, scope: !206)
!455 = !DILocation(line: 576, column: 2, scope: !206)
!456 = !DILocation(line: 576, column: 13, scope: !206)
!457 = !DILocation(line: 576, column: 20, scope: !206)
!458 = !DILocation(line: 577, column: 24, scope: !206)
!459 = !DILocation(line: 577, column: 35, scope: !206)
!460 = !DILocation(line: 577, column: 2, scope: !206)
!461 = !DILocation(line: 579, column: 13, scope: !206)
!462 = !DILocation(line: 579, column: 11, scope: !206)
!463 = !DILocation(line: 581, column: 17, scope: !464)
!464 = distinct !DILexicalBlock(scope: !206, file: !1, line: 581, column: 2)
!465 = !DILocation(line: 581, column: 23, scope: !464)
!466 = !DILocation(line: 581, column: 34, scope: !464)
!467 = !DILocation(line: 581, column: 15, scope: !464)
!468 = !DILocation(line: 581, column: 55, scope: !464)
!469 = !DILocation(line: 581, column: 7, scope: !464)
!470 = !DILocation(line: 581, column: 60, scope: !471)
!471 = distinct !DILexicalBlock(scope: !464, file: !1, line: 581, column: 2)
!472 = !DILocation(line: 581, column: 2, scope: !464)
!473 = !DILocalVariable(name: "tot_splines", scope: !474, file: !1, line: 584, type: !5)
!474 = distinct !DILexicalBlock(scope: !471, file: !1, line: 581, column: 111)
!475 = !DILocation(line: 584, column: 16, scope: !474)
!476 = !DILocalVariable(name: "open_spline_ranges", scope: !474, file: !1, line: 585, type: !477)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "MaskRasterSplineInfo", file: !1, line: 197, baseType: !479)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MaskRasterSplineInfo", file: !1, line: 187, size: 160, elements: !480)
!480 = !{!481, !482, !483, !484, !485}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "vertex_offset", scope: !479, file: !1, line: 189, baseType: !5, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "vertex_total", scope: !479, file: !1, line: 190, baseType: !5, size: 32, offset: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "vertex_total_cap_head", scope: !479, file: !1, line: 193, baseType: !5, size: 32, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "vertex_total_cap_tail", scope: !479, file: !1, line: 194, baseType: !5, size: 32, offset: 96)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "is_cyclic", scope: !479, file: !1, line: 196, baseType: !295, size: 8, offset: 128)
!486 = !DILocation(line: 585, column: 25, scope: !474)
!487 = !DILocalVariable(name: "open_spline_index", scope: !474, file: !1, line: 586, type: !5)
!488 = !DILocation(line: 586, column: 18, scope: !474)
!489 = !DILocalVariable(name: "spline", scope: !474, file: !1, line: 588, type: !490)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "MaskSpline", file: !4, line: 100, baseType: !363)
!492 = !DILocation(line: 588, column: 15, scope: !474)
!493 = !DILocalVariable(name: "sf_ctx", scope: !474, file: !1, line: 591, type: !494)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScanFillContext", file: !17, line: 55, baseType: !495)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScanFillContext", file: !17, line: 44, size: 512, elements: !496)
!496 = !{!497, !498, !499, !500, !502}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "fillvertbase", scope: !495, file: !17, line: 45, baseType: !272, size: 128)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "filledgebase", scope: !495, file: !17, line: 46, baseType: !272, size: 128, offset: 128)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "fillfacebase", scope: !495, file: !17, line: 47, baseType: !272, size: 128, offset: 256)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "poly_nr", scope: !495, file: !17, line: 51, baseType: !501, size: 16, offset: 384)
!501 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !495, file: !17, line: 54, baseType: !503, size: 64, offset: 448)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!504 = !DILocation(line: 591, column: 19, scope: !474)
!505 = !DILocalVariable(name: "sf_vert", scope: !474, file: !1, line: 592, type: !506)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScanFillVert", file: !17, line: 81, baseType: !508)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScanFillVert", file: !17, line: 66, size: 448, elements: !509)
!509 = !{!510, !512, !513, !520, !521, !522, !523, !524, !525, !526}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !508, file: !17, line: 67, baseType: !511, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !508, file: !17, line: 67, baseType: !511, size: 64, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !508, file: !17, line: 73, baseType: !514, size: 64, offset: 128)
!514 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !508, file: !17, line: 68, size: 64, elements: !515)
!515 = !{!516, !517, !518, !519}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !514, file: !17, line: 69, baseType: !511, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !514, file: !17, line: 70, baseType: !45, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !514, file: !17, line: 71, baseType: !247, size: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !514, file: !17, line: 72, baseType: !5, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !508, file: !17, line: 74, baseType: !73, size: 96, offset: 192)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "xy", scope: !508, file: !17, line: 75, baseType: !88, size: 64, offset: 288)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "keyindex", scope: !508, file: !17, line: 76, baseType: !5, size: 32, offset: 352)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "poly_nr", scope: !508, file: !17, line: 77, baseType: !501, size: 16, offset: 384)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "edge_tot", scope: !508, file: !17, line: 78, baseType: !295, size: 8, offset: 400)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !508, file: !17, line: 79, baseType: !5, size: 4, offset: 408, flags: DIFlagBitField, extraData: i64 408)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "user_flag", scope: !508, file: !17, line: 80, baseType: !5, size: 4, offset: 412, flags: DIFlagBitField, extraData: i64 408)
!527 = !DILocation(line: 592, column: 17, scope: !474)
!528 = !DILocalVariable(name: "sf_vert_next", scope: !474, file: !1, line: 593, type: !506)
!529 = !DILocation(line: 593, column: 17, scope: !474)
!530 = !DILocalVariable(name: "sf_tri", scope: !474, file: !1, line: 594, type: !531)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScanFillFace", file: !17, line: 97, baseType: !533)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScanFillFace", file: !17, line: 94, size: 320, elements: !534)
!534 = !{!535, !537, !538, !539, !540}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !533, file: !17, line: 95, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !533, file: !17, line: 95, baseType: !536, size: 64, offset: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !533, file: !17, line: 96, baseType: !511, size: 64, offset: 128)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !533, file: !17, line: 96, baseType: !511, size: 64, offset: 192)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !533, file: !17, line: 96, baseType: !511, size: 64, offset: 256)
!541 = !DILocation(line: 594, column: 17, scope: !474)
!542 = !DILocalVariable(name: "sf_vert_tot", scope: !474, file: !1, line: 596, type: !5)
!543 = !DILocation(line: 596, column: 16, scope: !474)
!544 = !DILocalVariable(name: "tot_feather_quads", scope: !474, file: !1, line: 597, type: !5)
!545 = !DILocation(line: 597, column: 16, scope: !474)
!546 = !DILocalVariable(name: "tot_boundary_used", scope: !474, file: !1, line: 600, type: !5)
!547 = !DILocation(line: 600, column: 16, scope: !474)
!548 = !DILocalVariable(name: "tot_boundary_found", scope: !474, file: !1, line: 601, type: !5)
!549 = !DILocation(line: 601, column: 16, scope: !474)
!550 = !DILocation(line: 604, column: 7, scope: !551)
!551 = distinct !DILexicalBlock(scope: !474, file: !1, line: 604, column: 7)
!552 = !DILocation(line: 604, column: 16, scope: !551)
!553 = !DILocation(line: 604, column: 29, scope: !551)
!554 = !DILocation(line: 604, column: 7, scope: !474)
!555 = !DILocation(line: 606, column: 4, scope: !556)
!556 = distinct !DILexicalBlock(scope: !551, file: !1, line: 604, column: 53)
!557 = !DILocation(line: 606, column: 15, scope: !556)
!558 = !DILocation(line: 606, column: 25, scope: !556)
!559 = !DILocation(line: 607, column: 17, scope: !556)
!560 = !DILocation(line: 608, column: 4, scope: !556)
!561 = !DILocation(line: 611, column: 46, scope: !474)
!562 = !DILocation(line: 611, column: 55, scope: !474)
!563 = !DILocation(line: 611, column: 31, scope: !474)
!564 = !DILocation(line: 611, column: 15, scope: !474)
!565 = !DILocation(line: 612, column: 24, scope: !474)
!566 = !DILocation(line: 612, column: 66, scope: !474)
!567 = !DILocation(line: 612, column: 64, scope: !474)
!568 = !DILocation(line: 612, column: 22, scope: !474)
!569 = !DILocation(line: 614, column: 37, scope: !474)
!570 = !DILocation(line: 614, column: 3, scope: !474)
!571 = !DILocation(line: 616, column: 17, scope: !572)
!572 = distinct !DILexicalBlock(scope: !474, file: !1, line: 616, column: 3)
!573 = !DILocation(line: 616, column: 26, scope: !572)
!574 = !DILocation(line: 616, column: 34, scope: !572)
!575 = !DILocation(line: 616, column: 15, scope: !572)
!576 = !DILocation(line: 616, column: 8, scope: !572)
!577 = !DILocation(line: 616, column: 41, scope: !578)
!578 = distinct !DILexicalBlock(scope: !572, file: !1, line: 616, column: 3)
!579 = !DILocation(line: 616, column: 3, scope: !572)
!580 = !DILocalVariable(name: "is_cyclic", scope: !581, file: !1, line: 617, type: !294)
!581 = distinct !DILexicalBlock(scope: !578, file: !1, line: 616, column: 72)
!582 = !DILocation(line: 617, column: 15, scope: !581)
!583 = !DILocation(line: 617, column: 28, scope: !581)
!584 = !DILocation(line: 617, column: 36, scope: !581)
!585 = !DILocation(line: 617, column: 41, scope: !581)
!586 = !DILocation(line: 617, column: 63, scope: !581)
!587 = !DILocation(line: 617, column: 27, scope: !581)
!588 = !DILocalVariable(name: "is_fill", scope: !581, file: !1, line: 618, type: !294)
!589 = !DILocation(line: 618, column: 15, scope: !581)
!590 = !DILocation(line: 618, column: 26, scope: !581)
!591 = !DILocation(line: 618, column: 34, scope: !581)
!592 = !DILocation(line: 618, column: 39, scope: !581)
!593 = !DILocation(line: 618, column: 61, scope: !581)
!594 = !DILocation(line: 618, column: 25, scope: !581)
!595 = !DILocalVariable(name: "diff_points", scope: !581, file: !1, line: 620, type: !596)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!597 = !DILocation(line: 620, column: 12, scope: !581)
!598 = !DILocalVariable(name: "tot_diff_point", scope: !581, file: !1, line: 621, type: !5)
!599 = !DILocation(line: 621, column: 17, scope: !581)
!600 = !DILocalVariable(name: "diff_feather_points", scope: !581, file: !1, line: 623, type: !596)
!601 = !DILocation(line: 623, column: 12, scope: !581)
!602 = !DILocalVariable(name: "diff_feather_points_flip", scope: !581, file: !1, line: 624, type: !596)
!603 = !DILocation(line: 624, column: 12, scope: !581)
!604 = !DILocalVariable(name: "tot_diff_feather_points", scope: !581, file: !1, line: 625, type: !5)
!605 = !DILocation(line: 625, column: 17, scope: !581)
!606 = !DILocalVariable(name: "resol_a", scope: !581, file: !1, line: 627, type: !113)
!607 = !DILocation(line: 627, column: 23, scope: !581)
!608 = !DILocation(line: 627, column: 60, scope: !581)
!609 = !DILocation(line: 627, column: 68, scope: !581)
!610 = !DILocation(line: 627, column: 75, scope: !581)
!611 = !DILocation(line: 627, column: 33, scope: !581)
!612 = !DILocation(line: 627, column: 83, scope: !581)
!613 = !DILocalVariable(name: "resol_b", scope: !581, file: !1, line: 628, type: !113)
!614 = !DILocation(line: 628, column: 23, scope: !581)
!615 = !DILocation(line: 628, column: 68, scope: !581)
!616 = !DILocation(line: 628, column: 76, scope: !581)
!617 = !DILocation(line: 628, column: 83, scope: !581)
!618 = !DILocation(line: 628, column: 33, scope: !581)
!619 = !DILocation(line: 628, column: 91, scope: !581)
!620 = !DILocalVariable(name: "resol", scope: !581, file: !1, line: 629, type: !113)
!621 = !DILocation(line: 629, column: 23, scope: !581)
!622 = !DILocation(line: 629, column: 31, scope: !581)
!623 = !DILocation(line: 632, column: 22, scope: !581)
!624 = !DILocation(line: 632, column: 47, scope: !581)
!625 = !DILocation(line: 631, column: 18, scope: !581)
!626 = !DILocation(line: 631, column: 16, scope: !581)
!627 = !DILocation(line: 634, column: 8, scope: !628)
!628 = distinct !DILexicalBlock(scope: !581, file: !1, line: 634, column: 8)
!629 = !DILocation(line: 634, column: 8, scope: !581)
!630 = !DILocation(line: 636, column: 31, scope: !631)
!631 = distinct !DILexicalBlock(scope: !628, file: !1, line: 634, column: 20)
!632 = !DILocation(line: 636, column: 65, scope: !631)
!633 = !DILocation(line: 635, column: 27, scope: !631)
!634 = !DILocation(line: 635, column: 25, scope: !631)
!635 = !DILocation(line: 638, column: 4, scope: !631)
!636 = !DILocation(line: 640, column: 29, scope: !637)
!637 = distinct !DILexicalBlock(scope: !628, file: !1, line: 639, column: 9)
!638 = !DILocation(line: 641, column: 25, scope: !637)
!639 = !DILocation(line: 644, column: 8, scope: !640)
!640 = distinct !DILexicalBlock(scope: !581, file: !1, line: 644, column: 8)
!641 = !DILocation(line: 644, column: 23, scope: !640)
!642 = !DILocation(line: 644, column: 8, scope: !581)
!643 = !DILocalVariable(name: "sf_vert_prev", scope: !644, file: !1, line: 645, type: !506)
!644 = distinct !DILexicalBlock(scope: !640, file: !1, line: 644, column: 28)
!645 = !DILocation(line: 645, column: 19, scope: !644)
!646 = !DILocalVariable(name: "j", scope: !644, file: !1, line: 646, type: !5)
!647 = !DILocation(line: 646, column: 18, scope: !644)
!648 = !DILocalVariable(name: "co", scope: !644, file: !1, line: 648, type: !73)
!649 = !DILocation(line: 648, column: 11, scope: !644)
!650 = !DILocation(line: 649, column: 5, scope: !644)
!651 = !DILocation(line: 649, column: 11, scope: !644)
!652 = !DILocation(line: 651, column: 12, scope: !644)
!653 = !DILocation(line: 651, column: 19, scope: !644)
!654 = !DILocation(line: 653, column: 9, scope: !655)
!655 = distinct !DILexicalBlock(scope: !644, file: !1, line: 653, column: 9)
!656 = !DILocation(line: 653, column: 9, scope: !644)
!657 = !DILocation(line: 654, column: 10, scope: !658)
!658 = distinct !DILexicalBlock(scope: !659, file: !1, line: 654, column: 10)
!659 = distinct !DILexicalBlock(scope: !655, file: !1, line: 653, column: 28)
!660 = !DILocation(line: 654, column: 19, scope: !658)
!661 = !DILocation(line: 654, column: 16, scope: !658)
!662 = !DILocation(line: 654, column: 10, scope: !659)
!663 = !DILocalVariable(name: "fp", scope: !664, file: !1, line: 655, type: !43)
!664 = distinct !DILexicalBlock(scope: !658, file: !1, line: 654, column: 27)
!665 = !DILocation(line: 655, column: 14, scope: !664)
!666 = !DILocalVariable(name: "ffp", scope: !664, file: !1, line: 656, type: !43)
!667 = !DILocation(line: 656, column: 14, scope: !664)
!668 = !DILocalVariable(name: "i", scope: !664, file: !1, line: 657, type: !5)
!669 = !DILocation(line: 657, column: 20, scope: !664)
!670 = !DILocalVariable(name: "asp", scope: !664, file: !1, line: 658, type: !39)
!671 = !DILocation(line: 658, column: 13, scope: !664)
!672 = !DILocation(line: 660, column: 11, scope: !673)
!673 = distinct !DILexicalBlock(scope: !664, file: !1, line: 660, column: 11)
!674 = !DILocation(line: 660, column: 19, scope: !673)
!675 = !DILocation(line: 660, column: 17, scope: !673)
!676 = !DILocation(line: 660, column: 11, scope: !664)
!677 = !DILocation(line: 661, column: 14, scope: !678)
!678 = distinct !DILexicalBlock(scope: !673, file: !1, line: 660, column: 27)
!679 = !DILocation(line: 661, column: 11, scope: !678)
!680 = !DILocation(line: 662, column: 14, scope: !678)
!681 = !DILocation(line: 662, column: 41, scope: !678)
!682 = !DILocation(line: 662, column: 12, scope: !678)
!683 = !DILocation(line: 663, column: 21, scope: !678)
!684 = !DILocation(line: 663, column: 14, scope: !678)
!685 = !DILocation(line: 663, column: 36, scope: !678)
!686 = !DILocation(line: 663, column: 29, scope: !678)
!687 = !DILocation(line: 663, column: 27, scope: !678)
!688 = !DILocation(line: 663, column: 12, scope: !678)
!689 = !DILocation(line: 664, column: 7, scope: !678)
!690 = !DILocation(line: 666, column: 14, scope: !691)
!691 = distinct !DILexicalBlock(scope: !673, file: !1, line: 665, column: 12)
!692 = !DILocation(line: 666, column: 11, scope: !691)
!693 = !DILocation(line: 667, column: 14, scope: !691)
!694 = !DILocation(line: 667, column: 41, scope: !691)
!695 = !DILocation(line: 667, column: 12, scope: !691)
!696 = !DILocation(line: 668, column: 21, scope: !691)
!697 = !DILocation(line: 668, column: 14, scope: !691)
!698 = !DILocation(line: 668, column: 37, scope: !691)
!699 = !DILocation(line: 668, column: 30, scope: !691)
!700 = !DILocation(line: 668, column: 28, scope: !691)
!701 = !DILocation(line: 668, column: 12, scope: !691)
!702 = !DILocation(line: 671, column: 14, scope: !703)
!703 = distinct !DILexicalBlock(scope: !664, file: !1, line: 671, column: 7)
!704 = !DILocation(line: 671, column: 12, scope: !703)
!705 = !DILocation(line: 671, column: 19, scope: !706)
!706 = distinct !DILexicalBlock(scope: !703, file: !1, line: 671, column: 7)
!707 = !DILocation(line: 671, column: 23, scope: !706)
!708 = !DILocation(line: 671, column: 21, scope: !706)
!709 = !DILocation(line: 671, column: 7, scope: !703)
!710 = !DILocation(line: 672, column: 20, scope: !711)
!711 = distinct !DILexicalBlock(scope: !706, file: !1, line: 671, column: 53)
!712 = !DILocation(line: 672, column: 19, scope: !711)
!713 = !DILocation(line: 672, column: 24, scope: !711)
!714 = !DILocation(line: 672, column: 34, scope: !711)
!715 = !DILocation(line: 672, column: 32, scope: !711)
!716 = !DILocation(line: 672, column: 39, scope: !711)
!717 = !DILocation(line: 672, column: 10, scope: !711)
!718 = !DILocation(line: 672, column: 14, scope: !711)
!719 = !DILocation(line: 673, column: 7, scope: !711)
!720 = !DILocation(line: 671, column: 40, scope: !706)
!721 = !DILocation(line: 671, column: 47, scope: !706)
!722 = !DILocation(line: 671, column: 7, scope: !706)
!723 = distinct !{!723, !709, !724}
!724 = !DILocation(line: 673, column: 7, scope: !703)
!725 = !DILocation(line: 675, column: 11, scope: !726)
!726 = distinct !DILexicalBlock(scope: !664, file: !1, line: 675, column: 11)
!727 = !DILocation(line: 675, column: 11, scope: !664)
!728 = !DILocation(line: 676, column: 15, scope: !729)
!729 = distinct !DILexicalBlock(scope: !730, file: !1, line: 676, column: 8)
!730 = distinct !DILexicalBlock(scope: !726, file: !1, line: 675, column: 36)
!731 = !DILocation(line: 676, column: 13, scope: !729)
!732 = !DILocation(line: 676, column: 20, scope: !733)
!733 = distinct !DILexicalBlock(scope: !729, file: !1, line: 676, column: 8)
!734 = !DILocation(line: 676, column: 24, scope: !733)
!735 = !DILocation(line: 676, column: 22, scope: !733)
!736 = !DILocation(line: 676, column: 8, scope: !729)
!737 = !DILocation(line: 677, column: 22, scope: !738)
!738 = distinct !DILexicalBlock(scope: !733, file: !1, line: 676, column: 64)
!739 = !DILocation(line: 677, column: 21, scope: !738)
!740 = !DILocation(line: 677, column: 27, scope: !738)
!741 = !DILocation(line: 677, column: 37, scope: !738)
!742 = !DILocation(line: 677, column: 35, scope: !738)
!743 = !DILocation(line: 677, column: 42, scope: !738)
!744 = !DILocation(line: 677, column: 11, scope: !738)
!745 = !DILocation(line: 677, column: 16, scope: !738)
!746 = !DILocation(line: 678, column: 8, scope: !738)
!747 = !DILocation(line: 676, column: 50, scope: !733)
!748 = !DILocation(line: 676, column: 58, scope: !733)
!749 = !DILocation(line: 676, column: 8, scope: !733)
!750 = distinct !{!750, !736, !751}
!751 = !DILocation(line: 678, column: 8, scope: !729)
!752 = !DILocation(line: 679, column: 7, scope: !730)
!753 = !DILocation(line: 680, column: 6, scope: !664)
!754 = !DILocation(line: 681, column: 5, scope: !659)
!755 = !DILocation(line: 684, column: 9, scope: !756)
!756 = distinct !DILexicalBlock(scope: !644, file: !1, line: 684, column: 9)
!757 = !DILocation(line: 684, column: 20, scope: !756)
!758 = !DILocation(line: 684, column: 9, scope: !644)
!759 = !DILocation(line: 685, column: 10, scope: !760)
!760 = distinct !DILexicalBlock(scope: !761, file: !1, line: 685, column: 10)
!761 = distinct !DILexicalBlock(scope: !756, file: !1, line: 684, column: 29)
!762 = !DILocation(line: 685, column: 21, scope: !760)
!763 = !DILocation(line: 685, column: 10, scope: !761)
!764 = !DILocation(line: 686, column: 33, scope: !765)
!765 = distinct !DILexicalBlock(scope: !760, file: !1, line: 685, column: 31)
!766 = !DILocation(line: 686, column: 31, scope: !765)
!767 = !DILocation(line: 687, column: 29, scope: !765)
!768 = !DILocation(line: 688, column: 49, scope: !765)
!769 = !DILocation(line: 688, column: 41, scope: !765)
!770 = !DILocation(line: 687, column: 70, scope: !765)
!771 = !DILocation(line: 687, column: 27, scope: !765)
!772 = !DILocation(line: 691, column: 55, scope: !765)
!773 = !DILocation(line: 691, column: 76, scope: !765)
!774 = !DILocation(line: 692, column: 54, scope: !765)
!775 = !DILocation(line: 692, column: 70, scope: !765)
!776 = !DILocation(line: 691, column: 7, scope: !765)
!777 = !DILocation(line: 693, column: 6, scope: !765)
!778 = !DILocation(line: 696, column: 55, scope: !779)
!779 = distinct !DILexicalBlock(scope: !760, file: !1, line: 694, column: 11)
!780 = !DILocation(line: 696, column: 76, scope: !779)
!781 = !DILocation(line: 697, column: 54, scope: !779)
!782 = !DILocation(line: 697, column: 70, scope: !779)
!783 = !DILocation(line: 696, column: 7, scope: !779)
!784 = !DILocation(line: 699, column: 5, scope: !761)
!785 = !DILocation(line: 701, column: 9, scope: !786)
!786 = distinct !DILexicalBlock(scope: !644, file: !1, line: 701, column: 9)
!787 = !DILocation(line: 701, column: 9, scope: !644)
!788 = !DILocation(line: 703, column: 10, scope: !789)
!789 = distinct !DILexicalBlock(scope: !790, file: !1, line: 703, column: 10)
!790 = distinct !DILexicalBlock(scope: !786, file: !1, line: 701, column: 18)
!791 = !DILocation(line: 703, column: 18, scope: !789)
!792 = !DILocation(line: 703, column: 23, scope: !789)
!793 = !DILocation(line: 703, column: 10, scope: !790)
!794 = !DILocation(line: 704, column: 52, scope: !795)
!795 = distinct !DILexicalBlock(scope: !789, file: !1, line: 703, column: 50)
!796 = !DILocation(line: 704, column: 60, scope: !795)
!797 = !DILocation(line: 704, column: 81, scope: !795)
!798 = !DILocation(line: 704, column: 7, scope: !795)
!799 = !DILocation(line: 705, column: 6, scope: !795)
!800 = !DILocation(line: 707, column: 17, scope: !790)
!801 = !DILocation(line: 707, column: 21, scope: !790)
!802 = !DILocation(line: 707, column: 6, scope: !790)
!803 = !DILocation(line: 708, column: 52, scope: !790)
!804 = !DILocation(line: 708, column: 21, scope: !790)
!805 = !DILocation(line: 708, column: 19, scope: !790)
!806 = !DILocation(line: 709, column: 28, scope: !790)
!807 = !DILocation(line: 709, column: 6, scope: !790)
!808 = !DILocation(line: 709, column: 20, scope: !790)
!809 = !DILocation(line: 709, column: 24, scope: !790)
!810 = !DILocation(line: 709, column: 26, scope: !790)
!811 = !DILocation(line: 710, column: 31, scope: !790)
!812 = !DILocation(line: 710, column: 45, scope: !790)
!813 = !DILocation(line: 710, column: 43, scope: !790)
!814 = !DILocation(line: 710, column: 6, scope: !790)
!815 = !DILocation(line: 710, column: 20, scope: !790)
!816 = !DILocation(line: 710, column: 29, scope: !790)
!817 = !DILocation(line: 711, column: 17, scope: !790)
!818 = !DILocation(line: 714, column: 13, scope: !819)
!819 = distinct !DILexicalBlock(scope: !790, file: !1, line: 714, column: 6)
!820 = !DILocation(line: 714, column: 11, scope: !819)
!821 = !DILocation(line: 714, column: 18, scope: !822)
!822 = distinct !DILexicalBlock(scope: !819, file: !1, line: 714, column: 6)
!823 = !DILocation(line: 714, column: 22, scope: !822)
!824 = !DILocation(line: 714, column: 20, scope: !822)
!825 = !DILocation(line: 714, column: 6, scope: !819)
!826 = !DILocation(line: 715, column: 18, scope: !827)
!827 = distinct !DILexicalBlock(scope: !822, file: !1, line: 714, column: 43)
!828 = !DILocation(line: 715, column: 22, scope: !827)
!829 = !DILocation(line: 715, column: 34, scope: !827)
!830 = !DILocation(line: 715, column: 7, scope: !827)
!831 = !DILocation(line: 716, column: 48, scope: !827)
!832 = !DILocation(line: 716, column: 17, scope: !827)
!833 = !DILocation(line: 716, column: 15, scope: !827)
!834 = !DILocation(line: 717, column: 24, scope: !827)
!835 = !DILocation(line: 717, column: 7, scope: !827)
!836 = !DILocation(line: 717, column: 16, scope: !827)
!837 = !DILocation(line: 717, column: 20, scope: !827)
!838 = !DILocation(line: 717, column: 22, scope: !827)
!839 = !DILocation(line: 718, column: 27, scope: !827)
!840 = !DILocation(line: 718, column: 41, scope: !827)
!841 = !DILocation(line: 718, column: 39, scope: !827)
!842 = !DILocation(line: 718, column: 7, scope: !827)
!843 = !DILocation(line: 718, column: 16, scope: !827)
!844 = !DILocation(line: 718, column: 25, scope: !827)
!845 = !DILocation(line: 719, column: 18, scope: !827)
!846 = !DILocation(line: 720, column: 6, scope: !827)
!847 = !DILocation(line: 714, column: 39, scope: !822)
!848 = !DILocation(line: 714, column: 6, scope: !822)
!849 = distinct !{!849, !825, !850}
!850 = !DILocation(line: 720, column: 6, scope: !819)
!851 = !DILocation(line: 722, column: 16, scope: !790)
!852 = !DILocation(line: 722, column: 14, scope: !790)
!853 = !DILocation(line: 723, column: 28, scope: !790)
!854 = !DILocation(line: 723, column: 41, scope: !790)
!855 = !DILocation(line: 723, column: 21, scope: !790)
!856 = !DILocation(line: 723, column: 19, scope: !790)
!857 = !DILocation(line: 725, column: 13, scope: !858)
!858 = distinct !DILexicalBlock(scope: !790, file: !1, line: 725, column: 6)
!859 = !DILocation(line: 725, column: 11, scope: !858)
!860 = !DILocation(line: 725, column: 18, scope: !861)
!861 = distinct !DILexicalBlock(scope: !858, file: !1, line: 725, column: 6)
!862 = !DILocation(line: 725, column: 22, scope: !861)
!863 = !DILocation(line: 725, column: 20, scope: !861)
!864 = !DILocation(line: 725, column: 6, scope: !858)
!865 = !DILocalVariable(name: "sf_edge", scope: !866, file: !1, line: 726, type: !867)
!866 = distinct !DILexicalBlock(scope: !861, file: !1, line: 725, column: 43)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScanFillEdge", file: !17, line: 92, baseType: !869)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScanFillEdge", file: !17, line: 83, size: 320, elements: !870)
!870 = !{!871, !873, !874, !875, !876, !877, !878, !879}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !869, file: !17, line: 84, baseType: !872, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !869, file: !17, line: 84, baseType: !872, size: 64, offset: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !869, file: !17, line: 85, baseType: !511, size: 64, offset: 128)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !869, file: !17, line: 85, baseType: !511, size: 64, offset: 192)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "poly_nr", scope: !869, file: !17, line: 86, baseType: !501, size: 16, offset: 256)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !869, file: !17, line: 87, baseType: !5, size: 4, offset: 272, flags: DIFlagBitField, extraData: i64 272)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "user_flag", scope: !869, file: !17, line: 88, baseType: !5, size: 4, offset: 276, flags: DIFlagBitField, extraData: i64 272)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !869, file: !17, line: 91, baseType: !880, size: 8, offset: 280)
!880 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !869, file: !17, line: 89, size: 8, elements: !881)
!881 = !{!882}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !880, file: !17, line: 90, baseType: !295, size: 8)
!883 = !DILocation(line: 726, column: 21, scope: !866)
!884 = !DILocation(line: 726, column: 62, scope: !866)
!885 = !DILocation(line: 726, column: 76, scope: !866)
!886 = !DILocation(line: 726, column: 31, scope: !866)
!887 = !DILocation(line: 729, column: 11, scope: !888)
!888 = distinct !DILexicalBlock(scope: !866, file: !1, line: 729, column: 11)
!889 = !DILocation(line: 729, column: 11, scope: !866)
!890 = !DILocation(line: 730, column: 8, scope: !891)
!891 = distinct !DILexicalBlock(scope: !888, file: !1, line: 729, column: 32)
!892 = !DILocation(line: 730, column: 17, scope: !891)
!893 = !DILocation(line: 730, column: 21, scope: !891)
!894 = !DILocation(line: 730, column: 23, scope: !891)
!895 = !DILocation(line: 731, column: 25, scope: !891)
!896 = !DILocation(line: 732, column: 7, scope: !891)
!897 = !DILocation(line: 736, column: 22, scope: !866)
!898 = !DILocation(line: 736, column: 20, scope: !866)
!899 = !DILocation(line: 737, column: 17, scope: !866)
!900 = !DILocation(line: 737, column: 26, scope: !866)
!901 = !DILocation(line: 737, column: 15, scope: !866)
!902 = !DILocation(line: 738, column: 6, scope: !866)
!903 = !DILocation(line: 725, column: 39, scope: !861)
!904 = !DILocation(line: 725, column: 6, scope: !861)
!905 = distinct !{!905, !864, !906}
!906 = !DILocation(line: 738, column: 6, scope: !858)
!907 = !DILocation(line: 740, column: 10, scope: !908)
!908 = distinct !DILexicalBlock(scope: !790, file: !1, line: 740, column: 10)
!909 = !DILocation(line: 740, column: 10, scope: !790)
!910 = !DILocalVariable(name: "co_feather", scope: !911, file: !1, line: 741, type: !73)
!911 = distinct !DILexicalBlock(scope: !908, file: !1, line: 740, column: 31)
!912 = !DILocation(line: 741, column: 13, scope: !911)
!913 = !DILocation(line: 742, column: 7, scope: !911)
!914 = !DILocation(line: 742, column: 21, scope: !911)
!915 = !DILocation(line: 748, column: 14, scope: !916)
!916 = distinct !DILexicalBlock(scope: !911, file: !1, line: 748, column: 7)
!917 = !DILocation(line: 748, column: 12, scope: !916)
!918 = !DILocation(line: 748, column: 19, scope: !919)
!919 = distinct !DILexicalBlock(scope: !916, file: !1, line: 748, column: 7)
!920 = !DILocation(line: 748, column: 23, scope: !919)
!921 = !DILocation(line: 748, column: 21, scope: !919)
!922 = !DILocation(line: 748, column: 7, scope: !916)
!923 = !DILocation(line: 749, column: 19, scope: !924)
!924 = distinct !DILexicalBlock(scope: !919, file: !1, line: 748, column: 53)
!925 = !DILocation(line: 749, column: 31, scope: !924)
!926 = !DILocation(line: 749, column: 51, scope: !924)
!927 = !DILocation(line: 749, column: 8, scope: !924)
!928 = !DILocation(line: 750, column: 49, scope: !924)
!929 = !DILocation(line: 750, column: 18, scope: !924)
!930 = !DILocation(line: 750, column: 16, scope: !924)
!931 = !DILocation(line: 757, column: 8, scope: !924)
!932 = !DILocation(line: 757, column: 17, scope: !924)
!933 = !DILocation(line: 757, column: 26, scope: !924)
!934 = !DILocation(line: 758, column: 19, scope: !924)
!935 = !DILocation(line: 759, column: 7, scope: !924)
!936 = !DILocation(line: 748, column: 49, scope: !919)
!937 = !DILocation(line: 748, column: 7, scope: !919)
!938 = distinct !{!938, !922, !939}
!939 = !DILocation(line: 759, column: 7, scope: !916)
!940 = !DILocation(line: 761, column: 28, scope: !911)
!941 = !DILocation(line: 761, column: 25, scope: !911)
!942 = !DILocation(line: 762, column: 6, scope: !911)
!943 = !DILocation(line: 763, column: 5, scope: !790)
!944 = !DILocation(line: 766, column: 10, scope: !945)
!945 = distinct !DILexicalBlock(scope: !946, file: !1, line: 766, column: 10)
!946 = distinct !DILexicalBlock(scope: !786, file: !1, line: 764, column: 10)
!947 = !DILocation(line: 766, column: 10, scope: !946)
!948 = !DILocalVariable(name: "co_diff", scope: !949, file: !1, line: 768, type: !88)
!949 = distinct !DILexicalBlock(scope: !945, file: !1, line: 766, column: 31)
!950 = !DILocation(line: 768, column: 13, scope: !949)
!951 = !DILocalVariable(name: "co_feather", scope: !949, file: !1, line: 770, type: !73)
!952 = !DILocation(line: 770, column: 13, scope: !949)
!953 = !DILocation(line: 771, column: 7, scope: !949)
!954 = !DILocation(line: 771, column: 21, scope: !949)
!955 = !DILocation(line: 773, column: 11, scope: !956)
!956 = distinct !DILexicalBlock(scope: !949, file: !1, line: 773, column: 11)
!957 = !DILocation(line: 773, column: 19, scope: !956)
!958 = !DILocation(line: 773, column: 24, scope: !956)
!959 = !DILocation(line: 773, column: 11, scope: !949)
!960 = !DILocation(line: 774, column: 35, scope: !961)
!961 = distinct !DILexicalBlock(scope: !956, file: !1, line: 773, column: 51)
!962 = !DILocation(line: 774, column: 67, scope: !961)
!963 = !DILocation(line: 774, column: 65, scope: !961)
!964 = !DILocation(line: 774, column: 33, scope: !961)
!965 = !DILocation(line: 776, column: 15, scope: !966)
!966 = distinct !DILexicalBlock(scope: !961, file: !1, line: 776, column: 8)
!967 = !DILocation(line: 776, column: 13, scope: !966)
!968 = !DILocation(line: 776, column: 20, scope: !969)
!969 = distinct !DILexicalBlock(scope: !966, file: !1, line: 776, column: 8)
!970 = !DILocation(line: 776, column: 24, scope: !969)
!971 = !DILocation(line: 776, column: 22, scope: !969)
!972 = !DILocation(line: 776, column: 8, scope: !966)
!973 = !DILocation(line: 777, column: 21, scope: !974)
!974 = distinct !DILexicalBlock(scope: !969, file: !1, line: 776, column: 45)
!975 = !DILocation(line: 777, column: 30, scope: !974)
!976 = !DILocation(line: 777, column: 42, scope: !974)
!977 = !DILocation(line: 777, column: 46, scope: !974)
!978 = !DILocation(line: 777, column: 66, scope: !974)
!979 = !DILocation(line: 777, column: 9, scope: !974)
!980 = !DILocation(line: 778, column: 21, scope: !974)
!981 = !DILocation(line: 778, column: 46, scope: !974)
!982 = !DILocation(line: 778, column: 50, scope: !974)
!983 = !DILocation(line: 778, column: 62, scope: !974)
!984 = !DILocation(line: 778, column: 66, scope: !974)
!985 = !DILocation(line: 778, column: 9, scope: !974)
!986 = !DILocation(line: 779, column: 8, scope: !974)
!987 = !DILocation(line: 776, column: 41, scope: !969)
!988 = !DILocation(line: 776, column: 8, scope: !969)
!989 = distinct !{!989, !972, !990}
!990 = !DILocation(line: 779, column: 8, scope: !966)
!991 = !DILocation(line: 781, column: 53, scope: !961)
!992 = !DILocation(line: 781, column: 61, scope: !961)
!993 = !DILocation(line: 781, column: 87, scope: !961)
!994 = !DILocation(line: 781, column: 8, scope: !961)
!995 = !DILocation(line: 782, column: 53, scope: !961)
!996 = !DILocation(line: 782, column: 61, scope: !961)
!997 = !DILocation(line: 782, column: 87, scope: !961)
!998 = !DILocation(line: 782, column: 8, scope: !961)
!999 = !DILocation(line: 783, column: 7, scope: !961)
!1000 = !DILocation(line: 785, column: 33, scope: !1001)
!1001 = distinct !DILexicalBlock(scope: !956, file: !1, line: 784, column: 12)
!1002 = !DILocation(line: 789, column: 61, scope: !949)
!1003 = !DILocation(line: 789, column: 7, scope: !949)
!1004 = !DILocation(line: 789, column: 26, scope: !949)
!1005 = !DILocation(line: 789, column: 45, scope: !949)
!1006 = !DILocation(line: 789, column: 59, scope: !949)
!1007 = !DILocation(line: 790, column: 60, scope: !949)
!1008 = !DILocation(line: 790, column: 7, scope: !949)
!1009 = !DILocation(line: 790, column: 26, scope: !949)
!1010 = !DILocation(line: 790, column: 45, scope: !949)
!1011 = !DILocation(line: 790, column: 58, scope: !949)
!1012 = !DILocation(line: 793, column: 14, scope: !1013)
!1013 = distinct !DILexicalBlock(scope: !949, file: !1, line: 793, column: 7)
!1014 = !DILocation(line: 793, column: 12, scope: !1013)
!1015 = !DILocation(line: 793, column: 19, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !1013, file: !1, line: 793, column: 7)
!1017 = !DILocation(line: 793, column: 23, scope: !1016)
!1018 = !DILocation(line: 793, column: 21, scope: !1016)
!1019 = !DILocation(line: 793, column: 7, scope: !1013)
!1020 = !DILocation(line: 796, column: 19, scope: !1021)
!1021 = distinct !DILexicalBlock(scope: !1016, file: !1, line: 793, column: 44)
!1022 = !DILocation(line: 796, column: 23, scope: !1021)
!1023 = !DILocation(line: 796, column: 35, scope: !1021)
!1024 = !DILocation(line: 796, column: 8, scope: !1021)
!1025 = !DILocation(line: 797, column: 49, scope: !1021)
!1026 = !DILocation(line: 797, column: 18, scope: !1021)
!1027 = !DILocation(line: 797, column: 16, scope: !1021)
!1028 = !DILocation(line: 798, column: 25, scope: !1021)
!1029 = !DILocation(line: 798, column: 8, scope: !1021)
!1030 = !DILocation(line: 798, column: 17, scope: !1021)
!1031 = !DILocation(line: 798, column: 21, scope: !1021)
!1032 = !DILocation(line: 798, column: 23, scope: !1021)
!1033 = !DILocation(line: 799, column: 8, scope: !1021)
!1034 = !DILocation(line: 799, column: 17, scope: !1021)
!1035 = !DILocation(line: 799, column: 26, scope: !1021)
!1036 = !DILocation(line: 800, column: 19, scope: !1021)
!1037 = !DILocation(line: 804, column: 19, scope: !1021)
!1038 = !DILocation(line: 804, column: 31, scope: !1021)
!1039 = !DILocation(line: 804, column: 51, scope: !1021)
!1040 = !DILocation(line: 804, column: 8, scope: !1021)
!1041 = !DILocation(line: 805, column: 49, scope: !1021)
!1042 = !DILocation(line: 805, column: 18, scope: !1021)
!1043 = !DILocation(line: 805, column: 16, scope: !1021)
!1044 = !DILocation(line: 806, column: 25, scope: !1021)
!1045 = !DILocation(line: 806, column: 8, scope: !1021)
!1046 = !DILocation(line: 806, column: 17, scope: !1021)
!1047 = !DILocation(line: 806, column: 21, scope: !1021)
!1048 = !DILocation(line: 806, column: 23, scope: !1021)
!1049 = !DILocation(line: 807, column: 8, scope: !1021)
!1050 = !DILocation(line: 807, column: 17, scope: !1021)
!1051 = !DILocation(line: 807, column: 26, scope: !1021)
!1052 = !DILocation(line: 808, column: 19, scope: !1021)
!1053 = !DILocation(line: 812, column: 12, scope: !1054)
!1054 = distinct !DILexicalBlock(scope: !1021, file: !1, line: 812, column: 12)
!1055 = !DILocation(line: 812, column: 12, scope: !1021)
!1056 = !DILocation(line: 813, column: 20, scope: !1057)
!1057 = distinct !DILexicalBlock(scope: !1054, file: !1, line: 812, column: 38)
!1058 = !DILocation(line: 813, column: 32, scope: !1057)
!1059 = !DILocation(line: 813, column: 57, scope: !1057)
!1060 = !DILocation(line: 813, column: 9, scope: !1057)
!1061 = !DILocation(line: 814, column: 8, scope: !1057)
!1062 = !DILocation(line: 816, column: 21, scope: !1063)
!1063 = distinct !DILexicalBlock(scope: !1054, file: !1, line: 815, column: 13)
!1064 = !DILocation(line: 816, column: 30, scope: !1063)
!1065 = !DILocation(line: 816, column: 34, scope: !1063)
!1066 = !DILocation(line: 816, column: 9, scope: !1063)
!1067 = !DILocation(line: 817, column: 21, scope: !1063)
!1068 = !DILocation(line: 817, column: 33, scope: !1063)
!1069 = !DILocation(line: 817, column: 37, scope: !1063)
!1070 = !DILocation(line: 817, column: 9, scope: !1063)
!1071 = !DILocation(line: 820, column: 49, scope: !1021)
!1072 = !DILocation(line: 820, column: 18, scope: !1021)
!1073 = !DILocation(line: 820, column: 16, scope: !1021)
!1074 = !DILocation(line: 821, column: 25, scope: !1021)
!1075 = !DILocation(line: 821, column: 8, scope: !1021)
!1076 = !DILocation(line: 821, column: 17, scope: !1021)
!1077 = !DILocation(line: 821, column: 21, scope: !1021)
!1078 = !DILocation(line: 821, column: 23, scope: !1021)
!1079 = !DILocation(line: 822, column: 8, scope: !1021)
!1080 = !DILocation(line: 822, column: 17, scope: !1021)
!1081 = !DILocation(line: 822, column: 26, scope: !1021)
!1082 = !DILocation(line: 823, column: 19, scope: !1021)
!1083 = !DILocation(line: 825, column: 26, scope: !1021)
!1084 = !DILocation(line: 826, column: 7, scope: !1021)
!1085 = !DILocation(line: 793, column: 40, scope: !1016)
!1086 = !DILocation(line: 793, column: 7, scope: !1016)
!1087 = distinct !{!1087, !1019, !1088}
!1088 = !DILocation(line: 826, column: 7, scope: !1013)
!1089 = !DILocation(line: 828, column: 12, scope: !1090)
!1090 = distinct !DILexicalBlock(scope: !949, file: !1, line: 828, column: 11)
!1091 = !DILocation(line: 828, column: 11, scope: !949)
!1092 = !DILocation(line: 829, column: 26, scope: !1093)
!1093 = distinct !DILexicalBlock(scope: !1090, file: !1, line: 828, column: 23)
!1094 = !DILocation(line: 830, column: 7, scope: !1093)
!1095 = !DILocation(line: 832, column: 11, scope: !1096)
!1096 = distinct !DILexicalBlock(scope: !949, file: !1, line: 832, column: 11)
!1097 = !DILocation(line: 832, column: 11, scope: !949)
!1098 = !DILocation(line: 833, column: 8, scope: !1099)
!1099 = distinct !DILexicalBlock(scope: !1096, file: !1, line: 832, column: 37)
!1100 = !DILocation(line: 833, column: 18, scope: !1099)
!1101 = !DILocation(line: 834, column: 33, scope: !1099)
!1102 = !DILocation(line: 835, column: 7, scope: !1099)
!1103 = !DILocation(line: 840, column: 7, scope: !949)
!1104 = !DILocation(line: 840, column: 26, scope: !949)
!1105 = !DILocation(line: 840, column: 45, scope: !949)
!1106 = !DILocation(line: 840, column: 67, scope: !949)
!1107 = !DILocation(line: 841, column: 7, scope: !949)
!1108 = !DILocation(line: 841, column: 26, scope: !949)
!1109 = !DILocation(line: 841, column: 45, scope: !949)
!1110 = !DILocation(line: 841, column: 67, scope: !949)
!1111 = !DILocation(line: 843, column: 12, scope: !1112)
!1112 = distinct !DILexicalBlock(scope: !949, file: !1, line: 843, column: 11)
!1113 = !DILocation(line: 843, column: 11, scope: !949)
!1114 = !DILocalVariable(name: "fp_cent", scope: !1115, file: !1, line: 844, type: !1116)
!1115 = distinct !DILexicalBlock(scope: !1112, file: !1, line: 843, column: 23)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!1117 = !DILocation(line: 844, column: 21, scope: !1115)
!1118 = !DILocalVariable(name: "fp_turn", scope: !1115, file: !1, line: 845, type: !1116)
!1119 = !DILocation(line: 845, column: 21, scope: !1115)
!1120 = !DILocalVariable(name: "k", scope: !1115, file: !1, line: 847, type: !5)
!1121 = !DILocation(line: 847, column: 21, scope: !1115)
!1122 = !DILocation(line: 849, column: 18, scope: !1115)
!1123 = !DILocation(line: 849, column: 16, scope: !1115)
!1124 = !DILocation(line: 850, column: 18, scope: !1115)
!1125 = !DILocation(line: 850, column: 16, scope: !1115)
!1126 = !DILocalVariable(name: "vertex_total_cap", scope: !1127, file: !1, line: 858, type: !113)
!1127 = distinct !DILexicalBlock(scope: !1115, file: !1, line: 857, column: 8)
!1128 = !DILocation(line: 858, column: 28, scope: !1127)
!1129 = !DILocation(line: 858, column: 47, scope: !1127)
!1130 = !DILocation(line: 860, column: 16, scope: !1131)
!1131 = distinct !DILexicalBlock(scope: !1127, file: !1, line: 860, column: 9)
!1132 = !DILocation(line: 860, column: 14, scope: !1131)
!1133 = !DILocation(line: 860, column: 21, scope: !1134)
!1134 = distinct !DILexicalBlock(scope: !1131, file: !1, line: 860, column: 9)
!1135 = !DILocation(line: 860, column: 25, scope: !1134)
!1136 = !DILocation(line: 860, column: 23, scope: !1134)
!1137 = !DILocation(line: 860, column: 9, scope: !1131)
!1138 = !DILocalVariable(name: "angle", scope: !1139, file: !1, line: 861, type: !314)
!1139 = distinct !DILexicalBlock(scope: !1134, file: !1, line: 860, column: 48)
!1140 = !DILocation(line: 861, column: 22, scope: !1139)
!1141 = !DILocation(line: 861, column: 37, scope: !1139)
!1142 = !DILocation(line: 861, column: 30, scope: !1139)
!1143 = !DILocation(line: 861, column: 56, scope: !1139)
!1144 = !DILocation(line: 861, column: 49, scope: !1139)
!1145 = !DILocation(line: 861, column: 47, scope: !1139)
!1146 = !DILocation(line: 861, column: 39, scope: !1139)
!1147 = !DILocation(line: 861, column: 74, scope: !1139)
!1148 = !DILocation(line: 862, column: 26, scope: !1139)
!1149 = !DILocation(line: 862, column: 38, scope: !1139)
!1150 = !DILocation(line: 862, column: 47, scope: !1139)
!1151 = !DILocation(line: 862, column: 56, scope: !1139)
!1152 = !DILocation(line: 862, column: 63, scope: !1139)
!1153 = !DILocation(line: 862, column: 10, scope: !1139)
!1154 = !DILocation(line: 864, column: 51, scope: !1139)
!1155 = !DILocation(line: 864, column: 20, scope: !1139)
!1156 = !DILocation(line: 864, column: 18, scope: !1139)
!1157 = !DILocation(line: 865, column: 27, scope: !1139)
!1158 = !DILocation(line: 865, column: 10, scope: !1139)
!1159 = !DILocation(line: 865, column: 19, scope: !1139)
!1160 = !DILocation(line: 865, column: 23, scope: !1139)
!1161 = !DILocation(line: 865, column: 25, scope: !1139)
!1162 = !DILocation(line: 866, column: 10, scope: !1139)
!1163 = !DILocation(line: 866, column: 19, scope: !1139)
!1164 = !DILocation(line: 866, column: 28, scope: !1139)
!1165 = !DILocation(line: 867, column: 21, scope: !1139)
!1166 = !DILocation(line: 868, column: 9, scope: !1139)
!1167 = !DILocation(line: 860, column: 44, scope: !1134)
!1168 = !DILocation(line: 860, column: 9, scope: !1134)
!1169 = distinct !{!1169, !1137, !1170}
!1170 = !DILocation(line: 868, column: 9, scope: !1131)
!1171 = !DILocation(line: 869, column: 30, scope: !1127)
!1172 = !DILocation(line: 869, column: 27, scope: !1127)
!1173 = !DILocation(line: 871, column: 71, scope: !1127)
!1174 = !DILocation(line: 871, column: 9, scope: !1127)
!1175 = !DILocation(line: 871, column: 28, scope: !1127)
!1176 = !DILocation(line: 871, column: 47, scope: !1127)
!1177 = !DILocation(line: 871, column: 69, scope: !1127)
!1178 = !DILocation(line: 874, column: 18, scope: !1115)
!1179 = !DILocation(line: 874, column: 30, scope: !1115)
!1180 = !DILocation(line: 874, column: 45, scope: !1115)
!1181 = !DILocation(line: 874, column: 16, scope: !1115)
!1182 = !DILocation(line: 875, column: 18, scope: !1115)
!1183 = !DILocation(line: 875, column: 38, scope: !1115)
!1184 = !DILocation(line: 875, column: 53, scope: !1115)
!1185 = !DILocation(line: 875, column: 16, scope: !1115)
!1186 = !DILocalVariable(name: "vertex_total_cap", scope: !1187, file: !1, line: 878, type: !113)
!1187 = distinct !DILexicalBlock(scope: !1115, file: !1, line: 877, column: 8)
!1188 = !DILocation(line: 878, column: 28, scope: !1187)
!1189 = !DILocation(line: 878, column: 47, scope: !1187)
!1190 = !DILocation(line: 880, column: 16, scope: !1191)
!1191 = distinct !DILexicalBlock(scope: !1187, file: !1, line: 880, column: 9)
!1192 = !DILocation(line: 880, column: 14, scope: !1191)
!1193 = !DILocation(line: 880, column: 21, scope: !1194)
!1194 = distinct !DILexicalBlock(scope: !1191, file: !1, line: 880, column: 9)
!1195 = !DILocation(line: 880, column: 25, scope: !1194)
!1196 = !DILocation(line: 880, column: 23, scope: !1194)
!1197 = !DILocation(line: 880, column: 9, scope: !1191)
!1198 = !DILocalVariable(name: "angle", scope: !1199, file: !1, line: 881, type: !314)
!1199 = distinct !DILexicalBlock(scope: !1194, file: !1, line: 880, column: 48)
!1200 = !DILocation(line: 881, column: 22, scope: !1199)
!1201 = !DILocation(line: 881, column: 37, scope: !1199)
!1202 = !DILocation(line: 881, column: 30, scope: !1199)
!1203 = !DILocation(line: 881, column: 56, scope: !1199)
!1204 = !DILocation(line: 881, column: 49, scope: !1199)
!1205 = !DILocation(line: 881, column: 47, scope: !1199)
!1206 = !DILocation(line: 881, column: 39, scope: !1199)
!1207 = !DILocation(line: 881, column: 74, scope: !1199)
!1208 = !DILocation(line: 882, column: 26, scope: !1199)
!1209 = !DILocation(line: 882, column: 38, scope: !1199)
!1210 = !DILocation(line: 882, column: 47, scope: !1199)
!1211 = !DILocation(line: 882, column: 57, scope: !1199)
!1212 = !DILocation(line: 882, column: 56, scope: !1199)
!1213 = !DILocation(line: 882, column: 64, scope: !1199)
!1214 = !DILocation(line: 882, column: 10, scope: !1199)
!1215 = !DILocation(line: 884, column: 51, scope: !1199)
!1216 = !DILocation(line: 884, column: 20, scope: !1199)
!1217 = !DILocation(line: 884, column: 18, scope: !1199)
!1218 = !DILocation(line: 885, column: 27, scope: !1199)
!1219 = !DILocation(line: 885, column: 10, scope: !1199)
!1220 = !DILocation(line: 885, column: 19, scope: !1199)
!1221 = !DILocation(line: 885, column: 23, scope: !1199)
!1222 = !DILocation(line: 885, column: 25, scope: !1199)
!1223 = !DILocation(line: 886, column: 10, scope: !1199)
!1224 = !DILocation(line: 886, column: 19, scope: !1199)
!1225 = !DILocation(line: 886, column: 28, scope: !1199)
!1226 = !DILocation(line: 887, column: 21, scope: !1199)
!1227 = !DILocation(line: 888, column: 9, scope: !1199)
!1228 = !DILocation(line: 880, column: 44, scope: !1194)
!1229 = !DILocation(line: 880, column: 9, scope: !1194)
!1230 = distinct !{!1230, !1197, !1231}
!1231 = !DILocation(line: 888, column: 9, scope: !1191)
!1232 = !DILocation(line: 889, column: 30, scope: !1187)
!1233 = !DILocation(line: 889, column: 27, scope: !1187)
!1234 = !DILocation(line: 891, column: 71, scope: !1187)
!1235 = !DILocation(line: 891, column: 9, scope: !1187)
!1236 = !DILocation(line: 891, column: 28, scope: !1187)
!1237 = !DILocation(line: 891, column: 47, scope: !1187)
!1238 = !DILocation(line: 891, column: 69, scope: !1187)
!1239 = !DILocation(line: 893, column: 7, scope: !1115)
!1240 = !DILocation(line: 895, column: 57, scope: !949)
!1241 = !DILocation(line: 895, column: 7, scope: !949)
!1242 = !DILocation(line: 895, column: 26, scope: !949)
!1243 = !DILocation(line: 895, column: 45, scope: !949)
!1244 = !DILocation(line: 895, column: 55, scope: !949)
!1245 = !DILocation(line: 896, column: 24, scope: !949)
!1246 = !DILocation(line: 901, column: 6, scope: !949)
!1247 = !DILocation(line: 903, column: 4, scope: !644)
!1248 = !DILocation(line: 905, column: 8, scope: !1249)
!1249 = distinct !DILexicalBlock(scope: !581, file: !1, line: 905, column: 8)
!1250 = !DILocation(line: 905, column: 8, scope: !581)
!1251 = !DILocation(line: 906, column: 5, scope: !1252)
!1252 = distinct !DILexicalBlock(scope: !1249, file: !1, line: 905, column: 21)
!1253 = !DILocation(line: 906, column: 15, scope: !1252)
!1254 = !DILocation(line: 907, column: 4, scope: !1252)
!1255 = !DILocation(line: 909, column: 8, scope: !1256)
!1256 = distinct !DILexicalBlock(scope: !581, file: !1, line: 909, column: 8)
!1257 = !DILocation(line: 909, column: 8, scope: !581)
!1258 = !DILocation(line: 910, column: 5, scope: !1259)
!1259 = distinct !DILexicalBlock(scope: !1256, file: !1, line: 909, column: 29)
!1260 = !DILocation(line: 910, column: 15, scope: !1259)
!1261 = !DILocation(line: 911, column: 4, scope: !1259)
!1262 = !DILocation(line: 912, column: 3, scope: !581)
!1263 = !DILocation(line: 616, column: 58, scope: !578)
!1264 = !DILocation(line: 616, column: 66, scope: !578)
!1265 = !DILocation(line: 616, column: 56, scope: !578)
!1266 = !DILocation(line: 616, column: 3, scope: !578)
!1267 = distinct !{!1267, !579, !1268}
!1268 = !DILocation(line: 912, column: 3, scope: !572)
!1269 = !DILocalVariable(name: "face_array", scope: !1270, file: !1, line: 915, type: !67)
!1270 = distinct !DILexicalBlock(scope: !474, file: !1, line: 914, column: 3)
!1271 = !DILocation(line: 915, column: 19, scope: !1270)
!1272 = !DILocalVariable(name: "face", scope: !1270, file: !1, line: 915, type: !44)
!1273 = !DILocation(line: 915, column: 36, scope: !1270)
!1274 = !DILocalVariable(name: "face_coords", scope: !1270, file: !1, line: 916, type: !72)
!1275 = !DILocation(line: 916, column: 19, scope: !1270)
!1276 = !DILocalVariable(name: "cos", scope: !1270, file: !1, line: 916, type: !43)
!1277 = !DILocation(line: 916, column: 37, scope: !1270)
!1278 = !DILocalVariable(name: "sf_tri_tot", scope: !1270, file: !1, line: 917, type: !5)
!1279 = !DILocation(line: 917, column: 17, scope: !1270)
!1280 = !DILocalVariable(name: "bounds", scope: !1270, file: !1, line: 918, type: !77)
!1281 = !DILocation(line: 918, column: 9, scope: !1270)
!1282 = !DILocalVariable(name: "face_index", scope: !1270, file: !1, line: 919, type: !5)
!1283 = !DILocation(line: 919, column: 17, scope: !1270)
!1284 = !DILocalVariable(name: "scanfill_flag", scope: !1270, file: !1, line: 920, type: !247)
!1285 = !DILocation(line: 920, column: 8, scope: !1270)
!1286 = !DILocalVariable(name: "is_isect", scope: !1270, file: !1, line: 922, type: !295)
!1287 = !DILocation(line: 922, column: 9, scope: !1270)
!1288 = !DILocalVariable(name: "isect_remvertbase", scope: !1270, file: !1, line: 923, type: !272)
!1289 = !DILocation(line: 923, column: 13, scope: !1270)
!1290 = !DILocalVariable(name: "isect_remedgebase", scope: !1270, file: !1, line: 924, type: !272)
!1291 = !DILocation(line: 924, column: 13, scope: !1270)
!1292 = !DILocation(line: 927, column: 18, scope: !1270)
!1293 = !DILocation(line: 927, column: 52, scope: !1270)
!1294 = !DILocation(line: 927, column: 50, scope: !1270)
!1295 = !DILocation(line: 927, column: 16, scope: !1270)
!1296 = !DILocation(line: 930, column: 4, scope: !1270)
!1297 = !DILocation(line: 933, column: 19, scope: !1270)
!1298 = !DILocation(line: 933, column: 10, scope: !1270)
!1299 = !DILocation(line: 933, column: 8, scope: !1270)
!1300 = !DILocation(line: 934, column: 26, scope: !1301)
!1301 = distinct !DILexicalBlock(scope: !1270, file: !1, line: 934, column: 4)
!1302 = !DILocation(line: 934, column: 39, scope: !1301)
!1303 = !DILocation(line: 934, column: 19, scope: !1301)
!1304 = !DILocation(line: 934, column: 17, scope: !1301)
!1305 = !DILocation(line: 934, column: 9, scope: !1301)
!1306 = !DILocation(line: 934, column: 46, scope: !1307)
!1307 = distinct !DILexicalBlock(scope: !1301, file: !1, line: 934, column: 4)
!1308 = !DILocation(line: 934, column: 4, scope: !1301)
!1309 = !DILocation(line: 935, column: 20, scope: !1310)
!1310 = distinct !DILexicalBlock(scope: !1307, file: !1, line: 934, column: 79)
!1311 = !DILocation(line: 935, column: 29, scope: !1310)
!1312 = !DILocation(line: 935, column: 18, scope: !1310)
!1313 = !DILocation(line: 936, column: 16, scope: !1310)
!1314 = !DILocation(line: 936, column: 21, scope: !1310)
!1315 = !DILocation(line: 936, column: 30, scope: !1310)
!1316 = !DILocation(line: 936, column: 5, scope: !1310)
!1317 = !DILocation(line: 939, column: 9, scope: !1318)
!1318 = distinct !DILexicalBlock(scope: !1310, file: !1, line: 939, column: 9)
!1319 = !DILocation(line: 939, column: 18, scope: !1318)
!1320 = !DILocation(line: 939, column: 27, scope: !1318)
!1321 = !DILocation(line: 939, column: 9, scope: !1310)
!1322 = !DILocation(line: 940, column: 26, scope: !1323)
!1323 = distinct !DILexicalBlock(scope: !1318, file: !1, line: 939, column: 51)
!1324 = !DILocation(line: 940, column: 40, scope: !1323)
!1325 = !DILocation(line: 940, column: 6, scope: !1323)
!1326 = !DILocation(line: 941, column: 5, scope: !1323)
!1327 = !DILocation(line: 944, column: 35, scope: !1310)
!1328 = !DILocation(line: 944, column: 5, scope: !1310)
!1329 = !DILocation(line: 946, column: 9, scope: !1310)
!1330 = !DILocation(line: 947, column: 4, scope: !1310)
!1331 = !DILocation(line: 934, column: 65, scope: !1307)
!1332 = !DILocation(line: 934, column: 63, scope: !1307)
!1333 = !DILocation(line: 934, column: 4, scope: !1307)
!1334 = distinct !{!1334, !1308, !1335}
!1335 = !DILocation(line: 947, column: 4, scope: !1301)
!1336 = !DILocation(line: 954, column: 9, scope: !1337)
!1337 = distinct !DILexicalBlock(scope: !1270, file: !1, line: 954, column: 8)
!1338 = !DILocation(line: 954, column: 18, scope: !1337)
!1339 = !DILocation(line: 954, column: 23, scope: !1337)
!1340 = !DILocation(line: 954, column: 54, scope: !1337)
!1341 = !DILocation(line: 955, column: 20, scope: !1337)
!1342 = !DILocation(line: 955, column: 18, scope: !1337)
!1343 = !DILocation(line: 955, column: 8, scope: !1337)
!1344 = !DILocation(line: 954, column: 8, scope: !1270)
!1345 = !DILocalVariable(name: "sf_vert_tot_isect", scope: !1346, file: !1, line: 959, type: !5)
!1346 = distinct !DILexicalBlock(scope: !1337, file: !1, line: 958, column: 4)
!1347 = !DILocation(line: 959, column: 18, scope: !1346)
!1348 = !DILocation(line: 959, column: 74, scope: !1346)
!1349 = !DILocation(line: 959, column: 52, scope: !1346)
!1350 = !DILocalVariable(name: "i", scope: !1346, file: !1, line: 960, type: !5)
!1351 = !DILocation(line: 960, column: 18, scope: !1346)
!1352 = !DILocation(line: 960, column: 22, scope: !1346)
!1353 = !DILocation(line: 962, column: 19, scope: !1346)
!1354 = !DILocation(line: 962, column: 17, scope: !1346)
!1355 = !DILocation(line: 964, column: 21, scope: !1346)
!1356 = !DILocation(line: 964, column: 33, scope: !1346)
!1357 = !DILocation(line: 964, column: 9, scope: !1346)
!1358 = !DILocation(line: 966, column: 27, scope: !1359)
!1359 = distinct !DILexicalBlock(scope: !1346, file: !1, line: 966, column: 5)
!1360 = !DILocation(line: 966, column: 40, scope: !1359)
!1361 = !DILocation(line: 966, column: 20, scope: !1359)
!1362 = !DILocation(line: 966, column: 18, scope: !1359)
!1363 = !DILocation(line: 966, column: 10, scope: !1359)
!1364 = !DILocation(line: 966, column: 47, scope: !1365)
!1365 = distinct !DILexicalBlock(scope: !1359, file: !1, line: 966, column: 5)
!1366 = !DILocation(line: 966, column: 5, scope: !1359)
!1367 = !DILocation(line: 967, column: 17, scope: !1368)
!1368 = distinct !DILexicalBlock(scope: !1365, file: !1, line: 966, column: 81)
!1369 = !DILocation(line: 967, column: 22, scope: !1368)
!1370 = !DILocation(line: 967, column: 31, scope: !1368)
!1371 = !DILocation(line: 967, column: 6, scope: !1368)
!1372 = !DILocation(line: 968, column: 24, scope: !1368)
!1373 = !DILocation(line: 968, column: 6, scope: !1368)
!1374 = !DILocation(line: 968, column: 15, scope: !1368)
!1375 = !DILocation(line: 968, column: 19, scope: !1368)
