; ModuleID = 'blender/source/blender/bmesh/tools/bmesh_beautify.c'
source_filename = "blender/source/blender/bmesh/tools/bmesh_beautify.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BMVert = type { %struct.BMHeader, %struct.BMFlagLayer*, [3 x float], [3 x float], %struct.BMEdge* }
%struct.BMHeader = type { i8*, i32, i8, i8, i8 }
%struct.BMFlagLayer = type { i16 }
%struct.BMEdge = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMVert*, %struct.BMVert*, %struct.BMLoop*, %struct.BMDiskLink, %struct.BMDiskLink }
%struct.BMLoop = type { %struct.BMHeader, %struct.BMVert*, %struct.BMEdge*, %struct.BMFace*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop* }
%struct.BMFace = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMLoop*, i32, [3 x float], i16 }
%struct.BMDiskLink = type { %struct.BMEdge*, %struct.BMEdge* }
%struct.BMesh = type { i32, i32, i32, i32, i32, i32, i32, i8, i8, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BMVert**, %struct.BMEdge**, %struct.BMFace**, i32, i32, i32, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, i32, %struct.BMOperator*, %struct.CustomData, %struct.CustomData, %struct.CustomData, %struct.CustomData, i16, i32, i32, i32, %struct.ListBase, %struct.BMFace*, %struct.ListBase, i8* }
%struct.BLI_mempool = type opaque

!19 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_operator_api.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!20 = !{!21, !22, !23, !24, !25, !26, !27, !28}
!21 = !DIEnumerator(name: "BMO_OP_SLOT_BOOL", value: 1, isUnsigned: true)
!22 = !DIEnumerator(name: "BMO_OP_SLOT_INT", value: 2, isUnsigned: true)
!23 = !DIEnumerator(name: "BMO_OP_SLOT_FLT", value: 3, isUnsigned: true)
!24 = !DIEnumerator(name: "BMO_OP_SLOT_PTR", value: 4, isUnsigned: true)
!25 = !DIEnumerator(name: "BMO_OP_SLOT_MAT", value: 5, isUnsigned: true)
!26 = !DIEnumerator(name: "BMO_OP_SLOT_VEC", value: 8, isUnsigned: true)
!27 = !DIEnumerator(name: "BMO_OP_SLOT_ELEMENT_BUF", value: 9, isUnsigned: true)
!28 = !DIEnumerator(name: "BMO_OP_SLOT_MAPPING", value: 10, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Elem", file: !19, line: 116, baseType: !5, size: 32, elements: !30)
!30 = !{!31, !32, !33, !34}
!31 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_VERT", value: 1, isUnsigned: true)
!32 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_EDGE", value: 2, isUnsigned: true)
!33 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_FACE", value: 8, isUnsigned: true)
!34 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_IS_SINGLE", value: 16, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Ptr", file: !19, line: 131, baseType: !5, size: 32, elements: !36)
!36 = !{!37, !38, !39, !40}
!37 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_BMESH", value: 100, isUnsigned: true)
!38 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_SCENE", value: 101, isUnsigned: true)
!39 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_OBJECT", value: 102, isUnsigned: true)
!40 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_MESH", value: 103, isUnsigned: true)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Map", file: !19, line: 123, baseType: !5, size: 32, elements: !42)
!42 = !{!43, !44, !45, !46, !47, !48}
!43 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_EMPTY", value: 64, isUnsigned: true)
!44 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_ELEM", value: 65, isUnsigned: true)
!45 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_FLT", value: 66, isUnsigned: true)
!46 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INT", value: 67, isUnsigned: true)
!47 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_BOOL", value: 68, isUnsigned: true)
!48 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INTERNAL", value: 69, isUnsigned: true)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !19, line: 182, baseType: !5, size: 32, elements: !50)
!50 = !{!51, !52, !53, !54, !55}
!51 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NOP", value: 0, isUnsigned: true)
!52 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_UNTAN_MULTIRES", value: 1, isUnsigned: true)
!53 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NORMALS_CALC", value: 2, isUnsigned: true)
!54 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_FLUSH", value: 4, isUnsigned: true)
!55 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !57, line: 83, baseType: !5, size: 32, elements: !58)
!57 = !DIFile(filename: "blender/source/blender/blenlib/BLI_mempool.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!58 = !{!59, !60}
!59 = !DIEnumerator(name: "BLI_MEMPOOL_NOP", value: 0, isUnsigned: true)
!60 = !DIEnumerator(name: "BLI_MEMPOOL_ALLOW_ITER", value: 1, isUnsigned: true)
!61 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 249, baseType: !5, size: 32, elements: !62)
!62 = !{!63, !64, !65, !66}
!63 = !DIEnumerator(name: "BM_VERT", value: 1, isUnsigned: true)
!64 = !DIEnumerator(name: "BM_EDGE", value: 2, isUnsigned: true)
!65 = !DIEnumerator(name: "BM_LOOP", value: 4, isUnsigned: true)
!66 = !DIEnumerator(name: "BM_FACE", value: 8, isUnsigned: true)
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !68, line: 74, baseType: !5, size: 32, elements: !69)
!68 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_mods.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!69 = !{!70, !71, !72, !73}
!70 = !DIEnumerator(name: "BM_EDGEROT_CHECK_EXISTS", value: 1, isUnsigned: true)
!71 = !DIEnumerator(name: "BM_EDGEROT_CHECK_SPLICE", value: 2, isUnsigned: true)
!72 = !DIEnumerator(name: "BM_EDGEROT_CHECK_DEGENERATE", value: 4, isUnsigned: true)
!73 = !DIEnumerator(name: "BM_EDGEROT_CHECK_BEAUTY", value: 8, isUnsigned: true)
!74 = !{!75, !5, !78, !79, !147}
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !76, line: 46, baseType: !77)
!76 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!77 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !82)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !9, line: 123, baseType: !83)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !9, line: 110, size: 640, elements: !84)
!84 = !{!85, !96, !102, !116, !117, !140, !146}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !83, file: !9, line: 111, baseType: !86, size: 128)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !9, line: 82, baseType: !87)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !9, line: 64, size: 128, elements: !88)
!88 = !{!89, !90, !92, !94, !95}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !87, file: !9, line: 65, baseType: !78, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !87, file: !9, line: 66, baseType: !91, size: 32, offset: 64)
!91 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !87, file: !9, line: 73, baseType: !93, size: 8, offset: 96)
!93 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !87, file: !9, line: 74, baseType: !93, size: 8, offset: 104)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !87, file: !9, line: 80, baseType: !93, size: 8, offset: 112)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !83, file: !9, line: 112, baseType: !97, size: 64, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !9, line: 180, size: 16, elements: !99)
!99 = !{!100}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !98, file: !9, line: 181, baseType: !101, size: 16)
!101 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !83, file: !9, line: 114, baseType: !103, size: 64, offset: 192)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !9, line: 90, size: 448, elements: !105)
!105 = !{!106, !107, !108, !113, !114}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !104, file: !9, line: 91, baseType: !86, size: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !104, file: !9, line: 92, baseType: !97, size: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !104, file: !9, line: 94, baseType: !109, size: 96, offset: 192)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 96, elements: !111)
!110 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!111 = !{!112}
!112 = !DISubrange(count: 3)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !104, file: !9, line: 95, baseType: !109, size: 96, offset: 288)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !104, file: !9, line: 102, baseType: !115, size: 64, offset: 384)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !83, file: !9, line: 114, baseType: !103, size: 64, offset: 256)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !83, file: !9, line: 118, baseType: !118, size: 64, offset: 320)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !9, line: 125, size: 576, elements: !120)
!120 = !{!121, !122, !123, !124, !136, !137, !138, !139}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !119, file: !9, line: 126, baseType: !86, size: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !119, file: !9, line: 129, baseType: !103, size: 64, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !119, file: !9, line: 130, baseType: !115, size: 64, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !119, file: !9, line: 131, baseType: !125, size: 64, offset: 256)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !9, line: 164, size: 448, elements: !127)
!127 = !{!128, !129, !130, !133, !134, !135}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !126, file: !9, line: 165, baseType: !86, size: 128)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !126, file: !9, line: 166, baseType: !97, size: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !126, file: !9, line: 172, baseType: !131, size: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !9, line: 140, baseType: !119)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !126, file: !9, line: 174, baseType: !91, size: 32, offset: 256)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !126, file: !9, line: 175, baseType: !109, size: 96, offset: 288)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !126, file: !9, line: 176, baseType: !101, size: 16, offset: 384)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !119, file: !9, line: 135, baseType: !118, size: 64, offset: 320)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !119, file: !9, line: 135, baseType: !118, size: 64, offset: 384)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !119, file: !9, line: 139, baseType: !118, size: 64, offset: 448)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !119, file: !9, line: 139, baseType: !118, size: 64, offset: 512)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !83, file: !9, line: 122, baseType: !141, size: 128, offset: 384)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !9, line: 108, baseType: !142)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !9, line: 106, size: 128, elements: !143)
!143 = !{!144, !145}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !142, file: !9, line: 107, baseType: !115, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !142, file: !9, line: 107, baseType: !115, size: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !83, file: !9, line: 122, baseType: !141, size: 128, offset: 512)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSetHashFP", file: !148, line: 178, baseType: !149)
!148 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashHashFP", file: !148, line: 43, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!5, !153}
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!155 = !{i32 7, !"Dwarf Version", i32 4}
!156 = !{i32 2, !"Debug Info Version", i32 3}
!157 = !{i32 1, !"wchar_size", i32 4}
!158 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!159 = distinct !DISubprogram(name: "BM_verts_calc_rotate_beauty", scope: !1, file: !1, line: 275, type: !160, scopeLine: 278, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !166)
!160 = !DISubroutineType(types: !161)
!161 = !{!110, !162, !162, !162, !162, !165, !165}
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !164)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !9, line: 103, baseType: !104)
!165 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !101)
!166 = !{}
!167 = !DILocalVariable(name: "v1", arg: 1, scope: !159, file: !1, line: 276, type: !162)
!168 = !DILocation(line: 276, column: 23, scope: !159)
!169 = !DILocalVariable(name: "v2", arg: 2, scope: !159, file: !1, line: 276, type: !162)
!170 = !DILocation(line: 276, column: 41, scope: !159)
!171 = !DILocalVariable(name: "v3", arg: 3, scope: !159, file: !1, line: 276, type: !162)
!172 = !DILocation(line: 276, column: 59, scope: !159)
!173 = !DILocalVariable(name: "v4", arg: 4, scope: !159, file: !1, line: 276, type: !162)
!174 = !DILocation(line: 276, column: 77, scope: !159)
!175 = !DILocalVariable(name: "flag", arg: 5, scope: !159, file: !1, line: 277, type: !165)
!176 = !DILocation(line: 277, column: 21, scope: !159)
!177 = !DILocalVariable(name: "method", arg: 6, scope: !159, file: !1, line: 277, type: !165)
!178 = !DILocation(line: 277, column: 39, scope: !159)
!179 = !DILocation(line: 280, column: 2, scope: !159)
!180 = !DILocation(line: 281, column: 7, scope: !181)
!181 = distinct !DILexicalBlock(scope: !182, file: !1, line: 281, column: 7)
!182 = distinct !DILexicalBlock(scope: !159, file: !1, line: 280, column: 5)
!183 = !DILocation(line: 281, column: 12, scope: !181)
!184 = !DILocation(line: 281, column: 7, scope: !182)
!185 = !DILocalVariable(name: "v_a", scope: !186, file: !1, line: 282, type: !162)
!186 = distinct !DILexicalBlock(scope: !181, file: !1, line: 281, column: 33)
!187 = !DILocation(line: 282, column: 18, scope: !186)
!188 = !DILocation(line: 282, column: 24, scope: !186)
!189 = !DILocalVariable(name: "v_b", scope: !186, file: !1, line: 282, type: !162)
!190 = !DILocation(line: 282, column: 29, scope: !186)
!191 = !DILocation(line: 282, column: 35, scope: !186)
!192 = !DILocation(line: 283, column: 8, scope: !193)
!193 = distinct !DILexicalBlock(scope: !186, file: !1, line: 283, column: 8)
!194 = !DILocation(line: 283, column: 48, scope: !193)
!195 = !DILocation(line: 283, column: 44, scope: !193)
!196 = !DILocation(line: 283, column: 8, scope: !186)
!197 = !DILocation(line: 284, column: 5, scope: !198)
!198 = distinct !DILexicalBlock(scope: !193, file: !1, line: 283, column: 85)
!199 = !DILocation(line: 286, column: 3, scope: !186)
!200 = !DILocation(line: 288, column: 7, scope: !201)
!201 = distinct !DILexicalBlock(scope: !182, file: !1, line: 288, column: 7)
!202 = !DILocation(line: 288, column: 7, scope: !182)
!203 = !DILocation(line: 290, column: 4, scope: !204)
!204 = distinct !DILexicalBlock(scope: !201, file: !1, line: 288, column: 27)
!205 = !DILocation(line: 293, column: 11, scope: !182)
!206 = !DILocation(line: 293, column: 3, scope: !182)
!207 = !DILocation(line: 295, column: 45, scope: !208)
!208 = distinct !DILexicalBlock(scope: !182, file: !1, line: 293, column: 19)
!209 = !DILocation(line: 295, column: 49, scope: !208)
!210 = !DILocation(line: 295, column: 53, scope: !208)
!211 = !DILocation(line: 295, column: 57, scope: !208)
!212 = !DILocation(line: 295, column: 61, scope: !208)
!213 = !DILocation(line: 295, column: 65, scope: !208)
!214 = !DILocation(line: 295, column: 69, scope: !208)
!215 = !DILocation(line: 295, column: 73, scope: !208)
!216 = !DILocation(line: 295, column: 12, scope: !208)
!217 = !DILocation(line: 295, column: 5, scope: !208)
!218 = !DILocation(line: 297, column: 46, scope: !208)
!219 = !DILocation(line: 297, column: 50, scope: !208)
!220 = !DILocation(line: 297, column: 54, scope: !208)
!221 = !DILocation(line: 297, column: 58, scope: !208)
!222 = !DILocation(line: 297, column: 62, scope: !208)
!223 = !DILocation(line: 297, column: 66, scope: !208)
!224 = !DILocation(line: 297, column: 70, scope: !208)
!225 = !DILocation(line: 297, column: 74, scope: !208)
!226 = !DILocation(line: 297, column: 12, scope: !208)
!227 = !DILocation(line: 297, column: 5, scope: !208)
!228 = !DILocation(line: 301, column: 2, scope: !159)
!229 = !DILocation(line: 302, column: 1, scope: !159)
!230 = distinct !DISubprogram(name: "_bm_elem_flag_test", scope: !231, file: !231, line: 42, type: !232, scopeLine: 43, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !166)
!231 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_inline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!232 = !DISubroutineType(types: !233)
!233 = !{!93, !234, !236}
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !86)
!236 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!237 = !DILocalVariable(name: "head", arg: 1, scope: !230, file: !231, line: 42, type: !234)
!238 = !DILocation(line: 42, column: 52, scope: !230)
!239 = !DILocalVariable(name: "hflag", arg: 2, scope: !230, file: !231, line: 42, type: !236)
!240 = !DILocation(line: 42, column: 69, scope: !230)
!241 = !DILocation(line: 44, column: 9, scope: !230)
!242 = !DILocation(line: 44, column: 15, scope: !230)
!243 = !DILocation(line: 44, column: 23, scope: !230)
!244 = !DILocation(line: 44, column: 21, scope: !230)
!245 = !DILocation(line: 44, column: 2, scope: !230)
!246 = distinct !DISubprogram(name: "bm_edge_calc_rotate_beauty__area", scope: !1, file: !1, line: 131, type: !247, scopeLine: 133, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !166)
!247 = !DISubroutineType(types: !248)
!248 = !{!110, !249, !249, !249, !249}
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!251 = !DILocalVariable(name: "v1", arg: 1, scope: !246, file: !1, line: 132, type: !249)
!252 = !DILocation(line: 132, column: 21, scope: !246)
!253 = !DILocalVariable(name: "v2", arg: 2, scope: !246, file: !1, line: 132, type: !249)
!254 = !DILocation(line: 132, column: 40, scope: !246)
!255 = !DILocalVariable(name: "v3", arg: 3, scope: !246, file: !1, line: 132, type: !249)
!256 = !DILocation(line: 132, column: 59, scope: !246)
!257 = !DILocalVariable(name: "v4", arg: 4, scope: !246, file: !1, line: 132, type: !249)
!258 = !DILocation(line: 132, column: 78, scope: !246)
!259 = !DILocation(line: 135, column: 2, scope: !246)
!260 = !DILocalVariable(name: "v1_xy", scope: !261, file: !1, line: 136, type: !262)
!261 = distinct !DILexicalBlock(scope: !246, file: !1, line: 135, column: 5)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 64, elements: !263)
!263 = !{!264}
!264 = !DISubrange(count: 2)
!265 = !DILocation(line: 136, column: 9, scope: !261)
!266 = !DILocalVariable(name: "v2_xy", scope: !261, file: !1, line: 136, type: !262)
!267 = !DILocation(line: 136, column: 19, scope: !261)
!268 = !DILocalVariable(name: "v3_xy", scope: !261, file: !1, line: 136, type: !262)
!269 = !DILocation(line: 136, column: 29, scope: !261)
!270 = !DILocalVariable(name: "v4_xy", scope: !261, file: !1, line: 136, type: !262)
!271 = !DILocation(line: 136, column: 39, scope: !261)
!272 = !DILocalVariable(name: "is_zero_a", scope: !261, file: !1, line: 137, type: !273)
!273 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!274 = !DILocation(line: 137, column: 8, scope: !261)
!275 = !DILocalVariable(name: "is_zero_b", scope: !261, file: !1, line: 137, type: !273)
!276 = !DILocation(line: 137, column: 19, scope: !261)
!277 = !DILocalVariable(name: "no_a", scope: !278, file: !1, line: 141, type: !109)
!278 = distinct !DILexicalBlock(scope: !261, file: !1, line: 140, column: 3)
!279 = !DILocation(line: 141, column: 10, scope: !278)
!280 = !DILocalVariable(name: "no_b", scope: !278, file: !1, line: 141, type: !109)
!281 = !DILocation(line: 141, column: 19, scope: !278)
!282 = !DILocalVariable(name: "no", scope: !278, file: !1, line: 142, type: !109)
!283 = !DILocation(line: 142, column: 10, scope: !278)
!284 = !DILocalVariable(name: "axis_mat", scope: !278, file: !1, line: 143, type: !285)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 288, elements: !286)
!286 = !{!112, !112}
!287 = !DILocation(line: 143, column: 10, scope: !278)
!288 = !DILocation(line: 151, column: 31, scope: !278)
!289 = !DILocation(line: 151, column: 37, scope: !278)
!290 = !DILocation(line: 151, column: 41, scope: !278)
!291 = !DILocation(line: 151, column: 45, scope: !278)
!292 = !DILocation(line: 151, column: 17, scope: !278)
!293 = !DILocation(line: 151, column: 49, scope: !278)
!294 = !DILocation(line: 151, column: 16, scope: !278)
!295 = !DILocation(line: 151, column: 14, scope: !278)
!296 = !DILocation(line: 152, column: 31, scope: !278)
!297 = !DILocation(line: 152, column: 37, scope: !278)
!298 = !DILocation(line: 152, column: 41, scope: !278)
!299 = !DILocation(line: 152, column: 45, scope: !278)
!300 = !DILocation(line: 152, column: 17, scope: !278)
!301 = !DILocation(line: 152, column: 49, scope: !278)
!302 = !DILocation(line: 152, column: 16, scope: !278)
!303 = !DILocation(line: 152, column: 14, scope: !278)
!304 = !DILocation(line: 154, column: 8, scope: !305)
!305 = distinct !DILexicalBlock(scope: !278, file: !1, line: 154, column: 8)
!306 = !DILocation(line: 154, column: 8, scope: !278)
!307 = !DILocation(line: 155, column: 17, scope: !308)
!308 = distinct !DILexicalBlock(scope: !305, file: !1, line: 154, column: 58)
!309 = !DILocation(line: 155, column: 21, scope: !308)
!310 = !DILocation(line: 155, column: 27, scope: !308)
!311 = !DILocation(line: 155, column: 5, scope: !308)
!312 = !DILocation(line: 156, column: 9, scope: !313)
!313 = distinct !DILexicalBlock(scope: !308, file: !1, line: 156, column: 9)
!314 = !DILocation(line: 156, column: 9, scope: !308)
!315 = !DILocation(line: 157, column: 6, scope: !316)
!316 = distinct !DILexicalBlock(scope: !313, file: !1, line: 156, column: 52)
!317 = !DILocation(line: 159, column: 4, scope: !308)
!318 = !DILocation(line: 160, column: 13, scope: !319)
!319 = distinct !DILexicalBlock(scope: !305, file: !1, line: 160, column: 13)
!320 = !DILocation(line: 160, column: 23, scope: !319)
!321 = !DILocation(line: 160, column: 13, scope: !305)
!322 = !DILocation(line: 161, column: 16, scope: !323)
!323 = distinct !DILexicalBlock(scope: !319, file: !1, line: 160, column: 33)
!324 = !DILocation(line: 161, column: 20, scope: !323)
!325 = !DILocation(line: 161, column: 5, scope: !323)
!326 = !DILocation(line: 162, column: 4, scope: !323)
!327 = !DILocation(line: 163, column: 13, scope: !328)
!328 = distinct !DILexicalBlock(scope: !319, file: !1, line: 163, column: 13)
!329 = !DILocation(line: 163, column: 23, scope: !328)
!330 = !DILocation(line: 163, column: 13, scope: !319)
!331 = !DILocation(line: 164, column: 16, scope: !332)
!332 = distinct !DILexicalBlock(scope: !328, file: !1, line: 163, column: 33)
!333 = !DILocation(line: 164, column: 20, scope: !332)
!334 = !DILocation(line: 164, column: 5, scope: !332)
!335 = !DILocation(line: 165, column: 4, scope: !332)
!336 = !DILocation(line: 168, column: 5, scope: !337)
!337 = distinct !DILexicalBlock(scope: !328, file: !1, line: 166, column: 9)
!338 = !DILocation(line: 173, column: 27, scope: !278)
!339 = !DILocation(line: 173, column: 37, scope: !278)
!340 = !DILocation(line: 173, column: 4, scope: !278)
!341 = !DILocation(line: 174, column: 16, scope: !278)
!342 = !DILocation(line: 174, column: 23, scope: !278)
!343 = !DILocation(line: 174, column: 33, scope: !278)
!344 = !DILocation(line: 174, column: 4, scope: !278)
!345 = !DILocation(line: 175, column: 16, scope: !278)
!346 = !DILocation(line: 175, column: 23, scope: !278)
!347 = !DILocation(line: 175, column: 33, scope: !278)
!348 = !DILocation(line: 175, column: 4, scope: !278)
!349 = !DILocation(line: 176, column: 16, scope: !278)
!350 = !DILocation(line: 176, column: 23, scope: !278)
!351 = !DILocation(line: 176, column: 33, scope: !278)
!352 = !DILocation(line: 176, column: 4, scope: !278)
!353 = !DILocation(line: 177, column: 16, scope: !278)
!354 = !DILocation(line: 177, column: 23, scope: !278)
!355 = !DILocation(line: 177, column: 33, scope: !278)
!356 = !DILocation(line: 177, column: 4, scope: !278)
!357 = !DILocation(line: 182, column: 7, scope: !358)
!358 = distinct !DILexicalBlock(scope: !261, file: !1, line: 182, column: 7)
!359 = !DILocation(line: 182, column: 17, scope: !358)
!360 = !DILocation(line: 182, column: 26, scope: !358)
!361 = !DILocation(line: 182, column: 29, scope: !358)
!362 = !DILocation(line: 182, column: 39, scope: !358)
!363 = !DILocation(line: 182, column: 7, scope: !261)
!364 = !DILocation(line: 184, column: 27, scope: !365)
!365 = distinct !DILexicalBlock(scope: !366, file: !1, line: 184, column: 8)
!366 = distinct !DILexicalBlock(scope: !358, file: !1, line: 182, column: 49)
!367 = !DILocation(line: 184, column: 34, scope: !365)
!368 = !DILocation(line: 184, column: 41, scope: !365)
!369 = !DILocation(line: 184, column: 48, scope: !365)
!370 = !DILocation(line: 184, column: 9, scope: !365)
!371 = !DILocation(line: 184, column: 8, scope: !366)
!372 = !DILocation(line: 185, column: 5, scope: !373)
!373 = distinct !DILexicalBlock(scope: !365, file: !1, line: 184, column: 56)
!374 = !DILocation(line: 187, column: 3, scope: !366)
!375 = !DILocalVariable(name: "area_a", scope: !376, file: !1, line: 191, type: !110)
!376 = distinct !DILexicalBlock(scope: !358, file: !1, line: 188, column: 8)
!377 = !DILocation(line: 191, column: 10, scope: !376)
!378 = !DILocalVariable(name: "area_b", scope: !376, file: !1, line: 191, type: !110)
!379 = !DILocation(line: 191, column: 18, scope: !376)
!380 = !DILocation(line: 193, column: 32, scope: !376)
!381 = !DILocation(line: 193, column: 39, scope: !376)
!382 = !DILocation(line: 193, column: 46, scope: !376)
!383 = !DILocation(line: 193, column: 13, scope: !376)
!384 = !DILocation(line: 193, column: 11, scope: !376)
!385 = !DILocation(line: 194, column: 32, scope: !376)
!386 = !DILocation(line: 194, column: 39, scope: !376)
!387 = !DILocation(line: 194, column: 46, scope: !376)
!388 = !DILocation(line: 194, column: 13, scope: !376)
!389 = !DILocation(line: 194, column: 11, scope: !376)
!390 = !DILocation(line: 196, column: 15, scope: !391)
!391 = distinct !DILexicalBlock(scope: !376, file: !1, line: 196, column: 8)
!392 = !DILocation(line: 196, column: 9, scope: !391)
!393 = !DILocation(line: 196, column: 23, scope: !391)
!394 = !DILocation(line: 196, column: 39, scope: !391)
!395 = !DILocation(line: 196, column: 49, scope: !391)
!396 = !DILocation(line: 196, column: 43, scope: !391)
!397 = !DILocation(line: 196, column: 57, scope: !391)
!398 = !DILocation(line: 196, column: 8, scope: !376)
!399 = !DILocation(line: 198, column: 5, scope: !400)
!400 = distinct !DILexicalBlock(scope: !391, file: !1, line: 196, column: 74)
!401 = !DILocation(line: 201, column: 9, scope: !402)
!402 = distinct !DILexicalBlock(scope: !376, file: !1, line: 201, column: 8)
!403 = !DILocation(line: 201, column: 16, scope: !402)
!404 = !DILocation(line: 201, column: 29, scope: !402)
!405 = !DILocation(line: 201, column: 36, scope: !402)
!406 = !DILocation(line: 201, column: 25, scope: !402)
!407 = !DILocation(line: 201, column: 8, scope: !376)
!408 = !DILocation(line: 203, column: 5, scope: !409)
!409 = distinct !DILexicalBlock(scope: !402, file: !1, line: 201, column: 46)
!410 = !DILocalVariable(name: "area_a", scope: !411, file: !1, line: 210, type: !110)
!411 = distinct !DILexicalBlock(scope: !261, file: !1, line: 207, column: 3)
!412 = !DILocation(line: 210, column: 10, scope: !411)
!413 = !DILocalVariable(name: "area_b", scope: !411, file: !1, line: 210, type: !110)
!414 = !DILocation(line: 210, column: 18, scope: !411)
!415 = !DILocalVariable(name: "prim_a", scope: !411, file: !1, line: 211, type: !110)
!416 = !DILocation(line: 211, column: 10, scope: !411)
!417 = !DILocalVariable(name: "prim_b", scope: !411, file: !1, line: 211, type: !110)
!418 = !DILocation(line: 211, column: 18, scope: !411)
!419 = !DILocalVariable(name: "fac_24", scope: !411, file: !1, line: 212, type: !110)
!420 = !DILocation(line: 212, column: 10, scope: !411)
!421 = !DILocalVariable(name: "fac_13", scope: !411, file: !1, line: 212, type: !110)
!422 = !DILocation(line: 212, column: 18, scope: !411)
!423 = !DILocalVariable(name: "len_12", scope: !411, file: !1, line: 214, type: !110)
!424 = !DILocation(line: 214, column: 10, scope: !411)
!425 = !DILocalVariable(name: "len_23", scope: !411, file: !1, line: 214, type: !110)
!426 = !DILocation(line: 214, column: 18, scope: !411)
!427 = !DILocalVariable(name: "len_34", scope: !411, file: !1, line: 214, type: !110)
!428 = !DILocation(line: 214, column: 26, scope: !411)
!429 = !DILocalVariable(name: "len_41", scope: !411, file: !1, line: 214, type: !110)
!430 = !DILocation(line: 214, column: 34, scope: !411)
!431 = !DILocalVariable(name: "len_24", scope: !411, file: !1, line: 214, type: !110)
!432 = !DILocation(line: 214, column: 42, scope: !411)
!433 = !DILocalVariable(name: "len_13", scope: !411, file: !1, line: 214, type: !110)
!434 = !DILocation(line: 214, column: 50, scope: !411)
!435 = !DILocation(line: 217, column: 22, scope: !411)
!436 = !DILocation(line: 217, column: 29, scope: !411)
!437 = !DILocation(line: 217, column: 13, scope: !411)
!438 = !DILocation(line: 217, column: 11, scope: !411)
!439 = !DILocation(line: 218, column: 22, scope: !411)
!440 = !DILocation(line: 218, column: 29, scope: !411)
!441 = !DILocation(line: 218, column: 13, scope: !411)
!442 = !DILocation(line: 218, column: 11, scope: !411)
!443 = !DILocation(line: 219, column: 22, scope: !411)
!444 = !DILocation(line: 219, column: 29, scope: !411)
!445 = !DILocation(line: 219, column: 13, scope: !411)
!446 = !DILocation(line: 219, column: 11, scope: !411)
!447 = !DILocation(line: 220, column: 22, scope: !411)
!448 = !DILocation(line: 220, column: 29, scope: !411)
!449 = !DILocation(line: 220, column: 13, scope: !411)
!450 = !DILocation(line: 220, column: 11, scope: !411)
!451 = !DILocation(line: 222, column: 22, scope: !411)
!452 = !DILocation(line: 222, column: 29, scope: !411)
!453 = !DILocation(line: 222, column: 13, scope: !411)
!454 = !DILocation(line: 222, column: 11, scope: !411)
!455 = !DILocation(line: 223, column: 22, scope: !411)
!456 = !DILocation(line: 223, column: 29, scope: !411)
!457 = !DILocation(line: 223, column: 13, scope: !411)
!458 = !DILocation(line: 223, column: 11, scope: !411)
!459 = !DILocation(line: 226, column: 25, scope: !411)
!460 = !DILocation(line: 226, column: 32, scope: !411)
!461 = !DILocation(line: 226, column: 39, scope: !411)
!462 = !DILocation(line: 226, column: 13, scope: !411)
!463 = !DILocation(line: 226, column: 11, scope: !411)
!464 = !DILocation(line: 227, column: 25, scope: !411)
!465 = !DILocation(line: 227, column: 32, scope: !411)
!466 = !DILocation(line: 227, column: 39, scope: !411)
!467 = !DILocation(line: 227, column: 13, scope: !411)
!468 = !DILocation(line: 227, column: 11, scope: !411)
!469 = !DILocation(line: 228, column: 13, scope: !411)
!470 = !DILocation(line: 228, column: 22, scope: !411)
!471 = !DILocation(line: 228, column: 20, scope: !411)
!472 = !DILocation(line: 228, column: 31, scope: !411)
!473 = !DILocation(line: 228, column: 29, scope: !411)
!474 = !DILocation(line: 228, column: 11, scope: !411)
!475 = !DILocation(line: 229, column: 13, scope: !411)
!476 = !DILocation(line: 229, column: 22, scope: !411)
!477 = !DILocation(line: 229, column: 20, scope: !411)
!478 = !DILocation(line: 229, column: 31, scope: !411)
!479 = !DILocation(line: 229, column: 29, scope: !411)
!480 = !DILocation(line: 229, column: 11, scope: !411)
!481 = !DILocation(line: 230, column: 14, scope: !411)
!482 = !DILocation(line: 230, column: 23, scope: !411)
!483 = !DILocation(line: 230, column: 21, scope: !411)
!484 = !DILocation(line: 230, column: 34, scope: !411)
!485 = !DILocation(line: 230, column: 43, scope: !411)
!486 = !DILocation(line: 230, column: 41, scope: !411)
!487 = !DILocation(line: 230, column: 31, scope: !411)
!488 = !DILocation(line: 230, column: 11, scope: !411)
!489 = !DILocation(line: 233, column: 25, scope: !411)
!490 = !DILocation(line: 233, column: 32, scope: !411)
!491 = !DILocation(line: 233, column: 39, scope: !411)
!492 = !DILocation(line: 233, column: 13, scope: !411)
!493 = !DILocation(line: 233, column: 11, scope: !411)
!494 = !DILocation(line: 234, column: 25, scope: !411)
!495 = !DILocation(line: 234, column: 32, scope: !411)
!496 = !DILocation(line: 234, column: 39, scope: !411)
!497 = !DILocation(line: 234, column: 13, scope: !411)
!498 = !DILocation(line: 234, column: 11, scope: !411)
!499 = !DILocation(line: 235, column: 13, scope: !411)
!500 = !DILocation(line: 235, column: 22, scope: !411)
!501 = !DILocation(line: 235, column: 20, scope: !411)
!502 = !DILocation(line: 235, column: 31, scope: !411)
!503 = !DILocation(line: 235, column: 29, scope: !411)
!504 = !DILocation(line: 235, column: 11, scope: !411)
!505 = !DILocation(line: 236, column: 13, scope: !411)
!506 = !DILocation(line: 236, column: 22, scope: !411)
!507 = !DILocation(line: 236, column: 20, scope: !411)
!508 = !DILocation(line: 236, column: 31, scope: !411)
!509 = !DILocation(line: 236, column: 29, scope: !411)
!510 = !DILocation(line: 236, column: 11, scope: !411)
!511 = !DILocation(line: 237, column: 14, scope: !411)
!512 = !DILocation(line: 237, column: 23, scope: !411)
!513 = !DILocation(line: 237, column: 21, scope: !411)
!514 = !DILocation(line: 237, column: 34, scope: !411)
!515 = !DILocation(line: 237, column: 43, scope: !411)
!516 = !DILocation(line: 237, column: 41, scope: !411)
!517 = !DILocation(line: 237, column: 31, scope: !411)
!518 = !DILocation(line: 237, column: 11, scope: !411)
!519 = !DILocation(line: 240, column: 11, scope: !411)
!520 = !DILocation(line: 240, column: 20, scope: !411)
!521 = !DILocation(line: 240, column: 18, scope: !411)
!522 = !DILocation(line: 240, column: 4, scope: !411)
!523 = !DILocation(line: 244, column: 2, scope: !246)
!524 = !DILocation(line: 245, column: 1, scope: !246)
!525 = distinct !DISubprogram(name: "bm_edge_calc_rotate_beauty__angle", scope: !1, file: !1, line: 247, type: !247, scopeLine: 249, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !166)
!526 = !DILocalVariable(name: "v1", arg: 1, scope: !525, file: !1, line: 248, type: !249)
!527 = !DILocation(line: 248, column: 21, scope: !525)
!528 = !DILocalVariable(name: "v2", arg: 2, scope: !525, file: !1, line: 248, type: !249)
!529 = !DILocation(line: 248, column: 40, scope: !525)
!530 = !DILocalVariable(name: "v3", arg: 3, scope: !525, file: !1, line: 248, type: !249)
!531 = !DILocation(line: 248, column: 59, scope: !525)
!532 = !DILocalVariable(name: "v4", arg: 4, scope: !525, file: !1, line: 248, type: !249)
!533 = !DILocation(line: 248, column: 78, scope: !525)
!534 = !DILocation(line: 251, column: 2, scope: !525)
!535 = !DILocalVariable(name: "no_a", scope: !536, file: !1, line: 252, type: !109)
!536 = distinct !DILexicalBlock(scope: !525, file: !1, line: 251, column: 5)
!537 = !DILocation(line: 252, column: 9, scope: !536)
!538 = !DILocalVariable(name: "no_b", scope: !536, file: !1, line: 252, type: !109)
!539 = !DILocation(line: 252, column: 18, scope: !536)
!540 = !DILocalVariable(name: "angle_24", scope: !536, file: !1, line: 253, type: !110)
!541 = !DILocation(line: 253, column: 9, scope: !536)
!542 = !DILocalVariable(name: "angle_13", scope: !536, file: !1, line: 253, type: !110)
!543 = !DILocation(line: 253, column: 19, scope: !536)
!544 = !DILocation(line: 256, column: 17, scope: !536)
!545 = !DILocation(line: 256, column: 23, scope: !536)
!546 = !DILocation(line: 256, column: 27, scope: !536)
!547 = !DILocation(line: 256, column: 31, scope: !536)
!548 = !DILocation(line: 256, column: 3, scope: !536)
!549 = !DILocation(line: 257, column: 17, scope: !536)
!550 = !DILocation(line: 257, column: 23, scope: !536)
!551 = !DILocation(line: 257, column: 27, scope: !536)
!552 = !DILocation(line: 257, column: 31, scope: !536)
!553 = !DILocation(line: 257, column: 3, scope: !536)
!554 = !DILocation(line: 258, column: 36, scope: !536)
!555 = !DILocation(line: 258, column: 42, scope: !536)
!556 = !DILocation(line: 258, column: 14, scope: !536)
!557 = !DILocation(line: 258, column: 12, scope: !536)
!558 = !DILocation(line: 262, column: 22, scope: !559)
!559 = distinct !DILexicalBlock(scope: !536, file: !1, line: 262, column: 7)
!560 = !DILocation(line: 262, column: 28, scope: !559)
!561 = !DILocation(line: 262, column: 32, scope: !559)
!562 = !DILocation(line: 262, column: 36, scope: !559)
!563 = !DILocation(line: 262, column: 8, scope: !559)
!564 = !DILocation(line: 262, column: 40, scope: !559)
!565 = !DILocation(line: 262, column: 49, scope: !559)
!566 = !DILocation(line: 263, column: 22, scope: !559)
!567 = !DILocation(line: 263, column: 28, scope: !559)
!568 = !DILocation(line: 263, column: 32, scope: !559)
!569 = !DILocation(line: 263, column: 36, scope: !559)
!570 = !DILocation(line: 263, column: 8, scope: !559)
!571 = !DILocation(line: 263, column: 40, scope: !559)
!572 = !DILocation(line: 262, column: 7, scope: !536)
!573 = !DILocation(line: 265, column: 4, scope: !574)
!574 = distinct !DILexicalBlock(scope: !559, file: !1, line: 264, column: 3)
!575 = !DILocation(line: 267, column: 36, scope: !536)
!576 = !DILocation(line: 267, column: 42, scope: !536)
!577 = !DILocation(line: 267, column: 14, scope: !536)
!578 = !DILocation(line: 267, column: 12, scope: !536)
!579 = !DILocation(line: 269, column: 10, scope: !536)
!580 = !DILocation(line: 269, column: 21, scope: !536)
!581 = !DILocation(line: 269, column: 19, scope: !536)
!582 = !DILocation(line: 269, column: 3, scope: !536)
!583 = !DILocation(line: 272, column: 2, scope: !525)
!584 = !DILocation(line: 273, column: 1, scope: !525)
!585 = distinct !DISubprogram(name: "BM_mesh_beautify_fill", scope: !1, file: !1, line: 403, type: !586, scopeLine: 406, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !166)
!586 = !DISubroutineType(types: !587)
!587 = !{null, !588, !612, !731, !165, !165, !165, !165}
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !9, line: 246, baseType: !590)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !9, line: 186, size: 8064, elements: !591)
!591 = !{!592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !605, !606, !607, !608, !611, !614, !618, !619, !620, !621, !622, !623, !624, !625, !675, !714, !715, !716, !717, !718, !719, !720, !721, !728, !729, !730}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !590, file: !9, line: 187, baseType: !91, size: 32)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !590, file: !9, line: 187, baseType: !91, size: 32, offset: 32)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !590, file: !9, line: 187, baseType: !91, size: 32, offset: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !590, file: !9, line: 187, baseType: !91, size: 32, offset: 96)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !590, file: !9, line: 188, baseType: !91, size: 32, offset: 128)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !590, file: !9, line: 188, baseType: !91, size: 32, offset: 160)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !590, file: !9, line: 188, baseType: !91, size: 32, offset: 192)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !590, file: !9, line: 193, baseType: !93, size: 8, offset: 224)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !590, file: !9, line: 197, baseType: !93, size: 8, offset: 232)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !590, file: !9, line: 201, baseType: !602, size: 64, offset: 256)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !604, line: 71, flags: DIFlagFwdDecl)
!604 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!605 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !590, file: !9, line: 201, baseType: !602, size: 64, offset: 320)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !590, file: !9, line: 201, baseType: !602, size: 64, offset: 384)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !590, file: !9, line: 201, baseType: !602, size: 64, offset: 448)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !590, file: !9, line: 208, baseType: !609, size: 64, offset: 512)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !590, file: !9, line: 209, baseType: !612, size: 64, offset: 576)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !590, file: !9, line: 210, baseType: !615, size: 64, offset: 640)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !9, line: 178, baseType: !126)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !590, file: !9, line: 213, baseType: !91, size: 32, offset: 704)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !590, file: !9, line: 214, baseType: !91, size: 32, offset: 736)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !590, file: !9, line: 215, baseType: !91, size: 32, offset: 768)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !590, file: !9, line: 218, baseType: !602, size: 64, offset: 832)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !590, file: !9, line: 218, baseType: !602, size: 64, offset: 896)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !590, file: !9, line: 218, baseType: !602, size: 64, offset: 960)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !590, file: !9, line: 220, baseType: !91, size: 32, offset: 1024)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !590, file: !9, line: 221, baseType: !626, size: 64, offset: 1088)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !19, line: 190, size: 10496, elements: !628)
!628 = !{!629, !663, !664, !668, !671, !672, !674}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !627, file: !19, line: 191, baseType: !630, size: 5120)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !631, size: 5120, elements: !661)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !19, line: 147, size: 320, elements: !632)
!632 = !{!633, !635, !637, !647, !648}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !631, file: !19, line: 148, baseType: !634, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !631, file: !19, line: 149, baseType: !636, size: 32, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !19, line: 112, baseType: !18)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !631, file: !19, line: 150, baseType: !638, size: 32, offset: 96)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !19, line: 142, baseType: !639)
!639 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !19, line: 138, size: 32, elements: !640)
!640 = !{!641, !643, !645}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !639, file: !19, line: 139, baseType: !642, size: 32)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !19, line: 122, baseType: !29)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !639, file: !19, line: 140, baseType: !644, size: 32)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !19, line: 136, baseType: !35)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !639, file: !19, line: 141, baseType: !646, size: 32)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !19, line: 130, baseType: !41)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !631, file: !19, line: 152, baseType: !91, size: 32, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !631, file: !19, line: 162, baseType: !649, size: 128, offset: 192)
!649 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !631, file: !19, line: 155, size: 128, elements: !650)
!650 = !{!651, !652, !653, !654, !655, !657}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !649, file: !19, line: 156, baseType: !91, size: 32)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !649, file: !19, line: 157, baseType: !110, size: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !649, file: !19, line: 158, baseType: !78, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !649, file: !19, line: 159, baseType: !109, size: 96)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !649, file: !19, line: 160, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !649, file: !19, line: 161, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !148, line: 48, baseType: !660)
!660 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !148, line: 48, flags: DIFlagFwdDecl)
!661 = !{!662}
!662 = !DISubrange(count: 16)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !627, file: !19, line: 192, baseType: !630, size: 5120, offset: 5120)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !627, file: !19, line: 193, baseType: !665, size: 64, offset: 10240)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{null, !588, !626}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !627, file: !19, line: 194, baseType: !669, size: 64, offset: 10304)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !19, line: 194, flags: DIFlagFwdDecl)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !627, file: !19, line: 195, baseType: !91, size: 32, offset: 10368)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !627, file: !19, line: 196, baseType: !673, size: 32, offset: 10400)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !19, line: 188, baseType: !49)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !627, file: !19, line: 197, baseType: !91, size: 32, offset: 10432)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !590, file: !9, line: 223, baseType: !676, size: 1600, offset: 1152)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !604, line: 73, baseType: !677)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !604, line: 64, size: 1600, elements: !678)
!678 = !{!679, !697, !701, !702, !703, !704, !705}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !677, file: !604, line: 65, baseType: !680, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !604, line: 53, baseType: !682)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !604, line: 42, size: 832, elements: !683)
!683 = !{!684, !685, !686, !687, !688, !689, !690, !691, !692, !696}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !682, file: !604, line: 43, baseType: !91, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !682, file: !604, line: 44, baseType: !91, size: 32, offset: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !682, file: !604, line: 45, baseType: !91, size: 32, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !682, file: !604, line: 46, baseType: !91, size: 32, offset: 96)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !682, file: !604, line: 47, baseType: !91, size: 32, offset: 128)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !682, file: !604, line: 48, baseType: !91, size: 32, offset: 160)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !682, file: !604, line: 49, baseType: !91, size: 32, offset: 192)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !682, file: !604, line: 50, baseType: !91, size: 32, offset: 224)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !682, file: !604, line: 51, baseType: !693, size: 512, offset: 256)
!693 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 512, elements: !694)
!694 = !{!695}
!695 = !DISubrange(count: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !682, file: !604, line: 52, baseType: !78, size: 64, offset: 768)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !677, file: !604, line: 66, baseType: !698, size: 1312, offset: 64)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 1312, elements: !699)
!699 = !{!700}
!700 = !DISubrange(count: 41)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !677, file: !604, line: 69, baseType: !91, size: 32, offset: 1376)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !677, file: !604, line: 69, baseType: !91, size: 32, offset: 1408)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !677, file: !604, line: 70, baseType: !91, size: 32, offset: 1440)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !677, file: !604, line: 71, baseType: !602, size: 64, offset: 1472)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !677, file: !604, line: 72, baseType: !706, size: 64, offset: 1536)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !604, line: 59, baseType: !708)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !604, line: 57, size: 8192, elements: !709)
!709 = !{!710}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !708, file: !604, line: 58, baseType: !711, size: 8192)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 8192, elements: !712)
!712 = !{!713}
!713 = !DISubrange(count: 1024)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !590, file: !9, line: 223, baseType: !676, size: 1600, offset: 2752)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !590, file: !9, line: 223, baseType: !676, size: 1600, offset: 4352)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !590, file: !9, line: 223, baseType: !676, size: 1600, offset: 5952)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !590, file: !9, line: 233, baseType: !101, size: 16, offset: 7552)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !590, file: !9, line: 236, baseType: !91, size: 32, offset: 7584)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !590, file: !9, line: 238, baseType: !91, size: 32, offset: 7616)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !590, file: !9, line: 238, baseType: !91, size: 32, offset: 7648)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !590, file: !9, line: 239, baseType: !722, size: 128, offset: 7680)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !723, line: 71, baseType: !724)
!723 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !723, line: 69, size: 128, elements: !725)
!725 = !{!726, !727}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !724, file: !723, line: 70, baseType: !78, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !724, file: !723, line: 70, baseType: !78, size: 64, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !590, file: !9, line: 241, baseType: !616, size: 64, offset: 7808)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !590, file: !9, line: 243, baseType: !722, size: 128, offset: 7872)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !590, file: !9, line: 245, baseType: !78, size: 64, offset: 8000)
!731 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!732 = !DILocalVariable(name: "bm", arg: 1, scope: !585, file: !1, line: 403, type: !588)
!733 = !DILocation(line: 403, column: 35, scope: !585)
!734 = !DILocalVariable(name: "edge_array", arg: 2, scope: !585, file: !1, line: 403, type: !612)
!735 = !DILocation(line: 403, column: 48, scope: !585)
!736 = !DILocalVariable(name: "edge_array_len", arg: 3, scope: !585, file: !1, line: 403, type: !731)
!737 = !DILocation(line: 403, column: 70, scope: !585)
!738 = !DILocalVariable(name: "flag", arg: 4, scope: !585, file: !1, line: 404, type: !165)
!739 = !DILocation(line: 404, column: 47, scope: !585)
!740 = !DILocalVariable(name: "method", arg: 5, scope: !585, file: !1, line: 404, type: !165)
!741 = !DILocation(line: 404, column: 65, scope: !585)
!742 = !DILocalVariable(name: "oflag_edge", arg: 6, scope: !585, file: !1, line: 405, type: !165)
!743 = !DILocation(line: 405, column: 47, scope: !585)
!744 = !DILocalVariable(name: "oflag_face", arg: 7, scope: !585, file: !1, line: 405, type: !165)
!745 = !DILocation(line: 405, column: 71, scope: !585)
!746 = !DILocalVariable(name: "eheap", scope: !585, file: !1, line: 407, type: !747)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "Heap", file: !749, line: 31, baseType: !750)
!749 = !DIFile(filename: "blender/source/blender/blenlib/BLI_heap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!750 = !DICompositeType(tag: DW_TAG_structure_type, name: "Heap", file: !749, line: 29, flags: DIFlagFwdDecl)
!751 = !DILocation(line: 407, column: 8, scope: !585)
!752 = !DILocalVariable(name: "eheap_table", scope: !585, file: !1, line: 408, type: !753)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "HeapNode", file: !749, line: 32, baseType: !756)
!756 = !DICompositeType(tag: DW_TAG_structure_type, name: "HeapNode", file: !749, line: 30, flags: DIFlagFwdDecl)
!757 = !DILocation(line: 408, column: 13, scope: !585)
!758 = !DILocalVariable(name: "edge_state_arr", scope: !585, file: !1, line: 410, type: !759)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSet", file: !148, line: 176, baseType: !762)
!762 = !DICompositeType(tag: DW_TAG_structure_type, name: "GSet", file: !148, line: 176, flags: DIFlagFwdDecl)
!763 = !DILocation(line: 410, column: 15, scope: !585)
!764 = !DILocation(line: 410, column: 33, scope: !585)
!765 = !DILocation(line: 410, column: 53, scope: !585)
!766 = !DILocation(line: 410, column: 45, scope: !585)
!767 = !DILocation(line: 410, column: 68, scope: !585)
!768 = !DILocalVariable(name: "edge_state_pool", scope: !585, file: !1, line: 411, type: !769)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool", file: !57, line: 47, baseType: !603)
!771 = !DILocation(line: 411, column: 15, scope: !585)
!772 = !DILocation(line: 411, column: 33, scope: !585)
!773 = !DILocalVariable(name: "i", scope: !585, file: !1, line: 412, type: !91)
!774 = !DILocation(line: 412, column: 6, scope: !585)
!775 = !DILocation(line: 418, column: 40, scope: !585)
!776 = !DILocation(line: 418, column: 10, scope: !585)
!777 = !DILocation(line: 418, column: 8, scope: !585)
!778 = !DILocation(line: 419, column: 16, scope: !585)
!779 = !DILocation(line: 419, column: 57, scope: !585)
!780 = !DILocation(line: 419, column: 49, scope: !585)
!781 = !DILocation(line: 419, column: 47, scope: !585)
!782 = !DILocation(line: 419, column: 14, scope: !585)
!783 = !DILocation(line: 422, column: 9, scope: !784)
!784 = distinct !DILexicalBlock(scope: !585, file: !1, line: 422, column: 2)
!785 = !DILocation(line: 422, column: 7, scope: !784)
!786 = !DILocation(line: 422, column: 14, scope: !787)
!787 = distinct !DILexicalBlock(scope: !784, file: !1, line: 422, column: 2)
!788 = !DILocation(line: 422, column: 18, scope: !787)
!789 = !DILocation(line: 422, column: 16, scope: !787)
!790 = !DILocation(line: 422, column: 2, scope: !784)
!791 = !DILocalVariable(name: "e", scope: !792, file: !1, line: 423, type: !613)
!792 = distinct !DILexicalBlock(scope: !787, file: !1, line: 422, column: 39)
!793 = !DILocation(line: 423, column: 11, scope: !792)
!794 = !DILocation(line: 423, column: 15, scope: !792)
!795 = !DILocation(line: 423, column: 26, scope: !792)
!796 = !DILocalVariable(name: "cost", scope: !792, file: !1, line: 424, type: !250)
!797 = !DILocation(line: 424, column: 15, scope: !792)
!798 = !DILocation(line: 424, column: 49, scope: !792)
!799 = !DILocation(line: 424, column: 52, scope: !792)
!800 = !DILocation(line: 424, column: 58, scope: !792)
!801 = !DILocation(line: 424, column: 22, scope: !792)
!802 = !DILocation(line: 425, column: 7, scope: !803)
!803 = distinct !DILexicalBlock(scope: !792, file: !1, line: 425, column: 7)
!804 = !DILocation(line: 425, column: 12, scope: !803)
!805 = !DILocation(line: 425, column: 7, scope: !792)
!806 = !DILocation(line: 426, column: 37, scope: !807)
!807 = distinct !DILexicalBlock(scope: !803, file: !1, line: 425, column: 20)
!808 = !DILocation(line: 426, column: 44, scope: !807)
!809 = !DILocation(line: 426, column: 50, scope: !807)
!810 = !DILocation(line: 426, column: 21, scope: !807)
!811 = !DILocation(line: 426, column: 4, scope: !807)
!812 = !DILocation(line: 426, column: 16, scope: !807)
!813 = !DILocation(line: 426, column: 19, scope: !807)
!814 = !DILocation(line: 427, column: 3, scope: !807)
!815 = !DILocation(line: 429, column: 4, scope: !816)
!816 = distinct !DILexicalBlock(scope: !803, file: !1, line: 428, column: 8)
!817 = !DILocation(line: 429, column: 16, scope: !816)
!818 = !DILocation(line: 429, column: 19, scope: !816)
!819 = !DILocation(line: 432, column: 3, scope: !792)
!820 = !DILocation(line: 433, column: 2, scope: !792)
!821 = !DILocation(line: 422, column: 35, scope: !787)
!822 = !DILocation(line: 422, column: 2, scope: !787)
!823 = distinct !{!823, !790, !824}
!824 = !DILocation(line: 433, column: 2, scope: !784)
!825 = !DILocation(line: 434, column: 2, scope: !585)
!826 = !DILocation(line: 434, column: 6, scope: !585)
!827 = !DILocation(line: 434, column: 23, scope: !585)
!828 = !DILocation(line: 436, column: 2, scope: !585)
!829 = !DILocation(line: 436, column: 27, scope: !585)
!830 = !DILocation(line: 436, column: 9, scope: !585)
!831 = !DILocation(line: 436, column: 34, scope: !585)
!832 = !DILocalVariable(name: "e", scope: !833, file: !1, line: 437, type: !613)
!833 = distinct !DILexicalBlock(scope: !585, file: !1, line: 436, column: 44)
!834 = !DILocation(line: 437, column: 11, scope: !833)
!835 = !DILocation(line: 437, column: 31, scope: !833)
!836 = !DILocation(line: 437, column: 15, scope: !833)
!837 = !DILocation(line: 438, column: 7, scope: !833)
!838 = !DILocation(line: 438, column: 5, scope: !833)
!839 = !DILocation(line: 439, column: 3, scope: !833)
!840 = !DILocation(line: 439, column: 15, scope: !833)
!841 = !DILocation(line: 439, column: 18, scope: !833)
!842 = !DILocation(line: 443, column: 22, scope: !833)
!843 = !DILocation(line: 443, column: 26, scope: !833)
!844 = !DILocation(line: 443, column: 7, scope: !833)
!845 = !DILocation(line: 443, column: 5, scope: !833)
!846 = !DILocation(line: 447, column: 7, scope: !847)
!847 = distinct !DILexicalBlock(scope: !833, file: !1, line: 447, column: 7)
!848 = !DILocation(line: 447, column: 7, scope: !833)
!849 = !DILocalVariable(name: "e_state_set", scope: !850, file: !1, line: 448, type: !760)
!850 = distinct !DILexicalBlock(scope: !847, file: !1, line: 447, column: 18)
!851 = !DILocation(line: 448, column: 10, scope: !850)
!852 = !DILocation(line: 448, column: 24, scope: !850)
!853 = !DILocation(line: 448, column: 39, scope: !850)
!854 = !DILocalVariable(name: "e_state", scope: !850, file: !1, line: 453, type: !855)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "EdRotState", file: !1, line: 60, baseType: !857)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EdRotState", file: !1, line: 57, size: 128, elements: !858)
!858 = !{!859, !860, !861, !862}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !857, file: !1, line: 58, baseType: !91, size: 32)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !857, file: !1, line: 58, baseType: !91, size: 32, offset: 32)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "f1", scope: !857, file: !1, line: 59, baseType: !91, size: 32, offset: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "f2", scope: !857, file: !1, line: 59, baseType: !91, size: 32, offset: 96)
!863 = !DILocation(line: 453, column: 16, scope: !850)
!864 = !DILocation(line: 453, column: 44, scope: !850)
!865 = !DILocation(line: 453, column: 26, scope: !850)
!866 = !DILocation(line: 454, column: 23, scope: !850)
!867 = !DILocation(line: 454, column: 26, scope: !850)
!868 = !DILocation(line: 454, column: 4, scope: !850)
!869 = !DILocation(line: 455, column: 8, scope: !870)
!870 = distinct !DILexicalBlock(scope: !850, file: !1, line: 455, column: 8)
!871 = !DILocation(line: 455, column: 8, scope: !850)
!872 = !DILocation(line: 456, column: 39, scope: !873)
!873 = distinct !DILexicalBlock(scope: !870, file: !1, line: 455, column: 39)
!874 = !DILocation(line: 456, column: 37, scope: !873)
!875 = !DILocation(line: 456, column: 5, scope: !873)
!876 = !DILocation(line: 456, column: 20, scope: !873)
!877 = !DILocation(line: 456, column: 23, scope: !873)
!878 = !DILocation(line: 457, column: 4, scope: !873)
!879 = !DILocation(line: 459, column: 20, scope: !850)
!880 = !DILocation(line: 459, column: 33, scope: !850)
!881 = !DILocation(line: 459, column: 4, scope: !850)
!882 = !DILocation(line: 465, column: 20, scope: !850)
!883 = !DILocation(line: 465, column: 4, scope: !850)
!884 = !DILocation(line: 465, column: 15, scope: !850)
!885 = !DILocation(line: 465, column: 18, scope: !850)
!886 = !DILocation(line: 466, column: 4, scope: !850)
!887 = !DILocation(line: 469, column: 31, scope: !850)
!888 = !DILocation(line: 469, column: 34, scope: !850)
!889 = !DILocation(line: 469, column: 41, scope: !850)
!890 = !DILocation(line: 469, column: 54, scope: !850)
!891 = !DILocation(line: 470, column: 48, scope: !850)
!892 = !DILocation(line: 470, column: 60, scope: !850)
!893 = !DILocation(line: 471, column: 31, scope: !850)
!894 = !DILocation(line: 471, column: 37, scope: !850)
!895 = !DILocation(line: 469, column: 4, scope: !850)
!896 = !DILocation(line: 474, column: 8, scope: !897)
!897 = distinct !DILexicalBlock(scope: !850, file: !1, line: 474, column: 8)
!898 = !DILocation(line: 474, column: 8, scope: !850)
!899 = !DILocation(line: 475, column: 5, scope: !897)
!900 = !DILocation(line: 476, column: 8, scope: !901)
!901 = distinct !DILexicalBlock(scope: !850, file: !1, line: 476, column: 8)
!902 = !DILocation(line: 476, column: 8, scope: !850)
!903 = !DILocation(line: 477, column: 5, scope: !904)
!904 = distinct !DILexicalBlock(scope: !901, file: !1, line: 476, column: 20)
!905 = !DILocation(line: 478, column: 5, scope: !904)
!906 = !DILocation(line: 479, column: 4, scope: !904)
!907 = !DILocation(line: 480, column: 3, scope: !850)
!908 = distinct !{!908, !828, !909}
!909 = !DILocation(line: 481, column: 2, scope: !585)
!910 = !DILocation(line: 483, column: 16, scope: !585)
!911 = !DILocation(line: 483, column: 2, scope: !585)
!912 = !DILocation(line: 484, column: 2, scope: !585)
!913 = !DILocation(line: 484, column: 12, scope: !585)
!914 = !DILocation(line: 486, column: 9, scope: !915)
!915 = distinct !DILexicalBlock(scope: !585, file: !1, line: 486, column: 2)
!916 = !DILocation(line: 486, column: 7, scope: !915)
!917 = !DILocation(line: 486, column: 14, scope: !918)
!918 = distinct !DILexicalBlock(scope: !915, file: !1, line: 486, column: 2)
!919 = !DILocation(line: 486, column: 18, scope: !918)
!920 = !DILocation(line: 486, column: 16, scope: !918)
!921 = !DILocation(line: 486, column: 2, scope: !915)
!922 = !DILocation(line: 487, column: 7, scope: !923)
!923 = distinct !DILexicalBlock(scope: !924, file: !1, line: 487, column: 7)
!924 = distinct !DILexicalBlock(scope: !918, file: !1, line: 486, column: 39)
!925 = !DILocation(line: 487, column: 22, scope: !923)
!926 = !DILocation(line: 487, column: 7, scope: !924)
!927 = !DILocation(line: 488, column: 18, scope: !928)
!928 = distinct !DILexicalBlock(scope: !923, file: !1, line: 487, column: 26)
!929 = !DILocation(line: 488, column: 33, scope: !928)
