; ModuleID = 'blender/source/blender/bmesh/operators/bmo_removedoubles.c'
source_filename = "blender/source/blender/bmesh/operators/bmo_removedoubles.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BMesh = type { i32, i32, i32, i32, i32, i32, i32, i8, i8, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BMVert**, %struct.BMEdge**, %struct.BMFace**, i32, i32, i32, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, i32, %struct.BMOperator*, %struct.CustomData, %struct.CustomData, %struct.CustomData, %struct.CustomData, i16, i32, i32, i32, %struct.ListBase, %struct.BMFace*, %struct.ListBase, i8* }
%struct.BMVert = type { %struct.BMHeader, %struct.BMFlagLayer*, [3 x float], [3 x float], %struct.BMEdge* }
%struct.BMHeader = type { i8*, i32, i8, i8, i8 }
%struct.BMFlagLayer = type { i16 }
%struct.BMEdge = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMVert*, %struct.BMVert*, %struct.BMLoop*, %struct.BMDiskLink, %struct.BMDiskLink }
%struct.BMLoop = type { %struct.BMHeader, %struct.BMVert*, %struct.BMEdge*, %struct.BMFace*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop* }
%struct.BMDiskLink = type { %struct.BMEdge*, %struct.BMEdge* }
%struct.BLI_mempool = type opaque

!62 = !DIEnumerator(name: "BM_CREATE_NOP", value: 0, isUnsigned: true)
!63 = !DIEnumerator(name: "BM_CREATE_NO_DOUBLE", value: 2, isUnsigned: true)
!64 = !DIEnumerator(name: "BM_CREATE_SKIP_CD", value: 4, isUnsigned: true)
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !66, line: 249, baseType: !5, size: 32, elements: !67)
!66 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!67 = !{!68, !69, !70, !71}
!68 = !DIEnumerator(name: "BM_VERT", value: 1, isUnsigned: true)
!69 = !DIEnumerator(name: "BM_EDGE", value: 2, isUnsigned: true)
!70 = !DIEnumerator(name: "BM_LOOP", value: 4, isUnsigned: true)
!71 = !DIEnumerator(name: "BM_FACE", value: 8, isUnsigned: true)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 281, baseType: !5, size: 32, elements: !73)
!73 = !{!74, !75, !76, !77, !78, !79}
!74 = !DIEnumerator(name: "DEL_VERTS", value: 1, isUnsigned: true)
!75 = !DIEnumerator(name: "DEL_EDGES", value: 2, isUnsigned: true)
!76 = !DIEnumerator(name: "DEL_ONLYFACES", value: 3, isUnsigned: true)
!77 = !DIEnumerator(name: "DEL_EDGESFACES", value: 4, isUnsigned: true)
!78 = !DIEnumerator(name: "DEL_FACES", value: 5, isUnsigned: true)
!79 = !DIEnumerator(name: "DEL_ONLYTAGGED", value: 6, isUnsigned: true)
!80 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !81, line: 34, baseType: !5, size: 32, elements: !82)
!81 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_walkers.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!82 = !{!83, !84}
!83 = !DIEnumerator(name: "BMW_DEPTH_FIRST", value: 0, isUnsigned: true)
!84 = !DIEnumerator(name: "BMW_BREADTH_FIRST", value: 1, isUnsigned: true)
!85 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !81, line: 39, baseType: !5, size: 32, elements: !86)
!86 = !{!87, !88}
!87 = !DIEnumerator(name: "BMW_FLAG_NOP", value: 0, isUnsigned: true)
!88 = !DIEnumerator(name: "BMW_FLAG_TEST_HIDDEN", value: 1, isUnsigned: true)
!89 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !81, line: 109, baseType: !5, size: 32, elements: !90)
!90 = !{!91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102}
!91 = !DIEnumerator(name: "BMW_VERT_SHELL", value: 0, isUnsigned: true)
!92 = !DIEnumerator(name: "BMW_FACE_SHELL", value: 1, isUnsigned: true)
!93 = !DIEnumerator(name: "BMW_LOOP", value: 2, isUnsigned: true)
!94 = !DIEnumerator(name: "BMW_FACELOOP", value: 3, isUnsigned: true)
!95 = !DIEnumerator(name: "BMW_EDGERING", value: 4, isUnsigned: true)
!96 = !DIEnumerator(name: "BMW_EDGEBOUNDARY", value: 5, isUnsigned: true)
!97 = !DIEnumerator(name: "BMW_LOOPDATA_ISLAND", value: 6, isUnsigned: true)
!98 = !DIEnumerator(name: "BMW_ISLANDBOUND", value: 7, isUnsigned: true)
!99 = !DIEnumerator(name: "BMW_ISLAND", value: 8, isUnsigned: true)
!100 = !DIEnumerator(name: "BMW_CONNECTED_VERTEX", value: 9, isUnsigned: true)
!101 = !DIEnumerator(name: "BMW_CUSTOM", value: 10, isUnsigned: true)
!102 = !DIEnumerator(name: "BMW_MAXWALKERS", value: 11, isUnsigned: true)
!103 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !66, line: 260, baseType: !5, size: 32, elements: !104)
!104 = !{!105, !106, !107, !108, !109, !110, !111}
!105 = !DIEnumerator(name: "BM_ELEM_SELECT", value: 1, isUnsigned: true)
!106 = !DIEnumerator(name: "BM_ELEM_HIDDEN", value: 2, isUnsigned: true)
!107 = !DIEnumerator(name: "BM_ELEM_SEAM", value: 4, isUnsigned: true)
!108 = !DIEnumerator(name: "BM_ELEM_SMOOTH", value: 8, isUnsigned: true)
!109 = !DIEnumerator(name: "BM_ELEM_TAG", value: 16, isUnsigned: true)
!110 = !DIEnumerator(name: "BM_ELEM_DRAW", value: 32, isUnsigned: true)
!111 = !DIEnumerator(name: "BM_ELEM_INTERNAL_TAG", value: 128, isUnsigned: true)
!112 = !{!113, !114, !117, !118, !120, !121, !125, !129, !194, !196, !178, !119}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !115, line: 46, baseType: !116)
!115 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!116 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !43, line: 79, baseType: !42)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !43, line: 158, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{null, !113}
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !43, line: 159, baseType: !126)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!113, !113}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !66, line: 103, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !66, line: 90, size: 448, elements: !132)
!132 = !{!133, !143, !149, !154, !155}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !131, file: !66, line: 91, baseType: !134, size: 128)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !66, line: 82, baseType: !135)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !66, line: 64, size: 128, elements: !136)
!136 = !{!137, !138, !140, !141, !142}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !135, file: !66, line: 65, baseType: !113, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !135, file: !66, line: 66, baseType: !139, size: 32, offset: 64)
!139 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !135, file: !66, line: 73, baseType: !119, size: 8, offset: 96)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !135, file: !66, line: 74, baseType: !119, size: 8, offset: 104)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !135, file: !66, line: 80, baseType: !119, size: 8, offset: 112)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !131, file: !66, line: 92, baseType: !144, size: 64, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !66, line: 180, size: 16, elements: !146)
!146 = !{!147}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !145, file: !66, line: 181, baseType: !148, size: 16)
!148 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !131, file: !66, line: 94, baseType: !150, size: 96, offset: 192)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 96, elements: !152)
!151 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!152 = !{!153}
!153 = !DISubrange(count: 3)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !131, file: !66, line: 95, baseType: !150, size: 96, offset: 288)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !131, file: !66, line: 102, baseType: !156, size: 64, offset: 384)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !66, line: 110, size: 640, elements: !158)
!158 = !{!159, !160, !161, !163, !164, !187, !193}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !157, file: !66, line: 111, baseType: !134, size: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !157, file: !66, line: 112, baseType: !144, size: 64, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !157, file: !66, line: 114, baseType: !162, size: 64, offset: 192)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !157, file: !66, line: 114, baseType: !162, size: 64, offset: 256)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !157, file: !66, line: 118, baseType: !165, size: 64, offset: 320)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !66, line: 125, size: 576, elements: !167)
!167 = !{!168, !169, !170, !171, !183, !184, !185, !186}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !166, file: !66, line: 126, baseType: !134, size: 128)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !166, file: !66, line: 129, baseType: !162, size: 64, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !166, file: !66, line: 130, baseType: !156, size: 64, offset: 192)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !166, file: !66, line: 131, baseType: !172, size: 64, offset: 256)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !66, line: 164, size: 448, elements: !174)
!174 = !{!175, !176, !177, !180, !181, !182}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !173, file: !66, line: 165, baseType: !134, size: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !173, file: !66, line: 166, baseType: !144, size: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !173, file: !66, line: 172, baseType: !178, size: 64, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !66, line: 140, baseType: !166)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !173, file: !66, line: 174, baseType: !139, size: 32, offset: 256)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !173, file: !66, line: 175, baseType: !150, size: 96, offset: 288)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !173, file: !66, line: 176, baseType: !148, size: 16, offset: 384)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !166, file: !66, line: 135, baseType: !165, size: 64, offset: 320)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !166, file: !66, line: 135, baseType: !165, size: 64, offset: 384)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !166, file: !66, line: 139, baseType: !165, size: 64, offset: 448)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !166, file: !66, line: 139, baseType: !165, size: 64, offset: 512)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !157, file: !66, line: 122, baseType: !188, size: 128, offset: 384)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !66, line: 108, baseType: !189)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !66, line: 106, size: 128, elements: !190)
!190 = !{!191, !192}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !189, file: !66, line: 107, baseType: !156, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !189, file: !66, line: 107, baseType: !156, size: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !157, file: !66, line: 122, baseType: !188, size: 128, offset: 512)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !66, line: 123, baseType: !157)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !66, line: 178, baseType: !173)
!198 = !{i32 7, !"Dwarf Version", i32 4}
!199 = !{i32 2, !"Debug Info Version", i32 3}
!200 = !{i32 1, !"wchar_size", i32 4}
!201 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!202 = distinct !DISubprogram(name: "bmo_weld_verts_exec", scope: !1, file: !1, line: 162, type: !203, scopeLine: 163, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !347)
!203 = !DISubroutineType(types: !204)
!204 = !{null, !205, !345}
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !66, line: 246, baseType: !207)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !66, line: 186, size: 8064, elements: !208)
!208 = !{!209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !222, !223, !224, !225, !227, !229, !231, !232, !233, !234, !235, !236, !237, !238, !289, !328, !329, !330, !331, !332, !333, !334, !335, !342, !343, !344}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !207, file: !66, line: 187, baseType: !139, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !207, file: !66, line: 187, baseType: !139, size: 32, offset: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !207, file: !66, line: 187, baseType: !139, size: 32, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !207, file: !66, line: 187, baseType: !139, size: 32, offset: 96)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !207, file: !66, line: 188, baseType: !139, size: 32, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !207, file: !66, line: 188, baseType: !139, size: 32, offset: 160)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !207, file: !66, line: 188, baseType: !139, size: 32, offset: 192)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !207, file: !66, line: 193, baseType: !119, size: 8, offset: 224)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !207, file: !66, line: 197, baseType: !119, size: 8, offset: 232)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !207, file: !66, line: 201, baseType: !219, size: 64, offset: 256)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !221, line: 71, flags: DIFlagFwdDecl)
!221 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!222 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !207, file: !66, line: 201, baseType: !219, size: 64, offset: 320)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !207, file: !66, line: 201, baseType: !219, size: 64, offset: 384)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !207, file: !66, line: 201, baseType: !219, size: 64, offset: 448)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !207, file: !66, line: 208, baseType: !226, size: 64, offset: 512)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !207, file: !66, line: 209, baseType: !228, size: 64, offset: 576)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !207, file: !66, line: 210, baseType: !230, size: 64, offset: 640)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !207, file: !66, line: 213, baseType: !139, size: 32, offset: 704)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !207, file: !66, line: 214, baseType: !139, size: 32, offset: 736)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !207, file: !66, line: 215, baseType: !139, size: 32, offset: 768)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !207, file: !66, line: 218, baseType: !219, size: 64, offset: 832)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !207, file: !66, line: 218, baseType: !219, size: 64, offset: 896)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !207, file: !66, line: 218, baseType: !219, size: 64, offset: 960)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !207, file: !66, line: 220, baseType: !139, size: 32, offset: 1024)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !207, file: !66, line: 221, baseType: !239, size: 64, offset: 1088)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !4, line: 190, size: 10496, elements: !241)
!241 = !{!242, !277, !278, !282, !285, !286, !288}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !240, file: !4, line: 191, baseType: !243, size: 5120)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 5120, elements: !275)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !4, line: 147, size: 320, elements: !245)
!245 = !{!246, !249, !251, !261, !262}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !244, file: !4, line: 148, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !244, file: !4, line: 149, baseType: !250, size: 32, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !4, line: 112, baseType: !3)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !244, file: !4, line: 150, baseType: !252, size: 32, offset: 96)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !4, line: 142, baseType: !253)
!253 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !4, line: 138, size: 32, elements: !254)
!254 = !{!255, !257, !259}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !253, file: !4, line: 139, baseType: !256, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !4, line: 122, baseType: !15)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !253, file: !4, line: 140, baseType: !258, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !4, line: 136, baseType: !21)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !253, file: !4, line: 141, baseType: !260, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !4, line: 130, baseType: !27)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !244, file: !4, line: 152, baseType: !139, size: 32, offset: 128)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !244, file: !4, line: 162, baseType: !263, size: 128, offset: 192)
!263 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !244, file: !4, line: 155, size: 128, elements: !264)
!264 = !{!265, !266, !267, !268, !269, !270}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !263, file: !4, line: 156, baseType: !139, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !263, file: !4, line: 157, baseType: !151, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !263, file: !4, line: 158, baseType: !113, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !263, file: !4, line: 159, baseType: !150, size: 96)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !263, file: !4, line: 160, baseType: !117, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !263, file: !4, line: 161, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !273, line: 48, baseType: !274)
!273 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !273, line: 48, flags: DIFlagFwdDecl)
!275 = !{!276}
!276 = !DISubrange(count: 16)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !240, file: !4, line: 192, baseType: !243, size: 5120, offset: 5120)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !240, file: !4, line: 193, baseType: !279, size: 64, offset: 10240)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DISubroutineType(types: !281)
!281 = !{null, !205, !239}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !240, file: !4, line: 194, baseType: !283, size: 64, offset: 10304)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !4, line: 194, flags: DIFlagFwdDecl)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !240, file: !4, line: 195, baseType: !139, size: 32, offset: 10368)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !240, file: !4, line: 196, baseType: !287, size: 32, offset: 10400)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !4, line: 188, baseType: !35)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !240, file: !4, line: 197, baseType: !139, size: 32, offset: 10432)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !207, file: !66, line: 223, baseType: !290, size: 1600, offset: 1152)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !221, line: 73, baseType: !291)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !221, line: 64, size: 1600, elements: !292)
!292 = !{!293, !311, !315, !316, !317, !318, !319}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !291, file: !221, line: 65, baseType: !294, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !221, line: 53, baseType: !296)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !221, line: 42, size: 832, elements: !297)
!297 = !{!298, !299, !300, !301, !302, !303, !304, !305, !306, !310}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !296, file: !221, line: 43, baseType: !139, size: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !296, file: !221, line: 44, baseType: !139, size: 32, offset: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !296, file: !221, line: 45, baseType: !139, size: 32, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !296, file: !221, line: 46, baseType: !139, size: 32, offset: 96)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !296, file: !221, line: 47, baseType: !139, size: 32, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !296, file: !221, line: 48, baseType: !139, size: 32, offset: 160)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !296, file: !221, line: 49, baseType: !139, size: 32, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !296, file: !221, line: 50, baseType: !139, size: 32, offset: 224)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !296, file: !221, line: 51, baseType: !307, size: 512, offset: 256)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 512, elements: !308)
!308 = !{!309}
!309 = !DISubrange(count: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !296, file: !221, line: 52, baseType: !113, size: 64, offset: 768)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !291, file: !221, line: 66, baseType: !312, size: 1312, offset: 64)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 1312, elements: !313)
!313 = !{!314}
!314 = !DISubrange(count: 41)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !291, file: !221, line: 69, baseType: !139, size: 32, offset: 1376)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !291, file: !221, line: 69, baseType: !139, size: 32, offset: 1408)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !291, file: !221, line: 70, baseType: !139, size: 32, offset: 1440)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !291, file: !221, line: 71, baseType: !219, size: 64, offset: 1472)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !291, file: !221, line: 72, baseType: !320, size: 64, offset: 1536)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !221, line: 59, baseType: !322)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !221, line: 57, size: 8192, elements: !323)
!323 = !{!324}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !322, file: !221, line: 58, baseType: !325, size: 8192)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 8192, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 1024)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !207, file: !66, line: 223, baseType: !290, size: 1600, offset: 2752)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !207, file: !66, line: 223, baseType: !290, size: 1600, offset: 4352)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !207, file: !66, line: 223, baseType: !290, size: 1600, offset: 5952)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !207, file: !66, line: 233, baseType: !148, size: 16, offset: 7552)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !207, file: !66, line: 236, baseType: !139, size: 32, offset: 7584)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !207, file: !66, line: 238, baseType: !139, size: 32, offset: 7616)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !207, file: !66, line: 238, baseType: !139, size: 32, offset: 7648)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !207, file: !66, line: 239, baseType: !336, size: 128, offset: 7680)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !337, line: 71, baseType: !338)
!337 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !337, line: 69, size: 128, elements: !339)
!339 = !{!340, !341}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !338, file: !337, line: 70, baseType: !113, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !338, file: !337, line: 70, baseType: !113, size: 64, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !207, file: !66, line: 241, baseType: !196, size: 64, offset: 7808)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !207, file: !66, line: 243, baseType: !336, size: 128, offset: 7872)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !207, file: !66, line: 245, baseType: !113, size: 64, offset: 8000)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOperator", file: !4, line: 198, baseType: !240)
!347 = !{}
!348 = !DILocalVariable(name: "bm", arg: 1, scope: !202, file: !1, line: 162, type: !205)
!349 = !DILocation(line: 162, column: 33, scope: !202)
!350 = !DILocalVariable(name: "op", arg: 2, scope: !202, file: !1, line: 162, type: !345)
!351 = !DILocation(line: 162, column: 49, scope: !202)
!352 = !DILocalVariable(name: "iter", scope: !202, file: !1, line: 164, type: !353)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter", file: !43, line: 186, baseType: !354)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter", file: !43, line: 164, size: 512, elements: !355)
!355 = !{!356, !436, !437, !438, !439}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !354, file: !43, line: 179, baseType: !357, size: 320)
!357 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !354, file: !43, line: 166, size: 320, elements: !358)
!358 = !{!359, !374, !380, !388, !396, !402, !408, !414, !418, !424, !430}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "elem_of_mesh", scope: !357, file: !43, line: 167, baseType: !360, size: 192)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__elem_of_mesh", file: !43, line: 113, size: 192, elements: !361)
!361 = !{!362}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "pooliter", scope: !360, file: !43, line: 114, baseType: !363, size: 192)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool_iter", file: !364, line: 80, baseType: !365)
!364 = !DIFile(filename: "blender/source/blender/blenlib/BLI_mempool.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_iter", file: !364, line: 76, size: 192, elements: !366)
!366 = !{!367, !370, !373}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !365, file: !364, line: 77, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool", file: !364, line: 47, baseType: !220)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "curchunk", scope: !365, file: !364, line: 78, baseType: !371, size: 64, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_chunk", file: !364, line: 45, flags: DIFlagFwdDecl)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "curindex", scope: !365, file: !364, line: 79, baseType: !5, size: 32, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_vert", scope: !357, file: !43, line: 169, baseType: !375, size: 192)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_vert", file: !43, line: 116, size: 192, elements: !376)
!376 = !{!377, !378, !379}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !375, file: !43, line: 117, baseType: !129, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !375, file: !43, line: 118, baseType: !194, size: 64, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !375, file: !43, line: 118, baseType: !194, size: 64, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_vert", scope: !357, file: !43, line: 170, baseType: !381, size: 320)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_vert", file: !43, line: 120, size: 320, elements: !382)
!382 = !{!383, !384, !385, !386, !387}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !381, file: !43, line: 121, baseType: !129, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !381, file: !43, line: 122, baseType: !178, size: 64, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !381, file: !43, line: 122, baseType: !178, size: 64, offset: 128)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !381, file: !43, line: 123, baseType: !194, size: 64, offset: 192)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !381, file: !43, line: 123, baseType: !194, size: 64, offset: 256)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_vert", scope: !357, file: !43, line: 171, baseType: !389, size: 320)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_vert", file: !43, line: 125, size: 320, elements: !390)
!390 = !{!391, !392, !393, !394, !395}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !389, file: !43, line: 126, baseType: !129, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !389, file: !43, line: 127, baseType: !178, size: 64, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !389, file: !43, line: 127, baseType: !178, size: 64, offset: 128)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !389, file: !43, line: 128, baseType: !194, size: 64, offset: 192)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !389, file: !43, line: 128, baseType: !194, size: 64, offset: 256)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_edge", scope: !357, file: !43, line: 172, baseType: !397, size: 192)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_edge", file: !43, line: 130, size: 192, elements: !398)
!398 = !{!399, !400, !401}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !397, file: !43, line: 131, baseType: !194, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !397, file: !43, line: 132, baseType: !178, size: 64, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !397, file: !43, line: 132, baseType: !178, size: 64, offset: 128)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_loop", scope: !357, file: !43, line: 173, baseType: !403, size: 192)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_loop", file: !43, line: 134, size: 192, elements: !404)
!404 = !{!405, !406, !407}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !403, file: !43, line: 135, baseType: !178, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !403, file: !43, line: 136, baseType: !178, size: 64, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !403, file: !43, line: 136, baseType: !178, size: 64, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_edge", scope: !357, file: !43, line: 174, baseType: !409, size: 192)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_edge", file: !43, line: 138, size: 192, elements: !410)
!410 = !{!411, !412, !413}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !409, file: !43, line: 139, baseType: !194, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !409, file: !43, line: 140, baseType: !178, size: 64, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !409, file: !43, line: 140, baseType: !178, size: 64, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_edge", scope: !357, file: !43, line: 175, baseType: !415, size: 64)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_edge", file: !43, line: 142, size: 64, elements: !416)
!416 = !{!417}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !415, file: !43, line: 143, baseType: !194, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_face", scope: !357, file: !43, line: 176, baseType: !419, size: 192)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_face", file: !43, line: 145, size: 192, elements: !420)
!420 = !{!421, !422, !423}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !419, file: !43, line: 146, baseType: !196, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !419, file: !43, line: 147, baseType: !178, size: 64, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !419, file: !43, line: 147, baseType: !178, size: 64, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_face", scope: !357, file: !43, line: 177, baseType: !425, size: 192)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_face", file: !43, line: 149, size: 192, elements: !426)
!426 = !{!427, !428, !429}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !425, file: !43, line: 150, baseType: !196, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !425, file: !43, line: 151, baseType: !178, size: 64, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !425, file: !43, line: 151, baseType: !178, size: 64, offset: 128)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_face", scope: !357, file: !43, line: 178, baseType: !431, size: 192)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_face", file: !43, line: 153, size: 192, elements: !432)
!432 = !{!433, !434, !435}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !431, file: !43, line: 154, baseType: !196, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !431, file: !43, line: 155, baseType: !178, size: 64, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !431, file: !43, line: 155, baseType: !178, size: 64, offset: 128)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !354, file: !43, line: 181, baseType: !121, size: 64, offset: 320)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !354, file: !43, line: 182, baseType: !125, size: 64, offset: 384)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !354, file: !43, line: 184, baseType: !139, size: 32, offset: 448)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !354, file: !43, line: 185, baseType: !119, size: 8, offset: 480)
!440 = !DILocation(line: 164, column: 9, scope: !202)
!441 = !DILocalVariable(name: "liter", scope: !202, file: !1, line: 164, type: !353)
!442 = !DILocation(line: 164, column: 15, scope: !202)
!443 = !DILocalVariable(name: "v1", scope: !202, file: !1, line: 165, type: !129)
!444 = !DILocation(line: 165, column: 10, scope: !202)
!445 = !DILocalVariable(name: "v2", scope: !202, file: !1, line: 165, type: !129)
!446 = !DILocation(line: 165, column: 15, scope: !202)
!447 = !DILocalVariable(name: "e", scope: !202, file: !1, line: 166, type: !194)
!448 = !DILocation(line: 166, column: 10, scope: !202)
!449 = !DILocalVariable(name: "l", scope: !202, file: !1, line: 167, type: !178)
!450 = !DILocation(line: 167, column: 10, scope: !202)
!451 = !DILocalVariable(name: "f", scope: !202, file: !1, line: 168, type: !196)
!452 = !DILocation(line: 168, column: 10, scope: !202)
!453 = !DILocalVariable(name: "slot_targetmap", scope: !202, file: !1, line: 169, type: !454)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpSlot", file: !4, line: 163, baseType: !244)
!456 = !DILocation(line: 169, column: 12, scope: !202)
!457 = !DILocation(line: 169, column: 42, scope: !202)
!458 = !DILocation(line: 169, column: 46, scope: !202)
!459 = !DILocation(line: 169, column: 29, scope: !202)
!460 = !DILocation(line: 172, column: 2, scope: !461)
!461 = distinct !DILexicalBlock(scope: !202, file: !1, line: 172, column: 2)
!462 = !DILocation(line: 172, column: 2, scope: !463)
!463 = distinct !DILexicalBlock(scope: !461, file: !1, line: 172, column: 2)
!464 = !DILocation(line: 173, column: 35, scope: !465)
!465 = distinct !DILexicalBlock(scope: !466, file: !1, line: 173, column: 7)
!466 = distinct !DILexicalBlock(scope: !463, file: !1, line: 172, column: 49)
!467 = !DILocation(line: 173, column: 51, scope: !465)
!468 = !DILocation(line: 173, column: 13, scope: !465)
!469 = !DILocation(line: 173, column: 11, scope: !465)
!470 = !DILocation(line: 173, column: 7, scope: !466)
!471 = !DILocation(line: 174, column: 4, scope: !472)
!472 = distinct !DILexicalBlock(scope: !465, file: !1, line: 173, column: 57)
!473 = !DILocation(line: 177, column: 4, scope: !472)
!474 = !DILocation(line: 178, column: 3, scope: !472)
!475 = !DILocation(line: 179, column: 2, scope: !466)
!476 = distinct !{!476, !460, !477}
!477 = !DILocation(line: 179, column: 2, scope: !461)
!478 = !DILocation(line: 183, column: 2, scope: !479)
!479 = distinct !DILexicalBlock(scope: !202, file: !1, line: 183, column: 2)
!480 = !DILocation(line: 183, column: 2, scope: !481)
!481 = distinct !DILexicalBlock(scope: !479, file: !1, line: 183, column: 2)
!482 = !DILocation(line: 184, column: 24, scope: !483)
!483 = distinct !DILexicalBlock(scope: !481, file: !1, line: 183, column: 48)
!484 = !DILocation(line: 184, column: 27, scope: !483)
!485 = !DILocation(line: 184, column: 31, scope: !483)
!486 = !DILocation(line: 184, column: 35, scope: !483)
!487 = !DILocation(line: 184, column: 3, scope: !483)
!488 = !DILocation(line: 185, column: 2, scope: !483)
!489 = distinct !{!489, !478, !490}
!490 = !DILocation(line: 185, column: 2, scope: !479)
!491 = !DILocation(line: 187, column: 2, scope: !492)
!492 = distinct !DILexicalBlock(scope: !202, file: !1, line: 187, column: 2)
!493 = !DILocation(line: 187, column: 2, scope: !494)
!494 = distinct !DILexicalBlock(scope: !492, file: !1, line: 187, column: 2)
!495 = !DILocalVariable(name: "is_del_v1", scope: !496, file: !1, line: 188, type: !497)
!496 = distinct !DILexicalBlock(scope: !494, file: !1, line: 187, column: 48)
!497 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !498)
!498 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!499 = !DILocation(line: 188, column: 14, scope: !496)
!500 = !DILocation(line: 188, column: 26, scope: !496)
!501 = !DILocalVariable(name: "is_del_v2", scope: !496, file: !1, line: 189, type: !497)
!502 = !DILocation(line: 189, column: 14, scope: !496)
!503 = !DILocation(line: 189, column: 26, scope: !496)
!504 = !DILocation(line: 191, column: 7, scope: !505)
!505 = distinct !DILexicalBlock(scope: !496, file: !1, line: 191, column: 7)
!506 = !DILocation(line: 191, column: 17, scope: !505)
!507 = !DILocation(line: 191, column: 20, scope: !505)
!508 = !DILocation(line: 191, column: 7, scope: !496)
!509 = !DILocation(line: 192, column: 8, scope: !510)
!510 = distinct !DILexicalBlock(scope: !511, file: !1, line: 192, column: 8)
!511 = distinct !DILexicalBlock(scope: !505, file: !1, line: 191, column: 31)
!512 = !DILocation(line: 192, column: 8, scope: !511)
!513 = !DILocation(line: 193, column: 32, scope: !510)
!514 = !DILocation(line: 193, column: 48, scope: !510)
!515 = !DILocation(line: 193, column: 10, scope: !510)
!516 = !DILocation(line: 193, column: 8, scope: !510)
!517 = !DILocation(line: 193, column: 5, scope: !510)
!518 = !DILocation(line: 194, column: 8, scope: !519)
!519 = distinct !DILexicalBlock(scope: !511, file: !1, line: 194, column: 8)
!520 = !DILocation(line: 194, column: 8, scope: !511)
!521 = !DILocation(line: 195, column: 32, scope: !519)
!522 = !DILocation(line: 195, column: 48, scope: !519)
!523 = !DILocation(line: 195, column: 10, scope: !519)
!524 = !DILocation(line: 195, column: 8, scope: !519)
!525 = !DILocation(line: 195, column: 5, scope: !519)
!526 = !DILocation(line: 197, column: 8, scope: !527)
!527 = distinct !DILexicalBlock(scope: !511, file: !1, line: 197, column: 8)
!528 = !DILocation(line: 197, column: 14, scope: !527)
!529 = !DILocation(line: 197, column: 11, scope: !527)
!530 = !DILocation(line: 197, column: 8, scope: !511)
!531 = !DILocation(line: 198, column: 5, scope: !532)
!532 = distinct !DILexicalBlock(scope: !527, file: !1, line: 197, column: 18)
!533 = !DILocation(line: 199, column: 4, scope: !532)
!534 = !DILocation(line: 200, column: 29, scope: !535)
!535 = distinct !DILexicalBlock(scope: !527, file: !1, line: 200, column: 13)
!536 = !DILocation(line: 200, column: 33, scope: !535)
!537 = !DILocation(line: 200, column: 14, scope: !535)
!538 = !DILocation(line: 200, column: 13, scope: !527)
!539 = !DILocation(line: 201, column: 20, scope: !540)
!540 = distinct !DILexicalBlock(scope: !535, file: !1, line: 200, column: 38)
!541 = !DILocation(line: 201, column: 24, scope: !540)
!542 = !DILocation(line: 201, column: 28, scope: !540)
!543 = !DILocation(line: 201, column: 32, scope: !540)
!544 = !DILocation(line: 201, column: 5, scope: !540)
!545 = !DILocation(line: 202, column: 4, scope: !540)
!546 = !DILocation(line: 204, column: 4, scope: !511)
!547 = !DILocation(line: 205, column: 3, scope: !511)
!548 = !DILocation(line: 206, column: 2, scope: !496)
!549 = distinct !{!549, !491, !550}
!550 = !DILocation(line: 206, column: 2, scope: !492)
!551 = !DILocation(line: 209, column: 2, scope: !552)
!552 = distinct !DILexicalBlock(scope: !202, file: !1, line: 209, column: 2)
!553 = !DILocation(line: 209, column: 2, scope: !554)
!554 = distinct !DILexicalBlock(scope: !552, file: !1, line: 209, column: 2)
!555 = !DILocation(line: 210, column: 3, scope: !556)
!556 = distinct !DILexicalBlock(scope: !554, file: !1, line: 209, column: 48)
!557 = !DILocation(line: 211, column: 3, scope: !558)
!558 = distinct !DILexicalBlock(scope: !556, file: !1, line: 211, column: 3)
!559 = !DILocation(line: 211, column: 3, scope: !560)
!560 = distinct !DILexicalBlock(scope: !558, file: !1, line: 211, column: 3)
!561 = !DILocation(line: 212, column: 8, scope: !562)
!562 = distinct !DILexicalBlock(scope: !563, file: !1, line: 212, column: 8)
!563 = distinct !DILexicalBlock(scope: !560, file: !1, line: 211, column: 49)
!564 = !DILocation(line: 212, column: 8, scope: !563)
!565 = !DILocation(line: 213, column: 5, scope: !566)
!566 = distinct !DILexicalBlock(scope: !562, file: !1, line: 212, column: 47)
!567 = !DILocation(line: 214, column: 4, scope: !566)
!568 = !DILocation(line: 215, column: 8, scope: !569)
!569 = distinct !DILexicalBlock(scope: !563, file: !1, line: 215, column: 8)
!570 = !DILocation(line: 215, column: 8, scope: !563)
!571 = !DILocation(line: 216, column: 5, scope: !572)
!572 = distinct !DILexicalBlock(scope: !569, file: !1, line: 215, column: 48)
!573 = !DILocation(line: 217, column: 4, scope: !572)
!574 = !DILocation(line: 218, column: 3, scope: !563)
!575 = distinct !{!575, !557, !576}
!576 = !DILocation(line: 218, column: 3, scope: !558)
!577 = !DILocation(line: 219, column: 2, scope: !556)
!578 = distinct !{!578, !551, !579}
!579 = !DILocation(line: 219, column: 2, scope: !552)
!580 = !DILocation(line: 220, column: 2, scope: !202)
!581 = !DILocation(line: 220, column: 6, scope: !202)
!582 = !DILocation(line: 220, column: 23, scope: !202)
!583 = !DILocation(line: 224, column: 2, scope: !584)
!584 = distinct !DILexicalBlock(scope: !202, file: !1, line: 224, column: 2)
!585 = !DILocation(line: 224, column: 2, scope: !586)
!586 = distinct !DILexicalBlock(scope: !584, file: !1, line: 224, column: 2)
!587 = !DILocation(line: 225, column: 8, scope: !588)
!588 = distinct !DILexicalBlock(scope: !589, file: !1, line: 225, column: 7)
!589 = distinct !DILexicalBlock(scope: !586, file: !1, line: 224, column: 48)
!590 = !DILocation(line: 225, column: 7, scope: !589)
!591 = !DILocation(line: 226, column: 4, scope: !588)
!592 = !DILocation(line: 228, column: 7, scope: !593)
!593 = distinct !DILexicalBlock(scope: !589, file: !1, line: 228, column: 7)
!594 = !DILocation(line: 228, column: 10, scope: !593)
!595 = !DILocation(line: 228, column: 16, scope: !593)
!596 = !DILocation(line: 228, column: 14, scope: !593)
!597 = !DILocation(line: 228, column: 37, scope: !593)
!598 = !DILocation(line: 228, column: 7, scope: !589)
!599 = !DILocation(line: 229, column: 4, scope: !600)
!600 = distinct !DILexicalBlock(scope: !593, file: !1, line: 228, column: 42)
!601 = !DILocation(line: 230, column: 4, scope: !600)
!602 = !DILocation(line: 233, column: 25, scope: !589)
!603 = !DILocation(line: 233, column: 29, scope: !589)
!604 = !DILocation(line: 233, column: 32, scope: !589)
!605 = !DILocation(line: 233, column: 3, scope: !589)
!606 = !DILocation(line: 234, column: 2, scope: !589)
!607 = distinct !{!607, !583, !608}
!608 = !DILocation(line: 234, column: 2, scope: !584)
!609 = !DILocation(line: 236, column: 32, scope: !202)
!610 = !DILocation(line: 236, column: 2, scope: !202)
!611 = !DILocation(line: 237, column: 1, scope: !202)
!612 = distinct !DISubprogram(name: "BM_iter_new", scope: !613, file: !613, line: 172, type: !614, scopeLine: 173, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !347)
!613 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators_inline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!614 = !DISubroutineType(types: !615)
!615 = !{!113, !616, !205, !248, !113}
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!617 = !DILocalVariable(name: "iter", arg: 1, scope: !612, file: !613, line: 172, type: !616)
!618 = !DILocation(line: 172, column: 38, scope: !612)
!619 = !DILocalVariable(name: "bm", arg: 2, scope: !612, file: !613, line: 172, type: !205)
!620 = !DILocation(line: 172, column: 51, scope: !612)
!621 = !DILocalVariable(name: "itype", arg: 3, scope: !612, file: !613, line: 172, type: !248)
!622 = !DILocation(line: 172, column: 66, scope: !612)
!623 = !DILocalVariable(name: "data", arg: 4, scope: !612, file: !613, line: 172, type: !113)
!624 = !DILocation(line: 172, column: 79, scope: !612)
!625 = !DILocation(line: 174, column: 6, scope: !626)
!626 = distinct !DILexicalBlock(scope: !612, file: !613, line: 174, column: 6)
!627 = !DILocation(line: 174, column: 6, scope: !612)
!628 = !DILocation(line: 175, column: 23, scope: !629)
!629 = distinct !DILexicalBlock(scope: !626, file: !613, line: 174, column: 51)
!630 = !DILocation(line: 175, column: 10, scope: !629)
!631 = !DILocation(line: 175, column: 3, scope: !629)
!632 = !DILocation(line: 178, column: 3, scope: !633)
!633 = distinct !DILexicalBlock(scope: !626, file: !613, line: 177, column: 7)
!634 = !DILocation(line: 180, column: 1, scope: !612)
!635 = distinct !DISubprogram(name: "BMO_slot_map_elem_get", scope: !636, file: !636, line: 188, type: !637, scopeLine: 189, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !347)
!636 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_operator_api_inline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!637 = !DISubroutineType(types: !638)
!638 = !{!113, !454, !639}
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!641 = !DILocalVariable(name: "slot", arg: 1, scope: !635, file: !636, line: 188, type: !454)
!642 = !DILocation(line: 188, column: 50, scope: !635)
!643 = !DILocalVariable(name: "element", arg: 2, scope: !635, file: !636, line: 188, type: !639)
!644 = !DILocation(line: 188, column: 68, scope: !635)
!645 = !DILocalVariable(name: "val", scope: !635, file: !636, line: 190, type: !117)
!646 = !DILocation(line: 190, column: 9, scope: !635)
!647 = !DILocation(line: 190, column: 47, scope: !635)
!648 = !DILocation(line: 190, column: 53, scope: !635)
!649 = !DILocation(line: 190, column: 25, scope: !635)
!650 = !DILocation(line: 192, column: 6, scope: !651)
!651 = distinct !DILexicalBlock(scope: !635, file: !636, line: 192, column: 6)
!652 = !DILocation(line: 192, column: 6, scope: !635)
!653 = !DILocation(line: 192, column: 19, scope: !651)
!654 = !DILocation(line: 192, column: 18, scope: !651)
!655 = !DILocation(line: 192, column: 11, scope: !651)
!656 = !DILocation(line: 194, column: 2, scope: !635)
!657 = !DILocation(line: 195, column: 1, scope: !635)
!658 = distinct !DISubprogram(name: "_bmo_elem_flag_enable", scope: !636, file: !636, line: 51, type: !659, scopeLine: 52, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !347)
!659 = !DISubroutineType(types: !660)
!660 = !{null, !205, !661, !663}
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFlagLayer", file: !66, line: 182, baseType: !145)
!663 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!664 = !DILocalVariable(name: "bm", arg: 1, scope: !658, file: !636, line: 51, type: !205)
!665 = !DILocation(line: 51, column: 46, scope: !658)
!666 = !DILocalVariable(name: "oflags", arg: 2, scope: !658, file: !636, line: 51, type: !661)
!667 = !DILocation(line: 51, column: 63, scope: !658)
!668 = !DILocalVariable(name: "oflag", arg: 3, scope: !658, file: !636, line: 51, type: !663)
!669 = !DILocation(line: 51, column: 83, scope: !658)
!670 = !DILocation(line: 53, column: 34, scope: !658)
!671 = !DILocation(line: 53, column: 2, scope: !658)
!672 = !DILocation(line: 53, column: 9, scope: !658)
!673 = !DILocation(line: 53, column: 13, scope: !658)
!674 = !DILocation(line: 53, column: 24, scope: !658)
!675 = !DILocation(line: 53, column: 29, scope: !658)
!676 = !DILocation(line: 53, column: 31, scope: !658)
!677 = !DILocation(line: 54, column: 1, scope: !658)
!678 = distinct !DISubprogram(name: "_bm_elem_flag_merge", scope: !679, file: !679, line: 73, type: !680, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !347)
!679 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_inline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!680 = !DISubroutineType(types: !681)
!681 = !{null, !682, !682}
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!683 = !DILocalVariable(name: "head_a", arg: 1, scope: !678, file: !679, line: 73, type: !682)
!684 = !DILocation(line: 73, column: 47, scope: !678)
!685 = !DILocalVariable(name: "head_b", arg: 2, scope: !678, file: !679, line: 73, type: !682)
!686 = !DILocation(line: 73, column: 65, scope: !678)
!687 = !DILocation(line: 75, column: 34, scope: !678)
!688 = !DILocation(line: 75, column: 42, scope: !678)
!689 = !DILocation(line: 75, column: 50, scope: !678)
!690 = !DILocation(line: 75, column: 58, scope: !678)
!691 = !DILocation(line: 75, column: 48, scope: !678)
!692 = !DILocation(line: 75, column: 18, scope: !678)
!693 = !DILocation(line: 75, column: 26, scope: !678)
!694 = !DILocation(line: 75, column: 32, scope: !678)
!695 = !DILocation(line: 75, column: 2, scope: !678)
!696 = !DILocation(line: 75, column: 10, scope: !678)
!697 = !DILocation(line: 75, column: 16, scope: !678)
!698 = !DILocation(line: 76, column: 1, scope: !678)
!699 = distinct !DISubprogram(name: "BM_iter_step", scope: !613, file: !613, line: 40, type: !700, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !347)
!700 = !DISubroutineType(types: !701)
!701 = !{!113, !616}
!702 = !DILocalVariable(name: "iter", arg: 1, scope: !699, file: !613, line: 40, type: !616)
!703 = !DILocation(line: 40, column: 39, scope: !699)
!704 = !DILocation(line: 42, column: 9, scope: !699)
!705 = !DILocation(line: 42, column: 15, scope: !699)
!706 = !DILocation(line: 42, column: 20, scope: !699)
!707 = !DILocation(line: 42, column: 2, scope: !699)
!708 = distinct !DISubprogram(name: "remdoubles_splitface", scope: !1, file: !1, line: 42, type: !709, scopeLine: 43, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !347)
!709 = !DISubroutineType(types: !710)
!710 = !{null, !196, !205, !345, !454}
!711 = !DILocalVariable(name: "f", arg: 1, scope: !708, file: !1, line: 42, type: !196)
!712 = !DILocation(line: 42, column: 42, scope: !708)
!713 = !DILocalVariable(name: "bm", arg: 2, scope: !708, file: !1, line: 42, type: !205)
!714 = !DILocation(line: 42, column: 52, scope: !708)
!715 = !DILocalVariable(name: "op", arg: 3, scope: !708, file: !1, line: 42, type: !345)
!716 = !DILocation(line: 42, column: 68, scope: !708)
!717 = !DILocalVariable(name: "slot_targetmap", arg: 4, scope: !708, file: !1, line: 42, type: !454)
!718 = !DILocation(line: 42, column: 82, scope: !708)
!719 = !DILocalVariable(name: "liter", scope: !708, file: !1, line: 44, type: !353)
!720 = !DILocation(line: 44, column: 9, scope: !708)
!721 = !DILocalVariable(name: "l", scope: !708, file: !1, line: 45, type: !178)
!722 = !DILocation(line: 45, column: 10, scope: !708)
!723 = !DILocalVariable(name: "l_tar", scope: !708, file: !1, line: 45, type: !178)
!724 = !DILocation(line: 45, column: 14, scope: !708)
!725 = !DILocalVariable(name: "l_double", scope: !708, file: !1, line: 45, type: !178)
!726 = !DILocation(line: 45, column: 22, scope: !708)
!727 = !DILocalVariable(name: "split", scope: !708, file: !1, line: 46, type: !498)
!728 = !DILocation(line: 46, column: 7, scope: !708)
!729 = !DILocation(line: 48, column: 2, scope: !730)
!730 = distinct !DILexicalBlock(scope: !708, file: !1, line: 48, column: 2)
!731 = !DILocation(line: 48, column: 2, scope: !732)
!732 = distinct !DILexicalBlock(scope: !730, file: !1, line: 48, column: 2)
!733 = !DILocalVariable(name: "v_tar", scope: !734, file: !1, line: 49, type: !129)
!734 = distinct !DILexicalBlock(scope: !732, file: !1, line: 48, column: 48)
!735 = !DILocation(line: 49, column: 11, scope: !734)
!736 = !DILocation(line: 49, column: 41, scope: !734)
!737 = !DILocation(line: 49, column: 57, scope: !734)
!738 = !DILocation(line: 49, column: 60, scope: !734)
!739 = !DILocation(line: 49, column: 19, scope: !734)
!740 = !DILocation(line: 52, column: 7, scope: !741)
!741 = distinct !DILexicalBlock(scope: !734, file: !1, line: 52, column: 7)
!742 = !DILocation(line: 52, column: 7, scope: !734)
!743 = !DILocation(line: 53, column: 36, scope: !744)
!744 = distinct !DILexicalBlock(scope: !741, file: !1, line: 52, column: 14)
!745 = !DILocation(line: 53, column: 39, scope: !744)
!746 = !DILocation(line: 53, column: 12, scope: !744)
!747 = !DILocation(line: 53, column: 10, scope: !744)
!748 = !DILocation(line: 55, column: 8, scope: !749)
!749 = distinct !DILexicalBlock(scope: !744, file: !1, line: 55, column: 8)
!750 = !DILocation(line: 55, column: 14, scope: !749)
!751 = !DILocation(line: 55, column: 18, scope: !749)
!752 = !DILocation(line: 55, column: 27, scope: !749)
!753 = !DILocation(line: 55, column: 24, scope: !749)
!754 = !DILocation(line: 55, column: 30, scope: !749)
!755 = !DILocation(line: 55, column: 54, scope: !749)
!756 = !DILocation(line: 55, column: 61, scope: !749)
!757 = !DILocation(line: 55, column: 34, scope: !749)
!758 = !DILocation(line: 55, column: 8, scope: !744)
!759 = !DILocation(line: 56, column: 16, scope: !760)
!760 = distinct !DILexicalBlock(scope: !749, file: !1, line: 55, column: 65)
!761 = !DILocation(line: 56, column: 14, scope: !760)
!762 = !DILocation(line: 57, column: 11, scope: !760)
!763 = !DILocation(line: 58, column: 5, scope: !760)
!764 = !DILocation(line: 60, column: 3, scope: !744)
!765 = !DILocation(line: 61, column: 2, scope: !734)
!766 = distinct !{!766, !729, !767}
!767 = !DILocation(line: 61, column: 2, scope: !730)
!768 = !DILocation(line: 63, column: 6, scope: !769)
!769 = distinct !DILexicalBlock(scope: !708, file: !1, line: 63, column: 6)
!770 = !DILocation(line: 63, column: 6, scope: !708)
!771 = !DILocalVariable(name: "l_new", scope: !772, file: !1, line: 64, type: !178)
!772 = distinct !DILexicalBlock(scope: !769, file: !1, line: 63, column: 13)
!773 = !DILocation(line: 64, column: 11, scope: !772)
!774 = !DILocalVariable(name: "f_new", scope: !772, file: !1, line: 65, type: !196)
!775 = !DILocation(line: 65, column: 11, scope: !772)
!776 = !DILocation(line: 67, column: 25, scope: !772)
!777 = !DILocation(line: 67, column: 29, scope: !772)
!778 = !DILocation(line: 67, column: 32, scope: !772)
!779 = !DILocation(line: 67, column: 42, scope: !772)
!780 = !DILocation(line: 67, column: 11, scope: !772)
!781 = !DILocation(line: 67, column: 9, scope: !772)
!782 = !DILocation(line: 69, column: 24, scope: !772)
!783 = !DILocation(line: 69, column: 31, scope: !772)
!784 = !DILocation(line: 69, column: 35, scope: !772)
!785 = !DILocation(line: 69, column: 39, scope: !772)
!786 = !DILocation(line: 69, column: 3, scope: !772)
!787 = !DILocation(line: 70, column: 24, scope: !772)
!788 = !DILocation(line: 70, column: 31, scope: !772)
!789 = !DILocation(line: 70, column: 35, scope: !772)
!790 = !DILocation(line: 70, column: 39, scope: !772)
!791 = !DILocation(line: 70, column: 3, scope: !772)
!792 = !DILocation(line: 71, column: 2, scope: !772)
!793 = !DILocation(line: 72, column: 1, scope: !708)
!794 = distinct !DISubprogram(name: "_bmo_elem_flag_test_bool", scope: !636, file: !636, line: 46, type: !795, scopeLine: 47, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !347)
!795 = !DISubroutineType(types: !796)
!796 = !{!498, !205, !661, !663}
!797 = !DILocalVariable(name: "bm", arg: 1, scope: !794, file: !636, line: 46, type: !205)
!798 = !DILocation(line: 46, column: 49, scope: !794)
!799 = !DILocalVariable(name: "oflags", arg: 2, scope: !794, file: !636, line: 46, type: !661)
!800 = !DILocation(line: 46, column: 66, scope: !794)
!801 = !DILocalVariable(name: "oflag", arg: 3, scope: !794, file: !636, line: 46, type: !663)
!802 = !DILocation(line: 46, column: 86, scope: !794)
!803 = !DILocation(line: 48, column: 10, scope: !794)
!804 = !DILocation(line: 48, column: 17, scope: !794)
!805 = !DILocation(line: 48, column: 21, scope: !794)
!806 = !DILocation(line: 48, column: 32, scope: !794)
!807 = !DILocation(line: 48, column: 37, scope: !794)
!808 = !DILocation(line: 48, column: 41, scope: !794)
!809 = !DILocation(line: 48, column: 39, scope: !794)
!810 = !DILocation(line: 48, column: 48, scope: !794)
!811 = !DILocation(line: 48, column: 9, scope: !794)
!812 = !DILocation(line: 48, column: 2, scope: !794)
!813 = distinct !DISubprogram(name: "_bm_elem_index_set", scope: !679, file: !679, line: 114, type: !814, scopeLine: 115, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !347)
!814 = !DISubroutineType(types: !815)
!815 = !{null, !682, !816}
!816 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !139)
!817 = !DILocalVariable(name: "head", arg: 1, scope: !813, file: !679, line: 114, type: !682)
!818 = !DILocation(line: 114, column: 46, scope: !813)
!819 = !DILocalVariable(name: "index", arg: 2, scope: !813, file: !679, line: 114, type: !816)
!820 = !DILocation(line: 114, column: 62, scope: !813)
!821 = !DILocation(line: 116, column: 16, scope: !813)
!822 = !DILocation(line: 116, column: 2, scope: !813)
!823 = !DILocation(line: 116, column: 8, scope: !813)
!824 = !DILocation(line: 116, column: 14, scope: !813)
!825 = !DILocation(line: 117, column: 1, scope: !813)
!826 = distinct !DISubprogram(name: "_bmo_elem_flag_test", scope: !636, file: !636, line: 41, type: !827, scopeLine: 42, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !347)
!827 = !DISubroutineType(types: !828)
!828 = !{!148, !205, !661, !663}
!829 = !DILocalVariable(name: "bm", arg: 1, scope: !826, file: !636, line: 41, type: !205)
!830 = !DILocation(line: 41, column: 45, scope: !826)
!831 = !DILocalVariable(name: "oflags", arg: 2, scope: !826, file: !636, line: 41, type: !661)
!832 = !DILocation(line: 41, column: 62, scope: !826)
!833 = !DILocalVariable(name: "oflag", arg: 3, scope: !826, file: !636, line: 41, type: !663)
!834 = !DILocation(line: 41, column: 82, scope: !826)
!835 = !DILocation(line: 43, column: 9, scope: !826)
!836 = !DILocation(line: 43, column: 16, scope: !826)
!837 = !DILocation(line: 43, column: 20, scope: !826)
!838 = !DILocation(line: 43, column: 31, scope: !826)
!839 = !DILocation(line: 43, column: 36, scope: !826)
!840 = !DILocation(line: 43, column: 40, scope: !826)
!841 = !DILocation(line: 43, column: 38, scope: !826)
!842 = !DILocation(line: 43, column: 2, scope: !826)
!843 = distinct !DISubprogram(name: "_bm_elem_index_get", scope: !679, file: !679, line: 119, type: !844, scopeLine: 120, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !347)
!844 = !DISubroutineType(types: !845)
!845 = !{!139, !846}
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!848 = !DILocalVariable(name: "head", arg: 1, scope: !843, file: !679, line: 119, type: !846)
!849 = !DILocation(line: 119, column: 51, scope: !843)
!850 = !DILocation(line: 121, column: 9, scope: !843)
!851 = !DILocation(line: 121, column: 15, scope: !843)
!852 = !DILocation(line: 121, column: 2, scope: !843)
!853 = distinct !DISubprogram(name: "remdoubles_createface", scope: !1, file: !1, line: 81, type: !854, scopeLine: 82, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !347)
!854 = !DISubroutineType(types: !855)
!855 = !{null, !205, !196, !454}
!856 = !DILocalVariable(name: "bm", arg: 1, scope: !853, file: !1, line: 81, type: !205)
!857 = !DILocation(line: 81, column: 42, scope: !853)
!858 = !DILocalVariable(name: "f", arg: 2, scope: !853, file: !1, line: 81, type: !196)
!859 = !DILocation(line: 81, column: 54, scope: !853)
!860 = !DILocalVariable(name: "slot_targetmap", arg: 3, scope: !853, file: !1, line: 81, type: !454)
!861 = !DILocation(line: 81, column: 67, scope: !853)
!862 = !DILocalVariable(name: "liter", scope: !853, file: !1, line: 83, type: !353)
!863 = !DILocation(line: 83, column: 9, scope: !853)
!864 = !DILocalVariable(name: "f_new", scope: !853, file: !1, line: 84, type: !196)
!865 = !DILocation(line: 84, column: 10, scope: !853)
!866 = !DILocalVariable(name: "e_new", scope: !853, file: !1, line: 85, type: !194)
!867 = !DILocation(line: 85, column: 10, scope: !853)
!868 = !DILocalVariable(name: "l", scope: !853, file: !1, line: 87, type: !178)
!869 = !DILocation(line: 87, column: 10, scope: !853)
!870 = !DILocalVariable(name: "edges", scope: !853, file: !1, line: 89, type: !228)
!871 = !DILocation(line: 89, column: 11, scope: !853)
!872 = !DILocation(line: 89, column: 19, scope: !853)
!873 = !DILocalVariable(name: "loops", scope: !853, file: !1, line: 90, type: !874)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!875 = !DILocation(line: 90, column: 11, scope: !853)
!876 = !DILocation(line: 90, column: 19, scope: !853)
!877 = !DILocalVariable(name: "_edges_index", scope: !853, file: !1, line: 92, type: !5)
!878 = !DILocation(line: 92, column: 2, scope: !853)
!879 = !DILocalVariable(name: "_loops_index", scope: !853, file: !1, line: 93, type: !5)
!880 = !DILocation(line: 93, column: 2, scope: !853)
!881 = !DILocation(line: 95, column: 2, scope: !853)
!882 = !DILocation(line: 96, column: 2, scope: !853)
!883 = !DILocation(line: 98, column: 2, scope: !884)
!884 = distinct !DILexicalBlock(scope: !853, file: !1, line: 98, column: 2)
!885 = !DILocation(line: 98, column: 2, scope: !886)
!886 = distinct !DILexicalBlock(scope: !884, file: !1, line: 98, column: 2)
!887 = !DILocalVariable(name: "v1", scope: !888, file: !1, line: 99, type: !129)
!888 = distinct !DILexicalBlock(scope: !886, file: !1, line: 98, column: 48)
!889 = !DILocation(line: 99, column: 11, scope: !888)
!890 = !DILocation(line: 99, column: 16, scope: !888)
!891 = !DILocation(line: 99, column: 19, scope: !888)
!892 = !DILocalVariable(name: "v2", scope: !888, file: !1, line: 100, type: !129)
!893 = !DILocation(line: 100, column: 11, scope: !888)
!894 = !DILocation(line: 100, column: 16, scope: !888)
!895 = !DILocation(line: 100, column: 19, scope: !888)
!896 = !DILocation(line: 100, column: 25, scope: !888)
!897 = !DILocalVariable(name: "is_del_v1", scope: !888, file: !1, line: 102, type: !497)
!898 = !DILocation(line: 102, column: 14, scope: !888)
!899 = !DILocation(line: 102, column: 26, scope: !888)
!900 = !DILocalVariable(name: "is_del_v2", scope: !888, file: !1, line: 103, type: !497)
!901 = !DILocation(line: 103, column: 14, scope: !888)
!902 = !DILocation(line: 103, column: 26, scope: !888)
!903 = !DILocation(line: 106, column: 7, scope: !904)
!904 = distinct !DILexicalBlock(scope: !888, file: !1, line: 106, column: 7)
!905 = !DILocation(line: 106, column: 17, scope: !904)
!906 = !DILocation(line: 106, column: 20, scope: !904)
!907 = !DILocation(line: 106, column: 7, scope: !888)
!908 = !DILocation(line: 107, column: 8, scope: !909)
!909 = distinct !DILexicalBlock(scope: !910, file: !1, line: 107, column: 8)
!910 = distinct !DILexicalBlock(scope: !904, file: !1, line: 106, column: 31)
!911 = !DILocation(line: 107, column: 8, scope: !910)
!912 = !DILocation(line: 108, column: 32, scope: !909)
!913 = !DILocation(line: 108, column: 48, scope: !909)
!914 = !DILocation(line: 108, column: 10, scope: !909)
!915 = !DILocation(line: 108, column: 8, scope: !909)
!916 = !DILocation(line: 108, column: 5, scope: !909)
!917 = !DILocation(line: 109, column: 8, scope: !918)
!918 = distinct !DILexicalBlock(scope: !910, file: !1, line: 109, column: 8)
!919 = !DILocation(line: 109, column: 8, scope: !910)
!920 = !DILocation(line: 110, column: 32, scope: !918)
!921 = !DILocation(line: 110, column: 48, scope: !918)
!922 = !DILocation(line: 110, column: 10, scope: !918)
!923 = !DILocation(line: 110, column: 8, scope: !918)
!924 = !DILocation(line: 110, column: 5, scope: !918)
!925 = !DILocation(line: 112, column: 13, scope: !910)
!926 = !DILocation(line: 112, column: 19, scope: !910)
!927 = !DILocation(line: 112, column: 16, scope: !910)
!928 = !DILocation(line: 112, column: 12, scope: !910)
!929 = !DILocation(line: 112, column: 40, scope: !910)
!930 = !DILocation(line: 112, column: 44, scope: !910)
!931 = !DILocation(line: 112, column: 25, scope: !910)
!932 = !DILocation(line: 112, column: 10, scope: !910)
!933 = !DILocation(line: 113, column: 3, scope: !910)
!934 = !DILocation(line: 115, column: 12, scope: !935)
!935 = distinct !DILexicalBlock(scope: !904, file: !1, line: 114, column: 8)
!936 = !DILocation(line: 115, column: 15, scope: !935)
!937 = !DILocation(line: 115, column: 10, scope: !935)
!938 = !DILocation(line: 118, column: 7, scope: !939)
!939 = distinct !DILexicalBlock(scope: !888, file: !1, line: 118, column: 7)
!940 = !DILocation(line: 118, column: 7, scope: !888)
!941 = !DILocalVariable(name: "i", scope: !942, file: !1, line: 119, type: !5)
!942 = distinct !DILexicalBlock(scope: !939, file: !1, line: 118, column: 14)
!943 = !DILocation(line: 119, column: 17, scope: !942)
!944 = !DILocation(line: 120, column: 11, scope: !945)
!945 = distinct !DILexicalBlock(scope: !942, file: !1, line: 120, column: 4)
!946 = !DILocation(line: 120, column: 9, scope: !945)
!947 = !DILocation(line: 120, column: 16, scope: !948)
!948 = distinct !DILexicalBlock(scope: !945, file: !1, line: 120, column: 4)
!949 = !DILocation(line: 120, column: 20, scope: !948)
!950 = !DILocation(line: 120, column: 18, scope: !948)
!951 = !DILocation(line: 120, column: 4, scope: !945)
!952 = !DILocation(line: 121, column: 9, scope: !953)
!953 = distinct !DILexicalBlock(scope: !954, file: !1, line: 121, column: 9)
!954 = distinct !DILexicalBlock(scope: !948, file: !1, line: 120, column: 44)
!955 = !DILocation(line: 121, column: 15, scope: !953)
!956 = !DILocation(line: 121, column: 21, scope: !953)
!957 = !DILocation(line: 121, column: 18, scope: !953)
!958 = !DILocation(line: 121, column: 9, scope: !954)
!959 = !DILocation(line: 122, column: 6, scope: !960)
!960 = distinct !DILexicalBlock(scope: !953, file: !1, line: 121, column: 28)
!961 = !DILocation(line: 124, column: 4, scope: !954)
!962 = !DILocation(line: 120, column: 40, scope: !948)
!963 = !DILocation(line: 120, column: 4, scope: !948)
!964 = distinct !{!964, !951, !965}
!965 = !DILocation(line: 124, column: 4, scope: !945)
!966 = !DILocation(line: 125, column: 8, scope: !967)
!967 = distinct !DILexicalBlock(scope: !942, file: !1, line: 125, column: 8)
!968 = !DILocation(line: 125, column: 8, scope: !942)
!969 = !DILocation(line: 126, column: 5, scope: !970)
!970 = distinct !DILexicalBlock(scope: !967, file: !1, line: 125, column: 42)
!971 = !DILocation(line: 129, column: 4, scope: !942)
!972 = !DILocation(line: 130, column: 4, scope: !942)
!973 = !DILocation(line: 131, column: 3, scope: !942)
!974 = !DILocation(line: 132, column: 2, scope: !888)
!975 = distinct !{!975, !883, !976}
!976 = !DILocation(line: 132, column: 2, scope: !884)
!977 = !DILocation(line: 134, column: 6, scope: !978)
!978 = distinct !DILexicalBlock(scope: !853, file: !1, line: 134, column: 6)
!979 = !DILocation(line: 134, column: 24, scope: !978)
!980 = !DILocation(line: 134, column: 6, scope: !853)
!981 = !DILocalVariable(name: "v1", scope: !982, file: !1, line: 135, type: !129)
!982 = distinct !DILexicalBlock(scope: !978, file: !1, line: 134, column: 30)
!983 = !DILocation(line: 135, column: 11, scope: !982)
!984 = !DILocation(line: 135, column: 16, scope: !982)
!985 = !DILocation(line: 135, column: 26, scope: !982)
!986 = !DILocalVariable(name: "v2", scope: !982, file: !1, line: 136, type: !129)
!987 = !DILocation(line: 136, column: 11, scope: !982)
!988 = !DILocation(line: 136, column: 16, scope: !982)
!989 = !DILocation(line: 136, column: 26, scope: !982)
!990 = !DILocation(line: 138, column: 7, scope: !991)
!991 = distinct !DILexicalBlock(scope: !982, file: !1, line: 138, column: 7)
!992 = !DILocation(line: 138, column: 7, scope: !982)
!993 = !DILocation(line: 139, column: 31, scope: !994)
!994 = distinct !DILexicalBlock(scope: !991, file: !1, line: 138, column: 44)
!995 = !DILocation(line: 139, column: 47, scope: !994)
!996 = !DILocation(line: 139, column: 9, scope: !994)
!997 = !DILocation(line: 139, column: 7, scope: !994)
!998 = !DILocation(line: 140, column: 3, scope: !994)
!999 = !DILocation(line: 141, column: 7, scope: !1000)
!1000 = distinct !DILexicalBlock(scope: !982, file: !1, line: 141, column: 7)
!1001 = !DILocation(line: 141, column: 7, scope: !982)
!1002 = !DILocation(line: 142, column: 31, scope: !1003)
!1003 = distinct !DILexicalBlock(scope: !1000, file: !1, line: 141, column: 44)
!1004 = !DILocation(line: 142, column: 47, scope: !1003)
!1005 = !DILocation(line: 142, column: 9, scope: !1003)
!1006 = !DILocation(line: 142, column: 7, scope: !1003)
!1007 = !DILocation(line: 143, column: 3, scope: !1003)
!1008 = !DILocation(line: 145, column: 31, scope: !982)
!1009 = !DILocation(line: 145, column: 35, scope: !982)
!1010 = !DILocation(line: 145, column: 39, scope: !982)
!1011 = !DILocation(line: 145, column: 43, scope: !982)
!1012 = !DILocation(line: 145, column: 50, scope: !982)
!1013 = !DILocation(line: 145, column: 69, scope: !982)
!1014 = !DILocation(line: 145, column: 11, scope: !982)
!1015 = !DILocation(line: 145, column: 9, scope: !982)
!1016 = !DILocation(line: 148, column: 7, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !982, file: !1, line: 148, column: 7)
!1018 = !DILocation(line: 148, column: 7, scope: !982)
!1019 = !DILocalVariable(name: "i", scope: !1020, file: !1, line: 149, type: !5)
!1020 = distinct !DILexicalBlock(scope: !1017, file: !1, line: 148, column: 14)
!1021 = !DILocation(line: 149, column: 17, scope: !1020)
!1022 = !DILocation(line: 150, column: 4, scope: !1023)
!1023 = distinct !DILexicalBlock(scope: !1020, file: !1, line: 150, column: 4)
!1024 = !DILocation(line: 150, column: 4, scope: !1025)
!1025 = distinct !DILexicalBlock(scope: !1023, file: !1, line: 150, column: 4)
!1026 = !DILocation(line: 151, column: 24, scope: !1027)
!1027 = distinct !DILexicalBlock(scope: !1025, file: !1, line: 150, column: 63)
!1028 = !DILocation(line: 151, column: 28, scope: !1027)
!1029 = !DILocation(line: 151, column: 32, scope: !1027)
!1030 = !DILocation(line: 151, column: 38, scope: !1027)
!1031 = !DILocation(line: 151, column: 42, scope: !1027)
!1032 = !DILocation(line: 151, column: 5, scope: !1027)
!1033 = !DILocation(line: 152, column: 4, scope: !1027)
!1034 = distinct !{!1034, !1022, !1035}
!1035 = !DILocation(line: 152, column: 4, scope: !1023)
!1036 = !DILocation(line: 153, column: 3, scope: !1020)
!1037 = !DILocation(line: 154, column: 2, scope: !982)
!1038 = !DILocation(line: 155, column: 1, scope: !853)
!1039 = distinct !DISubprogram(name: "bmo_pointmerge_facedata_exec", scope: !1, file: !1, line: 259, type: !203, scopeLine: 260, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !347)
!1040 = !DILocalVariable(name: "bm", arg: 1, scope: !1039, file: !1, line: 259, type: !205)
!1041 = !DILocation(line: 259, column: 42, scope: !1039)
!1042 = !DILocalVariable(name: "op", arg: 2, scope: !1039, file: !1, line: 259, type: !345)
!1043 = !DILocation(line: 259, column: 58, scope: !1039)
!1044 = !DILocalVariable(name: "siter", scope: !1039, file: !1, line: 261, type: !1045)
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOIter", file: !4, line: 463, baseType: !1046)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOIter", file: !4, line: 457, size: 448, elements: !1047)
!1047 = !{!1048, !1049, !1050, !1059, !1060}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !1046, file: !4, line: 458, baseType: !454, size: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !1046, file: !4, line: 459, baseType: !139, size: 32, offset: 64)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "giter", scope: !1046, file: !4, line: 460, baseType: !1051, size: 192, offset: 128)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashIterator", file: !273, line: 54, baseType: !1052)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GHashIterator", file: !273, line: 50, size: 192, elements: !1053)
!1053 = !{!1054, !1055, !1058}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "gh", scope: !1052, file: !273, line: 51, baseType: !271, size: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "curEntry", scope: !1052, file: !273, line: 52, baseType: !1056, size: 64, offset: 64)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry", file: !273, line: 52, flags: DIFlagFwdDecl)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "curBucket", scope: !1052, file: !273, line: 53, baseType: !5, size: 32, offset: 128)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1046, file: !4, line: 461, baseType: !117, size: 64, offset: 320)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "restrictmask", scope: !1046, file: !4, line: 462, baseType: !119, size: 8, offset: 384)
!1061 = !DILocation(line: 261, column: 10, scope: !1039)
!1062 = !DILocalVariable(name: "iter", scope: !1039, file: !1, line: 262, type: !353)
!1063 = !DILocation(line: 262, column: 9, scope: !1039)
!1064 = !DILocalVariable(name: "v", scope: !1039, file: !1, line: 263, type: !129)
!1065 = !DILocation(line: 263, column: 10, scope: !1039)
!1066 = !DILocalVariable(name: "vert_snap", scope: !1039, file: !1, line: 263, type: !129)
!1067 = !DILocation(line: 263, column: 14, scope: !1039)
!1068 = !DILocalVariable(name: "l", scope: !1039, file: !1, line: 264, type: !178)
!1069 = !DILocation(line: 264, column: 10, scope: !1039)
!1070 = !DILocalVariable(name: "firstl", scope: !1039, file: !1, line: 264, type: !178)
!1071 = !DILocation(line: 264, column: 14, scope: !1039)
!1072 = !DILocalVariable(name: "fac", scope: !1039, file: !1, line: 265, type: !151)
!1073 = !DILocation(line: 265, column: 8, scope: !1039)
!1074 = !DILocalVariable(name: "i", scope: !1039, file: !1, line: 266, type: !139)
!1075 = !DILocation(line: 266, column: 6, scope: !1039)
!1076 = !DILocalVariable(name: "tot", scope: !1039, file: !1, line: 266, type: !139)
!1077 = !DILocation(line: 266, column: 9, scope: !1039)
!1078 = !DILocation(line: 268, column: 54, scope: !1039)
!1079 = !DILocation(line: 268, column: 58, scope: !1039)
!1080 = !DILocation(line: 268, column: 41, scope: !1039)
!1081 = !DILocation(line: 268, column: 14, scope: !1039)
!1082 = !DILocation(line: 268, column: 12, scope: !1039)
!1083 = !DILocation(line: 269, column: 27, scope: !1039)
!1084 = !DILocation(line: 269, column: 8, scope: !1039)
!1085 = !DILocation(line: 269, column: 6, scope: !1039)
!1086 = !DILocation(line: 271, column: 7, scope: !1087)
!1087 = distinct !DILexicalBlock(scope: !1039, file: !1, line: 271, column: 6)
!1088 = !DILocation(line: 271, column: 6, scope: !1039)
!1089 = !DILocation(line: 272, column: 3, scope: !1087)
!1090 = !DILocation(line: 274, column: 15, scope: !1039)
!1091 = !DILocation(line: 274, column: 13, scope: !1039)
!1092 = !DILocation(line: 274, column: 6, scope: !1039)
!1093 = !DILocation(line: 275, column: 2, scope: !1094)
!1094 = distinct !DILexicalBlock(scope: !1039, file: !1, line: 275, column: 2)
!1095 = !DILocation(line: 275, column: 2, scope: !1096)
!1096 = distinct !DILexicalBlock(scope: !1094, file: !1, line: 275, column: 2)
!1097 = !DILocation(line: 276, column: 8, scope: !1098)
!1098 = distinct !DILexicalBlock(scope: !1099, file: !1, line: 276, column: 7)
!1099 = distinct !DILexicalBlock(scope: !1096, file: !1, line: 275, column: 55)
!1100 = !DILocation(line: 276, column: 7, scope: !1099)
!1101 = !DILocation(line: 277, column: 13, scope: !1102)
!1102 = distinct !DILexicalBlock(scope: !1098, file: !1, line: 276, column: 16)
!1103 = !DILocation(line: 277, column: 11, scope: !1102)
!1104 = !DILocation(line: 278, column: 3, scope: !1102)
!1105 = !DILocation(line: 280, column: 10, scope: !1106)
!1106 = distinct !DILexicalBlock(scope: !1099, file: !1, line: 280, column: 3)
!1107 = !DILocation(line: 280, column: 8, scope: !1106)
!1108 = !DILocation(line: 280, column: 15, scope: !1109)
!1109 = distinct !DILexicalBlock(scope: !1106, file: !1, line: 280, column: 3)
!1110 = !DILocation(line: 280, column: 19, scope: !1109)
!1111 = !DILocation(line: 280, column: 23, scope: !1109)
!1112 = !DILocation(line: 280, column: 29, scope: !1109)
!1113 = !DILocation(line: 280, column: 17, scope: !1109)
!1114 = !DILocation(line: 280, column: 3, scope: !1106)
!1115 = !DILocation(line: 281, column: 35, scope: !1116)
!1116 = distinct !DILexicalBlock(scope: !1117, file: !1, line: 281, column: 8)
!1117 = distinct !DILexicalBlock(scope: !1109, file: !1, line: 280, column: 44)
!1118 = !DILocation(line: 281, column: 39, scope: !1116)
!1119 = !DILocation(line: 281, column: 46, scope: !1116)
!1120 = !DILocation(line: 281, column: 8, scope: !1116)
!1121 = !DILocation(line: 281, column: 8, scope: !1117)
!1122 = !DILocalVariable(name: "type", scope: !1123, file: !1, line: 282, type: !139)
!1123 = distinct !DILexicalBlock(scope: !1116, file: !1, line: 281, column: 50)
!1124 = !DILocation(line: 282, column: 9, scope: !1123)
!1125 = !DILocation(line: 282, column: 16, scope: !1123)
!1126 = !DILocation(line: 282, column: 20, scope: !1123)
!1127 = !DILocation(line: 282, column: 26, scope: !1123)
!1128 = !DILocation(line: 282, column: 33, scope: !1123)
!1129 = !DILocation(line: 282, column: 36, scope: !1123)
!1130 = !DILocalVariable(name: "e1", scope: !1123, file: !1, line: 283, type: !113)
!1131 = !DILocation(line: 283, column: 11, scope: !1123)
!1132 = !DILocalVariable(name: "e2", scope: !1123, file: !1, line: 283, type: !113)
!1133 = !DILocation(line: 283, column: 16, scope: !1123)
!1134 = !DILocation(line: 285, column: 40, scope: !1123)
!1135 = !DILocation(line: 285, column: 44, scope: !1123)
!1136 = !DILocation(line: 285, column: 51, scope: !1123)
!1137 = !DILocation(line: 285, column: 59, scope: !1123)
!1138 = !DILocation(line: 285, column: 64, scope: !1123)
!1139 = !DILocation(line: 285, column: 70, scope: !1123)
!1140 = !DILocation(line: 285, column: 10, scope: !1123)
!1141 = !DILocation(line: 285, column: 8, scope: !1123)
!1142 = !DILocation(line: 286, column: 40, scope: !1123)
!1143 = !DILocation(line: 286, column: 44, scope: !1123)
!1144 = !DILocation(line: 286, column: 51, scope: !1123)
!1145 = !DILocation(line: 286, column: 54, scope: !1123)
!1146 = !DILocation(line: 286, column: 59, scope: !1123)
!1147 = !DILocation(line: 286, column: 65, scope: !1123)
!1148 = !DILocation(line: 286, column: 10, scope: !1123)
!1149 = !DILocation(line: 286, column: 8, scope: !1123)
!1150 = !DILocation(line: 288, column: 30, scope: !1123)
!1151 = !DILocation(line: 288, column: 36, scope: !1123)
!1152 = !DILocation(line: 288, column: 40, scope: !1123)
!1153 = !DILocation(line: 288, column: 5, scope: !1123)
!1154 = !DILocation(line: 290, column: 9, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !1123, file: !1, line: 290, column: 9)
!1156 = !DILocation(line: 290, column: 14, scope: !1155)
!1157 = !DILocation(line: 290, column: 11, scope: !1155)
!1158 = !DILocation(line: 290, column: 9, scope: !1123)
!1159 = !DILocation(line: 291, column: 26, scope: !1155)
!1160 = !DILocation(line: 291, column: 32, scope: !1155)
!1161 = !DILocation(line: 291, column: 36, scope: !1155)
!1162 = !DILocation(line: 291, column: 6, scope: !1155)
!1163 = !DILocation(line: 292, column: 4, scope: !1123)
!1164 = !DILocation(line: 293, column: 3, scope: !1117)
!1165 = !DILocation(line: 280, column: 40, scope: !1109)
!1166 = !DILocation(line: 280, column: 3, scope: !1109)
!1167 = distinct !{!1167, !1114, !1168}
!1168 = !DILocation(line: 293, column: 3, scope: !1106)
!1169 = !DILocation(line: 294, column: 2, scope: !1099)
!1170 = distinct !{!1170, !1093, !1171}
!1171 = !DILocation(line: 294, column: 2, scope: !1094)
!1172 = !DILocation(line: 296, column: 2, scope: !1173)
!1173 = distinct !DILexicalBlock(scope: !1039, file: !1, line: 296, column: 2)
!1174 = !DILocation(line: 296, column: 2, scope: !1175)
!1175 = distinct !DILexicalBlock(scope: !1173, file: !1, line: 296, column: 2)
!1176 = !DILocation(line: 297, column: 3, scope: !1177)
!1177 = distinct !DILexicalBlock(scope: !1178, file: !1, line: 297, column: 3)
!1178 = distinct !DILexicalBlock(scope: !1175, file: !1, line: 296, column: 55)
!1179 = !DILocation(line: 297, column: 3, scope: !1180)
!1180 = distinct !DILexicalBlock(scope: !1177, file: !1, line: 297, column: 3)
!1181 = !DILocation(line: 298, column: 8, scope: !1182)
!1182 = distinct !DILexicalBlock(scope: !1183, file: !1, line: 298, column: 8)
!1183 = distinct !DILexicalBlock(scope: !1180, file: !1, line: 297, column: 48)
!1184 = !DILocation(line: 298, column: 13, scope: !1182)
!1185 = !DILocation(line: 298, column: 10, scope: !1182)
!1186 = !DILocation(line: 298, column: 8, scope: !1183)
!1187 = !DILocation(line: 299, column: 5, scope: !1188)
!1188 = distinct !DILexicalBlock(scope: !1182, file: !1, line: 298, column: 21)
!1189 = !DILocation(line: 302, column: 32, scope: !1183)
!1190 = !DILocation(line: 302, column: 36, scope: !1183)
!1191 = !DILocation(line: 302, column: 44, scope: !1183)
!1192 = !DILocation(line: 302, column: 48, scope: !1183)
!1193 = !DILocation(line: 302, column: 55, scope: !1183)
!1194 = !DILocation(line: 302, column: 63, scope: !1183)
!1195 = !DILocation(line: 302, column: 68, scope: !1183)
!1196 = !DILocation(line: 302, column: 75, scope: !1183)
!1197 = !DILocation(line: 302, column: 78, scope: !1183)
!1198 = !DILocation(line: 302, column: 83, scope: !1183)
!1199 = !DILocation(line: 302, column: 4, scope: !1183)
!1200 = !DILocation(line: 303, column: 3, scope: !1183)
!1201 = distinct !{!1201, !1176, !1202}
!1202 = !DILocation(line: 303, column: 3, scope: !1177)
!1203 = !DILocation(line: 304, column: 2, scope: !1178)
!1204 = distinct !{!1204, !1172, !1205}
!1205 = !DILocation(line: 304, column: 2, scope: !1173)
!1206 = !DILocation(line: 305, column: 1, scope: !1039)
!1207 = distinct !DISubprogram(name: "bmo_average_vert_facedata_exec", scope: !1, file: !1, line: 307, type: !203, scopeLine: 308, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !347)
!1208 = !DILocalVariable(name: "bm", arg: 1, scope: !1207, file: !1, line: 307, type: !205)
!1209 = !DILocation(line: 307, column: 44, scope: !1207)
!1210 = !DILocalVariable(name: "op", arg: 2, scope: !1207, file: !1, line: 307, type: !345)
!1211 = !DILocation(line: 307, column: 60, scope: !1207)
!1212 = !DILocalVariable(name: "siter", scope: !1207, file: !1, line: 309, type: !1045)
!1213 = !DILocation(line: 309, column: 10, scope: !1207)
!1214 = !DILocalVariable(name: "iter", scope: !1207, file: !1, line: 310, type: !353)
!1215 = !DILocation(line: 310, column: 9, scope: !1207)
!1216 = !DILocalVariable(name: "v", scope: !1207, file: !1, line: 311, type: !129)
!1217 = !DILocation(line: 311, column: 10, scope: !1207)
!1218 = !DILocalVariable(name: "l", scope: !1207, file: !1, line: 312, type: !178)
!1219 = !DILocation(line: 312, column: 10, scope: !1207)
!1220 = !DILocalVariable(name: "min", scope: !1207, file: !1, line: 313, type: !1221)
!1221 = !DIDerivedType(tag: DW_TAG_typedef, name: "CDBlockBytes", file: !1222, line: 51, baseType: !1223)
!1222 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_customdata.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1223 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1222, line: 51, size: 512, elements: !1224)
!1224 = !{!1225}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1223, file: !1222, line: 51, baseType: !1226, size: 512)
!1226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !498, size: 512, elements: !308)
!1227 = !DILocation(line: 313, column: 15, scope: !1207)
!1228 = !DILocalVariable(name: "max", scope: !1207, file: !1, line: 313, type: !1221)
!1229 = !DILocation(line: 313, column: 20, scope: !1207)
!1230 = !DILocalVariable(name: "block", scope: !1207, file: !1, line: 314, type: !113)
!1231 = !DILocation(line: 314, column: 8, scope: !1207)
!1232 = !DILocalVariable(name: "i", scope: !1207, file: !1, line: 315, type: !139)
!1233 = !DILocation(line: 315, column: 6, scope: !1207)
!1234 = !DILocalVariable(name: "type", scope: !1207, file: !1, line: 315, type: !139)
!1235 = !DILocation(line: 315, column: 9, scope: !1207)
!1236 = !DILocation(line: 317, column: 9, scope: !1237)
!1237 = distinct !DILexicalBlock(scope: !1207, file: !1, line: 317, column: 2)
!1238 = !DILocation(line: 317, column: 7, scope: !1237)
!1239 = !DILocation(line: 317, column: 14, scope: !1240)
!1240 = distinct !DILexicalBlock(scope: !1237, file: !1, line: 317, column: 2)
!1241 = !DILocation(line: 317, column: 18, scope: !1240)
!1242 = !DILocation(line: 317, column: 22, scope: !1240)
!1243 = !DILocation(line: 317, column: 28, scope: !1240)
!1244 = !DILocation(line: 317, column: 16, scope: !1240)
!1245 = !DILocation(line: 317, column: 2, scope: !1237)
!1246 = !DILocation(line: 318, column: 35, scope: !1247)
!1247 = distinct !DILexicalBlock(scope: !1248, file: !1, line: 318, column: 7)
!1248 = distinct !DILexicalBlock(scope: !1240, file: !1, line: 317, column: 43)
!1249 = !DILocation(line: 318, column: 39, scope: !1247)
!1250 = !DILocation(line: 318, column: 46, scope: !1247)
!1251 = !DILocation(line: 318, column: 8, scope: !1247)
!1252 = !DILocation(line: 318, column: 7, scope: !1248)
!1253 = !DILocation(line: 319, column: 4, scope: !1247)
!1254 = !DILocation(line: 321, column: 10, scope: !1248)
!1255 = !DILocation(line: 321, column: 14, scope: !1248)
!1256 = !DILocation(line: 321, column: 20, scope: !1248)
!1257 = !DILocation(line: 321, column: 27, scope: !1248)
!1258 = !DILocation(line: 321, column: 30, scope: !1248)
!1259 = !DILocation(line: 321, column: 8, scope: !1248)
!1260 = !DILocation(line: 322, column: 30, scope: !1248)
!1261 = !DILocation(line: 322, column: 36, scope: !1248)
!1262 = !DILocation(line: 322, column: 42, scope: !1248)
!1263 = !DILocation(line: 322, column: 3, scope: !1248)
!1264 = !DILocation(line: 324, column: 3, scope: !1265)
!1265 = distinct !DILexicalBlock(scope: !1248, file: !1, line: 324, column: 3)
!1266 = !DILocation(line: 324, column: 3, scope: !1267)
!1267 = distinct !DILexicalBlock(scope: !1265, file: !1, line: 324, column: 3)
!1268 = !DILocation(line: 325, column: 4, scope: !1269)
!1269 = distinct !DILexicalBlock(scope: !1270, file: !1, line: 325, column: 4)
!1270 = distinct !DILexicalBlock(scope: !1267, file: !1, line: 324, column: 56)
!1271 = !DILocation(line: 325, column: 4, scope: !1272)
!1272 = distinct !DILexicalBlock(scope: !1269, file: !1, line: 325, column: 4)
!1273 = !DILocation(line: 326, column: 43, scope: !1274)
!1274 = distinct !DILexicalBlock(scope: !1272, file: !1, line: 325, column: 49)
!1275 = !DILocation(line: 326, column: 47, scope: !1274)
!1276 = !DILocation(line: 326, column: 54, scope: !1274)
!1277 = !DILocation(line: 326, column: 57, scope: !1274)
!1278 = !DILocation(line: 326, column: 62, scope: !1274)
!1279 = !DILocation(line: 326, column: 68, scope: !1274)
!1280 = !DILocation(line: 326, column: 13, scope: !1274)
!1281 = !DILocation(line: 326, column: 11, scope: !1274)
!1282 = !DILocation(line: 327, column: 30, scope: !1274)
!1283 = !DILocation(line: 327, column: 36, scope: !1274)
!1284 = !DILocation(line: 327, column: 43, scope: !1274)
!1285 = !DILocation(line: 327, column: 49, scope: !1274)
!1286 = !DILocation(line: 327, column: 5, scope: !1274)
!1287 = !DILocation(line: 328, column: 4, scope: !1274)
!1288 = distinct !{!1288, !1268, !1289}
!1289 = !DILocation(line: 328, column: 4, scope: !1269)
!1290 = !DILocation(line: 329, column: 3, scope: !1270)
!1291 = distinct !{!1291, !1264, !1292}
!1292 = !DILocation(line: 329, column: 3, scope: !1265)
!1293 = !DILocation(line: 331, column: 28, scope: !1248)
!1294 = !DILocation(line: 331, column: 34, scope: !1248)
!1295 = !DILocation(line: 331, column: 3, scope: !1248)
!1296 = !DILocation(line: 332, column: 28, scope: !1248)
!1297 = !DILocation(line: 332, column: 34, scope: !1248)
!1298 = !DILocation(line: 332, column: 3, scope: !1248)
!1299 = !DILocation(line: 333, column: 23, scope: !1248)
!1300 = !DILocation(line: 333, column: 29, scope: !1248)
!1301 = !DILocation(line: 333, column: 35, scope: !1248)
!1302 = !DILocation(line: 333, column: 3, scope: !1248)
!1303 = !DILocation(line: 335, column: 3, scope: !1304)
!1304 = distinct !DILexicalBlock(scope: !1248, file: !1, line: 335, column: 3)
!1305 = !DILocation(line: 335, column: 3, scope: !1306)
!1306 = distinct !DILexicalBlock(scope: !1304, file: !1, line: 335, column: 3)
!1307 = !DILocation(line: 336, column: 4, scope: !1308)
!1308 = distinct !DILexicalBlock(scope: !1309, file: !1, line: 336, column: 4)
!1309 = distinct !DILexicalBlock(scope: !1306, file: !1, line: 335, column: 56)
!1310 = !DILocation(line: 336, column: 4, scope: !1311)
!1311 = distinct !DILexicalBlock(scope: !1308, file: !1, line: 336, column: 4)
!1312 = !DILocation(line: 337, column: 43, scope: !1313)
!1313 = distinct !DILexicalBlock(scope: !1311, file: !1, line: 336, column: 49)
!1314 = !DILocation(line: 337, column: 47, scope: !1313)
!1315 = !DILocation(line: 337, column: 54, scope: !1313)
!1316 = !DILocation(line: 337, column: 57, scope: !1313)
!1317 = !DILocation(line: 337, column: 62, scope: !1313)
!1318 = !DILocation(line: 337, column: 68, scope: !1313)
!1319 = !DILocation(line: 337, column: 13, scope: !1313)
!1320 = !DILocation(line: 337, column: 11, scope: !1313)
!1321 = !DILocation(line: 338, column: 32, scope: !1313)
!1322 = !DILocation(line: 338, column: 38, scope: !1313)
!1323 = !DILocation(line: 338, column: 44, scope: !1313)
!1324 = !DILocation(line: 338, column: 5, scope: !1313)
!1325 = !DILocation(line: 339, column: 4, scope: !1313)
!1326 = distinct !{!1326, !1307, !1327}
!1327 = !DILocation(line: 339, column: 4, scope: !1308)
!1328 = !DILocation(line: 340, column: 3, scope: !1309)
!1329 = distinct !{!1329, !1303, !1330}
!1330 = !DILocation(line: 340, column: 3, scope: !1304)
!1331 = !DILocation(line: 341, column: 2, scope: !1248)
!1332 = !DILocation(line: 317, column: 39, scope: !1240)
!1333 = !DILocation(line: 317, column: 2, scope: !1240)
!1334 = distinct !{!1334, !1245, !1335}
!1335 = !DILocation(line: 341, column: 2, scope: !1237)
!1336 = !DILocation(line: 342, column: 1, scope: !1207)
!1337 = distinct !DISubprogram(name: "bmo_pointmerge_exec", scope: !1, file: !1, line: 344, type: !203, scopeLine: 345, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !347)
!1338 = !DILocalVariable(name: "bm", arg: 1, scope: !1337, file: !1, line: 344, type: !205)
!1339 = !DILocation(line: 344, column: 33, scope: !1337)
!1340 = !DILocalVariable(name: "op", arg: 2, scope: !1337, file: !1, line: 344, type: !345)
!1341 = !DILocation(line: 344, column: 49, scope: !1337)
!1342 = !DILocalVariable(name: "weldop", scope: !1337, file: !1, line: 346, type: !346)
!1343 = !DILocation(line: 346, column: 13, scope: !1337)
!1344 = !DILocalVariable(name: "siter", scope: !1337, file: !1, line: 347, type: !1045)
!1345 = !DILocation(line: 347, column: 10, scope: !1337)
!1346 = !DILocalVariable(name: "v", scope: !1337, file: !1, line: 348, type: !129)
!1347 = !DILocation(line: 348, column: 10, scope: !1337)
!1348 = !DILocalVariable(name: "vert_snap", scope: !1337, file: !1, line: 348, type: !129)
!1349 = !DILocation(line: 348, column: 14, scope: !1337)
!1350 = !DILocalVariable(name: "vec", scope: !1337, file: !1, line: 349, type: !150)
!1351 = !DILocation(line: 349, column: 8, scope: !1337)
!1352 = !DILocalVariable(name: "slot_targetmap", scope: !1337, file: !1, line: 350, type: !454)
!1353 = !DILocation(line: 350, column: 12, scope: !1337)
!1354 = !DILocation(line: 352, column: 19, scope: !1337)
!1355 = !DILocation(line: 352, column: 23, scope: !1337)
!1356 = !DILocation(line: 352, column: 45, scope: !1337)
!1357 = !DILocation(line: 352, column: 2, scope: !1337)
!1358 = !DILocation(line: 355, column: 14, scope: !1337)
!1359 = !DILocation(line: 355, column: 27, scope: !1337)
