; ModuleID = 'blender/source/blender/blenkernel/intern/blender.c'
source_filename = "blender/source/blender/blenkernel/intern/blender.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }

!16 = !DIEnumerator(name: "USER_WHEELZOOMDIR", value: 4)
!17 = !DIEnumerator(name: "USER_FILTERFILEEXTS", value: 8)
!18 = !DIEnumerator(name: "USER_DRAWVIEWINFO", value: 16)
!19 = !DIEnumerator(name: "USER_PLAINMENUS", value: 32)
!20 = !DIEnumerator(name: "USER_ALLWINCODECS", value: 256)
!21 = !DIEnumerator(name: "USER_MENUOPENAUTO", value: 512)
!22 = !DIEnumerator(name: "USER_ZBUF_CURSOR", value: 1024)
!23 = !DIEnumerator(name: "USER_AUTOPERSP", value: 2048)
!24 = !DIEnumerator(name: "USER_LOCKAROUND", value: 4096)
!25 = !DIEnumerator(name: "USER_GLOBALUNDO", value: 8192)
!26 = !DIEnumerator(name: "USER_ORBIT_SELECTION", value: 16384)
!27 = !DIEnumerator(name: "USER_ZBUF_ORBIT", value: 32768)
!28 = !DIEnumerator(name: "USER_HIDE_DOT", value: 65536)
!29 = !DIEnumerator(name: "USER_SHOW_ROTVIEWICON", value: 131072)
!30 = !DIEnumerator(name: "USER_SHOW_VIEWPORTNAME", value: 262144)
!31 = !DIEnumerator(name: "USER_CAM_LOCK_NO_PARENT", value: 524288)
!32 = !DIEnumerator(name: "USER_ZOOM_TO_MOUSEPOS", value: 1048576)
!33 = !DIEnumerator(name: "USER_SHOW_FPS", value: 2097152)
!34 = !DIEnumerator(name: "USER_MMB_PASTE", value: 4194304)
!35 = !DIEnumerator(name: "USER_MENUFIXEDORDER", value: 8388608)
!36 = !DIEnumerator(name: "USER_CONTINUOUS_MOUSE", value: 16777216)
!37 = !DIEnumerator(name: "USER_ZOOM_INVERT", value: 33554432)
!38 = !DIEnumerator(name: "USER_ZOOM_HORIZ", value: 67108864)
!39 = !DIEnumerator(name: "USER_SPLASH_DISABLE", value: 134217728)
!40 = !DIEnumerator(name: "USER_HIDE_RECENT", value: 268435456)
!41 = !DIEnumerator(name: "USER_SHOW_THUMBNAILS", value: 536870912)
!42 = !DIEnumerator(name: "USER_QUIT_PROMPT", value: 1073741824)
!43 = !DIEnumerator(name: "USER_HIDE_SYSTEM_BOOKMARKS", value: -2147483648)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !45, line: 123, baseType: !7, size: 32, elements: !46)
!45 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_global.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!46 = !{!47, !48, !49, !50, !51, !52, !53, !54, !55}
!47 = !DIEnumerator(name: "G_DEBUG", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "G_DEBUG_FFMPEG", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "G_DEBUG_PYTHON", value: 4, isUnsigned: true)
!50 = !DIEnumerator(name: "G_DEBUG_EVENTS", value: 8, isUnsigned: true)
!51 = !DIEnumerator(name: "G_DEBUG_HANDLERS", value: 16, isUnsigned: true)
!52 = !DIEnumerator(name: "G_DEBUG_WM", value: 32, isUnsigned: true)
!53 = !DIEnumerator(name: "G_DEBUG_JOBS", value: 64, isUnsigned: true)
!54 = !DIEnumerator(name: "G_DEBUG_FREESTYLE", value: 128, isUnsigned: true)
!55 = !DIEnumerator(name: "G_DEBUG_DEPSGRAPH", value: 256, isUnsigned: true)
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ReportType", file: !57, line: 67, baseType: !7, size: 32, elements: !58)
!57 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!58 = !{!59, !60, !61, !62, !63, !64, !65, !66, !67}
!59 = !DIEnumerator(name: "RPT_DEBUG", value: 1, isUnsigned: true)
!60 = !DIEnumerator(name: "RPT_INFO", value: 2, isUnsigned: true)
!61 = !DIEnumerator(name: "RPT_OPERATOR", value: 4, isUnsigned: true)
!62 = !DIEnumerator(name: "RPT_PROPERTY", value: 8, isUnsigned: true)
!63 = !DIEnumerator(name: "RPT_WARNING", value: 16, isUnsigned: true)
!64 = !DIEnumerator(name: "RPT_ERROR", value: 32, isUnsigned: true)
!65 = !DIEnumerator(name: "RPT_ERROR_INVALID_INPUT", value: 64, isUnsigned: true)
!66 = !DIEnumerator(name: "RPT_ERROR_INVALID_CONTEXT", value: 128, isUnsigned: true)
!67 = !DIEnumerator(name: "RPT_ERROR_OUT_OF_MEMORY", value: 256, isUnsigned: true)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !69, file: !3, line: 202, baseType: !7, size: 32, elements: !2480)
!69 = distinct !DISubprogram(name: "setup_app_data", scope: !3, file: !3, line: 197, type: !70, scopeLine: 198, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !2479)
!70 = !DISubroutineType(types: !71)
!71 = !{null, !72, !76, !693}
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "bContext", file: !74, line: 69, baseType: !75)
!74 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !57, line: 51, flags: DIFlagFwdDecl)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlendFileData", file: !6, line: 74, baseType: !78)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BlendFileData", file: !6, line: 60, size: 8640, elements: !79)
!79 = !{!80, !221, !397, !398, !399, !400, !401, !402, !2476, !2477}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !78, file: !6, line: 61, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Main", file: !83, line: 53, size: 15232, elements: !84)
!83 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_main.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!84 = !{!85, !86, !87, !92, !94, !95, !96, !97, !103, !107, !108, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !212, !218}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !82, file: !83, line: 54, baseType: !81, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !82, file: !83, line: 54, baseType: !81, size: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !82, file: !83, line: 55, baseType: !88, size: 8192, offset: 128)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 8192, elements: !90)
!89 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!90 = !{!91}
!91 = !DISubrange(count: 1024)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "versionfile", scope: !82, file: !83, line: 56, baseType: !93, size: 16, offset: 8320)
!93 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "subversionfile", scope: !82, file: !83, line: 56, baseType: !93, size: 16, offset: 8336)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "minversionfile", scope: !82, file: !83, line: 57, baseType: !93, size: 16, offset: 8352)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "minsubversionfile", scope: !82, file: !83, line: 57, baseType: !93, size: 16, offset: 8368)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "build_commit_timestamp", scope: !82, file: !83, line: 58, baseType: !98, size: 64, offset: 8384)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !99, line: 27, baseType: !100)
!99 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !101, line: 45, baseType: !102)
!101 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!102 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "build_hash", scope: !82, file: !83, line: 59, baseType: !104, size: 128, offset: 8448)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 128, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 16)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", scope: !82, file: !83, line: 60, baseType: !93, size: 16, offset: 8576)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "curlib", scope: !82, file: !83, line: 62, baseType: !109, size: 64, offset: 8640)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !111, line: 136, size: 17600, elements: !112)
!111 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!112 = !{!113, !163, !165, !168, !169, !170, !171}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !110, file: !111, line: 137, baseType: !114, size: 960)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !111, line: 130, baseType: !115)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !111, line: 117, size: 960, elements: !116)
!116 = !{!117, !119, !120, !122, !123, !127, !128, !129, !130, !131}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !115, file: !111, line: 118, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !115, file: !111, line: 118, baseType: !118, size: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !115, file: !111, line: 119, baseType: !121, size: 64, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !115, file: !111, line: 120, baseType: !109, size: 64, offset: 192)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !115, file: !111, line: 121, baseType: !124, size: 528, offset: 256)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 528, elements: !125)
!125 = !{!126}
!126 = !DISubrange(count: 66)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !115, file: !111, line: 126, baseType: !93, size: 16, offset: 784)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !115, file: !111, line: 127, baseType: !14, size: 32, offset: 800)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !115, file: !111, line: 128, baseType: !14, size: 32, offset: 832)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !115, file: !111, line: 128, baseType: !14, size: 32, offset: 864)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !115, file: !111, line: 129, baseType: !132, size: 64, offset: 896)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !111, line: 75, baseType: !134)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !111, line: 62, size: 1024, elements: !135)
!135 = !{!136, !138, !139, !140, !141, !142, !146, !147, !161, !162}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !134, file: !111, line: 63, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !134, file: !111, line: 63, baseType: !137, size: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !134, file: !111, line: 64, baseType: !89, size: 8, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !134, file: !111, line: 64, baseType: !89, size: 8, offset: 136)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !134, file: !111, line: 65, baseType: !93, size: 16, offset: 144)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !134, file: !111, line: 66, baseType: !143, size: 512, offset: 160)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 512, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !134, file: !111, line: 67, baseType: !14, size: 32, offset: 672)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !134, file: !111, line: 69, baseType: !148, size: 256, offset: 704)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !111, line: 60, baseType: !149)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !111, line: 48, size: 256, elements: !150)
!150 = !{!151, !152, !159, !160}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !149, file: !111, line: 49, baseType: !118, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !149, file: !111, line: 58, baseType: !153, size: 128, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !154, line: 71, baseType: !155)
!154 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !154, line: 69, size: 128, elements: !156)
!156 = !{!157, !158}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !155, file: !154, line: 70, baseType: !118, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !155, file: !154, line: 70, baseType: !118, size: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !149, file: !111, line: 59, baseType: !14, size: 32, offset: 192)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !149, file: !111, line: 59, baseType: !14, size: 32, offset: 224)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !134, file: !111, line: 70, baseType: !14, size: 32, offset: 960)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !134, file: !111, line: 74, baseType: !14, size: 32, offset: 992)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !110, file: !111, line: 138, baseType: !164, size: 64, offset: 960)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !110, file: !111, line: 139, baseType: !166, size: 64, offset: 1024)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !111, line: 43, flags: DIFlagFwdDecl)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !110, file: !111, line: 140, baseType: !88, size: 8192, offset: 1088)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !110, file: !111, line: 141, baseType: !88, size: 8192, offset: 9280)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !110, file: !111, line: 148, baseType: !109, size: 64, offset: 17472)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !110, file: !111, line: 150, baseType: !172, size: 64, offset: 17536)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !111, line: 45, flags: DIFlagFwdDecl)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !82, file: !83, line: 63, baseType: !153, size: 128, offset: 8704)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "library", scope: !82, file: !83, line: 64, baseType: !153, size: 128, offset: 8832)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !82, file: !83, line: 65, baseType: !153, size: 128, offset: 8960)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "mesh", scope: !82, file: !83, line: 66, baseType: !153, size: 128, offset: 9088)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !82, file: !83, line: 67, baseType: !153, size: 128, offset: 9216)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "mball", scope: !82, file: !83, line: 68, baseType: !153, size: 128, offset: 9344)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !82, file: !83, line: 69, baseType: !153, size: 128, offset: 9472)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !82, file: !83, line: 70, baseType: !153, size: 128, offset: 9600)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !82, file: !83, line: 71, baseType: !153, size: 128, offset: 9728)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "latt", scope: !82, file: !83, line: 72, baseType: !153, size: 128, offset: 9856)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "lamp", scope: !82, file: !83, line: 73, baseType: !153, size: 128, offset: 9984)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !82, file: !83, line: 74, baseType: !153, size: 128, offset: 10112)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !82, file: !83, line: 75, baseType: !153, size: 128, offset: 10240)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !82, file: !83, line: 76, baseType: !153, size: 128, offset: 10368)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !82, file: !83, line: 77, baseType: !153, size: 128, offset: 10496)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !82, file: !83, line: 78, baseType: !153, size: 128, offset: 10624)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !82, file: !83, line: 79, baseType: !153, size: 128, offset: 10752)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "vfont", scope: !82, file: !83, line: 80, baseType: !153, size: 128, offset: 10880)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !82, file: !83, line: 81, baseType: !153, size: 128, offset: 11008)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "speaker", scope: !82, file: !83, line: 82, baseType: !153, size: 128, offset: 11136)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !82, file: !83, line: 83, baseType: !153, size: 128, offset: 11264)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !82, file: !83, line: 84, baseType: !153, size: 128, offset: 11392)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "armature", scope: !82, file: !83, line: 85, baseType: !153, size: 128, offset: 11520)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !82, file: !83, line: 86, baseType: !153, size: 128, offset: 11648)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !82, file: !83, line: 87, baseType: !153, size: 128, offset: 11776)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !82, file: !83, line: 88, baseType: !153, size: 128, offset: 11904)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !82, file: !83, line: 89, baseType: !153, size: 128, offset: 12032)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "palettes", scope: !82, file: !83, line: 90, baseType: !153, size: 128, offset: 12160)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "paintcurves", scope: !82, file: !83, line: 91, baseType: !153, size: 128, offset: 12288)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "wm", scope: !82, file: !83, line: 92, baseType: !153, size: 128, offset: 12416)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil", scope: !82, file: !83, line: 93, baseType: !153, size: 128, offset: 12544)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "movieclip", scope: !82, file: !83, line: 94, baseType: !153, size: 128, offset: 12672)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !82, file: !83, line: 95, baseType: !153, size: 128, offset: 12800)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "linestyle", scope: !82, file: !83, line: 96, baseType: !153, size: 128, offset: 12928)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "id_tag_update", scope: !82, file: !83, line: 98, baseType: !209, size: 2048, offset: 13056)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 2048, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 256)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "eval_ctx", scope: !82, file: !83, line: 101, baseType: !213, size: 64, offset: 15104)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EvaluationContext", file: !215, line: 58, size: 32, elements: !216)
!215 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_depsgraph.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!216 = !{!217}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !214, file: !215, line: 59, baseType: !14, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !82, file: !83, line: 103, baseType: !219, size: 64, offset: 15168)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "MainLock", file: !83, line: 51, flags: DIFlagFwdDecl)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !78, file: !6, line: 62, baseType: !222, size: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UserDef", file: !13, line: 421, size: 87680, elements: !224)
!224 = !{!225, !226, !227, !228, !229, !230, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !363, !365, !366, !367, !368, !369, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "versionfile", scope: !223, file: !13, line: 423, baseType: !14, size: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "subversionfile", scope: !223, file: !13, line: 423, baseType: !14, size: 32, offset: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !223, file: !13, line: 425, baseType: !14, size: 32, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "dupflag", scope: !223, file: !13, line: 425, baseType: !14, size: 32, offset: 96)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "savetime", scope: !223, file: !13, line: 426, baseType: !14, size: 32, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tempdir", scope: !223, file: !13, line: 427, baseType: !231, size: 6144, offset: 160)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 6144, elements: !232)
!232 = !{!233}
!233 = !DISubrange(count: 768)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "fontdir", scope: !223, file: !13, line: 428, baseType: !231, size: 6144, offset: 6304)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "renderdir", scope: !223, file: !13, line: 429, baseType: !88, size: 8192, offset: 12448)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "render_cachedir", scope: !223, file: !13, line: 431, baseType: !231, size: 6144, offset: 20640)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "textudir", scope: !223, file: !13, line: 432, baseType: !231, size: 6144, offset: 26784)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "pythondir", scope: !223, file: !13, line: 433, baseType: !231, size: 6144, offset: 32928)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "sounddir", scope: !223, file: !13, line: 434, baseType: !231, size: 6144, offset: 39072)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "i18ndir", scope: !223, file: !13, line: 435, baseType: !231, size: 6144, offset: 45216)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "image_editor", scope: !223, file: !13, line: 436, baseType: !88, size: 8192, offset: 51360)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "anim_player", scope: !223, file: !13, line: 437, baseType: !88, size: 8192, offset: 59552)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "anim_player_preset", scope: !223, file: !13, line: 438, baseType: !14, size: 32, offset: 67744)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "v2d_min_gridsize", scope: !223, file: !13, line: 440, baseType: !93, size: 16, offset: 67776)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_style", scope: !223, file: !13, line: 441, baseType: !93, size: 16, offset: 67792)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "versions", scope: !223, file: !13, line: 443, baseType: !93, size: 16, offset: 67808)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "dbl_click_time", scope: !223, file: !13, line: 444, baseType: !93, size: 16, offset: 67824)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "gameflags", scope: !223, file: !13, line: 446, baseType: !93, size: 16, offset: 67840)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "wheellinescroll", scope: !223, file: !13, line: 447, baseType: !93, size: 16, offset: 67856)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "uiflag", scope: !223, file: !13, line: 448, baseType: !14, size: 32, offset: 67872)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "uiflag2", scope: !223, file: !13, line: 448, baseType: !14, size: 32, offset: 67904)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !223, file: !13, line: 449, baseType: !14, size: 32, offset: 67936)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "userpref", scope: !223, file: !13, line: 450, baseType: !93, size: 16, offset: 67968)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "viewzoom", scope: !223, file: !13, line: 450, baseType: !93, size: 16, offset: 67984)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "mixbufsize", scope: !223, file: !13, line: 452, baseType: !14, size: 32, offset: 68000)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "audiodevice", scope: !223, file: !13, line: 453, baseType: !14, size: 32, offset: 68032)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "audiorate", scope: !223, file: !13, line: 454, baseType: !14, size: 32, offset: 68064)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "audioformat", scope: !223, file: !13, line: 455, baseType: !14, size: 32, offset: 68096)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "audiochannels", scope: !223, file: !13, line: 456, baseType: !14, size: 32, offset: 68128)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "scrollback", scope: !223, file: !13, line: 458, baseType: !14, size: 32, offset: 68160)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "dpi", scope: !223, file: !13, line: 459, baseType: !14, size: 32, offset: 68192)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !223, file: !13, line: 460, baseType: !93, size: 16, offset: 68224)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "transopts", scope: !223, file: !13, line: 461, baseType: !93, size: 16, offset: 68240)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "menuthreshold1", scope: !223, file: !13, line: 462, baseType: !93, size: 16, offset: 68256)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "menuthreshold2", scope: !223, file: !13, line: 462, baseType: !93, size: 16, offset: 68272)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "themes", scope: !223, file: !13, line: 464, baseType: !155, size: 128, offset: 68288)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "uifonts", scope: !223, file: !13, line: 465, baseType: !155, size: 128, offset: 68416)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "uistyles", scope: !223, file: !13, line: 466, baseType: !155, size: 128, offset: 68544)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "keymaps", scope: !223, file: !13, line: 467, baseType: !155, size: 128, offset: 68672)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "user_keymaps", scope: !223, file: !13, line: 468, baseType: !155, size: 128, offset: 68800)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "addons", scope: !223, file: !13, line: 469, baseType: !155, size: 128, offset: 68928)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "autoexec_paths", scope: !223, file: !13, line: 470, baseType: !155, size: 128, offset: 69056)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "keyconfigstr", scope: !223, file: !13, line: 471, baseType: !143, size: 512, offset: 69184)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "undosteps", scope: !223, file: !13, line: 473, baseType: !93, size: 16, offset: 69696)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "undomemory", scope: !223, file: !13, line: 474, baseType: !93, size: 16, offset: 69712)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "gp_manhattendist", scope: !223, file: !13, line: 475, baseType: !93, size: 16, offset: 69728)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "gp_euclideandist", scope: !223, file: !13, line: 475, baseType: !93, size: 16, offset: 69744)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "gp_eraser", scope: !223, file: !13, line: 475, baseType: !93, size: 16, offset: 69760)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "gp_settings", scope: !223, file: !13, line: 476, baseType: !93, size: 16, offset: 69776)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tb_leftmouse", scope: !223, file: !13, line: 477, baseType: !93, size: 16, offset: 69792)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tb_rightmouse", scope: !223, file: !13, line: 477, baseType: !93, size: 16, offset: 69808)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "light", scope: !223, file: !13, line: 478, baseType: !283, size: 1344, offset: 69824)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !284, size: 1344, elements: !295)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SolidLight", file: !13, line: 405, size: 448, elements: !285)
!285 = !{!286, !287, !288, !293, !294}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !284, file: !13, line: 406, baseType: !14, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !284, file: !13, line: 406, baseType: !14, size: 32, offset: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !284, file: !13, line: 407, baseType: !289, size: 128, offset: 64)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !290, size: 128, elements: !291)
!290 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!291 = !{!292}
!292 = !DISubrange(count: 4)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !284, file: !13, line: 407, baseType: !289, size: 128, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !284, file: !13, line: 407, baseType: !289, size: 128, offset: 320)
!295 = !{!296}
!296 = !DISubrange(count: 3)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "tw_hotspot", scope: !223, file: !13, line: 479, baseType: !93, size: 16, offset: 71168)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tw_flag", scope: !223, file: !13, line: 479, baseType: !93, size: 16, offset: 71184)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "tw_handlesize", scope: !223, file: !13, line: 479, baseType: !93, size: 16, offset: 71200)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "tw_size", scope: !223, file: !13, line: 479, baseType: !93, size: 16, offset: 71216)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "textimeout", scope: !223, file: !13, line: 480, baseType: !93, size: 16, offset: 71232)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "texcollectrate", scope: !223, file: !13, line: 480, baseType: !93, size: 16, offset: 71248)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "wmdrawmethod", scope: !223, file: !13, line: 481, baseType: !93, size: 16, offset: 71264)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "dragthreshold", scope: !223, file: !13, line: 482, baseType: !93, size: 16, offset: 71280)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "memcachelimit", scope: !223, file: !13, line: 483, baseType: !14, size: 32, offset: 71296)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "prefetchframes", scope: !223, file: !13, line: 484, baseType: !14, size: 32, offset: 71328)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "frameserverport", scope: !223, file: !13, line: 485, baseType: !93, size: 16, offset: 71360)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "pad_rot_angle", scope: !223, file: !13, line: 486, baseType: !93, size: 16, offset: 71376)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "obcenter_dia", scope: !223, file: !13, line: 487, baseType: !93, size: 16, offset: 71392)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "rvisize", scope: !223, file: !13, line: 488, baseType: !93, size: 16, offset: 71408)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "rvibright", scope: !223, file: !13, line: 489, baseType: !93, size: 16, offset: 71424)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "recent_files", scope: !223, file: !13, line: 490, baseType: !93, size: 16, offset: 71440)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_viewtx", scope: !223, file: !13, line: 491, baseType: !93, size: 16, offset: 71456)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "glreslimit", scope: !223, file: !13, line: 492, baseType: !93, size: 16, offset: 71472)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "curssize", scope: !223, file: !13, line: 493, baseType: !93, size: 16, offset: 71488)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "color_picker_type", scope: !223, file: !13, line: 494, baseType: !93, size: 16, offset: 71504)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "ipo_new", scope: !223, file: !13, line: 495, baseType: !89, size: 8, offset: 71520)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "keyhandles_new", scope: !223, file: !13, line: 496, baseType: !89, size: 8, offset: 71528)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "gpu_select_method", scope: !223, file: !13, line: 497, baseType: !89, size: 8, offset: 71536)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !223, file: !13, line: 498, baseType: !89, size: 8, offset: 71544)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "scrcastfps", scope: !223, file: !13, line: 500, baseType: !93, size: 16, offset: 71552)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "scrcastwait", scope: !223, file: !13, line: 501, baseType: !93, size: 16, offset: 71568)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "widget_unit", scope: !223, file: !13, line: 503, baseType: !93, size: 16, offset: 71584)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropic_filter", scope: !223, file: !13, line: 504, baseType: !93, size: 16, offset: 71600)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "use_16bit_textures", scope: !223, file: !13, line: 505, baseType: !93, size: 16, offset: 71616)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "use_gpu_mipmap", scope: !223, file: !13, line: 505, baseType: !93, size: 16, offset: 71632)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "ndof_sensitivity", scope: !223, file: !13, line: 507, baseType: !290, size: 32, offset: 71648)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "ndof_orbit_sensitivity", scope: !223, file: !13, line: 508, baseType: !290, size: 32, offset: 71680)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "ndof_flag", scope: !223, file: !13, line: 509, baseType: !14, size: 32, offset: 71712)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "ogl_multisamples", scope: !223, file: !13, line: 511, baseType: !93, size: 16, offset: 71744)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "image_draw_method", scope: !223, file: !13, line: 513, baseType: !93, size: 16, offset: 71760)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "glalphaclip", scope: !223, file: !13, line: 515, baseType: !290, size: 32, offset: 71776)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_mode", scope: !223, file: !13, line: 517, baseType: !93, size: 16, offset: 71808)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_flag", scope: !223, file: !13, line: 518, baseType: !93, size: 16, offset: 71824)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "text_render", scope: !223, file: !13, line: 520, baseType: !93, size: 16, offset: 71840)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "pad9", scope: !223, file: !13, line: 520, baseType: !93, size: 16, offset: 71856)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "coba_weight", scope: !223, file: !13, line: 522, baseType: !338, size: 6208, offset: 71872)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !339, line: 113, size: 6208, elements: !340)
!339 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!340 = !{!341, !342, !343, !344, !345, !346, !350}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !338, file: !339, line: 114, baseType: !93, size: 16)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !338, file: !339, line: 114, baseType: !93, size: 16, offset: 16)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !338, file: !339, line: 115, baseType: !89, size: 8, offset: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !338, file: !339, line: 115, baseType: !89, size: 8, offset: 40)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !338, file: !339, line: 116, baseType: !89, size: 8, offset: 48)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !338, file: !339, line: 117, baseType: !347, size: 8, offset: 56)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 8, elements: !348)
!348 = !{!349}
!349 = !DISubrange(count: 1)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !338, file: !339, line: 119, baseType: !351, size: 6144, offset: 64)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, size: 6144, elements: !361)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !339, line: 109, baseType: !353)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !339, line: 106, size: 192, elements: !354)
!354 = !{!355, !356, !357, !358, !359, !360}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !353, file: !339, line: 107, baseType: !290, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !353, file: !339, line: 107, baseType: !290, size: 32, offset: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !353, file: !339, line: 107, baseType: !290, size: 32, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !353, file: !339, line: 107, baseType: !290, size: 32, offset: 96)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !353, file: !339, line: 107, baseType: !290, size: 32, offset: 128)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !353, file: !339, line: 108, baseType: !14, size: 32, offset: 160)
!361 = !{!362}
!362 = !DISubrange(count: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_overlay_col", scope: !223, file: !13, line: 524, baseType: !364, size: 96, offset: 78080)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !290, size: 96, elements: !295)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_new_layer_col", scope: !223, file: !13, line: 525, baseType: !289, size: 128, offset: 78176)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "tweak_threshold", scope: !223, file: !13, line: 527, baseType: !93, size: 16, offset: 78304)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "navigation_mode", scope: !223, file: !13, line: 528, baseType: !89, size: 8, offset: 78320)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !223, file: !13, line: 528, baseType: !89, size: 8, offset: 78328)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "author", scope: !223, file: !13, line: 530, baseType: !370, size: 640, offset: 78336)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 640, elements: !371)
!371 = !{!372}
!372 = !DISubrange(count: 80)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "font_path_ui", scope: !223, file: !13, line: 532, baseType: !88, size: 8192, offset: 78976)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "compute_device_type", scope: !223, file: !13, line: 534, baseType: !14, size: 32, offset: 87168)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "compute_device_id", scope: !223, file: !13, line: 535, baseType: !14, size: 32, offset: 87200)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "fcu_inactive_alpha", scope: !223, file: !13, line: 537, baseType: !290, size: 32, offset: 87232)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "pixelsize", scope: !223, file: !13, line: 538, baseType: !290, size: 32, offset: 87264)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel", scope: !223, file: !13, line: 539, baseType: !14, size: 32, offset: 87296)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "pie_interaction_type", scope: !223, file: !13, line: 541, baseType: !93, size: 16, offset: 87328)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "pie_initial_timeout", scope: !223, file: !13, line: 543, baseType: !93, size: 16, offset: 87344)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "pie_animation_timeout", scope: !223, file: !13, line: 545, baseType: !93, size: 16, offset: 87360)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "pie_menu_confirm", scope: !223, file: !13, line: 546, baseType: !93, size: 16, offset: 87376)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "pie_menu_radius", scope: !223, file: !13, line: 547, baseType: !93, size: 16, offset: 87392)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "pie_menu_threshold", scope: !223, file: !13, line: 548, baseType: !93, size: 16, offset: 87408)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "walk_navigation", scope: !223, file: !13, line: 550, baseType: !386, size: 256, offset: 87424)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "WalkNavigation", file: !13, line: 410, size: 256, elements: !387)
!387 = !{!388, !389, !390, !391, !392, !393, !394, !395}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "mouse_speed", scope: !386, file: !13, line: 411, baseType: !290, size: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "walk_speed", scope: !386, file: !13, line: 412, baseType: !290, size: 32, offset: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "walk_speed_factor", scope: !386, file: !13, line: 413, baseType: !290, size: 32, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "view_height", scope: !386, file: !13, line: 414, baseType: !290, size: 32, offset: 96)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "jump_height", scope: !386, file: !13, line: 415, baseType: !290, size: 32, offset: 128)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "teleport_time", scope: !386, file: !13, line: 416, baseType: !290, size: 32, offset: 160)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !386, file: !13, line: 417, baseType: !93, size: 16, offset: 192)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !386, file: !13, line: 418, baseType: !396, size: 48, offset: 208)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 48, elements: !295)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "winpos", scope: !78, file: !6, line: 64, baseType: !14, size: 32, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "fileflags", scope: !78, file: !6, line: 65, baseType: !14, size: 32, offset: 160)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "displaymode", scope: !78, file: !6, line: 66, baseType: !14, size: 32, offset: 192)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "globalf", scope: !78, file: !6, line: 67, baseType: !14, size: 32, offset: 224)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !78, file: !6, line: 68, baseType: !88, size: 8192, offset: 256)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "curscreen", scope: !78, file: !6, line: 70, baseType: !403, size: 64, offset: 8448)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !405, line: 49, size: 1984, elements: !406)
!405 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!406 = !{!407, !408, !409, !410, !411, !412, !2459, !2460, !2461, !2462, !2463, !2464, !2465, !2466, !2467, !2468, !2469, !2470, !2471, !2472, !2473, !2474, !2475}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !404, file: !405, line: 50, baseType: !114, size: 960)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !404, file: !405, line: 52, baseType: !153, size: 128, offset: 960)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !404, file: !405, line: 53, baseType: !153, size: 128, offset: 1088)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !404, file: !405, line: 54, baseType: !153, size: 128, offset: 1216)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !404, file: !405, line: 55, baseType: !153, size: 128, offset: 1344)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !404, file: !405, line: 57, baseType: !413, size: 64, offset: 1472)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !415, line: 1216, size: 39680, elements: !416)
!415 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!416 = !{!417, !418, !421, !424, !1847, !1848, !1849, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1876, !2091, !2094, !2333, !2345, !2346, !2347, !2348, !2349, !2350, !2351, !2352, !2355, !2356, !2357, !2358, !2359, !2367, !2433, !2440, !2441, !2448, !2451, !2452, !2453, !2454, !2455, !2456}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !414, file: !415, line: 1217, baseType: !114, size: 960)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !414, file: !415, line: 1218, baseType: !419, size: 64, offset: 960)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !339, line: 45, flags: DIFlagFwdDecl)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !414, file: !415, line: 1220, baseType: !422, size: 64, offset: 1024)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !339, line: 49, flags: DIFlagFwdDecl)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !414, file: !415, line: 1221, baseType: !425, size: 64, offset: 1088)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !427, line: 52, size: 4224, elements: !428)
!427 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!428 = !{!429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !498, !499, !502, !1842, !1843, !1844, !1845, !1846}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !426, file: !427, line: 53, baseType: !114, size: 960)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !426, file: !427, line: 54, baseType: !419, size: 64, offset: 960)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !426, file: !427, line: 56, baseType: !93, size: 16, offset: 1024)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !426, file: !427, line: 56, baseType: !93, size: 16, offset: 1040)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !426, file: !427, line: 57, baseType: !93, size: 16, offset: 1056)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !426, file: !427, line: 57, baseType: !93, size: 16, offset: 1072)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !426, file: !427, line: 59, baseType: !290, size: 32, offset: 1088)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !426, file: !427, line: 59, baseType: !290, size: 32, offset: 1120)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !426, file: !427, line: 59, baseType: !290, size: 32, offset: 1152)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !426, file: !427, line: 60, baseType: !290, size: 32, offset: 1184)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !426, file: !427, line: 60, baseType: !290, size: 32, offset: 1216)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !426, file: !427, line: 60, baseType: !290, size: 32, offset: 1248)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !426, file: !427, line: 61, baseType: !290, size: 32, offset: 1280)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !426, file: !427, line: 61, baseType: !290, size: 32, offset: 1312)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !426, file: !427, line: 61, baseType: !290, size: 32, offset: 1344)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !426, file: !427, line: 68, baseType: !290, size: 32, offset: 1376)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !426, file: !427, line: 68, baseType: !290, size: 32, offset: 1408)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !426, file: !427, line: 68, baseType: !290, size: 32, offset: 1440)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !426, file: !427, line: 69, baseType: !290, size: 32, offset: 1472)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !426, file: !427, line: 69, baseType: !290, size: 32, offset: 1504)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !426, file: !427, line: 74, baseType: !290, size: 32, offset: 1536)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !426, file: !427, line: 79, baseType: !290, size: 32, offset: 1568)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !426, file: !427, line: 81, baseType: !93, size: 16, offset: 1600)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !426, file: !427, line: 91, baseType: !93, size: 16, offset: 1616)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !426, file: !427, line: 92, baseType: !93, size: 16, offset: 1632)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !426, file: !427, line: 93, baseType: !93, size: 16, offset: 1648)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !426, file: !427, line: 94, baseType: !93, size: 16, offset: 1664)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !426, file: !427, line: 94, baseType: !93, size: 16, offset: 1680)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !426, file: !427, line: 94, baseType: !93, size: 16, offset: 1696)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !426, file: !427, line: 94, baseType: !93, size: 16, offset: 1712)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !426, file: !427, line: 96, baseType: !290, size: 32, offset: 1728)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !426, file: !427, line: 96, baseType: !290, size: 32, offset: 1760)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !426, file: !427, line: 96, baseType: !290, size: 32, offset: 1792)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !426, file: !427, line: 96, baseType: !290, size: 32, offset: 1824)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !426, file: !427, line: 98, baseType: !290, size: 32, offset: 1856)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !426, file: !427, line: 98, baseType: !290, size: 32, offset: 1888)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !426, file: !427, line: 98, baseType: !290, size: 32, offset: 1920)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !426, file: !427, line: 98, baseType: !290, size: 32, offset: 1952)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !426, file: !427, line: 99, baseType: !290, size: 32, offset: 1984)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !426, file: !427, line: 99, baseType: !290, size: 32, offset: 2016)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !426, file: !427, line: 100, baseType: !290, size: 32, offset: 2048)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !426, file: !427, line: 100, baseType: !290, size: 32, offset: 2080)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !426, file: !427, line: 103, baseType: !93, size: 16, offset: 2112)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !426, file: !427, line: 103, baseType: !93, size: 16, offset: 2128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !426, file: !427, line: 103, baseType: !93, size: 16, offset: 2144)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !426, file: !427, line: 103, baseType: !93, size: 16, offset: 2160)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !426, file: !427, line: 106, baseType: !290, size: 32, offset: 2176)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !426, file: !427, line: 106, baseType: !290, size: 32, offset: 2208)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !426, file: !427, line: 106, baseType: !290, size: 32, offset: 2240)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !426, file: !427, line: 106, baseType: !290, size: 32, offset: 2272)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !426, file: !427, line: 107, baseType: !93, size: 16, offset: 2304)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !426, file: !427, line: 107, baseType: !93, size: 16, offset: 2320)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !426, file: !427, line: 107, baseType: !93, size: 16, offset: 2336)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !426, file: !427, line: 107, baseType: !93, size: 16, offset: 2352)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !426, file: !427, line: 108, baseType: !290, size: 32, offset: 2368)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !426, file: !427, line: 108, baseType: !290, size: 32, offset: 2400)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !426, file: !427, line: 109, baseType: !290, size: 32, offset: 2432)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !426, file: !427, line: 109, baseType: !290, size: 32, offset: 2464)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !426, file: !427, line: 110, baseType: !290, size: 32, offset: 2496)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !426, file: !427, line: 110, baseType: !290, size: 32, offset: 2528)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !426, file: !427, line: 110, baseType: !290, size: 32, offset: 2560)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !426, file: !427, line: 111, baseType: !93, size: 16, offset: 2592)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !426, file: !427, line: 111, baseType: !93, size: 16, offset: 2608)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !426, file: !427, line: 112, baseType: !93, size: 16, offset: 2624)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !426, file: !427, line: 112, baseType: !93, size: 16, offset: 2640)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !426, file: !427, line: 112, baseType: !93, size: 16, offset: 2656)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !426, file: !427, line: 115, baseType: !93, size: 16, offset: 2672)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !426, file: !427, line: 118, baseType: !497, size: 64, offset: 2688)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !426, file: !427, line: 118, baseType: !497, size: 64, offset: 2752)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !426, file: !427, line: 121, baseType: !500, size: 64, offset: 2816)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !339, line: 46, flags: DIFlagFwdDecl)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !426, file: !427, line: 122, baseType: !503, size: 1152, offset: 2880)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !504, size: 1152, elements: !1840)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !339, line: 57, size: 2496, elements: !506)
!506 = !{!507, !508, !509, !510, !511, !512, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !505, file: !339, line: 59, baseType: !93, size: 16)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !505, file: !339, line: 59, baseType: !93, size: 16, offset: 16)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !505, file: !339, line: 59, baseType: !93, size: 16, offset: 32)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !505, file: !339, line: 59, baseType: !93, size: 16, offset: 48)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !505, file: !339, line: 60, baseType: !422, size: 64, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !505, file: !339, line: 61, baseType: !513, size: 64, offset: 128)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !339, line: 202, size: 3328, elements: !515)
!515 = !{!516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !585, !1346, !1347, !1653, !1654, !1682, !1683, !1750, !1771, !1779, !1780}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !514, file: !339, line: 203, baseType: !114, size: 960)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !514, file: !339, line: 204, baseType: !419, size: 64, offset: 960)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !514, file: !339, line: 206, baseType: !290, size: 32, offset: 1024)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !514, file: !339, line: 206, baseType: !290, size: 32, offset: 1056)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !514, file: !339, line: 207, baseType: !290, size: 32, offset: 1088)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !514, file: !339, line: 207, baseType: !290, size: 32, offset: 1120)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !514, file: !339, line: 207, baseType: !290, size: 32, offset: 1152)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !514, file: !339, line: 207, baseType: !290, size: 32, offset: 1184)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !514, file: !339, line: 207, baseType: !290, size: 32, offset: 1216)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !514, file: !339, line: 207, baseType: !290, size: 32, offset: 1248)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !514, file: !339, line: 208, baseType: !290, size: 32, offset: 1280)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !514, file: !339, line: 208, baseType: !290, size: 32, offset: 1312)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !514, file: !339, line: 211, baseType: !290, size: 32, offset: 1344)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !514, file: !339, line: 211, baseType: !290, size: 32, offset: 1376)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !514, file: !339, line: 211, baseType: !290, size: 32, offset: 1408)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !514, file: !339, line: 211, baseType: !290, size: 32, offset: 1440)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !514, file: !339, line: 211, baseType: !290, size: 32, offset: 1472)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !514, file: !339, line: 214, baseType: !290, size: 32, offset: 1504)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !514, file: !339, line: 214, baseType: !290, size: 32, offset: 1536)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !514, file: !339, line: 217, baseType: !290, size: 32, offset: 1568)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !514, file: !339, line: 218, baseType: !290, size: 32, offset: 1600)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !514, file: !339, line: 219, baseType: !290, size: 32, offset: 1632)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !514, file: !339, line: 220, baseType: !290, size: 32, offset: 1664)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !514, file: !339, line: 221, baseType: !290, size: 32, offset: 1696)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !514, file: !339, line: 222, baseType: !93, size: 16, offset: 1728)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !514, file: !339, line: 222, baseType: !93, size: 16, offset: 1744)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !514, file: !339, line: 224, baseType: !93, size: 16, offset: 1760)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !514, file: !339, line: 224, baseType: !93, size: 16, offset: 1776)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !514, file: !339, line: 227, baseType: !93, size: 16, offset: 1792)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !514, file: !339, line: 227, baseType: !93, size: 16, offset: 1808)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !514, file: !339, line: 229, baseType: !93, size: 16, offset: 1824)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !514, file: !339, line: 229, baseType: !93, size: 16, offset: 1840)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !514, file: !339, line: 230, baseType: !93, size: 16, offset: 1856)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !514, file: !339, line: 230, baseType: !93, size: 16, offset: 1872)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !514, file: !339, line: 232, baseType: !290, size: 32, offset: 1888)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !514, file: !339, line: 232, baseType: !290, size: 32, offset: 1920)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !514, file: !339, line: 232, baseType: !290, size: 32, offset: 1952)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !514, file: !339, line: 232, baseType: !290, size: 32, offset: 1984)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !514, file: !339, line: 233, baseType: !14, size: 32, offset: 2016)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !514, file: !339, line: 234, baseType: !14, size: 32, offset: 2048)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !514, file: !339, line: 235, baseType: !93, size: 16, offset: 2080)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !514, file: !339, line: 235, baseType: !93, size: 16, offset: 2096)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !514, file: !339, line: 236, baseType: !93, size: 16, offset: 2112)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !514, file: !339, line: 239, baseType: !93, size: 16, offset: 2128)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !514, file: !339, line: 240, baseType: !14, size: 32, offset: 2144)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !514, file: !339, line: 241, baseType: !14, size: 32, offset: 2176)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !514, file: !339, line: 241, baseType: !14, size: 32, offset: 2208)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !514, file: !339, line: 241, baseType: !14, size: 32, offset: 2240)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !514, file: !339, line: 243, baseType: !290, size: 32, offset: 2272)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !514, file: !339, line: 243, baseType: !290, size: 32, offset: 2304)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !514, file: !339, line: 244, baseType: !290, size: 32, offset: 2336)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !514, file: !339, line: 246, baseType: !568, size: 320, offset: 2368)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !569, line: 50, size: 320, elements: !570)
!569 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!570 = !{!571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !568, file: !569, line: 51, baseType: !413, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !568, file: !569, line: 53, baseType: !14, size: 32, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !568, file: !569, line: 54, baseType: !14, size: 32, offset: 96)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !568, file: !569, line: 55, baseType: !14, size: 32, offset: 128)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !568, file: !569, line: 55, baseType: !14, size: 32, offset: 160)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !568, file: !569, line: 56, baseType: !89, size: 8, offset: 192)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !568, file: !569, line: 56, baseType: !89, size: 8, offset: 200)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !568, file: !569, line: 57, baseType: !89, size: 8, offset: 208)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !568, file: !569, line: 57, baseType: !89, size: 8, offset: 216)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !568, file: !569, line: 59, baseType: !93, size: 16, offset: 224)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !568, file: !569, line: 59, baseType: !93, size: 16, offset: 240)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !568, file: !569, line: 59, baseType: !93, size: 16, offset: 256)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !568, file: !569, line: 61, baseType: !93, size: 16, offset: 272)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !568, file: !569, line: 63, baseType: !14, size: 32, offset: 288)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !514, file: !339, line: 248, baseType: !586, size: 64, offset: 2688)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !588, line: 328, size: 3456, elements: !589)
!588 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!589 = !{!590, !591, !592, !1292, !1293, !1294, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1324, !1325, !1326, !1329, !1333, !1337, !1341, !1342, !1343, !1344, !1345}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !587, file: !588, line: 329, baseType: !114, size: 960)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !587, file: !588, line: 330, baseType: !419, size: 64, offset: 960)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !587, file: !588, line: 332, baseType: !593, size: 64, offset: 1024)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !595, line: 283, size: 4096, elements: !596)
!595 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!596 = !{!597, !598, !599, !600, !601, !602, !606, !1261, !1269, !1273, !1279, !1283, !1284, !1285, !1286, !1290, !1291}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !594, file: !595, line: 284, baseType: !14, size: 32)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !594, file: !595, line: 285, baseType: !143, size: 512, offset: 32)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !594, file: !595, line: 287, baseType: !143, size: 512, offset: 544)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !594, file: !595, line: 288, baseType: !209, size: 2048, offset: 1056)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !594, file: !595, line: 289, baseType: !14, size: 32, offset: 3104)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !594, file: !595, line: 292, baseType: !603, size: 64, offset: 3136)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DISubroutineType(types: !605)
!605 = !{null, !586}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !594, file: !595, line: 293, baseType: !607, size: 64, offset: 3200)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DISubroutineType(types: !609)
!609 = !{null, !586, !610}
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !588, line: 167, size: 3712, elements: !612)
!612 = !{!613, !614, !615, !616, !617, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !611, file: !588, line: 168, baseType: !610, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !611, file: !588, line: 168, baseType: !610, size: 64, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !611, file: !588, line: 168, baseType: !610, size: 64, offset: 128)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !611, file: !588, line: 170, baseType: !132, size: 64, offset: 192)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !611, file: !588, line: 172, baseType: !618, size: 64, offset: 256)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !595, line: 144, size: 6016, elements: !620)
!620 = !{!621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !798, !799, !800, !1128, !1132, !1136, !1137, !1144, !1148, !1152, !1153, !1154, !1155, !1159, !1160, !1164, !1168, !1172, !1176, !1180, !1184, !1188, !1189, !1196, !1198, !1207, !1216}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !619, file: !595, line: 145, baseType: !118, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !619, file: !595, line: 145, baseType: !118, size: 64, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !619, file: !595, line: 146, baseType: !93, size: 16, offset: 128)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !619, file: !595, line: 148, baseType: !143, size: 512, offset: 144)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !619, file: !595, line: 149, baseType: !14, size: 32, offset: 672)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !619, file: !595, line: 151, baseType: !143, size: 512, offset: 704)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !619, file: !595, line: 152, baseType: !209, size: 2048, offset: 1216)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !619, file: !595, line: 153, baseType: !14, size: 32, offset: 3264)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !619, file: !595, line: 155, baseType: !290, size: 32, offset: 3296)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !619, file: !595, line: 155, baseType: !290, size: 32, offset: 3328)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !619, file: !595, line: 155, baseType: !290, size: 32, offset: 3360)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !619, file: !595, line: 156, baseType: !290, size: 32, offset: 3392)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !619, file: !595, line: 156, baseType: !290, size: 32, offset: 3424)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !619, file: !595, line: 156, baseType: !290, size: 32, offset: 3456)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !619, file: !595, line: 157, baseType: !93, size: 16, offset: 3488)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !619, file: !595, line: 157, baseType: !93, size: 16, offset: 3504)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !619, file: !595, line: 157, baseType: !93, size: 16, offset: 3520)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !619, file: !595, line: 160, baseType: !639, size: 64, offset: 3584)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !595, line: 109, baseType: !641)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !595, line: 98, size: 1408, elements: !642)
!642 = !{!643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !797}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !641, file: !595, line: 99, baseType: !14, size: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !641, file: !595, line: 99, baseType: !14, size: 32, offset: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !641, file: !595, line: 100, baseType: !143, size: 512, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !641, file: !595, line: 101, baseType: !290, size: 32, offset: 576)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !641, file: !595, line: 101, baseType: !290, size: 32, offset: 608)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !641, file: !595, line: 101, baseType: !290, size: 32, offset: 640)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !641, file: !595, line: 101, baseType: !290, size: 32, offset: 672)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !641, file: !595, line: 102, baseType: !290, size: 32, offset: 704)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !641, file: !595, line: 102, baseType: !290, size: 32, offset: 736)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !641, file: !595, line: 103, baseType: !14, size: 32, offset: 768)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !641, file: !595, line: 104, baseType: !14, size: 32, offset: 800)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !641, file: !595, line: 107, baseType: !655, size: 64, offset: 832)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !588, line: 87, size: 2816, elements: !657)
!657 = !{!658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !779}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !656, file: !588, line: 88, baseType: !655, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !656, file: !588, line: 88, baseType: !655, size: 64, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !656, file: !588, line: 88, baseType: !655, size: 64, offset: 128)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !656, file: !588, line: 90, baseType: !132, size: 64, offset: 192)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !656, file: !588, line: 92, baseType: !143, size: 512, offset: 256)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !656, file: !588, line: 94, baseType: !143, size: 512, offset: 768)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !656, file: !588, line: 99, baseType: !118, size: 64, offset: 1280)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !656, file: !588, line: 101, baseType: !93, size: 16, offset: 1344)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !656, file: !588, line: 101, baseType: !93, size: 16, offset: 1360)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !656, file: !588, line: 102, baseType: !93, size: 16, offset: 1376)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !656, file: !588, line: 103, baseType: !93, size: 16, offset: 1392)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !656, file: !588, line: 104, baseType: !670, size: 64, offset: 1408)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !595, line: 114, size: 1600, elements: !672)
!672 = !{!673, !674, !695, !699, !703, !707, !711, !715, !716, !720, !749, !750, !751}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !671, file: !595, line: 115, baseType: !143, size: 512)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !671, file: !595, line: 117, baseType: !675, size: 64, offset: 512)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DISubroutineType(types: !677)
!677 = !{null, !678, !679, !681, !681, !693}
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !405, line: 46, flags: DIFlagFwdDecl)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !683, line: 55, size: 192, elements: !684)
!683 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!684 = !{!685, !689, !692}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !682, file: !683, line: 58, baseType: !686, size: 64)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !682, file: !683, line: 56, size: 64, elements: !687)
!687 = !{!688}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !686, file: !683, line: 57, baseType: !118, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !682, file: !683, line: 60, baseType: !690, size: 64, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !57, line: 57, flags: DIFlagFwdDecl)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !682, file: !683, line: 61, baseType: !118, size: 64, offset: 128)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !89)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "draw_color", scope: !671, file: !595, line: 118, baseType: !696, size: 64, offset: 576)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{null, !678, !681, !681, !497}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw", scope: !671, file: !595, line: 120, baseType: !700, size: 64, offset: 640)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DISubroutineType(types: !702)
!702 = !{null, !678, !679, !681}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw_color", scope: !671, file: !595, line: 121, baseType: !704, size: 64, offset: 704)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DISubroutineType(types: !706)
!706 = !{null, !678, !681, !497}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "interface_register_properties", scope: !671, file: !595, line: 122, baseType: !708, size: 64, offset: 768)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DISubroutineType(types: !710)
!710 = !{null, !586, !655, !690}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "interface_init_socket", scope: !671, file: !595, line: 123, baseType: !712, size: 64, offset: 832)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DISubroutineType(types: !714)
!714 = !{null, !586, !655, !610, !655, !693}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "interface_verify_socket", scope: !671, file: !595, line: 124, baseType: !712, size: 64, offset: 896)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "interface_from_socket", scope: !671, file: !595, line: 125, baseType: !717, size: 64, offset: 960)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DISubroutineType(types: !719)
!719 = !{null, !586, !655, !610, !655}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "ext_socket", scope: !671, file: !595, line: 128, baseType: !721, size: 256, offset: 1024)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !683, line: 436, baseType: !722)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !683, line: 430, size: 256, elements: !723)
!723 = !{!724, !725, !728, !744}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !722, file: !683, line: 431, baseType: !118, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !722, file: !683, line: 432, baseType: !726, size: 64, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !683, line: 417, baseType: !691)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !722, file: !683, line: 433, baseType: !729, size: 64, offset: 128)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !683, line: 408, baseType: !730)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DISubroutineType(types: !732)
!732 = !{!14, !678, !681, !733, !735}
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !683, line: 38, flags: DIFlagFwdDecl)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !683, line: 348, baseType: !737)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !683, line: 337, size: 256, elements: !738)
!738 = !{!739, !740, !741, !742, !743}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !737, file: !683, line: 339, baseType: !118, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !737, file: !683, line: 342, baseType: !733, size: 64, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !737, file: !683, line: 345, baseType: !14, size: 32, offset: 128)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !737, file: !683, line: 347, baseType: !14, size: 32, offset: 160)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !737, file: !683, line: 347, baseType: !14, size: 32, offset: 192)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !722, file: !683, line: 434, baseType: !745, size: 64, offset: 192)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !683, line: 409, baseType: !746)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{null, !118}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "ext_interface", scope: !671, file: !595, line: 129, baseType: !721, size: 256, offset: 1280)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !671, file: !595, line: 132, baseType: !14, size: 32, offset: 1536)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !671, file: !595, line: 132, baseType: !14, size: 32, offset: 1568)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !656, file: !588, line: 105, baseType: !143, size: 512, offset: 1472)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !656, file: !588, line: 107, baseType: !290, size: 32, offset: 1984)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !656, file: !588, line: 107, baseType: !290, size: 32, offset: 2016)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "default_value", scope: !656, file: !588, line: 109, baseType: !118, size: 64, offset: 2048)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "stack_index", scope: !656, file: !588, line: 112, baseType: !93, size: 16, offset: 2112)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "stack_type", scope: !656, file: !588, line: 114, baseType: !93, size: 16, offset: 2128)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !656, file: !588, line: 115, baseType: !14, size: 32, offset: 2144)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !656, file: !588, line: 117, baseType: !118, size: 64, offset: 2176)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "own_index", scope: !656, file: !588, line: 122, baseType: !14, size: 32, offset: 2240)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "to_index", scope: !656, file: !588, line: 124, baseType: !14, size: 32, offset: 2272)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "groupsock", scope: !656, file: !588, line: 126, baseType: !655, size: 64, offset: 2304)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !656, file: !588, line: 128, baseType: !764, size: 64, offset: 2368)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeLink", file: !588, line: 298, size: 448, elements: !766)
!766 = !{!767, !768, !769, !772, !773, !776, !777, !778}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !765, file: !588, line: 299, baseType: !764, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !765, file: !588, line: 299, baseType: !764, size: 64, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "fromnode", scope: !765, file: !588, line: 301, baseType: !770, size: 64, offset: 128)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNode", file: !588, line: 218, baseType: !611)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "tonode", scope: !765, file: !588, line: 301, baseType: !770, size: 64, offset: 192)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "fromsock", scope: !765, file: !588, line: 302, baseType: !774, size: 64, offset: 256)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocket", file: !588, line: 132, baseType: !656)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "tosock", scope: !765, file: !588, line: 302, baseType: !774, size: 64, offset: 320)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !765, file: !588, line: 304, baseType: !14, size: 32, offset: 384)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !765, file: !588, line: 305, baseType: !14, size: 32, offset: 416)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !656, file: !588, line: 131, baseType: !780, size: 384, offset: 2432)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeStack", file: !588, line: 73, baseType: !781)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeStack", file: !588, line: 62, size: 384, elements: !782)
!782 = !{!783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !781, file: !588, line: 63, baseType: !289, size: 128)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !781, file: !588, line: 64, baseType: !290, size: 32, offset: 128)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !781, file: !588, line: 64, baseType: !290, size: 32, offset: 160)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !781, file: !588, line: 65, baseType: !118, size: 64, offset: 192)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "hasinput", scope: !781, file: !588, line: 66, baseType: !93, size: 16, offset: 256)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "hasoutput", scope: !781, file: !588, line: 67, baseType: !93, size: 16, offset: 272)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !781, file: !588, line: 68, baseType: !93, size: 16, offset: 288)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "sockettype", scope: !781, file: !588, line: 69, baseType: !93, size: 16, offset: 304)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !781, file: !588, line: 70, baseType: !93, size: 16, offset: 320)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !781, file: !588, line: 71, baseType: !93, size: 16, offset: 336)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !781, file: !588, line: 72, baseType: !794, size: 32, offset: 352)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 32, elements: !795)
!795 = !{!796}
!796 = !DISubrange(count: 2)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !641, file: !595, line: 108, baseType: !143, size: 512, offset: 896)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !619, file: !595, line: 160, baseType: !639, size: 64, offset: 3648)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "storagename", scope: !619, file: !595, line: 162, baseType: !143, size: 512, offset: 3712)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype", scope: !619, file: !595, line: 165, baseType: !801, size: 64, offset: 4224)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DISubroutineType(types: !803)
!803 = !{null, !804, !806, !1122, !586, !610, !1124}
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !75)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !405, line: 230, size: 3072, elements: !808)
!808 = !{!809, !810, !811, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1121}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !807, file: !405, line: 231, baseType: !806, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !807, file: !405, line: 231, baseType: !806, size: 64, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !807, file: !405, line: 233, baseType: !812, size: 1280, offset: 128)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "View2D", file: !813, line: 71, baseType: !814)
!813 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view2d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View2D", file: !813, line: 40, size: 1280, elements: !815)
!815 = !{!816, !825, !826, !834, !835, !836, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !859}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !814, file: !813, line: 41, baseType: !817, size: 128)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !818, line: 95, baseType: !819)
!818 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !818, line: 92, size: 128, elements: !820)
!820 = !{!821, !822, !823, !824}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !819, file: !818, line: 93, baseType: !290, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !819, file: !818, line: 93, baseType: !290, size: 32, offset: 32)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !819, file: !818, line: 94, baseType: !290, size: 32, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !819, file: !818, line: 94, baseType: !290, size: 32, offset: 96)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !814, file: !813, line: 41, baseType: !817, size: 128, offset: 128)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "vert", scope: !814, file: !813, line: 42, baseType: !827, size: 128, offset: 256)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !818, line: 89, baseType: !828)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !818, line: 86, size: 128, elements: !829)
!829 = !{!830, !831, !832, !833}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !828, file: !818, line: 87, baseType: !14, size: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !828, file: !818, line: 87, baseType: !14, size: 32, offset: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !828, file: !818, line: 88, baseType: !14, size: 32, offset: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !828, file: !818, line: 88, baseType: !14, size: 32, offset: 96)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "hor", scope: !814, file: !813, line: 42, baseType: !827, size: 128, offset: 384)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !814, file: !813, line: 43, baseType: !827, size: 128, offset: 512)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !814, file: !813, line: 45, baseType: !837, size: 64, offset: 640)
!837 = !DICompositeType(tag: DW_TAG_array_type, baseType: !290, size: 64, elements: !795)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !814, file: !813, line: 45, baseType: !837, size: 64, offset: 704)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "minzoom", scope: !814, file: !813, line: 46, baseType: !290, size: 32, offset: 768)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "maxzoom", scope: !814, file: !813, line: 46, baseType: !290, size: 32, offset: 800)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !814, file: !813, line: 48, baseType: !93, size: 16, offset: 832)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_ui", scope: !814, file: !813, line: 49, baseType: !93, size: 16, offset: 848)
