; ModuleID = 'blender_bin/source/blender/makesrna/intern/rna_speaker_gen.c'
source_filename = "blender_bin/source/blender/makesrna/intern/rna_speaker_gen.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.StructRNA = type { %struct.ContainerRNA, i8*, i8*, i8*, i32, i8*, i8*, i8*, i32, %struct.PropertyRNA*, %struct.PropertyRNA*, %struct.StructRNA*, %struct.StructRNA*, %struct.StructRNA* (%struct.PointerRNA*)*, i8* (%struct.PointerRNA*)*, %struct.StructRNA* (%struct.Main*, %struct.ReportList*, i8*, i8*, i32 (%struct.PointerRNA*, i8*, i32*)*, i32 (%struct.bContext*, %struct.PointerRNA*, %struct.FunctionRNA*, %struct.ParameterList*)*, void (i8*)*)*, void (%struct.Main*, %struct.StructRNA*)*, i8** (%struct.PointerRNA*)*, %struct.IDProperty* (%struct.PointerRNA*, i8)*, %struct.ListBase }
%struct.ContainerRNA = type { i8*, i8*, %struct.GHash*, %struct.ListBase }
%struct.GHash = type opaque
%struct.PropertyRNA = type { %struct.PropertyRNA*, %struct.PropertyRNA*, i32, i8*, i32, i8*, i8*, i32, i8*, i32, i32, i32 (%struct.PointerRNA*, i32*)*, i32, [3 x i32], i32, void (%struct.Main*, %struct.Scene*, %struct.PointerRNA*)*, i32, {}*, i32 (%struct.PointerRNA*, i32)*, i32, i32, %struct.StructRNA*, i8* }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }

!1 = distinct !DIGlobalVariable(name: "rna_Speaker_muted", scope: !2, file: !3, line: 1207, type: !180, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !56, globals: !177, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "blender_bin/source/blender/makesrna/intern/rna_speaker_gen.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{!5, !16, !47}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertyType", file: !6, line: 71, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15}
!9 = !DIEnumerator(name: "PROP_BOOLEAN", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "PROP_INT", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "PROP_FLOAT", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "PROP_STRING", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "PROP_ENUM", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "PROP_POINTER", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "PROP_COLLECTION", value: 6, isUnsigned: true)
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertySubType", file: !6, line: 107, baseType: !7, size: 32, elements: !17)
!17 = !{!18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46}
!18 = !DIEnumerator(name: "PROP_NONE", value: 0, isUnsigned: true)
!19 = !DIEnumerator(name: "PROP_FILEPATH", value: 1, isUnsigned: true)
!20 = !DIEnumerator(name: "PROP_DIRPATH", value: 2, isUnsigned: true)
!21 = !DIEnumerator(name: "PROP_FILENAME", value: 3, isUnsigned: true)
!22 = !DIEnumerator(name: "PROP_BYTESTRING", value: 4, isUnsigned: true)
!23 = !DIEnumerator(name: "PROP_PASSWORD", value: 6, isUnsigned: true)
!24 = !DIEnumerator(name: "PROP_PIXEL", value: 12, isUnsigned: true)
!25 = !DIEnumerator(name: "PROP_UNSIGNED", value: 13, isUnsigned: true)
!26 = !DIEnumerator(name: "PROP_PERCENTAGE", value: 14, isUnsigned: true)
!27 = !DIEnumerator(name: "PROP_FACTOR", value: 15, isUnsigned: true)
!28 = !DIEnumerator(name: "PROP_ANGLE", value: 327696, isUnsigned: true)
!29 = !DIEnumerator(name: "PROP_TIME", value: 393233, isUnsigned: true)
!30 = !DIEnumerator(name: "PROP_DISTANCE", value: 65554, isUnsigned: true)
!31 = !DIEnumerator(name: "PROP_DISTANCE_CAMERA", value: 589843, isUnsigned: true)
!32 = !DIEnumerator(name: "PROP_COLOR", value: 20, isUnsigned: true)
!33 = !DIEnumerator(name: "PROP_TRANSLATION", value: 65557, isUnsigned: true)
!34 = !DIEnumerator(name: "PROP_DIRECTION", value: 22, isUnsigned: true)
!35 = !DIEnumerator(name: "PROP_VELOCITY", value: 458775, isUnsigned: true)
!36 = !DIEnumerator(name: "PROP_ACCELERATION", value: 524312, isUnsigned: true)
!37 = !DIEnumerator(name: "PROP_MATRIX", value: 25, isUnsigned: true)
!38 = !DIEnumerator(name: "PROP_EULER", value: 327706, isUnsigned: true)
!39 = !DIEnumerator(name: "PROP_QUATERNION", value: 27, isUnsigned: true)
!40 = !DIEnumerator(name: "PROP_AXISANGLE", value: 28, isUnsigned: true)
!41 = !DIEnumerator(name: "PROP_XYZ", value: 29, isUnsigned: true)
!42 = !DIEnumerator(name: "PROP_XYZ_LENGTH", value: 65565, isUnsigned: true)
!43 = !DIEnumerator(name: "PROP_COLOR_GAMMA", value: 30, isUnsigned: true)
!44 = !DIEnumerator(name: "PROP_COORDS", value: 31, isUnsigned: true)
!45 = !DIEnumerator(name: "PROP_LAYER", value: 40, isUnsigned: true)
!46 = !DIEnumerator(name: "PROP_LAYER_MEMBER", value: 41, isUnsigned: true)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RawPropertyType", file: !6, line: 286, baseType: !48, size: 32, elements: !49)
!48 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!49 = !{!50, !51, !52, !53, !54, !55}
!50 = !DIEnumerator(name: "PROP_RAW_UNSET", value: -1)
!51 = !DIEnumerator(name: "PROP_RAW_INT", value: 0)
!52 = !DIEnumerator(name: "PROP_RAW_SHORT", value: 1)
!53 = !DIEnumerator(name: "PROP_RAW_CHAR", value: 2)
!54 = !DIEnumerator(name: "PROP_RAW_DOUBLE", value: 3)
!55 = !DIEnumerator(name: "PROP_RAW_FLOAT", value: 4)
!56 = !{!57, !78, !151}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "Speaker", file: !59, line: 58, baseType: !60)
!59 = !DIFile(filename: "blender/source/blender/makesdna/DNA_speaker_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Speaker", file: !59, line: 35, size: 1472, elements: !61)
!61 = !{!62, !133, !137, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !60, file: !59, line: 36, baseType: !63, size: 960)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !64, line: 130, baseType: !65)
!64 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !64, line: 117, size: 960, elements: !66)
!66 = !{!67, !69, !70, !72, !92, !96, !98, !99, !100, !101}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !65, file: !64, line: 118, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !65, file: !64, line: 118, baseType: !68, size: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !65, file: !64, line: 119, baseType: !71, size: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !65, file: !64, line: 120, baseType: !73, size: 64, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !64, line: 136, size: 17600, elements: !75)
!75 = !{!76, !77, !79, !82, !87, !88, !89}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !74, file: !64, line: 137, baseType: !63, size: 960)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !74, file: !64, line: 138, baseType: !78, size: 64, offset: 960)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !74, file: !64, line: 139, baseType: !80, size: 64, offset: 1024)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !64, line: 43, flags: DIFlagFwdDecl)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !74, file: !64, line: 140, baseType: !83, size: 8192, offset: 1088)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 8192, elements: !85)
!84 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!85 = !{!86}
!86 = !DISubrange(count: 1024)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !74, file: !64, line: 141, baseType: !83, size: 8192, offset: 9280)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !74, file: !64, line: 148, baseType: !73, size: 64, offset: 17472)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !74, file: !64, line: 150, baseType: !90, size: 64, offset: 17536)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !64, line: 45, flags: DIFlagFwdDecl)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !65, file: !64, line: 121, baseType: !93, size: 528, offset: 256)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 528, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 66)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !65, file: !64, line: 126, baseType: !97, size: 16, offset: 784)
!97 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !65, file: !64, line: 127, baseType: !48, size: 32, offset: 800)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !65, file: !64, line: 128, baseType: !48, size: 32, offset: 832)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !65, file: !64, line: 128, baseType: !48, size: 32, offset: 864)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !65, file: !64, line: 129, baseType: !102, size: 64, offset: 896)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !64, line: 75, baseType: !104)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !64, line: 62, size: 1024, elements: !105)
!105 = !{!106, !108, !109, !110, !111, !112, !116, !117, !131, !132}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !104, file: !64, line: 63, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !104, file: !64, line: 63, baseType: !107, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !104, file: !64, line: 64, baseType: !84, size: 8, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !104, file: !64, line: 64, baseType: !84, size: 8, offset: 136)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !104, file: !64, line: 65, baseType: !97, size: 16, offset: 144)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !104, file: !64, line: 66, baseType: !113, size: 512, offset: 160)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 512, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !104, file: !64, line: 67, baseType: !48, size: 32, offset: 672)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !104, file: !64, line: 69, baseType: !118, size: 256, offset: 704)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !64, line: 60, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !64, line: 48, size: 256, elements: !120)
!120 = !{!121, !122, !129, !130}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !119, file: !64, line: 49, baseType: !68, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !119, file: !64, line: 58, baseType: !123, size: 128, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !124, line: 71, baseType: !125)
!124 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !124, line: 69, size: 128, elements: !126)
!126 = !{!127, !128}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !125, file: !124, line: 70, baseType: !68, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !125, file: !124, line: 70, baseType: !68, size: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !119, file: !64, line: 59, baseType: !48, size: 32, offset: 192)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !119, file: !64, line: 59, baseType: !48, size: 32, offset: 224)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !104, file: !64, line: 70, baseType: !48, size: 32, offset: 960)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !104, file: !64, line: 74, baseType: !48, size: 32, offset: 992)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !60, file: !59, line: 37, baseType: !134, size: 64, offset: 960)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !136, line: 58, flags: DIFlagFwdDecl)
!136 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!137 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !60, file: !59, line: 39, baseType: !138, size: 64, offset: 1024)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bSound", file: !140, line: 46, size: 9856, elements: !141)
!140 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sound_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!141 = !{!142, !143, !144, !145, !146, !147, !150, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !139, file: !140, line: 47, baseType: !63, size: 960)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !139, file: !140, line: 52, baseType: !83, size: 8192, offset: 960)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !139, file: !140, line: 57, baseType: !90, size: 64, offset: 9152)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !139, file: !140, line: 62, baseType: !68, size: 64, offset: 9216)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "newpackedfile", scope: !139, file: !140, line: 67, baseType: !90, size: 64, offset: 9280)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !139, file: !140, line: 68, baseType: !148, size: 64, offset: 9344)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !140, line: 42, flags: DIFlagFwdDecl)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !139, file: !140, line: 69, baseType: !151, size: 32, offset: 9408)
!151 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "attenuation", scope: !139, file: !140, line: 70, baseType: !151, size: 32, offset: 9440)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !139, file: !140, line: 71, baseType: !151, size: 32, offset: 9472)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "min_gain", scope: !139, file: !140, line: 72, baseType: !151, size: 32, offset: 9504)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "max_gain", scope: !139, file: !140, line: 73, baseType: !151, size: 32, offset: 9536)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !139, file: !140, line: 74, baseType: !151, size: 32, offset: 9568)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !139, file: !140, line: 75, baseType: !48, size: 32, offset: 9600)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !139, file: !140, line: 76, baseType: !48, size: 32, offset: 9632)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !139, file: !140, line: 85, baseType: !68, size: 64, offset: 9664)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "waveform", scope: !139, file: !140, line: 90, baseType: !68, size: 64, offset: 9728)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "playback_handle", scope: !139, file: !140, line: 96, baseType: !68, size: 64, offset: 9792)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "volume_max", scope: !60, file: !59, line: 42, baseType: !151, size: 32, offset: 1088)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "volume_min", scope: !60, file: !59, line: 43, baseType: !151, size: 32, offset: 1120)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "distance_max", scope: !60, file: !59, line: 44, baseType: !151, size: 32, offset: 1152)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "distance_reference", scope: !60, file: !59, line: 45, baseType: !151, size: 32, offset: 1184)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "attenuation", scope: !60, file: !59, line: 46, baseType: !151, size: 32, offset: 1216)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "cone_angle_outer", scope: !60, file: !59, line: 47, baseType: !151, size: 32, offset: 1248)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "cone_angle_inner", scope: !60, file: !59, line: 48, baseType: !151, size: 32, offset: 1280)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "cone_volume_outer", scope: !60, file: !59, line: 49, baseType: !151, size: 32, offset: 1312)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !60, file: !59, line: 52, baseType: !151, size: 32, offset: 1344)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !60, file: !59, line: 53, baseType: !151, size: 32, offset: 1376)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !60, file: !59, line: 56, baseType: !97, size: 16, offset: 1408)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !60, file: !59, line: 57, baseType: !174, size: 48, offset: 1424)
!174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 48, elements: !175)
!175 = !{!176}
!176 = !DISubrange(count: 3)
!177 = !{!0, !178, !1285, !1315, !1382, !1384, !1386, !1388, !1390, !1392, !1394, !1396, !1398, !1400, !1402}
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(name: "rna_Speaker_relative", scope: !2, file: !3, line: 1218, type: !180, isLocal: false, isDefinition: true)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "BoolPropertyRNA", file: !181, line: 229, baseType: !182)
!181 = !DIFile(filename: "blender/source/blender/makesrna/intern/rna_internal_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoolPropertyRNA", file: !181, line: 214, size: 1984, elements: !183)
!183 = !{!184, !1244, !1246, !1251, !1256, !1263, !1268, !1273, !1278, !1283, !1284}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "property", scope: !182, file: !181, line: 215, baseType: !185, size: 1344)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyRNA", file: !6, line: 333, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PropertyRNA", file: !181, line: 157, size: 1344, elements: !187)
!187 = !{!188, !190, !191, !192, !195, !196, !197, !198, !199, !200, !202, !204, !512, !513, !515, !516, !1228, !1229, !1234, !1239, !1240, !1242, !1243}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !186, file: !181, line: 158, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !186, file: !181, line: 158, baseType: !189, size: 64, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !186, file: !181, line: 161, baseType: !48, size: 32, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !186, file: !181, line: 164, baseType: !193, size: 64, offset: 192)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !84)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !186, file: !181, line: 166, baseType: !48, size: 32, offset: 256)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !186, file: !181, line: 169, baseType: !193, size: 64, offset: 320)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !186, file: !181, line: 171, baseType: !193, size: 64, offset: 384)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !186, file: !181, line: 173, baseType: !48, size: 32, offset: 448)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !186, file: !181, line: 175, baseType: !193, size: 64, offset: 512)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !186, file: !181, line: 178, baseType: !201, size: 32, offset: 576)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyType", file: !6, line: 79, baseType: !5)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !186, file: !181, line: 180, baseType: !203, size: 32, offset: 608)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertySubType", file: !6, line: 147, baseType: !16)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "getlength", scope: !186, file: !181, line: 182, baseType: !205, size: 64, offset: 640)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropArrayLengthGetFunc", file: !181, line: 73, baseType: !206)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!48, !209, !458}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !6, line: 55, size: 192, elements: !211)
!211 = !{!212, !216, !511}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !210, file: !6, line: 58, baseType: !213, size: 64)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !210, file: !6, line: 56, size: 64, elements: !214)
!214 = !{!215}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !213, file: !6, line: 57, baseType: !68, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !210, file: !6, line: 60, baseType: !217, size: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !181, line: 339, size: 1600, elements: !219)
!219 = !{!220, !230, !231, !232, !233, !234, !235, !236, !237, !238, !240, !241, !242, !243, !248, !254, !493, !498, !504, !510}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !218, file: !181, line: 341, baseType: !221, size: 320)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "ContainerRNA", file: !181, line: 135, baseType: !222)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ContainerRNA", file: !181, line: 130, size: 320, elements: !223)
!223 = !{!224, !225, !226, !229}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !222, file: !181, line: 131, baseType: !68, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !222, file: !181, line: 131, baseType: !68, size: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "prophash", scope: !222, file: !181, line: 133, baseType: !227, size: 64, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !181, line: 46, flags: DIFlagFwdDecl)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !222, file: !181, line: 134, baseType: !123, size: 128, offset: 192)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !218, file: !181, line: 344, baseType: !193, size: 64, offset: 320)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "py_type", scope: !218, file: !181, line: 348, baseType: !68, size: 64, offset: 384)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "blender_type", scope: !218, file: !181, line: 349, baseType: !68, size: 64, offset: 448)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !218, file: !181, line: 352, baseType: !48, size: 32, offset: 512)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !218, file: !181, line: 355, baseType: !193, size: 64, offset: 576)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !218, file: !181, line: 357, baseType: !193, size: 64, offset: 640)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !218, file: !181, line: 359, baseType: !193, size: 64, offset: 704)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !218, file: !181, line: 361, baseType: !48, size: 32, offset: 768)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "nameproperty", scope: !218, file: !181, line: 364, baseType: !239, size: 64, offset: 832)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "iteratorproperty", scope: !218, file: !181, line: 367, baseType: !239, size: 64, offset: 896)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !218, file: !181, line: 370, baseType: !217, size: 64, offset: 960)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "nested", scope: !218, file: !181, line: 376, baseType: !217, size: 64, offset: 1024)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "refine", scope: !218, file: !181, line: 379, baseType: !244, size: 64, offset: 1088)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRefineFunc", file: !181, line: 70, baseType: !245)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DISubroutineType(types: !247)
!247 = !{!217, !209}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !218, file: !181, line: 382, baseType: !249, size: 64, offset: 1152)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructPathFunc", file: !181, line: 71, baseType: !250)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{!253, !209}
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !218, file: !181, line: 385, baseType: !255, size: 64, offset: 1216)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRegisterFunc", file: !6, line: 410, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DISubroutineType(types: !258)
!258 = !{!217, !259, !329, !68, !193, !454, !459, !489}
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Main", file: !261, line: 53, size: 15232, elements: !262)
!261 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_main.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!262 = !{!263, !264, !265, !266, !267, !268, !269, !270, !276, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !320, !326}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !260, file: !261, line: 54, baseType: !259, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !260, file: !261, line: 54, baseType: !259, size: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !260, file: !261, line: 55, baseType: !83, size: 8192, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "versionfile", scope: !260, file: !261, line: 56, baseType: !97, size: 16, offset: 8320)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "subversionfile", scope: !260, file: !261, line: 56, baseType: !97, size: 16, offset: 8336)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "minversionfile", scope: !260, file: !261, line: 57, baseType: !97, size: 16, offset: 8352)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "minsubversionfile", scope: !260, file: !261, line: 57, baseType: !97, size: 16, offset: 8368)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "build_commit_timestamp", scope: !260, file: !261, line: 58, baseType: !271, size: 64, offset: 8384)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !272, line: 27, baseType: !273)
!272 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !274, line: 45, baseType: !275)
!274 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!275 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "build_hash", scope: !260, file: !261, line: 59, baseType: !277, size: 128, offset: 8448)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 128, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 16)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", scope: !260, file: !261, line: 60, baseType: !97, size: 16, offset: 8576)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "curlib", scope: !260, file: !261, line: 62, baseType: !73, size: 64, offset: 8640)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !260, file: !261, line: 63, baseType: !123, size: 128, offset: 8704)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "library", scope: !260, file: !261, line: 64, baseType: !123, size: 128, offset: 8832)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !260, file: !261, line: 65, baseType: !123, size: 128, offset: 8960)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "mesh", scope: !260, file: !261, line: 66, baseType: !123, size: 128, offset: 9088)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !260, file: !261, line: 67, baseType: !123, size: 128, offset: 9216)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "mball", scope: !260, file: !261, line: 68, baseType: !123, size: 128, offset: 9344)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !260, file: !261, line: 69, baseType: !123, size: 128, offset: 9472)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !260, file: !261, line: 70, baseType: !123, size: 128, offset: 9600)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !260, file: !261, line: 71, baseType: !123, size: 128, offset: 9728)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "latt", scope: !260, file: !261, line: 72, baseType: !123, size: 128, offset: 9856)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "lamp", scope: !260, file: !261, line: 73, baseType: !123, size: 128, offset: 9984)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !260, file: !261, line: 74, baseType: !123, size: 128, offset: 10112)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !260, file: !261, line: 75, baseType: !123, size: 128, offset: 10240)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !260, file: !261, line: 76, baseType: !123, size: 128, offset: 10368)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !260, file: !261, line: 77, baseType: !123, size: 128, offset: 10496)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !260, file: !261, line: 78, baseType: !123, size: 128, offset: 10624)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !260, file: !261, line: 79, baseType: !123, size: 128, offset: 10752)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "vfont", scope: !260, file: !261, line: 80, baseType: !123, size: 128, offset: 10880)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !260, file: !261, line: 81, baseType: !123, size: 128, offset: 11008)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "speaker", scope: !260, file: !261, line: 82, baseType: !123, size: 128, offset: 11136)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !260, file: !261, line: 83, baseType: !123, size: 128, offset: 11264)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !260, file: !261, line: 84, baseType: !123, size: 128, offset: 11392)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "armature", scope: !260, file: !261, line: 85, baseType: !123, size: 128, offset: 11520)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !260, file: !261, line: 86, baseType: !123, size: 128, offset: 11648)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !260, file: !261, line: 87, baseType: !123, size: 128, offset: 11776)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !260, file: !261, line: 88, baseType: !123, size: 128, offset: 11904)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !260, file: !261, line: 89, baseType: !123, size: 128, offset: 12032)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "palettes", scope: !260, file: !261, line: 90, baseType: !123, size: 128, offset: 12160)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "paintcurves", scope: !260, file: !261, line: 91, baseType: !123, size: 128, offset: 12288)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "wm", scope: !260, file: !261, line: 92, baseType: !123, size: 128, offset: 12416)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil", scope: !260, file: !261, line: 93, baseType: !123, size: 128, offset: 12544)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "movieclip", scope: !260, file: !261, line: 94, baseType: !123, size: 128, offset: 12672)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !260, file: !261, line: 95, baseType: !123, size: 128, offset: 12800)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "linestyle", scope: !260, file: !261, line: 96, baseType: !123, size: 128, offset: 12928)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "id_tag_update", scope: !260, file: !261, line: 98, baseType: !317, size: 2048, offset: 13056)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 2048, elements: !318)
!318 = !{!319}
!319 = !DISubrange(count: 256)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "eval_ctx", scope: !260, file: !261, line: 101, baseType: !321, size: 64, offset: 15104)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EvaluationContext", file: !323, line: 58, size: 32, elements: !324)
!323 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_depsgraph.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!324 = !{!325}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !322, file: !323, line: 59, baseType: !48, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !260, file: !261, line: 103, baseType: !327, size: 64, offset: 15168)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "MainLock", file: !261, line: 51, flags: DIFlagFwdDecl)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !331, line: 106, size: 320, elements: !332)
!331 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!332 = !{!333, !334, !335, !336, !337, !338}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !330, file: !331, line: 107, baseType: !123, size: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !330, file: !331, line: 108, baseType: !48, size: 32, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !330, file: !331, line: 109, baseType: !48, size: 32, offset: 160)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !330, file: !331, line: 110, baseType: !48, size: 32, offset: 192)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !330, file: !331, line: 110, baseType: !48, size: 32, offset: 224)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !330, file: !331, line: 111, baseType: !339, size: 64, offset: 256)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !341, line: 490, size: 768, elements: !342)
!341 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!342 = !{!343, !344, !345, !445, !446, !447, !448, !449, !450, !451, !452, !453}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !340, file: !341, line: 491, baseType: !339, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !340, file: !341, line: 491, baseType: !339, size: 64, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !340, file: !341, line: 493, baseType: !346, size: 64, offset: 128)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !331, line: 169, size: 2048, elements: !348)
!348 = !{!349, !350, !351, !352, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !420, !423, !437, !438, !439, !440, !441, !442, !443, !444}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !347, file: !331, line: 170, baseType: !346, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !347, file: !331, line: 170, baseType: !346, size: 64, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !347, file: !331, line: 172, baseType: !68, size: 64, offset: 128)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !347, file: !331, line: 174, baseType: !353, size: 64, offset: 192)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !355, line: 41, flags: DIFlagFwdDecl)
!355 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!356 = !DIDerivedType(tag: DW_TAG_member, name: "newscreen", scope: !347, file: !331, line: 175, baseType: !353, size: 64, offset: 256)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "screenname", scope: !347, file: !331, line: 176, baseType: !113, size: 512, offset: 320)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "posx", scope: !347, file: !331, line: 178, baseType: !97, size: 16, offset: 832)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "posy", scope: !347, file: !331, line: 178, baseType: !97, size: 16, offset: 848)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !347, file: !331, line: 178, baseType: !97, size: 16, offset: 864)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !347, file: !331, line: 178, baseType: !97, size: 16, offset: 880)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "windowstate", scope: !347, file: !331, line: 179, baseType: !97, size: 16, offset: 896)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !347, file: !331, line: 180, baseType: !97, size: 16, offset: 912)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !347, file: !331, line: 181, baseType: !97, size: 16, offset: 928)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !347, file: !331, line: 182, baseType: !97, size: 16, offset: 944)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "lastcursor", scope: !347, file: !331, line: 183, baseType: !97, size: 16, offset: 960)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "modalcursor", scope: !347, file: !331, line: 184, baseType: !97, size: 16, offset: 976)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "grabcursor", scope: !347, file: !331, line: 185, baseType: !97, size: 16, offset: 992)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "addmousemove", scope: !347, file: !331, line: 186, baseType: !97, size: 16, offset: 1008)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "winid", scope: !347, file: !331, line: 188, baseType: !48, size: 32, offset: 1024)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "lock_pie_event", scope: !347, file: !331, line: 190, baseType: !97, size: 16, offset: 1056)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "last_pie_event", scope: !347, file: !331, line: 191, baseType: !97, size: 16, offset: 1072)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "eventstate", scope: !347, file: !331, line: 194, baseType: !374, size: 64, offset: 1088)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmEvent", file: !341, line: 421, size: 960, elements: !376)
!376 = !{!377, !378, !379, !380, !381, !382, !383, !387, !391, !392, !393, !394, !395, !396, !397, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !416, !417, !418, !419}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !375, file: !341, line: 422, baseType: !374, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !375, file: !341, line: 422, baseType: !374, size: 64, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !375, file: !341, line: 424, baseType: !97, size: 16, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !375, file: !341, line: 425, baseType: !97, size: 16, offset: 144)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !375, file: !341, line: 426, baseType: !48, size: 32, offset: 160)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !375, file: !341, line: 426, baseType: !48, size: 32, offset: 192)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "mval", scope: !375, file: !341, line: 427, baseType: !384, size: 64, offset: 224)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 64, elements: !385)
!385 = !{!386}
!386 = !DISubrange(count: 2)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_buf", scope: !375, file: !341, line: 428, baseType: !388, size: 48, offset: 288)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 48, elements: !389)
!389 = !{!390}
!390 = !DISubrange(count: 6)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !375, file: !341, line: 431, baseType: !84, size: 8, offset: 336)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !375, file: !341, line: 432, baseType: !84, size: 8, offset: 344)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "prevtype", scope: !375, file: !341, line: 435, baseType: !97, size: 16, offset: 352)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "prevval", scope: !375, file: !341, line: 436, baseType: !97, size: 16, offset: 368)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "prevx", scope: !375, file: !341, line: 437, baseType: !48, size: 32, offset: 384)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "prevy", scope: !375, file: !341, line: 437, baseType: !48, size: 32, offset: 416)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicktime", scope: !375, file: !341, line: 438, baseType: !398, size: 64, offset: 448)
!398 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "prevclickx", scope: !375, file: !341, line: 439, baseType: !48, size: 32, offset: 512)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicky", scope: !375, file: !341, line: 439, baseType: !48, size: 32, offset: 544)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !375, file: !341, line: 442, baseType: !97, size: 16, offset: 576)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !375, file: !341, line: 442, baseType: !97, size: 16, offset: 592)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !375, file: !341, line: 442, baseType: !97, size: 16, offset: 608)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "oskey", scope: !375, file: !341, line: 442, baseType: !97, size: 16, offset: 624)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "keymodifier", scope: !375, file: !341, line: 443, baseType: !97, size: 16, offset: 640)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "check_click", scope: !375, file: !341, line: 446, baseType: !97, size: 16, offset: 656)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "keymap_idname", scope: !375, file: !341, line: 449, baseType: !193, size: 64, offset: 704)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "tablet_data", scope: !375, file: !341, line: 452, baseType: !409, size: 64, offset: 768)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTabletData", file: !341, line: 463, size: 128, elements: !411)
!411 = !{!412, !413, !414, !415}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "Active", scope: !410, file: !341, line: 464, baseType: !48, size: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "Pressure", scope: !410, file: !341, line: 465, baseType: !151, size: 32, offset: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "Xtilt", scope: !410, file: !341, line: 466, baseType: !151, size: 32, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "Ytilt", scope: !410, file: !341, line: 467, baseType: !151, size: 32, offset: 96)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "custom", scope: !375, file: !341, line: 455, baseType: !97, size: 16, offset: 832)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "customdatafree", scope: !375, file: !341, line: 456, baseType: !97, size: 16, offset: 848)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !375, file: !341, line: 457, baseType: !48, size: 32, offset: 864)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !375, file: !341, line: 458, baseType: !68, size: 64, offset: 896)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "curswin", scope: !347, file: !331, line: 196, baseType: !421, size: 64, offset: 1152)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmSubWindow", file: !331, line: 55, flags: DIFlagFwdDecl)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "tweak", scope: !347, file: !331, line: 198, baseType: !424, size: 64, offset: 1216)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmGesture", file: !341, line: 398, size: 448, elements: !426)
!426 = !{!427, !428, !429, !430, !431, !432, !433, !434, !435, !436}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !425, file: !341, line: 399, baseType: !424, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !425, file: !341, line: 399, baseType: !424, size: 64, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !425, file: !341, line: 400, baseType: !48, size: 32, offset: 128)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !425, file: !341, line: 401, baseType: !48, size: 32, offset: 160)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !425, file: !341, line: 402, baseType: !48, size: 32, offset: 192)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "swinid", scope: !425, file: !341, line: 403, baseType: !48, size: 32, offset: 224)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !425, file: !341, line: 404, baseType: !48, size: 32, offset: 256)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !425, file: !341, line: 405, baseType: !48, size: 32, offset: 288)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !425, file: !341, line: 407, baseType: !68, size: 64, offset: 320)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !425, file: !341, line: 414, baseType: !68, size: 64, offset: 384)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "drawmethod", scope: !347, file: !331, line: 200, baseType: !48, size: 32, offset: 1280)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "drawfail", scope: !347, file: !331, line: 200, baseType: !48, size: 32, offset: 1312)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "drawdata", scope: !347, file: !331, line: 201, baseType: !68, size: 64, offset: 1344)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !347, file: !331, line: 203, baseType: !123, size: 128, offset: 1408)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !347, file: !331, line: 204, baseType: !123, size: 128, offset: 1536)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "modalhandlers", scope: !347, file: !331, line: 205, baseType: !123, size: 128, offset: 1664)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "subwindows", scope: !347, file: !331, line: 207, baseType: !123, size: 128, offset: 1792)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "gesture", scope: !347, file: !331, line: 208, baseType: !123, size: 128, offset: 1920)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "timestep", scope: !340, file: !341, line: 495, baseType: !398, size: 64, offset: 192)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !340, file: !341, line: 496, baseType: !48, size: 32, offset: 256)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !340, file: !341, line: 497, baseType: !68, size: 64, offset: 320)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !340, file: !341, line: 499, baseType: !398, size: 64, offset: 384)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !340, file: !341, line: 500, baseType: !398, size: 64, offset: 448)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "ltime", scope: !340, file: !341, line: 502, baseType: !398, size: 64, offset: 512)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "ntime", scope: !340, file: !341, line: 503, baseType: !398, size: 64, offset: 576)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !340, file: !341, line: 504, baseType: !398, size: 64, offset: 640)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "sleep", scope: !340, file: !341, line: 505, baseType: !48, size: 32, offset: 704)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructValidateFunc", file: !6, line: 407, baseType: !455)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DISubroutineType(types: !457)
!457 = !{!48, !209, !68, !458}
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !6, line: 408, baseType: !460)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DISubroutineType(types: !462)
!462 = !{!48, !463, !209, !465, !479}
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !6, line: 44, flags: DIFlagFwdDecl)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !181, line: 137, size: 640, elements: !467)
!467 = !{!468, !469, !470, !471, !472, !488}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !466, file: !181, line: 139, baseType: !221, size: 320)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !466, file: !181, line: 142, baseType: !193, size: 64, offset: 320)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !466, file: !181, line: 144, baseType: !48, size: 32, offset: 384)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !466, file: !181, line: 147, baseType: !193, size: 64, offset: 448)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !466, file: !181, line: 150, baseType: !473, size: 64, offset: 512)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "CallFunc", file: !6, line: 388, baseType: !474)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DISubroutineType(types: !476)
!476 = !{null, !463, !329, !477, !479}
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "PointerRNA", file: !6, line: 62, baseType: !210)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !6, line: 348, baseType: !481)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !6, line: 337, size: 256, elements: !482)
!482 = !{!483, !484, !485, !486, !487}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !481, file: !6, line: 339, baseType: !68, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !481, file: !6, line: 342, baseType: !465, size: 64, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !481, file: !6, line: 345, baseType: !48, size: 32, offset: 128)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !481, file: !6, line: 347, baseType: !48, size: 32, offset: 160)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !481, file: !6, line: 347, baseType: !48, size: 32, offset: 192)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "c_ret", scope: !466, file: !181, line: 154, baseType: !239, size: 64, offset: 576)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !6, line: 409, baseType: !490)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DISubroutineType(types: !492)
!492 = !{null, !68}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "unreg", scope: !218, file: !181, line: 386, baseType: !494, size: 64, offset: 1280)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructUnregisterFunc", file: !6, line: 414, baseType: !495)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DISubroutineType(types: !497)
!497 = !{null, !259, !217}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !218, file: !181, line: 387, baseType: !499, size: 64, offset: 1344)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructInstanceFunc", file: !6, line: 415, baseType: !500)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DISubroutineType(types: !502)
!502 = !{!503, !477}
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "idproperties", scope: !218, file: !181, line: 390, baseType: !505, size: 64, offset: 1408)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertiesFunc", file: !181, line: 69, baseType: !506)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DISubroutineType(types: !508)
!508 = !{!107, !209, !509}
!509 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "functions", scope: !218, file: !181, line: 393, baseType: !123, size: 128, offset: 1472)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !210, file: !6, line: 61, baseType: !68, size: 64, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "arraydimension", scope: !186, file: !181, line: 184, baseType: !7, size: 32, offset: 704)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !186, file: !181, line: 186, baseType: !514, size: 96, offset: 736)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 96, elements: !175)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "totarraylength", scope: !186, file: !181, line: 187, baseType: !7, size: 32, offset: 832)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !186, file: !181, line: 190, baseType: !517, size: 64, offset: 896)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "UpdateFunc", file: !181, line: 64, baseType: !518)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DISubroutineType(types: !520)
!520 = !{null, !259, !521, !209}
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !136, line: 1216, size: 39680, elements: !523)
!523 = !{!524, !525, !526, !529, !532, !533, !534, !546, !547, !549, !550, !551, !552, !553, !554, !555, !556, !557, !561, !564, !567, !794, !797, !1096, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1118, !1119, !1120, !1121, !1122, !1130, !1196, !1203, !1206, !1213, !1216, !1217, !1218, !1219, !1220, !1225}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !522, file: !136, line: 1217, baseType: !63, size: 960)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !522, file: !136, line: 1218, baseType: !134, size: 64, offset: 960)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !522, file: !136, line: 1220, baseType: !527, size: 64, offset: 1024)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !136, line: 50, flags: DIFlagFwdDecl)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !522, file: !136, line: 1221, baseType: !530, size: 64, offset: 1088)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !136, line: 52, flags: DIFlagFwdDecl)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !522, file: !136, line: 1223, baseType: !521, size: 64, offset: 1152)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !522, file: !136, line: 1225, baseType: !123, size: 128, offset: 1216)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !522, file: !136, line: 1226, baseType: !535, size: 64, offset: 1344)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !136, line: 69, size: 320, elements: !537)
!537 = !{!538, !539, !540, !541, !542, !543, !544, !545}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !536, file: !136, line: 70, baseType: !535, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !536, file: !136, line: 70, baseType: !535, size: 64, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !536, file: !136, line: 71, baseType: !7, size: 32, offset: 128)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !536, file: !136, line: 71, baseType: !7, size: 32, offset: 160)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !536, file: !136, line: 72, baseType: !48, size: 32, offset: 192)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !536, file: !136, line: 73, baseType: !97, size: 16, offset: 224)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !536, file: !136, line: 73, baseType: !97, size: 16, offset: 240)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !536, file: !136, line: 74, baseType: !527, size: 64, offset: 256)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !522, file: !136, line: 1227, baseType: !527, size: 64, offset: 1408)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !522, file: !136, line: 1229, baseType: !548, size: 96, offset: 1472)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 96, elements: !175)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !522, file: !136, line: 1230, baseType: !548, size: 96, offset: 1568)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !522, file: !136, line: 1231, baseType: !548, size: 96, offset: 1664)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !522, file: !136, line: 1231, baseType: !548, size: 96, offset: 1760)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !522, file: !136, line: 1233, baseType: !7, size: 32, offset: 1856)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !522, file: !136, line: 1234, baseType: !48, size: 32, offset: 1888)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !522, file: !136, line: 1235, baseType: !7, size: 32, offset: 1920)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !522, file: !136, line: 1237, baseType: !97, size: 16, offset: 1952)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !522, file: !136, line: 1239, baseType: !84, size: 8, offset: 1968)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !522, file: !136, line: 1240, baseType: !558, size: 8, offset: 1976)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 8, elements: !559)
!559 = !{!560}
!560 = !DISubrange(count: 1)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !522, file: !136, line: 1242, baseType: !562, size: 64, offset: 1984)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !136, line: 57, flags: DIFlagFwdDecl)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !522, file: !136, line: 1244, baseType: !565, size: 64, offset: 2048)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !136, line: 59, flags: DIFlagFwdDecl)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !522, file: !136, line: 1246, baseType: !568, size: 64, offset: 2112)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !136, line: 1067, size: 5184, elements: !570)
!570 = !{!571, !603, !604, !619, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !641, !660, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !711, !712, !713, !714, !715, !716, !717, !718, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !777}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !569, file: !136, line: 1068, baseType: !572, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !136, line: 934, baseType: !574)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !136, line: 925, size: 576, elements: !575)
!575 = !{!576, !594, !595, !596, !597, !599, !602}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !574, file: !136, line: 926, baseType: !577, size: 320)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !136, line: 830, baseType: !578)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !136, line: 813, size: 320, elements: !579)
!579 = !{!580, !583, !586, !587, !591, !592, !593}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !578, file: !136, line: 814, baseType: !581, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !136, line: 51, flags: DIFlagFwdDecl)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !578, file: !136, line: 815, baseType: !584, size: 64, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !136, line: 815, flags: DIFlagFwdDecl)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !578, file: !136, line: 818, baseType: !68, size: 64, offset: 128)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !578, file: !136, line: 819, baseType: !588, size: 32, offset: 192)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !509, size: 32, elements: !589)
!589 = !{!590}
!590 = !DISubrange(count: 4)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !578, file: !136, line: 822, baseType: !48, size: 32, offset: 224)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !578, file: !136, line: 826, baseType: !48, size: 32, offset: 256)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !578, file: !136, line: 829, baseType: !48, size: 32, offset: 288)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !574, file: !136, line: 928, baseType: !97, size: 16, offset: 320)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !574, file: !136, line: 928, baseType: !97, size: 16, offset: 336)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !574, file: !136, line: 929, baseType: !48, size: 32, offset: 352)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !574, file: !136, line: 930, baseType: !598, size: 64, offset: 384)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !574, file: !136, line: 931, baseType: !600, size: 64, offset: 448)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !136, line: 931, flags: DIFlagFwdDecl)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !574, file: !136, line: 933, baseType: !68, size: 64, offset: 512)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !569, file: !136, line: 1069, baseType: !572, size: 64, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !569, file: !136, line: 1070, baseType: !605, size: 64, offset: 128)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !136, line: 916, baseType: !607)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !136, line: 891, size: 704, elements: !608)
!608 = !{!609, !610, !611, !613, !614, !615, !616, !617, !618}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !607, file: !136, line: 892, baseType: !577, size: 320)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !607, file: !136, line: 896, baseType: !48, size: 32, offset: 320)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !607, file: !136, line: 900, baseType: !612, size: 96, offset: 352)
!612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 96, elements: !175)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !607, file: !136, line: 903, baseType: !151, size: 32, offset: 448)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !607, file: !136, line: 906, baseType: !48, size: 32, offset: 480)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !607, file: !136, line: 909, baseType: !151, size: 32, offset: 512)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !607, file: !136, line: 912, baseType: !151, size: 32, offset: 544)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !607, file: !136, line: 914, baseType: !527, size: 64, offset: 576)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !607, file: !136, line: 915, baseType: !68, size: 64, offset: 640)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !569, file: !136, line: 1071, baseType: !620, size: 64, offset: 192)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !136, line: 920, baseType: !622)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !136, line: 918, size: 320, elements: !623)
!623 = !{!624}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !622, file: !136, line: 919, baseType: !577, size: 320)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !569, file: !136, line: 1075, baseType: !151, size: 32, offset: 256)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !569, file: !136, line: 1077, baseType: !151, size: 32, offset: 288)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !569, file: !136, line: 1078, baseType: !151, size: 32, offset: 320)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !569, file: !136, line: 1079, baseType: !97, size: 16, offset: 352)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !569, file: !136, line: 1082, baseType: !97, size: 16, offset: 368)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !569, file: !136, line: 1085, baseType: !84, size: 8, offset: 384)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !569, file: !136, line: 1086, baseType: !84, size: 8, offset: 392)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !569, file: !136, line: 1087, baseType: !84, size: 8, offset: 400)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !569, file: !136, line: 1088, baseType: !84, size: 8, offset: 408)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !569, file: !136, line: 1090, baseType: !151, size: 32, offset: 416)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !569, file: !136, line: 1093, baseType: !97, size: 16, offset: 448)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !569, file: !136, line: 1096, baseType: !84, size: 8, offset: 464)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !569, file: !136, line: 1098, baseType: !638, size: 40, offset: 472)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 40, elements: !639)
!639 = !{!640}
!640 = !DISubrange(count: 5)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !569, file: !136, line: 1101, baseType: !642, size: 832, offset: 512)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !136, line: 836, size: 832, elements: !643)
!643 = !{!644, !645, !646, !647, !648, !649, !651, !652, !653, !656, !657, !658, !659}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !642, file: !136, line: 837, baseType: !577, size: 320)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !642, file: !136, line: 839, baseType: !97, size: 16, offset: 320)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !642, file: !136, line: 839, baseType: !97, size: 16, offset: 336)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !642, file: !136, line: 842, baseType: !97, size: 16, offset: 352)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !642, file: !136, line: 842, baseType: !97, size: 16, offset: 368)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !642, file: !136, line: 843, baseType: !650, size: 32, offset: 384)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 32, elements: !385)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !642, file: !136, line: 845, baseType: !48, size: 32, offset: 416)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !642, file: !136, line: 847, baseType: !68, size: 64, offset: 448)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !642, file: !136, line: 848, baseType: !654, size: 64, offset: 512)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !136, line: 54, flags: DIFlagFwdDecl)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !642, file: !136, line: 849, baseType: !654, size: 64, offset: 576)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "canvas", scope: !642, file: !136, line: 850, baseType: !654, size: 64, offset: 640)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "stencil_col", scope: !642, file: !136, line: 851, baseType: !548, size: 96, offset: 704)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !642, file: !136, line: 852, baseType: !151, size: 32, offset: 800)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !569, file: !136, line: 1104, baseType: !661, size: 1344, offset: 1344)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleEditSettings", file: !136, line: 867, size: 1344, elements: !662)
!662 = !{!663, !664, !665, !666, !667, !680, !681, !682, !683, !684, !685, !686, !687, !688}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !661, file: !136, line: 868, baseType: !97, size: 16)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "totrekey", scope: !661, file: !136, line: 869, baseType: !97, size: 16, offset: 16)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "totaddkey", scope: !661, file: !136, line: 870, baseType: !97, size: 16, offset: 32)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "brushtype", scope: !661, file: !136, line: 871, baseType: !97, size: 16, offset: 48)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !661, file: !136, line: 873, baseType: !668, size: 896, offset: 64)
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !669, size: 896, elements: !678)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParticleBrushData", file: !136, line: 864, baseType: !670)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleBrushData", file: !136, line: 859, size: 128, elements: !671)
!671 = !{!672, !673, !674, !675, !676, !677}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !670, file: !136, line: 860, baseType: !97, size: 16)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !670, file: !136, line: 861, baseType: !97, size: 16, offset: 16)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !670, file: !136, line: 861, baseType: !97, size: 16, offset: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !670, file: !136, line: 861, baseType: !97, size: 16, offset: 48)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !670, file: !136, line: 862, baseType: !48, size: 32, offset: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !670, file: !136, line: 863, baseType: !151, size: 32, offset: 96)
!678 = !{!679}
!679 = !DISubrange(count: 7)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !661, file: !136, line: 874, baseType: !68, size: 64, offset: 960)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "emitterdist", scope: !661, file: !136, line: 876, baseType: !151, size: 32, offset: 1024)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !661, file: !136, line: 876, baseType: !151, size: 32, offset: 1056)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !661, file: !136, line: 878, baseType: !48, size: 32, offset: 1088)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "edittype", scope: !661, file: !136, line: 879, baseType: !48, size: 32, offset: 1120)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "draw_step", scope: !661, file: !136, line: 881, baseType: !48, size: 32, offset: 1152)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "fade_frames", scope: !661, file: !136, line: 881, baseType: !48, size: 32, offset: 1184)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !661, file: !136, line: 883, baseType: !521, size: 64, offset: 1216)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !661, file: !136, line: 884, baseType: !527, size: 64, offset: 1280)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_size", scope: !569, file: !136, line: 1107, baseType: !151, size: 32, offset: 2688)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "select_thresh", scope: !569, file: !136, line: 1110, baseType: !151, size: 32, offset: 2720)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_mode", scope: !569, file: !136, line: 1113, baseType: !97, size: 16, offset: 2752)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_flag", scope: !569, file: !136, line: 1113, baseType: !97, size: 16, offset: 2768)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "multires_subdiv_type", scope: !569, file: !136, line: 1116, baseType: !84, size: 8, offset: 2784)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !569, file: !136, line: 1117, baseType: !558, size: 8, offset: 2792)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_resolution", scope: !569, file: !136, line: 1120, baseType: !97, size: 16, offset: 2800)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_internal", scope: !569, file: !136, line: 1121, baseType: !151, size: 32, offset: 2816)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_external", scope: !569, file: !136, line: 1122, baseType: !151, size: 32, offset: 2848)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_ratio", scope: !569, file: !136, line: 1123, baseType: !151, size: 32, offset: 2880)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_limit", scope: !569, file: !136, line: 1124, baseType: !151, size: 32, offset: 2912)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_angle_limit", scope: !569, file: !136, line: 1125, baseType: !151, size: 32, offset: 2944)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_correlation_limit", scope: !569, file: !136, line: 1126, baseType: !151, size: 32, offset: 2976)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_symmetry_limit", scope: !569, file: !136, line: 1127, baseType: !151, size: 32, offset: 3008)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_angle_weight", scope: !569, file: !136, line: 1128, baseType: !151, size: 32, offset: 3040)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_length_weight", scope: !569, file: !136, line: 1129, baseType: !151, size: 32, offset: 3072)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_distance_weight", scope: !569, file: !136, line: 1130, baseType: !151, size: 32, offset: 3104)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_options", scope: !569, file: !136, line: 1131, baseType: !97, size: 16, offset: 3136)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro", scope: !569, file: !136, line: 1132, baseType: !84, size: 8, offset: 3152)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro_passes", scope: !569, file: !136, line: 1133, baseType: !84, size: 8, offset: 3160)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivisions", scope: !569, file: !136, line: 1134, baseType: !710, size: 24, offset: 3168)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 24, elements: !175)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_multi_level", scope: !569, file: !136, line: 1135, baseType: !84, size: 8, offset: 3192)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_template", scope: !569, file: !136, line: 1138, baseType: !527, size: 64, offset: 3200)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching", scope: !569, file: !136, line: 1139, baseType: !84, size: 8, offset: 3264)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching_convert", scope: !569, file: !136, line: 1140, baseType: !84, size: 8, offset: 3272)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivision_number", scope: !569, file: !136, line: 1141, baseType: !84, size: 8, offset: 3280)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_options", scope: !569, file: !136, line: 1142, baseType: !84, size: 8, offset: 3288)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_roll", scope: !569, file: !136, line: 1143, baseType: !84, size: 8, offset: 3296)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_side_string", scope: !569, file: !136, line: 1144, baseType: !719, size: 64, offset: 3304)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 64, elements: !720)
!720 = !{!721}
!721 = !DISubrange(count: 8)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_num_string", scope: !569, file: !136, line: 1145, baseType: !719, size: 64, offset: 3368)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode", scope: !569, file: !136, line: 1148, baseType: !84, size: 8, offset: 3432)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode_live_unwrap", scope: !569, file: !136, line: 1149, baseType: !84, size: 8, offset: 3440)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "snap_mode", scope: !569, file: !136, line: 1152, baseType: !84, size: 8, offset: 3448)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "snap_node_mode", scope: !569, file: !136, line: 1152, baseType: !84, size: 8, offset: 3456)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "snap_uv_mode", scope: !569, file: !136, line: 1153, baseType: !84, size: 8, offset: 3464)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "snap_flag", scope: !569, file: !136, line: 1154, baseType: !97, size: 16, offset: 3472)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "snap_target", scope: !569, file: !136, line: 1154, baseType: !97, size: 16, offset: 3488)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "proportional", scope: !569, file: !136, line: 1155, baseType: !97, size: 16, offset: 3504)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "prop_mode", scope: !569, file: !136, line: 1155, baseType: !97, size: 16, offset: 3520)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_objects", scope: !569, file: !136, line: 1156, baseType: !84, size: 8, offset: 3536)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_mask", scope: !569, file: !136, line: 1157, baseType: !84, size: 8, offset: 3544)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "auto_normalize", scope: !569, file: !136, line: 1159, baseType: !84, size: 8, offset: 3552)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "multipaint", scope: !569, file: !136, line: 1160, baseType: !84, size: 8, offset: 3560)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "weightuser", scope: !569, file: !136, line: 1161, baseType: !84, size: 8, offset: 3568)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "vgroupsubset", scope: !569, file: !136, line: 1162, baseType: !84, size: 8, offset: 3576)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "use_uv_sculpt", scope: !569, file: !136, line: 1165, baseType: !48, size: 32, offset: 3584)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "uv_sculpt_settings", scope: !569, file: !136, line: 1166, baseType: !48, size: 32, offset: 3616)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "uv_sculpt_tool", scope: !569, file: !136, line: 1167, baseType: !48, size: 32, offset: 3648)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "uv_relax_method", scope: !569, file: !136, line: 1168, baseType: !48, size: 32, offset: 3680)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_settings", scope: !569, file: !136, line: 1171, baseType: !97, size: 16, offset: 3712)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "pad5", scope: !569, file: !136, line: 1171, baseType: !97, size: 16, offset: 3728)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_size", scope: !569, file: !136, line: 1172, baseType: !48, size: 32, offset: 3744)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_unprojected_radius", scope: !569, file: !136, line: 1173, baseType: !151, size: 32, offset: 3776)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_alpha", scope: !569, file: !136, line: 1174, baseType: !151, size: 32, offset: 3808)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "unified_paint_settings", scope: !569, file: !136, line: 1177, baseType: !748, size: 1024, offset: 3840)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UnifiedPaintSettings", file: !136, line: 963, size: 1024, elements: !749)
!749 = !{!750, !751, !752, !753, !754, !755, !756, !757, !759, !760, !761, !762, !763, !765, !766, !767, !768, !769, !770, !771, !772, !775, !776}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !748, file: !136, line: 965, baseType: !48, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "unprojected_radius", scope: !748, file: !136, line: 968, baseType: !151, size: 32, offset: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !748, file: !136, line: 971, baseType: !151, size: 32, offset: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !748, file: !136, line: 974, baseType: !151, size: 32, offset: 96)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "rgb", scope: !748, file: !136, line: 977, baseType: !548, size: 96, offset: 128)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "secondary_rgb", scope: !748, file: !136, line: 979, baseType: !548, size: 96, offset: 224)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !748, file: !136, line: 982, baseType: !48, size: 32, offset: 320)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "last_rake", scope: !748, file: !136, line: 987, baseType: !758, size: 64, offset: 352)
!758 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 64, elements: !385)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "brush_rotation", scope: !748, file: !136, line: 989, baseType: !151, size: 32, offset: 416)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "draw_anchored", scope: !748, file: !136, line: 994, baseType: !48, size: 32, offset: 448)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "anchored_size", scope: !748, file: !136, line: 995, baseType: !48, size: 32, offset: 480)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "draw_inverted", scope: !748, file: !136, line: 997, baseType: !84, size: 8, offset: 512)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !748, file: !136, line: 998, baseType: !764, size: 56, offset: 520)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 56, elements: !678)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "overlap_factor", scope: !748, file: !136, line: 1000, baseType: !151, size: 32, offset: 576)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "anchored_initial_mouse", scope: !748, file: !136, line: 1003, baseType: !758, size: 64, offset: 608)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "stroke_active", scope: !748, file: !136, line: 1006, baseType: !48, size: 32, offset: 672)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "size_pressure_value", scope: !748, file: !136, line: 1009, baseType: !151, size: 32, offset: 704)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "tex_mouse", scope: !748, file: !136, line: 1012, baseType: !758, size: 64, offset: 736)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "mask_tex_mouse", scope: !748, file: !136, line: 1015, baseType: !758, size: 64, offset: 800)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "do_linear_conversion", scope: !748, file: !136, line: 1018, baseType: !48, size: 32, offset: 864)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !748, file: !136, line: 1019, baseType: !773, size: 64, offset: 896)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !136, line: 63, flags: DIFlagFwdDecl)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_radius", scope: !748, file: !136, line: 1023, baseType: !151, size: 32, offset: 960)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "pad4", scope: !748, file: !136, line: 1024, baseType: !48, size: 32, offset: 992)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "statvis", scope: !569, file: !136, line: 1179, baseType: !778, size: 320, offset: 4864)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MeshStatVis", file: !136, line: 1043, size: 320, elements: !779)
!779 = !{!780, !781, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !778, file: !136, line: 1044, baseType: !84, size: 8)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_pad1", scope: !778, file: !136, line: 1045, baseType: !782, size: 16, offset: 8)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 16, elements: !385)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_axis", scope: !778, file: !136, line: 1048, baseType: !84, size: 8, offset: 24)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_min", scope: !778, file: !136, line: 1049, baseType: !151, size: 32, offset: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_max", scope: !778, file: !136, line: 1049, baseType: !151, size: 32, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_min", scope: !778, file: !136, line: 1052, baseType: !151, size: 32, offset: 96)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_max", scope: !778, file: !136, line: 1052, baseType: !151, size: 32, offset: 128)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_samples", scope: !778, file: !136, line: 1053, baseType: !84, size: 8, offset: 160)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_pad2", scope: !778, file: !136, line: 1054, baseType: !710, size: 24, offset: 168)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "distort_min", scope: !778, file: !136, line: 1057, baseType: !151, size: 32, offset: 192)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "distort_max", scope: !778, file: !136, line: 1057, baseType: !151, size: 32, offset: 224)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "sharp_min", scope: !778, file: !136, line: 1060, baseType: !151, size: 32, offset: 256)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "sharp_max", scope: !778, file: !136, line: 1060, baseType: !151, size: 32, offset: 288)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !522, file: !136, line: 1247, baseType: !795, size: 64, offset: 2176)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DICompositeType(tag: DW_TAG_structure_type, name: "SceneStats", file: !136, line: 60, flags: DIFlagFwdDecl)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !522, file: !136, line: 1251, baseType: !798, size: 31872, offset: 2240)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderData", file: !136, line: 403, size: 31872, elements: !799)
!799 = !{!800, !881, !901, !910, !930, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1044, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1072, !1073, !1074, !1078, !1094, !1095}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "im_format", scope: !798, file: !136, line: 404, baseType: !801, size: 1984)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageFormatData", file: !136, line: 259, size: 1984, elements: !802)
!802 = !{!803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !876}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "imtype", scope: !801, file: !136, line: 260, baseType: !84, size: 8)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !801, file: !136, line: 263, baseType: !84, size: 8, offset: 8)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !801, file: !136, line: 266, baseType: !84, size: 8, offset: 16)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !801, file: !136, line: 267, baseType: !84, size: 8, offset: 24)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !801, file: !136, line: 269, baseType: !84, size: 8, offset: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "compress", scope: !801, file: !136, line: 270, baseType: !84, size: 8, offset: 40)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "exr_codec", scope: !801, file: !136, line: 276, baseType: !84, size: 8, offset: 48)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_flag", scope: !801, file: !136, line: 279, baseType: !84, size: 8, offset: 56)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_white", scope: !801, file: !136, line: 280, baseType: !97, size: 16, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_black", scope: !801, file: !136, line: 280, baseType: !97, size: 16, offset: 80)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_gamma", scope: !801, file: !136, line: 281, baseType: !151, size: 32, offset: 96)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "jp2_flag", scope: !801, file: !136, line: 284, baseType: !84, size: 8, offset: 128)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "jp2_codec", scope: !801, file: !136, line: 285, baseType: !84, size: 8, offset: 136)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !801, file: !136, line: 287, baseType: !388, size: 48, offset: 144)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "view_settings", scope: !801, file: !136, line: 290, baseType: !818, size: 1280, offset: 192)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedViewSettings", file: !819, line: 174, baseType: !820)
!819 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedViewSettings", file: !819, line: 166, size: 1280, elements: !821)
!821 = !{!822, !823, !824, !825, !826, !827, !828, !875}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !820, file: !819, line: 167, baseType: !48, size: 32)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !820, file: !819, line: 167, baseType: !48, size: 32, offset: 32)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "look", scope: !820, file: !819, line: 168, baseType: !113, size: 512, offset: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "view_transform", scope: !820, file: !819, line: 169, baseType: !113, size: 512, offset: 576)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !820, file: !819, line: 170, baseType: !151, size: 32, offset: 1088)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !820, file: !819, line: 171, baseType: !151, size: 32, offset: 1120)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "curve_mapping", scope: !820, file: !819, line: 172, baseType: !829, size: 64, offset: 1152)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapping", file: !819, line: 72, size: 3072, elements: !831)
!831 = !{!832, !833, !834, !835, !836, !845, !846, !871, !872, !873, !874}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !830, file: !819, line: 73, baseType: !48, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !830, file: !819, line: 73, baseType: !48, size: 32, offset: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "preset", scope: !830, file: !819, line: 74, baseType: !48, size: 32, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !830, file: !819, line: 75, baseType: !48, size: 32, offset: 96)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !830, file: !819, line: 77, baseType: !837, size: 128, offset: 128)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !838, line: 95, baseType: !839)
!838 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !838, line: 92, size: 128, elements: !840)
!840 = !{!841, !842, !843, !844}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !839, file: !838, line: 93, baseType: !151, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !839, file: !838, line: 93, baseType: !151, size: 32, offset: 32)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !839, file: !838, line: 94, baseType: !151, size: 32, offset: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !839, file: !838, line: 94, baseType: !151, size: 32, offset: 96)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "clipr", scope: !830, file: !819, line: 77, baseType: !837, size: 128, offset: 256)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "cm", scope: !830, file: !819, line: 79, baseType: !847, size: 2304, offset: 384)
!847 = !DICompositeType(tag: DW_TAG_array_type, baseType: !848, size: 2304, elements: !589)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMap", file: !819, line: 67, baseType: !849)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMap", file: !819, line: 55, size: 576, elements: !850)
