; ModuleID = 'blender/source/blender/editors/object/object_select.c'
source_filename = "blender/source/blender/editors/object/object_select.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.Base = type { %struct.Base*, %struct.Base*, i32, i32, i32, i16, i16, %struct.Object* }

!938 = !DIEnumerator(name: "eModifierType_UVProject", value: 15, isUnsigned: true)
!939 = !DIEnumerator(name: "eModifierType_Smooth", value: 16, isUnsigned: true)
!940 = !DIEnumerator(name: "eModifierType_Cast", value: 17, isUnsigned: true)
!941 = !DIEnumerator(name: "eModifierType_MeshDeform", value: 18, isUnsigned: true)
!942 = !DIEnumerator(name: "eModifierType_ParticleSystem", value: 19, isUnsigned: true)
!943 = !DIEnumerator(name: "eModifierType_ParticleInstance", value: 20, isUnsigned: true)
!944 = !DIEnumerator(name: "eModifierType_Explode", value: 21, isUnsigned: true)
!945 = !DIEnumerator(name: "eModifierType_Cloth", value: 22, isUnsigned: true)
!946 = !DIEnumerator(name: "eModifierType_Collision", value: 23, isUnsigned: true)
!947 = !DIEnumerator(name: "eModifierType_Bevel", value: 24, isUnsigned: true)
!948 = !DIEnumerator(name: "eModifierType_Shrinkwrap", value: 25, isUnsigned: true)
!949 = !DIEnumerator(name: "eModifierType_Fluidsim", value: 26, isUnsigned: true)
!950 = !DIEnumerator(name: "eModifierType_Mask", value: 27, isUnsigned: true)
!951 = !DIEnumerator(name: "eModifierType_SimpleDeform", value: 28, isUnsigned: true)
!952 = !DIEnumerator(name: "eModifierType_Multires", value: 29, isUnsigned: true)
!953 = !DIEnumerator(name: "eModifierType_Surface", value: 30, isUnsigned: true)
!954 = !DIEnumerator(name: "eModifierType_Smoke", value: 31, isUnsigned: true)
!955 = !DIEnumerator(name: "eModifierType_ShapeKey", value: 32, isUnsigned: true)
!956 = !DIEnumerator(name: "eModifierType_Solidify", value: 33, isUnsigned: true)
!957 = !DIEnumerator(name: "eModifierType_Screw", value: 34, isUnsigned: true)
!958 = !DIEnumerator(name: "eModifierType_Warp", value: 35, isUnsigned: true)
!959 = !DIEnumerator(name: "eModifierType_WeightVGEdit", value: 36, isUnsigned: true)
!960 = !DIEnumerator(name: "eModifierType_WeightVGMix", value: 37, isUnsigned: true)
!961 = !DIEnumerator(name: "eModifierType_WeightVGProximity", value: 38, isUnsigned: true)
!962 = !DIEnumerator(name: "eModifierType_Ocean", value: 39, isUnsigned: true)
!963 = !DIEnumerator(name: "eModifierType_DynamicPaint", value: 40, isUnsigned: true)
!964 = !DIEnumerator(name: "eModifierType_Remesh", value: 41, isUnsigned: true)
!965 = !DIEnumerator(name: "eModifierType_Skin", value: 42, isUnsigned: true)
!966 = !DIEnumerator(name: "eModifierType_LaplacianSmooth", value: 43, isUnsigned: true)
!967 = !DIEnumerator(name: "eModifierType_Triangulate", value: 44, isUnsigned: true)
!968 = !DIEnumerator(name: "eModifierType_UVWarp", value: 45, isUnsigned: true)
!969 = !DIEnumerator(name: "eModifierType_MeshCache", value: 46, isUnsigned: true)
!970 = !DIEnumerator(name: "eModifierType_LaplacianDeform", value: 47, isUnsigned: true)
!971 = !DIEnumerator(name: "eModifierType_Wireframe", value: 48, isUnsigned: true)
!972 = !DIEnumerator(name: "NUM_MODIFIER_TYPES", value: 49, isUnsigned: true)
!973 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eKS_Settings", file: !974, line: 780, baseType: !7, size: 32, elements: !975)
!974 = !DIFile(filename: "blender/source/blender/makesdna/DNA_anim_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!975 = !{!976, !977}
!976 = !DIEnumerator(name: "KEYINGSET_BUILTIN", value: 1, isUnsigned: true)
!977 = !DIEnumerator(name: "KEYINGSET_ABSOLUTE", value: 2, isUnsigned: true)
!978 = !{!979, !980, !982, !984, !2987, !1023, !1004, !2989, !3017, !3019}
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "Material", file: !986, line: 203, baseType: !987)
!986 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !986, line: 93, size: 7552, elements: !988)
!988 = !{!989, !1058, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1177, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1246, !1247, !1248, !1249, !1250, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !2946, !2947, !2948, !2949, !2950, !2951, !2952, !2953, !2954, !2955, !2956, !2957, !2958, !2959, !2960, !2961, !2962, !2963, !2964, !2965, !2966, !2967, !2968, !2969, !2970, !2971, !2972, !2973, !2974, !2975, !2976, !2977, !2978, !2986}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !987, file: !986, line: 94, baseType: !990, size: 960)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !991, line: 130, baseType: !992)
!991 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !991, line: 117, size: 960, elements: !993)
!993 = !{!994, !995, !996, !998, !1017, !1021, !1022, !1024, !1025, !1026}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !992, file: !991, line: 118, baseType: !979, size: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !992, file: !991, line: 118, baseType: !979, size: 64, offset: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !992, file: !991, line: 119, baseType: !997, size: 64, offset: 128)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !992, file: !991, line: 120, baseType: !999, size: 64, offset: 192)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !991, line: 136, size: 17600, elements: !1001)
!1001 = !{!1002, !1003, !1005, !1008, !1012, !1013, !1014}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1000, file: !991, line: 137, baseType: !990, size: 960)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !1000, file: !991, line: 138, baseType: !1004, size: 64, offset: 960)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !1000, file: !991, line: 139, baseType: !1006, size: 64, offset: 1024)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !991, line: 43, flags: DIFlagFwdDecl)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1000, file: !991, line: 140, baseType: !1009, size: 8192, offset: 1088)
!1009 = !DICompositeType(tag: DW_TAG_array_type, baseType: !981, size: 8192, elements: !1010)
!1010 = !{!1011}
!1011 = !DISubrange(count: 1024)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !1000, file: !991, line: 141, baseType: !1009, size: 8192, offset: 9280)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1000, file: !991, line: 148, baseType: !999, size: 64, offset: 17472)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1000, file: !991, line: 150, baseType: !1015, size: 64, offset: 17536)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1016 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !991, line: 45, flags: DIFlagFwdDecl)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !992, file: !991, line: 121, baseType: !1018, size: 528, offset: 256)
!1018 = !DICompositeType(tag: DW_TAG_array_type, baseType: !981, size: 528, elements: !1019)
!1019 = !{!1020}
!1020 = !DISubrange(count: 66)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !992, file: !991, line: 126, baseType: !983, size: 16, offset: 784)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !992, file: !991, line: 127, baseType: !1023, size: 32, offset: 800)
!1023 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !992, file: !991, line: 128, baseType: !1023, size: 32, offset: 832)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !992, file: !991, line: 128, baseType: !1023, size: 32, offset: 864)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !992, file: !991, line: 129, baseType: !1027, size: 64, offset: 896)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !991, line: 75, baseType: !1029)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !991, line: 62, size: 1024, elements: !1030)
!1030 = !{!1031, !1033, !1034, !1035, !1036, !1037, !1041, !1042, !1056, !1057}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1029, file: !991, line: 63, baseType: !1032, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1029, file: !991, line: 63, baseType: !1032, size: 64, offset: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1029, file: !991, line: 64, baseType: !981, size: 8, offset: 128)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1029, file: !991, line: 64, baseType: !981, size: 8, offset: 136)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1029, file: !991, line: 65, baseType: !983, size: 16, offset: 144)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1029, file: !991, line: 66, baseType: !1038, size: 512, offset: 160)
!1038 = !DICompositeType(tag: DW_TAG_array_type, baseType: !981, size: 512, elements: !1039)
!1039 = !{!1040}
!1040 = !DISubrange(count: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !1029, file: !991, line: 67, baseType: !1023, size: 32, offset: 672)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1029, file: !991, line: 69, baseType: !1043, size: 256, offset: 704)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !991, line: 60, baseType: !1044)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !991, line: 48, size: 256, elements: !1045)
!1045 = !{!1046, !1047, !1054, !1055}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1044, file: !991, line: 49, baseType: !979, size: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !1044, file: !991, line: 58, baseType: !1048, size: 128, offset: 64)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !1049, line: 71, baseType: !1050)
!1049 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !1049, line: 69, size: 128, elements: !1051)
!1051 = !{!1052, !1053}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1050, file: !1049, line: 70, baseType: !979, size: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1050, file: !1049, line: 70, baseType: !979, size: 64, offset: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1044, file: !991, line: 59, baseType: !1023, size: 32, offset: 192)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !1044, file: !991, line: 59, baseType: !1023, size: 32, offset: 224)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1029, file: !991, line: 70, baseType: !1023, size: 32, offset: 960)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !1029, file: !991, line: 74, baseType: !1023, size: 32, offset: 992)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !987, file: !986, line: 95, baseType: !1059, size: 64, offset: 960)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !974, line: 838, size: 768, elements: !1061)
!1061 = !{!1062, !1077, !1078, !1088, !1089, !1121, !1122, !1123, !1124, !1125, !1126, !1127}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !1060, file: !974, line: 840, baseType: !1063, size: 64)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !1065, line: 499, baseType: !1066)
!1065 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !1065, line: 486, size: 1600, elements: !1067)
!1067 = !{!1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1066, file: !1065, line: 487, baseType: !990, size: 960)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !1066, file: !1065, line: 489, baseType: !1048, size: 128, offset: 960)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !1066, file: !1065, line: 490, baseType: !1048, size: 128, offset: 1088)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !1066, file: !1065, line: 491, baseType: !1048, size: 128, offset: 1216)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1066, file: !1065, line: 492, baseType: !1048, size: 128, offset: 1344)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1066, file: !1065, line: 494, baseType: !1023, size: 32, offset: 1472)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !1066, file: !1065, line: 495, baseType: !1023, size: 32, offset: 1504)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !1066, file: !1065, line: 497, baseType: !1023, size: 32, offset: 1536)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1066, file: !1065, line: 498, baseType: !1023, size: 32, offset: 1568)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !1060, file: !974, line: 844, baseType: !1063, size: 64, offset: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !1060, file: !974, line: 848, baseType: !1079, size: 64, offset: 128)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64)
!1080 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !974, line: 549, baseType: !1081)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !974, line: 544, size: 320, elements: !1082)
!1082 = !{!1083, !1085, !1086, !1087}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1081, file: !974, line: 545, baseType: !1084, size: 64)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1081, file: !974, line: 545, baseType: !1084, size: 64, offset: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !1081, file: !974, line: 547, baseType: !1063, size: 64, offset: 128)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !1081, file: !974, line: 548, baseType: !1048, size: 128, offset: 192)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !1060, file: !974, line: 851, baseType: !1048, size: 128, offset: 192)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !1060, file: !974, line: 853, baseType: !1090, size: 64, offset: 320)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !974, line: 594, baseType: !1092)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !974, line: 561, size: 1664, elements: !1093)
!1093 = !{!1094, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1092, file: !974, line: 562, baseType: !1095, size: 64)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1092, file: !974, line: 562, baseType: !1095, size: 64, offset: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !1092, file: !974, line: 564, baseType: !1048, size: 128, offset: 128)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !1092, file: !974, line: 565, baseType: !1063, size: 64, offset: 256)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !1092, file: !974, line: 566, baseType: !1079, size: 64, offset: 320)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !1092, file: !974, line: 568, baseType: !1048, size: 128, offset: 384)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !1092, file: !974, line: 569, baseType: !1048, size: 128, offset: 512)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1092, file: !974, line: 571, baseType: !1038, size: 512, offset: 640)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !1092, file: !974, line: 573, baseType: !1104, size: 32, offset: 1152)
!1104 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "strip_time", scope: !1092, file: !974, line: 574, baseType: !1104, size: 32, offset: 1184)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1092, file: !974, line: 576, baseType: !1104, size: 32, offset: 1216)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !1092, file: !974, line: 576, baseType: !1104, size: 32, offset: 1248)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "actstart", scope: !1092, file: !974, line: 577, baseType: !1104, size: 32, offset: 1280)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "actend", scope: !1092, file: !974, line: 577, baseType: !1104, size: 32, offset: 1312)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !1092, file: !974, line: 579, baseType: !1104, size: 32, offset: 1344)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1092, file: !974, line: 580, baseType: !1104, size: 32, offset: 1376)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !1092, file: !974, line: 582, baseType: !1104, size: 32, offset: 1408)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !1092, file: !974, line: 582, baseType: !1104, size: 32, offset: 1440)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "blendmode", scope: !1092, file: !974, line: 583, baseType: !983, size: 16, offset: 1472)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "extendmode", scope: !1092, file: !974, line: 585, baseType: !983, size: 16, offset: 1488)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1092, file: !974, line: 586, baseType: !983, size: 16, offset: 1504)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1092, file: !974, line: 588, baseType: !983, size: 16, offset: 1520)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handle", scope: !1092, file: !974, line: 590, baseType: !979, size: 64, offset: 1536)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1092, file: !974, line: 592, baseType: !1023, size: 32, offset: 1600)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1092, file: !974, line: 593, baseType: !1023, size: 32, offset: 1632)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "drivers", scope: !1060, file: !974, line: 858, baseType: !1048, size: 128, offset: 384)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "overrides", scope: !1060, file: !974, line: 859, baseType: !1048, size: 128, offset: 512)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1060, file: !974, line: 862, baseType: !1023, size: 32, offset: 640)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !1060, file: !974, line: 863, baseType: !1023, size: 32, offset: 672)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "act_blendmode", scope: !1060, file: !974, line: 866, baseType: !983, size: 16, offset: 704)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "act_extendmode", scope: !1060, file: !974, line: 867, baseType: !983, size: 16, offset: 720)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "act_influence", scope: !1060, file: !974, line: 868, baseType: !1104, size: 32, offset: 736)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !987, file: !986, line: 97, baseType: !983, size: 16, offset: 1024)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !987, file: !986, line: 97, baseType: !983, size: 16, offset: 1040)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !987, file: !986, line: 99, baseType: !1104, size: 32, offset: 1056)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !987, file: !986, line: 99, baseType: !1104, size: 32, offset: 1088)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !987, file: !986, line: 99, baseType: !1104, size: 32, offset: 1120)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !987, file: !986, line: 100, baseType: !1104, size: 32, offset: 1152)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !987, file: !986, line: 100, baseType: !1104, size: 32, offset: 1184)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !987, file: !986, line: 100, baseType: !1104, size: 32, offset: 1216)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !987, file: !986, line: 101, baseType: !1104, size: 32, offset: 1248)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !987, file: !986, line: 101, baseType: !1104, size: 32, offset: 1280)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !987, file: !986, line: 101, baseType: !1104, size: 32, offset: 1312)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !987, file: !986, line: 102, baseType: !1104, size: 32, offset: 1344)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !987, file: !986, line: 102, baseType: !1104, size: 32, offset: 1376)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !987, file: !986, line: 102, baseType: !1104, size: 32, offset: 1408)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !987, file: !986, line: 103, baseType: !1104, size: 32, offset: 1440)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !987, file: !986, line: 103, baseType: !1104, size: 32, offset: 1472)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !987, file: !986, line: 103, baseType: !1104, size: 32, offset: 1504)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !987, file: !986, line: 103, baseType: !1104, size: 32, offset: 1536)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !987, file: !986, line: 103, baseType: !1104, size: 32, offset: 1568)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !987, file: !986, line: 104, baseType: !1104, size: 32, offset: 1600)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !987, file: !986, line: 104, baseType: !1104, size: 32, offset: 1632)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !987, file: !986, line: 104, baseType: !1104, size: 32, offset: 1664)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !987, file: !986, line: 104, baseType: !1104, size: 32, offset: 1696)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !987, file: !986, line: 104, baseType: !1104, size: 32, offset: 1728)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !987, file: !986, line: 105, baseType: !1104, size: 32, offset: 1760)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !987, file: !986, line: 108, baseType: !1154, size: 704, offset: 1792)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !986, line: 53, size: 704, elements: !1155)
!1155 = !{!1156, !1157, !1158, !1159, !1160, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !1154, file: !986, line: 54, baseType: !1104, size: 32)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !1154, file: !986, line: 55, baseType: !1104, size: 32, offset: 32)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !1154, file: !986, line: 56, baseType: !1104, size: 32, offset: 64)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !1154, file: !986, line: 57, baseType: !1104, size: 32, offset: 96)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !1154, file: !986, line: 59, baseType: !1161, size: 96, offset: 128)
!1161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1104, size: 96, elements: !1162)
!1162 = !{!1163}
!1163 = !DISubrange(count: 3)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !1154, file: !986, line: 60, baseType: !1161, size: 96, offset: 224)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !1154, file: !986, line: 61, baseType: !1161, size: 96, offset: 320)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !1154, file: !986, line: 63, baseType: !1104, size: 32, offset: 416)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !1154, file: !986, line: 64, baseType: !1104, size: 32, offset: 448)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !1154, file: !986, line: 65, baseType: !1104, size: 32, offset: 480)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !1154, file: !986, line: 67, baseType: !983, size: 16, offset: 512)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !1154, file: !986, line: 68, baseType: !983, size: 16, offset: 528)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !1154, file: !986, line: 69, baseType: !983, size: 16, offset: 544)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !1154, file: !986, line: 70, baseType: !983, size: 16, offset: 560)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !1154, file: !986, line: 72, baseType: !1104, size: 32, offset: 576)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !1154, file: !986, line: 73, baseType: !1104, size: 32, offset: 608)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !1154, file: !986, line: 74, baseType: !1104, size: 32, offset: 640)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !1154, file: !986, line: 75, baseType: !1104, size: 32, offset: 672)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !987, file: !986, line: 109, baseType: !1178, size: 128, offset: 2496)
!1178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !986, line: 79, size: 128, elements: !1179)
!1179 = !{!1180, !1181, !1182, !1183}
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1178, file: !986, line: 80, baseType: !1023, size: 32)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !1178, file: !986, line: 81, baseType: !1023, size: 32, offset: 32)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !1178, file: !986, line: 82, baseType: !1023, size: 32, offset: 64)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1178, file: !986, line: 83, baseType: !1023, size: 32, offset: 96)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !987, file: !986, line: 111, baseType: !1104, size: 32, offset: 2624)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !987, file: !986, line: 111, baseType: !1104, size: 32, offset: 2656)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !987, file: !986, line: 112, baseType: !1104, size: 32, offset: 2688)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !987, file: !986, line: 112, baseType: !1104, size: 32, offset: 2720)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !987, file: !986, line: 113, baseType: !1104, size: 32, offset: 2752)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !987, file: !986, line: 114, baseType: !1104, size: 32, offset: 2784)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !987, file: !986, line: 114, baseType: !1104, size: 32, offset: 2816)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !987, file: !986, line: 115, baseType: !983, size: 16, offset: 2848)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !987, file: !986, line: 115, baseType: !983, size: 16, offset: 2864)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !987, file: !986, line: 116, baseType: !983, size: 16, offset: 2880)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !987, file: !986, line: 117, baseType: !981, size: 8, offset: 2896)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !987, file: !986, line: 117, baseType: !981, size: 8, offset: 2904)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !987, file: !986, line: 119, baseType: !1104, size: 32, offset: 2912)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !987, file: !986, line: 119, baseType: !1104, size: 32, offset: 2944)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !987, file: !986, line: 120, baseType: !983, size: 16, offset: 2976)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !987, file: !986, line: 120, baseType: !983, size: 16, offset: 2992)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !987, file: !986, line: 121, baseType: !1104, size: 32, offset: 3008)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !987, file: !986, line: 121, baseType: !1104, size: 32, offset: 3040)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !987, file: !986, line: 122, baseType: !1104, size: 32, offset: 3072)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !987, file: !986, line: 123, baseType: !1104, size: 32, offset: 3104)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !987, file: !986, line: 124, baseType: !983, size: 16, offset: 3136)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !987, file: !986, line: 125, baseType: !983, size: 16, offset: 3152)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !987, file: !986, line: 127, baseType: !1023, size: 32, offset: 3168)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !987, file: !986, line: 127, baseType: !1023, size: 32, offset: 3200)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !987, file: !986, line: 128, baseType: !1023, size: 32, offset: 3232)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !987, file: !986, line: 128, baseType: !1023, size: 32, offset: 3264)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !987, file: !986, line: 129, baseType: !983, size: 16, offset: 3296)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !987, file: !986, line: 129, baseType: !983, size: 16, offset: 3312)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !987, file: !986, line: 129, baseType: !983, size: 16, offset: 3328)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !987, file: !986, line: 129, baseType: !983, size: 16, offset: 3344)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !987, file: !986, line: 130, baseType: !1104, size: 32, offset: 3360)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !987, file: !986, line: 130, baseType: !1104, size: 32, offset: 3392)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !987, file: !986, line: 130, baseType: !1104, size: 32, offset: 3424)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !987, file: !986, line: 130, baseType: !1104, size: 32, offset: 3456)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !987, file: !986, line: 131, baseType: !1104, size: 32, offset: 3488)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !987, file: !986, line: 131, baseType: !1104, size: 32, offset: 3520)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !987, file: !986, line: 131, baseType: !1104, size: 32, offset: 3552)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !987, file: !986, line: 131, baseType: !1104, size: 32, offset: 3584)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !987, file: !986, line: 132, baseType: !1104, size: 32, offset: 3616)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !987, file: !986, line: 132, baseType: !1104, size: 32, offset: 3648)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !987, file: !986, line: 133, baseType: !1038, size: 512, offset: 3680)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !987, file: !986, line: 135, baseType: !1104, size: 32, offset: 4192)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !987, file: !986, line: 136, baseType: !1104, size: 32, offset: 4224)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !987, file: !986, line: 137, baseType: !1104, size: 32, offset: 4256)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !987, file: !986, line: 138, baseType: !1023, size: 32, offset: 4288)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !987, file: !986, line: 141, baseType: !981, size: 8, offset: 4320)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !987, file: !986, line: 141, baseType: !981, size: 8, offset: 4328)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !987, file: !986, line: 141, baseType: !981, size: 8, offset: 4336)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !987, file: !986, line: 141, baseType: !981, size: 8, offset: 4344)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !987, file: !986, line: 142, baseType: !983, size: 16, offset: 4352)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !987, file: !986, line: 142, baseType: !983, size: 16, offset: 4368)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !987, file: !986, line: 142, baseType: !983, size: 16, offset: 4384)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !987, file: !986, line: 145, baseType: !981, size: 8, offset: 4400)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !987, file: !986, line: 145, baseType: !981, size: 8, offset: 4408)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !987, file: !986, line: 148, baseType: !983, size: 16, offset: 4416)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !987, file: !986, line: 148, baseType: !983, size: 16, offset: 4432)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !987, file: !986, line: 149, baseType: !1104, size: 32, offset: 4448)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !987, file: !986, line: 149, baseType: !1104, size: 32, offset: 4480)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !987, file: !986, line: 152, baseType: !1243, size: 128, offset: 4512)
!1243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1104, size: 128, elements: !1244)
!1244 = !{!1245}
!1245 = !DISubrange(count: 4)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !987, file: !986, line: 153, baseType: !1104, size: 32, offset: 4640)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !987, file: !986, line: 154, baseType: !1104, size: 32, offset: 4672)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !987, file: !986, line: 157, baseType: !983, size: 16, offset: 4704)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !987, file: !986, line: 157, baseType: !983, size: 16, offset: 4720)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !987, file: !986, line: 160, baseType: !1251, size: 64, offset: 4736)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64)
!1252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !1253, line: 113, size: 6208, elements: !1254)
!1253 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1254 = !{!1255, !1256, !1257, !1258, !1259, !1260, !1264}
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !1252, file: !1253, line: 114, baseType: !983, size: 16)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !1252, file: !1253, line: 114, baseType: !983, size: 16, offset: 16)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !1252, file: !1253, line: 115, baseType: !981, size: 8, offset: 32)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !1252, file: !1253, line: 115, baseType: !981, size: 8, offset: 40)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !1252, file: !1253, line: 116, baseType: !981, size: 8, offset: 48)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1252, file: !1253, line: 117, baseType: !1261, size: 8, offset: 56)
!1261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !981, size: 8, elements: !1262)
!1262 = !{!1263}
!1263 = !DISubrange(count: 1)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1252, file: !1253, line: 119, baseType: !1265, size: 6144, offset: 64)
!1265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1266, size: 6144, elements: !1275)
!1266 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !1253, line: 109, baseType: !1267)
!1267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !1253, line: 106, size: 192, elements: !1268)
!1268 = !{!1269, !1270, !1271, !1272, !1273, !1274}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1267, file: !1253, line: 107, baseType: !1104, size: 32)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1267, file: !1253, line: 107, baseType: !1104, size: 32, offset: 32)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !1267, file: !1253, line: 107, baseType: !1104, size: 32, offset: 64)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1267, file: !1253, line: 107, baseType: !1104, size: 32, offset: 96)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1267, file: !1253, line: 107, baseType: !1104, size: 32, offset: 128)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !1267, file: !1253, line: 108, baseType: !1023, size: 32, offset: 160)
!1275 = !{!1276}
!1276 = !DISubrange(count: 32)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !987, file: !986, line: 161, baseType: !1251, size: 64, offset: 4800)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !987, file: !986, line: 162, baseType: !981, size: 8, offset: 4864)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !987, file: !986, line: 162, baseType: !981, size: 8, offset: 4872)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !987, file: !986, line: 163, baseType: !981, size: 8, offset: 4880)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !987, file: !986, line: 163, baseType: !981, size: 8, offset: 4888)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !987, file: !986, line: 164, baseType: !983, size: 16, offset: 4896)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !987, file: !986, line: 164, baseType: !983, size: 16, offset: 4912)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !987, file: !986, line: 165, baseType: !1104, size: 32, offset: 4928)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !987, file: !986, line: 165, baseType: !1104, size: 32, offset: 4960)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !987, file: !986, line: 167, baseType: !1287, size: 1152, offset: 4992)
!1287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1288, size: 1152, elements: !2944)
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64)
!1289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !1253, line: 57, size: 2496, elements: !1290)
!1290 = !{!1291, !1292, !1293, !1294, !1295, !2738, !2885, !2886, !2887, !2888, !2889, !2890, !2891, !2892, !2893, !2894, !2895, !2896, !2897, !2898, !2899, !2900, !2901, !2902, !2903, !2904, !2905, !2906, !2907, !2908, !2909, !2910, !2911, !2912, !2913, !2914, !2915, !2916, !2917, !2918, !2919, !2920, !2921, !2922, !2923, !2924, !2925, !2926, !2927, !2928, !2929, !2930, !2931, !2932, !2933, !2934, !2935, !2936, !2937, !2938, !2939, !2940, !2941, !2942, !2943}
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !1289, file: !1253, line: 59, baseType: !983, size: 16)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !1289, file: !1253, line: 59, baseType: !983, size: 16, offset: 16)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !1289, file: !1253, line: 59, baseType: !983, size: 16, offset: 32)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !1289, file: !1253, line: 59, baseType: !983, size: 16, offset: 48)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1289, file: !1253, line: 60, baseType: !1296, size: 64, offset: 64)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64)
!1297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !6, line: 115, size: 11392, elements: !1298)
!1298 = !{!1299, !1300, !1301, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1318, !1328, !1330, !1331, !1372, !1373, !1377, !1378, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1492, !1495, !1504, !1505, !1506, !1507, !1508, !1511, !1514, !1517, !1518, !1524, !1525, !1526, !1527, !1528, !1529, !1531, !1534, !1537, !1541, !2726, !2727}
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1297, file: !6, line: 116, baseType: !990, size: 960)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1297, file: !6, line: 117, baseType: !1059, size: 64, offset: 960)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !1297, file: !6, line: 119, baseType: !1302, size: 64, offset: 1024)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64)
!1303 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !6, line: 57, flags: DIFlagFwdDecl)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1297, file: !6, line: 121, baseType: !983, size: 16, offset: 1088)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !1297, file: !6, line: 121, baseType: !983, size: 16, offset: 1104)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !1297, file: !6, line: 122, baseType: !1023, size: 32, offset: 1120)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !1297, file: !6, line: 122, baseType: !1023, size: 32, offset: 1152)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !1297, file: !6, line: 122, baseType: !1023, size: 32, offset: 1184)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !1297, file: !6, line: 123, baseType: !1038, size: 512, offset: 1216)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1297, file: !6, line: 124, baseType: !1296, size: 64, offset: 1728)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !1297, file: !6, line: 124, baseType: !1296, size: 64, offset: 1792)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1297, file: !6, line: 127, baseType: !1296, size: 64, offset: 1856)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !1297, file: !6, line: 127, baseType: !1296, size: 64, offset: 1920)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !1297, file: !6, line: 127, baseType: !1296, size: 64, offset: 1984)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1297, file: !6, line: 128, baseType: !1316, size: 64, offset: 2048)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64)
!1317 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !1253, line: 46, flags: DIFlagFwdDecl)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1297, file: !6, line: 130, baseType: !1319, size: 64, offset: 2112)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64)
!1320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !6, line: 97, size: 832, elements: !1321)
!1321 = !{!1322, !1326, !1327}
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1320, file: !6, line: 98, baseType: !1323, size: 768)
!1323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1104, size: 768, elements: !1324)
!1324 = !{!1325, !1163}
!1325 = !DISubrange(count: 8)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1320, file: !6, line: 99, baseType: !1023, size: 32, offset: 768)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1320, file: !6, line: 99, baseType: !1023, size: 32, offset: 800)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !1297, file: !6, line: 131, baseType: !1329, size: 64, offset: 2176)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !1297, file: !6, line: 132, baseType: !1329, size: 64, offset: 2240)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !1297, file: !6, line: 133, baseType: !1332, size: 64, offset: 2304)
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64)
!1333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !1065, line: 334, size: 1728, elements: !1334)
!1334 = !{!1335, !1336, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1371}
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !1333, file: !1065, line: 335, baseType: !1048, size: 128)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !1333, file: !1065, line: 336, baseType: !1337, size: 64, offset: 128)
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1338, size: 64)
!1338 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !1065, line: 47, flags: DIFlagFwdDecl)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1333, file: !1065, line: 338, baseType: !983, size: 16, offset: 192)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1333, file: !1065, line: 338, baseType: !983, size: 16, offset: 208)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !1333, file: !1065, line: 339, baseType: !7, size: 32, offset: 224)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1333, file: !1065, line: 340, baseType: !1023, size: 32, offset: 256)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !1333, file: !1065, line: 342, baseType: !1104, size: 32, offset: 288)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !1333, file: !1065, line: 343, baseType: !1161, size: 96, offset: 320)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !1333, file: !1065, line: 344, baseType: !1161, size: 96, offset: 416)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !1333, file: !1065, line: 347, baseType: !1048, size: 128, offset: 512)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !1333, file: !1065, line: 349, baseType: !1023, size: 32, offset: 640)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !1333, file: !1065, line: 350, baseType: !1023, size: 32, offset: 672)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !1333, file: !1065, line: 351, baseType: !979, size: 64, offset: 704)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !1333, file: !1065, line: 352, baseType: !979, size: 64, offset: 768)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !1333, file: !1065, line: 354, baseType: !1352, size: 384, offset: 832)
!1352 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !1065, line: 116, baseType: !1353)
!1353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !1065, line: 94, size: 384, elements: !1354)
!1354 = !{!1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370}
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !1353, file: !1065, line: 96, baseType: !1023, size: 32)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !1353, file: !1065, line: 96, baseType: !1023, size: 32, offset: 32)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !1353, file: !1065, line: 97, baseType: !1023, size: 32, offset: 64)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !1353, file: !1065, line: 97, baseType: !1023, size: 32, offset: 96)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !1353, file: !1065, line: 99, baseType: !983, size: 16, offset: 128)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !1353, file: !1065, line: 100, baseType: !983, size: 16, offset: 144)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !1353, file: !1065, line: 102, baseType: !983, size: 16, offset: 160)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !1353, file: !1065, line: 105, baseType: !983, size: 16, offset: 176)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !1353, file: !1065, line: 108, baseType: !983, size: 16, offset: 192)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !1353, file: !1065, line: 109, baseType: !983, size: 16, offset: 208)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !1353, file: !1065, line: 111, baseType: !983, size: 16, offset: 224)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !1353, file: !1065, line: 112, baseType: !983, size: 16, offset: 240)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !1353, file: !1065, line: 114, baseType: !1023, size: 32, offset: 256)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !1353, file: !1065, line: 114, baseType: !1023, size: 32, offset: 288)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !1353, file: !1065, line: 115, baseType: !1023, size: 32, offset: 320)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !1353, file: !1065, line: 115, baseType: !1023, size: 32, offset: 352)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !1333, file: !1065, line: 355, baseType: !1038, size: 512, offset: 1216)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1297, file: !6, line: 134, baseType: !979, size: 64, offset: 2368)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1297, file: !6, line: 136, baseType: !1374, size: 64, offset: 2432)
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64)
!1375 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !1376, line: 61, flags: DIFlagFwdDecl)
!1376 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !1297, file: !6, line: 138, baseType: !1352, size: 384, offset: 2496)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !1297, file: !6, line: 139, baseType: !1379, size: 64, offset: 2880)
!1379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1380, size: 64)
!1380 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !1065, line: 80, baseType: !1381)
!1381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !1065, line: 72, size: 192, elements: !1382)
!1382 = !{!1383, !1390, !1391, !1392, !1393}
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !1381, file: !1065, line: 73, baseType: !1384, size: 64)
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1385, size: 64)
!1385 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !1065, line: 59, baseType: !1386)
!1386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !1065, line: 56, size: 128, elements: !1387)
!1387 = !{!1388, !1389}
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !1386, file: !1065, line: 57, baseType: !1161, size: 96)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1386, file: !1065, line: 58, baseType: !1023, size: 32, offset: 96)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1381, file: !1065, line: 74, baseType: !1023, size: 32, offset: 64)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1381, file: !1065, line: 76, baseType: !1023, size: 32, offset: 96)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1381, file: !1065, line: 77, baseType: !1023, size: 32, offset: 128)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1381, file: !1065, line: 79, baseType: !1023, size: 32, offset: 160)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !1297, file: !6, line: 141, baseType: !1048, size: 128, offset: 2944)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !1297, file: !6, line: 142, baseType: !1048, size: 128, offset: 3072)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !1297, file: !6, line: 143, baseType: !1048, size: 128, offset: 3200)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !1297, file: !6, line: 144, baseType: !1048, size: 128, offset: 3328)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1297, file: !6, line: 146, baseType: !1023, size: 32, offset: 3456)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !1297, file: !6, line: 147, baseType: !1023, size: 32, offset: 3488)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1297, file: !6, line: 150, baseType: !1401, size: 64, offset: 3520)
!1401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1402, size: 64)
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !1297, file: !6, line: 151, baseType: !980, size: 64, offset: 3584)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !1297, file: !6, line: 152, baseType: !1023, size: 32, offset: 3648)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !1297, file: !6, line: 153, baseType: !1023, size: 32, offset: 3680)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1297, file: !6, line: 156, baseType: !1161, size: 96, offset: 3712)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !1297, file: !6, line: 156, baseType: !1161, size: 96, offset: 3808)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !1297, file: !6, line: 156, baseType: !1161, size: 96, offset: 3904)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1297, file: !6, line: 157, baseType: !1161, size: 96, offset: 4000)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !1297, file: !6, line: 158, baseType: !1161, size: 96, offset: 4096)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !1297, file: !6, line: 159, baseType: !1161, size: 96, offset: 4192)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !1297, file: !6, line: 160, baseType: !1161, size: 96, offset: 4288)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !1297, file: !6, line: 160, baseType: !1161, size: 96, offset: 4384)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !1297, file: !6, line: 161, baseType: !1243, size: 128, offset: 4480)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !1297, file: !6, line: 161, baseType: !1243, size: 128, offset: 4608)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !1297, file: !6, line: 162, baseType: !1161, size: 96, offset: 4736)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !1297, file: !6, line: 162, baseType: !1161, size: 96, offset: 4832)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !1297, file: !6, line: 163, baseType: !1104, size: 32, offset: 4928)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !1297, file: !6, line: 163, baseType: !1104, size: 32, offset: 4960)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !1297, file: !6, line: 164, baseType: !1421, size: 512, offset: 4992)
!1421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1104, size: 512, elements: !1422)
!1422 = !{!1245, !1245}
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !1297, file: !6, line: 165, baseType: !1421, size: 512, offset: 5504)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !1297, file: !6, line: 166, baseType: !1421, size: 512, offset: 6016)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !1297, file: !6, line: 167, baseType: !1421, size: 512, offset: 6528)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !1297, file: !6, line: 176, baseType: !1421, size: 512, offset: 7040)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1297, file: !6, line: 178, baseType: !7, size: 32, offset: 7552)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1297, file: !6, line: 180, baseType: !983, size: 16, offset: 7584)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !1297, file: !6, line: 181, baseType: !983, size: 16, offset: 7600)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !1297, file: !6, line: 183, baseType: !983, size: 16, offset: 7616)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !1297, file: !6, line: 183, baseType: !983, size: 16, offset: 7632)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !1297, file: !6, line: 184, baseType: !983, size: 16, offset: 7648)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !1297, file: !6, line: 184, baseType: !983, size: 16, offset: 7664)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !1297, file: !6, line: 185, baseType: !983, size: 16, offset: 7680)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !1297, file: !6, line: 186, baseType: !983, size: 16, offset: 7696)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !1297, file: !6, line: 187, baseType: !983, size: 16, offset: 7712)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !1297, file: !6, line: 188, baseType: !981, size: 8, offset: 7728)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !1297, file: !6, line: 189, baseType: !981, size: 8, offset: 7736)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !1297, file: !6, line: 192, baseType: !1023, size: 32, offset: 7744)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !1297, file: !6, line: 192, baseType: !1023, size: 32, offset: 7776)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !1297, file: !6, line: 192, baseType: !1023, size: 32, offset: 7808)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !1297, file: !6, line: 192, baseType: !1023, size: 32, offset: 7840)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1297, file: !6, line: 194, baseType: !1023, size: 32, offset: 7872)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !1297, file: !6, line: 202, baseType: !1104, size: 32, offset: 7904)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !1297, file: !6, line: 202, baseType: !1104, size: 32, offset: 7936)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !1297, file: !6, line: 202, baseType: !1104, size: 32, offset: 7968)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !1297, file: !6, line: 211, baseType: !1104, size: 32, offset: 8000)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !1297, file: !6, line: 212, baseType: !1104, size: 32, offset: 8032)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !1297, file: !6, line: 213, baseType: !1104, size: 32, offset: 8064)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !1297, file: !6, line: 214, baseType: !1104, size: 32, offset: 8096)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !1297, file: !6, line: 215, baseType: !1104, size: 32, offset: 8128)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !1297, file: !6, line: 216, baseType: !1104, size: 32, offset: 8160)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !1297, file: !6, line: 219, baseType: !1104, size: 32, offset: 8192)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !1297, file: !6, line: 220, baseType: !1104, size: 32, offset: 8224)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !1297, file: !6, line: 221, baseType: !1104, size: 32, offset: 8256)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !1297, file: !6, line: 224, baseType: !1457, size: 16, offset: 8288)
!1457 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !1297, file: !6, line: 224, baseType: !1457, size: 16, offset: 8304)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !1297, file: !6, line: 226, baseType: !983, size: 16, offset: 8320)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !1297, file: !6, line: 228, baseType: !981, size: 8, offset: 8336)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !1297, file: !6, line: 229, baseType: !981, size: 8, offset: 8344)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !1297, file: !6, line: 231, baseType: !983, size: 16, offset: 8352)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !1297, file: !6, line: 232, baseType: !981, size: 8, offset: 8368)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !1297, file: !6, line: 233, baseType: !981, size: 8, offset: 8376)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !1297, file: !6, line: 234, baseType: !1104, size: 32, offset: 8384)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !1297, file: !6, line: 235, baseType: !1104, size: 32, offset: 8416)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !1297, file: !6, line: 237, baseType: !1048, size: 128, offset: 8448)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !1297, file: !6, line: 238, baseType: !1048, size: 128, offset: 8576)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !1297, file: !6, line: 239, baseType: !1048, size: 128, offset: 8704)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !1297, file: !6, line: 240, baseType: !1048, size: 128, offset: 8832)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !1297, file: !6, line: 242, baseType: !1104, size: 32, offset: 8960)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1297, file: !6, line: 244, baseType: !983, size: 16, offset: 8992)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !1297, file: !6, line: 245, baseType: !1457, size: 16, offset: 9008)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !1297, file: !6, line: 246, baseType: !1243, size: 128, offset: 9024)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !1297, file: !6, line: 248, baseType: !1023, size: 32, offset: 9152)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !1297, file: !6, line: 249, baseType: !1023, size: 32, offset: 9184)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !1297, file: !6, line: 251, baseType: !1478, size: 64, offset: 9216)
!1478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1479, size: 64)
!1479 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !6, line: 251, flags: DIFlagFwdDecl)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !1297, file: !6, line: 253, baseType: !981, size: 8, offset: 9280)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !1297, file: !6, line: 254, baseType: !981, size: 8, offset: 9288)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !1297, file: !6, line: 255, baseType: !983, size: 16, offset: 9296)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !1297, file: !6, line: 256, baseType: !1161, size: 96, offset: 9312)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !1297, file: !6, line: 258, baseType: !1048, size: 128, offset: 9408)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !1297, file: !6, line: 259, baseType: !1048, size: 128, offset: 9536)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !1297, file: !6, line: 260, baseType: !1048, size: 128, offset: 9664)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !1297, file: !6, line: 261, baseType: !1048, size: 128, offset: 9792)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !1297, file: !6, line: 263, baseType: !1489, size: 64, offset: 9920)
!1489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1490, size: 64)
!1490 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !1491, line: 244, flags: DIFlagFwdDecl)
!1491 = !DIFile(filename: "blender/source/blender/makesdna/DNA_particle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !1297, file: !6, line: 264, baseType: !1493, size: 64, offset: 9984)
!1493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1494, size: 64)
!1494 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !6, line: 53, flags: DIFlagFwdDecl)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !1297, file: !6, line: 265, baseType: !1496, size: 64, offset: 10048)
!1496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1497, size: 64)
!1497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !1498, line: 51, size: 1216, elements: !1499)
!1498 = !DIFile(filename: "blender/source/blender/makesdna/DNA_group_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1499 = !{!1500, !1501, !1502, !1503}
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1497, file: !1498, line: 52, baseType: !990, size: 960)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "gobject", scope: !1497, file: !1498, line: 54, baseType: !1048, size: 128, offset: 960)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !1497, file: !1498, line: 59, baseType: !7, size: 32, offset: 1088)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "dupli_ofs", scope: !1497, file: !1498, line: 60, baseType: !1161, size: 96, offset: 1120)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !1297, file: !6, line: 267, baseType: !981, size: 8, offset: 10112)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !1297, file: !6, line: 268, baseType: !981, size: 8, offset: 10120)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !1297, file: !6, line: 269, baseType: !983, size: 16, offset: 10128)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !1297, file: !6, line: 270, baseType: !1104, size: 32, offset: 10144)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !1297, file: !6, line: 272, baseType: !1509, size: 64, offset: 10176)
!1509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1510, size: 64)
!1510 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !921, line: 732, flags: DIFlagFwdDecl)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !1297, file: !6, line: 275, baseType: !1512, size: 64, offset: 10240)
!1512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1513, size: 64)
!1513 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !6, line: 275, flags: DIFlagFwdDecl)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !1297, file: !6, line: 277, baseType: !1515, size: 64, offset: 10304)
!1515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1516, size: 64)
!1516 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !921, line: 592, flags: DIFlagFwdDecl)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !1297, file: !6, line: 277, baseType: !1515, size: 64, offset: 10368)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !1297, file: !6, line: 278, baseType: !1519, size: 64, offset: 10432)
!1519 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1520, line: 27, baseType: !1521)
!1520 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!1521 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !1522, line: 45, baseType: !1523)
!1522 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!1523 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !1297, file: !6, line: 279, baseType: !1519, size: 64, offset: 10496)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1297, file: !6, line: 280, baseType: !7, size: 32, offset: 10560)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !1297, file: !6, line: 281, baseType: !7, size: 32, offset: 10592)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !1297, file: !6, line: 283, baseType: !1048, size: 128, offset: 10624)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !1297, file: !6, line: 284, baseType: !1048, size: 128, offset: 10752)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !1297, file: !6, line: 285, baseType: !1530, size: 64, offset: 10880)
!1530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !1297, file: !6, line: 287, baseType: !1532, size: 64, offset: 10944)
!1532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1533, size: 64)
!1533 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !6, line: 59, flags: DIFlagFwdDecl)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !1297, file: !6, line: 288, baseType: !1535, size: 64, offset: 11008)
!1535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1536, size: 64)
!1536 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !6, line: 288, flags: DIFlagFwdDecl)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !1297, file: !6, line: 290, baseType: !1538, size: 64, offset: 11072)
!1538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1104, size: 64, elements: !1539)
!1539 = !{!1540}
!1540 = !DISubrange(count: 2)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !1297, file: !6, line: 291, baseType: !1542, size: 64, offset: 11136)
!1542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1543, size: 64)
!1543 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !1544, line: 65, baseType: !1545)
!1544 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !1544, line: 50, size: 320, elements: !1546)
!1546 = !{!1547, !2713, !2714, !2715, !2716, !2717, !2718, !2719, !2720, !2721, !2722, !2723, !2724, !2725}
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1545, file: !1544, line: 51, baseType: !1548, size: 64)
!1548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1549, size: 64)
!1549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !1376, line: 1216, size: 39680, elements: !1550)
!1550 = !{!1551, !1552, !1553, !1554, !1557, !1558, !1559, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1656, !2084, !2299, !2302, !2588, !2600, !2601, !2602, !2603, !2604, !2605, !2606, !2607, !2610, !2611, !2612, !2613, !2614, !2622, !2689, !2696, !2697, !2704, !2705, !2706, !2707, !2708, !2709, !2710}
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1549, file: !1376, line: 1217, baseType: !990, size: 960)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1549, file: !1376, line: 1218, baseType: !1059, size: 64, offset: 960)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1549, file: !1376, line: 1220, baseType: !1296, size: 64, offset: 1024)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !1549, file: !1376, line: 1221, baseType: !1555, size: 64, offset: 1088)
!1555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1556, size: 64)
!1556 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !1376, line: 52, flags: DIFlagFwdDecl)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !1549, file: !1376, line: 1223, baseType: !1548, size: 64, offset: 1152)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1549, file: !1376, line: 1225, baseType: !1048, size: 128, offset: 1216)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !1549, file: !1376, line: 1226, baseType: !1560, size: 64, offset: 1344)
!1560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1561, size: 64)
!1561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !1376, line: 69, size: 320, elements: !1562)
!1562 = !{!1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570}
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1561, file: !1376, line: 70, baseType: !1560, size: 64)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1561, file: !1376, line: 70, baseType: !1560, size: 64, offset: 64)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1561, file: !1376, line: 71, baseType: !7, size: 32, offset: 128)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !1561, file: !1376, line: 71, baseType: !7, size: 32, offset: 160)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1561, file: !1376, line: 72, baseType: !1023, size: 32, offset: 192)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !1561, file: !1376, line: 73, baseType: !983, size: 16, offset: 224)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !1561, file: !1376, line: 73, baseType: !983, size: 16, offset: 240)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1561, file: !1376, line: 74, baseType: !1296, size: 64, offset: 256)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !1549, file: !1376, line: 1227, baseType: !1296, size: 64, offset: 1408)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !1549, file: !1376, line: 1229, baseType: !1161, size: 96, offset: 1472)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !1549, file: !1376, line: 1230, baseType: !1161, size: 96, offset: 1568)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !1549, file: !1376, line: 1231, baseType: !1161, size: 96, offset: 1664)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !1549, file: !1376, line: 1231, baseType: !1161, size: 96, offset: 1760)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1549, file: !1376, line: 1233, baseType: !7, size: 32, offset: 1856)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !1549, file: !1376, line: 1234, baseType: !1023, size: 32, offset: 1888)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !1549, file: !1376, line: 1235, baseType: !7, size: 32, offset: 1920)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1549, file: !1376, line: 1237, baseType: !983, size: 16, offset: 1952)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !1549, file: !1376, line: 1239, baseType: !981, size: 8, offset: 1968)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1549, file: !1376, line: 1240, baseType: !1261, size: 8, offset: 1976)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !1549, file: !1376, line: 1242, baseType: !1583, size: 64, offset: 1984)
!1583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1584, size: 64)
!1584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !1585, line: 328, size: 3456, elements: !1586)
!1585 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1586 = !{!1587, !1588, !1589, !1592, !1593, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1622, !1623, !1624, !1627, !1632, !1633, !1636, !1640, !1644, !1648, !1652, !1653, !1654, !1655}
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1584, file: !1585, line: 329, baseType: !990, size: 960)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1584, file: !1585, line: 330, baseType: !1059, size: 64, offset: 960)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !1584, file: !1585, line: 332, baseType: !1590, size: 64, offset: 1024)
!1590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1591, size: 64)
!1591 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !1585, line: 332, flags: DIFlagFwdDecl)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1584, file: !1585, line: 333, baseType: !1038, size: 512, offset: 1088)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !1584, file: !1585, line: 335, baseType: !1594, size: 64, offset: 1600)
!1594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1595, size: 64)
!1595 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !1596, line: 41, flags: DIFlagFwdDecl)
!1596 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1584, file: !1585, line: 337, baseType: !1374, size: 64, offset: 1664)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !1584, file: !1585, line: 338, baseType: !1538, size: 64, offset: 1728)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !1584, file: !1585, line: 340, baseType: !1048, size: 128, offset: 1792)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !1584, file: !1585, line: 340, baseType: !1048, size: 128, offset: 1920)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1584, file: !1585, line: 342, baseType: !1023, size: 32, offset: 2048)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1584, file: !1585, line: 342, baseType: !1023, size: 32, offset: 2080)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !1584, file: !1585, line: 343, baseType: !1023, size: 32, offset: 2112)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1584, file: !1585, line: 345, baseType: !1023, size: 32, offset: 2144)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !1584, file: !1585, line: 346, baseType: !1023, size: 32, offset: 2176)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !1584, file: !1585, line: 347, baseType: !983, size: 16, offset: 2208)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1584, file: !1585, line: 348, baseType: !983, size: 16, offset: 2224)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1584, file: !1585, line: 349, baseType: !1023, size: 32, offset: 2240)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !1584, file: !1585, line: 351, baseType: !1023, size: 32, offset: 2272)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !1584, file: !1585, line: 353, baseType: !983, size: 16, offset: 2304)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !1584, file: !1585, line: 354, baseType: !983, size: 16, offset: 2320)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !1584, file: !1585, line: 355, baseType: !1023, size: 32, offset: 2336)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !1584, file: !1585, line: 357, baseType: !1614, size: 128, offset: 2368)
!1614 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !1615, line: 95, baseType: !1616)
!1615 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !1615, line: 92, size: 128, elements: !1617)
!1617 = !{!1618, !1619, !1620, !1621}
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1616, file: !1615, line: 93, baseType: !1104, size: 32)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1616, file: !1615, line: 93, baseType: !1104, size: 32, offset: 32)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1616, file: !1615, line: 94, baseType: !1104, size: 32, offset: 64)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1616, file: !1615, line: 94, baseType: !1104, size: 32, offset: 96)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !1584, file: !1585, line: 363, baseType: !1048, size: 128, offset: 2496)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !1584, file: !1585, line: 363, baseType: !1048, size: 128, offset: 2624)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !1584, file: !1585, line: 368, baseType: !1625, size: 64, offset: 2752)
!1625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1626, size: 64)
!1626 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !1585, line: 48, flags: DIFlagFwdDecl)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !1584, file: !1585, line: 372, baseType: !1628, size: 32, offset: 2816)
!1628 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !1585, line: 274, baseType: !1629)
!1629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !1585, line: 271, size: 32, elements: !1630)
!1630 = !{!1631}
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1629, file: !1585, line: 273, baseType: !7, size: 32)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1584, file: !1585, line: 373, baseType: !1023, size: 32, offset: 2848)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !1584, file: !1585, line: 382, baseType: !1634, size: 64, offset: 2880)
!1634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1635, size: 64)
!1635 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !1585, line: 46, flags: DIFlagFwdDecl)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !1584, file: !1585, line: 385, baseType: !1637, size: 64, offset: 2944)
!1637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1638, size: 64)
!1638 = !DISubroutineType(types: !1639)
!1639 = !{null, !979, !1104}
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !1584, file: !1585, line: 386, baseType: !1641, size: 64, offset: 3008)
!1641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1642, size: 64)
!1642 = !DISubroutineType(types: !1643)
!1643 = !{null, !979, !980}
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !1584, file: !1585, line: 387, baseType: !1645, size: 64, offset: 3072)
!1645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1646, size: 64)
!1646 = !DISubroutineType(types: !1647)
!1647 = !{!1023, !979}
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !1584, file: !1585, line: 388, baseType: !1649, size: 64, offset: 3136)
!1649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1650, size: 64)
!1650 = !DISubroutineType(types: !1651)
!1651 = !{null, !979}
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !1584, file: !1585, line: 389, baseType: !979, size: 64, offset: 3200)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !1584, file: !1585, line: 389, baseType: !979, size: 64, offset: 3264)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !1584, file: !1585, line: 389, baseType: !979, size: 64, offset: 3328)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !1584, file: !1585, line: 389, baseType: !979, size: 64, offset: 3392)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !1549, file: !1376, line: 1244, baseType: !1657, size: 64, offset: 2048)
!1657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1658, size: 64)
!1658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !1659, line: 200, size: 17024, elements: !1660)
!1659 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1660 = !{!1661, !1662, !1663, !1664, !2077, !2078, !2079, !2080, !2081, !2082, !2083}
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !1658, file: !1659, line: 201, baseType: !1530, size: 64)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !1658, file: !1659, line: 202, baseType: !1048, size: 128, offset: 64)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !1658, file: !1659, line: 203, baseType: !1048, size: 128, offset: 192)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !1658, file: !1659, line: 206, baseType: !1665, size: 64, offset: 320)
!1665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1666, size: 64)
!1666 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !1659, line: 190, baseType: !1667)
!1667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !1659, line: 126, size: 2816, elements: !1668)
!1668 = !{!1669, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1767, !1768, !1769, !1770, !2048, !2052, !2053, !2054, !2055, !2056, !2057, !2058, !2059, !2062, !2063, !2064, !2065, !2066, !2067, !2068, !2069, !2070, !2071, !2072, !2073, !2074, !2076}
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1667, file: !1659, line: 127, baseType: !1670, size: 64)
!1670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1667, size: 64)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1667, file: !1659, line: 127, baseType: !1670, size: 64, offset: 64)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !1667, file: !1659, line: 128, baseType: !979, size: 64, offset: 128)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1667, file: !1659, line: 129, baseType: !979, size: 64, offset: 192)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1667, file: !1659, line: 130, baseType: !1038, size: 512, offset: 256)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1667, file: !1659, line: 132, baseType: !1023, size: 32, offset: 768)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1667, file: !1659, line: 132, baseType: !1023, size: 32, offset: 800)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1667, file: !1659, line: 133, baseType: !1023, size: 32, offset: 832)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1667, file: !1659, line: 134, baseType: !1023, size: 32, offset: 864)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !1667, file: !1659, line: 134, baseType: !1023, size: 32, offset: 896)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !1667, file: !1659, line: 134, baseType: !1023, size: 32, offset: 928)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !1667, file: !1659, line: 135, baseType: !1023, size: 32, offset: 960)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !1667, file: !1659, line: 135, baseType: !1023, size: 32, offset: 992)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1667, file: !1659, line: 136, baseType: !1023, size: 32, offset: 1024)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1667, file: !1659, line: 136, baseType: !1023, size: 32, offset: 1056)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !1667, file: !1659, line: 137, baseType: !1023, size: 32, offset: 1088)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !1667, file: !1659, line: 137, baseType: !1023, size: 32, offset: 1120)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !1667, file: !1659, line: 138, baseType: !1104, size: 32, offset: 1152)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !1667, file: !1659, line: 139, baseType: !1104, size: 32, offset: 1184)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !1667, file: !1659, line: 139, baseType: !1104, size: 32, offset: 1216)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !1667, file: !1659, line: 141, baseType: !983, size: 16, offset: 1248)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !1667, file: !1659, line: 142, baseType: !983, size: 16, offset: 1264)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !1667, file: !1659, line: 143, baseType: !1023, size: 32, offset: 1280)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !1667, file: !1659, line: 144, baseType: !1023, size: 32, offset: 1312)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !1667, file: !1659, line: 146, baseType: !1695, size: 64, offset: 1344)
!1695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1696, size: 64)
!1696 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !1659, line: 114, baseType: !1697)
!1697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !1659, line: 99, size: 7232, elements: !1698)
!1698 = !{!1699, !1701, !1702, !1703, !1704, !1705, !1706, !1717, !1721, !1735, !1744, !1751, !1761}
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1697, file: !1659, line: 100, baseType: !1700, size: 64)
!1700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1697, size: 64)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1697, file: !1659, line: 100, baseType: !1700, size: 64, offset: 64)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1697, file: !1659, line: 101, baseType: !1023, size: 32, offset: 128)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1697, file: !1659, line: 101, baseType: !1023, size: 32, offset: 160)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !1697, file: !1659, line: 102, baseType: !1023, size: 32, offset: 192)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !1697, file: !1659, line: 102, baseType: !1023, size: 32, offset: 224)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !1697, file: !1659, line: 103, baseType: !1707, size: 64, offset: 256)
!1707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1708, size: 64)
!1708 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !1659, line: 59, baseType: !1709)
!1709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !1659, line: 56, size: 2112, elements: !1710)
!1710 = !{!1711, !1715, !1716}
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1709, file: !1659, line: 57, baseType: !1712, size: 2048)
!1712 = !DICompositeType(tag: DW_TAG_array_type, baseType: !981, size: 2048, elements: !1713)
!1713 = !{!1714}
!1714 = !DISubrange(count: 256)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !1709, file: !1659, line: 58, baseType: !1023, size: 32, offset: 2048)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !1709, file: !1659, line: 58, baseType: !1023, size: 32, offset: 2080)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1697, file: !1659, line: 106, baseType: !1718, size: 6144, offset: 320)
!1718 = !DICompositeType(tag: DW_TAG_array_type, baseType: !981, size: 6144, elements: !1719)
!1719 = !{!1720}
!1720 = !DISubrange(count: 768)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1697, file: !1659, line: 107, baseType: !1722, size: 64, offset: 6464)
!1722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1723, size: 64)
!1723 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !1659, line: 97, baseType: !1724)
!1724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !1659, line: 83, size: 8320, elements: !1725)
!1725 = !{!1726, !1727, !1728, !1731, !1732, !1733, !1734}
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1724, file: !1659, line: 84, baseType: !1718, size: 6144)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !1724, file: !1659, line: 87, baseType: !1712, size: 2048, offset: 6144)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1724, file: !1659, line: 88, baseType: !1729, size: 64, offset: 8192)
!1729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1730, size: 64)
!1730 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !1544, line: 41, flags: DIFlagFwdDecl)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !1724, file: !1659, line: 90, baseType: !983, size: 16, offset: 8256)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1724, file: !1659, line: 92, baseType: !983, size: 16, offset: 8272)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !1724, file: !1659, line: 93, baseType: !983, size: 16, offset: 8288)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !1724, file: !1659, line: 95, baseType: !983, size: 16, offset: 8304)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !1697, file: !1659, line: 108, baseType: !1736, size: 64, offset: 6528)
!1736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1737, size: 64)
!1737 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !1659, line: 66, baseType: !1738)
!1738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !1659, line: 61, size: 128, elements: !1739)
!1739 = !{!1740, !1741, !1742, !1743}
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !1738, file: !1659, line: 62, baseType: !1023, size: 32)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !1738, file: !1659, line: 63, baseType: !1023, size: 32, offset: 32)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !1738, file: !1659, line: 64, baseType: !1023, size: 32, offset: 64)
