; ModuleID = 'blender/source/blender/editors/util/editmode_undo.c'
source_filename = "blender/source/blender/editors/util/editmode_undo.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ListBase = type { i8*, i8* }
%struct.UndoElem = type { %struct.UndoElem*, %struct.UndoElem*, %struct.ID, %struct.Object*, i32, i8*, i64, [64 x i8], i8* (%struct.bContext*)*, void (i8*)*, void (i8*, i8*, i8*)*, i8* (i8*, i8*)*, i32 (i8*, i8*)* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.FileData = type opaque
%struct.PackedFile = type opaque
%struct.IDProperty = type { %struct.IDProperty*, %struct.IDProperty*, i8, i8, i16, [64 x i8], i32, %struct.IDPropertyData, i32, i32 }
%struct.IDPropertyData = type { i8*, %struct.ListBase, i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "undobase", scope: !2, file: !3, line: 96, type: !114, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !38, globals: !43, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "blender/source/blender/editors/util/editmode_undo.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{!5, !18, !32}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 123, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_global.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17}
!9 = !DIEnumerator(name: "G_DEBUG", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "G_DEBUG_FFMPEG", value: 2, isUnsigned: true)
!11 = !DIEnumerator(name: "G_DEBUG_PYTHON", value: 4, isUnsigned: true)
!12 = !DIEnumerator(name: "G_DEBUG_EVENTS", value: 8, isUnsigned: true)
!13 = !DIEnumerator(name: "G_DEBUG_HANDLERS", value: 16, isUnsigned: true)
!14 = !DIEnumerator(name: "G_DEBUG_WM", value: 32, isUnsigned: true)
!15 = !DIEnumerator(name: "G_DEBUG_JOBS", value: 64, isUnsigned: true)
!16 = !DIEnumerator(name: "G_DEBUG_FREESTYLE", value: 128, isUnsigned: true)
!17 = !DIEnumerator(name: "G_DEBUG_DEPSGRAPH", value: 256, isUnsigned: true)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !19, line: 339, baseType: !7, size: 32, elements: !20)
!19 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!20 = !{!21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31}
!21 = !DIEnumerator(name: "OB_EMPTY", value: 0, isUnsigned: true)
!22 = !DIEnumerator(name: "OB_MESH", value: 1, isUnsigned: true)
!23 = !DIEnumerator(name: "OB_CURVE", value: 2, isUnsigned: true)
!24 = !DIEnumerator(name: "OB_SURF", value: 3, isUnsigned: true)
!25 = !DIEnumerator(name: "OB_FONT", value: 4, isUnsigned: true)
!26 = !DIEnumerator(name: "OB_MBALL", value: 5, isUnsigned: true)
!27 = !DIEnumerator(name: "OB_LAMP", value: 10, isUnsigned: true)
!28 = !DIEnumerator(name: "OB_CAMERA", value: 11, isUnsigned: true)
!29 = !DIEnumerator(name: "OB_SPEAKER", value: 12, isUnsigned: true)
!30 = !DIEnumerator(name: "OB_LATTICE", value: 22, isUnsigned: true)
!31 = !DIEnumerator(name: "OB_ARMATURE", value: 25, isUnsigned: true)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !19, line: 519, baseType: !7, size: 32, elements: !33)
!33 = !{!34, !35, !36, !37}
!34 = !DIEnumerator(name: "OB_RECALC_OB", value: 1, isUnsigned: true)
!35 = !DIEnumerator(name: "OB_RECALC_DATA", value: 2, isUnsigned: true)
!36 = !DIEnumerator(name: "OB_RECALC_TIME", value: 4, isUnsigned: true)
!37 = !DIEnumerator(name: "OB_RECALC_ALL", value: 7, isUnsigned: true)
!38 = !{!39, !42}
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !40, line: 90, baseType: !41)
!40 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!41 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!43 = !{!0, !44}
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "curundo", scope: !2, file: !3, line: 97, type: !46, isLocal: true, isDefinition: true)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "UndoElem", file: !3, line: 94, baseType: !48)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UndoElem", file: !3, line: 81, size: 2176, elements: !49)
!49 = !{!50, !52, !53, !124, !421, !422, !423, !424, !425, !434, !438, !442, !446}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !48, file: !3, line: 82, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !48, file: !3, line: 82, baseType: !51, size: 64, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !48, file: !3, line: 83, baseType: !54, size: 960, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !55, line: 130, baseType: !56)
!55 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !55, line: 117, size: 960, elements: !57)
!57 = !{!58, !59, !60, !62, !82, !86, !88, !90, !91, !92}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !56, file: !55, line: 118, baseType: !42, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !56, file: !55, line: 118, baseType: !42, size: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !56, file: !55, line: 119, baseType: !61, size: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !56, file: !55, line: 120, baseType: !63, size: 64, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !55, line: 136, size: 17600, elements: !65)
!65 = !{!66, !67, !69, !72, !77, !78, !79}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !64, file: !55, line: 137, baseType: !54, size: 960)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !64, file: !55, line: 138, baseType: !68, size: 64, offset: 960)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !64, file: !55, line: 139, baseType: !70, size: 64, offset: 1024)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !55, line: 43, flags: DIFlagFwdDecl)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !64, file: !55, line: 140, baseType: !73, size: 8192, offset: 1088)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 8192, elements: !75)
!74 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!75 = !{!76}
!76 = !DISubrange(count: 1024)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !64, file: !55, line: 141, baseType: !73, size: 8192, offset: 9280)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !64, file: !55, line: 148, baseType: !63, size: 64, offset: 17472)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !64, file: !55, line: 150, baseType: !80, size: 64, offset: 17536)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !55, line: 45, flags: DIFlagFwdDecl)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !56, file: !55, line: 121, baseType: !83, size: 528, offset: 256)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 528, elements: !84)
!84 = !{!85}
!85 = !DISubrange(count: 66)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !56, file: !55, line: 126, baseType: !87, size: 16, offset: 784)
!87 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !56, file: !55, line: 127, baseType: !89, size: 32, offset: 800)
!89 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !56, file: !55, line: 128, baseType: !89, size: 32, offset: 832)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !56, file: !55, line: 128, baseType: !89, size: 32, offset: 864)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !56, file: !55, line: 129, baseType: !93, size: 64, offset: 896)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !55, line: 75, baseType: !95)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !55, line: 62, size: 1024, elements: !96)
!96 = !{!97, !99, !100, !101, !102, !103, !107, !108, !122, !123}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !95, file: !55, line: 63, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !95, file: !55, line: 63, baseType: !98, size: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !95, file: !55, line: 64, baseType: !74, size: 8, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !95, file: !55, line: 64, baseType: !74, size: 8, offset: 136)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !95, file: !55, line: 65, baseType: !87, size: 16, offset: 144)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !95, file: !55, line: 66, baseType: !104, size: 512, offset: 160)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 512, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !95, file: !55, line: 67, baseType: !89, size: 32, offset: 672)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !95, file: !55, line: 69, baseType: !109, size: 256, offset: 704)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !55, line: 60, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !55, line: 48, size: 256, elements: !111)
!111 = !{!112, !113, !120, !121}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !110, file: !55, line: 49, baseType: !42, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !110, file: !55, line: 58, baseType: !114, size: 128, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !115, line: 71, baseType: !116)
!115 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !115, line: 69, size: 128, elements: !117)
!117 = !{!118, !119}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !116, file: !115, line: 70, baseType: !42, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !116, file: !115, line: 70, baseType: !42, size: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !110, file: !55, line: 59, baseType: !89, size: 32, offset: 192)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !110, file: !55, line: 59, baseType: !89, size: 32, offset: 224)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !95, file: !55, line: 70, baseType: !89, size: 32, offset: 960)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !95, file: !55, line: 74, baseType: !89, size: 32, offset: 992)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "ob", scope: !48, file: !3, line: 84, baseType: !125, size: 64, offset: 1088)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "Object", file: !19, line: 295, baseType: !127)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !19, line: 115, size: 11392, elements: !128)
!128 = !{!129, !130, !134, !137, !138, !139, !140, !141, !142, !143, !145, !146, !147, !148, !149, !152, !164, !178, !179, !222, !223, !226, !227, !243, !244, !245, !246, !247, !248, !249, !253, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !269, !270, !271, !272, !273, !274, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !334, !335, !336, !337, !338, !339, !340, !341, !342, !345, !348, !351, !352, !353, !354, !355, !358, !361, !364, !365, !370, !371, !372, !373, !374, !375, !377, !380, !383, !387, !409, !410}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !127, file: !19, line: 116, baseType: !54, size: 960)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !127, file: !19, line: 117, baseType: !131, size: 64, offset: 960)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !133, line: 45, flags: DIFlagFwdDecl)
!133 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!134 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !127, file: !19, line: 119, baseType: !135, size: 64, offset: 1024)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !19, line: 57, flags: DIFlagFwdDecl)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !127, file: !19, line: 121, baseType: !87, size: 16, offset: 1088)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !127, file: !19, line: 121, baseType: !87, size: 16, offset: 1104)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !127, file: !19, line: 122, baseType: !89, size: 32, offset: 1120)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !127, file: !19, line: 122, baseType: !89, size: 32, offset: 1152)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !127, file: !19, line: 122, baseType: !89, size: 32, offset: 1184)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !127, file: !19, line: 123, baseType: !104, size: 512, offset: 1216)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !127, file: !19, line: 124, baseType: !144, size: 64, offset: 1728)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !127, file: !19, line: 124, baseType: !144, size: 64, offset: 1792)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !127, file: !19, line: 127, baseType: !144, size: 64, offset: 1856)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !127, file: !19, line: 127, baseType: !144, size: 64, offset: 1920)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !127, file: !19, line: 127, baseType: !144, size: 64, offset: 1984)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !127, file: !19, line: 128, baseType: !150, size: 64, offset: 2048)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !133, line: 46, flags: DIFlagFwdDecl)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !127, file: !19, line: 130, baseType: !153, size: 64, offset: 2112)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !19, line: 97, size: 832, elements: !155)
!155 = !{!156, !162, !163}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !154, file: !19, line: 98, baseType: !157, size: 768)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 768, elements: !159)
!158 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!159 = !{!160, !161}
!160 = !DISubrange(count: 8)
!161 = !DISubrange(count: 3)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !154, file: !19, line: 99, baseType: !89, size: 32, offset: 768)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !154, file: !19, line: 99, baseType: !89, size: 32, offset: 800)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !127, file: !19, line: 131, baseType: !165, size: 64, offset: 2176)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !167, line: 486, size: 1600, elements: !168)
!167 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!168 = !{!169, !170, !171, !172, !173, !174, !175, !176, !177}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !166, file: !167, line: 487, baseType: !54, size: 960)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !166, file: !167, line: 489, baseType: !114, size: 128, offset: 960)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !166, file: !167, line: 490, baseType: !114, size: 128, offset: 1088)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !166, file: !167, line: 491, baseType: !114, size: 128, offset: 1216)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !166, file: !167, line: 492, baseType: !114, size: 128, offset: 1344)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !166, file: !167, line: 494, baseType: !89, size: 32, offset: 1472)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !166, file: !167, line: 495, baseType: !89, size: 32, offset: 1504)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !166, file: !167, line: 497, baseType: !89, size: 32, offset: 1536)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !166, file: !167, line: 498, baseType: !89, size: 32, offset: 1568)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !127, file: !19, line: 132, baseType: !165, size: 64, offset: 2240)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !127, file: !19, line: 133, baseType: !180, size: 64, offset: 2304)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !167, line: 334, size: 1728, elements: !182)
!182 = !{!183, !184, !187, !188, !189, !190, !191, !192, !195, !196, !197, !198, !199, !200, !201, !221}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !181, file: !167, line: 335, baseType: !114, size: 128)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !181, file: !167, line: 336, baseType: !185, size: 64, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !167, line: 47, flags: DIFlagFwdDecl)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !181, file: !167, line: 338, baseType: !87, size: 16, offset: 192)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !181, file: !167, line: 338, baseType: !87, size: 16, offset: 208)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !181, file: !167, line: 339, baseType: !7, size: 32, offset: 224)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !181, file: !167, line: 340, baseType: !89, size: 32, offset: 256)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !181, file: !167, line: 342, baseType: !158, size: 32, offset: 288)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !181, file: !167, line: 343, baseType: !193, size: 96, offset: 320)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 96, elements: !194)
!194 = !{!161}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !181, file: !167, line: 344, baseType: !193, size: 96, offset: 416)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !181, file: !167, line: 347, baseType: !114, size: 128, offset: 512)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !181, file: !167, line: 349, baseType: !89, size: 32, offset: 640)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !181, file: !167, line: 350, baseType: !89, size: 32, offset: 672)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !181, file: !167, line: 351, baseType: !42, size: 64, offset: 704)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !181, file: !167, line: 352, baseType: !42, size: 64, offset: 768)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !181, file: !167, line: 354, baseType: !202, size: 384, offset: 832)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !167, line: 116, baseType: !203)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !167, line: 94, size: 384, elements: !204)
!204 = !{!205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !203, file: !167, line: 96, baseType: !89, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !203, file: !167, line: 96, baseType: !89, size: 32, offset: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !203, file: !167, line: 97, baseType: !89, size: 32, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !203, file: !167, line: 97, baseType: !89, size: 32, offset: 96)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !203, file: !167, line: 99, baseType: !87, size: 16, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !203, file: !167, line: 100, baseType: !87, size: 16, offset: 144)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !203, file: !167, line: 102, baseType: !87, size: 16, offset: 160)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !203, file: !167, line: 105, baseType: !87, size: 16, offset: 176)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !203, file: !167, line: 108, baseType: !87, size: 16, offset: 192)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !203, file: !167, line: 109, baseType: !87, size: 16, offset: 208)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !203, file: !167, line: 111, baseType: !87, size: 16, offset: 224)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !203, file: !167, line: 112, baseType: !87, size: 16, offset: 240)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !203, file: !167, line: 114, baseType: !89, size: 32, offset: 256)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !203, file: !167, line: 114, baseType: !89, size: 32, offset: 288)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !203, file: !167, line: 115, baseType: !89, size: 32, offset: 320)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !203, file: !167, line: 115, baseType: !89, size: 32, offset: 352)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !181, file: !167, line: 355, baseType: !104, size: 512, offset: 1216)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !127, file: !19, line: 134, baseType: !42, size: 64, offset: 2368)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !127, file: !19, line: 136, baseType: !224, size: 64, offset: 2432)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !19, line: 58, flags: DIFlagFwdDecl)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !127, file: !19, line: 138, baseType: !202, size: 384, offset: 2496)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !127, file: !19, line: 139, baseType: !228, size: 64, offset: 2880)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !167, line: 80, baseType: !230)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !167, line: 72, size: 192, elements: !231)
!231 = !{!232, !239, !240, !241, !242}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !230, file: !167, line: 73, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !167, line: 59, baseType: !235)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !167, line: 56, size: 128, elements: !236)
!236 = !{!237, !238}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !235, file: !167, line: 57, baseType: !193, size: 96)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !235, file: !167, line: 58, baseType: !89, size: 32, offset: 96)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !230, file: !167, line: 74, baseType: !89, size: 32, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !230, file: !167, line: 76, baseType: !89, size: 32, offset: 96)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !230, file: !167, line: 77, baseType: !89, size: 32, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !230, file: !167, line: 79, baseType: !89, size: 32, offset: 160)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !127, file: !19, line: 141, baseType: !114, size: 128, offset: 2944)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !127, file: !19, line: 142, baseType: !114, size: 128, offset: 3072)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !127, file: !19, line: 143, baseType: !114, size: 128, offset: 3200)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !127, file: !19, line: 144, baseType: !114, size: 128, offset: 3328)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !127, file: !19, line: 146, baseType: !89, size: 32, offset: 3456)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !127, file: !19, line: 147, baseType: !89, size: 32, offset: 3488)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !127, file: !19, line: 150, baseType: !250, size: 64, offset: 3520)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !19, line: 50, flags: DIFlagFwdDecl)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !127, file: !19, line: 151, baseType: !254, size: 64, offset: 3584)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !127, file: !19, line: 152, baseType: !89, size: 32, offset: 3648)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !127, file: !19, line: 153, baseType: !89, size: 32, offset: 3680)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !127, file: !19, line: 156, baseType: !193, size: 96, offset: 3712)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !127, file: !19, line: 156, baseType: !193, size: 96, offset: 3808)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !127, file: !19, line: 156, baseType: !193, size: 96, offset: 3904)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !127, file: !19, line: 157, baseType: !193, size: 96, offset: 4000)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !127, file: !19, line: 158, baseType: !193, size: 96, offset: 4096)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !127, file: !19, line: 159, baseType: !193, size: 96, offset: 4192)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !127, file: !19, line: 160, baseType: !193, size: 96, offset: 4288)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !127, file: !19, line: 160, baseType: !193, size: 96, offset: 4384)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !127, file: !19, line: 161, baseType: !266, size: 128, offset: 4480)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 128, elements: !267)
!267 = !{!268}
!268 = !DISubrange(count: 4)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !127, file: !19, line: 161, baseType: !266, size: 128, offset: 4608)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !127, file: !19, line: 162, baseType: !193, size: 96, offset: 4736)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !127, file: !19, line: 162, baseType: !193, size: 96, offset: 4832)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !127, file: !19, line: 163, baseType: !158, size: 32, offset: 4928)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !127, file: !19, line: 163, baseType: !158, size: 32, offset: 4960)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !127, file: !19, line: 164, baseType: !275, size: 512, offset: 4992)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 512, elements: !276)
!276 = !{!268, !268}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !127, file: !19, line: 165, baseType: !275, size: 512, offset: 5504)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !127, file: !19, line: 166, baseType: !275, size: 512, offset: 6016)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !127, file: !19, line: 167, baseType: !275, size: 512, offset: 6528)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !127, file: !19, line: 176, baseType: !275, size: 512, offset: 7040)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !127, file: !19, line: 178, baseType: !7, size: 32, offset: 7552)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !127, file: !19, line: 180, baseType: !87, size: 16, offset: 7584)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !127, file: !19, line: 181, baseType: !87, size: 16, offset: 7600)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !127, file: !19, line: 183, baseType: !87, size: 16, offset: 7616)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !127, file: !19, line: 183, baseType: !87, size: 16, offset: 7632)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !127, file: !19, line: 184, baseType: !87, size: 16, offset: 7648)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !127, file: !19, line: 184, baseType: !87, size: 16, offset: 7664)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !127, file: !19, line: 185, baseType: !87, size: 16, offset: 7680)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !127, file: !19, line: 186, baseType: !87, size: 16, offset: 7696)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !127, file: !19, line: 187, baseType: !87, size: 16, offset: 7712)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !127, file: !19, line: 188, baseType: !74, size: 8, offset: 7728)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !127, file: !19, line: 189, baseType: !74, size: 8, offset: 7736)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !127, file: !19, line: 192, baseType: !89, size: 32, offset: 7744)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !127, file: !19, line: 192, baseType: !89, size: 32, offset: 7776)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !127, file: !19, line: 192, baseType: !89, size: 32, offset: 7808)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !127, file: !19, line: 192, baseType: !89, size: 32, offset: 7840)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !127, file: !19, line: 194, baseType: !89, size: 32, offset: 7872)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !127, file: !19, line: 202, baseType: !158, size: 32, offset: 7904)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !127, file: !19, line: 202, baseType: !158, size: 32, offset: 7936)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !127, file: !19, line: 202, baseType: !158, size: 32, offset: 7968)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !127, file: !19, line: 211, baseType: !158, size: 32, offset: 8000)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !127, file: !19, line: 212, baseType: !158, size: 32, offset: 8032)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !127, file: !19, line: 213, baseType: !158, size: 32, offset: 8064)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !127, file: !19, line: 214, baseType: !158, size: 32, offset: 8096)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !127, file: !19, line: 215, baseType: !158, size: 32, offset: 8128)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !127, file: !19, line: 216, baseType: !158, size: 32, offset: 8160)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !127, file: !19, line: 219, baseType: !158, size: 32, offset: 8192)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !127, file: !19, line: 220, baseType: !158, size: 32, offset: 8224)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !127, file: !19, line: 221, baseType: !158, size: 32, offset: 8256)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !127, file: !19, line: 224, baseType: !311, size: 16, offset: 8288)
!311 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !127, file: !19, line: 224, baseType: !311, size: 16, offset: 8304)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !127, file: !19, line: 226, baseType: !87, size: 16, offset: 8320)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !127, file: !19, line: 228, baseType: !74, size: 8, offset: 8336)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !127, file: !19, line: 229, baseType: !74, size: 8, offset: 8344)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !127, file: !19, line: 231, baseType: !87, size: 16, offset: 8352)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !127, file: !19, line: 232, baseType: !74, size: 8, offset: 8368)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !127, file: !19, line: 233, baseType: !74, size: 8, offset: 8376)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !127, file: !19, line: 234, baseType: !158, size: 32, offset: 8384)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !127, file: !19, line: 235, baseType: !158, size: 32, offset: 8416)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !127, file: !19, line: 237, baseType: !114, size: 128, offset: 8448)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !127, file: !19, line: 238, baseType: !114, size: 128, offset: 8576)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !127, file: !19, line: 239, baseType: !114, size: 128, offset: 8704)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !127, file: !19, line: 240, baseType: !114, size: 128, offset: 8832)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !127, file: !19, line: 242, baseType: !158, size: 32, offset: 8960)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !127, file: !19, line: 244, baseType: !87, size: 16, offset: 8992)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !127, file: !19, line: 245, baseType: !311, size: 16, offset: 9008)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !127, file: !19, line: 246, baseType: !266, size: 128, offset: 9024)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !127, file: !19, line: 248, baseType: !89, size: 32, offset: 9152)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !127, file: !19, line: 249, baseType: !89, size: 32, offset: 9184)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !127, file: !19, line: 251, baseType: !332, size: 64, offset: 9216)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !19, line: 251, flags: DIFlagFwdDecl)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !127, file: !19, line: 253, baseType: !74, size: 8, offset: 9280)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !127, file: !19, line: 254, baseType: !74, size: 8, offset: 9288)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !127, file: !19, line: 255, baseType: !87, size: 16, offset: 9296)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !127, file: !19, line: 256, baseType: !193, size: 96, offset: 9312)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !127, file: !19, line: 258, baseType: !114, size: 128, offset: 9408)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !127, file: !19, line: 259, baseType: !114, size: 128, offset: 9536)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !127, file: !19, line: 260, baseType: !114, size: 128, offset: 9664)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !127, file: !19, line: 261, baseType: !114, size: 128, offset: 9792)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !127, file: !19, line: 263, baseType: !343, size: 64, offset: 9920)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !19, line: 52, flags: DIFlagFwdDecl)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !127, file: !19, line: 264, baseType: !346, size: 64, offset: 9984)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !19, line: 53, flags: DIFlagFwdDecl)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !127, file: !19, line: 265, baseType: !349, size: 64, offset: 10048)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !167, line: 46, flags: DIFlagFwdDecl)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !127, file: !19, line: 267, baseType: !74, size: 8, offset: 10112)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !127, file: !19, line: 268, baseType: !74, size: 8, offset: 10120)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !127, file: !19, line: 269, baseType: !87, size: 16, offset: 10128)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !127, file: !19, line: 270, baseType: !158, size: 32, offset: 10144)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !127, file: !19, line: 272, baseType: !356, size: 64, offset: 10176)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !19, line: 54, flags: DIFlagFwdDecl)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !127, file: !19, line: 275, baseType: !359, size: 64, offset: 10240)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !19, line: 275, flags: DIFlagFwdDecl)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !127, file: !19, line: 277, baseType: !362, size: 64, offset: 10304)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !19, line: 56, flags: DIFlagFwdDecl)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !127, file: !19, line: 277, baseType: !362, size: 64, offset: 10368)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !127, file: !19, line: 278, baseType: !366, size: 64, offset: 10432)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !367, line: 27, baseType: !368)
!367 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !369, line: 45, baseType: !41)
!369 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!370 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !127, file: !19, line: 279, baseType: !366, size: 64, offset: 10496)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !127, file: !19, line: 280, baseType: !7, size: 32, offset: 10560)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !127, file: !19, line: 281, baseType: !7, size: 32, offset: 10592)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !127, file: !19, line: 283, baseType: !114, size: 128, offset: 10624)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !127, file: !19, line: 284, baseType: !114, size: 128, offset: 10752)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !127, file: !19, line: 285, baseType: !376, size: 64, offset: 10880)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !127, file: !19, line: 287, baseType: !378, size: 64, offset: 10944)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !19, line: 59, flags: DIFlagFwdDecl)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !127, file: !19, line: 288, baseType: !381, size: 64, offset: 11008)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !19, line: 288, flags: DIFlagFwdDecl)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !127, file: !19, line: 290, baseType: !384, size: 64, offset: 11072)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 64, elements: !385)
!385 = !{!386}
!386 = !DISubrange(count: 2)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !127, file: !19, line: 291, baseType: !388, size: 64, offset: 11136)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !390, line: 65, baseType: !391)
!390 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !390, line: 50, size: 320, elements: !392)
!392 = !{!393, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !391, file: !390, line: 51, baseType: !394, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !390, line: 40, flags: DIFlagFwdDecl)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !391, file: !390, line: 53, baseType: !89, size: 32, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !391, file: !390, line: 54, baseType: !89, size: 32, offset: 96)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !391, file: !390, line: 55, baseType: !89, size: 32, offset: 128)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !391, file: !390, line: 55, baseType: !89, size: 32, offset: 160)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !391, file: !390, line: 56, baseType: !74, size: 8, offset: 192)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !391, file: !390, line: 56, baseType: !74, size: 8, offset: 200)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !391, file: !390, line: 57, baseType: !74, size: 8, offset: 208)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !391, file: !390, line: 57, baseType: !74, size: 8, offset: 216)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !391, file: !390, line: 59, baseType: !87, size: 16, offset: 224)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !391, file: !390, line: 59, baseType: !87, size: 16, offset: 240)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !391, file: !390, line: 59, baseType: !87, size: 16, offset: 256)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !391, file: !390, line: 61, baseType: !87, size: 16, offset: 272)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !391, file: !390, line: 63, baseType: !89, size: 32, offset: 288)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !127, file: !19, line: 293, baseType: !114, size: 128, offset: 11200)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !127, file: !19, line: 294, baseType: !411, size: 64, offset: 11328)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !19, line: 113, baseType: !413)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !19, line: 108, size: 256, elements: !414)
!414 = !{!415, !417, !418, !419, !420}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !413, file: !19, line: 109, baseType: !416, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !413, file: !19, line: 109, baseType: !416, size: 64, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !413, file: !19, line: 110, baseType: !144, size: 64, offset: 128)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !413, file: !19, line: 111, baseType: !89, size: 32, offset: 192)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !413, file: !19, line: 112, baseType: !158, size: 32, offset: 224)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !48, file: !3, line: 85, baseType: !89, size: 32, offset: 1152)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "undodata", scope: !48, file: !3, line: 86, baseType: !42, size: 64, offset: 1216)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "undosize", scope: !48, file: !3, line: 87, baseType: !39, size: 64, offset: 1280)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !48, file: !3, line: 88, baseType: !104, size: 512, offset: 1344)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "getdata", scope: !48, file: !3, line: 89, baseType: !426, size: 64, offset: 1856)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DISubroutineType(types: !428)
!428 = !{!42, !429}
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "bContext", file: !431, line: 69, baseType: !432)
!431 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!432 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !433, line: 60, flags: DIFlagFwdDecl)
!433 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_blender.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!434 = !DIDerivedType(tag: DW_TAG_member, name: "freedata", scope: !48, file: !3, line: 90, baseType: !435, size: 64, offset: 1920)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{null, !42}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "to_editmode", scope: !48, file: !3, line: 91, baseType: !439, size: 64, offset: 1984)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{null, !42, !42, !42}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "from_editmode", scope: !48, file: !3, line: 92, baseType: !443, size: 64, offset: 2048)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DISubroutineType(types: !445)
!445 = !{!42, !42, !42}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "validate_undo", scope: !48, file: !3, line: 93, baseType: !447, size: 64, offset: 2112)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{!89, !42, !42}
!450 = !{i32 7, !"Dwarf Version", i32 4}
!451 = !{i32 2, !"Debug Info Version", i32 3}
!452 = !{i32 1, !"wchar_size", i32 4}
!453 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!454 = distinct !DISubprogram(name: "undo_editmode_push", scope: !3, file: !3, line: 110, type: !455, scopeLine: 116, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !459)
!455 = !DISubroutineType(types: !456)
!456 = !{null, !429, !457, !426, !435, !439, !443, !447}
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!459 = !{}
!460 = !DILocalVariable(name: "C", arg: 1, scope: !454, file: !3, line: 110, type: !429)
!461 = !DILocation(line: 110, column: 35, scope: !454)
!462 = !DILocalVariable(name: "name", arg: 2, scope: !454, file: !3, line: 110, type: !457)
!463 = !DILocation(line: 110, column: 50, scope: !454)
!464 = !DILocalVariable(name: "getdata", arg: 3, scope: !454, file: !3, line: 111, type: !426)
!465 = !DILocation(line: 111, column: 34, scope: !454)
!466 = !DILocalVariable(name: "freedata", arg: 4, scope: !454, file: !3, line: 112, type: !435)
!467 = !DILocation(line: 112, column: 32, scope: !454)
!468 = !DILocalVariable(name: "to_editmode", arg: 5, scope: !454, file: !3, line: 113, type: !439)
!469 = !DILocation(line: 113, column: 32, scope: !454)
!470 = !DILocalVariable(name: "from_editmode", arg: 6, scope: !454, file: !3, line: 114, type: !443)
!471 = !DILocation(line: 114, column: 33, scope: !454)
!472 = !DILocalVariable(name: "validate_undo", arg: 7, scope: !454, file: !3, line: 115, type: !447)
!473 = !DILocation(line: 115, column: 31, scope: !454)
!474 = !DILocalVariable(name: "uel", scope: !454, file: !3, line: 117, type: !46)
!475 = !DILocation(line: 117, column: 12, scope: !454)
!476 = !DILocalVariable(name: "obedit", scope: !454, file: !3, line: 118, type: !125)
!477 = !DILocation(line: 118, column: 10, scope: !454)
!478 = !DILocation(line: 118, column: 40, scope: !454)
!479 = !DILocation(line: 118, column: 19, scope: !454)
!480 = !DILocalVariable(name: "editdata", scope: !454, file: !3, line: 119, type: !42)
!481 = !DILocation(line: 119, column: 8, scope: !454)
!482 = !DILocalVariable(name: "nr", scope: !454, file: !3, line: 120, type: !89)
!483 = !DILocation(line: 120, column: 6, scope: !454)
!484 = !DILocalVariable(name: "memused", scope: !454, file: !3, line: 121, type: !39)
!485 = !DILocation(line: 121, column: 12, scope: !454)
!486 = !DILocalVariable(name: "totmem", scope: !454, file: !3, line: 121, type: !39)
!487 = !DILocation(line: 121, column: 21, scope: !454)
!488 = !DILocalVariable(name: "maxmem", scope: !454, file: !3, line: 121, type: !39)
!489 = !DILocation(line: 121, column: 29, scope: !454)
!490 = !DILocation(line: 127, column: 2, scope: !454)
!491 = !DILocation(line: 127, column: 18, scope: !454)
!492 = !DILocation(line: 127, column: 26, scope: !454)
!493 = !DILocation(line: 127, column: 23, scope: !454)
!494 = !DILocation(line: 128, column: 18, scope: !495)
!495 = distinct !DILexicalBlock(scope: !454, file: !3, line: 127, column: 35)
!496 = !DILocation(line: 128, column: 9, scope: !495)
!497 = !DILocation(line: 128, column: 7, scope: !495)
!498 = !DILocation(line: 129, column: 3, scope: !495)
!499 = !DILocation(line: 129, column: 8, scope: !495)
!500 = !DILocation(line: 129, column: 17, scope: !495)
!501 = !DILocation(line: 129, column: 22, scope: !495)
!502 = !DILocation(line: 130, column: 28, scope: !495)
!503 = !DILocation(line: 130, column: 3, scope: !495)
!504 = distinct !{!504, !490, !505}
!505 = !DILocation(line: 131, column: 2, scope: !454)
