; ModuleID = 'blender/source/blender/blenkernel/intern/editmesh.c'
source_filename = "blender/source/blender/blenkernel/intern/editmesh.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BMEditMesh = type { %struct.BMesh*, %struct.BMEditMesh*, i32, [3 x %struct.BMLoop*]*, i32, %struct.DerivedMesh*, %struct.DerivedMesh*, i64, [4 x i8]*, i32, [4 x i8]*, i32, i16, i16, %struct.Object*, i32 }
%struct.BMLoop = type { %struct.BMHeader, %struct.BMVert*, %struct.BMEdge*, %struct.BMFace*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop* }
%struct.BMHeader = type { i8*, i32, i8, i8, i8 }
%struct.BMVert = type { %struct.BMHeader, %struct.BMFlagLayer*, [3 x float], [3 x float], %struct.BMEdge* }
%struct.BMFlagLayer = type { i16 }
%struct.BMEdge = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMVert*, %struct.BMVert*, %struct.BMLoop*, %struct.BMDiskLink, %struct.BMDiskLink }
%struct.BMDiskLink = type { %struct.BMEdge*, %struct.BMEdge* }
%struct.BMFace = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMLoop*, i32, [3 x float], i16 }

!57 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DMDrawOption", file: !43, line: 134, baseType: !5, size: 32, elements: !58)
!58 = !{!59, !60, !61, !62}
!59 = !DIEnumerator(name: "DM_DRAW_OPTION_SKIP", value: 0, isUnsigned: true)
!60 = !DIEnumerator(name: "DM_DRAW_OPTION_NORMAL", value: 1, isUnsigned: true)
!61 = !DIEnumerator(name: "DM_DRAW_OPTION_NO_MCOL", value: 2, isUnsigned: true)
!62 = !DIEnumerator(name: "DM_DRAW_OPTION_STIPPLE", value: 3, isUnsigned: true)
!63 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DMDrawFlag", file: !43, line: 152, baseType: !5, size: 32, elements: !64)
!64 = !{!65, !66, !67, !68}
!65 = !DIEnumerator(name: "DM_DRAW_USE_COLORS", value: 1, isUnsigned: true)
!66 = !DIEnumerator(name: "DM_DRAW_ALWAYS_SMOOTH", value: 2, isUnsigned: true)
!67 = !DIEnumerator(name: "DM_DRAW_USE_ACTIVE_UV", value: 4, isUnsigned: true)
!68 = !DIEnumerator(name: "DM_DRAW_USE_TEXPAINT_UV", value: 8, isUnsigned: true)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !70, line: 76, baseType: !5, size: 32, elements: !71)
!70 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!71 = !{!72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112}
!72 = !DIEnumerator(name: "CD_MVERT", value: 0, isUnsigned: true)
!73 = !DIEnumerator(name: "CD_MSTICKY", value: 1, isUnsigned: true)
!74 = !DIEnumerator(name: "CD_MDEFORMVERT", value: 2, isUnsigned: true)
!75 = !DIEnumerator(name: "CD_MEDGE", value: 3, isUnsigned: true)
!76 = !DIEnumerator(name: "CD_MFACE", value: 4, isUnsigned: true)
!77 = !DIEnumerator(name: "CD_MTFACE", value: 5, isUnsigned: true)
!78 = !DIEnumerator(name: "CD_MCOL", value: 6, isUnsigned: true)
!79 = !DIEnumerator(name: "CD_ORIGINDEX", value: 7, isUnsigned: true)
!80 = !DIEnumerator(name: "CD_NORMAL", value: 8, isUnsigned: true)
!81 = !DIEnumerator(name: "CD_PROP_FLT", value: 10, isUnsigned: true)
!82 = !DIEnumerator(name: "CD_PROP_INT", value: 11, isUnsigned: true)
!83 = !DIEnumerator(name: "CD_PROP_STR", value: 12, isUnsigned: true)
!84 = !DIEnumerator(name: "CD_ORIGSPACE", value: 13, isUnsigned: true)
!85 = !DIEnumerator(name: "CD_ORCO", value: 14, isUnsigned: true)
!86 = !DIEnumerator(name: "CD_MTEXPOLY", value: 15, isUnsigned: true)
!87 = !DIEnumerator(name: "CD_MLOOPUV", value: 16, isUnsigned: true)
!88 = !DIEnumerator(name: "CD_MLOOPCOL", value: 17, isUnsigned: true)
!89 = !DIEnumerator(name: "CD_TANGENT", value: 18, isUnsigned: true)
!90 = !DIEnumerator(name: "CD_MDISPS", value: 19, isUnsigned: true)
!91 = !DIEnumerator(name: "CD_PREVIEW_MCOL", value: 20, isUnsigned: true)
!92 = !DIEnumerator(name: "CD_ID_MCOL", value: 21, isUnsigned: true)
!93 = !DIEnumerator(name: "CD_TEXTURE_MCOL", value: 22, isUnsigned: true)
!94 = !DIEnumerator(name: "CD_CLOTH_ORCO", value: 23, isUnsigned: true)
!95 = !DIEnumerator(name: "CD_RECAST", value: 24, isUnsigned: true)
!96 = !DIEnumerator(name: "CD_MPOLY", value: 25, isUnsigned: true)
!97 = !DIEnumerator(name: "CD_MLOOP", value: 26, isUnsigned: true)
!98 = !DIEnumerator(name: "CD_SHAPE_KEYINDEX", value: 27, isUnsigned: true)
!99 = !DIEnumerator(name: "CD_SHAPEKEY", value: 28, isUnsigned: true)
!100 = !DIEnumerator(name: "CD_BWEIGHT", value: 29, isUnsigned: true)
!101 = !DIEnumerator(name: "CD_CREASE", value: 30, isUnsigned: true)
!102 = !DIEnumerator(name: "CD_ORIGSPACE_MLOOP", value: 31, isUnsigned: true)
!103 = !DIEnumerator(name: "CD_PREVIEW_MLOOPCOL", value: 32, isUnsigned: true)
!104 = !DIEnumerator(name: "CD_BM_ELEM_PYPTR", value: 33, isUnsigned: true)
!105 = !DIEnumerator(name: "CD_PAINT_MASK", value: 34, isUnsigned: true)
!106 = !DIEnumerator(name: "CD_GRID_PAINT_MASK", value: 35, isUnsigned: true)
!107 = !DIEnumerator(name: "CD_MVERT_SKIN", value: 36, isUnsigned: true)
!108 = !DIEnumerator(name: "CD_FREESTYLE_EDGE", value: 37, isUnsigned: true)
!109 = !DIEnumerator(name: "CD_FREESTYLE_FACE", value: 38, isUnsigned: true)
!110 = !DIEnumerator(name: "CD_MLOOPTANGENT", value: 39, isUnsigned: true)
!111 = !DIEnumerator(name: "CD_TESSLOOPNORMAL", value: 40, isUnsigned: true)
!112 = !DIEnumerator(name: "CD_NUMTYPES", value: 41, isUnsigned: true)
!113 = !{!114, !125}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mesh", file: !116, line: 133, baseType: !117)
!116 = !DIFile(filename: "blender/source/blender/makesdna/DNA_mesh_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mesh", file: !116, line: 58, size: 11008, elements: !118)
!118 = !{!119, !191, !195, !208, !211, !214, !218, !225, !234, !330, !336, !343, !351, !362, !375, !388, !399, !408, !420, !428, !430, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !117, file: !116, line: 59, baseType: !120, size: 960)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !121, line: 130, baseType: !122)
!121 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !121, line: 117, size: 960, elements: !123)
!123 = !{!124, !126, !127, !129, !149, !153, !155, !157, !158, !159}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !122, file: !121, line: 118, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !122, file: !121, line: 118, baseType: !125, size: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !122, file: !121, line: 119, baseType: !128, size: 64, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !122, file: !121, line: 120, baseType: !130, size: 64, offset: 192)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !121, line: 136, size: 17600, elements: !132)
!132 = !{!133, !134, !136, !139, !144, !145, !146}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !131, file: !121, line: 137, baseType: !120, size: 960)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !131, file: !121, line: 138, baseType: !135, size: 64, offset: 960)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !131, file: !121, line: 139, baseType: !137, size: 64, offset: 1024)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !121, line: 43, flags: DIFlagFwdDecl)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !131, file: !121, line: 140, baseType: !140, size: 8192, offset: 1088)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 8192, elements: !142)
!141 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!142 = !{!143}
!143 = !DISubrange(count: 1024)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !131, file: !121, line: 141, baseType: !140, size: 8192, offset: 9280)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !131, file: !121, line: 148, baseType: !130, size: 64, offset: 17472)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !131, file: !121, line: 150, baseType: !147, size: 64, offset: 17536)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !121, line: 45, flags: DIFlagFwdDecl)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !122, file: !121, line: 121, baseType: !150, size: 528, offset: 256)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 528, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 66)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !122, file: !121, line: 126, baseType: !154, size: 16, offset: 784)
!154 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !122, file: !121, line: 127, baseType: !156, size: 32, offset: 800)
!156 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !122, file: !121, line: 128, baseType: !156, size: 32, offset: 832)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !122, file: !121, line: 128, baseType: !156, size: 32, offset: 864)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !122, file: !121, line: 129, baseType: !160, size: 64, offset: 896)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !121, line: 75, baseType: !162)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !121, line: 62, size: 1024, elements: !163)
!163 = !{!164, !166, !167, !168, !169, !170, !174, !175, !189, !190}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !162, file: !121, line: 63, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !162, file: !121, line: 63, baseType: !165, size: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !162, file: !121, line: 64, baseType: !141, size: 8, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !162, file: !121, line: 64, baseType: !141, size: 8, offset: 136)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !162, file: !121, line: 65, baseType: !154, size: 16, offset: 144)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !162, file: !121, line: 66, baseType: !171, size: 512, offset: 160)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 512, elements: !172)
!172 = !{!173}
!173 = !DISubrange(count: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !162, file: !121, line: 67, baseType: !156, size: 32, offset: 672)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !162, file: !121, line: 69, baseType: !176, size: 256, offset: 704)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !121, line: 60, baseType: !177)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !121, line: 48, size: 256, elements: !178)
!178 = !{!179, !180, !187, !188}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !177, file: !121, line: 49, baseType: !125, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !177, file: !121, line: 58, baseType: !181, size: 128, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !182, line: 71, baseType: !183)
!182 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !182, line: 69, size: 128, elements: !184)
!184 = !{!185, !186}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !183, file: !182, line: 70, baseType: !125, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !183, file: !182, line: 70, baseType: !125, size: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !177, file: !121, line: 59, baseType: !156, size: 32, offset: 192)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !177, file: !121, line: 59, baseType: !156, size: 32, offset: 224)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !162, file: !121, line: 70, baseType: !156, size: 32, offset: 960)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !162, file: !121, line: 74, baseType: !156, size: 32, offset: 992)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !117, file: !116, line: 60, baseType: !192, size: 64, offset: 960)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !194, line: 45, flags: DIFlagFwdDecl)
!194 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!195 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !117, file: !116, line: 62, baseType: !196, size: 64, offset: 1024)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !198, line: 97, size: 832, elements: !199)
!198 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!199 = !{!200, !206, !207}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !197, file: !198, line: 98, baseType: !201, size: 768)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 768, elements: !203)
!202 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!203 = !{!204, !205}
!204 = !DISubrange(count: 8)
!205 = !DISubrange(count: 3)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !197, file: !198, line: 99, baseType: !156, size: 32, offset: 768)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !197, file: !198, line: 99, baseType: !156, size: 32, offset: 800)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !117, file: !116, line: 64, baseType: !209, size: 64, offset: 1088)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !194, line: 46, flags: DIFlagFwdDecl)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !117, file: !116, line: 65, baseType: !212, size: 64, offset: 1152)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "Key", file: !116, line: 42, flags: DIFlagFwdDecl)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !117, file: !116, line: 66, baseType: !215, size: 64, offset: 1216)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !198, line: 50, flags: DIFlagFwdDecl)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "mselect", scope: !117, file: !116, line: 67, baseType: !219, size: 64, offset: 1280)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MSelect", file: !221, line: 154, size: 64, elements: !222)
!221 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!222 = !{!223, !224}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !220, file: !221, line: 155, baseType: !156, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !220, file: !221, line: 156, baseType: !156, size: 32, offset: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "mpoly", scope: !117, file: !116, line: 71, baseType: !226, size: 64, offset: 1344)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !221, line: 79, size: 96, elements: !228)
!228 = !{!229, !230, !231, !232, !233}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !227, file: !221, line: 81, baseType: !156, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !227, file: !221, line: 82, baseType: !156, size: 32, offset: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !227, file: !221, line: 83, baseType: !154, size: 16, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !227, file: !221, line: 84, baseType: !141, size: 8, offset: 80)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !227, file: !221, line: 84, baseType: !141, size: 8, offset: 88)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "mtpoly", scope: !117, file: !116, line: 72, baseType: !235, size: 64, offset: 1408)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTexPoly", file: !221, line: 93, size: 128, elements: !237)
!237 = !{!238, !325, !326, !327, !328, !329}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !236, file: !221, line: 94, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !241, line: 77, size: 15424, elements: !242)
!241 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!242 = !{!243, !244, !245, !248, !251, !254, !257, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !276, !277, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !306, !307, !308, !314, !315, !319}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !240, file: !241, line: 78, baseType: !120, size: 960)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !240, file: !241, line: 80, baseType: !140, size: 8192, offset: 960)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !240, file: !241, line: 82, baseType: !246, size: 64, offset: 9152)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !241, line: 43, flags: DIFlagFwdDecl)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !240, file: !241, line: 83, baseType: !249, size: 64, offset: 9216)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !121, line: 46, flags: DIFlagFwdDecl)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !240, file: !241, line: 86, baseType: !252, size: 64, offset: 9280)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !241, line: 41, flags: DIFlagFwdDecl)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !240, file: !241, line: 87, baseType: !255, size: 64, offset: 9344)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !241, line: 44, flags: DIFlagFwdDecl)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !240, file: !241, line: 89, baseType: !258, size: 512, offset: 9408)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 512, elements: !259)
!259 = !{!204}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !240, file: !241, line: 90, baseType: !154, size: 16, offset: 9920)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !240, file: !241, line: 90, baseType: !154, size: 16, offset: 9936)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !240, file: !241, line: 92, baseType: !154, size: 16, offset: 9952)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !240, file: !241, line: 92, baseType: !154, size: 16, offset: 9968)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !240, file: !241, line: 93, baseType: !154, size: 16, offset: 9984)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !240, file: !241, line: 93, baseType: !154, size: 16, offset: 10000)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !240, file: !241, line: 94, baseType: !156, size: 32, offset: 10016)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !240, file: !241, line: 97, baseType: !154, size: 16, offset: 10048)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !240, file: !241, line: 97, baseType: !154, size: 16, offset: 10064)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !240, file: !241, line: 98, baseType: !154, size: 16, offset: 10080)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !240, file: !241, line: 98, baseType: !154, size: 16, offset: 10096)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !240, file: !241, line: 99, baseType: !154, size: 16, offset: 10112)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !240, file: !241, line: 99, baseType: !154, size: 16, offset: 10128)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !240, file: !241, line: 100, baseType: !5, size: 32, offset: 10144)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !240, file: !241, line: 101, baseType: !275, size: 64, offset: 10176)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !240, file: !241, line: 103, baseType: !147, size: 64, offset: 10240)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !240, file: !241, line: 104, baseType: !278, size: 64, offset: 10304)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !121, line: 159, size: 448, elements: !280)
!280 = !{!281, !285, !286, !288, !289, !291}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !279, file: !121, line: 161, baseType: !282, size: 64)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 2)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !279, file: !121, line: 162, baseType: !282, size: 64, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !279, file: !121, line: 163, baseType: !287, size: 32, offset: 128)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 32, elements: !283)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !279, file: !121, line: 164, baseType: !287, size: 32, offset: 160)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !279, file: !121, line: 165, baseType: !290, size: 128, offset: 192)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 128, elements: !283)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !279, file: !121, line: 166, baseType: !292, size: 128, offset: 320)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 128, elements: !283)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !240, file: !241, line: 107, baseType: !202, size: 32, offset: 10368)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !240, file: !241, line: 108, baseType: !156, size: 32, offset: 10400)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !240, file: !241, line: 109, baseType: !154, size: 16, offset: 10432)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !240, file: !241, line: 110, baseType: !154, size: 16, offset: 10448)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !240, file: !241, line: 113, baseType: !156, size: 32, offset: 10464)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !240, file: !241, line: 113, baseType: !156, size: 32, offset: 10496)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !240, file: !241, line: 114, baseType: !141, size: 8, offset: 10528)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !240, file: !241, line: 114, baseType: !141, size: 8, offset: 10536)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !240, file: !241, line: 115, baseType: !154, size: 16, offset: 10544)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !240, file: !241, line: 116, baseType: !303, size: 128, offset: 10560)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 128, elements: !304)
!304 = !{!305}
!305 = !DISubrange(count: 4)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !240, file: !241, line: 119, baseType: !202, size: 32, offset: 10688)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !240, file: !241, line: 119, baseType: !202, size: 32, offset: 10720)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !240, file: !241, line: 122, baseType: !309, size: 512, offset: 10752)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !310, line: 182, baseType: !311)
!310 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !310, line: 180, size: 512, elements: !312)
!312 = !{!313}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !311, file: !310, line: 181, baseType: !171, size: 512)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !240, file: !241, line: 123, baseType: !141, size: 8, offset: 11264)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !240, file: !241, line: 125, baseType: !316, size: 56, offset: 11272)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 56, elements: !317)
!317 = !{!318}
!318 = !DISubrange(count: 7)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !240, file: !241, line: 126, baseType: !320, size: 4096, offset: 11328)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 4096, elements: !259)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !241, line: 69, baseType: !322)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !241, line: 67, size: 512, elements: !323)
!323 = !{!324}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !322, file: !241, line: 68, baseType: !171, size: 512)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !236, file: !221, line: 95, baseType: !141, size: 8, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !236, file: !221, line: 95, baseType: !141, size: 8, offset: 72)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !236, file: !221, line: 96, baseType: !154, size: 16, offset: 80)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !236, file: !221, line: 96, baseType: !154, size: 16, offset: 96)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !236, file: !221, line: 96, baseType: !154, size: 16, offset: 112)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "mloop", scope: !117, file: !116, line: 73, baseType: !331, size: 64, offset: 1472)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !221, line: 88, size: 64, elements: !333)
!333 = !{!334, !335}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !332, file: !221, line: 89, baseType: !5, size: 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !332, file: !221, line: 90, baseType: !5, size: 32, offset: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "mloopuv", scope: !117, file: !116, line: 74, baseType: !337, size: 64, offset: 1536)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoopUV", file: !221, line: 109, size: 96, elements: !339)
!339 = !{!340, !342}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !338, file: !221, line: 110, baseType: !341, size: 64)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 64, elements: !283)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !338, file: !221, line: 111, baseType: !156, size: 32, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "mloopcol", scope: !117, file: !116, line: 75, baseType: !344, size: 64, offset: 1600)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoopCol", file: !221, line: 129, size: 32, elements: !346)
!346 = !{!347, !348, !349, !350}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !345, file: !221, line: 130, baseType: !141, size: 8)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !345, file: !221, line: 130, baseType: !141, size: 8, offset: 8)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !345, file: !221, line: 130, baseType: !141, size: 8, offset: 16)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !345, file: !221, line: 130, baseType: !141, size: 8, offset: 24)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "mface", scope: !117, file: !116, line: 80, baseType: !352, size: 64, offset: 1664)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !221, line: 42, size: 160, elements: !354)
!354 = !{!355, !356, !357, !358, !359, !360, !361}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !353, file: !221, line: 43, baseType: !5, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !353, file: !221, line: 43, baseType: !5, size: 32, offset: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !353, file: !221, line: 43, baseType: !5, size: 32, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !353, file: !221, line: 43, baseType: !5, size: 32, offset: 96)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !353, file: !221, line: 44, baseType: !154, size: 16, offset: 128)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !353, file: !221, line: 45, baseType: !141, size: 8, offset: 144)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !353, file: !221, line: 45, baseType: !141, size: 8, offset: 152)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "mtface", scope: !117, file: !116, line: 81, baseType: !363, size: 64, offset: 1728)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !221, line: 160, size: 384, elements: !365)
!365 = !{!366, !369, !370, !371, !372, !373, !374}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !364, file: !221, line: 161, baseType: !367, size: 256)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 256, elements: !368)
!368 = !{!305, !284}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !364, file: !221, line: 162, baseType: !239, size: 64, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !364, file: !221, line: 163, baseType: !141, size: 8, offset: 320)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !364, file: !221, line: 163, baseType: !141, size: 8, offset: 328)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !364, file: !221, line: 164, baseType: !154, size: 16, offset: 336)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !364, file: !221, line: 164, baseType: !154, size: 16, offset: 352)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !364, file: !221, line: 164, baseType: !154, size: 16, offset: 368)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "tface", scope: !117, file: !116, line: 82, baseType: !376, size: 64, offset: 1792)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TFace", file: !116, line: 136, size: 512, elements: !378)
!378 = !{!379, !380, !381, !383, !384, !385, !386, !387}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !377, file: !116, line: 137, baseType: !125, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !377, file: !116, line: 138, baseType: !367, size: 256, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !377, file: !116, line: 139, baseType: !382, size: 128, offset: 320)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 128, elements: !304)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !377, file: !116, line: 140, baseType: !141, size: 8, offset: 448)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !377, file: !116, line: 140, baseType: !141, size: 8, offset: 456)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !377, file: !116, line: 141, baseType: !154, size: 16, offset: 464)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !377, file: !116, line: 141, baseType: !154, size: 16, offset: 480)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !377, file: !116, line: 141, baseType: !154, size: 16, offset: 496)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "mvert", scope: !117, file: !116, line: 83, baseType: !389, size: 64, offset: 1856)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !221, line: 65, size: 160, elements: !391)
!391 = !{!392, !395, !397, !398}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !390, file: !221, line: 66, baseType: !393, size: 96)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 96, elements: !394)
!394 = !{!205}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !390, file: !221, line: 67, baseType: !396, size: 48, offset: 96)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 48, elements: !394)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !390, file: !221, line: 68, baseType: !141, size: 8, offset: 144)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !390, file: !221, line: 68, baseType: !141, size: 8, offset: 152)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "medge", scope: !117, file: !116, line: 84, baseType: !400, size: 64, offset: 1920)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !221, line: 48, size: 96, elements: !402)
!402 = !{!403, !404, !405, !406, !407}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !401, file: !221, line: 49, baseType: !5, size: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !401, file: !221, line: 49, baseType: !5, size: 32, offset: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !401, file: !221, line: 50, baseType: !141, size: 8, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !401, file: !221, line: 50, baseType: !141, size: 8, offset: 72)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !401, file: !221, line: 51, baseType: !154, size: 16, offset: 80)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "dvert", scope: !117, file: !116, line: 85, baseType: !409, size: 64, offset: 1984)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !221, line: 59, size: 128, elements: !411)
!411 = !{!412, !418, !419}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "dw", scope: !410, file: !221, line: 60, baseType: !413, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformWeight", file: !221, line: 54, size: 64, elements: !415)
!415 = !{!416, !417}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "def_nr", scope: !414, file: !221, line: 55, baseType: !156, size: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !414, file: !221, line: 56, baseType: !202, size: 32, offset: 32)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "totweight", scope: !410, file: !221, line: 61, baseType: !156, size: 32, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !410, file: !221, line: 62, baseType: !156, size: 32, offset: 96)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "mcol", scope: !117, file: !116, line: 89, baseType: !421, size: 64, offset: 2048)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MCol", file: !221, line: 74, size: 32, elements: !423)
!423 = !{!424, !425, !426, !427}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !422, file: !221, line: 75, baseType: !141, size: 8)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !422, file: !221, line: 75, baseType: !141, size: 8, offset: 8)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !422, file: !221, line: 75, baseType: !141, size: 8, offset: 16)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !422, file: !221, line: 75, baseType: !141, size: 8, offset: 24)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "texcomesh", scope: !117, file: !116, line: 90, baseType: !429, size: 64, offset: 2112)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "edit_btmesh", scope: !117, file: !116, line: 93, baseType: !431, size: 64, offset: 2176)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEditMesh", file: !433, line: 54, size: 896, elements: !434)
!433 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_editmesh.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!434 = !{!435, !630, !631, !632, !635, !636, !1217, !1218, !1221, !1224, !1225, !1226, !1227, !1228, !1229, !1230}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "bm", scope: !432, file: !433, line: 55, baseType: !436, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !438, line: 186, size: 8064, elements: !439)
!438 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!439 = !{!440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !452, !453, !454, !455, !516, !520, !524, !525, !526, !527, !528, !529, !530, !531, !586, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !437, file: !438, line: 187, baseType: !156, size: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !437, file: !438, line: 187, baseType: !156, size: 32, offset: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !437, file: !438, line: 187, baseType: !156, size: 32, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !437, file: !438, line: 187, baseType: !156, size: 32, offset: 96)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !437, file: !438, line: 188, baseType: !156, size: 32, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !437, file: !438, line: 188, baseType: !156, size: 32, offset: 160)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !437, file: !438, line: 188, baseType: !156, size: 32, offset: 192)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !437, file: !438, line: 193, baseType: !141, size: 8, offset: 224)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !437, file: !438, line: 197, baseType: !141, size: 8, offset: 232)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !437, file: !438, line: 201, baseType: !450, size: 64, offset: 256)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !70, line: 71, flags: DIFlagFwdDecl)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !437, file: !438, line: 201, baseType: !450, size: 64, offset: 320)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !437, file: !438, line: 201, baseType: !450, size: 64, offset: 384)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !437, file: !438, line: 201, baseType: !450, size: 64, offset: 448)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !437, file: !438, line: 208, baseType: !456, size: 64, offset: 512)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !438, line: 103, baseType: !459)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !438, line: 90, size: 448, elements: !460)
!460 = !{!461, !470, !475, !476, !477}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !459, file: !438, line: 91, baseType: !462, size: 128)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !438, line: 82, baseType: !463)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !438, line: 64, size: 128, elements: !464)
!464 = !{!465, !466, !467, !468, !469}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !463, file: !438, line: 65, baseType: !125, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !463, file: !438, line: 66, baseType: !156, size: 32, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !463, file: !438, line: 73, baseType: !141, size: 8, offset: 96)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !463, file: !438, line: 74, baseType: !141, size: 8, offset: 104)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !463, file: !438, line: 80, baseType: !141, size: 8, offset: 112)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !459, file: !438, line: 92, baseType: !471, size: 64, offset: 128)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !438, line: 180, size: 16, elements: !473)
!473 = !{!474}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !472, file: !438, line: 181, baseType: !154, size: 16)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !459, file: !438, line: 94, baseType: !393, size: 96, offset: 192)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !459, file: !438, line: 95, baseType: !393, size: 96, offset: 288)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !459, file: !438, line: 102, baseType: !478, size: 64, offset: 384)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !438, line: 110, size: 640, elements: !480)
!480 = !{!481, !482, !483, !485, !486, !509, !515}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !479, file: !438, line: 111, baseType: !462, size: 128)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !479, file: !438, line: 112, baseType: !471, size: 64, offset: 128)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !479, file: !438, line: 114, baseType: !484, size: 64, offset: 192)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !479, file: !438, line: 114, baseType: !484, size: 64, offset: 256)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !479, file: !438, line: 118, baseType: !487, size: 64, offset: 320)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !438, line: 125, size: 576, elements: !489)
!489 = !{!490, !491, !492, !493, !505, !506, !507, !508}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !488, file: !438, line: 126, baseType: !462, size: 128)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !488, file: !438, line: 129, baseType: !484, size: 64, offset: 128)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !488, file: !438, line: 130, baseType: !478, size: 64, offset: 192)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !488, file: !438, line: 131, baseType: !494, size: 64, offset: 256)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !438, line: 164, size: 448, elements: !496)
!496 = !{!497, !498, !499, !502, !503, !504}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !495, file: !438, line: 165, baseType: !462, size: 128)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !495, file: !438, line: 166, baseType: !471, size: 64, offset: 128)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !495, file: !438, line: 172, baseType: !500, size: 64, offset: 192)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !438, line: 140, baseType: !488)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !495, file: !438, line: 174, baseType: !156, size: 32, offset: 256)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !495, file: !438, line: 175, baseType: !393, size: 96, offset: 288)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !495, file: !438, line: 176, baseType: !154, size: 16, offset: 384)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !488, file: !438, line: 135, baseType: !487, size: 64, offset: 320)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !488, file: !438, line: 135, baseType: !487, size: 64, offset: 384)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !488, file: !438, line: 139, baseType: !487, size: 64, offset: 448)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !488, file: !438, line: 139, baseType: !487, size: 64, offset: 512)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !479, file: !438, line: 122, baseType: !510, size: 128, offset: 384)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !438, line: 108, baseType: !511)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !438, line: 106, size: 128, elements: !512)
!512 = !{!513, !514}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !511, file: !438, line: 107, baseType: !478, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !511, file: !438, line: 107, baseType: !478, size: 64, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !479, file: !438, line: 122, baseType: !510, size: 128, offset: 512)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !437, file: !438, line: 209, baseType: !517, size: 64, offset: 576)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !438, line: 123, baseType: !479)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !437, file: !438, line: 210, baseType: !521, size: 64, offset: 640)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !438, line: 178, baseType: !495)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !437, file: !438, line: 213, baseType: !156, size: 32, offset: 704)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !437, file: !438, line: 214, baseType: !156, size: 32, offset: 736)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !437, file: !438, line: 215, baseType: !156, size: 32, offset: 768)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !437, file: !438, line: 218, baseType: !450, size: 64, offset: 832)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !437, file: !438, line: 218, baseType: !450, size: 64, offset: 896)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !437, file: !438, line: 218, baseType: !450, size: 64, offset: 960)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !437, file: !438, line: 220, baseType: !156, size: 32, offset: 1024)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !437, file: !438, line: 221, baseType: !532, size: 64, offset: 1088)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !4, line: 190, size: 10496, elements: !534)
!534 = !{!535, !572, !573, !579, !582, !583, !585}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !533, file: !4, line: 191, baseType: !536, size: 5120)
!536 = !DICompositeType(tag: DW_TAG_array_type, baseType: !537, size: 5120, elements: !570)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !4, line: 147, size: 320, elements: !538)
!538 = !{!539, !542, !544, !554, !555}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !537, file: !4, line: 148, baseType: !540, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !537, file: !4, line: 149, baseType: !543, size: 32, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !4, line: 112, baseType: !3)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !537, file: !4, line: 150, baseType: !545, size: 32, offset: 96)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !4, line: 142, baseType: !546)
!546 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !4, line: 138, size: 32, elements: !547)
!547 = !{!548, !550, !552}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !546, file: !4, line: 139, baseType: !549, size: 32)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !4, line: 122, baseType: !15)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !546, file: !4, line: 140, baseType: !551, size: 32)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !4, line: 136, baseType: !21)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !546, file: !4, line: 141, baseType: !553, size: 32)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !4, line: 130, baseType: !27)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !537, file: !4, line: 152, baseType: !156, size: 32, offset: 128)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !537, file: !4, line: 162, baseType: !556, size: 128, offset: 192)
!556 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !537, file: !4, line: 155, size: 128, elements: !557)
!557 = !{!558, !559, !560, !561, !562, !564}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !556, file: !4, line: 156, baseType: !156, size: 32)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !556, file: !4, line: 157, baseType: !202, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !556, file: !4, line: 158, baseType: !125, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !556, file: !4, line: 159, baseType: !393, size: 96)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !556, file: !4, line: 160, baseType: !563, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !556, file: !4, line: 161, baseType: !565, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !567, line: 48, baseType: !568)
!567 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!568 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !569, line: 47, flags: DIFlagFwdDecl)
!569 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!570 = !{!571}
!571 = !DISubrange(count: 16)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !533, file: !4, line: 192, baseType: !536, size: 5120, offset: 5120)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !533, file: !4, line: 193, baseType: !574, size: 64, offset: 10240)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DISubroutineType(types: !576)
!576 = !{null, !577, !532}
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !438, line: 246, baseType: !437)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !533, file: !4, line: 194, baseType: !580, size: 64, offset: 10304)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !4, line: 194, flags: DIFlagFwdDecl)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !533, file: !4, line: 195, baseType: !156, size: 32, offset: 10368)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !533, file: !4, line: 196, baseType: !584, size: 32, offset: 10400)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !4, line: 188, baseType: !35)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !533, file: !4, line: 197, baseType: !156, size: 32, offset: 10432)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !437, file: !438, line: 223, baseType: !587, size: 1600, offset: 1152)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !70, line: 73, baseType: !588)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !70, line: 64, size: 1600, elements: !589)
!589 = !{!590, !605, !609, !610, !611, !612, !613}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !588, file: !70, line: 65, baseType: !591, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !70, line: 53, baseType: !593)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !70, line: 42, size: 832, elements: !594)
!594 = !{!595, !596, !597, !598, !599, !600, !601, !602, !603, !604}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !593, file: !70, line: 43, baseType: !156, size: 32)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !593, file: !70, line: 44, baseType: !156, size: 32, offset: 32)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !593, file: !70, line: 45, baseType: !156, size: 32, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !593, file: !70, line: 46, baseType: !156, size: 32, offset: 96)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !593, file: !70, line: 47, baseType: !156, size: 32, offset: 128)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !593, file: !70, line: 48, baseType: !156, size: 32, offset: 160)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !593, file: !70, line: 49, baseType: !156, size: 32, offset: 192)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !593, file: !70, line: 50, baseType: !156, size: 32, offset: 224)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !593, file: !70, line: 51, baseType: !171, size: 512, offset: 256)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !593, file: !70, line: 52, baseType: !125, size: 64, offset: 768)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !588, file: !70, line: 66, baseType: !606, size: 1312, offset: 64)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 1312, elements: !607)
!607 = !{!608}
!608 = !DISubrange(count: 41)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !588, file: !70, line: 69, baseType: !156, size: 32, offset: 1376)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !588, file: !70, line: 69, baseType: !156, size: 32, offset: 1408)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !588, file: !70, line: 70, baseType: !156, size: 32, offset: 1440)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !588, file: !70, line: 71, baseType: !450, size: 64, offset: 1472)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !588, file: !70, line: 72, baseType: !614, size: 64, offset: 1536)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !70, line: 59, baseType: !616)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !70, line: 57, size: 8192, elements: !617)
!617 = !{!618}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !616, file: !70, line: 58, baseType: !140, size: 8192)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !437, file: !438, line: 223, baseType: !587, size: 1600, offset: 2752)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !437, file: !438, line: 223, baseType: !587, size: 1600, offset: 4352)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !437, file: !438, line: 223, baseType: !587, size: 1600, offset: 5952)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !437, file: !438, line: 233, baseType: !154, size: 16, offset: 7552)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !437, file: !438, line: 236, baseType: !156, size: 32, offset: 7584)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !437, file: !438, line: 238, baseType: !156, size: 32, offset: 7616)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !437, file: !438, line: 238, baseType: !156, size: 32, offset: 7648)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !437, file: !438, line: 239, baseType: !181, size: 128, offset: 7680)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !437, file: !438, line: 241, baseType: !522, size: 64, offset: 7808)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !437, file: !438, line: 243, baseType: !181, size: 128, offset: 7872)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !437, file: !438, line: 245, baseType: !125, size: 64, offset: 8000)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "emcopy", scope: !432, file: !433, line: 58, baseType: !431, size: 64, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "emcopyusers", scope: !432, file: !433, line: 59, baseType: !156, size: 32, offset: 128)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "looptris", scope: !432, file: !433, line: 63, baseType: !633, size: 64, offset: 192)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !487, size: 192, elements: !394)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "tottri", scope: !432, file: !433, line: 64, baseType: !156, size: 32, offset: 256)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !432, file: !433, line: 67, baseType: !637, size: 64, offset: 320)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !43, line: 178, size: 13504, elements: !639)
!639 = !{!640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !657, !660, !662, !663, !665, !666, !667, !668, !674, !679, !680, !684, !685, !686, !687, !688, !692, !696, !700, !704, !708, !712, !716, !720, !724, !728, !732, !736, !740, !741, !742, !743, !744, !745, !749, !750, !751, !752, !756, !757, !758, !759, !760, !765, !766, !767, !768, !769, !773, !774, !775, !776, !777, !784, !795, !800, !806, !816, !821, !832, !839, !846, !850, !855, !859, !864, !865, !866, !1136, !1142, !1143, !1144, !1149, !1150, !1159, !1174, !1178, !1186, !1190, !1194, !1198, !1206, !1216}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !638, file: !43, line: 180, baseType: !587, size: 1600)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !638, file: !43, line: 180, baseType: !587, size: 1600, offset: 1600)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !638, file: !43, line: 180, baseType: !587, size: 1600, offset: 3200)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !638, file: !43, line: 180, baseType: !587, size: 1600, offset: 4800)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !638, file: !43, line: 180, baseType: !587, size: 1600, offset: 6400)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !638, file: !43, line: 181, baseType: !156, size: 32, offset: 8000)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !638, file: !43, line: 181, baseType: !156, size: 32, offset: 8032)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !638, file: !43, line: 181, baseType: !156, size: 32, offset: 8064)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !638, file: !43, line: 181, baseType: !156, size: 32, offset: 8096)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !638, file: !43, line: 181, baseType: !156, size: 32, offset: 8128)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !638, file: !43, line: 182, baseType: !156, size: 32, offset: 8160)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !638, file: !43, line: 183, baseType: !156, size: 32, offset: 8192)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !638, file: !43, line: 184, baseType: !653, size: 64, offset: 8256)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !654, line: 124, baseType: !655)
!654 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !654, line: 124, flags: DIFlagFwdDecl)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !638, file: !43, line: 185, baseType: !658, size: 64, offset: 8320)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !43, line: 97, flags: DIFlagFwdDecl)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !638, file: !43, line: 186, baseType: !661, size: 32, offset: 8384)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !43, line: 132, baseType: !42)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !638, file: !43, line: 187, baseType: !202, size: 32, offset: 8416)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !638, file: !43, line: 188, baseType: !664, size: 32, offset: 8448)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !43, line: 175, baseType: !48)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !638, file: !43, line: 189, baseType: !156, size: 32, offset: 8480)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !638, file: !43, line: 190, baseType: !215, size: 64, offset: 8512)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !638, file: !43, line: 193, baseType: !141, size: 8, offset: 8576)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !638, file: !43, line: 196, baseType: !669, size: 64, offset: 8640)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DISubroutineType(types: !671)
!671 = !{null, !672}
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !43, line: 177, baseType: !638)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !638, file: !43, line: 199, baseType: !675, size: 64, offset: 8704)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DISubroutineType(types: !677)
!677 = !{null, !672, !678}
!678 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !638, file: !43, line: 202, baseType: !669, size: 64, offset: 8768)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !638, file: !43, line: 207, baseType: !681, size: 64, offset: 8832)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DISubroutineType(types: !683)
!683 = !{!156, !672}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !638, file: !43, line: 208, baseType: !681, size: 64, offset: 8896)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !638, file: !43, line: 209, baseType: !681, size: 64, offset: 8960)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !638, file: !43, line: 210, baseType: !681, size: 64, offset: 9024)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !638, file: !43, line: 211, baseType: !681, size: 64, offset: 9088)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !638, file: !43, line: 218, baseType: !689, size: 64, offset: 9152)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DISubroutineType(types: !691)
!691 = !{null, !672, !156, !389}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !638, file: !43, line: 219, baseType: !693, size: 64, offset: 9216)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DISubroutineType(types: !695)
!695 = !{null, !672, !156, !400}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !638, file: !43, line: 220, baseType: !697, size: 64, offset: 9280)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DISubroutineType(types: !699)
!699 = !{null, !672, !156, !352}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !638, file: !43, line: 227, baseType: !701, size: 64, offset: 9344)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DISubroutineType(types: !703)
!703 = !{!389, !672}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !638, file: !43, line: 228, baseType: !705, size: 64, offset: 9408)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{!400, !672}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !638, file: !43, line: 229, baseType: !709, size: 64, offset: 9472)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DISubroutineType(types: !711)
!711 = !{!352, !672}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !638, file: !43, line: 230, baseType: !713, size: 64, offset: 9536)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DISubroutineType(types: !715)
!715 = !{!331, !672}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !638, file: !43, line: 231, baseType: !717, size: 64, offset: 9600)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DISubroutineType(types: !719)
!719 = !{!226, !672}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !638, file: !43, line: 236, baseType: !721, size: 64, offset: 9664)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DISubroutineType(types: !723)
!723 = !{null, !672, !389}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !638, file: !43, line: 237, baseType: !725, size: 64, offset: 9728)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DISubroutineType(types: !727)
!727 = !{null, !672, !400}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !638, file: !43, line: 238, baseType: !729, size: 64, offset: 9792)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DISubroutineType(types: !731)
!731 = !{null, !672, !352}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !638, file: !43, line: 239, baseType: !733, size: 64, offset: 9856)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DISubroutineType(types: !735)
!735 = !{null, !672, !331}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !638, file: !43, line: 240, baseType: !737, size: 64, offset: 9920)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{null, !672, !226}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !638, file: !43, line: 245, baseType: !701, size: 64, offset: 9984)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !638, file: !43, line: 246, baseType: !705, size: 64, offset: 10048)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !638, file: !43, line: 247, baseType: !709, size: 64, offset: 10112)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !638, file: !43, line: 248, baseType: !713, size: 64, offset: 10176)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !638, file: !43, line: 249, baseType: !717, size: 64, offset: 10240)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !638, file: !43, line: 255, baseType: !746, size: 64, offset: 10304)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{!125, !672, !156, !156}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !638, file: !43, line: 256, baseType: !746, size: 64, offset: 10368)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !638, file: !43, line: 257, baseType: !746, size: 64, offset: 10432)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !638, file: !43, line: 258, baseType: !746, size: 64, offset: 10496)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !638, file: !43, line: 264, baseType: !753, size: 64, offset: 10560)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{!125, !672, !156}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !638, file: !43, line: 265, baseType: !753, size: 64, offset: 10624)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !638, file: !43, line: 266, baseType: !753, size: 64, offset: 10688)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !638, file: !43, line: 267, baseType: !753, size: 64, offset: 10752)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !638, file: !43, line: 268, baseType: !753, size: 64, offset: 10816)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataLayout", scope: !638, file: !43, line: 272, baseType: !761, size: 64, offset: 10880)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DISubroutineType(types: !763)
!763 = !{!764, !672}
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataLayout", scope: !638, file: !43, line: 273, baseType: !761, size: 64, offset: 10944)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataLayout", scope: !638, file: !43, line: 274, baseType: !761, size: 64, offset: 11008)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataLayout", scope: !638, file: !43, line: 275, baseType: !761, size: 64, offset: 11072)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataLayout", scope: !638, file: !43, line: 276, baseType: !761, size: 64, offset: 11136)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromVertCData", scope: !638, file: !43, line: 279, baseType: !770, size: 64, offset: 11200)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DISubroutineType(types: !772)
!772 = !{null, !672, !156, !764, !156}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromEdgeCData", scope: !638, file: !43, line: 280, baseType: !770, size: 64, offset: 11264)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromFaceCData", scope: !638, file: !43, line: 281, baseType: !770, size: 64, offset: 11328)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "getNumGrids", scope: !638, file: !43, line: 284, baseType: !681, size: 64, offset: 11392)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "getGridSize", scope: !638, file: !43, line: 285, baseType: !681, size: 64, offset: 11456)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "getGridData", scope: !638, file: !43, line: 286, baseType: !778, size: 64, offset: 11520)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DISubroutineType(types: !780)
!780 = !{!781, !672}
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !43, line: 82, flags: DIFlagFwdDecl)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "getGridAdjacency", scope: !638, file: !43, line: 287, baseType: !785, size: 64, offset: 11584)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DISubroutineType(types: !787)
!787 = !{!788, !672}
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGridAdjacency", file: !43, line: 120, baseType: !790)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMGridAdjacency", file: !43, line: 117, size: 256, elements: !791)
!791 = !{!792, !794}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !790, file: !43, line: 118, baseType: !793, size: 128)
!793 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 128, elements: !304)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !790, file: !43, line: 119, baseType: !793, size: 128, offset: 128)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "getGridOffset", scope: !638, file: !43, line: 288, baseType: !796, size: 64, offset: 11648)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DISubroutineType(types: !798)
!798 = !{!799, !672}
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "getGridKey", scope: !638, file: !43, line: 289, baseType: !801, size: 64, offset: 11712)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DISubroutineType(types: !803)
!803 = !{null, !672, !804}
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGKey", file: !43, line: 83, flags: DIFlagFwdDecl)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "getGridFlagMats", scope: !638, file: !43, line: 290, baseType: !807, size: 64, offset: 11776)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DISubroutineType(types: !809)
!809 = !{!810, !672}
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFlagMat", file: !43, line: 126, baseType: !812)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMFlagMat", file: !43, line: 123, size: 32, elements: !813)
!813 = !{!814, !815}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !812, file: !43, line: 124, baseType: !154, size: 16)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !812, file: !43, line: 125, baseType: !141, size: 8, offset: 16)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "getGridHidden", scope: !638, file: !43, line: 291, baseType: !817, size: 64, offset: 11840)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DISubroutineType(types: !819)
!819 = !{!820, !672}
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedVert", scope: !638, file: !43, line: 299, baseType: !822, size: 64, offset: 11904)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DISubroutineType(types: !824)
!824 = !{null, !672, !825, !125, !831}
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DISubroutineType(types: !827)
!827 = !{null, !125, !156, !828, !828, !829}
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !154)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMForeachFlag", file: !43, line: 162, baseType: !53)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedEdge", scope: !638, file: !43, line: 309, baseType: !833, size: 64, offset: 11968)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DISubroutineType(types: !835)
!835 = !{null, !672, !836, !125}
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DISubroutineType(types: !838)
!838 = !{null, !125, !156, !828, !828}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedLoop", scope: !638, file: !43, line: 317, baseType: !840, size: 64, offset: 12032)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DISubroutineType(types: !842)
!842 = !{null, !672, !843, !125, !831}
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DISubroutineType(types: !845)
!845 = !{null, !125, !156, !156, !828, !828}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedFaceCenter", scope: !638, file: !43, line: 327, baseType: !847, size: 64, offset: 12096)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DISubroutineType(types: !849)
!849 = !{null, !672, !836, !125, !831}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "getMinMax", scope: !638, file: !43, line: 337, baseType: !851, size: 64, offset: 12160)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DISubroutineType(types: !853)
!853 = !{null, !672, !854, !854}
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCo", scope: !638, file: !43, line: 344, baseType: !856, size: 64, offset: 12224)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DISubroutineType(types: !858)
!858 = !{null, !672, !156, !854}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCos", scope: !638, file: !43, line: 347, baseType: !860, size: 64, offset: 12288)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DISubroutineType(types: !862)
!862 = !{null, !672, !863}
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "getVertNo", scope: !638, file: !43, line: 350, baseType: !856, size: 64, offset: 12352)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyNo", scope: !638, file: !43, line: 351, baseType: !856, size: 64, offset: 12416)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyMap", scope: !638, file: !43, line: 355, baseType: !867, size: 64, offset: 12480)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DISubroutineType(types: !869)
!869 = !{!870, !873, !672}
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !872)
!872 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !43, line: 355, flags: DIFlagFwdDecl)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !198, line: 115, size: 11392, elements: !875)
!875 = !{!876, !877, !878, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !907, !908, !948, !949, !952, !953, !969, !970, !971, !972, !973, !974, !975, !976, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1065, !1068, !1071, !1072, !1073, !1074, !1075, !1078, !1081, !1082, !1083, !1089, !1090, !1091, !1092, !1093, !1094, !1096, !1099, !1102, !1103, !1124, !1125}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !874, file: !198, line: 116, baseType: !120, size: 960)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !874, file: !198, line: 117, baseType: !192, size: 64, offset: 960)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !874, file: !198, line: 119, baseType: !879, size: 64, offset: 1024)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !198, line: 57, flags: DIFlagFwdDecl)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !874, file: !198, line: 121, baseType: !154, size: 16, offset: 1088)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !874, file: !198, line: 121, baseType: !154, size: 16, offset: 1104)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !874, file: !198, line: 122, baseType: !156, size: 32, offset: 1120)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !874, file: !198, line: 122, baseType: !156, size: 32, offset: 1152)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !874, file: !198, line: 122, baseType: !156, size: 32, offset: 1184)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !874, file: !198, line: 123, baseType: !171, size: 512, offset: 1216)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !874, file: !198, line: 124, baseType: !873, size: 64, offset: 1728)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !874, file: !198, line: 124, baseType: !873, size: 64, offset: 1792)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !874, file: !198, line: 127, baseType: !873, size: 64, offset: 1856)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !874, file: !198, line: 127, baseType: !873, size: 64, offset: 1920)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !874, file: !198, line: 127, baseType: !873, size: 64, offset: 1984)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !874, file: !198, line: 128, baseType: !209, size: 64, offset: 2048)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !874, file: !198, line: 130, baseType: !196, size: 64, offset: 2112)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !874, file: !198, line: 131, baseType: !895, size: 64, offset: 2176)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !569, line: 486, size: 1600, elements: !897)
!897 = !{!898, !899, !900, !901, !902, !903, !904, !905, !906}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !896, file: !569, line: 487, baseType: !120, size: 960)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !896, file: !569, line: 489, baseType: !181, size: 128, offset: 960)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !896, file: !569, line: 490, baseType: !181, size: 128, offset: 1088)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !896, file: !569, line: 491, baseType: !181, size: 128, offset: 1216)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !896, file: !569, line: 492, baseType: !181, size: 128, offset: 1344)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !896, file: !569, line: 494, baseType: !156, size: 32, offset: 1472)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !896, file: !569, line: 495, baseType: !156, size: 32, offset: 1504)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !896, file: !569, line: 497, baseType: !156, size: 32, offset: 1536)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !896, file: !569, line: 498, baseType: !156, size: 32, offset: 1568)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !874, file: !198, line: 132, baseType: !895, size: 64, offset: 2240)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !874, file: !198, line: 133, baseType: !909, size: 64, offset: 2304)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !569, line: 334, size: 1728, elements: !911)
!911 = !{!912, !913, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !947}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !910, file: !569, line: 335, baseType: !181, size: 128)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !910, file: !569, line: 336, baseType: !914, size: 64, offset: 128)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !910, file: !569, line: 338, baseType: !154, size: 16, offset: 192)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !910, file: !569, line: 338, baseType: !154, size: 16, offset: 208)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !910, file: !569, line: 339, baseType: !5, size: 32, offset: 224)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !910, file: !569, line: 340, baseType: !156, size: 32, offset: 256)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !910, file: !569, line: 342, baseType: !202, size: 32, offset: 288)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !910, file: !569, line: 343, baseType: !393, size: 96, offset: 320)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !910, file: !569, line: 344, baseType: !393, size: 96, offset: 416)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !910, file: !569, line: 347, baseType: !181, size: 128, offset: 512)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !910, file: !569, line: 349, baseType: !156, size: 32, offset: 640)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !910, file: !569, line: 350, baseType: !156, size: 32, offset: 672)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !910, file: !569, line: 351, baseType: !125, size: 64, offset: 704)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !910, file: !569, line: 352, baseType: !125, size: 64, offset: 768)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !910, file: !569, line: 354, baseType: !928, size: 384, offset: 832)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !569, line: 116, baseType: !929)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !569, line: 94, size: 384, elements: !930)
!930 = !{!931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !929, file: !569, line: 96, baseType: !156, size: 32)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !929, file: !569, line: 96, baseType: !156, size: 32, offset: 32)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !929, file: !569, line: 97, baseType: !156, size: 32, offset: 64)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !929, file: !569, line: 97, baseType: !156, size: 32, offset: 96)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !929, file: !569, line: 99, baseType: !154, size: 16, offset: 128)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !929, file: !569, line: 100, baseType: !154, size: 16, offset: 144)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !929, file: !569, line: 102, baseType: !154, size: 16, offset: 160)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !929, file: !569, line: 105, baseType: !154, size: 16, offset: 176)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !929, file: !569, line: 108, baseType: !154, size: 16, offset: 192)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !929, file: !569, line: 109, baseType: !154, size: 16, offset: 208)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !929, file: !569, line: 111, baseType: !154, size: 16, offset: 224)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !929, file: !569, line: 112, baseType: !154, size: 16, offset: 240)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !929, file: !569, line: 114, baseType: !156, size: 32, offset: 256)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !929, file: !569, line: 114, baseType: !156, size: 32, offset: 288)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !929, file: !569, line: 115, baseType: !156, size: 32, offset: 320)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !929, file: !569, line: 115, baseType: !156, size: 32, offset: 352)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !910, file: !569, line: 355, baseType: !171, size: 512, offset: 1216)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !874, file: !198, line: 134, baseType: !125, size: 64, offset: 2368)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !874, file: !198, line: 136, baseType: !950, size: 64, offset: 2432)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !198, line: 58, flags: DIFlagFwdDecl)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !874, file: !198, line: 138, baseType: !928, size: 384, offset: 2496)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !874, file: !198, line: 139, baseType: !954, size: 64, offset: 2880)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !569, line: 80, baseType: !956)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !569, line: 72, size: 192, elements: !957)
!957 = !{!958, !965, !966, !967, !968}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !956, file: !569, line: 73, baseType: !959, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !569, line: 59, baseType: !961)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !569, line: 56, size: 128, elements: !962)
!962 = !{!963, !964}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !961, file: !569, line: 57, baseType: !393, size: 96)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !961, file: !569, line: 58, baseType: !156, size: 32, offset: 96)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !956, file: !569, line: 74, baseType: !156, size: 32, offset: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !956, file: !569, line: 76, baseType: !156, size: 32, offset: 96)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !956, file: !569, line: 77, baseType: !156, size: 32, offset: 128)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !956, file: !569, line: 79, baseType: !156, size: 32, offset: 160)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !874, file: !198, line: 141, baseType: !181, size: 128, offset: 2944)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !874, file: !198, line: 142, baseType: !181, size: 128, offset: 3072)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !874, file: !198, line: 143, baseType: !181, size: 128, offset: 3200)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !874, file: !198, line: 144, baseType: !181, size: 128, offset: 3328)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !874, file: !198, line: 146, baseType: !156, size: 32, offset: 3456)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !874, file: !198, line: 147, baseType: !156, size: 32, offset: 3488)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !874, file: !198, line: 150, baseType: !215, size: 64, offset: 3520)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !874, file: !198, line: 151, baseType: !977, size: 64, offset: 3584)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !874, file: !198, line: 152, baseType: !156, size: 32, offset: 3648)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !874, file: !198, line: 153, baseType: !156, size: 32, offset: 3680)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !874, file: !198, line: 156, baseType: !393, size: 96, offset: 3712)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !874, file: !198, line: 156, baseType: !393, size: 96, offset: 3808)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !874, file: !198, line: 156, baseType: !393, size: 96, offset: 3904)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !874, file: !198, line: 157, baseType: !393, size: 96, offset: 4000)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !874, file: !198, line: 158, baseType: !393, size: 96, offset: 4096)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !874, file: !198, line: 159, baseType: !393, size: 96, offset: 4192)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !874, file: !198, line: 160, baseType: !393, size: 96, offset: 4288)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !874, file: !198, line: 160, baseType: !393, size: 96, offset: 4384)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !874, file: !198, line: 161, baseType: !303, size: 128, offset: 4480)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !874, file: !198, line: 161, baseType: !303, size: 128, offset: 4608)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !874, file: !198, line: 162, baseType: !393, size: 96, offset: 4736)
