; ModuleID = 'blender/source/blender/blenloader/intern/versioning_260.c'
source_filename = "blender/source/blender/blenloader/intern/versioning_260.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.FileData = type { %struct.ListBase, i32, i32, i32, i32, i32 (%struct.FileData*, i8*, i32)*, i8*, %struct.MemFile*, i32, %struct.gzFile_s*, [1024 x i8], i8, i32, %struct.z_stream_s, %struct.SDNA*, %struct.SDNA*, i8*, i32, i32, i32, i32, %struct.OldNewMap*, %struct.OldNewMap*, %struct.OldNewMap*, %struct.OldNewMap*, %struct.OldNewMap*, %struct.OldNewMap*, %struct.BHeadSort*, i32, %struct.ListBase*, %struct.BlendFileData**, %struct.ReportList* }
%struct.ListBase = type { i8*, i8* }
%struct.MemFile = type opaque
%struct.gzFile_s = type { i32, i8*, i64 }
%struct.z_stream_s = type { i8*, i32, i64, i8*, i32, i64, i8*, %struct.internal_state*, i8* (i8*, i32, i32)*, void (i8*, i8*)*, i8*, i32, i64, i64 }
%struct.internal_state = type { i32 }
%struct.SDNA = type { i8*, i32, i32, i8**, i32, i32, i8**, i16*, i32, i16**, %struct.GHash*, i32 }
%struct.GHash = type opaque
%struct.OldNewMap = type opaque
%struct.BHeadSort = type opaque
%struct.BlendFileData = type { %struct.Main*, %struct.UserDef*, i32, i32, i32, i32, [1024 x i8], %struct.bScreen*, %struct.Scene*, i32 }

!575 = !DIEnumerator(name: "R_JPEG2K_CINE_48FPS", value: 512, isUnsigned: true)
!576 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNodeSocketFlag", file: !474, line: 154, baseType: !5, size: 32, elements: !577)
!577 = !{!578, !579, !580, !581, !582, !583, !584}
!578 = !DIEnumerator(name: "SOCK_HIDDEN", value: 2, isUnsigned: true)
!579 = !DIEnumerator(name: "SOCK_IN_USE", value: 4, isUnsigned: true)
!580 = !DIEnumerator(name: "SOCK_UNAVAIL", value: 8, isUnsigned: true)
!581 = !DIEnumerator(name: "SOCK_COLLAPSED", value: 64, isUnsigned: true)
!582 = !DIEnumerator(name: "SOCK_HIDE_VALUE", value: 128, isUnsigned: true)
!583 = !DIEnumerator(name: "SOCK_AUTO_HIDDEN__DEPRECATED", value: 256, isUnsigned: true)
!584 = !DIEnumerator(name: "SOCK_NO_INTERNAL_LINK", value: 512, isUnsigned: true)
!585 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNodeSocketInOut", file: !474, line: 148, baseType: !5, size: 32, elements: !586)
!586 = !{!587, !588}
!587 = !DIEnumerator(name: "SOCK_IN", value: 1, isUnsigned: true)
!588 = !DIEnumerator(name: "SOCK_OUT", value: 2, isUnsigned: true)
!589 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNodeSocketDatatype", file: !474, line: 135, baseType: !397, size: 32, elements: !590)
!590 = !{!591, !592, !593, !594, !595, !596, !597, !598, !599}
!591 = !DIEnumerator(name: "SOCK_CUSTOM", value: -1)
!592 = !DIEnumerator(name: "SOCK_FLOAT", value: 0)
!593 = !DIEnumerator(name: "SOCK_VECTOR", value: 1)
!594 = !DIEnumerator(name: "SOCK_RGBA", value: 2)
!595 = !DIEnumerator(name: "SOCK_SHADER", value: 3)
!596 = !DIEnumerator(name: "SOCK_BOOLEAN", value: 4)
!597 = !DIEnumerator(name: "__SOCK_MESH", value: 5)
!598 = !DIEnumerator(name: "SOCK_INT", value: 6)
!599 = !DIEnumerator(name: "SOCK_STRING", value: 7)
!600 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertySubType", file: !601, line: 107, baseType: !5, size: 32, elements: !602)
!601 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!602 = !{!603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631}
!603 = !DIEnumerator(name: "PROP_NONE", value: 0, isUnsigned: true)
!604 = !DIEnumerator(name: "PROP_FILEPATH", value: 1, isUnsigned: true)
!605 = !DIEnumerator(name: "PROP_DIRPATH", value: 2, isUnsigned: true)
!606 = !DIEnumerator(name: "PROP_FILENAME", value: 3, isUnsigned: true)
!607 = !DIEnumerator(name: "PROP_BYTESTRING", value: 4, isUnsigned: true)
!608 = !DIEnumerator(name: "PROP_PASSWORD", value: 6, isUnsigned: true)
!609 = !DIEnumerator(name: "PROP_PIXEL", value: 12, isUnsigned: true)
!610 = !DIEnumerator(name: "PROP_UNSIGNED", value: 13, isUnsigned: true)
!611 = !DIEnumerator(name: "PROP_PERCENTAGE", value: 14, isUnsigned: true)
!612 = !DIEnumerator(name: "PROP_FACTOR", value: 15, isUnsigned: true)
!613 = !DIEnumerator(name: "PROP_ANGLE", value: 327696, isUnsigned: true)
!614 = !DIEnumerator(name: "PROP_TIME", value: 393233, isUnsigned: true)
!615 = !DIEnumerator(name: "PROP_DISTANCE", value: 65554, isUnsigned: true)
!616 = !DIEnumerator(name: "PROP_DISTANCE_CAMERA", value: 589843, isUnsigned: true)
!617 = !DIEnumerator(name: "PROP_COLOR", value: 20, isUnsigned: true)
!618 = !DIEnumerator(name: "PROP_TRANSLATION", value: 65557, isUnsigned: true)
!619 = !DIEnumerator(name: "PROP_DIRECTION", value: 22, isUnsigned: true)
!620 = !DIEnumerator(name: "PROP_VELOCITY", value: 458775, isUnsigned: true)
!621 = !DIEnumerator(name: "PROP_ACCELERATION", value: 524312, isUnsigned: true)
!622 = !DIEnumerator(name: "PROP_MATRIX", value: 25, isUnsigned: true)
!623 = !DIEnumerator(name: "PROP_EULER", value: 327706, isUnsigned: true)
!624 = !DIEnumerator(name: "PROP_QUATERNION", value: 27, isUnsigned: true)
!625 = !DIEnumerator(name: "PROP_AXISANGLE", value: 28, isUnsigned: true)
!626 = !DIEnumerator(name: "PROP_XYZ", value: 29, isUnsigned: true)
!627 = !DIEnumerator(name: "PROP_XYZ_LENGTH", value: 65565, isUnsigned: true)
!628 = !DIEnumerator(name: "PROP_COLOR_GAMMA", value: 30, isUnsigned: true)
!629 = !DIEnumerator(name: "PROP_COORDS", value: 31, isUnsigned: true)
!630 = !DIEnumerator(name: "PROP_LAYER", value: 40, isUnsigned: true)
!631 = !DIEnumerator(name: "PROP_LAYER_MEMBER", value: 41, isUnsigned: true)
!632 = !{!633, !5128, !5187, !654, !5197, !5245, !5247, !5249, !5258, !650, !397, !5378, !5398, !5429, !5500, !700, !5502, !5513, !5541, !5550, !5557, !5574, !5584, !1529, !5589, !672, !5597, !5599, !5601}
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "View3D", file: !635, line: 221, baseType: !636)
!635 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view3d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View3D", file: !635, line: 151, size: 3008, elements: !637)
!637 = !{!638, !660, !661, !662, !663, !664, !665, !669, !670, !671, !673, !677, !678, !679, !680, !681, !5067, !5068, !5069, !5070, !5093, !5095, !5096, !5097, !5098, !5099, !5100, !5101, !5102, !5103, !5104, !5105, !5106, !5107, !5108, !5109, !5110, !5111, !5112, !5113, !5114, !5115, !5116, !5117, !5118, !5119, !5120, !5121, !5122, !5123, !5124, !5125, !5126, !5127}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !636, file: !635, line: 152, baseType: !639, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !11, line: 85, size: 448, elements: !641)
!641 = !{!642, !643, !644, !652, !653, !655}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !640, file: !11, line: 86, baseType: !639, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !640, file: !11, line: 86, baseType: !639, size: 64, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !640, file: !11, line: 87, baseType: !645, size: 128, offset: 128)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !646, line: 71, baseType: !647)
!646 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !646, line: 69, size: 128, elements: !648)
!648 = !{!649, !651}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !647, file: !646, line: 70, baseType: !650, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !647, file: !646, line: 70, baseType: !650, size: 64, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !640, file: !11, line: 88, baseType: !397, size: 32, offset: 256)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !640, file: !11, line: 89, baseType: !654, size: 32, offset: 288)
!654 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !640, file: !11, line: 90, baseType: !656, size: 128, offset: 320)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !657, size: 128, elements: !658)
!657 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!658 = !{!659}
!659 = !DISubrange(count: 8)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !636, file: !635, line: 152, baseType: !639, size: 64, offset: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !636, file: !635, line: 153, baseType: !645, size: 128, offset: 128)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !636, file: !635, line: 154, baseType: !397, size: 32, offset: 256)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !636, file: !635, line: 155, baseType: !654, size: 32, offset: 288)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !636, file: !635, line: 156, baseType: !656, size: 128, offset: 320)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "viewquat", scope: !636, file: !635, line: 158, baseType: !666, size: 128, offset: 448)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !654, size: 128, elements: !667)
!667 = !{!668}
!668 = !DISubrange(count: 4)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !636, file: !635, line: 159, baseType: !654, size: 32, offset: 576)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_size", scope: !636, file: !635, line: 161, baseType: !654, size: 32, offset: 608)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_drawtype", scope: !636, file: !635, line: 162, baseType: !672, size: 8, offset: 640)
!672 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !636, file: !635, line: 163, baseType: !674, size: 24, offset: 648)
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !672, size: 24, elements: !675)
!675 = !{!676}
!676 = !DISubrange(count: 3)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "lay_prev", scope: !636, file: !635, line: 165, baseType: !5, size: 32, offset: 672)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "lay_used", scope: !636, file: !635, line: 166, baseType: !5, size: 32, offset: 704)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "persp", scope: !636, file: !635, line: 168, baseType: !657, size: 16, offset: 736)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !636, file: !635, line: 169, baseType: !657, size: 16, offset: 752)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !636, file: !635, line: 171, baseType: !682, size: 64, offset: 768)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !36, line: 115, size: 11392, elements: !684)
!684 = !{!685, !3524, !3525, !3528, !3529, !3530, !3531, !3532, !3533, !3534, !3535, !3536, !3537, !3538, !3539, !3540, !3549, !3551, !3552, !3591, !3592, !3593, !3594, !3610, !3611, !3612, !3613, !3614, !3615, !3616, !3794, !3795, !3796, !3797, !3798, !3799, !3800, !3801, !3802, !3803, !3804, !3805, !3806, !3807, !3808, !3809, !3810, !3811, !3812, !3813, !3814, !3815, !3816, !3817, !3818, !3819, !3820, !3821, !3822, !3823, !3824, !3825, !3826, !3827, !3828, !3829, !3830, !3831, !3832, !3833, !3834, !3835, !3836, !3837, !3838, !3839, !3840, !3841, !3842, !3843, !3844, !3845, !3847, !3848, !3849, !3850, !3851, !3852, !3853, !3854, !3855, !3856, !3857, !3858, !3859, !3860, !3861, !3862, !3863, !3864, !3865, !3866, !3901, !3902, !3903, !3904, !3905, !3906, !3907, !3908, !3909, !3957, !4720, !4721, !4722, !4723, !4724, !4725, !5033, !5036, !5037, !5038, !5039, !5040, !5041, !5042, !5043, !5044, !5045, !5048, !5051, !5052, !5055, !5056}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !683, file: !36, line: 116, baseType: !686, size: 960)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !687, line: 130, baseType: !688)
!687 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !687, line: 117, size: 960, elements: !689)
!689 = !{!690, !691, !692, !694, !3515, !3519, !3520, !3521, !3522, !3523}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !688, file: !687, line: 118, baseType: !650, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !688, file: !687, line: 118, baseType: !650, size: 64, offset: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !688, file: !687, line: 119, baseType: !693, size: 64, offset: 128)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !688, file: !687, line: 120, baseType: !695, size: 64, offset: 192)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !687, line: 136, size: 17600, elements: !697)
!697 = !{!698, !699, !701, !3511, !3512, !3513, !3514}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !696, file: !687, line: 137, baseType: !686, size: 960)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !696, file: !687, line: 138, baseType: !700, size: 64, offset: 960)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !696, file: !687, line: 139, baseType: !702, size: 64, offset: 1024)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !704, line: 49, size: 10752, elements: !705)
!704 = !DIFile(filename: "blender/source/blender/blenloader/intern/readfile.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!705 = !{!706, !707, !708, !709, !710, !711, !715, !718, !721, !722, !734, !738, !739, !740, !779, !803, !804, !805, !806, !807, !808, !809, !812, !813, !814, !815, !816, !817, !820, !821, !823, !3509}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "listbase", scope: !703, file: !704, line: 51, baseType: !645, size: 128)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !703, file: !704, line: 52, baseType: !397, size: 32, offset: 128)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !703, file: !704, line: 53, baseType: !397, size: 32, offset: 160)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "buffersize", scope: !703, file: !704, line: 54, baseType: !397, size: 32, offset: 192)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !703, file: !704, line: 55, baseType: !397, size: 32, offset: 224)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !703, file: !704, line: 56, baseType: !712, size: 64, offset: 256)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DISubroutineType(types: !714)
!714 = !{!397, !702, !650, !5}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !703, file: !704, line: 59, baseType: !716, size: 64, offset: 320)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !672)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "memfile", scope: !703, file: !704, line: 61, baseType: !719, size: 64, offset: 384)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemFile", file: !4, line: 43, flags: DIFlagFwdDecl)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "filedes", scope: !703, file: !704, line: 64, baseType: !397, size: 32, offset: 448)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "gzfiledes", scope: !703, file: !704, line: 65, baseType: !723, size: 64, offset: 512)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "gzFile", file: !724, line: 1204, baseType: !725)
!724 = !DIFile(filename: "zlib/zlib.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gzFile_s", file: !724, line: 1648, size: 192, elements: !727)
!727 = !{!728, !729, !732}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "have", scope: !726, file: !724, line: 1649, baseType: !5, size: 32)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !726, file: !724, line: 1650, baseType: !730, size: 64, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !726, file: !724, line: 1651, baseType: !733, size: 64, offset: 128)
!733 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "relabase", scope: !703, file: !704, line: 68, baseType: !735, size: 8192, offset: 576)
!735 = !DICompositeType(tag: DW_TAG_array_type, baseType: !672, size: 8192, elements: !736)
!736 = !{!737}
!737 = !DISubrange(count: 1024)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "headerdone", scope: !703, file: !704, line: 71, baseType: !672, size: 8, offset: 8768)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "inbuffer", scope: !703, file: !704, line: 72, baseType: !397, size: 32, offset: 8800)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "strm", scope: !703, file: !704, line: 75, baseType: !741, size: 896, offset: 8832)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_stream", file: !724, line: 104, baseType: !742)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_stream_s", file: !724, line: 85, size: 896, elements: !743)
!743 = !{!744, !749, !751, !754, !755, !756, !757, !759, !764, !770, !775, !776, !777, !778}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !742, file: !724, line: 86, baseType: !745, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bytef", file: !747, line: 374, baseType: !748)
!747 = !DIFile(filename: "zlib/zconf.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "Byte", file: !747, line: 365, baseType: !731)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !742, file: !724, line: 87, baseType: !750, size: 32, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "uInt", file: !747, line: 367, baseType: !5)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !742, file: !724, line: 88, baseType: !752, size: 64, offset: 128)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "uLong", file: !747, line: 368, baseType: !753)
!753 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !742, file: !724, line: 90, baseType: !745, size: 64, offset: 192)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !742, file: !724, line: 91, baseType: !750, size: 32, offset: 256)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !742, file: !724, line: 92, baseType: !752, size: 64, offset: 320)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !742, file: !724, line: 94, baseType: !758, size: 64, offset: 384)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !742, file: !724, line: 95, baseType: !760, size: 64, offset: 448)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "internal_state", file: !724, line: 1714, size: 32, elements: !762)
!762 = !{!763}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !761, file: !724, line: 1714, baseType: !397, size: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "zalloc", scope: !742, file: !724, line: 97, baseType: !765, size: 64, offset: 512)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_func", file: !724, line: 80, baseType: !766)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DISubroutineType(types: !768)
!768 = !{!769, !769, !750, !750}
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "voidpf", file: !747, line: 383, baseType: !650)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "zfree", scope: !742, file: !724, line: 98, baseType: !771, size: 64, offset: 576)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "free_func", file: !724, line: 81, baseType: !772)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DISubroutineType(types: !774)
!774 = !{null, !769, !769}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !742, file: !724, line: 99, baseType: !769, size: 64, offset: 640)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !742, file: !724, line: 101, baseType: !397, size: 32, offset: 704)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "adler", scope: !742, file: !724, line: 102, baseType: !752, size: 64, offset: 768)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !742, file: !724, line: 103, baseType: !752, size: 64, offset: 832)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "filesdna", scope: !703, file: !704, line: 78, baseType: !780, size: 64, offset: 9728)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SDNA", file: !782, line: 37, size: 640, elements: !783)
!782 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sdna_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!783 = !{!784, !785, !786, !787, !789, !790, !791, !793, !795, !796, !798, !802}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !781, file: !782, line: 38, baseType: !758, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "datalen", scope: !781, file: !782, line: 39, baseType: !397, size: 32, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "nr_names", scope: !781, file: !782, line: 41, baseType: !397, size: 32, offset: 96)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "names", scope: !781, file: !782, line: 42, baseType: !788, size: 64, offset: 128)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "pointerlen", scope: !781, file: !782, line: 44, baseType: !397, size: 32, offset: 192)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "nr_types", scope: !781, file: !782, line: 46, baseType: !397, size: 32, offset: 224)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !781, file: !782, line: 47, baseType: !792, size: 64, offset: 256)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "typelens", scope: !781, file: !782, line: 48, baseType: !794, size: 64, offset: 320)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "nr_structs", scope: !781, file: !782, line: 50, baseType: !397, size: 32, offset: 384)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "structs", scope: !781, file: !782, line: 51, baseType: !797, size: 64, offset: 448)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "structs_map", scope: !781, file: !782, line: 57, baseType: !799, size: 64, offset: 512)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !801, line: 47, flags: DIFlagFwdDecl)
!801 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!802 = !DIDerivedType(tag: DW_TAG_member, name: "lastfind", scope: !781, file: !782, line: 63, baseType: !397, size: 32, offset: 576)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "memsdna", scope: !703, file: !704, line: 79, baseType: !780, size: 64, offset: 9792)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "compflags", scope: !703, file: !704, line: 80, baseType: !758, size: 64, offset: 9856)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "fileversion", scope: !703, file: !704, line: 82, baseType: !397, size: 32, offset: 9920)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "id_name_offs", scope: !703, file: !704, line: 83, baseType: !397, size: 32, offset: 9952)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "globalf", scope: !703, file: !704, line: 84, baseType: !397, size: 32, offset: 9984)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "fileflags", scope: !703, file: !704, line: 84, baseType: !397, size: 32, offset: 10016)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "datamap", scope: !703, file: !704, line: 86, baseType: !810, size: 64, offset: 10048)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DICompositeType(tag: DW_TAG_structure_type, name: "OldNewMap", file: !704, line: 39, flags: DIFlagFwdDecl)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "globmap", scope: !703, file: !704, line: 87, baseType: !810, size: 64, offset: 10112)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "libmap", scope: !703, file: !704, line: 88, baseType: !810, size: 64, offset: 10176)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "imamap", scope: !703, file: !704, line: 89, baseType: !810, size: 64, offset: 10240)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "movieclipmap", scope: !703, file: !704, line: 90, baseType: !810, size: 64, offset: 10304)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "packedmap", scope: !703, file: !704, line: 91, baseType: !810, size: 64, offset: 10368)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "bheadmap", scope: !703, file: !704, line: 93, baseType: !818, size: 64, offset: 10432)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DICompositeType(tag: DW_TAG_structure_type, name: "BHeadSort", file: !704, line: 93, flags: DIFlagFwdDecl)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "tot_bheadmap", scope: !703, file: !704, line: 94, baseType: !397, size: 32, offset: 10496)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "mainlist", scope: !703, file: !704, line: 96, baseType: !822, size: 64, offset: 10560)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "bfd_r", scope: !703, file: !704, line: 101, baseType: !824, size: 64, offset: 10624)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlendFileData", file: !4, line: 74, baseType: !827)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BlendFileData", file: !4, line: 60, size: 8640, elements: !828)
!828 = !{!829, !897, !1071, !1072, !1073, !1074, !1075, !1076, !3506, !3507}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !827, file: !4, line: 61, baseType: !830, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Main", file: !832, line: 53, size: 15232, elements: !833)
!832 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_main.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!833 = !{!834, !835, !836, !837, !838, !839, !840, !841, !846, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !890, !894}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !831, file: !832, line: 54, baseType: !830, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !831, file: !832, line: 54, baseType: !830, size: 64, offset: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !831, file: !832, line: 55, baseType: !735, size: 8192, offset: 128)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "versionfile", scope: !831, file: !832, line: 56, baseType: !657, size: 16, offset: 8320)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "subversionfile", scope: !831, file: !832, line: 56, baseType: !657, size: 16, offset: 8336)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "minversionfile", scope: !831, file: !832, line: 57, baseType: !657, size: 16, offset: 8352)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "minsubversionfile", scope: !831, file: !832, line: 57, baseType: !657, size: 16, offset: 8368)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "build_commit_timestamp", scope: !831, file: !832, line: 58, baseType: !842, size: 64, offset: 8384)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !843, line: 27, baseType: !844)
!843 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !845, line: 45, baseType: !753)
!845 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!846 = !DIDerivedType(tag: DW_TAG_member, name: "build_hash", scope: !831, file: !832, line: 59, baseType: !847, size: 128, offset: 8448)
!847 = !DICompositeType(tag: DW_TAG_array_type, baseType: !672, size: 128, elements: !848)
!848 = !{!849}
!849 = !DISubrange(count: 16)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", scope: !831, file: !832, line: 60, baseType: !657, size: 16, offset: 8576)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "curlib", scope: !831, file: !832, line: 62, baseType: !695, size: 64, offset: 8640)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !831, file: !832, line: 63, baseType: !645, size: 128, offset: 8704)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "library", scope: !831, file: !832, line: 64, baseType: !645, size: 128, offset: 8832)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !831, file: !832, line: 65, baseType: !645, size: 128, offset: 8960)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "mesh", scope: !831, file: !832, line: 66, baseType: !645, size: 128, offset: 9088)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !831, file: !832, line: 67, baseType: !645, size: 128, offset: 9216)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "mball", scope: !831, file: !832, line: 68, baseType: !645, size: 128, offset: 9344)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !831, file: !832, line: 69, baseType: !645, size: 128, offset: 9472)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !831, file: !832, line: 70, baseType: !645, size: 128, offset: 9600)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !831, file: !832, line: 71, baseType: !645, size: 128, offset: 9728)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "latt", scope: !831, file: !832, line: 72, baseType: !645, size: 128, offset: 9856)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "lamp", scope: !831, file: !832, line: 73, baseType: !645, size: 128, offset: 9984)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !831, file: !832, line: 74, baseType: !645, size: 128, offset: 10112)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !831, file: !832, line: 75, baseType: !645, size: 128, offset: 10240)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !831, file: !832, line: 76, baseType: !645, size: 128, offset: 10368)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !831, file: !832, line: 77, baseType: !645, size: 128, offset: 10496)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !831, file: !832, line: 78, baseType: !645, size: 128, offset: 10624)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !831, file: !832, line: 79, baseType: !645, size: 128, offset: 10752)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "vfont", scope: !831, file: !832, line: 80, baseType: !645, size: 128, offset: 10880)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !831, file: !832, line: 81, baseType: !645, size: 128, offset: 11008)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "speaker", scope: !831, file: !832, line: 82, baseType: !645, size: 128, offset: 11136)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !831, file: !832, line: 83, baseType: !645, size: 128, offset: 11264)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !831, file: !832, line: 84, baseType: !645, size: 128, offset: 11392)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "armature", scope: !831, file: !832, line: 85, baseType: !645, size: 128, offset: 11520)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !831, file: !832, line: 86, baseType: !645, size: 128, offset: 11648)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !831, file: !832, line: 87, baseType: !645, size: 128, offset: 11776)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !831, file: !832, line: 88, baseType: !645, size: 128, offset: 11904)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !831, file: !832, line: 89, baseType: !645, size: 128, offset: 12032)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "palettes", scope: !831, file: !832, line: 90, baseType: !645, size: 128, offset: 12160)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "paintcurves", scope: !831, file: !832, line: 91, baseType: !645, size: 128, offset: 12288)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "wm", scope: !831, file: !832, line: 92, baseType: !645, size: 128, offset: 12416)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil", scope: !831, file: !832, line: 93, baseType: !645, size: 128, offset: 12544)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "movieclip", scope: !831, file: !832, line: 94, baseType: !645, size: 128, offset: 12672)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !831, file: !832, line: 95, baseType: !645, size: 128, offset: 12800)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "linestyle", scope: !831, file: !832, line: 96, baseType: !645, size: 128, offset: 12928)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "id_tag_update", scope: !831, file: !832, line: 98, baseType: !887, size: 2048, offset: 13056)
!887 = !DICompositeType(tag: DW_TAG_array_type, baseType: !672, size: 2048, elements: !888)
!888 = !{!889}
!889 = !DISubrange(count: 256)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "eval_ctx", scope: !831, file: !832, line: 101, baseType: !891, size: 64, offset: 15104)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DICompositeType(tag: DW_TAG_structure_type, name: "EvaluationContext", file: !893, line: 35, flags: DIFlagFwdDecl)
!893 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_anim.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!894 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !831, file: !832, line: 103, baseType: !895, size: 64, offset: 15168)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DICompositeType(tag: DW_TAG_structure_type, name: "MainLock", file: !832, line: 51, flags: DIFlagFwdDecl)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !827, file: !4, line: 62, baseType: !898, size: 64, offset: 64)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UserDef", file: !900, line: 421, size: 87680, elements: !901)
!900 = !DIFile(filename: "blender/source/blender/makesdna/DNA_userdef_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!901 = !{!902, !903, !904, !905, !906, !907, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !954, !955, !956, !957, !958, !959, !960, !961, !962, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1037, !1039, !1040, !1041, !1042, !1043, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "versionfile", scope: !899, file: !900, line: 423, baseType: !397, size: 32)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "subversionfile", scope: !899, file: !900, line: 423, baseType: !397, size: 32, offset: 32)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !899, file: !900, line: 425, baseType: !397, size: 32, offset: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "dupflag", scope: !899, file: !900, line: 425, baseType: !397, size: 32, offset: 96)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "savetime", scope: !899, file: !900, line: 426, baseType: !397, size: 32, offset: 128)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "tempdir", scope: !899, file: !900, line: 427, baseType: !908, size: 6144, offset: 160)
!908 = !DICompositeType(tag: DW_TAG_array_type, baseType: !672, size: 6144, elements: !909)
!909 = !{!910}
!910 = !DISubrange(count: 768)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "fontdir", scope: !899, file: !900, line: 428, baseType: !908, size: 6144, offset: 6304)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "renderdir", scope: !899, file: !900, line: 429, baseType: !735, size: 8192, offset: 12448)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "render_cachedir", scope: !899, file: !900, line: 431, baseType: !908, size: 6144, offset: 20640)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "textudir", scope: !899, file: !900, line: 432, baseType: !908, size: 6144, offset: 26784)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "pythondir", scope: !899, file: !900, line: 433, baseType: !908, size: 6144, offset: 32928)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "sounddir", scope: !899, file: !900, line: 434, baseType: !908, size: 6144, offset: 39072)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "i18ndir", scope: !899, file: !900, line: 435, baseType: !908, size: 6144, offset: 45216)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "image_editor", scope: !899, file: !900, line: 436, baseType: !735, size: 8192, offset: 51360)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "anim_player", scope: !899, file: !900, line: 437, baseType: !735, size: 8192, offset: 59552)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "anim_player_preset", scope: !899, file: !900, line: 438, baseType: !397, size: 32, offset: 67744)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "v2d_min_gridsize", scope: !899, file: !900, line: 440, baseType: !657, size: 16, offset: 67776)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_style", scope: !899, file: !900, line: 441, baseType: !657, size: 16, offset: 67792)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "versions", scope: !899, file: !900, line: 443, baseType: !657, size: 16, offset: 67808)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "dbl_click_time", scope: !899, file: !900, line: 444, baseType: !657, size: 16, offset: 67824)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "gameflags", scope: !899, file: !900, line: 446, baseType: !657, size: 16, offset: 67840)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "wheellinescroll", scope: !899, file: !900, line: 447, baseType: !657, size: 16, offset: 67856)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "uiflag", scope: !899, file: !900, line: 448, baseType: !397, size: 32, offset: 67872)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "uiflag2", scope: !899, file: !900, line: 448, baseType: !397, size: 32, offset: 67904)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !899, file: !900, line: 449, baseType: !397, size: 32, offset: 67936)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "userpref", scope: !899, file: !900, line: 450, baseType: !657, size: 16, offset: 67968)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "viewzoom", scope: !899, file: !900, line: 450, baseType: !657, size: 16, offset: 67984)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "mixbufsize", scope: !899, file: !900, line: 452, baseType: !397, size: 32, offset: 68000)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "audiodevice", scope: !899, file: !900, line: 453, baseType: !397, size: 32, offset: 68032)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "audiorate", scope: !899, file: !900, line: 454, baseType: !397, size: 32, offset: 68064)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "audioformat", scope: !899, file: !900, line: 455, baseType: !397, size: 32, offset: 68096)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "audiochannels", scope: !899, file: !900, line: 456, baseType: !397, size: 32, offset: 68128)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "scrollback", scope: !899, file: !900, line: 458, baseType: !397, size: 32, offset: 68160)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "dpi", scope: !899, file: !900, line: 459, baseType: !397, size: 32, offset: 68192)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !899, file: !900, line: 460, baseType: !657, size: 16, offset: 68224)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "transopts", scope: !899, file: !900, line: 461, baseType: !657, size: 16, offset: 68240)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "menuthreshold1", scope: !899, file: !900, line: 462, baseType: !657, size: 16, offset: 68256)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "menuthreshold2", scope: !899, file: !900, line: 462, baseType: !657, size: 16, offset: 68272)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "themes", scope: !899, file: !900, line: 464, baseType: !647, size: 128, offset: 68288)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "uifonts", scope: !899, file: !900, line: 465, baseType: !647, size: 128, offset: 68416)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "uistyles", scope: !899, file: !900, line: 466, baseType: !647, size: 128, offset: 68544)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "keymaps", scope: !899, file: !900, line: 467, baseType: !647, size: 128, offset: 68672)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "user_keymaps", scope: !899, file: !900, line: 468, baseType: !647, size: 128, offset: 68800)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "addons", scope: !899, file: !900, line: 469, baseType: !647, size: 128, offset: 68928)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "autoexec_paths", scope: !899, file: !900, line: 470, baseType: !647, size: 128, offset: 69056)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "keyconfigstr", scope: !899, file: !900, line: 471, baseType: !951, size: 512, offset: 69184)
!951 = !DICompositeType(tag: DW_TAG_array_type, baseType: !672, size: 512, elements: !952)
!952 = !{!953}
!953 = !DISubrange(count: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "undosteps", scope: !899, file: !900, line: 473, baseType: !657, size: 16, offset: 69696)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "undomemory", scope: !899, file: !900, line: 474, baseType: !657, size: 16, offset: 69712)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "gp_manhattendist", scope: !899, file: !900, line: 475, baseType: !657, size: 16, offset: 69728)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "gp_euclideandist", scope: !899, file: !900, line: 475, baseType: !657, size: 16, offset: 69744)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "gp_eraser", scope: !899, file: !900, line: 475, baseType: !657, size: 16, offset: 69760)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "gp_settings", scope: !899, file: !900, line: 476, baseType: !657, size: 16, offset: 69776)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "tb_leftmouse", scope: !899, file: !900, line: 477, baseType: !657, size: 16, offset: 69792)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "tb_rightmouse", scope: !899, file: !900, line: 477, baseType: !657, size: 16, offset: 69808)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "light", scope: !899, file: !900, line: 478, baseType: !963, size: 1344, offset: 69824)
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !964, size: 1344, elements: !675)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SolidLight", file: !900, line: 405, size: 448, elements: !965)
!965 = !{!966, !967, !968, !969, !970}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !964, file: !900, line: 406, baseType: !397, size: 32)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !964, file: !900, line: 406, baseType: !397, size: 32, offset: 32)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !964, file: !900, line: 407, baseType: !666, size: 128, offset: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !964, file: !900, line: 407, baseType: !666, size: 128, offset: 192)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !964, file: !900, line: 407, baseType: !666, size: 128, offset: 320)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "tw_hotspot", scope: !899, file: !900, line: 479, baseType: !657, size: 16, offset: 71168)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "tw_flag", scope: !899, file: !900, line: 479, baseType: !657, size: 16, offset: 71184)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "tw_handlesize", scope: !899, file: !900, line: 479, baseType: !657, size: 16, offset: 71200)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "tw_size", scope: !899, file: !900, line: 479, baseType: !657, size: 16, offset: 71216)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "textimeout", scope: !899, file: !900, line: 480, baseType: !657, size: 16, offset: 71232)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "texcollectrate", scope: !899, file: !900, line: 480, baseType: !657, size: 16, offset: 71248)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "wmdrawmethod", scope: !899, file: !900, line: 481, baseType: !657, size: 16, offset: 71264)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "dragthreshold", scope: !899, file: !900, line: 482, baseType: !657, size: 16, offset: 71280)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "memcachelimit", scope: !899, file: !900, line: 483, baseType: !397, size: 32, offset: 71296)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "prefetchframes", scope: !899, file: !900, line: 484, baseType: !397, size: 32, offset: 71328)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "frameserverport", scope: !899, file: !900, line: 485, baseType: !657, size: 16, offset: 71360)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "pad_rot_angle", scope: !899, file: !900, line: 486, baseType: !657, size: 16, offset: 71376)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "obcenter_dia", scope: !899, file: !900, line: 487, baseType: !657, size: 16, offset: 71392)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "rvisize", scope: !899, file: !900, line: 488, baseType: !657, size: 16, offset: 71408)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "rvibright", scope: !899, file: !900, line: 489, baseType: !657, size: 16, offset: 71424)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "recent_files", scope: !899, file: !900, line: 490, baseType: !657, size: 16, offset: 71440)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_viewtx", scope: !899, file: !900, line: 491, baseType: !657, size: 16, offset: 71456)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "glreslimit", scope: !899, file: !900, line: 492, baseType: !657, size: 16, offset: 71472)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "curssize", scope: !899, file: !900, line: 493, baseType: !657, size: 16, offset: 71488)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "color_picker_type", scope: !899, file: !900, line: 494, baseType: !657, size: 16, offset: 71504)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "ipo_new", scope: !899, file: !900, line: 495, baseType: !672, size: 8, offset: 71520)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "keyhandles_new", scope: !899, file: !900, line: 496, baseType: !672, size: 8, offset: 71528)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "gpu_select_method", scope: !899, file: !900, line: 497, baseType: !672, size: 8, offset: 71536)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !899, file: !900, line: 498, baseType: !672, size: 8, offset: 71544)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "scrcastfps", scope: !899, file: !900, line: 500, baseType: !657, size: 16, offset: 71552)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "scrcastwait", scope: !899, file: !900, line: 501, baseType: !657, size: 16, offset: 71568)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "widget_unit", scope: !899, file: !900, line: 503, baseType: !657, size: 16, offset: 71584)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropic_filter", scope: !899, file: !900, line: 504, baseType: !657, size: 16, offset: 71600)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "use_16bit_textures", scope: !899, file: !900, line: 505, baseType: !657, size: 16, offset: 71616)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "use_gpu_mipmap", scope: !899, file: !900, line: 505, baseType: !657, size: 16, offset: 71632)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "ndof_sensitivity", scope: !899, file: !900, line: 507, baseType: !654, size: 32, offset: 71648)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "ndof_orbit_sensitivity", scope: !899, file: !900, line: 508, baseType: !654, size: 32, offset: 71680)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "ndof_flag", scope: !899, file: !900, line: 509, baseType: !397, size: 32, offset: 71712)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "ogl_multisamples", scope: !899, file: !900, line: 511, baseType: !657, size: 16, offset: 71744)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "image_draw_method", scope: !899, file: !900, line: 513, baseType: !657, size: 16, offset: 71760)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "glalphaclip", scope: !899, file: !900, line: 515, baseType: !654, size: 32, offset: 71776)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_mode", scope: !899, file: !900, line: 517, baseType: !657, size: 16, offset: 71808)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_flag", scope: !899, file: !900, line: 518, baseType: !657, size: 16, offset: 71824)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "text_render", scope: !899, file: !900, line: 520, baseType: !657, size: 16, offset: 71840)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "pad9", scope: !899, file: !900, line: 520, baseType: !657, size: 16, offset: 71856)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "coba_weight", scope: !899, file: !900, line: 522, baseType: !1012, size: 6208, offset: 71872)
!1012 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !1013, line: 113, size: 6208, elements: !1014)
!1013 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1014 = !{!1015, !1016, !1017, !1018, !1019, !1020, !1024}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !1012, file: !1013, line: 114, baseType: !657, size: 16)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !1012, file: !1013, line: 114, baseType: !657, size: 16, offset: 16)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !1012, file: !1013, line: 115, baseType: !672, size: 8, offset: 32)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !1012, file: !1013, line: 115, baseType: !672, size: 8, offset: 40)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !1012, file: !1013, line: 116, baseType: !672, size: 8, offset: 48)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1012, file: !1013, line: 117, baseType: !1021, size: 8, offset: 56)
!1021 = !DICompositeType(tag: DW_TAG_array_type, baseType: !672, size: 8, elements: !1022)
!1022 = !{!1023}
!1023 = !DISubrange(count: 1)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1012, file: !1013, line: 119, baseType: !1025, size: 6144, offset: 64)
!1025 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1026, size: 6144, elements: !1035)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !1013, line: 109, baseType: !1027)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !1013, line: 106, size: 192, elements: !1028)
!1028 = !{!1029, !1030, !1031, !1032, !1033, !1034}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1027, file: !1013, line: 107, baseType: !654, size: 32)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1027, file: !1013, line: 107, baseType: !654, size: 32, offset: 32)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !1027, file: !1013, line: 107, baseType: !654, size: 32, offset: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1027, file: !1013, line: 107, baseType: !654, size: 32, offset: 96)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1027, file: !1013, line: 107, baseType: !654, size: 32, offset: 128)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !1027, file: !1013, line: 108, baseType: !397, size: 32, offset: 160)
!1035 = !{!1036}
!1036 = !DISubrange(count: 32)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_overlay_col", scope: !899, file: !900, line: 524, baseType: !1038, size: 96, offset: 78080)
!1038 = !DICompositeType(tag: DW_TAG_array_type, baseType: !654, size: 96, elements: !675)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_new_layer_col", scope: !899, file: !900, line: 525, baseType: !666, size: 128, offset: 78176)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "tweak_threshold", scope: !899, file: !900, line: 527, baseType: !657, size: 16, offset: 78304)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "navigation_mode", scope: !899, file: !900, line: 528, baseType: !672, size: 8, offset: 78320)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !899, file: !900, line: 528, baseType: !672, size: 8, offset: 78328)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "author", scope: !899, file: !900, line: 530, baseType: !1044, size: 640, offset: 78336)
!1044 = !DICompositeType(tag: DW_TAG_array_type, baseType: !672, size: 640, elements: !1045)
!1045 = !{!1046}
!1046 = !DISubrange(count: 80)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "font_path_ui", scope: !899, file: !900, line: 532, baseType: !735, size: 8192, offset: 78976)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "compute_device_type", scope: !899, file: !900, line: 534, baseType: !397, size: 32, offset: 87168)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "compute_device_id", scope: !899, file: !900, line: 535, baseType: !397, size: 32, offset: 87200)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "fcu_inactive_alpha", scope: !899, file: !900, line: 537, baseType: !654, size: 32, offset: 87232)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "pixelsize", scope: !899, file: !900, line: 538, baseType: !654, size: 32, offset: 87264)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel", scope: !899, file: !900, line: 539, baseType: !397, size: 32, offset: 87296)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "pie_interaction_type", scope: !899, file: !900, line: 541, baseType: !657, size: 16, offset: 87328)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "pie_initial_timeout", scope: !899, file: !900, line: 543, baseType: !657, size: 16, offset: 87344)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "pie_animation_timeout", scope: !899, file: !900, line: 545, baseType: !657, size: 16, offset: 87360)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "pie_menu_confirm", scope: !899, file: !900, line: 546, baseType: !657, size: 16, offset: 87376)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "pie_menu_radius", scope: !899, file: !900, line: 547, baseType: !657, size: 16, offset: 87392)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "pie_menu_threshold", scope: !899, file: !900, line: 548, baseType: !657, size: 16, offset: 87408)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "walk_navigation", scope: !899, file: !900, line: 550, baseType: !1060, size: 256, offset: 87424)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "WalkNavigation", file: !900, line: 410, size: 256, elements: !1061)
!1061 = !{!1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "mouse_speed", scope: !1060, file: !900, line: 411, baseType: !654, size: 32)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "walk_speed", scope: !1060, file: !900, line: 412, baseType: !654, size: 32, offset: 32)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "walk_speed_factor", scope: !1060, file: !900, line: 413, baseType: !654, size: 32, offset: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "view_height", scope: !1060, file: !900, line: 414, baseType: !654, size: 32, offset: 96)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "jump_height", scope: !1060, file: !900, line: 415, baseType: !654, size: 32, offset: 128)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "teleport_time", scope: !1060, file: !900, line: 416, baseType: !654, size: 32, offset: 160)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1060, file: !900, line: 417, baseType: !657, size: 16, offset: 192)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1060, file: !900, line: 418, baseType: !1070, size: 48, offset: 208)
!1070 = !DICompositeType(tag: DW_TAG_array_type, baseType: !657, size: 48, elements: !675)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "winpos", scope: !827, file: !4, line: 64, baseType: !397, size: 32, offset: 128)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "fileflags", scope: !827, file: !4, line: 65, baseType: !397, size: 32, offset: 160)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "displaymode", scope: !827, file: !4, line: 66, baseType: !397, size: 32, offset: 192)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "globalf", scope: !827, file: !4, line: 67, baseType: !397, size: 32, offset: 224)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !827, file: !4, line: 68, baseType: !735, size: 8192, offset: 256)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "curscreen", scope: !827, file: !4, line: 70, baseType: !1077, size: 64, offset: 8448)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !224, line: 49, size: 1984, elements: !1079)
!1079 = !{!1080, !1081, !1082, !1083, !1084, !1085, !3489, !3490, !3491, !3492, !3493, !3494, !3495, !3496, !3497, !3498, !3499, !3500, !3501, !3502, !3503, !3504, !3505}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1078, file: !224, line: 50, baseType: !686, size: 960)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !1078, file: !224, line: 52, baseType: !645, size: 128, offset: 960)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !1078, file: !224, line: 53, baseType: !645, size: 128, offset: 1088)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !1078, file: !224, line: 54, baseType: !645, size: 128, offset: 1216)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !1078, file: !224, line: 55, baseType: !645, size: 128, offset: 1344)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1078, file: !224, line: 57, baseType: !1086, size: 64, offset: 1472)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !214, line: 1216, size: 39680, elements: !1088)
!1088 = !{!1089, !1090, !1159, !1160, !2401, !2402, !2403, !2415, !2416, !2417, !2418, !2419, !2420, !2421, !2422, !2423, !2424, !2425, !2426, !2427, !2766, !3095, !3098, !3365, !3377, !3378, !3379, !3380, !3381, !3382, !3383, !3384, !3387, !3388, !3389, !3390, !3391, !3399, !3465, !3472, !3473, !3480, !3481, !3482, !3483, !3484, !3485, !3486}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1087, file: !214, line: 1217, baseType: !686, size: 960)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1087, file: !214, line: 1218, baseType: !1091, size: 64, offset: 960)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !1093, line: 838, size: 768, elements: !1094)
!1093 = !DIFile(filename: "blender/source/blender/makesdna/DNA_anim_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1094 = !{!1095, !1109, !1110, !1120, !1121, !1152, !1153, !1154, !1155, !1156, !1157, !1158}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !1092, file: !1093, line: 840, baseType: !1096, size: 64)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !801, line: 499, baseType: !1098)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !801, line: 486, size: 1600, elements: !1099)
!1099 = !{!1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1098, file: !801, line: 487, baseType: !686, size: 960)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !1098, file: !801, line: 489, baseType: !645, size: 128, offset: 960)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !1098, file: !801, line: 490, baseType: !645, size: 128, offset: 1088)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !1098, file: !801, line: 491, baseType: !645, size: 128, offset: 1216)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1098, file: !801, line: 492, baseType: !645, size: 128, offset: 1344)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1098, file: !801, line: 494, baseType: !397, size: 32, offset: 1472)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !1098, file: !801, line: 495, baseType: !397, size: 32, offset: 1504)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !1098, file: !801, line: 497, baseType: !397, size: 32, offset: 1536)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1098, file: !801, line: 498, baseType: !397, size: 32, offset: 1568)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !1092, file: !1093, line: 844, baseType: !1096, size: 64, offset: 64)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !1092, file: !1093, line: 848, baseType: !1111, size: 64, offset: 128)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !1093, line: 549, baseType: !1113)
!1113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !1093, line: 544, size: 320, elements: !1114)
!1114 = !{!1115, !1117, !1118, !1119}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1113, file: !1093, line: 545, baseType: !1116, size: 64)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1113, file: !1093, line: 545, baseType: !1116, size: 64, offset: 64)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !1113, file: !1093, line: 547, baseType: !1096, size: 64, offset: 128)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !1113, file: !1093, line: 548, baseType: !645, size: 128, offset: 192)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !1092, file: !1093, line: 851, baseType: !645, size: 128, offset: 192)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !1092, file: !1093, line: 853, baseType: !1122, size: 64, offset: 320)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64)
!1123 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !1093, line: 594, baseType: !1124)
!1124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !1093, line: 561, size: 1664, elements: !1125)
!1125 = !{!1126, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1124, file: !1093, line: 562, baseType: !1127, size: 64)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1124, file: !1093, line: 562, baseType: !1127, size: 64, offset: 64)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !1124, file: !1093, line: 564, baseType: !645, size: 128, offset: 128)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !1124, file: !1093, line: 565, baseType: !1096, size: 64, offset: 256)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !1124, file: !1093, line: 566, baseType: !1111, size: 64, offset: 320)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !1124, file: !1093, line: 568, baseType: !645, size: 128, offset: 384)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !1124, file: !1093, line: 569, baseType: !645, size: 128, offset: 512)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1124, file: !1093, line: 571, baseType: !951, size: 512, offset: 640)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !1124, file: !1093, line: 573, baseType: !654, size: 32, offset: 1152)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "strip_time", scope: !1124, file: !1093, line: 574, baseType: !654, size: 32, offset: 1184)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1124, file: !1093, line: 576, baseType: !654, size: 32, offset: 1216)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !1124, file: !1093, line: 576, baseType: !654, size: 32, offset: 1248)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "actstart", scope: !1124, file: !1093, line: 577, baseType: !654, size: 32, offset: 1280)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "actend", scope: !1124, file: !1093, line: 577, baseType: !654, size: 32, offset: 1312)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !1124, file: !1093, line: 579, baseType: !654, size: 32, offset: 1344)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1124, file: !1093, line: 580, baseType: !654, size: 32, offset: 1376)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !1124, file: !1093, line: 582, baseType: !654, size: 32, offset: 1408)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !1124, file: !1093, line: 582, baseType: !654, size: 32, offset: 1440)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "blendmode", scope: !1124, file: !1093, line: 583, baseType: !657, size: 16, offset: 1472)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "extendmode", scope: !1124, file: !1093, line: 585, baseType: !657, size: 16, offset: 1488)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1124, file: !1093, line: 586, baseType: !657, size: 16, offset: 1504)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1124, file: !1093, line: 588, baseType: !657, size: 16, offset: 1520)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handle", scope: !1124, file: !1093, line: 590, baseType: !650, size: 64, offset: 1536)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1124, file: !1093, line: 592, baseType: !397, size: 32, offset: 1600)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1124, file: !1093, line: 593, baseType: !397, size: 32, offset: 1632)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "drivers", scope: !1092, file: !1093, line: 858, baseType: !645, size: 128, offset: 384)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "overrides", scope: !1092, file: !1093, line: 859, baseType: !645, size: 128, offset: 512)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1092, file: !1093, line: 862, baseType: !397, size: 32, offset: 640)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !1092, file: !1093, line: 863, baseType: !397, size: 32, offset: 672)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "act_blendmode", scope: !1092, file: !1093, line: 866, baseType: !657, size: 16, offset: 704)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "act_extendmode", scope: !1092, file: !1093, line: 867, baseType: !657, size: 16, offset: 720)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "act_influence", scope: !1092, file: !1093, line: 868, baseType: !654, size: 32, offset: 736)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1087, file: !214, line: 1220, baseType: !682, size: 64, offset: 1024)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !1087, file: !214, line: 1221, baseType: !1161, size: 64, offset: 1088)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !1163, line: 52, size: 4224, elements: !1164)
!1163 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1164 = !{!1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1234, !1235, !1238, !2396, !2397, !2398, !2399, !2400}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1162, file: !1163, line: 53, baseType: !686, size: 960)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1162, file: !1163, line: 54, baseType: !1091, size: 64, offset: 960)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !1162, file: !1163, line: 56, baseType: !657, size: 16, offset: 1024)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !1162, file: !1163, line: 56, baseType: !657, size: 16, offset: 1040)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !1162, file: !1163, line: 57, baseType: !657, size: 16, offset: 1056)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !1162, file: !1163, line: 57, baseType: !657, size: 16, offset: 1072)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !1162, file: !1163, line: 59, baseType: !654, size: 32, offset: 1088)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !1162, file: !1163, line: 59, baseType: !654, size: 32, offset: 1120)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !1162, file: !1163, line: 59, baseType: !654, size: 32, offset: 1152)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !1162, file: !1163, line: 60, baseType: !654, size: 32, offset: 1184)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !1162, file: !1163, line: 60, baseType: !654, size: 32, offset: 1216)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !1162, file: !1163, line: 60, baseType: !654, size: 32, offset: 1248)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !1162, file: !1163, line: 61, baseType: !654, size: 32, offset: 1280)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !1162, file: !1163, line: 61, baseType: !654, size: 32, offset: 1312)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !1162, file: !1163, line: 61, baseType: !654, size: 32, offset: 1344)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !1162, file: !1163, line: 68, baseType: !654, size: 32, offset: 1376)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !1162, file: !1163, line: 68, baseType: !654, size: 32, offset: 1408)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1162, file: !1163, line: 68, baseType: !654, size: 32, offset: 1440)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !1162, file: !1163, line: 69, baseType: !654, size: 32, offset: 1472)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !1162, file: !1163, line: 69, baseType: !654, size: 32, offset: 1504)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !1162, file: !1163, line: 74, baseType: !654, size: 32, offset: 1536)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !1162, file: !1163, line: 79, baseType: !654, size: 32, offset: 1568)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !1162, file: !1163, line: 81, baseType: !657, size: 16, offset: 1600)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1162, file: !1163, line: 91, baseType: !657, size: 16, offset: 1616)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !1162, file: !1163, line: 92, baseType: !657, size: 16, offset: 1632)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !1162, file: !1163, line: 93, baseType: !657, size: 16, offset: 1648)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !1162, file: !1163, line: 94, baseType: !657, size: 16, offset: 1664)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !1162, file: !1163, line: 94, baseType: !657, size: 16, offset: 1680)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !1162, file: !1163, line: 94, baseType: !657, size: 16, offset: 1696)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !1162, file: !1163, line: 94, baseType: !657, size: 16, offset: 1712)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !1162, file: !1163, line: 96, baseType: !654, size: 32, offset: 1728)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !1162, file: !1163, line: 96, baseType: !654, size: 32, offset: 1760)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !1162, file: !1163, line: 96, baseType: !654, size: 32, offset: 1792)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !1162, file: !1163, line: 96, baseType: !654, size: 32, offset: 1824)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !1162, file: !1163, line: 98, baseType: !654, size: 32, offset: 1856)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !1162, file: !1163, line: 98, baseType: !654, size: 32, offset: 1888)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !1162, file: !1163, line: 98, baseType: !654, size: 32, offset: 1920)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !1162, file: !1163, line: 98, baseType: !654, size: 32, offset: 1952)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !1162, file: !1163, line: 99, baseType: !654, size: 32, offset: 1984)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !1162, file: !1163, line: 99, baseType: !654, size: 32, offset: 2016)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !1162, file: !1163, line: 100, baseType: !654, size: 32, offset: 2048)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !1162, file: !1163, line: 100, baseType: !654, size: 32, offset: 2080)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !1162, file: !1163, line: 103, baseType: !657, size: 16, offset: 2112)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !1162, file: !1163, line: 103, baseType: !657, size: 16, offset: 2128)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !1162, file: !1163, line: 103, baseType: !657, size: 16, offset: 2144)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !1162, file: !1163, line: 103, baseType: !657, size: 16, offset: 2160)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !1162, file: !1163, line: 106, baseType: !654, size: 32, offset: 2176)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !1162, file: !1163, line: 106, baseType: !654, size: 32, offset: 2208)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !1162, file: !1163, line: 106, baseType: !654, size: 32, offset: 2240)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !1162, file: !1163, line: 106, baseType: !654, size: 32, offset: 2272)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !1162, file: !1163, line: 107, baseType: !657, size: 16, offset: 2304)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !1162, file: !1163, line: 107, baseType: !657, size: 16, offset: 2320)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !1162, file: !1163, line: 107, baseType: !657, size: 16, offset: 2336)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !1162, file: !1163, line: 107, baseType: !657, size: 16, offset: 2352)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !1162, file: !1163, line: 108, baseType: !654, size: 32, offset: 2368)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !1162, file: !1163, line: 108, baseType: !654, size: 32, offset: 2400)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !1162, file: !1163, line: 109, baseType: !654, size: 32, offset: 2432)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !1162, file: !1163, line: 109, baseType: !654, size: 32, offset: 2464)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !1162, file: !1163, line: 110, baseType: !654, size: 32, offset: 2496)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !1162, file: !1163, line: 110, baseType: !654, size: 32, offset: 2528)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !1162, file: !1163, line: 110, baseType: !654, size: 32, offset: 2560)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !1162, file: !1163, line: 111, baseType: !657, size: 16, offset: 2592)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !1162, file: !1163, line: 111, baseType: !657, size: 16, offset: 2608)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !1162, file: !1163, line: 112, baseType: !657, size: 16, offset: 2624)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !1162, file: !1163, line: 112, baseType: !657, size: 16, offset: 2640)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !1162, file: !1163, line: 112, baseType: !657, size: 16, offset: 2656)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1162, file: !1163, line: 115, baseType: !657, size: 16, offset: 2672)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !1162, file: !1163, line: 118, baseType: !1233, size: 64, offset: 2688)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !1162, file: !1163, line: 118, baseType: !1233, size: 64, offset: 2752)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1162, file: !1163, line: 121, baseType: !1236, size: 64, offset: 2816)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64)
!1237 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !1013, line: 46, flags: DIFlagFwdDecl)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !1162, file: !1163, line: 122, baseType: !1239, size: 1152, offset: 2880)
!1239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1240, size: 1152, elements: !2394)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64)
!1241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !1013, line: 57, size: 2496, elements: !1242)
!1242 = !{!1243, !1244, !1245, !1246, !1247, !1248, !2335, !2336, !2337, !2338, !2339, !2340, !2341, !2342, !2343, !2344, !2345, !2346, !2347, !2348, !2349, !2350, !2351, !2352, !2353, !2354, !2355, !2356, !2357, !2358, !2359, !2360, !2361, !2362, !2363, !2364, !2365, !2366, !2367, !2368, !2369, !2370, !2371, !2372, !2373, !2374, !2375, !2376, !2377, !2378, !2379, !2380, !2381, !2382, !2383, !2384, !2385, !2386, !2387, !2388, !2389, !2390, !2391, !2392, !2393}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !1241, file: !1013, line: 59, baseType: !657, size: 16)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !1241, file: !1013, line: 59, baseType: !657, size: 16, offset: 16)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !1241, file: !1013, line: 59, baseType: !657, size: 16, offset: 32)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !1241, file: !1013, line: 59, baseType: !657, size: 16, offset: 48)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1241, file: !1013, line: 60, baseType: !682, size: 64, offset: 64)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !1241, file: !1013, line: 61, baseType: !1249, size: 64, offset: 128)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64)
!1250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !1013, line: 202, size: 3328, elements: !1251)
!1251 = !{!1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1320, !2128, !2129, !2206, !2208, !2236, !2237, !2304, !2325, !2333, !2334}
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1250, file: !1013, line: 203, baseType: !686, size: 960)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1250, file: !1013, line: 204, baseType: !1091, size: 64, offset: 960)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !1250, file: !1013, line: 206, baseType: !654, size: 32, offset: 1024)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !1250, file: !1013, line: 206, baseType: !654, size: 32, offset: 1056)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !1250, file: !1013, line: 207, baseType: !654, size: 32, offset: 1088)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !1250, file: !1013, line: 207, baseType: !654, size: 32, offset: 1120)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !1250, file: !1013, line: 207, baseType: !654, size: 32, offset: 1152)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !1250, file: !1013, line: 207, baseType: !654, size: 32, offset: 1184)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !1250, file: !1013, line: 207, baseType: !654, size: 32, offset: 1216)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !1250, file: !1013, line: 207, baseType: !654, size: 32, offset: 1248)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !1250, file: !1013, line: 208, baseType: !654, size: 32, offset: 1280)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1250, file: !1013, line: 208, baseType: !654, size: 32, offset: 1312)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !1250, file: !1013, line: 211, baseType: !654, size: 32, offset: 1344)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !1250, file: !1013, line: 211, baseType: !654, size: 32, offset: 1376)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !1250, file: !1013, line: 211, baseType: !654, size: 32, offset: 1408)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !1250, file: !1013, line: 211, baseType: !654, size: 32, offset: 1440)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !1250, file: !1013, line: 211, baseType: !654, size: 32, offset: 1472)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !1250, file: !1013, line: 214, baseType: !654, size: 32, offset: 1504)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !1250, file: !1013, line: 214, baseType: !654, size: 32, offset: 1536)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !1250, file: !1013, line: 217, baseType: !654, size: 32, offset: 1568)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !1250, file: !1013, line: 218, baseType: !654, size: 32, offset: 1600)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !1250, file: !1013, line: 219, baseType: !654, size: 32, offset: 1632)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !1250, file: !1013, line: 220, baseType: !654, size: 32, offset: 1664)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !1250, file: !1013, line: 221, baseType: !654, size: 32, offset: 1696)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !1250, file: !1013, line: 222, baseType: !657, size: 16, offset: 1728)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !1250, file: !1013, line: 222, baseType: !657, size: 16, offset: 1744)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !1250, file: !1013, line: 224, baseType: !657, size: 16, offset: 1760)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !1250, file: !1013, line: 224, baseType: !657, size: 16, offset: 1776)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !1250, file: !1013, line: 227, baseType: !657, size: 16, offset: 1792)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !1250, file: !1013, line: 227, baseType: !657, size: 16, offset: 1808)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !1250, file: !1013, line: 229, baseType: !657, size: 16, offset: 1824)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1250, file: !1013, line: 229, baseType: !657, size: 16, offset: 1840)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1250, file: !1013, line: 230, baseType: !657, size: 16, offset: 1856)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !1250, file: !1013, line: 230, baseType: !657, size: 16, offset: 1872)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !1250, file: !1013, line: 232, baseType: !654, size: 32, offset: 1888)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !1250, file: !1013, line: 232, baseType: !654, size: 32, offset: 1920)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !1250, file: !1013, line: 232, baseType: !654, size: 32, offset: 1952)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !1250, file: !1013, line: 232, baseType: !654, size: 32, offset: 1984)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !1250, file: !1013, line: 233, baseType: !397, size: 32, offset: 2016)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !1250, file: !1013, line: 234, baseType: !397, size: 32, offset: 2048)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !1250, file: !1013, line: 235, baseType: !657, size: 16, offset: 2080)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !1250, file: !1013, line: 235, baseType: !657, size: 16, offset: 2096)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !1250, file: !1013, line: 236, baseType: !657, size: 16, offset: 2112)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !1250, file: !1013, line: 239, baseType: !657, size: 16, offset: 2128)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1250, file: !1013, line: 240, baseType: !397, size: 32, offset: 2144)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !1250, file: !1013, line: 241, baseType: !397, size: 32, offset: 2176)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1250, file: !1013, line: 241, baseType: !397, size: 32, offset: 2208)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !1250, file: !1013, line: 241, baseType: !397, size: 32, offset: 2240)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !1250, file: !1013, line: 243, baseType: !654, size: 32, offset: 2272)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !1250, file: !1013, line: 243, baseType: !654, size: 32, offset: 2304)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1250, file: !1013, line: 244, baseType: !654, size: 32, offset: 2336)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !1250, file: !1013, line: 246, baseType: !1304, size: 320, offset: 2368)
!1304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !274, line: 50, size: 320, elements: !1305)
!1305 = !{!1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319}
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1304, file: !274, line: 51, baseType: !1086, size: 64)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1304, file: !274, line: 53, baseType: !397, size: 32, offset: 64)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !1304, file: !274, line: 54, baseType: !397, size: 32, offset: 96)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1304, file: !274, line: 55, baseType: !397, size: 32, offset: 128)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !1304, file: !274, line: 55, baseType: !397, size: 32, offset: 160)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !1304, file: !274, line: 56, baseType: !672, size: 8, offset: 192)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !1304, file: !274, line: 56, baseType: !672, size: 8, offset: 200)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1304, file: !274, line: 57, baseType: !672, size: 8, offset: 208)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1304, file: !274, line: 57, baseType: !672, size: 8, offset: 216)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !1304, file: !274, line: 59, baseType: !657, size: 16, offset: 224)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !1304, file: !274, line: 59, baseType: !657, size: 16, offset: 240)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !1304, file: !274, line: 59, baseType: !657, size: 16, offset: 256)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1304, file: !274, line: 61, baseType: !657, size: 16, offset: 272)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1304, file: !274, line: 63, baseType: !397, size: 32, offset: 288)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !1250, file: !1013, line: 248, baseType: !1321, size: 64, offset: 2688)
!1321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1322, size: 64)
!1322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !474, line: 328, size: 3456, elements: !1323)
!1323 = !{!1324, !1325, !1326, !2077, !2078, !2079, !2080, !2081, !2082, !2083, !2084, !2085, !2086, !2087, !2088, !2089, !2090, !2091, !2092, !2093, !2094, !2095, !2096, !2097, !2098, !2106, !2107, !2108, !2111, !2115, !2119, !2123, !2124, !2125, !2126, !2127}
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1322, file: !474, line: 329, baseType: !686, size: 960)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1322, file: !474, line: 330, baseType: !1091, size: 64, offset: 960)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !1322, file: !474, line: 332, baseType: !1327, size: 64, offset: 1024)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64)
!1328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !1329, line: 283, size: 4096, elements: !1330)
!1329 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1330 = !{!1331, !1332, !1333, !1334, !1335, !1336, !1340, !2046, !2054, !2058, !2064, !2068, !2069, !2070, !2071, !2075, !2076}
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1328, file: !1329, line: 284, baseType: !397, size: 32)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1328, file: !1329, line: 285, baseType: !951, size: 512, offset: 32)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !1328, file: !1329, line: 287, baseType: !951, size: 512, offset: 544)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !1328, file: !1329, line: 288, baseType: !887, size: 2048, offset: 1056)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !1328, file: !1329, line: 289, baseType: !397, size: 32, offset: 3104)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !1328, file: !1329, line: 292, baseType: !1337, size: 64, offset: 3136)
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1338, size: 64)
!1338 = !DISubroutineType(types: !1339)
!1339 = !{null, !1321}
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !1328, file: !1329, line: 293, baseType: !1341, size: 64, offset: 3200)
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64)
!1342 = !DISubroutineType(types: !1343)
!1343 = !{null, !1321, !1344}
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64)
!1345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !474, line: 167, size: 3712, elements: !1346)
!1346 = !{!1347, !1348, !1349, !1350, !1373, !2002, !2003, !2004, !2005, !2006, !2007, !2008, !2009, !2010, !2011, !2012, !2013, !2014, !2015, !2016, !2017, !2018, !2019, !2020, !2021, !2022, !2023, !2024, !2025, !2026, !2027, !2028, !2029, !2030, !2031, !2032, !2033, !2034, !2035, !2036, !2037, !2038, !2039, !2040, !2041, !2042, !2043}
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1345, file: !474, line: 168, baseType: !1344, size: 64)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1345, file: !474, line: 168, baseType: !1344, size: 64, offset: 64)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !1345, file: !474, line: 168, baseType: !1344, size: 64, offset: 128)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !1345, file: !474, line: 170, baseType: !1351, size: 64, offset: 192)
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64)
!1352 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !687, line: 75, baseType: !1353)
!1353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !687, line: 62, size: 1024, elements: !1354)
!1354 = !{!1355, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1371, !1372}
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1353, file: !687, line: 63, baseType: !1356, size: 64)
!1356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1353, file: !687, line: 63, baseType: !1356, size: 64, offset: 64)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1353, file: !687, line: 64, baseType: !672, size: 8, offset: 128)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1353, file: !687, line: 64, baseType: !672, size: 8, offset: 136)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1353, file: !687, line: 65, baseType: !657, size: 16, offset: 144)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1353, file: !687, line: 66, baseType: !951, size: 512, offset: 160)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !1353, file: !687, line: 67, baseType: !397, size: 32, offset: 672)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1353, file: !687, line: 69, baseType: !1364, size: 256, offset: 704)
!1364 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !687, line: 60, baseType: !1365)
!1365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !687, line: 48, size: 256, elements: !1366)
!1366 = !{!1367, !1368, !1369, !1370}
