; ModuleID = 'blender/source/blender/blenkernel/intern/tracking_solver.c'
source_filename = "blender/source/blender/blenkernel/intern/tracking_solver.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.StructRNA = type opaque
%struct.MovieTracking = type { %struct.MovieTrackingSettings, %struct.MovieTrackingCamera, %struct.ListBase, %struct.ListBase, %struct.MovieTrackingReconstruction, %struct.MovieTrackingStabilization, %struct.MovieTrackingTrack*, %struct.MovieTrackingPlaneTrack*, %struct.ListBase, i32, i32, %struct.MovieTrackingStats*, %struct.MovieTrackingDopesheet }
%struct.MovieTrackingSettings = type { i32, i16, i16, float, i16, i16, i16, i16, i16, i16, float, i16, i16, i32, i32, i32, i16, i16, float, i32, i32, float, float, i32 }
%struct.MovieTrackingCamera = type { i8*, i16, i16, float, float, float, i16, i16, [2 x float], float, float, float, float, float }
%struct.MovieTrackingReconstruction = type { i32, float, i32, i32, %struct.MovieReconstructedCamera* }
%struct.MovieReconstructedCamera = type { i32, float, [4 x [4 x float]] }
%struct.MovieTrackingStabilization = type { i32, i32, i32, float, %struct.MovieTrackingTrack*, float, float, float, i32, i32, float }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !51, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/blenkernel/intern/tracking_solver.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !9, !12, !15, !22, !25, !31, !38}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 424, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8}
!7 = !DIEnumerator(name: "TRACKING_MOTION_TRIPOD", value: 1, isUnsigned: true)
!8 = !DIEnumerator(name: "TRACKING_MOTION_MODAL", value: 1, isUnsigned: true)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 440, baseType: !5, size: 32, elements: !10)
!10 = !{!11}
!11 = !DIEnumerator(name: "TRACKING_USE_KEYFRAME_SELECTION", value: 2, isUnsigned: true)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 473, baseType: !5, size: 32, elements: !13)
!13 = !{!14}
!14 = !DIEnumerator(name: "TRACKING_OBJECT_CAMERA", value: 1, isUnsigned: true)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 371, baseType: !5, size: 32, elements: !16)
!16 = !{!17, !18, !19, !20, !21}
!17 = !DIEnumerator(name: "MARKER_DISABLED", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "MARKER_TRACKED", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "MARKER_GRAPH_SEL_X", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "MARKER_GRAPH_SEL_Y", value: 8, isUnsigned: true)
!21 = !DIEnumerator(name: "MARKER_GRAPH_SEL", value: 12, isUnsigned: true)
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 468, baseType: !5, size: 32, elements: !23)
!23 = !{!24}
!24 = !DIEnumerator(name: "TRACKING_RECONSTRUCTED", value: 1, isUnsigned: true)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 446, baseType: !5, size: 32, elements: !26)
!26 = !{!27, !28, !29, !30}
!27 = !DIEnumerator(name: "REFINE_FOCAL_LENGTH", value: 1, isUnsigned: true)
!28 = !DIEnumerator(name: "REFINE_PRINCIPAL_POINT", value: 2, isUnsigned: true)
!29 = !DIEnumerator(name: "REFINE_RADIAL_DISTORTION_K1", value: 4, isUnsigned: true)
!30 = !DIEnumerator(name: "REFINE_RADIAL_DISTORTION_K2", value: 16, isUnsigned: true)
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !32, line: 40, baseType: !5, size: 32, elements: !33)
!32 = !DIFile(filename: "blender/extern/libmv/intern/reconstruction.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!33 = !{!34, !35, !36, !37}
!34 = !DIEnumerator(name: "LIBMV_REFINE_FOCAL_LENGTH", value: 1, isUnsigned: true)
!35 = !DIEnumerator(name: "LIBMV_REFINE_PRINCIPAL_POINT", value: 2, isUnsigned: true)
!36 = !DIEnumerator(name: "LIBMV_REFINE_RADIAL_DISTORTION_K1", value: 4, isUnsigned: true)
!37 = !DIEnumerator(name: "LIBMV_REFINE_RADIAL_DISTORTION_K2", value: 16, isUnsigned: true)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 380, baseType: !5, size: 32, elements: !39)
!39 = !{!40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50}
!40 = !DIEnumerator(name: "TRACK_HAS_BUNDLE", value: 2, isUnsigned: true)
!41 = !DIEnumerator(name: "TRACK_DISABLE_RED", value: 4, isUnsigned: true)
!42 = !DIEnumerator(name: "TRACK_DISABLE_GREEN", value: 8, isUnsigned: true)
!43 = !DIEnumerator(name: "TRACK_DISABLE_BLUE", value: 16, isUnsigned: true)
!44 = !DIEnumerator(name: "TRACK_HIDDEN", value: 32, isUnsigned: true)
!45 = !DIEnumerator(name: "TRACK_LOCKED", value: 64, isUnsigned: true)
!46 = !DIEnumerator(name: "TRACK_CUSTOMCOLOR", value: 128, isUnsigned: true)
!47 = !DIEnumerator(name: "TRACK_USE_2D_STAB", value: 256, isUnsigned: true)
!48 = !DIEnumerator(name: "TRACK_PREVIEW_GRAYSCALE", value: 512, isUnsigned: true)
!49 = !DIEnumerator(name: "TRACK_DOPE_SEL", value: 1024, isUnsigned: true)
!50 = !DIEnumerator(name: "TRACK_PREVIEW_ALPHA", value: 2048, isUnsigned: true)
!51 = !{!52}
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!53 = !{i32 7, !"Dwarf Version", i32 4}
!54 = !{i32 2, !"Debug Info Version", i32 3}
!55 = !{i32 1, !"wchar_size", i32 4}
!56 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!57 = distinct !DISubprogram(name: "BKE_tracking_reconstruction_check", scope: !1, file: !1, line: 321, type: !58, scopeLine: 323, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !418)
!58 = !DISubroutineType(types: !59)
!59 = !{!60, !61, !402, !417, !70}
!60 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTracking", file: !4, line: 356, baseType: !63)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !4, line: 340, size: 2624, elements: !64)
!64 = !{!65, !96, !117, !124, !125, !143, !210, !211, !379, !380, !381, !382, !391}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !63, file: !4, line: 341, baseType: !66, size: 576)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !4, line: 251, baseType: !67)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !4, line: 207, size: 576, elements: !68)
!68 = !{!69, !71, !73, !74, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !67, file: !4, line: 208, baseType: !70, size: 32)
!70 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !67, file: !4, line: 211, baseType: !72, size: 16, offset: 32)
!72 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !67, file: !4, line: 212, baseType: !72, size: 16, offset: 48)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !67, file: !4, line: 213, baseType: !75, size: 32, offset: 64)
!75 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !67, file: !4, line: 214, baseType: !72, size: 16, offset: 96)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !67, file: !4, line: 215, baseType: !72, size: 16, offset: 112)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !67, file: !4, line: 216, baseType: !72, size: 16, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !67, file: !4, line: 217, baseType: !72, size: 16, offset: 144)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !67, file: !4, line: 218, baseType: !72, size: 16, offset: 160)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !67, file: !4, line: 219, baseType: !72, size: 16, offset: 176)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !67, file: !4, line: 220, baseType: !75, size: 32, offset: 192)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !67, file: !4, line: 222, baseType: !72, size: 16, offset: 224)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !67, file: !4, line: 225, baseType: !72, size: 16, offset: 240)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !67, file: !4, line: 228, baseType: !70, size: 32, offset: 256)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !67, file: !4, line: 229, baseType: !70, size: 32, offset: 288)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !67, file: !4, line: 233, baseType: !70, size: 32, offset: 320)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !67, file: !4, line: 236, baseType: !72, size: 16, offset: 352)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !67, file: !4, line: 236, baseType: !72, size: 16, offset: 368)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !67, file: !4, line: 241, baseType: !75, size: 32, offset: 384)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !67, file: !4, line: 244, baseType: !70, size: 32, offset: 416)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !67, file: !4, line: 244, baseType: !70, size: 32, offset: 448)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !67, file: !4, line: 245, baseType: !75, size: 32, offset: 480)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !67, file: !4, line: 248, baseType: !75, size: 32, offset: 512)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !67, file: !4, line: 250, baseType: !70, size: 32, offset: 544)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !63, file: !4, line: 342, baseType: !97, size: 448, offset: 576)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !4, line: 79, baseType: !98)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !4, line: 61, size: 448, elements: !99)
!99 = !{!100, !101, !102, !103, !104, !105, !106, !107, !108, !112, !113, !114, !115, !116}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !98, file: !4, line: 62, baseType: !52, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !98, file: !4, line: 64, baseType: !72, size: 16, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !98, file: !4, line: 65, baseType: !72, size: 16, offset: 80)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !98, file: !4, line: 67, baseType: !75, size: 32, offset: 96)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !98, file: !4, line: 68, baseType: !75, size: 32, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !98, file: !4, line: 69, baseType: !75, size: 32, offset: 160)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !98, file: !4, line: 70, baseType: !72, size: 16, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !98, file: !4, line: 71, baseType: !72, size: 16, offset: 208)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !98, file: !4, line: 72, baseType: !109, size: 64, offset: 224)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 64, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 2)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !98, file: !4, line: 75, baseType: !75, size: 32, offset: 288)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !98, file: !4, line: 75, baseType: !75, size: 32, offset: 320)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !98, file: !4, line: 75, baseType: !75, size: 32, offset: 352)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !98, file: !4, line: 78, baseType: !75, size: 32, offset: 384)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !98, file: !4, line: 78, baseType: !75, size: 32, offset: 416)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !63, file: !4, line: 343, baseType: !118, size: 128, offset: 1024)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !119, line: 71, baseType: !120)
!119 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !119, line: 69, size: 128, elements: !121)
!121 = !{!122, !123}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !120, file: !119, line: 70, baseType: !52, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !120, file: !119, line: 70, baseType: !52, size: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !63, file: !4, line: 344, baseType: !118, size: 128, offset: 1152)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !63, file: !4, line: 345, baseType: !126, size: 192, offset: 1280)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !4, line: 278, baseType: !127)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !4, line: 270, size: 192, elements: !128)
!128 = !{!129, !130, !131, !132, !133}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !127, file: !4, line: 271, baseType: !70, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !127, file: !4, line: 273, baseType: !75, size: 32, offset: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !127, file: !4, line: 275, baseType: !70, size: 32, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !127, file: !4, line: 276, baseType: !70, size: 32, offset: 96)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !127, file: !4, line: 277, baseType: !134, size: 64, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !4, line: 55, size: 576, elements: !136)
!136 = !{!137, !138, !139}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !135, file: !4, line: 56, baseType: !70, size: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !135, file: !4, line: 57, baseType: !75, size: 32, offset: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !135, file: !4, line: 58, baseType: !140, size: 512, offset: 64)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 512, elements: !141)
!141 = !{!142, !142}
!142 = !DISubrange(count: 4)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !63, file: !4, line: 346, baseType: !144, size: 384, offset: 1472)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !4, line: 268, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !4, line: 253, size: 384, elements: !146)
!146 = !{!147, !148, !149, !150, !151, !204, !205, !206, !207, !208, !209}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !145, file: !4, line: 254, baseType: !70, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !145, file: !4, line: 255, baseType: !70, size: 32, offset: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !145, file: !4, line: 255, baseType: !70, size: 32, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !145, file: !4, line: 258, baseType: !75, size: 32, offset: 96)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !145, file: !4, line: 259, baseType: !152, size: 64, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !4, line: 164, baseType: !154)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !4, line: 108, size: 1664, elements: !155)
!155 = !{!156, !158, !159, !164, !165, !166, !167, !168, !169, !170, !171, !184, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !202, !203}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !154, file: !4, line: 109, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !154, file: !4, line: 109, baseType: !157, size: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !154, file: !4, line: 111, baseType: !160, size: 512, offset: 128)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 512, elements: !162)
!161 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!162 = !{!163}
!163 = !DISubrange(count: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !154, file: !4, line: 119, baseType: !109, size: 64, offset: 640)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !154, file: !4, line: 119, baseType: !109, size: 64, offset: 704)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !154, file: !4, line: 125, baseType: !109, size: 64, offset: 768)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !154, file: !4, line: 125, baseType: !109, size: 64, offset: 832)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !154, file: !4, line: 127, baseType: !109, size: 64, offset: 896)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !154, file: !4, line: 130, baseType: !70, size: 32, offset: 960)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !154, file: !4, line: 131, baseType: !70, size: 32, offset: 992)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !154, file: !4, line: 132, baseType: !172, size: 64, offset: 1024)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !4, line: 106, baseType: !174)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !4, line: 81, size: 512, elements: !175)
!175 = !{!176, !177, !180, !181, !182, !183}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !174, file: !4, line: 82, baseType: !109, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !174, file: !4, line: 97, baseType: !178, size: 256, offset: 64)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 256, elements: !179)
!179 = !{!142, !111}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !174, file: !4, line: 102, baseType: !109, size: 64, offset: 320)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !174, file: !4, line: 102, baseType: !109, size: 64, offset: 384)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !174, file: !4, line: 104, baseType: !70, size: 32, offset: 448)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !174, file: !4, line: 105, baseType: !70, size: 32, offset: 480)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !154, file: !4, line: 135, baseType: !185, size: 96, offset: 1088)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 96, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 3)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !154, file: !4, line: 136, baseType: !75, size: 32, offset: 1184)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !154, file: !4, line: 139, baseType: !70, size: 32, offset: 1216)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !154, file: !4, line: 139, baseType: !70, size: 32, offset: 1248)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !154, file: !4, line: 139, baseType: !70, size: 32, offset: 1280)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !154, file: !4, line: 140, baseType: !185, size: 96, offset: 1312)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !154, file: !4, line: 143, baseType: !72, size: 16, offset: 1408)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !154, file: !4, line: 144, baseType: !72, size: 16, offset: 1424)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !154, file: !4, line: 145, baseType: !72, size: 16, offset: 1440)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !154, file: !4, line: 148, baseType: !72, size: 16, offset: 1456)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !154, file: !4, line: 149, baseType: !70, size: 32, offset: 1472)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !154, file: !4, line: 150, baseType: !75, size: 32, offset: 1504)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !154, file: !4, line: 152, baseType: !200, size: 64, offset: 1536)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !4, line: 45, flags: DIFlagFwdDecl)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !154, file: !4, line: 163, baseType: !75, size: 32, offset: 1600)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !154, file: !4, line: 163, baseType: !75, size: 32, offset: 1632)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !145, file: !4, line: 261, baseType: !75, size: 32, offset: 192)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !145, file: !4, line: 261, baseType: !75, size: 32, offset: 224)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !145, file: !4, line: 261, baseType: !75, size: 32, offset: 256)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !145, file: !4, line: 263, baseType: !70, size: 32, offset: 288)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !145, file: !4, line: 266, baseType: !70, size: 32, offset: 320)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !145, file: !4, line: 267, baseType: !75, size: 32, offset: 352)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !63, file: !4, line: 347, baseType: !152, size: 64, offset: 1856)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !63, file: !4, line: 348, baseType: !212, size: 64, offset: 1920)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !4, line: 205, baseType: !214)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !4, line: 186, size: 1024, elements: !215)
!215 = !{!216, !218, !219, !220, !222, !223, !224, !232, !233, !234, !377, !378}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !214, file: !4, line: 187, baseType: !217, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !214, file: !4, line: 187, baseType: !217, size: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !214, file: !4, line: 189, baseType: !160, size: 512, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !214, file: !4, line: 191, baseType: !221, size: 64, offset: 640)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !214, file: !4, line: 193, baseType: !70, size: 32, offset: 704)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !214, file: !4, line: 193, baseType: !70, size: 32, offset: 736)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !214, file: !4, line: 195, baseType: !225, size: 64, offset: 768)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !4, line: 184, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !4, line: 166, size: 320, elements: !228)
!228 = !{!229, !230, !231}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !227, file: !4, line: 180, baseType: !178, size: 256)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !227, file: !4, line: 182, baseType: !70, size: 32, offset: 256)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !227, file: !4, line: 183, baseType: !70, size: 32, offset: 288)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !214, file: !4, line: 196, baseType: !70, size: 32, offset: 832)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !214, file: !4, line: 198, baseType: !70, size: 32, offset: 864)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !214, file: !4, line: 200, baseType: !235, size: 64, offset: 896)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !237, line: 77, size: 15424, elements: !238)
!237 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!238 = !{!239, !298, !299, !302, !305, !308, !311, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !331, !332, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !358, !359, !360, !366, !367, !371}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !236, file: !237, line: 78, baseType: !240, size: 960)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !241, line: 130, baseType: !242)
!241 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !241, line: 117, size: 960, elements: !243)
!243 = !{!244, !245, !246, !248, !267, !271, !272, !273, !274, !275}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !242, file: !241, line: 118, baseType: !52, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !242, file: !241, line: 118, baseType: !52, size: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !242, file: !241, line: 119, baseType: !247, size: 64, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !242, file: !241, line: 120, baseType: !249, size: 64, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !241, line: 136, size: 17600, elements: !251)
!251 = !{!252, !253, !255, !258, !262, !263, !264}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !250, file: !241, line: 137, baseType: !240, size: 960)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !250, file: !241, line: 138, baseType: !254, size: 64, offset: 960)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !250, file: !241, line: 139, baseType: !256, size: 64, offset: 1024)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !241, line: 43, flags: DIFlagFwdDecl)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !250, file: !241, line: 140, baseType: !259, size: 8192, offset: 1088)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 8192, elements: !260)
!260 = !{!261}
!261 = !DISubrange(count: 1024)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !250, file: !241, line: 141, baseType: !259, size: 8192, offset: 9280)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !250, file: !241, line: 148, baseType: !249, size: 64, offset: 17472)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !250, file: !241, line: 150, baseType: !265, size: 64, offset: 17536)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !241, line: 45, flags: DIFlagFwdDecl)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !242, file: !241, line: 121, baseType: !268, size: 528, offset: 256)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 528, elements: !269)
!269 = !{!270}
!270 = !DISubrange(count: 66)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !242, file: !241, line: 126, baseType: !72, size: 16, offset: 784)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !242, file: !241, line: 127, baseType: !70, size: 32, offset: 800)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !242, file: !241, line: 128, baseType: !70, size: 32, offset: 832)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !242, file: !241, line: 128, baseType: !70, size: 32, offset: 864)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !242, file: !241, line: 129, baseType: !276, size: 64, offset: 896)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !241, line: 75, baseType: !278)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !241, line: 62, size: 1024, elements: !279)
!279 = !{!280, !282, !283, !284, !285, !286, !287, !288, !296, !297}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !278, file: !241, line: 63, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !278, file: !241, line: 63, baseType: !281, size: 64, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !278, file: !241, line: 64, baseType: !161, size: 8, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !278, file: !241, line: 64, baseType: !161, size: 8, offset: 136)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !278, file: !241, line: 65, baseType: !72, size: 16, offset: 144)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !278, file: !241, line: 66, baseType: !160, size: 512, offset: 160)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !278, file: !241, line: 67, baseType: !70, size: 32, offset: 672)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !278, file: !241, line: 69, baseType: !289, size: 256, offset: 704)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !241, line: 60, baseType: !290)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !241, line: 48, size: 256, elements: !291)
!291 = !{!292, !293, !294, !295}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !290, file: !241, line: 49, baseType: !52, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !290, file: !241, line: 58, baseType: !118, size: 128, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !290, file: !241, line: 59, baseType: !70, size: 32, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !290, file: !241, line: 59, baseType: !70, size: 32, offset: 224)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !278, file: !241, line: 70, baseType: !70, size: 32, offset: 960)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !278, file: !241, line: 74, baseType: !70, size: 32, offset: 992)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !236, file: !237, line: 80, baseType: !259, size: 8192, offset: 960)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !236, file: !237, line: 82, baseType: !300, size: 64, offset: 9152)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !237, line: 43, flags: DIFlagFwdDecl)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !236, file: !237, line: 83, baseType: !303, size: 64, offset: 9216)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !241, line: 46, flags: DIFlagFwdDecl)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !236, file: !237, line: 86, baseType: !306, size: 64, offset: 9280)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !237, line: 41, flags: DIFlagFwdDecl)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !236, file: !237, line: 87, baseType: !309, size: 64, offset: 9344)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !237, line: 44, flags: DIFlagFwdDecl)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !236, file: !237, line: 89, baseType: !312, size: 512, offset: 9408)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 512, elements: !313)
!313 = !{!314}
!314 = !DISubrange(count: 8)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !236, file: !237, line: 90, baseType: !72, size: 16, offset: 9920)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !236, file: !237, line: 90, baseType: !72, size: 16, offset: 9936)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !236, file: !237, line: 92, baseType: !72, size: 16, offset: 9952)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !236, file: !237, line: 92, baseType: !72, size: 16, offset: 9968)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !236, file: !237, line: 93, baseType: !72, size: 16, offset: 9984)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !236, file: !237, line: 93, baseType: !72, size: 16, offset: 10000)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !236, file: !237, line: 94, baseType: !70, size: 32, offset: 10016)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !236, file: !237, line: 97, baseType: !72, size: 16, offset: 10048)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !236, file: !237, line: 97, baseType: !72, size: 16, offset: 10064)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !236, file: !237, line: 98, baseType: !72, size: 16, offset: 10080)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !236, file: !237, line: 98, baseType: !72, size: 16, offset: 10096)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !236, file: !237, line: 99, baseType: !72, size: 16, offset: 10112)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !236, file: !237, line: 99, baseType: !72, size: 16, offset: 10128)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !236, file: !237, line: 100, baseType: !5, size: 32, offset: 10144)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !236, file: !237, line: 101, baseType: !330, size: 64, offset: 10176)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !236, file: !237, line: 103, baseType: !265, size: 64, offset: 10240)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !236, file: !237, line: 104, baseType: !333, size: 64, offset: 10304)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !241, line: 159, size: 448, elements: !335)
!335 = !{!336, !338, !339, !341, !342, !344}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !334, file: !241, line: 161, baseType: !337, size: 64)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !110)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !334, file: !241, line: 162, baseType: !337, size: 64, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !334, file: !241, line: 163, baseType: !340, size: 32, offset: 128)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !110)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !334, file: !241, line: 164, baseType: !340, size: 32, offset: 160)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !334, file: !241, line: 165, baseType: !343, size: 128, offset: 192)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !330, size: 128, elements: !110)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !334, file: !241, line: 166, baseType: !345, size: 128, offset: 320)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !303, size: 128, elements: !110)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !236, file: !237, line: 107, baseType: !75, size: 32, offset: 10368)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !236, file: !237, line: 108, baseType: !70, size: 32, offset: 10400)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !236, file: !237, line: 109, baseType: !72, size: 16, offset: 10432)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !236, file: !237, line: 110, baseType: !72, size: 16, offset: 10448)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !236, file: !237, line: 113, baseType: !70, size: 32, offset: 10464)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !236, file: !237, line: 113, baseType: !70, size: 32, offset: 10496)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !236, file: !237, line: 114, baseType: !161, size: 8, offset: 10528)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !236, file: !237, line: 114, baseType: !161, size: 8, offset: 10536)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !236, file: !237, line: 115, baseType: !72, size: 16, offset: 10544)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !236, file: !237, line: 116, baseType: !356, size: 128, offset: 10560)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 128, elements: !357)
!357 = !{!142}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !236, file: !237, line: 119, baseType: !75, size: 32, offset: 10688)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !236, file: !237, line: 119, baseType: !75, size: 32, offset: 10720)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !236, file: !237, line: 122, baseType: !361, size: 512, offset: 10752)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !362, line: 182, baseType: !363)
!362 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !362, line: 180, size: 512, elements: !364)
!364 = !{!365}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !363, file: !362, line: 181, baseType: !160, size: 512)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !236, file: !237, line: 123, baseType: !161, size: 8, offset: 11264)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !236, file: !237, line: 125, baseType: !368, size: 56, offset: 11272)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 56, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 7)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !236, file: !237, line: 126, baseType: !372, size: 4096, offset: 11328)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !373, size: 4096, elements: !313)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !237, line: 69, baseType: !374)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !237, line: 67, size: 512, elements: !375)
!375 = !{!376}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !374, file: !237, line: 68, baseType: !160, size: 512)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !214, file: !4, line: 201, baseType: !75, size: 32, offset: 960)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !214, file: !4, line: 204, baseType: !70, size: 32, offset: 992)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !63, file: !4, line: 350, baseType: !118, size: 128, offset: 1984)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !63, file: !4, line: 351, baseType: !70, size: 32, offset: 2112)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !63, file: !4, line: 351, baseType: !70, size: 32, offset: 2144)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !63, file: !4, line: 353, baseType: !383, size: 64, offset: 2176)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !4, line: 297, baseType: !385)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !4, line: 295, size: 2048, elements: !386)
!386 = !{!387}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !385, file: !4, line: 296, baseType: !388, size: 2048)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 2048, elements: !389)
!389 = !{!390}
!390 = !DISubrange(count: 256)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !63, file: !4, line: 355, baseType: !392, size: 384, offset: 2240)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !4, line: 338, baseType: !393)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !4, line: 322, size: 384, elements: !394)
!394 = !{!395, !396, !397, !398, !399, !400, !401}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !393, file: !4, line: 323, baseType: !70, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !393, file: !4, line: 325, baseType: !72, size: 16, offset: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !393, file: !4, line: 326, baseType: !72, size: 16, offset: 48)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !393, file: !4, line: 331, baseType: !118, size: 128, offset: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !393, file: !4, line: 334, baseType: !118, size: 128, offset: 192)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !393, file: !4, line: 335, baseType: !70, size: 32, offset: 320)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !393, file: !4, line: 337, baseType: !70, size: 32, offset: 352)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingObject", file: !4, line: 293, baseType: !404)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingObject", file: !4, line: 280, size: 1216, elements: !405)
!405 = !{!406, !408, !409, !410, !411, !412, !413, !414, !415, !416}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !404, file: !4, line: 281, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !404, file: !4, line: 281, baseType: !407, size: 64, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !404, file: !4, line: 283, baseType: !160, size: 512, offset: 128)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !404, file: !4, line: 284, baseType: !70, size: 32, offset: 640)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !404, file: !4, line: 285, baseType: !75, size: 32, offset: 672)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !404, file: !4, line: 287, baseType: !118, size: 128, offset: 704)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !404, file: !4, line: 288, baseType: !118, size: 128, offset: 832)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !404, file: !4, line: 289, baseType: !126, size: 192, offset: 960)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !404, file: !4, line: 292, baseType: !70, size: 32, offset: 1152)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !404, file: !4, line: 292, baseType: !70, size: 32, offset: 1184)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!418 = !{}
!419 = !DILocalVariable(name: "tracking", arg: 1, scope: !57, file: !1, line: 321, type: !61)
!420 = !DILocation(line: 321, column: 55, scope: !57)
!421 = !DILocalVariable(name: "object", arg: 2, scope: !57, file: !1, line: 321, type: !402)
!422 = !DILocation(line: 321, column: 86, scope: !57)
!423 = !DILocalVariable(name: "error_msg", arg: 3, scope: !57, file: !1, line: 322, type: !417)
!424 = !DILocation(line: 322, column: 46, scope: !57)
!425 = !DILocalVariable(name: "error_size", arg: 4, scope: !57, file: !1, line: 322, type: !70)
!426 = !DILocation(line: 322, column: 61, scope: !57)
!427 = !DILocation(line: 324, column: 6, scope: !428)
!428 = distinct !DILexicalBlock(scope: !57, file: !1, line: 324, column: 6)
!429 = !DILocation(line: 324, column: 16, scope: !428)
!430 = !DILocation(line: 324, column: 25, scope: !428)
!431 = !DILocation(line: 324, column: 37, scope: !428)
!432 = !DILocation(line: 324, column: 6, scope: !57)
!433 = !DILocation(line: 326, column: 3, scope: !434)
!434 = distinct !DILexicalBlock(scope: !428, file: !1, line: 324, column: 62)
!435 = !DILocation(line: 328, column: 12, scope: !436)
!436 = distinct !DILexicalBlock(scope: !428, file: !1, line: 328, column: 11)
!437 = !DILocation(line: 328, column: 22, scope: !436)
!438 = !DILocation(line: 328, column: 31, scope: !436)
!439 = !DILocation(line: 328, column: 51, scope: !436)
!440 = !DILocation(line: 328, column: 86, scope: !436)
!441 = !DILocation(line: 328, column: 11, scope: !428)
!442 = !DILocation(line: 330, column: 50, scope: !443)
!443 = distinct !DILexicalBlock(scope: !444, file: !1, line: 330, column: 7)
!444 = distinct !DILexicalBlock(scope: !436, file: !1, line: 328, column: 92)
!445 = !DILocation(line: 330, column: 60, scope: !443)
!446 = !DILocation(line: 330, column: 7, scope: !443)
!447 = !DILocation(line: 330, column: 68, scope: !443)
!448 = !DILocation(line: 330, column: 7, scope: !444)
!449 = !DILocation(line: 331, column: 16, scope: !450)
!450 = distinct !DILexicalBlock(scope: !443, file: !1, line: 330, column: 73)
!451 = !DILocation(line: 333, column: 16, scope: !450)
!452 = !DILocation(line: 331, column: 4, scope: !450)
!453 = !DILocation(line: 335, column: 4, scope: !450)
!454 = !DILocation(line: 337, column: 2, scope: !444)
!455 = !DILocation(line: 340, column: 14, scope: !57)
!456 = !DILocation(line: 340, column: 84, scope: !57)
!457 = !DILocation(line: 340, column: 2, scope: !57)
!458 = !DILocation(line: 341, column: 2, scope: !57)
!459 = !DILocation(line: 345, column: 1, scope: !57)
!460 = distinct !DISubprogram(name: "reconstruct_count_tracks_on_both_keyframes", scope: !1, file: !1, line: 299, type: !461, scopeLine: 300, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !418)
!461 = !DISubroutineType(types: !462)
!462 = !{!70, !61, !402}
!463 = !DILocalVariable(name: "tracking", arg: 1, scope: !460, file: !1, line: 299, type: !61)
!464 = !DILocation(line: 299, column: 70, scope: !460)
!465 = !DILocalVariable(name: "object", arg: 2, scope: !460, file: !1, line: 299, type: !402)
!466 = !DILocation(line: 299, column: 101, scope: !460)
!467 = !DILocalVariable(name: "tracksbase", scope: !460, file: !1, line: 301, type: !468)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!469 = !DILocation(line: 301, column: 12, scope: !460)
!470 = !DILocation(line: 301, column: 56, scope: !460)
!471 = !DILocation(line: 301, column: 66, scope: !460)
!472 = !DILocation(line: 301, column: 25, scope: !460)
!473 = !DILocalVariable(name: "tot", scope: !460, file: !1, line: 302, type: !70)
!474 = !DILocation(line: 302, column: 6, scope: !460)
!475 = !DILocalVariable(name: "frame1", scope: !460, file: !1, line: 303, type: !70)
!476 = !DILocation(line: 303, column: 6, scope: !460)
!477 = !DILocation(line: 303, column: 15, scope: !460)
!478 = !DILocation(line: 303, column: 23, scope: !460)
!479 = !DILocalVariable(name: "frame2", scope: !460, file: !1, line: 303, type: !70)
!480 = !DILocation(line: 303, column: 34, scope: !460)
!481 = !DILocation(line: 303, column: 43, scope: !460)
!482 = !DILocation(line: 303, column: 51, scope: !460)
!483 = !DILocalVariable(name: "track", scope: !460, file: !1, line: 304, type: !152)
!484 = !DILocation(line: 304, column: 22, scope: !460)
!485 = !DILocation(line: 306, column: 10, scope: !460)
!486 = !DILocation(line: 306, column: 22, scope: !460)
!487 = !DILocation(line: 306, column: 8, scope: !460)
!488 = !DILocation(line: 307, column: 2, scope: !460)
!489 = !DILocation(line: 307, column: 9, scope: !460)
!490 = !DILocation(line: 308, column: 54, scope: !491)
!491 = distinct !DILexicalBlock(scope: !492, file: !1, line: 308, column: 7)
!492 = distinct !DILexicalBlock(scope: !460, file: !1, line: 307, column: 16)
!493 = !DILocation(line: 308, column: 61, scope: !491)
!494 = !DILocation(line: 308, column: 7, scope: !491)
!495 = !DILocation(line: 308, column: 7, scope: !492)
!496 = !DILocation(line: 309, column: 55, scope: !497)
!497 = distinct !DILexicalBlock(scope: !498, file: !1, line: 309, column: 8)
!498 = distinct !DILexicalBlock(scope: !491, file: !1, line: 308, column: 70)
!499 = !DILocation(line: 309, column: 62, scope: !497)
!500 = !DILocation(line: 309, column: 8, scope: !497)
!501 = !DILocation(line: 309, column: 8, scope: !498)
!502 = !DILocation(line: 310, column: 8, scope: !503)
!503 = distinct !DILexicalBlock(scope: !497, file: !1, line: 309, column: 71)
!504 = !DILocation(line: 311, column: 4, scope: !503)
!505 = !DILocation(line: 312, column: 3, scope: !498)
!506 = !DILocation(line: 314, column: 11, scope: !492)
!507 = !DILocation(line: 314, column: 18, scope: !492)
!508 = !DILocation(line: 314, column: 9, scope: !492)
!509 = distinct !{!509, !488, !510}
!510 = !DILocation(line: 315, column: 2, scope: !460)
!511 = !DILocation(line: 317, column: 9, scope: !460)
!512 = !DILocation(line: 317, column: 2, scope: !460)
!513 = distinct !DISubprogram(name: "BKE_tracking_reconstruction_context_new", scope: !1, file: !1, line: 352, type: !514, scopeLine: 354, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !418)
!514 = !DISubroutineType(types: !515)
!515 = !{!516, !580, !402, !70, !70, !70, !70}
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructContext", file: !1, line: 57, size: 1792, elements: !518)
!518 = !{!519, !522, !523, !524, !525, !526, !529, !530, !531, !532, !551, !552, !578, !579}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !517, file: !1, line: 58, baseType: !520, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DICompositeType(tag: DW_TAG_structure_type, name: "libmv_Tracks", file: !32, line: 34, flags: DIFlagFwdDecl)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "select_keyframes", scope: !517, file: !1, line: 59, baseType: !60, size: 8, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !517, file: !1, line: 60, baseType: !70, size: 32, offset: 96)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !517, file: !1, line: 60, baseType: !70, size: 32, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "refine_flags", scope: !517, file: !1, line: 61, baseType: !70, size: 32, offset: 160)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !517, file: !1, line: 63, baseType: !527, size: 64, offset: 192)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DICompositeType(tag: DW_TAG_structure_type, name: "libmv_Reconstruction", file: !32, line: 38, flags: DIFlagFwdDecl)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "object_name", scope: !517, file: !1, line: 65, baseType: !160, size: 512, offset: 256)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "is_camera", scope: !517, file: !1, line: 66, baseType: !60, size: 8, offset: 768)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !517, file: !1, line: 67, baseType: !72, size: 16, offset: 784)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "camera_intrinsics_options", scope: !517, file: !1, line: 69, baseType: !533, size: 768, offset: 832)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "libmv_CameraIntrinsicsOptions", file: !534, line: 54, baseType: !535)
!534 = !DIFile(filename: "blender/extern/libmv/intern/camera_intrinsics.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libmv_CameraIntrinsicsOptions", file: !534, line: 41, size: 768, elements: !536)
!536 = !{!537, !538, !539, !540, !542, !543, !544, !545, !546, !547, !548, !549, !550}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !535, file: !534, line: 43, baseType: !70, size: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "image_width", scope: !535, file: !534, line: 44, baseType: !70, size: 32, offset: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "image_height", scope: !535, file: !534, line: 44, baseType: !70, size: 32, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "focal_length", scope: !535, file: !534, line: 45, baseType: !541, size: 64, offset: 128)
!541 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "principal_point_x", scope: !535, file: !534, line: 46, baseType: !541, size: 64, offset: 192)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "principal_point_y", scope: !535, file: !534, line: 46, baseType: !541, size: 64, offset: 256)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "polynomial_k1", scope: !535, file: !534, line: 49, baseType: !541, size: 64, offset: 320)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "polynomial_k2", scope: !535, file: !534, line: 49, baseType: !541, size: 64, offset: 384)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "polynomial_k3", scope: !535, file: !534, line: 49, baseType: !541, size: 64, offset: 448)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "polynomial_p1", scope: !535, file: !534, line: 50, baseType: !541, size: 64, offset: 512)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "polynomial_p2", scope: !535, file: !534, line: 50, baseType: !541, size: 64, offset: 576)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !535, file: !534, line: 53, baseType: !541, size: 64, offset: 640)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !535, file: !534, line: 53, baseType: !541, size: 64, offset: 704)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "reprojection_error", scope: !517, file: !1, line: 71, baseType: !75, size: 32, offset: 1600)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "tracks_map", scope: !517, file: !1, line: 73, baseType: !553, size: 64, offset: 1664)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "TracksMap", file: !555, line: 64, baseType: !556)
!555 = !DIFile(filename: "blender/source/blender/blenkernel/tracking_private.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TracksMap", file: !555, line: 48, size: 896, elements: !557)
!557 = !{!558, !559, !560, !561, !562, !563, !564, !568, !569}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "object_name", scope: !556, file: !555, line: 49, baseType: !160, size: 512)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "is_camera", scope: !556, file: !555, line: 50, baseType: !60, size: 8, offset: 512)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "num_tracks", scope: !556, file: !555, line: 52, baseType: !70, size: 32, offset: 544)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_size", scope: !556, file: !555, line: 53, baseType: !70, size: 32, offset: 576)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !556, file: !555, line: 55, baseType: !417, size: 64, offset: 640)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !556, file: !555, line: 56, baseType: !152, size: 64, offset: 704)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !556, file: !555, line: 58, baseType: !565, size: 64, offset: 768)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !567, line: 47, flags: DIFlagFwdDecl)
!567 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!568 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !556, file: !555, line: 60, baseType: !70, size: 32, offset: 832)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "spin_lock", scope: !556, file: !555, line: 63, baseType: !570, size: 32, offset: 864)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpinLock", file: !571, line: 127, baseType: !572)
!571 = !DIFile(filename: "blender/source/blender/blenlib/BLI_threads.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "spec_null_spinlock_t", file: !573, line: 9, baseType: !574)
!573 = !DIFile(filename: "include/spec_pthread.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !575, line: 26, baseType: !576)
!575 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !577, line: 42, baseType: !5)
!577 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!578 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !517, file: !1, line: 75, baseType: !70, size: 32, offset: 1728)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "efra", scope: !517, file: !1, line: 75, baseType: !70, size: 32, offset: 1760)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieClip", file: !582, line: 101, baseType: !583)
!582 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !582, line: 64, size: 19136, elements: !584)
!584 = !{!585, !586, !655, !656, !657, !658, !660, !661, !662, !663, !666, !667, !668, !669, !680, !681, !682, !683, !684}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !583, file: !582, line: 65, baseType: !240, size: 960)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !583, file: !582, line: 66, baseType: !587, size: 64, offset: 960)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !589, line: 838, size: 768, elements: !590)
!589 = !DIFile(filename: "blender/source/blender/makesdna/DNA_anim_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!590 = !{!591, !605, !606, !616, !617, !648, !649, !650, !651, !652, !653, !654}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !588, file: !589, line: 840, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !567, line: 499, baseType: !594)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !567, line: 486, size: 1600, elements: !595)
!595 = !{!596, !597, !598, !599, !600, !601, !602, !603, !604}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !594, file: !567, line: 487, baseType: !240, size: 960)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !594, file: !567, line: 489, baseType: !118, size: 128, offset: 960)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !594, file: !567, line: 490, baseType: !118, size: 128, offset: 1088)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !594, file: !567, line: 491, baseType: !118, size: 128, offset: 1216)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !594, file: !567, line: 492, baseType: !118, size: 128, offset: 1344)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !594, file: !567, line: 494, baseType: !70, size: 32, offset: 1472)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !594, file: !567, line: 495, baseType: !70, size: 32, offset: 1504)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !594, file: !567, line: 497, baseType: !70, size: 32, offset: 1536)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !594, file: !567, line: 498, baseType: !70, size: 32, offset: 1568)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !588, file: !589, line: 844, baseType: !592, size: 64, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !588, file: !589, line: 848, baseType: !607, size: 64, offset: 128)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !589, line: 549, baseType: !609)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !589, line: 544, size: 320, elements: !610)
!610 = !{!611, !613, !614, !615}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !609, file: !589, line: 545, baseType: !612, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !609, file: !589, line: 545, baseType: !612, size: 64, offset: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !609, file: !589, line: 547, baseType: !592, size: 64, offset: 128)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !609, file: !589, line: 548, baseType: !118, size: 128, offset: 192)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !588, file: !589, line: 851, baseType: !118, size: 128, offset: 192)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !588, file: !589, line: 853, baseType: !618, size: 64, offset: 320)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !589, line: 594, baseType: !620)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !589, line: 561, size: 1664, elements: !621)
!621 = !{!622, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !620, file: !589, line: 562, baseType: !623, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !620, file: !589, line: 562, baseType: !623, size: 64, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !620, file: !589, line: 564, baseType: !118, size: 128, offset: 128)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !620, file: !589, line: 565, baseType: !592, size: 64, offset: 256)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !620, file: !589, line: 566, baseType: !607, size: 64, offset: 320)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !620, file: !589, line: 568, baseType: !118, size: 128, offset: 384)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !620, file: !589, line: 569, baseType: !118, size: 128, offset: 512)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !620, file: !589, line: 571, baseType: !160, size: 512, offset: 640)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !620, file: !589, line: 573, baseType: !75, size: 32, offset: 1152)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "strip_time", scope: !620, file: !589, line: 574, baseType: !75, size: 32, offset: 1184)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !620, file: !589, line: 576, baseType: !75, size: 32, offset: 1216)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !620, file: !589, line: 576, baseType: !75, size: 32, offset: 1248)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "actstart", scope: !620, file: !589, line: 577, baseType: !75, size: 32, offset: 1280)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "actend", scope: !620, file: !589, line: 577, baseType: !75, size: 32, offset: 1312)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !620, file: !589, line: 579, baseType: !75, size: 32, offset: 1344)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !620, file: !589, line: 580, baseType: !75, size: 32, offset: 1376)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !620, file: !589, line: 582, baseType: !75, size: 32, offset: 1408)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !620, file: !589, line: 582, baseType: !75, size: 32, offset: 1440)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "blendmode", scope: !620, file: !589, line: 583, baseType: !72, size: 16, offset: 1472)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "extendmode", scope: !620, file: !589, line: 585, baseType: !72, size: 16, offset: 1488)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !620, file: !589, line: 586, baseType: !72, size: 16, offset: 1504)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !620, file: !589, line: 588, baseType: !72, size: 16, offset: 1520)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handle", scope: !620, file: !589, line: 590, baseType: !52, size: 64, offset: 1536)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !620, file: !589, line: 592, baseType: !70, size: 32, offset: 1600)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !620, file: !589, line: 593, baseType: !70, size: 32, offset: 1632)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "drivers", scope: !588, file: !589, line: 858, baseType: !118, size: 128, offset: 384)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "overrides", scope: !588, file: !589, line: 859, baseType: !118, size: 128, offset: 512)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !588, file: !589, line: 862, baseType: !70, size: 32, offset: 640)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !588, file: !589, line: 863, baseType: !70, size: 32, offset: 672)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "act_blendmode", scope: !588, file: !589, line: 866, baseType: !72, size: 16, offset: 704)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "act_extendmode", scope: !588, file: !589, line: 867, baseType: !72, size: 16, offset: 720)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "act_influence", scope: !588, file: !589, line: 868, baseType: !75, size: 32, offset: 736)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !583, file: !582, line: 68, baseType: !259, size: 8192, offset: 1024)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !583, file: !582, line: 70, baseType: !70, size: 32, offset: 9216)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !583, file: !582, line: 71, baseType: !70, size: 32, offset: 9248)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !583, file: !582, line: 72, baseType: !659, size: 64, offset: 9280)
!659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 64, elements: !110)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !583, file: !582, line: 74, baseType: !75, size: 32, offset: 9344)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !583, file: !582, line: 74, baseType: !75, size: 32, offset: 9376)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !583, file: !582, line: 76, baseType: !306, size: 64, offset: 9408)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !583, file: !582, line: 77, baseType: !664, size: 64, offset: 9472)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !582, line: 77, flags: DIFlagFwdDecl)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !583, file: !582, line: 78, baseType: !200, size: 64, offset: 9536)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !583, file: !582, line: 80, baseType: !63, size: 2624, offset: 9600)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !583, file: !582, line: 81, baseType: !52, size: 64, offset: 12224)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !583, file: !582, line: 85, baseType: !670, size: 6208, offset: 12288)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !582, line: 55, size: 6208, elements: !671)
!671 = !{!672, !676, !677, !678, !679}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !670, file: !582, line: 56, baseType: !673, size: 6144)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 6144, elements: !674)
!674 = !{!675}
!675 = !DISubrange(count: 768)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !670, file: !582, line: 58, baseType: !72, size: 16, offset: 6144)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !670, file: !582, line: 59, baseType: !72, size: 16, offset: 6160)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !670, file: !582, line: 60, baseType: !72, size: 16, offset: 6176)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !670, file: !582, line: 61, baseType: !72, size: 16, offset: 6192)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !583, file: !582, line: 86, baseType: !70, size: 32, offset: 18496)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !583, file: !582, line: 88, baseType: !70, size: 32, offset: 18528)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !583, file: !582, line: 90, baseType: !70, size: 32, offset: 18560)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !583, file: !582, line: 94, baseType: !70, size: 32, offset: 18592)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !583, file: !582, line: 100, baseType: !361, size: 512, offset: 18624)
!685 = !DILocalVariable(name: "clip", arg: 1, scope: !513, file: !1, line: 352, type: !580)
!686 = !DILocation(line: 352, column: 77, scope: !513)
!687 = !DILocalVariable(name: "object", arg: 2, scope: !513, file: !1, line: 352, type: !402)
!688 = !DILocation(line: 352, column: 104, scope: !513)
!689 = !DILocalVariable(name: "keyframe1", arg: 3, scope: !513, file: !1, line: 353, type: !70)
!690 = !DILocation(line: 353, column: 70, scope: !513)
!691 = !DILocalVariable(name: "keyframe2", arg: 4, scope: !513, file: !1, line: 353, type: !70)
!692 = !DILocation(line: 353, column: 85, scope: !513)
!693 = !DILocalVariable(name: "width", arg: 5, scope: !513, file: !1, line: 353, type: !70)
!694 = !DILocation(line: 353, column: 100, scope: !513)
!695 = !DILocalVariable(name: "height", arg: 6, scope: !513, file: !1, line: 353, type: !70)
!696 = !DILocation(line: 353, column: 111, scope: !513)
!697 = !DILocalVariable(name: "tracking", scope: !513, file: !1, line: 355, type: !61)
!698 = !DILocation(line: 355, column: 17, scope: !513)
!699 = !DILocation(line: 355, column: 29, scope: !513)
!700 = !DILocation(line: 355, column: 35, scope: !513)
!701 = !DILocalVariable(name: "context", scope: !513, file: !1, line: 356, type: !702)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieReconstructContext", file: !1, line: 76, baseType: !517)
!704 = !DILocation(line: 356, column: 27, scope: !513)
!705 = !DILocation(line: 356, column: 37, scope: !513)
!706 = !DILocalVariable(name: "tracksbase", scope: !513, file: !1, line: 357, type: !468)
!707 = !DILocation(line: 357, column: 12, scope: !513)
!708 = !DILocation(line: 357, column: 56, scope: !513)
!709 = !DILocation(line: 357, column: 66, scope: !513)
!710 = !DILocation(line: 357, column: 25, scope: !513)
!711 = !DILocalVariable(name: "aspy", scope: !513, file: !1, line: 358, type: !75)
!712 = !DILocation(line: 358, column: 8, scope: !513)
!713 = !DILocation(line: 358, column: 22, scope: !513)
!714 = !DILocation(line: 358, column: 32, scope: !513)
!715 = !DILocation(line: 358, column: 39, scope: !513)
!716 = !DILocation(line: 358, column: 20, scope: !513)
!717 = !DILocalVariable(name: "num_tracks", scope: !513, file: !1, line: 359, type: !70)
!718 = !DILocation(line: 359, column: 6, scope: !513)
!719 = !DILocation(line: 359, column: 33, scope: !513)
!720 = !DILocation(line: 359, column: 19, scope: !513)
!721 = !DILocalVariable(name: "sfra", scope: !513, file: !1, line: 360, type: !70)
!722 = !DILocation(line: 360, column: 6, scope: !513)
!723 = !DILocalVariable(name: "efra", scope: !513, file: !1, line: 360, type: !70)
!724 = !DILocation(line: 360, column: 22, scope: !513)
!725 = !DILocalVariable(name: "track", scope: !513, file: !1, line: 361, type: !152)
!726 = !DILocation(line: 361, column: 22, scope: !513)
!727 = !DILocation(line: 363, column: 14, scope: !513)
!728 = !DILocation(line: 363, column: 23, scope: !513)
!729 = !DILocation(line: 363, column: 36, scope: !513)
!730 = !DILocation(line: 363, column: 44, scope: !513)
!731 = !DILocation(line: 363, column: 2, scope: !513)
!732 = !DILocation(line: 364, column: 23, scope: !513)
!733 = !DILocation(line: 364, column: 31, scope: !513)
!734 = !DILocation(line: 364, column: 36, scope: !513)
!735 = !DILocation(line: 364, column: 2, scope: !513)
!736 = !DILocation(line: 364, column: 11, scope: !513)
!737 = !DILocation(line: 364, column: 21, scope: !513)
!738 = !DILocation(line: 365, column: 25, scope: !513)
!739 = !DILocation(line: 365, column: 35, scope: !513)
!740 = !DILocation(line: 365, column: 44, scope: !513)
!741 = !DILocation(line: 365, column: 2, scope: !513)
!742 = !DILocation(line: 365, column: 11, scope: !513)
!743 = !DILocation(line: 365, column: 23, scope: !513)
!744 = !DILocation(line: 368, column: 4, scope: !513)
!745 = !DILocation(line: 368, column: 14, scope: !513)
!746 = !DILocation(line: 368, column: 23, scope: !513)
!747 = !DILocation(line: 368, column: 43, scope: !513)
!748 = !DILocation(line: 368, column: 78, scope: !513)
!749 = !DILocation(line: 368, column: 3, scope: !513)
!750 = !DILocation(line: 367, column: 2, scope: !513)
!751 = !DILocation(line: 367, column: 11, scope: !513)
!752 = !DILocation(line: 367, column: 28, scope: !513)
!753 = !DILocation(line: 370, column: 47, scope: !513)
!754 = !DILocation(line: 371, column: 50, scope: !513)
!755 = !DILocation(line: 371, column: 57, scope: !513)
!756 = !DILocation(line: 372, column: 51, scope: !513)
!757 = !DILocation(line: 372, column: 60, scope: !513)
!758 = !DILocation(line: 370, column: 2, scope: !513)
!759 = !DILocation(line: 374, column: 39, scope: !513)
!760 = !DILocation(line: 374, column: 48, scope: !513)
!761 = !DILocation(line: 374, column: 61, scope: !513)
!762 = !DILocation(line: 374, column: 70, scope: !513)
!763 = !DILocation(line: 374, column: 81, scope: !513)
!764 = !DILocation(line: 374, column: 24, scope: !513)
!765 = !DILocation(line: 374, column: 2, scope: !513)
!766 = !DILocation(line: 374, column: 11, scope: !513)
!767 = !DILocation(line: 374, column: 22, scope: !513)
!768 = !DILocation(line: 376, column: 10, scope: !513)
!769 = !DILocation(line: 376, column: 22, scope: !513)
!770 = !DILocation(line: 376, column: 8, scope: !513)
!771 = !DILocation(line: 377, column: 2, scope: !513)
!772 = !DILocation(line: 377, column: 9, scope: !513)
!773 = !DILocalVariable(name: "first", scope: !774, file: !1, line: 378, type: !70)
!774 = distinct !DILexicalBlock(scope: !513, file: !1, line: 377, column: 16)
!775 = !DILocation(line: 378, column: 7, scope: !774)
!776 = !DILocalVariable(name: "last", scope: !774, file: !1, line: 378, type: !70)
!777 = !DILocation(line: 378, column: 18, scope: !774)
!778 = !DILocation(line: 378, column: 25, scope: !774)
!779 = !DILocation(line: 378, column: 32, scope: !774)
!780 = !DILocation(line: 378, column: 42, scope: !774)
!781 = !DILocalVariable(name: "first_marker", scope: !774, file: !1, line: 379, type: !172)
!782 = !DILocation(line: 379, column: 24, scope: !774)
!783 = !DILocation(line: 379, column: 40, scope: !774)
!784 = !DILocation(line: 379, column: 47, scope: !774)
!785 = !DILocalVariable(name: "last_marker", scope: !774, file: !1, line: 380, type: !172)
!786 = !DILocation(line: 380, column: 24, scope: !774)
!787 = !DILocation(line: 380, column: 39, scope: !774)
!788 = !DILocation(line: 380, column: 46, scope: !774)
!789 = !DILocation(line: 380, column: 54, scope: !774)
!790 = !DILocation(line: 380, column: 61, scope: !774)
!791 = !DILocation(line: 380, column: 71, scope: !774)
!792 = !DILocation(line: 383, column: 3, scope: !774)
!793 = !DILocation(line: 383, column: 10, scope: !774)
!794 = !DILocation(line: 383, column: 19, scope: !774)
!795 = !DILocation(line: 383, column: 26, scope: !774)
!796 = !DILocation(line: 383, column: 36, scope: !774)
!797 = !DILocation(line: 383, column: 16, scope: !774)
!798 = !DILocation(line: 383, column: 40, scope: !774)
!799 = !DILocation(line: 383, column: 43, scope: !774)
!800 = !DILocation(line: 383, column: 57, scope: !774)
!801 = !DILocation(line: 383, column: 62, scope: !774)
!802 = !DILocation(line: 0, scope: !774)
!803 = !DILocation(line: 384, column: 9, scope: !804)
!804 = distinct !DILexicalBlock(scope: !774, file: !1, line: 383, column: 81)
!805 = !DILocation(line: 385, column: 16, scope: !804)
!806 = distinct !{!806, !792, !807}
!807 = !DILocation(line: 386, column: 3, scope: !774)
!808 = !DILocation(line: 389, column: 3, scope: !774)
!809 = !DILocation(line: 389, column: 10, scope: !774)
!810 = !DILocation(line: 389, column: 15, scope: !774)
!811 = !DILocation(line: 389, column: 20, scope: !774)
!812 = !DILocation(line: 389, column: 23, scope: !774)
!813 = !DILocation(line: 389, column: 36, scope: !774)
!814 = !DILocation(line: 389, column: 41, scope: !774)
!815 = !DILocation(line: 390, column: 8, scope: !816)
!816 = distinct !DILexicalBlock(scope: !774, file: !1, line: 389, column: 60)
!817 = !DILocation(line: 391, column: 15, scope: !816)
!818 = distinct !{!818, !808, !819}
!819 = !DILocation(line: 392, column: 3, scope: !774)
!820 = !DILocation(line: 394, column: 7, scope: !821)
!821 = distinct !DILexicalBlock(scope: !774, file: !1, line: 394, column: 7)
!822 = !DILocation(line: 394, column: 15, scope: !821)
!823 = !DILocation(line: 394, column: 22, scope: !821)
!824 = !DILocation(line: 394, column: 32, scope: !821)
!825 = !DILocation(line: 394, column: 13, scope: !821)
!826 = !DILocation(line: 394, column: 7, scope: !774)
!827 = !DILocation(line: 395, column: 18, scope: !821)
!828 = !DILocation(line: 395, column: 24, scope: !821)
!829 = !DILocation(line: 395, column: 38, scope: !821)
!830 = !DILocation(line: 395, column: 11, scope: !821)
!831 = !DILocation(line: 395, column: 9, scope: !821)
!832 = !DILocation(line: 395, column: 4, scope: !821)
!833 = !DILocation(line: 397, column: 7, scope: !834)
!834 = distinct !DILexicalBlock(scope: !774, file: !1, line: 397, column: 7)
!835 = !DILocation(line: 397, column: 12, scope: !834)
!836 = !DILocation(line: 397, column: 7, scope: !774)
!837 = !DILocation(line: 398, column: 18, scope: !834)
!838 = !DILocation(line: 398, column: 24, scope: !834)
!839 = !DILocation(line: 398, column: 37, scope: !834)
!840 = !DILocation(line: 398, column: 11, scope: !834)
!841 = !DILocation(line: 398, column: 9, scope: !834)
!842 = !DILocation(line: 398, column: 4, scope: !834)
!843 = !DILocation(line: 400, column: 21, scope: !774)
!844 = !DILocation(line: 400, column: 30, scope: !774)
!845 = !DILocation(line: 400, column: 42, scope: !774)
!846 = !DILocation(line: 400, column: 3, scope: !774)
!847 = !DILocation(line: 402, column: 11, scope: !774)
!848 = !DILocation(line: 402, column: 18, scope: !774)
!849 = !DILocation(line: 402, column: 9, scope: !774)
!850 = distinct !{!850, !771, !851}
!851 = !DILocation(line: 403, column: 2, scope: !513)
!852 = !DILocation(line: 405, column: 18, scope: !513)
!853 = !DILocation(line: 405, column: 2, scope: !513)
!854 = !DILocation(line: 405, column: 11, scope: !513)
!855 = !DILocation(line: 405, column: 16, scope: !513)
!856 = !DILocation(line: 406, column: 18, scope: !513)
!857 = !DILocation(line: 406, column: 2, scope: !513)
!858 = !DILocation(line: 406, column: 11, scope: !513)
!859 = !DILocation(line: 406, column: 16, scope: !513)
!860 = !DILocation(line: 408, column: 37, scope: !513)
!861 = !DILocation(line: 408, column: 43, scope: !513)
!862 = !DILocation(line: 408, column: 55, scope: !513)
!863 = !DILocation(line: 408, column: 62, scope: !513)
!864 = !DILocation(line: 408, column: 71, scope: !513)
!865 = !DILocation(line: 408, column: 69, scope: !513)
!866 = !DILocation(line: 408, column: 20, scope: !513)
!867 = !DILocation(line: 408, column: 2, scope: !513)
!868 = !DILocation(line: 408, column: 11, scope: !513)
!869 = !DILocation(line: 408, column: 18, scope: !513)
!870 = !DILocation(line: 409, column: 23, scope: !513)
!871 = !DILocation(line: 409, column: 2, scope: !513)
!872 = !DILocation(line: 409, column: 11, scope: !513)
!873 = !DILocation(line: 409, column: 21, scope: !513)
!874 = !DILocation(line: 410, column: 23, scope: !513)
!875 = !DILocation(line: 410, column: 2, scope: !513)
!876 = !DILocation(line: 410, column: 11, scope: !513)
!877 = !DILocation(line: 410, column: 21, scope: !513)
!878 = !DILocation(line: 411, column: 66, scope: !513)
!879 = !DILocation(line: 411, column: 76, scope: !513)
!880 = !DILocation(line: 411, column: 26, scope: !513)
!881 = !DILocation(line: 411, column: 2, scope: !513)
!882 = !DILocation(line: 411, column: 11, scope: !513)
!883 = !DILocation(line: 411, column: 24, scope: !513)
!884 = !DILocation(line: 413, column: 9, scope: !513)
!885 = !DILocation(line: 413, column: 2, scope: !513)
!886 = distinct !DISubprogram(name: "min_ii", scope: !887, file: !887, line: 211, type: !888, scopeLine: 212, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !418)
!887 = !DIFile(filename: "blender/source/blender/blenlib/intern/math_base_inline.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!888 = !DISubroutineType(types: !889)
!889 = !{!70, !70, !70}
!890 = !DILocalVariable(name: "a", arg: 1, scope: !886, file: !887, line: 211, type: !70)
!891 = !DILocation(line: 211, column: 24, scope: !886)
!892 = !DILocalVariable(name: "b", arg: 2, scope: !886, file: !887, line: 211, type: !70)
!893 = !DILocation(line: 211, column: 31, scope: !886)
!894 = !DILocation(line: 213, column: 10, scope: !886)
!895 = !DILocation(line: 213, column: 14, scope: !886)
!896 = !DILocation(line: 213, column: 12, scope: !886)
!897 = !DILocation(line: 213, column: 9, scope: !886)
!898 = !DILocation(line: 213, column: 19, scope: !886)
!899 = !DILocation(line: 213, column: 23, scope: !886)
!900 = !DILocation(line: 213, column: 2, scope: !886)
!901 = distinct !DISubprogram(name: "max_ii", scope: !887, file: !887, line: 215, type: !888, scopeLine: 216, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !418)
!902 = !DILocalVariable(name: "a", arg: 1, scope: !901, file: !887, line: 215, type: !70)
!903 = !DILocation(line: 215, column: 24, scope: !901)
!904 = !DILocalVariable(name: "b", arg: 2, scope: !901, file: !887, line: 215, type: !70)
!905 = !DILocation(line: 215, column: 31, scope: !901)
!906 = !DILocation(line: 217, column: 10, scope: !901)
!907 = !DILocation(line: 217, column: 14, scope: !901)
!908 = !DILocation(line: 217, column: 12, scope: !901)
!909 = !DILocation(line: 217, column: 9, scope: !901)
!910 = !DILocation(line: 217, column: 19, scope: !901)
!911 = !DILocation(line: 217, column: 23, scope: !901)
!912 = !DILocation(line: 217, column: 2, scope: !901)
!913 = distinct !DISubprogram(name: "libmv_tracks_new", scope: !1, file: !1, line: 87, type: !914, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !418)
!914 = !DISubroutineType(types: !915)
!915 = !{!520, !580, !468, !70, !70}
!916 = !DILocalVariable(name: "clip", arg: 1, scope: !913, file: !1, line: 87, type: !580)
!917 = !DILocation(line: 87, column: 57, scope: !913)
!918 = !DILocalVariable(name: "tracksbase", arg: 2, scope: !913, file: !1, line: 87, type: !468)
!919 = !DILocation(line: 87, column: 73, scope: !913)
!920 = !DILocalVariable(name: "width", arg: 3, scope: !913, file: !1, line: 87, type: !70)
!921 = !DILocation(line: 87, column: 89, scope: !913)
!922 = !DILocalVariable(name: "height", arg: 4, scope: !913, file: !1, line: 87, type: !70)
!923 = !DILocation(line: 87, column: 100, scope: !913)
!924 = !DILocalVariable(name: "tracknr", scope: !913, file: !1, line: 89, type: !70)
!925 = !DILocation(line: 89, column: 6, scope: !913)
!926 = !DILocalVariable(name: "track", scope: !913, file: !1, line: 90, type: !152)
!927 = !DILocation(line: 90, column: 22, scope: !913)
!928 = !DILocalVariable(name: "tracks", scope: !913, file: !1, line: 91, type: !520)
!929 = !DILocation(line: 91, column: 23, scope: !913)
!930 = !DILocation(line: 91, column: 32, scope: !913)
!931 = !DILocation(line: 93, column: 10, scope: !913)
!932 = !DILocation(line: 93, column: 22, scope: !913)
!933 = !DILocation(line: 93, column: 8, scope: !913)
!934 = !DILocation(line: 94, column: 2, scope: !913)
!935 = !DILocation(line: 94, column: 9, scope: !913)
!936 = !DILocalVariable(name: "weight_fcurve", scope: !937, file: !1, line: 95, type: !938)
!937 = distinct !DILexicalBlock(scope: !913, file: !1, line: 94, column: 16)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "FCurve", file: !589, line: 463, baseType: !940)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FCurve", file: !589, line: 433, size: 896, elements: !941)
!941 = !{!942, !944, !945, !968, !980, !981, !1005, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !940, file: !589, line: 434, baseType: !943, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !940, file: !589, line: 434, baseType: !943, size: 64, offset: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "grp", scope: !940, file: !589, line: 437, baseType: !946, size: 64, offset: 128)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "bActionGroup", file: !567, line: 450, baseType: !948)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bActionGroup", file: !567, line: 440, size: 960, elements: !949)
!949 = !{!950, !952, !953, !954, !955, !956, !957}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !948, file: !567, line: 441, baseType: !951, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !948, file: !567, line: 441, baseType: !951, size: 64, offset: 64)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !948, file: !567, line: 443, baseType: !118, size: 128, offset: 128)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !948, file: !567, line: 445, baseType: !70, size: 32, offset: 256)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "customCol", scope: !948, file: !567, line: 446, baseType: !70, size: 32, offset: 288)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !948, file: !567, line: 447, baseType: !160, size: 512, offset: 320)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !948, file: !567, line: 449, baseType: !958, size: 128, offset: 832)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThemeWireColor", file: !959, line: 347, baseType: !960)
!959 = !DIFile(filename: "blender/source/blender/makesdna/DNA_userdef_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ThemeWireColor", file: !959, line: 340, size: 128, elements: !961)
!961 = !{!962, !964, !965, !966, !967}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "solid", scope: !960, file: !959, line: 341, baseType: !963, size: 32)
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 32, elements: !357)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "select", scope: !960, file: !959, line: 342, baseType: !963, size: 32, offset: 32)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !960, file: !959, line: 343, baseType: !963, size: 32, offset: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !960, file: !959, line: 345, baseType: !72, size: 16, offset: 96)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !960, file: !959, line: 346, baseType: !72, size: 16, offset: 112)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "driver", scope: !940, file: !589, line: 440, baseType: !969, size: 64, offset: 192)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelDriver", file: !589, line: 386, baseType: !971)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ChannelDriver", file: !589, line: 371, size: 2368, elements: !972)
!972 = !{!973, !974, !975, !976, !977, !978, !979}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "variables", scope: !971, file: !589, line: 372, baseType: !118, size: 128)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "expression", scope: !971, file: !589, line: 377, baseType: !388, size: 2048, offset: 128)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "expr_comp", scope: !971, file: !589, line: 378, baseType: !52, size: 64, offset: 2176)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "curval", scope: !971, file: !589, line: 380, baseType: !75, size: 32, offset: 2240)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !971, file: !589, line: 381, baseType: !75, size: 32, offset: 2272)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !971, file: !589, line: 384, baseType: !70, size: 32, offset: 2304)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !971, file: !589, line: 385, baseType: !70, size: 32, offset: 2336)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !940, file: !589, line: 442, baseType: !118, size: 128, offset: 256)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "bezt", scope: !940, file: !589, line: 445, baseType: !982, size: 64, offset: 384)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "BezTriple", file: !984, line: 133, baseType: !985)
!984 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BezTriple", file: !984, line: 117, size: 576, elements: !986)
!986 = !{!987, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !985, file: !984, line: 118, baseType: !988, size: 288)
!988 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 288, elements: !989)
!989 = !{!187, !187}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "alfa", scope: !985, file: !984, line: 119, baseType: !75, size: 32, offset: 288)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !985, file: !984, line: 119, baseType: !75, size: 32, offset: 320)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !985, file: !984, line: 119, baseType: !75, size: 32, offset: 352)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !985, file: !984, line: 121, baseType: !161, size: 8, offset: 384)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "h1", scope: !985, file: !984, line: 123, baseType: !161, size: 8, offset: 392)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "h2", scope: !985, file: !984, line: 123, baseType: !161, size: 8, offset: 400)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "f1", scope: !985, file: !984, line: 124, baseType: !161, size: 8, offset: 408)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "f2", scope: !985, file: !984, line: 124, baseType: !161, size: 8, offset: 416)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "f3", scope: !985, file: !984, line: 124, baseType: !161, size: 8, offset: 424)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "hide", scope: !985, file: !984, line: 126, baseType: !161, size: 8, offset: 432)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "easing", scope: !985, file: !984, line: 128, baseType: !161, size: 8, offset: 440)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !985, file: !984, line: 129, baseType: !75, size: 32, offset: 448)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "amplitude", scope: !985, file: !984, line: 130, baseType: !75, size: 32, offset: 480)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !985, file: !984, line: 130, baseType: !75, size: 32, offset: 512)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !985, file: !984, line: 132, baseType: !963, size: 32, offset: 544)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "fpt", scope: !940, file: !589, line: 446, baseType: !1006, size: 64, offset: 448)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "FPoint", file: !589, line: 430, baseType: !1008)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FPoint", file: !589, line: 426, size: 128, elements: !1009)
!1009 = !{!1010, !1011, !1012}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1008, file: !589, line: 427, baseType: !109, size: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1008, file: !589, line: 428, baseType: !70, size: 32, offset: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1008, file: !589, line: 429, baseType: !70, size: 32, offset: 96)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !940, file: !589, line: 447, baseType: !5, size: 32, offset: 512)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "curval", scope: !940, file: !589, line: 450, baseType: !75, size: 32, offset: 544)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !940, file: !589, line: 451, baseType: !72, size: 16, offset: 576)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !940, file: !589, line: 452, baseType: !72, size: 16, offset: 592)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "array_index", scope: !940, file: !589, line: 455, baseType: !70, size: 32, offset: 608)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "rna_path", scope: !940, file: !589, line: 456, baseType: !417, size: 64, offset: 640)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !940, file: !589, line: 459, baseType: !70, size: 32, offset: 704)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !940, file: !589, line: 460, baseType: !185, size: 96, offset: 736)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "prev_norm_factor", scope: !940, file: !589, line: 462, baseType: !75, size: 32, offset: 832)
