; ModuleID = 'blender/source/blender/imbuf/intern/iris.c'
source_filename = "blender/source/blender/imbuf/intern/iris.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.ImBuf = type { %struct.ImBuf*, %struct.ImBuf*, i32, i32, i8, i32, i32, i32, i32*, float*, [2 x double], i32, i32, i32, i32, i32**, i32*, float*, float, [20 x %struct.ImBuf*], i32, i32, i32, i32, %struct.ImMetaData*, i8*, i32, [1024 x i8], [1024 x i8], %struct.MEM_CacheLimiterHandle_s*, i32, i8*, i32, i32, %struct.ColorSpace*, %struct.ColorSpace*, i32*, %struct.ColormanageCache*, i32, %struct.rcti, %struct.DDSData }
%struct.ImMetaData = type opaque
%struct.MEM_CacheLimiterHandle_s = type opaque
%struct.ColorSpace = type { %struct.ColorSpace*, %struct.ColorSpace*, i32, [64 x i8], [512 x i8], %struct.OCIO_ConstProcessorRcPtr*, %struct.OCIO_ConstProcessorRcPtr*, i8, i8 }
%struct.OCIO_ConstProcessorRcPtr = type opaque
%struct.ColormanageCache = type opaque
%struct.rcti = type { i32, i32, i32, i32 }
%struct.DDSData = type { i32, i32, i8*, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "file_data", scope: !2, file: !3, line: 126, type: !18, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !15, globals: !63, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "blender/source/blender/imbuf/intern/iris.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 201, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "blender/source/blender/imbuf/IMB_colormanagement.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14}
!9 = !DIEnumerator(name: "COLOR_ROLE_SCENE_LINEAR", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "COLOR_ROLE_COLOR_PICKING", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "COLOR_ROLE_TEXTURE_PAINTING", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "COLOR_ROLE_DEFAULT_SEQUENCER", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "COLOR_ROLE_DEFAULT_BYTE", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "COLOR_ROLE_DEFAULT_FLOAT", value: 5, isUnsigned: true)
!15 = !{!16, !18, !21, !22, !23, !24, !45}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !20, line: 78, baseType: !17)
!20 = !DIFile(filename: "blender/source/blender/imbuf/intern/imbuf.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "IMAGE", file: !3, line: 76, baseType: !26)
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 49, size: 1408, elements: !27)
!27 = !{!28, !30, !31, !32, !33, !34, !35, !36, !37, !38, !43, !44, !46, !47, !49, !50, !51, !52, !53, !55, !56, !57, !58, !59, !60}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "imagic", scope: !26, file: !3, line: 50, baseType: !29, size: 16)
!29 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !26, file: !3, line: 51, baseType: !29, size: 16, offset: 16)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "dim", scope: !26, file: !3, line: 52, baseType: !29, size: 16, offset: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "xsize", scope: !26, file: !3, line: 53, baseType: !29, size: 16, offset: 48)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ysize", scope: !26, file: !3, line: 54, baseType: !29, size: 16, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "zsize", scope: !26, file: !3, line: 55, baseType: !29, size: 16, offset: 80)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !26, file: !3, line: 56, baseType: !7, size: 32, offset: 96)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !26, file: !3, line: 57, baseType: !7, size: 32, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "wastebytes", scope: !26, file: !3, line: 58, baseType: !7, size: 32, offset: 160)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !26, file: !3, line: 59, baseType: !39, size: 640, offset: 192)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 640, elements: !41)
!40 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!41 = !{!42}
!42 = !DISubrange(count: 80)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !26, file: !3, line: 60, baseType: !7, size: 32, offset: 832)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !26, file: !3, line: 62, baseType: !45, size: 32, offset: 864)
!45 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !26, file: !3, line: 63, baseType: !29, size: 16, offset: 896)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "dorev", scope: !26, file: !3, line: 64, baseType: !48, size: 16, offset: 912)
!48 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !26, file: !3, line: 65, baseType: !48, size: 16, offset: 928)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !26, file: !3, line: 66, baseType: !48, size: 16, offset: 944)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !26, file: !3, line: 67, baseType: !48, size: 16, offset: 960)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "cnt", scope: !26, file: !3, line: 68, baseType: !48, size: 16, offset: 976)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !26, file: !3, line: 69, baseType: !54, size: 64, offset: 1024)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !26, file: !3, line: 70, baseType: !54, size: 64, offset: 1088)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "tmpbuf", scope: !26, file: !3, line: 71, baseType: !54, size: 64, offset: 1152)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !26, file: !3, line: 72, baseType: !7, size: 32, offset: 1216)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "rleend", scope: !26, file: !3, line: 73, baseType: !7, size: 32, offset: 1248)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "rowstart", scope: !26, file: !3, line: 74, baseType: !21, size: 64, offset: 1280)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "rowsize", scope: !26, file: !3, line: 75, baseType: !61, size: 64, offset: 1344)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!63 = !{!0, !64}
!64 = !DIGlobalVariableExpression(var: !65, expr: !DIExpression())
!65 = distinct !DIGlobalVariable(name: "file_offset", scope: !2, file: !3, line: 127, type: !45, isLocal: true, isDefinition: true)
!66 = !{i32 7, !"Dwarf Version", i32 4}
!67 = !{i32 2, !"Debug Info Version", i32 3}
!68 = !{i32 1, !"wchar_size", i32 4}
!69 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!70 = distinct !DISubprogram(name: "imb_is_a_iris", scope: !3, file: !3, line: 242, type: !71, scopeLine: 243, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !73)
!71 = !DISubroutineType(types: !72)
!72 = !{!45, !16}
!73 = !{}
!74 = !DILocalVariable(name: "mem", arg: 1, scope: !70, file: !3, line: 242, type: !16)
!75 = !DILocation(line: 242, column: 34, scope: !70)
!76 = !DILocation(line: 244, column: 11, scope: !70)
!77 = !DILocation(line: 244, column: 19, scope: !70)
!78 = !DILocation(line: 244, column: 30, scope: !70)
!79 = !DILocation(line: 244, column: 34, scope: !70)
!80 = !DILocation(line: 244, column: 43, scope: !70)
!81 = !DILocation(line: 244, column: 2, scope: !70)
!82 = distinct !DISubprogram(name: "imb_loadiris", scope: !3, file: !3, line: 254, type: !83, scopeLine: 255, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !73)
!83 = !DISubroutineType(types: !84)
!84 = !{!85, !16, !184, !45, !187}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !87, line: 70, size: 19840, elements: !88)
!87 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!88 = !{!89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !100, !105, !106, !107, !108, !109, !111, !113, !114, !115, !119, !120, !121, !122, !123, !126, !127, !128, !132, !133, !136, !137, !138, !139, !140, !162, !163, !164, !167, !168, !177}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !86, file: !87, line: 71, baseType: !85, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !86, file: !87, line: 71, baseType: !85, size: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !86, file: !87, line: 74, baseType: !45, size: 32, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !86, file: !87, line: 74, baseType: !45, size: 32, offset: 160)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !86, file: !87, line: 79, baseType: !17, size: 8, offset: 192)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !86, file: !87, line: 80, baseType: !45, size: 32, offset: 224)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !86, file: !87, line: 83, baseType: !45, size: 32, offset: 256)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "mall", scope: !86, file: !87, line: 84, baseType: !45, size: 32, offset: 288)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !86, file: !87, line: 87, baseType: !21, size: 64, offset: 320)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "rect_float", scope: !86, file: !87, line: 88, baseType: !99, size: 64, offset: 384)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "ppm", scope: !86, file: !87, line: 93, baseType: !101, size: 128, offset: 448)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 128, elements: !103)
!102 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!103 = !{!104}
!104 = !DISubrange(count: 2)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "tilex", scope: !86, file: !87, line: 96, baseType: !45, size: 32, offset: 576)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "tiley", scope: !86, file: !87, line: 96, baseType: !45, size: 32, offset: 608)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "xtiles", scope: !86, file: !87, line: 97, baseType: !45, size: 32, offset: 640)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "ytiles", scope: !86, file: !87, line: 97, baseType: !45, size: 32, offset: 672)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tiles", scope: !86, file: !87, line: 98, baseType: !110, size: 64, offset: 704)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !86, file: !87, line: 101, baseType: !112, size: 64, offset: 768)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_float", scope: !86, file: !87, line: 102, baseType: !99, size: 64, offset: 832)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !86, file: !87, line: 105, baseType: !23, size: 32, offset: 896)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "mipmap", scope: !86, file: !87, line: 108, baseType: !116, size: 1280, offset: 960)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 1280, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 20)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "miptot", scope: !86, file: !87, line: 109, baseType: !45, size: 32, offset: 2240)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "miplevel", scope: !86, file: !87, line: 109, baseType: !45, size: 32, offset: 2272)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !86, file: !87, line: 112, baseType: !45, size: 32, offset: 2304)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "userflags", scope: !86, file: !87, line: 113, baseType: !45, size: 32, offset: 2336)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !86, file: !87, line: 114, baseType: !124, size: 64, offset: 2368)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImMetaData", file: !87, line: 50, flags: DIFlagFwdDecl)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !86, file: !87, line: 115, baseType: !22, size: 64, offset: 2432)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !86, file: !87, line: 118, baseType: !45, size: 32, offset: 2496)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !86, file: !87, line: 119, baseType: !129, size: 8192, offset: 2528)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 8192, elements: !130)
!130 = !{!131}
!131 = !DISubrange(count: 1024)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "cachename", scope: !86, file: !87, line: 120, baseType: !129, size: 8192, offset: 10720)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "c_handle", scope: !86, file: !87, line: 123, baseType: !134, size: 64, offset: 18944)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "MEM_CacheLimiterHandle_s", file: !87, line: 123, flags: DIFlagFwdDecl)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "refcounter", scope: !86, file: !87, line: 124, baseType: !45, size: 32, offset: 19008)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffer", scope: !86, file: !87, line: 127, baseType: !16, size: 64, offset: 19072)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "encodedsize", scope: !86, file: !87, line: 128, baseType: !7, size: 32, offset: 19136)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffersize", scope: !86, file: !87, line: 129, baseType: !7, size: 32, offset: 19168)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "rect_colorspace", scope: !86, file: !87, line: 132, baseType: !141, size: 64, offset: 19200)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !143, line: 47, size: 4992, elements: !144)
!143 = !DIFile(filename: "blender/source/blender/imbuf/intern/IMB_colormanagement_intern.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!144 = !{!145, !146, !147, !148, !152, !156, !159, !160, !161}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !142, file: !143, line: 48, baseType: !141, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !142, file: !143, line: 48, baseType: !141, size: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !142, file: !143, line: 49, baseType: !45, size: 32, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !142, file: !143, line: 50, baseType: !149, size: 512, offset: 160)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 512, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !142, file: !143, line: 51, baseType: !153, size: 4096, offset: 672)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 4096, elements: !154)
!154 = !{!155}
!155 = !DISubrange(count: 512)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "to_scene_linear", scope: !142, file: !143, line: 53, baseType: !157, size: 64, offset: 4800)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "OCIO_ConstProcessorRcPtr", file: !143, line: 41, flags: DIFlagFwdDecl)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "from_scene_linear", scope: !142, file: !143, line: 54, baseType: !157, size: 64, offset: 4864)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "is_invertible", scope: !142, file: !143, line: 56, baseType: !17, size: 8, offset: 4928)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "is_data", scope: !142, file: !143, line: 57, baseType: !17, size: 8, offset: 4936)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "float_colorspace", scope: !86, file: !87, line: 133, baseType: !141, size: 64, offset: 19264)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer_flags", scope: !86, file: !87, line: 134, baseType: !21, size: 64, offset: 19328)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_cache", scope: !86, file: !87, line: 135, baseType: !165, size: 64, offset: 19392)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColormanageCache", file: !87, line: 135, flags: DIFlagFwdDecl)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_flag", scope: !86, file: !87, line: 136, baseType: !45, size: 32, offset: 19456)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_rect", scope: !86, file: !87, line: 137, baseType: !169, size: 128, offset: 19488)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !170, line: 89, baseType: !171)
!170 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !170, line: 86, size: 128, elements: !172)
!172 = !{!173, !174, !175, !176}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !171, file: !170, line: 87, baseType: !45, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !171, file: !170, line: 87, baseType: !45, size: 32, offset: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !171, file: !170, line: 88, baseType: !45, size: 32, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !171, file: !170, line: 88, baseType: !45, size: 32, offset: 96)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "dds_data", scope: !86, file: !87, line: 140, baseType: !178, size: 192, offset: 19648)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DDSData", file: !87, line: 55, size: 192, elements: !179)
!179 = !{!180, !181, !182, !183}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "fourcc", scope: !178, file: !87, line: 56, baseType: !7, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nummipmaps", scope: !178, file: !87, line: 57, baseType: !7, size: 32, offset: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !178, file: !87, line: 58, baseType: !16, size: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !178, file: !87, line: 59, baseType: !7, size: 32, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !185, line: 46, baseType: !186)
!185 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!186 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!188 = !DILocalVariable(name: "mem", arg: 1, scope: !82, file: !3, line: 254, type: !16)
!189 = !DILocation(line: 254, column: 43, scope: !82)
!190 = !DILocalVariable(name: "size", arg: 2, scope: !82, file: !3, line: 254, type: !184)
!191 = !DILocation(line: 254, column: 55, scope: !82)
!192 = !DILocalVariable(name: "flags", arg: 3, scope: !82, file: !3, line: 254, type: !45)
!193 = !DILocation(line: 254, column: 65, scope: !82)
!194 = !DILocalVariable(name: "colorspace", arg: 4, scope: !82, file: !3, line: 254, type: !187)
!195 = !DILocation(line: 254, column: 77, scope: !82)
!196 = !DILocalVariable(name: "base", scope: !82, file: !3, line: 256, type: !21)
!197 = !DILocation(line: 256, column: 16, scope: !82)
!198 = !DILocalVariable(name: "lptr", scope: !82, file: !3, line: 256, type: !21)
!199 = !DILocation(line: 256, column: 23, scope: !82)
!200 = !DILocalVariable(name: "fbase", scope: !82, file: !3, line: 257, type: !99)
!201 = !DILocation(line: 257, column: 9, scope: !82)
!202 = !DILocalVariable(name: "fptr", scope: !82, file: !3, line: 257, type: !99)
!203 = !DILocation(line: 257, column: 17, scope: !82)
!204 = !DILocalVariable(name: "zbase", scope: !82, file: !3, line: 258, type: !21)
!205 = !DILocation(line: 258, column: 16, scope: !82)
!206 = !DILocalVariable(name: "zptr", scope: !82, file: !3, line: 258, type: !21)
!207 = !DILocation(line: 258, column: 24, scope: !82)
!208 = !DILocalVariable(name: "rledat", scope: !82, file: !3, line: 259, type: !16)
!209 = !DILocation(line: 259, column: 17, scope: !82)
!210 = !DILocalVariable(name: "starttab", scope: !82, file: !3, line: 260, type: !21)
!211 = !DILocation(line: 260, column: 16, scope: !82)
!212 = !DILocalVariable(name: "lengthtab", scope: !82, file: !3, line: 260, type: !21)
!213 = !DILocation(line: 260, column: 27, scope: !82)
!214 = !DILocalVariable(name: "inf", scope: !82, file: !3, line: 261, type: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !217, line: 7, baseType: !218)
!217 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !219, line: 49, size: 1728, elements: !220)
!219 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!220 = !{!221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !236, !238, !239, !240, !244, !245, !247, !251, !254, !256, !259, !262, !263, !264, !265, !266}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !218, file: !219, line: 51, baseType: !45, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !218, file: !219, line: 54, baseType: !187, size: 64, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !218, file: !219, line: 55, baseType: !187, size: 64, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !218, file: !219, line: 56, baseType: !187, size: 64, offset: 192)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !218, file: !219, line: 57, baseType: !187, size: 64, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !218, file: !219, line: 58, baseType: !187, size: 64, offset: 320)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !218, file: !219, line: 59, baseType: !187, size: 64, offset: 384)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !218, file: !219, line: 60, baseType: !187, size: 64, offset: 448)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !218, file: !219, line: 61, baseType: !187, size: 64, offset: 512)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !218, file: !219, line: 64, baseType: !187, size: 64, offset: 576)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !218, file: !219, line: 65, baseType: !187, size: 64, offset: 640)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !218, file: !219, line: 66, baseType: !187, size: 64, offset: 704)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !218, file: !219, line: 68, baseType: !234, size: 64, offset: 768)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !219, line: 36, flags: DIFlagFwdDecl)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !218, file: !219, line: 70, baseType: !237, size: 64, offset: 832)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !218, file: !219, line: 72, baseType: !45, size: 32, offset: 896)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !218, file: !219, line: 73, baseType: !45, size: 32, offset: 928)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !218, file: !219, line: 74, baseType: !241, size: 64, offset: 960)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !242, line: 152, baseType: !243)
!242 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!243 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !218, file: !219, line: 77, baseType: !29, size: 16, offset: 1024)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !218, file: !219, line: 78, baseType: !246, size: 8, offset: 1040)
!246 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !218, file: !219, line: 79, baseType: !248, size: 8, offset: 1048)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 8, elements: !249)
!249 = !{!250}
!250 = !DISubrange(count: 1)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !218, file: !219, line: 81, baseType: !252, size: 64, offset: 1088)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !219, line: 43, baseType: null)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !218, file: !219, line: 89, baseType: !255, size: 64, offset: 1152)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !242, line: 153, baseType: !243)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !218, file: !219, line: 91, baseType: !257, size: 64, offset: 1216)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !219, line: 37, flags: DIFlagFwdDecl)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !218, file: !219, line: 92, baseType: !260, size: 64, offset: 1280)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !219, line: 38, flags: DIFlagFwdDecl)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !218, file: !219, line: 93, baseType: !237, size: 64, offset: 1344)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !218, file: !219, line: 94, baseType: !22, size: 64, offset: 1408)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !218, file: !219, line: 95, baseType: !184, size: 64, offset: 1472)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !218, file: !219, line: 96, baseType: !45, size: 32, offset: 1536)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !218, file: !219, line: 98, baseType: !267, size: 160, offset: 1568)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 160, elements: !117)
!268 = !DILocation(line: 261, column: 8, scope: !82)
!269 = !DILocalVariable(name: "image", scope: !82, file: !3, line: 262, type: !25)
!270 = !DILocation(line: 262, column: 8, scope: !82)
!271 = !DILocalVariable(name: "x", scope: !82, file: !3, line: 263, type: !45)
!272 = !DILocation(line: 263, column: 6, scope: !82)
!273 = !DILocalVariable(name: "y", scope: !82, file: !3, line: 263, type: !45)
!274 = !DILocation(line: 263, column: 9, scope: !82)
!275 = !DILocalVariable(name: "z", scope: !82, file: !3, line: 263, type: !45)
!276 = !DILocation(line: 263, column: 12, scope: !82)
!277 = !DILocalVariable(name: "tablen", scope: !82, file: !3, line: 263, type: !45)
!278 = !DILocation(line: 263, column: 15, scope: !82)
!279 = !DILocalVariable(name: "xsize", scope: !82, file: !3, line: 264, type: !45)
!280 = !DILocation(line: 264, column: 6, scope: !82)
!281 = !DILocalVariable(name: "ysize", scope: !82, file: !3, line: 264, type: !45)
!282 = !DILocation(line: 264, column: 13, scope: !82)
!283 = !DILocalVariable(name: "zsize", scope: !82, file: !3, line: 264, type: !45)
!284 = !DILocation(line: 264, column: 20, scope: !82)
!285 = !DILocalVariable(name: "bpp", scope: !82, file: !3, line: 265, type: !45)
!286 = !DILocation(line: 265, column: 6, scope: !82)
!287 = !DILocalVariable(name: "rle", scope: !82, file: !3, line: 265, type: !45)
!288 = !DILocation(line: 265, column: 11, scope: !82)
!289 = !DILocalVariable(name: "cur", scope: !82, file: !3, line: 265, type: !45)
!290 = !DILocation(line: 265, column: 16, scope: !82)
!291 = !DILocalVariable(name: "badorder", scope: !82, file: !3, line: 265, type: !45)
!292 = !DILocation(line: 265, column: 21, scope: !82)
!293 = !DILocalVariable(name: "ibuf", scope: !82, file: !3, line: 266, type: !294)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImBuf", file: !87, line: 141, baseType: !86)
!296 = !DILocation(line: 266, column: 9, scope: !82)
!297 = !DILocation(line: 268, column: 8, scope: !82)
!298 = !DILocation(line: 270, column: 21, scope: !299)
!299 = distinct !DILexicalBlock(scope: !82, file: !3, line: 270, column: 6)
!300 = !DILocation(line: 270, column: 7, scope: !299)
!301 = !DILocation(line: 270, column: 6, scope: !82)
!302 = !DILocation(line: 270, column: 27, scope: !299)
!303 = !DILocation(line: 273, column: 30, scope: !82)
!304 = !DILocation(line: 273, column: 2, scope: !82)
!305 = !DILocation(line: 277, column: 14, scope: !82)
!306 = !DILocation(line: 277, column: 12, scope: !82)
!307 = !DILocation(line: 278, column: 14, scope: !82)
!308 = !DILocation(line: 280, column: 13, scope: !82)
!309 = !DILocation(line: 280, column: 2, scope: !82)
!310 = !DILocation(line: 281, column: 12, scope: !311)
!311 = distinct !DILexicalBlock(scope: !82, file: !3, line: 281, column: 6)
!312 = !DILocation(line: 281, column: 6, scope: !311)
!313 = !DILocation(line: 281, column: 19, scope: !311)
!314 = !DILocation(line: 281, column: 6, scope: !82)
!315 = !DILocation(line: 282, column: 11, scope: !316)
!316 = distinct !DILexicalBlock(scope: !311, file: !3, line: 281, column: 30)
!317 = !DILocation(line: 282, column: 3, scope: !316)
!318 = !DILocation(line: 283, column: 3, scope: !316)
!319 = !DILocation(line: 286, column: 8, scope: !82)
!320 = !DILocation(line: 286, column: 6, scope: !82)
!321 = !DILocation(line: 287, column: 8, scope: !82)
!322 = !DILocation(line: 287, column: 6, scope: !82)
!323 = !DILocation(line: 288, column: 6, scope: !324)
!324 = distinct !DILexicalBlock(scope: !82, file: !3, line: 288, column: 6)
!325 = !DILocation(line: 288, column: 10, scope: !324)
!326 = !DILocation(line: 288, column: 15, scope: !324)
!327 = !DILocation(line: 288, column: 18, scope: !324)
!328 = !DILocation(line: 288, column: 22, scope: !324)
