; ModuleID = 'blender/source/blender/bmesh/tools/bmesh_edgenet.c'
source_filename = "blender/source/blender/bmesh/tools/bmesh_edgenet.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BMesh = type { i32, i32, i32, i32, i32, i32, i32, i8, i8, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BMVert**, %struct.BMEdge**, %struct.BMFace**, i32, i32, i32, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, i32, %struct.BMOperator*, %struct.CustomData, %struct.CustomData, %struct.CustomData, %struct.CustomData, i16, i32, i32, i32, %struct.ListBase, %struct.BMFace*, %struct.ListBase, i8* }
%struct.BMVert = type { %struct.BMHeader, %struct.BMFlagLayer*, [3 x float], [3 x float], %struct.BMEdge* }
%struct.BMHeader = type { i8*, i32, i8, i8, i8 }
%struct.BMFlagLayer = type { i16 }
%struct.BMEdge = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMVert*, %struct.BMVert*, %struct.BMLoop*, %struct.BMDiskLink, %struct.BMDiskLink }
%struct.BMLoop = type { %struct.BMHeader, %struct.BMVert*, %struct.BMEdge*, %struct.BMFace*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop* }
%struct.BMDiskLink = type { %struct.BMEdge*, %struct.BMEdge* }
%struct.BLI_mempool = type opaque

!40 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_FLUSH", value: 4, isUnsigned: true)
!41 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 83, baseType: !5, size: 32, elements: !44)
!43 = !DIFile(filename: "blender/source/blender/blenlib/BLI_mempool.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!44 = !{!45, !46}
!45 = !DIEnumerator(name: "BLI_MEMPOOL_NOP", value: 0, isUnsigned: true)
!46 = !DIEnumerator(name: "BLI_MEMPOOL_ALLOW_ITER", value: 1, isUnsigned: true)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BMIterType", file: !48, line: 57, baseType: !5, size: 32, elements: !49)
!48 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!49 = !{!50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63}
!50 = !DIEnumerator(name: "BM_VERTS_OF_MESH", value: 1, isUnsigned: true)
!51 = !DIEnumerator(name: "BM_EDGES_OF_MESH", value: 2, isUnsigned: true)
!52 = !DIEnumerator(name: "BM_FACES_OF_MESH", value: 3, isUnsigned: true)
!53 = !DIEnumerator(name: "BM_EDGES_OF_VERT", value: 4, isUnsigned: true)
!54 = !DIEnumerator(name: "BM_FACES_OF_VERT", value: 5, isUnsigned: true)
!55 = !DIEnumerator(name: "BM_LOOPS_OF_VERT", value: 6, isUnsigned: true)
!56 = !DIEnumerator(name: "BM_VERTS_OF_EDGE", value: 7, isUnsigned: true)
!57 = !DIEnumerator(name: "BM_FACES_OF_EDGE", value: 8, isUnsigned: true)
!58 = !DIEnumerator(name: "BM_VERTS_OF_FACE", value: 9, isUnsigned: true)
!59 = !DIEnumerator(name: "BM_EDGES_OF_FACE", value: 10, isUnsigned: true)
!60 = !DIEnumerator(name: "BM_LOOPS_OF_FACE", value: 11, isUnsigned: true)
!61 = !DIEnumerator(name: "BM_ALL_LOOPS_OF_FACE", value: 12, isUnsigned: true)
!62 = !DIEnumerator(name: "BM_LOOPS_OF_LOOP", value: 13, isUnsigned: true)
!63 = !DIEnumerator(name: "BM_LOOPS_OF_EDGE", value: 14, isUnsigned: true)
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !65, line: 260, baseType: !5, size: 32, elements: !66)
!65 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!66 = !{!67, !68, !69, !70, !71, !72, !73}
!67 = !DIEnumerator(name: "BM_ELEM_SELECT", value: 1, isUnsigned: true)
!68 = !DIEnumerator(name: "BM_ELEM_HIDDEN", value: 2, isUnsigned: true)
!69 = !DIEnumerator(name: "BM_ELEM_SEAM", value: 4, isUnsigned: true)
!70 = !DIEnumerator(name: "BM_ELEM_SMOOTH", value: 8, isUnsigned: true)
!71 = !DIEnumerator(name: "BM_ELEM_TAG", value: 16, isUnsigned: true)
!72 = !DIEnumerator(name: "BM_ELEM_DRAW", value: 32, isUnsigned: true)
!73 = !DIEnumerator(name: "BM_ELEM_INTERNAL_TAG", value: 128, isUnsigned: true)
!74 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !65, line: 249, baseType: !5, size: 32, elements: !75)
!75 = !{!76, !77, !78, !79}
!76 = !DIEnumerator(name: "BM_VERT", value: 1, isUnsigned: true)
!77 = !DIEnumerator(name: "BM_EDGE", value: 2, isUnsigned: true)
!78 = !DIEnumerator(name: "BM_LOOP", value: 4, isUnsigned: true)
!79 = !DIEnumerator(name: "BM_FACE", value: 8, isUnsigned: true)
!80 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1, line: 53, baseType: !5, size: 32, elements: !81)
!81 = !{!82}
!82 = !DIEnumerator(name: "VNINFO_FLAG_IS_MIXFACE", value: 1, isUnsigned: true)
!83 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMCreateFlag", file: !84, line: 33, baseType: !5, size: 32, elements: !85)
!84 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_core.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!85 = !{!86, !87, !88}
!86 = !DIEnumerator(name: "BM_CREATE_NOP", value: 0, isUnsigned: true)
!87 = !DIEnumerator(name: "BM_CREATE_NO_DOUBLE", value: 2, isUnsigned: true)
!88 = !DIEnumerator(name: "BM_CREATE_SKIP_CD", value: 4, isUnsigned: true)
!89 = !{!90, !93, !94, !95, !99, !103, !169, !171, !153, !115, !113}
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !91, line: 46, baseType: !92)
!91 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!92 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !48, line: 79, baseType: !47)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !48, line: 158, baseType: !96)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{null, !93}
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !48, line: 159, baseType: !100)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!93, !93}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !65, line: 103, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !65, line: 90, size: 448, elements: !106)
!106 = !{!107, !118, !124, !129, !130}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !105, file: !65, line: 91, baseType: !108, size: 128)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !65, line: 82, baseType: !109)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !65, line: 64, size: 128, elements: !110)
!110 = !{!111, !112, !114, !116, !117}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !109, file: !65, line: 65, baseType: !93, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !109, file: !65, line: 66, baseType: !113, size: 32, offset: 64)
!113 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !109, file: !65, line: 73, baseType: !115, size: 8, offset: 96)
!115 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !109, file: !65, line: 74, baseType: !115, size: 8, offset: 104)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !109, file: !65, line: 80, baseType: !115, size: 8, offset: 112)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !105, file: !65, line: 92, baseType: !119, size: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !65, line: 180, size: 16, elements: !121)
!121 = !{!122}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !120, file: !65, line: 181, baseType: !123, size: 16)
!123 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !105, file: !65, line: 94, baseType: !125, size: 96, offset: 192)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 96, elements: !127)
!126 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!127 = !{!128}
!128 = !DISubrange(count: 3)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !105, file: !65, line: 95, baseType: !125, size: 96, offset: 288)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !105, file: !65, line: 102, baseType: !131, size: 64, offset: 384)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !65, line: 110, size: 640, elements: !133)
!133 = !{!134, !135, !136, !138, !139, !162, !168}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !132, file: !65, line: 111, baseType: !108, size: 128)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !132, file: !65, line: 112, baseType: !119, size: 64, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !132, file: !65, line: 114, baseType: !137, size: 64, offset: 192)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !132, file: !65, line: 114, baseType: !137, size: 64, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !132, file: !65, line: 118, baseType: !140, size: 64, offset: 320)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !65, line: 125, size: 576, elements: !142)
!142 = !{!143, !144, !145, !146, !158, !159, !160, !161}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !141, file: !65, line: 126, baseType: !108, size: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !141, file: !65, line: 129, baseType: !137, size: 64, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !141, file: !65, line: 130, baseType: !131, size: 64, offset: 192)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !141, file: !65, line: 131, baseType: !147, size: 64, offset: 256)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !65, line: 164, size: 448, elements: !149)
!149 = !{!150, !151, !152, !155, !156, !157}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !148, file: !65, line: 165, baseType: !108, size: 128)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !148, file: !65, line: 166, baseType: !119, size: 64, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !148, file: !65, line: 172, baseType: !153, size: 64, offset: 192)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !65, line: 140, baseType: !141)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !148, file: !65, line: 174, baseType: !113, size: 32, offset: 256)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !148, file: !65, line: 175, baseType: !125, size: 96, offset: 288)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !148, file: !65, line: 176, baseType: !123, size: 16, offset: 384)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !141, file: !65, line: 135, baseType: !140, size: 64, offset: 320)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !141, file: !65, line: 135, baseType: !140, size: 64, offset: 384)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !141, file: !65, line: 139, baseType: !140, size: 64, offset: 448)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !141, file: !65, line: 139, baseType: !140, size: 64, offset: 512)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !132, file: !65, line: 122, baseType: !163, size: 128, offset: 384)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !65, line: 108, baseType: !164)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !65, line: 106, size: 128, elements: !165)
!165 = !{!166, !167}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !164, file: !65, line: 107, baseType: !131, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !164, file: !65, line: 107, baseType: !131, size: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !132, file: !65, line: 122, baseType: !163, size: 128, offset: 512)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !65, line: 123, baseType: !132)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !65, line: 178, baseType: !148)
!173 = !{i32 7, !"Dwarf Version", i32 4}
!174 = !{i32 2, !"Debug Info Version", i32 3}
!175 = !{i32 1, !"wchar_size", i32 4}
!176 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!177 = distinct !DISubprogram(name: "BM_mesh_edgenet", scope: !1, file: !1, line: 453, type: !178, scopeLine: 455, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !324)
!178 = !DISubroutineType(types: !179)
!179 = !{null, !180, !322, !322}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !65, line: 246, baseType: !182)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !65, line: 186, size: 8064, elements: !183)
!183 = !{!184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !196, !197, !198, !199, !201, !203, !205, !206, !207, !208, !209, !210, !211, !212, !265, !305, !306, !307, !308, !309, !310, !311, !312, !319, !320, !321}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !182, file: !65, line: 187, baseType: !113, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !182, file: !65, line: 187, baseType: !113, size: 32, offset: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !182, file: !65, line: 187, baseType: !113, size: 32, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !182, file: !65, line: 187, baseType: !113, size: 32, offset: 96)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !182, file: !65, line: 188, baseType: !113, size: 32, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !182, file: !65, line: 188, baseType: !113, size: 32, offset: 160)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !182, file: !65, line: 188, baseType: !113, size: 32, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !182, file: !65, line: 193, baseType: !115, size: 8, offset: 224)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !182, file: !65, line: 197, baseType: !115, size: 8, offset: 232)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !182, file: !65, line: 201, baseType: !194, size: 64, offset: 256)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !43, line: 44, flags: DIFlagFwdDecl)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !182, file: !65, line: 201, baseType: !194, size: 64, offset: 320)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !182, file: !65, line: 201, baseType: !194, size: 64, offset: 384)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !182, file: !65, line: 201, baseType: !194, size: 64, offset: 448)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !182, file: !65, line: 208, baseType: !200, size: 64, offset: 512)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !182, file: !65, line: 209, baseType: !202, size: 64, offset: 576)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !182, file: !65, line: 210, baseType: !204, size: 64, offset: 640)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !182, file: !65, line: 213, baseType: !113, size: 32, offset: 704)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !182, file: !65, line: 214, baseType: !113, size: 32, offset: 736)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !182, file: !65, line: 215, baseType: !113, size: 32, offset: 768)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !182, file: !65, line: 218, baseType: !194, size: 64, offset: 832)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !182, file: !65, line: 218, baseType: !194, size: 64, offset: 896)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !182, file: !65, line: 218, baseType: !194, size: 64, offset: 960)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !182, file: !65, line: 220, baseType: !113, size: 32, offset: 1024)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !182, file: !65, line: 221, baseType: !213, size: 64, offset: 1088)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !4, line: 190, size: 10496, elements: !215)
!215 = !{!216, !252, !253, !257, !261, !262, !264}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !214, file: !4, line: 191, baseType: !217, size: 5120)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 5120, elements: !250)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !4, line: 147, size: 320, elements: !219)
!219 = !{!220, !223, !225, !235, !236}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !218, file: !4, line: 148, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !115)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !218, file: !4, line: 149, baseType: !224, size: 32, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !4, line: 112, baseType: !3)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !218, file: !4, line: 150, baseType: !226, size: 32, offset: 96)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !4, line: 142, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !4, line: 138, size: 32, elements: !228)
!228 = !{!229, !231, !233}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !227, file: !4, line: 139, baseType: !230, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !4, line: 122, baseType: !15)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !227, file: !4, line: 140, baseType: !232, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !4, line: 136, baseType: !21)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !227, file: !4, line: 141, baseType: !234, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !4, line: 130, baseType: !27)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !218, file: !4, line: 152, baseType: !113, size: 32, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !218, file: !4, line: 162, baseType: !237, size: 128, offset: 192)
!237 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !218, file: !4, line: 155, size: 128, elements: !238)
!238 = !{!239, !240, !241, !242, !243, !245}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !237, file: !4, line: 156, baseType: !113, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !237, file: !4, line: 157, baseType: !126, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !237, file: !4, line: 158, baseType: !93, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !237, file: !4, line: 159, baseType: !125, size: 96)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !237, file: !4, line: 160, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !237, file: !4, line: 161, baseType: !246, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !248, line: 48, baseType: !249)
!248 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !248, line: 48, flags: DIFlagFwdDecl)
!250 = !{!251}
!251 = !DISubrange(count: 16)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !214, file: !4, line: 192, baseType: !217, size: 5120, offset: 5120)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !214, file: !4, line: 193, baseType: !254, size: 64, offset: 10240)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DISubroutineType(types: !256)
!256 = !{null, !180, !213}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !214, file: !4, line: 194, baseType: !258, size: 64, offset: 10304)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !260, line: 38, flags: DIFlagFwdDecl)
!260 = !DIFile(filename: "blender/source/blender/blenlib/BLI_linklist.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!261 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !214, file: !4, line: 195, baseType: !113, size: 32, offset: 10368)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !214, file: !4, line: 196, baseType: !263, size: 32, offset: 10400)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !4, line: 188, baseType: !35)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !214, file: !4, line: 197, baseType: !113, size: 32, offset: 10432)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !182, file: !65, line: 223, baseType: !266, size: 1600, offset: 1152)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !267, line: 73, baseType: !268)
!267 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !267, line: 64, size: 1600, elements: !269)
!269 = !{!270, !288, !292, !293, !294, !295, !296}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !268, file: !267, line: 65, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !267, line: 53, baseType: !273)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !267, line: 42, size: 832, elements: !274)
!274 = !{!275, !276, !277, !278, !279, !280, !281, !282, !283, !287}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !273, file: !267, line: 43, baseType: !113, size: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !273, file: !267, line: 44, baseType: !113, size: 32, offset: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !273, file: !267, line: 45, baseType: !113, size: 32, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !273, file: !267, line: 46, baseType: !113, size: 32, offset: 96)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !273, file: !267, line: 47, baseType: !113, size: 32, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !273, file: !267, line: 48, baseType: !113, size: 32, offset: 160)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !273, file: !267, line: 49, baseType: !113, size: 32, offset: 192)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !273, file: !267, line: 50, baseType: !113, size: 32, offset: 224)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !273, file: !267, line: 51, baseType: !284, size: 512, offset: 256)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 512, elements: !285)
!285 = !{!286}
!286 = !DISubrange(count: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !273, file: !267, line: 52, baseType: !93, size: 64, offset: 768)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !268, file: !267, line: 66, baseType: !289, size: 1312, offset: 64)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 1312, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 41)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !268, file: !267, line: 69, baseType: !113, size: 32, offset: 1376)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !268, file: !267, line: 69, baseType: !113, size: 32, offset: 1408)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !268, file: !267, line: 70, baseType: !113, size: 32, offset: 1440)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !268, file: !267, line: 71, baseType: !194, size: 64, offset: 1472)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !268, file: !267, line: 72, baseType: !297, size: 64, offset: 1536)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !267, line: 59, baseType: !299)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !267, line: 57, size: 8192, elements: !300)
!300 = !{!301}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !299, file: !267, line: 58, baseType: !302, size: 8192)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 8192, elements: !303)
!303 = !{!304}
!304 = !DISubrange(count: 1024)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !182, file: !65, line: 223, baseType: !266, size: 1600, offset: 2752)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !182, file: !65, line: 223, baseType: !266, size: 1600, offset: 4352)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !182, file: !65, line: 223, baseType: !266, size: 1600, offset: 5952)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !182, file: !65, line: 233, baseType: !123, size: 16, offset: 7552)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !182, file: !65, line: 236, baseType: !113, size: 32, offset: 7584)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !182, file: !65, line: 238, baseType: !113, size: 32, offset: 7616)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !182, file: !65, line: 238, baseType: !113, size: 32, offset: 7648)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !182, file: !65, line: 239, baseType: !313, size: 128, offset: 7680)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !314, line: 71, baseType: !315)
!314 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !314, line: 69, size: 128, elements: !316)
!316 = !{!317, !318}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !315, file: !314, line: 70, baseType: !93, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !315, file: !314, line: 70, baseType: !93, size: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !182, file: !65, line: 241, baseType: !171, size: 64, offset: 7808)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !182, file: !65, line: 243, baseType: !313, size: 128, offset: 7872)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !182, file: !65, line: 245, baseType: !93, size: 64, offset: 8000)
!322 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !323)
!323 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!324 = !{}
!325 = !DILocalVariable(name: "bm", arg: 1, scope: !177, file: !1, line: 453, type: !180)
!326 = !DILocation(line: 453, column: 29, scope: !177)
!327 = !DILocalVariable(name: "use_edge_tag", arg: 2, scope: !177, file: !1, line: 454, type: !322)
!328 = !DILocation(line: 454, column: 33, scope: !177)
!329 = !DILocalVariable(name: "use_new_face_tag", arg: 3, scope: !177, file: !1, line: 454, type: !322)
!330 = !DILocation(line: 454, column: 58, scope: !177)
!331 = !DILocalVariable(name: "vnet_info", scope: !177, file: !1, line: 456, type: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "VertNetInfo", file: !1, line: 51, baseType: !334)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VertNetInfo", file: !1, line: 46, size: 192, elements: !335)
!335 = !{!336, !337, !338, !339}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !334, file: !1, line: 47, baseType: !103, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !334, file: !1, line: 48, baseType: !113, size: 32, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "face", scope: !334, file: !1, line: 49, baseType: !113, size: 32, offset: 96)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !334, file: !1, line: 50, baseType: !113, size: 32, offset: 128)
!340 = !DILocation(line: 456, column: 15, scope: !177)
!341 = !DILocation(line: 456, column: 27, scope: !177)
!342 = !DILocation(line: 456, column: 68, scope: !177)
!343 = !DILocation(line: 456, column: 72, scope: !177)
!344 = !DILocation(line: 456, column: 60, scope: !177)
!345 = !DILocation(line: 456, column: 58, scope: !177)
!346 = !DILocalVariable(name: "edge_queue_pool", scope: !177, file: !1, line: 457, type: !347)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool", file: !43, line: 47, baseType: !195)
!349 = !DILocation(line: 457, column: 15, scope: !177)
!350 = !DILocation(line: 457, column: 33, scope: !177)
!351 = !DILocalVariable(name: "path_pool", scope: !177, file: !1, line: 458, type: !347)
!352 = !DILocation(line: 458, column: 15, scope: !177)
!353 = !DILocation(line: 458, column: 27, scope: !177)
!354 = !DILocalVariable(name: "edge_queue", scope: !177, file: !1, line: 459, type: !355)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "LinkNode", file: !260, line: 48, baseType: !357)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !260, line: 45, size: 128, elements: !358)
!358 = !{!359, !361}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !357, file: !260, line: 46, baseType: !360, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !357, file: !260, line: 47, baseType: !93, size: 64, offset: 64)
!362 = !DILocation(line: 459, column: 12, scope: !177)
!363 = !DILocalVariable(name: "e", scope: !177, file: !1, line: 461, type: !169)
!364 = !DILocation(line: 461, column: 10, scope: !177)
!365 = !DILocalVariable(name: "iter", scope: !177, file: !1, line: 462, type: !366)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter", file: !48, line: 186, baseType: !367)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter", file: !48, line: 164, size: 512, elements: !368)
!368 = !{!369, !446, !447, !448, !449}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !367, file: !48, line: 179, baseType: !370, size: 320)
!370 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !367, file: !48, line: 166, size: 320, elements: !371)
!371 = !{!372, !384, !390, !398, !406, !412, !418, !424, !428, !434, !440}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "elem_of_mesh", scope: !370, file: !48, line: 167, baseType: !373, size: 192)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__elem_of_mesh", file: !48, line: 113, size: 192, elements: !374)
!374 = !{!375}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "pooliter", scope: !373, file: !48, line: 114, baseType: !376, size: 192)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool_iter", file: !43, line: 80, baseType: !377)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_iter", file: !43, line: 76, size: 192, elements: !378)
!378 = !{!379, !380, !383}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !377, file: !43, line: 77, baseType: !347, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "curchunk", scope: !377, file: !43, line: 78, baseType: !381, size: 64, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_chunk", file: !43, line: 45, flags: DIFlagFwdDecl)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "curindex", scope: !377, file: !43, line: 79, baseType: !5, size: 32, offset: 128)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_vert", scope: !370, file: !48, line: 169, baseType: !385, size: 192)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_vert", file: !48, line: 116, size: 192, elements: !386)
!386 = !{!387, !388, !389}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !385, file: !48, line: 117, baseType: !103, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !385, file: !48, line: 118, baseType: !169, size: 64, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !385, file: !48, line: 118, baseType: !169, size: 64, offset: 128)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_vert", scope: !370, file: !48, line: 170, baseType: !391, size: 320)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_vert", file: !48, line: 120, size: 320, elements: !392)
!392 = !{!393, !394, !395, !396, !397}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !391, file: !48, line: 121, baseType: !103, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !391, file: !48, line: 122, baseType: !153, size: 64, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !391, file: !48, line: 122, baseType: !153, size: 64, offset: 128)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !391, file: !48, line: 123, baseType: !169, size: 64, offset: 192)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !391, file: !48, line: 123, baseType: !169, size: 64, offset: 256)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_vert", scope: !370, file: !48, line: 171, baseType: !399, size: 320)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_vert", file: !48, line: 125, size: 320, elements: !400)
!400 = !{!401, !402, !403, !404, !405}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !399, file: !48, line: 126, baseType: !103, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !399, file: !48, line: 127, baseType: !153, size: 64, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !399, file: !48, line: 127, baseType: !153, size: 64, offset: 128)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !399, file: !48, line: 128, baseType: !169, size: 64, offset: 192)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !399, file: !48, line: 128, baseType: !169, size: 64, offset: 256)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_edge", scope: !370, file: !48, line: 172, baseType: !407, size: 192)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_edge", file: !48, line: 130, size: 192, elements: !408)
!408 = !{!409, !410, !411}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !407, file: !48, line: 131, baseType: !169, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !407, file: !48, line: 132, baseType: !153, size: 64, offset: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !407, file: !48, line: 132, baseType: !153, size: 64, offset: 128)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_loop", scope: !370, file: !48, line: 173, baseType: !413, size: 192)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_loop", file: !48, line: 134, size: 192, elements: !414)
!414 = !{!415, !416, !417}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !413, file: !48, line: 135, baseType: !153, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !413, file: !48, line: 136, baseType: !153, size: 64, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !413, file: !48, line: 136, baseType: !153, size: 64, offset: 128)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_edge", scope: !370, file: !48, line: 174, baseType: !419, size: 192)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_edge", file: !48, line: 138, size: 192, elements: !420)
!420 = !{!421, !422, !423}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !419, file: !48, line: 139, baseType: !169, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !419, file: !48, line: 140, baseType: !153, size: 64, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !419, file: !48, line: 140, baseType: !153, size: 64, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_edge", scope: !370, file: !48, line: 175, baseType: !425, size: 64)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_edge", file: !48, line: 142, size: 64, elements: !426)
!426 = !{!427}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !425, file: !48, line: 143, baseType: !169, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_face", scope: !370, file: !48, line: 176, baseType: !429, size: 192)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_face", file: !48, line: 145, size: 192, elements: !430)
!430 = !{!431, !432, !433}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !429, file: !48, line: 146, baseType: !171, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !429, file: !48, line: 147, baseType: !153, size: 64, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !429, file: !48, line: 147, baseType: !153, size: 64, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_face", scope: !370, file: !48, line: 177, baseType: !435, size: 192)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_face", file: !48, line: 149, size: 192, elements: !436)
!436 = !{!437, !438, !439}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !435, file: !48, line: 150, baseType: !171, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !435, file: !48, line: 151, baseType: !153, size: 64, offset: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !435, file: !48, line: 151, baseType: !153, size: 64, offset: 128)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_face", scope: !370, file: !48, line: 178, baseType: !441, size: 192)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_face", file: !48, line: 153, size: 192, elements: !442)
!442 = !{!443, !444, !445}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !441, file: !48, line: 154, baseType: !171, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !441, file: !48, line: 155, baseType: !153, size: 64, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !441, file: !48, line: 155, baseType: !153, size: 64, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !367, file: !48, line: 181, baseType: !95, size: 64, offset: 320)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !367, file: !48, line: 182, baseType: !99, size: 64, offset: 384)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !367, file: !48, line: 184, baseType: !113, size: 32, offset: 448)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !367, file: !48, line: 185, baseType: !115, size: 8, offset: 480)
!450 = !DILocation(line: 462, column: 9, scope: !177)
!451 = !DILocalVariable(name: "pass_nr", scope: !177, file: !1, line: 464, type: !113)
!452 = !DILocation(line: 464, column: 6, scope: !177)
!453 = !DILocation(line: 466, column: 6, scope: !454)
!454 = distinct !DILexicalBlock(scope: !177, file: !1, line: 466, column: 6)
!455 = !DILocation(line: 466, column: 19, scope: !454)
!456 = !DILocation(line: 466, column: 6, scope: !177)
!457 = !DILocation(line: 467, column: 3, scope: !458)
!458 = distinct !DILexicalBlock(scope: !459, file: !1, line: 467, column: 3)
!459 = distinct !DILexicalBlock(scope: !454, file: !1, line: 466, column: 29)
!460 = !DILocation(line: 467, column: 3, scope: !461)
!461 = distinct !DILexicalBlock(scope: !458, file: !1, line: 467, column: 3)
!462 = !DILocation(line: 468, column: 4, scope: !463)
!463 = distinct !DILexicalBlock(scope: !461, file: !1, line: 467, column: 49)
!464 = !DILocation(line: 469, column: 3, scope: !463)
!465 = distinct !{!465, !457, !466}
!466 = !DILocation(line: 469, column: 3, scope: !458)
!467 = !DILocation(line: 470, column: 2, scope: !459)
!468 = !DILocation(line: 472, column: 28, scope: !177)
!469 = !DILocation(line: 472, column: 2, scope: !177)
!470 = !DILocation(line: 474, column: 2, scope: !177)
!471 = !DILocalVariable(name: "path", scope: !472, file: !1, line: 475, type: !355)
!472 = distinct !DILexicalBlock(scope: !177, file: !1, line: 474, column: 15)
!473 = !DILocation(line: 475, column: 13, scope: !472)
!474 = !DILocalVariable(name: "path_len", scope: !472, file: !1, line: 476, type: !5)
!475 = !DILocation(line: 476, column: 16, scope: !472)
!476 = !DILocalVariable(name: "path_cost", scope: !472, file: !1, line: 477, type: !5)
!477 = !DILocation(line: 477, column: 16, scope: !472)
!478 = !DILocation(line: 479, column: 32, scope: !472)
!479 = !DILocation(line: 479, column: 49, scope: !472)
!480 = !DILocation(line: 479, column: 7, scope: !472)
!481 = !DILocation(line: 479, column: 5, scope: !472)
!482 = !DILocation(line: 480, column: 7, scope: !483)
!483 = distinct !DILexicalBlock(scope: !472, file: !1, line: 480, column: 7)
!484 = !DILocation(line: 480, column: 9, scope: !483)
!485 = !DILocation(line: 480, column: 7, scope: !472)
!486 = !DILocation(line: 481, column: 4, scope: !487)
!487 = distinct !DILexicalBlock(scope: !483, file: !1, line: 480, column: 18)
!488 = !DILocation(line: 486, column: 36, scope: !472)
!489 = !DILocation(line: 488, column: 36, scope: !472)
!490 = !DILocation(line: 488, column: 47, scope: !472)
!491 = !DILocation(line: 486, column: 10, scope: !472)
!492 = !DILocation(line: 486, column: 8, scope: !472)
!493 = !DILocation(line: 490, column: 7, scope: !494)
!494 = distinct !DILexicalBlock(scope: !472, file: !1, line: 490, column: 7)
!495 = !DILocation(line: 490, column: 7, scope: !472)
!496 = !DILocalVariable(name: "f", scope: !497, file: !1, line: 491, type: !171)
!497 = distinct !DILexicalBlock(scope: !494, file: !1, line: 490, column: 13)
!498 = !DILocation(line: 491, column: 12, scope: !497)
!499 = !DILocation(line: 491, column: 42, scope: !497)
!500 = !DILocation(line: 491, column: 46, scope: !497)
!501 = !DILocation(line: 491, column: 52, scope: !497)
!502 = !DILocation(line: 491, column: 16, scope: !497)
!503 = !DILocalVariable(name: "l_first", scope: !497, file: !1, line: 493, type: !153)
!504 = !DILocation(line: 493, column: 12, scope: !497)
!505 = !DILocalVariable(name: "l_iter", scope: !497, file: !1, line: 493, type: !153)
!506 = !DILocation(line: 493, column: 22, scope: !497)
!507 = !DILocation(line: 494, column: 23, scope: !497)
!508 = !DILocation(line: 494, column: 21, scope: !497)
!509 = !DILocation(line: 494, column: 11, scope: !497)
!510 = !DILocation(line: 495, column: 4, scope: !497)
!511 = !DILocation(line: 496, column: 25, scope: !512)
!512 = distinct !DILexicalBlock(scope: !513, file: !1, line: 496, column: 9)
