; ModuleID = 'blender/source/blender/editors/render/render_update.c'
source_filename = "blender/source/blender/editors/render/render_update.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }
%struct.WalkNavigation = type { float, float, float, float, float, float, i16, [3 x i16] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "recursive_check", scope: !2, file: !3, line: 78, type: !225, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "ED_render_scene_update", scope: !3, file: !3, line: 71, type: !4, scopeLine: 72, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3282, retainedNodes: !3468)
!3 = !DIFile(filename: "blender/source/blender/editors/render/render_update.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6, !149, !56}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "Main", file: !8, line: 104, baseType: !9)
!8 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_main.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Main", file: !8, line: 53, size: 15232, elements: !10)
!10 = !{!11, !13, !14, !19, !21, !22, !23, !24, !30, !34, !35, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !140, !146}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !9, file: !8, line: 54, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !9, file: !8, line: 54, baseType: !12, size: 64, offset: 64)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !9, file: !8, line: 55, baseType: !15, size: 8192, offset: 128)
!15 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 8192, elements: !17)
!16 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!17 = !{!18}
!18 = !DISubrange(count: 1024)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "versionfile", scope: !9, file: !8, line: 56, baseType: !20, size: 16, offset: 8320)
!20 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "subversionfile", scope: !9, file: !8, line: 56, baseType: !20, size: 16, offset: 8336)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "minversionfile", scope: !9, file: !8, line: 57, baseType: !20, size: 16, offset: 8352)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "minsubversionfile", scope: !9, file: !8, line: 57, baseType: !20, size: 16, offset: 8368)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "build_commit_timestamp", scope: !9, file: !8, line: 58, baseType: !25, size: 64, offset: 8384)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !26, line: 27, baseType: !27)
!26 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !28, line: 45, baseType: !29)
!28 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!29 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "build_hash", scope: !9, file: !8, line: 59, baseType: !31, size: 128, offset: 8448)
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 128, elements: !32)
!32 = !{!33}
!33 = !DISubrange(count: 16)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", scope: !9, file: !8, line: 60, baseType: !20, size: 16, offset: 8576)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "curlib", scope: !9, file: !8, line: 62, baseType: !36, size: 64, offset: 8640)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !38, line: 136, size: 17600, elements: !39)
!38 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!39 = !{!40, !91, !93, !96, !97, !98, !99}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !37, file: !38, line: 137, baseType: !41, size: 960)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !38, line: 130, baseType: !42)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !38, line: 117, size: 960, elements: !43)
!43 = !{!44, !46, !47, !49, !50, !54, !55, !57, !58, !59}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !42, file: !38, line: 118, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !42, file: !38, line: 118, baseType: !45, size: 64, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !42, file: !38, line: 119, baseType: !48, size: 64, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !42, file: !38, line: 120, baseType: !36, size: 64, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !42, file: !38, line: 121, baseType: !51, size: 528, offset: 256)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 528, elements: !52)
!52 = !{!53}
!53 = !DISubrange(count: 66)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !42, file: !38, line: 126, baseType: !20, size: 16, offset: 784)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !42, file: !38, line: 127, baseType: !56, size: 32, offset: 800)
!56 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !42, file: !38, line: 128, baseType: !56, size: 32, offset: 832)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !42, file: !38, line: 128, baseType: !56, size: 32, offset: 864)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !42, file: !38, line: 129, baseType: !60, size: 64, offset: 896)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !38, line: 75, baseType: !62)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !38, line: 62, size: 1024, elements: !63)
!63 = !{!64, !66, !67, !68, !69, !70, !74, !75, !89, !90}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !62, file: !38, line: 63, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !62, file: !38, line: 63, baseType: !65, size: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !62, file: !38, line: 64, baseType: !16, size: 8, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !62, file: !38, line: 64, baseType: !16, size: 8, offset: 136)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !62, file: !38, line: 65, baseType: !20, size: 16, offset: 144)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !62, file: !38, line: 66, baseType: !71, size: 512, offset: 160)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 512, elements: !72)
!72 = !{!73}
!73 = !DISubrange(count: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !62, file: !38, line: 67, baseType: !56, size: 32, offset: 672)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !62, file: !38, line: 69, baseType: !76, size: 256, offset: 704)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !38, line: 60, baseType: !77)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !38, line: 48, size: 256, elements: !78)
!78 = !{!79, !80, !87, !88}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !77, file: !38, line: 49, baseType: !45, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !77, file: !38, line: 58, baseType: !81, size: 128, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !82, line: 71, baseType: !83)
!82 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !82, line: 69, size: 128, elements: !84)
!84 = !{!85, !86}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !83, file: !82, line: 70, baseType: !45, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !83, file: !82, line: 70, baseType: !45, size: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !77, file: !38, line: 59, baseType: !56, size: 32, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !77, file: !38, line: 59, baseType: !56, size: 32, offset: 224)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !62, file: !38, line: 70, baseType: !56, size: 32, offset: 960)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !62, file: !38, line: 74, baseType: !56, size: 32, offset: 992)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !37, file: !38, line: 138, baseType: !92, size: 64, offset: 960)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !37, file: !38, line: 139, baseType: !94, size: 64, offset: 1024)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !38, line: 43, flags: DIFlagFwdDecl)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !37, file: !38, line: 140, baseType: !15, size: 8192, offset: 1088)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !37, file: !38, line: 141, baseType: !15, size: 8192, offset: 9280)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !37, file: !38, line: 148, baseType: !36, size: 64, offset: 17472)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !37, file: !38, line: 150, baseType: !100, size: 64, offset: 17536)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !38, line: 45, flags: DIFlagFwdDecl)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !9, file: !8, line: 63, baseType: !81, size: 128, offset: 8704)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "library", scope: !9, file: !8, line: 64, baseType: !81, size: 128, offset: 8832)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !9, file: !8, line: 65, baseType: !81, size: 128, offset: 8960)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "mesh", scope: !9, file: !8, line: 66, baseType: !81, size: 128, offset: 9088)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !9, file: !8, line: 67, baseType: !81, size: 128, offset: 9216)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "mball", scope: !9, file: !8, line: 68, baseType: !81, size: 128, offset: 9344)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !9, file: !8, line: 69, baseType: !81, size: 128, offset: 9472)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !9, file: !8, line: 70, baseType: !81, size: 128, offset: 9600)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !9, file: !8, line: 71, baseType: !81, size: 128, offset: 9728)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "latt", scope: !9, file: !8, line: 72, baseType: !81, size: 128, offset: 9856)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "lamp", scope: !9, file: !8, line: 73, baseType: !81, size: 128, offset: 9984)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !9, file: !8, line: 74, baseType: !81, size: 128, offset: 10112)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !9, file: !8, line: 75, baseType: !81, size: 128, offset: 10240)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !9, file: !8, line: 76, baseType: !81, size: 128, offset: 10368)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !9, file: !8, line: 77, baseType: !81, size: 128, offset: 10496)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !9, file: !8, line: 78, baseType: !81, size: 128, offset: 10624)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !9, file: !8, line: 79, baseType: !81, size: 128, offset: 10752)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "vfont", scope: !9, file: !8, line: 80, baseType: !81, size: 128, offset: 10880)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !9, file: !8, line: 81, baseType: !81, size: 128, offset: 11008)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "speaker", scope: !9, file: !8, line: 82, baseType: !81, size: 128, offset: 11136)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !9, file: !8, line: 83, baseType: !81, size: 128, offset: 11264)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !9, file: !8, line: 84, baseType: !81, size: 128, offset: 11392)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "armature", scope: !9, file: !8, line: 85, baseType: !81, size: 128, offset: 11520)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !9, file: !8, line: 86, baseType: !81, size: 128, offset: 11648)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !9, file: !8, line: 87, baseType: !81, size: 128, offset: 11776)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !9, file: !8, line: 88, baseType: !81, size: 128, offset: 11904)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !9, file: !8, line: 89, baseType: !81, size: 128, offset: 12032)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "palettes", scope: !9, file: !8, line: 90, baseType: !81, size: 128, offset: 12160)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "paintcurves", scope: !9, file: !8, line: 91, baseType: !81, size: 128, offset: 12288)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "wm", scope: !9, file: !8, line: 92, baseType: !81, size: 128, offset: 12416)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil", scope: !9, file: !8, line: 93, baseType: !81, size: 128, offset: 12544)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "movieclip", scope: !9, file: !8, line: 94, baseType: !81, size: 128, offset: 12672)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !9, file: !8, line: 95, baseType: !81, size: 128, offset: 12800)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "linestyle", scope: !9, file: !8, line: 96, baseType: !81, size: 128, offset: 12928)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "id_tag_update", scope: !9, file: !8, line: 98, baseType: !137, size: 2048, offset: 13056)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 2048, elements: !138)
!138 = !{!139}
!139 = !DISubrange(count: 256)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "eval_ctx", scope: !9, file: !8, line: 101, baseType: !141, size: 64, offset: 15104)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EvaluationContext", file: !143, line: 58, size: 32, elements: !144)
!143 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_depsgraph.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!144 = !{!145}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !142, file: !143, line: 59, baseType: !56, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !9, file: !8, line: 103, baseType: !147, size: 64, offset: 15168)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "MainLock", file: !8, line: 51, flags: DIFlagFwdDecl)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "Scene", file: !151, line: 1299, baseType: !152)
!151 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !151, line: 1216, size: 39680, elements: !153)
!153 = !{!154, !155, !159, !2137, !2218, !2219, !2220, !2232, !2233, !2234, !2235, !2236, !2237, !2238, !2239, !2240, !2241, !2242, !2243, !2244, !2586, !2915, !2918, !3158, !3170, !3171, !3172, !3173, !3174, !3175, !3176, !3177, !3180, !3181, !3182, !3183, !3184, !3192, !3258, !3265, !3266, !3273, !3274, !3275, !3276, !3277, !3278, !3279}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !152, file: !151, line: 1217, baseType: !41, size: 960)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !152, file: !151, line: 1218, baseType: !156, size: 64, offset: 960)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !158, line: 42, flags: DIFlagFwdDecl)
!158 = !DIFile(filename: "blender/source/blender/makesdna/DNA_lamp_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!159 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !152, file: !151, line: 1220, baseType: !160, size: 64, offset: 1024)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !162, line: 115, size: 11392, elements: !163)
!162 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!163 = !{!164, !165, !166, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !273, !283, !297, !298, !339, !340, !343, !344, !360, !361, !362, !363, !364, !365, !366, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1658, !1661, !1662, !1663, !1664, !1665, !1666, !1669, !1672, !2106, !2107, !2108, !2109, !2110, !2111, !2112, !2113, !2115, !2118, !2121, !2122, !2125, !2126}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !161, file: !162, line: 116, baseType: !41, size: 960)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !161, file: !162, line: 117, baseType: !156, size: 64, offset: 960)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !161, file: !162, line: 119, baseType: !167, size: 64, offset: 1024)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !169, line: 155, size: 1856, elements: !170)
!169 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_paint.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!170 = !{!171, !174, !188, !197, !204, !205, !206, !208, !212, !214, !218, !222, !223, !224, !226, !229, !232, !233, !234, !235, !236, !240, !241, !242, !244, !245, !248, !249, !252, !255, !256, !257, !258}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "multires", scope: !168, file: !169, line: 157, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "MultiresModifierData", file: !169, line: 157, flags: DIFlagFwdDecl)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "mvert", scope: !168, file: !169, line: 158, baseType: !175, size: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !177, line: 65, size: 160, elements: !178)
!177 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!178 = !{!179, !184, !186, !187}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !176, file: !177, line: 66, baseType: !180, size: 96)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 96, elements: !182)
!181 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!182 = !{!183}
!183 = !DISubrange(count: 3)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !176, file: !177, line: 67, baseType: !185, size: 48, offset: 96)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 48, elements: !182)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !176, file: !177, line: 68, baseType: !16, size: 8, offset: 144)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !176, file: !177, line: 68, baseType: !16, size: 8, offset: 152)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "mpoly", scope: !168, file: !169, line: 159, baseType: !189, size: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !177, line: 79, size: 96, elements: !191)
!191 = !{!192, !193, !194, !195, !196}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !190, file: !177, line: 81, baseType: !56, size: 32)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !190, file: !177, line: 82, baseType: !56, size: 32, offset: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !190, file: !177, line: 83, baseType: !20, size: 16, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !190, file: !177, line: 84, baseType: !16, size: 8, offset: 80)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !190, file: !177, line: 84, baseType: !16, size: 8, offset: 88)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "mloop", scope: !168, file: !169, line: 160, baseType: !198, size: 64, offset: 192)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !177, line: 88, size: 64, elements: !200)
!200 = !{!201, !203}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !199, file: !177, line: 89, baseType: !202, size: 32)
!202 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !199, file: !177, line: 90, baseType: !202, size: 32, offset: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !168, file: !169, line: 161, baseType: !56, size: 32, offset: 256)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "totpoly", scope: !168, file: !169, line: 161, baseType: !56, size: 32, offset: 288)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "face_normals", scope: !168, file: !169, line: 162, baseType: !207, size: 64, offset: 320)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "kb", scope: !168, file: !169, line: 163, baseType: !209, size: 64, offset: 384)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "KeyBlock", file: !211, line: 92, flags: DIFlagFwdDecl)
!211 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_DerivedMesh.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!212 = !DIDerivedType(tag: DW_TAG_member, name: "vmask", scope: !168, file: !169, line: 164, baseType: !213, size: 64, offset: 448)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "pmap", scope: !168, file: !169, line: 167, baseType: !215, size: 64, offset: 512)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !217)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !211, line: 355, flags: DIFlagFwdDecl)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "bm", scope: !168, file: !169, line: 170, baseType: !219, size: 64, offset: 576)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !221, line: 44, flags: DIFlagFwdDecl)
!221 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_customdata.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!222 = !DIDerivedType(tag: DW_TAG_member, name: "cd_vert_node_offset", scope: !168, file: !169, line: 171, baseType: !56, size: 32, offset: 640)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "cd_face_node_offset", scope: !168, file: !169, line: 172, baseType: !56, size: 32, offset: 672)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "bm_smooth_shading", scope: !168, file: !169, line: 173, baseType: !225, size: 8, offset: 704)
!225 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "bm_log", scope: !168, file: !169, line: 175, baseType: !227, size: 64, offset: 768)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMLog", file: !169, line: 175, flags: DIFlagFwdDecl)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "pbvh", scope: !168, file: !169, line: 178, baseType: !230, size: 64, offset: 832)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !211, line: 100, flags: DIFlagFwdDecl)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "show_diffuse_color", scope: !168, file: !169, line: 179, baseType: !225, size: 8, offset: 896)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers_active", scope: !168, file: !169, line: 182, baseType: !225, size: 8, offset: 904)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "orig_cos", scope: !168, file: !169, line: 183, baseType: !207, size: 64, offset: 960)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "deform_cos", scope: !168, file: !169, line: 184, baseType: !207, size: 64, offset: 1024)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "deform_imats", scope: !168, file: !169, line: 185, baseType: !237, size: 64, offset: 1088)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 288, elements: !239)
!239 = !{!183, !183}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "partial_redraw", scope: !168, file: !169, line: 188, baseType: !225, size: 8, offset: 1152)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_side", scope: !168, file: !169, line: 191, baseType: !202, size: 32, offset: 1184)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "texcache", scope: !168, file: !169, line: 191, baseType: !243, size: 64, offset: 1216)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_actual", scope: !168, file: !169, line: 191, baseType: !202, size: 32, offset: 1280)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "tex_pool", scope: !168, file: !169, line: 192, baseType: !246, size: 64, offset: 1344)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePool", file: !169, line: 61, flags: DIFlagFwdDecl)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "layer_co", scope: !168, file: !169, line: 195, baseType: !207, size: 64, offset: 1408)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "stroke", scope: !168, file: !169, line: 197, baseType: !250, size: 64, offset: 1472)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptStroke", file: !169, line: 197, flags: DIFlagFwdDecl)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !168, file: !169, line: 198, baseType: !253, size: 64, offset: 1536)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "StrokeCache", file: !169, line: 59, flags: DIFlagFwdDecl)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke_valid", scope: !168, file: !169, line: 201, baseType: !225, size: 8, offset: 1600)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke", scope: !168, file: !169, line: 202, baseType: !180, size: 96, offset: 1632)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_accum", scope: !168, file: !169, line: 204, baseType: !180, size: 96, offset: 1728)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_counter", scope: !168, file: !169, line: 205, baseType: !56, size: 32, offset: 1824)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !161, file: !162, line: 121, baseType: !20, size: 16, offset: 1088)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !161, file: !162, line: 121, baseType: !20, size: 16, offset: 1104)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !161, file: !162, line: 122, baseType: !56, size: 32, offset: 1120)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !161, file: !162, line: 122, baseType: !56, size: 32, offset: 1152)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !161, file: !162, line: 122, baseType: !56, size: 32, offset: 1184)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !161, file: !162, line: 123, baseType: !71, size: 512, offset: 1216)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !161, file: !162, line: 124, baseType: !160, size: 64, offset: 1728)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !161, file: !162, line: 124, baseType: !160, size: 64, offset: 1792)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !161, file: !162, line: 127, baseType: !160, size: 64, offset: 1856)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !161, file: !162, line: 127, baseType: !160, size: 64, offset: 1920)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !161, file: !162, line: 127, baseType: !160, size: 64, offset: 1984)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !161, file: !162, line: 128, baseType: !271, size: 64, offset: 2048)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !158, line: 45, flags: DIFlagFwdDecl)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !161, file: !162, line: 130, baseType: !274, size: 64, offset: 2112)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !162, line: 97, size: 832, elements: !276)
!276 = !{!277, !281, !282}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !275, file: !162, line: 98, baseType: !278, size: 768)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 768, elements: !279)
!279 = !{!280, !183}
!280 = !DISubrange(count: 8)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !275, file: !162, line: 99, baseType: !56, size: 32, offset: 768)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !275, file: !162, line: 99, baseType: !56, size: 32, offset: 800)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !161, file: !162, line: 131, baseType: !284, size: 64, offset: 2176)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !286, line: 486, size: 1600, elements: !287)
!286 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!287 = !{!288, !289, !290, !291, !292, !293, !294, !295, !296}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !285, file: !286, line: 487, baseType: !41, size: 960)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !285, file: !286, line: 489, baseType: !81, size: 128, offset: 960)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !285, file: !286, line: 490, baseType: !81, size: 128, offset: 1088)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !285, file: !286, line: 491, baseType: !81, size: 128, offset: 1216)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !285, file: !286, line: 492, baseType: !81, size: 128, offset: 1344)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !285, file: !286, line: 494, baseType: !56, size: 32, offset: 1472)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !285, file: !286, line: 495, baseType: !56, size: 32, offset: 1504)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !285, file: !286, line: 497, baseType: !56, size: 32, offset: 1536)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !285, file: !286, line: 498, baseType: !56, size: 32, offset: 1568)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !161, file: !162, line: 132, baseType: !284, size: 64, offset: 2240)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !161, file: !162, line: 133, baseType: !299, size: 64, offset: 2304)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !286, line: 334, size: 1728, elements: !301)
!301 = !{!302, !303, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !338}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !300, file: !286, line: 335, baseType: !81, size: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !300, file: !286, line: 336, baseType: !304, size: 64, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !286, line: 47, flags: DIFlagFwdDecl)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !300, file: !286, line: 338, baseType: !20, size: 16, offset: 192)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !300, file: !286, line: 338, baseType: !20, size: 16, offset: 208)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !300, file: !286, line: 339, baseType: !202, size: 32, offset: 224)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !300, file: !286, line: 340, baseType: !56, size: 32, offset: 256)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !300, file: !286, line: 342, baseType: !181, size: 32, offset: 288)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !300, file: !286, line: 343, baseType: !180, size: 96, offset: 320)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !300, file: !286, line: 344, baseType: !180, size: 96, offset: 416)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !300, file: !286, line: 347, baseType: !81, size: 128, offset: 512)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !300, file: !286, line: 349, baseType: !56, size: 32, offset: 640)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !300, file: !286, line: 350, baseType: !56, size: 32, offset: 672)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !300, file: !286, line: 351, baseType: !45, size: 64, offset: 704)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !300, file: !286, line: 352, baseType: !45, size: 64, offset: 768)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !300, file: !286, line: 354, baseType: !319, size: 384, offset: 832)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !286, line: 116, baseType: !320)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !286, line: 94, size: 384, elements: !321)
!321 = !{!322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !320, file: !286, line: 96, baseType: !56, size: 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !320, file: !286, line: 96, baseType: !56, size: 32, offset: 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !320, file: !286, line: 97, baseType: !56, size: 32, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !320, file: !286, line: 97, baseType: !56, size: 32, offset: 96)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !320, file: !286, line: 99, baseType: !20, size: 16, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !320, file: !286, line: 100, baseType: !20, size: 16, offset: 144)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !320, file: !286, line: 102, baseType: !20, size: 16, offset: 160)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !320, file: !286, line: 105, baseType: !20, size: 16, offset: 176)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !320, file: !286, line: 108, baseType: !20, size: 16, offset: 192)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !320, file: !286, line: 109, baseType: !20, size: 16, offset: 208)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !320, file: !286, line: 111, baseType: !20, size: 16, offset: 224)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !320, file: !286, line: 112, baseType: !20, size: 16, offset: 240)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !320, file: !286, line: 114, baseType: !56, size: 32, offset: 256)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !320, file: !286, line: 114, baseType: !56, size: 32, offset: 288)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !320, file: !286, line: 115, baseType: !56, size: 32, offset: 320)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !320, file: !286, line: 115, baseType: !56, size: 32, offset: 352)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !300, file: !286, line: 355, baseType: !71, size: 512, offset: 1216)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !161, file: !162, line: 134, baseType: !45, size: 64, offset: 2368)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !161, file: !162, line: 136, baseType: !341, size: 64, offset: 2432)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !151, line: 61, flags: DIFlagFwdDecl)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !161, file: !162, line: 138, baseType: !319, size: 384, offset: 2496)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !161, file: !162, line: 139, baseType: !345, size: 64, offset: 2880)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !286, line: 80, baseType: !347)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !286, line: 72, size: 192, elements: !348)
!348 = !{!349, !356, !357, !358, !359}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !347, file: !286, line: 73, baseType: !350, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !286, line: 59, baseType: !352)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !286, line: 56, size: 128, elements: !353)
!353 = !{!354, !355}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !352, file: !286, line: 57, baseType: !180, size: 96)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !352, file: !286, line: 58, baseType: !56, size: 32, offset: 96)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !347, file: !286, line: 74, baseType: !56, size: 32, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !347, file: !286, line: 76, baseType: !56, size: 32, offset: 96)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !347, file: !286, line: 77, baseType: !56, size: 32, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !347, file: !286, line: 79, baseType: !56, size: 32, offset: 160)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !161, file: !162, line: 141, baseType: !81, size: 128, offset: 2944)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !161, file: !162, line: 142, baseType: !81, size: 128, offset: 3072)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !161, file: !162, line: 143, baseType: !81, size: 128, offset: 3200)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !161, file: !162, line: 144, baseType: !81, size: 128, offset: 3328)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !161, file: !162, line: 146, baseType: !56, size: 32, offset: 3456)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !161, file: !162, line: 147, baseType: !56, size: 32, offset: 3488)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !161, file: !162, line: 150, baseType: !367, size: 64, offset: 3520)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !370, line: 93, size: 7552, elements: !371)
!370 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!371 = !{!372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !420, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !489, !490, !491, !492, !493, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1571}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !369, file: !370, line: 94, baseType: !41, size: 960)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !369, file: !370, line: 95, baseType: !156, size: 64, offset: 960)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !369, file: !370, line: 97, baseType: !20, size: 16, offset: 1024)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !369, file: !370, line: 97, baseType: !20, size: 16, offset: 1040)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !369, file: !370, line: 99, baseType: !181, size: 32, offset: 1056)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !369, file: !370, line: 99, baseType: !181, size: 32, offset: 1088)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !369, file: !370, line: 99, baseType: !181, size: 32, offset: 1120)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !369, file: !370, line: 100, baseType: !181, size: 32, offset: 1152)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !369, file: !370, line: 100, baseType: !181, size: 32, offset: 1184)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !369, file: !370, line: 100, baseType: !181, size: 32, offset: 1216)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !369, file: !370, line: 101, baseType: !181, size: 32, offset: 1248)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !369, file: !370, line: 101, baseType: !181, size: 32, offset: 1280)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !369, file: !370, line: 101, baseType: !181, size: 32, offset: 1312)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !369, file: !370, line: 102, baseType: !181, size: 32, offset: 1344)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !369, file: !370, line: 102, baseType: !181, size: 32, offset: 1376)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !369, file: !370, line: 102, baseType: !181, size: 32, offset: 1408)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !369, file: !370, line: 103, baseType: !181, size: 32, offset: 1440)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !369, file: !370, line: 103, baseType: !181, size: 32, offset: 1472)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !369, file: !370, line: 103, baseType: !181, size: 32, offset: 1504)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !369, file: !370, line: 103, baseType: !181, size: 32, offset: 1536)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !369, file: !370, line: 103, baseType: !181, size: 32, offset: 1568)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !369, file: !370, line: 104, baseType: !181, size: 32, offset: 1600)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !369, file: !370, line: 104, baseType: !181, size: 32, offset: 1632)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !369, file: !370, line: 104, baseType: !181, size: 32, offset: 1664)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !369, file: !370, line: 104, baseType: !181, size: 32, offset: 1696)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !369, file: !370, line: 104, baseType: !181, size: 32, offset: 1728)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !369, file: !370, line: 105, baseType: !181, size: 32, offset: 1760)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !369, file: !370, line: 108, baseType: !400, size: 704, offset: 1792)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !370, line: 53, size: 704, elements: !401)
!401 = !{!402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !400, file: !370, line: 54, baseType: !181, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !400, file: !370, line: 55, baseType: !181, size: 32, offset: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !400, file: !370, line: 56, baseType: !181, size: 32, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !400, file: !370, line: 57, baseType: !181, size: 32, offset: 96)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !400, file: !370, line: 59, baseType: !180, size: 96, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !400, file: !370, line: 60, baseType: !180, size: 96, offset: 224)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !400, file: !370, line: 61, baseType: !180, size: 96, offset: 320)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !400, file: !370, line: 63, baseType: !181, size: 32, offset: 416)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !400, file: !370, line: 64, baseType: !181, size: 32, offset: 448)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !400, file: !370, line: 65, baseType: !181, size: 32, offset: 480)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !400, file: !370, line: 67, baseType: !20, size: 16, offset: 512)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !400, file: !370, line: 68, baseType: !20, size: 16, offset: 528)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !400, file: !370, line: 69, baseType: !20, size: 16, offset: 544)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !400, file: !370, line: 70, baseType: !20, size: 16, offset: 560)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !400, file: !370, line: 72, baseType: !181, size: 32, offset: 576)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !400, file: !370, line: 73, baseType: !181, size: 32, offset: 608)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !400, file: !370, line: 74, baseType: !181, size: 32, offset: 640)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !400, file: !370, line: 75, baseType: !181, size: 32, offset: 672)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !369, file: !370, line: 109, baseType: !421, size: 128, offset: 2496)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !370, line: 79, size: 128, elements: !422)
!422 = !{!423, !424, !425, !426}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !421, file: !370, line: 80, baseType: !56, size: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !421, file: !370, line: 81, baseType: !56, size: 32, offset: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !421, file: !370, line: 82, baseType: !56, size: 32, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !421, file: !370, line: 83, baseType: !56, size: 32, offset: 96)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !369, file: !370, line: 111, baseType: !181, size: 32, offset: 2624)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !369, file: !370, line: 111, baseType: !181, size: 32, offset: 2656)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !369, file: !370, line: 112, baseType: !181, size: 32, offset: 2688)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !369, file: !370, line: 112, baseType: !181, size: 32, offset: 2720)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !369, file: !370, line: 113, baseType: !181, size: 32, offset: 2752)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !369, file: !370, line: 114, baseType: !181, size: 32, offset: 2784)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !369, file: !370, line: 114, baseType: !181, size: 32, offset: 2816)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !369, file: !370, line: 115, baseType: !20, size: 16, offset: 2848)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !369, file: !370, line: 115, baseType: !20, size: 16, offset: 2864)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !369, file: !370, line: 116, baseType: !20, size: 16, offset: 2880)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !369, file: !370, line: 117, baseType: !16, size: 8, offset: 2896)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !369, file: !370, line: 117, baseType: !16, size: 8, offset: 2904)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !369, file: !370, line: 119, baseType: !181, size: 32, offset: 2912)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !369, file: !370, line: 119, baseType: !181, size: 32, offset: 2944)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !369, file: !370, line: 120, baseType: !20, size: 16, offset: 2976)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !369, file: !370, line: 120, baseType: !20, size: 16, offset: 2992)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !369, file: !370, line: 121, baseType: !181, size: 32, offset: 3008)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !369, file: !370, line: 121, baseType: !181, size: 32, offset: 3040)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !369, file: !370, line: 122, baseType: !181, size: 32, offset: 3072)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !369, file: !370, line: 123, baseType: !181, size: 32, offset: 3104)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !369, file: !370, line: 124, baseType: !20, size: 16, offset: 3136)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !369, file: !370, line: 125, baseType: !20, size: 16, offset: 3152)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !369, file: !370, line: 127, baseType: !56, size: 32, offset: 3168)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !369, file: !370, line: 127, baseType: !56, size: 32, offset: 3200)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !369, file: !370, line: 128, baseType: !56, size: 32, offset: 3232)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !369, file: !370, line: 128, baseType: !56, size: 32, offset: 3264)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !369, file: !370, line: 129, baseType: !20, size: 16, offset: 3296)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !369, file: !370, line: 129, baseType: !20, size: 16, offset: 3312)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !369, file: !370, line: 129, baseType: !20, size: 16, offset: 3328)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !369, file: !370, line: 129, baseType: !20, size: 16, offset: 3344)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !369, file: !370, line: 130, baseType: !181, size: 32, offset: 3360)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !369, file: !370, line: 130, baseType: !181, size: 32, offset: 3392)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !369, file: !370, line: 130, baseType: !181, size: 32, offset: 3424)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !369, file: !370, line: 130, baseType: !181, size: 32, offset: 3456)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !369, file: !370, line: 131, baseType: !181, size: 32, offset: 3488)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !369, file: !370, line: 131, baseType: !181, size: 32, offset: 3520)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !369, file: !370, line: 131, baseType: !181, size: 32, offset: 3552)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !369, file: !370, line: 131, baseType: !181, size: 32, offset: 3584)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !369, file: !370, line: 132, baseType: !181, size: 32, offset: 3616)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !369, file: !370, line: 132, baseType: !181, size: 32, offset: 3648)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !369, file: !370, line: 133, baseType: !71, size: 512, offset: 3680)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !369, file: !370, line: 135, baseType: !181, size: 32, offset: 4192)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !369, file: !370, line: 136, baseType: !181, size: 32, offset: 4224)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !369, file: !370, line: 137, baseType: !181, size: 32, offset: 4256)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !369, file: !370, line: 138, baseType: !56, size: 32, offset: 4288)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !369, file: !370, line: 141, baseType: !16, size: 8, offset: 4320)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !369, file: !370, line: 141, baseType: !16, size: 8, offset: 4328)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !369, file: !370, line: 141, baseType: !16, size: 8, offset: 4336)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !369, file: !370, line: 141, baseType: !16, size: 8, offset: 4344)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !369, file: !370, line: 142, baseType: !20, size: 16, offset: 4352)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !369, file: !370, line: 142, baseType: !20, size: 16, offset: 4368)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !369, file: !370, line: 142, baseType: !20, size: 16, offset: 4384)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !369, file: !370, line: 145, baseType: !16, size: 8, offset: 4400)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !369, file: !370, line: 145, baseType: !16, size: 8, offset: 4408)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !369, file: !370, line: 148, baseType: !20, size: 16, offset: 4416)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !369, file: !370, line: 148, baseType: !20, size: 16, offset: 4432)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !369, file: !370, line: 149, baseType: !181, size: 32, offset: 4448)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !369, file: !370, line: 149, baseType: !181, size: 32, offset: 4480)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !369, file: !370, line: 152, baseType: !486, size: 128, offset: 4512)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 128, elements: !487)
!487 = !{!488}
!488 = !DISubrange(count: 4)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !369, file: !370, line: 153, baseType: !181, size: 32, offset: 4640)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !369, file: !370, line: 154, baseType: !181, size: 32, offset: 4672)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !369, file: !370, line: 157, baseType: !20, size: 16, offset: 4704)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !369, file: !370, line: 157, baseType: !20, size: 16, offset: 4720)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !369, file: !370, line: 160, baseType: !494, size: 64, offset: 4736)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !496, line: 113, size: 6208, elements: !497)
!496 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!497 = !{!498, !499, !500, !501, !502, !503, !507}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !495, file: !496, line: 114, baseType: !20, size: 16)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !495, file: !496, line: 114, baseType: !20, size: 16, offset: 16)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !495, file: !496, line: 115, baseType: !16, size: 8, offset: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !495, file: !496, line: 115, baseType: !16, size: 8, offset: 40)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !495, file: !496, line: 116, baseType: !16, size: 8, offset: 48)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !495, file: !496, line: 117, baseType: !504, size: 8, offset: 56)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 8, elements: !505)
!505 = !{!506}
!506 = !DISubrange(count: 1)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !495, file: !496, line: 119, baseType: !508, size: 6144, offset: 64)
!508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !509, size: 6144, elements: !518)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !496, line: 109, baseType: !510)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !496, line: 106, size: 192, elements: !511)
!511 = !{!512, !513, !514, !515, !516, !517}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !510, file: !496, line: 107, baseType: !181, size: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !510, file: !496, line: 107, baseType: !181, size: 32, offset: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !510, file: !496, line: 107, baseType: !181, size: 32, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !510, file: !496, line: 107, baseType: !181, size: 32, offset: 96)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !510, file: !496, line: 107, baseType: !181, size: 32, offset: 128)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !510, file: !496, line: 108, baseType: !56, size: 32, offset: 160)
!518 = !{!519}
!519 = !DISubrange(count: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !369, file: !370, line: 161, baseType: !494, size: 64, offset: 4800)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !369, file: !370, line: 162, baseType: !16, size: 8, offset: 4864)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !369, file: !370, line: 162, baseType: !16, size: 8, offset: 4872)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !369, file: !370, line: 163, baseType: !16, size: 8, offset: 4880)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !369, file: !370, line: 163, baseType: !16, size: 8, offset: 4888)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !369, file: !370, line: 164, baseType: !20, size: 16, offset: 4896)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !369, file: !370, line: 164, baseType: !20, size: 16, offset: 4912)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !369, file: !370, line: 165, baseType: !181, size: 32, offset: 4928)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !369, file: !370, line: 165, baseType: !181, size: 32, offset: 4960)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !369, file: !370, line: 167, baseType: !530, size: 1152, offset: 4992)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !531, size: 1152, elements: !1529)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !496, line: 57, size: 2496, elements: !533)
!533 = !{!534, !535, !536, !537, !538, !539, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !532, file: !496, line: 59, baseType: !20, size: 16)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !532, file: !496, line: 59, baseType: !20, size: 16, offset: 16)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !532, file: !496, line: 59, baseType: !20, size: 16, offset: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !532, file: !496, line: 59, baseType: !20, size: 16, offset: 48)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !532, file: !496, line: 60, baseType: !160, size: 64, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !532, file: !496, line: 61, baseType: !540, size: 64, offset: 128)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !496, line: 202, size: 3328, elements: !542)
!542 = !{!543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !613, !1213, !1214, !1344, !1345, !1371, !1372, !1439, !1460, !1468, !1469}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !541, file: !496, line: 203, baseType: !41, size: 960)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !541, file: !496, line: 204, baseType: !156, size: 64, offset: 960)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !541, file: !496, line: 206, baseType: !181, size: 32, offset: 1024)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !541, file: !496, line: 206, baseType: !181, size: 32, offset: 1056)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !541, file: !496, line: 207, baseType: !181, size: 32, offset: 1088)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !541, file: !496, line: 207, baseType: !181, size: 32, offset: 1120)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !541, file: !496, line: 207, baseType: !181, size: 32, offset: 1152)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !541, file: !496, line: 207, baseType: !181, size: 32, offset: 1184)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !541, file: !496, line: 207, baseType: !181, size: 32, offset: 1216)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !541, file: !496, line: 207, baseType: !181, size: 32, offset: 1248)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !541, file: !496, line: 208, baseType: !181, size: 32, offset: 1280)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !541, file: !496, line: 208, baseType: !181, size: 32, offset: 1312)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !541, file: !496, line: 211, baseType: !181, size: 32, offset: 1344)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !541, file: !496, line: 211, baseType: !181, size: 32, offset: 1376)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !541, file: !496, line: 211, baseType: !181, size: 32, offset: 1408)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !541, file: !496, line: 211, baseType: !181, size: 32, offset: 1440)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !541, file: !496, line: 211, baseType: !181, size: 32, offset: 1472)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !541, file: !496, line: 214, baseType: !181, size: 32, offset: 1504)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !541, file: !496, line: 214, baseType: !181, size: 32, offset: 1536)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !541, file: !496, line: 217, baseType: !181, size: 32, offset: 1568)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !541, file: !496, line: 218, baseType: !181, size: 32, offset: 1600)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !541, file: !496, line: 219, baseType: !181, size: 32, offset: 1632)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !541, file: !496, line: 220, baseType: !181, size: 32, offset: 1664)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !541, file: !496, line: 221, baseType: !181, size: 32, offset: 1696)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !541, file: !496, line: 222, baseType: !20, size: 16, offset: 1728)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !541, file: !496, line: 222, baseType: !20, size: 16, offset: 1744)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !541, file: !496, line: 224, baseType: !20, size: 16, offset: 1760)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !541, file: !496, line: 224, baseType: !20, size: 16, offset: 1776)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !541, file: !496, line: 227, baseType: !20, size: 16, offset: 1792)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !541, file: !496, line: 227, baseType: !20, size: 16, offset: 1808)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !541, file: !496, line: 229, baseType: !20, size: 16, offset: 1824)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !541, file: !496, line: 229, baseType: !20, size: 16, offset: 1840)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !541, file: !496, line: 230, baseType: !20, size: 16, offset: 1856)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !541, file: !496, line: 230, baseType: !20, size: 16, offset: 1872)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !541, file: !496, line: 232, baseType: !181, size: 32, offset: 1888)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !541, file: !496, line: 232, baseType: !181, size: 32, offset: 1920)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !541, file: !496, line: 232, baseType: !181, size: 32, offset: 1952)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !541, file: !496, line: 232, baseType: !181, size: 32, offset: 1984)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !541, file: !496, line: 233, baseType: !56, size: 32, offset: 2016)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !541, file: !496, line: 234, baseType: !56, size: 32, offset: 2048)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !541, file: !496, line: 235, baseType: !20, size: 16, offset: 2080)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !541, file: !496, line: 235, baseType: !20, size: 16, offset: 2096)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !541, file: !496, line: 236, baseType: !20, size: 16, offset: 2112)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !541, file: !496, line: 239, baseType: !20, size: 16, offset: 2128)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !541, file: !496, line: 240, baseType: !56, size: 32, offset: 2144)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !541, file: !496, line: 241, baseType: !56, size: 32, offset: 2176)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !541, file: !496, line: 241, baseType: !56, size: 32, offset: 2208)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !541, file: !496, line: 241, baseType: !56, size: 32, offset: 2240)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !541, file: !496, line: 243, baseType: !181, size: 32, offset: 2272)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !541, file: !496, line: 243, baseType: !181, size: 32, offset: 2304)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !541, file: !496, line: 244, baseType: !181, size: 32, offset: 2336)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !541, file: !496, line: 246, baseType: !595, size: 320, offset: 2368)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !596, line: 50, size: 320, elements: !597)
!596 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!597 = !{!598, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !595, file: !596, line: 51, baseType: !599, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !595, file: !596, line: 53, baseType: !56, size: 32, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !595, file: !596, line: 54, baseType: !56, size: 32, offset: 96)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !595, file: !596, line: 55, baseType: !56, size: 32, offset: 128)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !595, file: !596, line: 55, baseType: !56, size: 32, offset: 160)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !595, file: !596, line: 56, baseType: !16, size: 8, offset: 192)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !595, file: !596, line: 56, baseType: !16, size: 8, offset: 200)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !595, file: !596, line: 57, baseType: !16, size: 8, offset: 208)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !595, file: !596, line: 57, baseType: !16, size: 8, offset: 216)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !595, file: !596, line: 59, baseType: !20, size: 16, offset: 224)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !595, file: !596, line: 59, baseType: !20, size: 16, offset: 240)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !595, file: !596, line: 59, baseType: !20, size: 16, offset: 256)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !595, file: !596, line: 61, baseType: !20, size: 16, offset: 272)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !595, file: !596, line: 63, baseType: !56, size: 32, offset: 288)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !541, file: !496, line: 248, baseType: !614, size: 64, offset: 2688)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !616, line: 328, size: 3456, elements: !617)
!616 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!617 = !{!618, !619, !620, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1191, !1192, !1193, !1196, !1200, !1204, !1208, !1209, !1210, !1211, !1212}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !615, file: !616, line: 329, baseType: !41, size: 960)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !615, file: !616, line: 330, baseType: !156, size: 64, offset: 960)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !615, file: !616, line: 332, baseType: !621, size: 64, offset: 1024)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !623, line: 283, size: 4096, elements: !624)
!623 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!624 = !{!625, !626, !627, !628, !629, !630, !634, !1131, !1139, !1143, !1149, !1153, !1154, !1155, !1156, !1160, !1161}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !622, file: !623, line: 284, baseType: !56, size: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !622, file: !623, line: 285, baseType: !71, size: 512, offset: 32)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !622, file: !623, line: 287, baseType: !71, size: 512, offset: 544)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !622, file: !623, line: 288, baseType: !137, size: 2048, offset: 1056)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !622, file: !623, line: 289, baseType: !56, size: 32, offset: 3104)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !622, file: !623, line: 292, baseType: !631, size: 64, offset: 3136)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DISubroutineType(types: !633)
!633 = !{null, !614}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !622, file: !623, line: 293, baseType: !635, size: 64, offset: 3200)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DISubroutineType(types: !637)
!637 = !{null, !614, !638}
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !616, line: 167, size: 3712, elements: !640)
!640 = !{!641, !642, !643, !644, !645, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !639, file: !616, line: 168, baseType: !638, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !639, file: !616, line: 168, baseType: !638, size: 64, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !639, file: !616, line: 168, baseType: !638, size: 64, offset: 128)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !639, file: !616, line: 170, baseType: !60, size: 64, offset: 192)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !639, file: !616, line: 172, baseType: !646, size: 64, offset: 256)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !623, line: 144, size: 6016, elements: !648)
!648 = !{!649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !829, !830, !831, !974, !978, !982, !983, !990, !994, !998, !999, !1000, !1001, !1005, !1006, !1010, !1014, !1018, !1022, !1026, !1030, !1034, !1035, !1042, !1044, !1053, !1086}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !647, file: !623, line: 145, baseType: !45, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !647, file: !623, line: 145, baseType: !45, size: 64, offset: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !647, file: !623, line: 146, baseType: !20, size: 16, offset: 128)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !647, file: !623, line: 148, baseType: !71, size: 512, offset: 144)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !647, file: !623, line: 149, baseType: !56, size: 32, offset: 672)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !647, file: !623, line: 151, baseType: !71, size: 512, offset: 704)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !647, file: !623, line: 152, baseType: !137, size: 2048, offset: 1216)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !647, file: !623, line: 153, baseType: !56, size: 32, offset: 3264)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !647, file: !623, line: 155, baseType: !181, size: 32, offset: 3296)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !647, file: !623, line: 155, baseType: !181, size: 32, offset: 3328)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !647, file: !623, line: 155, baseType: !181, size: 32, offset: 3360)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !647, file: !623, line: 156, baseType: !181, size: 32, offset: 3392)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !647, file: !623, line: 156, baseType: !181, size: 32, offset: 3424)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !647, file: !623, line: 156, baseType: !181, size: 32, offset: 3456)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !647, file: !623, line: 157, baseType: !20, size: 16, offset: 3488)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !647, file: !623, line: 157, baseType: !20, size: 16, offset: 3504)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !647, file: !623, line: 157, baseType: !20, size: 16, offset: 3520)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !647, file: !623, line: 160, baseType: !667, size: 64, offset: 3584)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !623, line: 109, baseType: !669)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !623, line: 98, size: 1408, elements: !670)
!670 = !{!671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !828}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !669, file: !623, line: 99, baseType: !56, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !669, file: !623, line: 99, baseType: !56, size: 32, offset: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !669, file: !623, line: 100, baseType: !71, size: 512, offset: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !669, file: !623, line: 101, baseType: !181, size: 32, offset: 576)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !669, file: !623, line: 101, baseType: !181, size: 32, offset: 608)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !669, file: !623, line: 101, baseType: !181, size: 32, offset: 640)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !669, file: !623, line: 101, baseType: !181, size: 32, offset: 672)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !669, file: !623, line: 102, baseType: !181, size: 32, offset: 704)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !669, file: !623, line: 102, baseType: !181, size: 32, offset: 736)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !669, file: !623, line: 103, baseType: !56, size: 32, offset: 768)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !669, file: !623, line: 104, baseType: !56, size: 32, offset: 800)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !669, file: !623, line: 107, baseType: !683, size: 64, offset: 832)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !616, line: 87, size: 2816, elements: !685)
!685 = !{!686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !810}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !684, file: !616, line: 88, baseType: !683, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !684, file: !616, line: 88, baseType: !683, size: 64, offset: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !684, file: !616, line: 88, baseType: !683, size: 64, offset: 128)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !684, file: !616, line: 90, baseType: !60, size: 64, offset: 192)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !684, file: !616, line: 92, baseType: !71, size: 512, offset: 256)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !684, file: !616, line: 94, baseType: !71, size: 512, offset: 768)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !684, file: !616, line: 99, baseType: !45, size: 64, offset: 1280)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !684, file: !616, line: 101, baseType: !20, size: 16, offset: 1344)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !684, file: !616, line: 101, baseType: !20, size: 16, offset: 1360)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !684, file: !616, line: 102, baseType: !20, size: 16, offset: 1376)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !684, file: !616, line: 103, baseType: !20, size: 16, offset: 1392)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !684, file: !616, line: 104, baseType: !698, size: 64, offset: 1408)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !623, line: 114, size: 1600, elements: !700)
!700 = !{!701, !702, !726, !730, !734, !738, !742, !746, !747, !751, !780, !781, !782}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !699, file: !623, line: 115, baseType: !71, size: 512)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !699, file: !623, line: 117, baseType: !703, size: 64, offset: 512)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DISubroutineType(types: !705)
!705 = !{null, !706, !709, !712, !712, !724}
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !708, line: 51, flags: DIFlagFwdDecl)
!708 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !711, line: 46, flags: DIFlagFwdDecl)
!711 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !714, line: 55, size: 192, elements: !715)
!714 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!715 = !{!716, !720, !723}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !713, file: !714, line: 58, baseType: !717, size: 64)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !713, file: !714, line: 56, size: 64, elements: !718)
!718 = !{!719}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !717, file: !714, line: 57, baseType: !45, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !713, file: !714, line: 60, baseType: !721, size: 64, offset: 64)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !616, line: 335, flags: DIFlagFwdDecl)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !713, file: !714, line: 61, baseType: !45, size: 64, offset: 128)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "draw_color", scope: !699, file: !623, line: 118, baseType: !727, size: 64, offset: 576)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DISubroutineType(types: !729)
!729 = !{null, !706, !712, !712, !213}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw", scope: !699, file: !623, line: 120, baseType: !731, size: 64, offset: 640)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DISubroutineType(types: !733)
!733 = !{null, !706, !709, !712}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw_color", scope: !699, file: !623, line: 121, baseType: !735, size: 64, offset: 704)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DISubroutineType(types: !737)
!737 = !{null, !706, !712, !213}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "interface_register_properties", scope: !699, file: !623, line: 122, baseType: !739, size: 64, offset: 768)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{null, !614, !683, !721}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "interface_init_socket", scope: !699, file: !623, line: 123, baseType: !743, size: 64, offset: 832)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DISubroutineType(types: !745)
!745 = !{null, !614, !683, !638, !683, !724}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "interface_verify_socket", scope: !699, file: !623, line: 124, baseType: !743, size: 64, offset: 896)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "interface_from_socket", scope: !699, file: !623, line: 125, baseType: !748, size: 64, offset: 960)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DISubroutineType(types: !750)
!750 = !{null, !614, !683, !638, !683}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "ext_socket", scope: !699, file: !623, line: 128, baseType: !752, size: 256, offset: 1024)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !714, line: 436, baseType: !753)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !714, line: 430, size: 256, elements: !754)
!754 = !{!755, !756, !759, !775}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !753, file: !714, line: 431, baseType: !45, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !753, file: !714, line: 432, baseType: !757, size: 64, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !714, line: 417, baseType: !722)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !753, file: !714, line: 433, baseType: !760, size: 64, offset: 128)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !714, line: 408, baseType: !761)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DISubroutineType(types: !763)
!763 = !{!56, !706, !712, !764, !766}
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !714, line: 38, flags: DIFlagFwdDecl)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !714, line: 348, baseType: !768)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !714, line: 337, size: 256, elements: !769)
!769 = !{!770, !771, !772, !773, !774}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !768, file: !714, line: 339, baseType: !45, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !768, file: !714, line: 342, baseType: !764, size: 64, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !768, file: !714, line: 345, baseType: !56, size: 32, offset: 128)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !768, file: !714, line: 347, baseType: !56, size: 32, offset: 160)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !768, file: !714, line: 347, baseType: !56, size: 32, offset: 192)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !753, file: !714, line: 434, baseType: !776, size: 64, offset: 192)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !714, line: 409, baseType: !777)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DISubroutineType(types: !779)
!779 = !{null, !45}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "ext_interface", scope: !699, file: !623, line: 129, baseType: !752, size: 256, offset: 1280)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !699, file: !623, line: 132, baseType: !56, size: 32, offset: 1536)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !699, file: !623, line: 132, baseType: !56, size: 32, offset: 1568)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !684, file: !616, line: 105, baseType: !71, size: 512, offset: 1472)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !684, file: !616, line: 107, baseType: !181, size: 32, offset: 1984)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !684, file: !616, line: 107, baseType: !181, size: 32, offset: 2016)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "default_value", scope: !684, file: !616, line: 109, baseType: !45, size: 64, offset: 2048)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "stack_index", scope: !684, file: !616, line: 112, baseType: !20, size: 16, offset: 2112)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "stack_type", scope: !684, file: !616, line: 114, baseType: !20, size: 16, offset: 2128)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !684, file: !616, line: 115, baseType: !56, size: 32, offset: 2144)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !684, file: !616, line: 117, baseType: !45, size: 64, offset: 2176)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "own_index", scope: !684, file: !616, line: 122, baseType: !56, size: 32, offset: 2240)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "to_index", scope: !684, file: !616, line: 124, baseType: !56, size: 32, offset: 2272)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "groupsock", scope: !684, file: !616, line: 126, baseType: !683, size: 64, offset: 2304)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !684, file: !616, line: 128, baseType: !795, size: 64, offset: 2368)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeLink", file: !616, line: 298, size: 448, elements: !797)
!797 = !{!798, !799, !800, !803, !804, !807, !808, !809}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !796, file: !616, line: 299, baseType: !795, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !796, file: !616, line: 299, baseType: !795, size: 64, offset: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "fromnode", scope: !796, file: !616, line: 301, baseType: !801, size: 64, offset: 128)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNode", file: !616, line: 218, baseType: !639)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "tonode", scope: !796, file: !616, line: 301, baseType: !801, size: 64, offset: 192)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "fromsock", scope: !796, file: !616, line: 302, baseType: !805, size: 64, offset: 256)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocket", file: !616, line: 132, baseType: !684)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "tosock", scope: !796, file: !616, line: 302, baseType: !805, size: 64, offset: 320)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !796, file: !616, line: 304, baseType: !56, size: 32, offset: 384)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !796, file: !616, line: 305, baseType: !56, size: 32, offset: 416)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !684, file: !616, line: 131, baseType: !811, size: 384, offset: 2432)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeStack", file: !616, line: 73, baseType: !812)
