; ModuleID = 'blender/source/blender/render/intern/source/render_result.c'
source_filename = "blender/source/blender/render/intern/source/render_result.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "name", scope: !2, file: !3, line: 802, type: !105, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "make_pass_name", scope: !3, file: !3, line: 800, type: !4, scopeLine: 801, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !33, retainedNodes: !104)
!3 = !DIFile(filename: "blender/source/blender/render/intern/source/render_result.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !8, !17}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderPass", file: !10, line: 76, baseType: !11)
!10 = !DIFile(filename: "blender/source/blender/render/extern/include/RE_pipeline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!11 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderPass", file: !10, line: 68, size: 960, elements: !12)
!12 = !{!13, !15, !16, !18, !19, !23, !27, !30, !31, !32}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !11, file: !10, line: 69, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !11, file: !10, line: 69, baseType: !14, size: 64, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "passtype", scope: !11, file: !10, line: 70, baseType: !17, size: 32, offset: 128)
!17 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !11, file: !10, line: 70, baseType: !17, size: 32, offset: 160)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !11, file: !10, line: 71, baseType: !20, size: 512, offset: 192)
!20 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 512, elements: !21)
!21 = !{!22}
!22 = !DISubrange(count: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "chan_id", scope: !11, file: !10, line: 72, baseType: !24, size: 64, offset: 704)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !25)
!25 = !{!26}
!26 = !DISubrange(count: 8)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !11, file: !10, line: 73, baseType: !28, size: 64, offset: 768)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "rectx", scope: !11, file: !10, line: 74, baseType: !17, size: 32, offset: 832)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "recty", scope: !11, file: !10, line: 74, baseType: !17, size: 32, offset: 864)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "debug_type", scope: !11, file: !10, line: 75, baseType: !17, size: 32, offset: 896)
!33 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !34, retainedTypes: !98, globals: !103, splitDebugInlining: false, nameTableKind: None)
!34 = !{!35, !70, !80, !92}
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ScenePassType", file: !36, line: 213, baseType: !17, size: 32, elements: !37)
!36 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69}
!38 = !DIEnumerator(name: "SCE_PASS_COMBINED", value: 1)
!39 = !DIEnumerator(name: "SCE_PASS_Z", value: 2)
!40 = !DIEnumerator(name: "SCE_PASS_RGBA", value: 4)
!41 = !DIEnumerator(name: "SCE_PASS_DIFFUSE", value: 8)
!42 = !DIEnumerator(name: "SCE_PASS_SPEC", value: 16)
!43 = !DIEnumerator(name: "SCE_PASS_SHADOW", value: 32)
!44 = !DIEnumerator(name: "SCE_PASS_AO", value: 64)
!45 = !DIEnumerator(name: "SCE_PASS_REFLECT", value: 128)
!46 = !DIEnumerator(name: "SCE_PASS_NORMAL", value: 256)
!47 = !DIEnumerator(name: "SCE_PASS_VECTOR", value: 512)
!48 = !DIEnumerator(name: "SCE_PASS_REFRACT", value: 1024)
!49 = !DIEnumerator(name: "SCE_PASS_INDEXOB", value: 2048)
!50 = !DIEnumerator(name: "SCE_PASS_UV", value: 4096)
!51 = !DIEnumerator(name: "SCE_PASS_INDIRECT", value: 8192)
!52 = !DIEnumerator(name: "SCE_PASS_MIST", value: 16384)
!53 = !DIEnumerator(name: "SCE_PASS_RAYHITS", value: 32768)
!54 = !DIEnumerator(name: "SCE_PASS_EMIT", value: 65536)
!55 = !DIEnumerator(name: "SCE_PASS_ENVIRONMENT", value: 131072)
!56 = !DIEnumerator(name: "SCE_PASS_INDEXMA", value: 262144)
!57 = !DIEnumerator(name: "SCE_PASS_DIFFUSE_DIRECT", value: 524288)
!58 = !DIEnumerator(name: "SCE_PASS_DIFFUSE_INDIRECT", value: 1048576)
!59 = !DIEnumerator(name: "SCE_PASS_DIFFUSE_COLOR", value: 2097152)
!60 = !DIEnumerator(name: "SCE_PASS_GLOSSY_DIRECT", value: 4194304)
!61 = !DIEnumerator(name: "SCE_PASS_GLOSSY_INDIRECT", value: 8388608)
!62 = !DIEnumerator(name: "SCE_PASS_GLOSSY_COLOR", value: 16777216)
!63 = !DIEnumerator(name: "SCE_PASS_TRANSM_DIRECT", value: 33554432)
!64 = !DIEnumerator(name: "SCE_PASS_TRANSM_INDIRECT", value: 67108864)
!65 = !DIEnumerator(name: "SCE_PASS_TRANSM_COLOR", value: 134217728)
!66 = !DIEnumerator(name: "SCE_PASS_SUBSURFACE_DIRECT", value: 268435456)
!67 = !DIEnumerator(name: "SCE_PASS_SUBSURFACE_INDIRECT", value: 536870912)
!68 = !DIEnumerator(name: "SCE_PASS_SUBSURFACE_COLOR", value: 1073741824)
!69 = !DIEnumerator(name: "SCE_PASS_DEBUG", value: -2147483648)
!70 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !71, line: 201, baseType: !72, size: 32, elements: !73)
!71 = !DIFile(filename: "blender/source/blender/imbuf/IMB_colormanagement.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!72 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!73 = !{!74, !75, !76, !77, !78, !79}
!74 = !DIEnumerator(name: "COLOR_ROLE_SCENE_LINEAR", value: 0, isUnsigned: true)
!75 = !DIEnumerator(name: "COLOR_ROLE_COLOR_PICKING", value: 1, isUnsigned: true)
!76 = !DIEnumerator(name: "COLOR_ROLE_TEXTURE_PAINTING", value: 2, isUnsigned: true)
!77 = !DIEnumerator(name: "COLOR_ROLE_DEFAULT_SEQUENCER", value: 3, isUnsigned: true)
!78 = !DIEnumerator(name: "COLOR_ROLE_DEFAULT_BYTE", value: 4, isUnsigned: true)
!79 = !DIEnumerator(name: "COLOR_ROLE_DEFAULT_FLOAT", value: 5, isUnsigned: true)
!80 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ReportType", file: !81, line: 67, baseType: !72, size: 32, elements: !82)
!81 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!82 = !{!83, !84, !85, !86, !87, !88, !89, !90, !91}
!83 = !DIEnumerator(name: "RPT_DEBUG", value: 1, isUnsigned: true)
!84 = !DIEnumerator(name: "RPT_INFO", value: 2, isUnsigned: true)
!85 = !DIEnumerator(name: "RPT_OPERATOR", value: 4, isUnsigned: true)
!86 = !DIEnumerator(name: "RPT_PROPERTY", value: 8, isUnsigned: true)
!87 = !DIEnumerator(name: "RPT_WARNING", value: 16, isUnsigned: true)
!88 = !DIEnumerator(name: "RPT_ERROR", value: 32, isUnsigned: true)
!89 = !DIEnumerator(name: "RPT_ERROR_INVALID_INPUT", value: 64, isUnsigned: true)
!90 = !DIEnumerator(name: "RPT_ERROR_INVALID_CONTEXT", value: 128, isUnsigned: true)
!91 = !DIEnumerator(name: "RPT_ERROR_OUT_OF_MEMORY", value: 256, isUnsigned: true)
!92 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !93, line: 119, baseType: !72, size: 32, elements: !94)
!93 = !DIFile(filename: "blender/source/blender/render/intern/include/render_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!94 = !{!95, !96, !97}
!95 = !DIEnumerator(name: "PART_STATUS_NONE", value: 0, isUnsigned: true)
!96 = !DIEnumerator(name: "PART_STATUS_IN_PROGRESS", value: 1, isUnsigned: true)
!97 = !DIEnumerator(name: "PART_STATUS_READY", value: 2, isUnsigned: true)
!98 = !{!99, !100, !101}
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!103 = !{!0}
!104 = !{}
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 16)
!108 = !{i32 7, !"Dwarf Version", i32 4}
!109 = !{i32 2, !"Debug Info Version", i32 3}
!110 = !{i32 1, !"wchar_size", i32 4}
!111 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!112 = distinct !DISubprogram(name: "render_result_free", scope: !3, file: !3, line: 66, type: !113, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !33, retainedNodes: !104)
!113 = !DISubroutineType(types: !114)
!114 = !{null, !115}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderResult", file: !10, line: 148, baseType: !117)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !10, line: 110, size: 1152, elements: !118)
!118 = !{!119, !121, !122, !123, !124, !126, !127, !129, !130, !131, !140, !141, !142, !149, !151, !185, !186, !187, !188}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !117, file: !10, line: 111, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !117, file: !10, line: 111, baseType: !120, size: 64, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "rectx", scope: !117, file: !10, line: 114, baseType: !17, size: 32, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "recty", scope: !117, file: !10, line: 114, baseType: !17, size: 32, offset: 160)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !117, file: !10, line: 115, baseType: !125, size: 16, offset: 192)
!125 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "sample_nr", scope: !117, file: !10, line: 115, baseType: !125, size: 16, offset: 208)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "rect32", scope: !117, file: !10, line: 118, baseType: !128, size: 64, offset: 256)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "rectf", scope: !117, file: !10, line: 120, baseType: !28, size: 64, offset: 320)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "rectz", scope: !117, file: !10, line: 122, baseType: !28, size: 64, offset: 384)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "tilerect", scope: !117, file: !10, line: 125, baseType: !132, size: 128, offset: 448)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !133, line: 89, baseType: !134)
!133 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !133, line: 86, size: 128, elements: !135)
!135 = !{!136, !137, !138, !139}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !134, file: !133, line: 87, baseType: !17, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !134, file: !133, line: 87, baseType: !17, size: 32, offset: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !134, file: !133, line: 88, baseType: !17, size: 32, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !134, file: !133, line: 88, baseType: !17, size: 32, offset: 96)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "xof", scope: !117, file: !10, line: 127, baseType: !17, size: 32, offset: 576)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "yof", scope: !117, file: !10, line: 127, baseType: !17, size: 32, offset: 608)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !117, file: !10, line: 130, baseType: !143, size: 128, offset: 640)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !144, line: 71, baseType: !145)
!144 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !144, line: 69, size: 128, elements: !146)
!146 = !{!147, !148}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !145, file: !144, line: 70, baseType: !99, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !145, file: !144, line: 70, baseType: !99, size: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "renrect", scope: !117, file: !10, line: 133, baseType: !150, size: 128, offset: 768)
!150 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !132)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "renlay", scope: !117, file: !10, line: 134, baseType: !152, size: 64, offset: 896)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderLayer", file: !10, line: 108, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderLayer", file: !10, line: 85, size: 1600, elements: !156)
!156 = !{!157, !159, !160, !164, !165, !166, !167, !168, !169, !170, !173, !177, !178, !179, !180, !181, !182, !183, !184}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !155, file: !10, line: 86, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !155, file: !10, line: 86, baseType: !158, size: 64, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !155, file: !10, line: 89, baseType: !161, size: 592, offset: 128)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 592, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 74)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !155, file: !10, line: 90, baseType: !72, size: 32, offset: 736)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "lay_zmask", scope: !155, file: !10, line: 90, baseType: !72, size: 32, offset: 768)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "lay_exclude", scope: !155, file: !10, line: 90, baseType: !72, size: 32, offset: 800)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "layflag", scope: !155, file: !10, line: 91, baseType: !17, size: 32, offset: 832)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "passflag", scope: !155, file: !10, line: 91, baseType: !17, size: 32, offset: 864)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "pass_xor", scope: !155, file: !10, line: 91, baseType: !17, size: 32, offset: 896)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "mat_override", scope: !155, file: !10, line: 93, baseType: !171, size: 64, offset: 960)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !36, line: 179, flags: DIFlagFwdDecl)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "light_override", scope: !155, file: !10, line: 94, baseType: !174, size: 64, offset: 1024)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !176, line: 43, flags: DIFlagFwdDecl)
!176 = !DIFile(filename: "blender/source/blender/makesdna/DNA_freestyle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!177 = !DIDerivedType(tag: DW_TAG_member, name: "rectf", scope: !155, file: !10, line: 96, baseType: !28, size: 64, offset: 1088)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "acolrect", scope: !155, file: !10, line: 97, baseType: !28, size: 64, offset: 1152)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "scolrect", scope: !155, file: !10, line: 98, baseType: !28, size: 64, offset: 1216)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer", scope: !155, file: !10, line: 99, baseType: !128, size: 64, offset: 1280)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "rectx", scope: !155, file: !10, line: 101, baseType: !17, size: 32, offset: 1344)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "recty", scope: !155, file: !10, line: 101, baseType: !17, size: 32, offset: 1376)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "exrhandle", scope: !155, file: !10, line: 104, baseType: !99, size: 64, offset: 1408)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "passes", scope: !155, file: !10, line: 106, baseType: !143, size: 128, offset: 1472)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "do_exr_tile", scope: !117, file: !10, line: 137, baseType: !17, size: 32, offset: 960)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !117, file: !10, line: 140, baseType: !17, size: 32, offset: 992)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "have_combined", scope: !117, file: !10, line: 143, baseType: !17, size: 32, offset: 1024)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !117, file: !10, line: 146, baseType: !6, size: 64, offset: 1088)
!189 = !DILocalVariable(name: "res", arg: 1, scope: !112, file: !3, line: 66, type: !115)
!190 = !DILocation(line: 66, column: 39, scope: !112)
!191 = !DILocation(line: 68, column: 6, scope: !192)
!192 = distinct !DILexicalBlock(scope: !112, file: !3, line: 68, column: 6)
!193 = !DILocation(line: 68, column: 10, scope: !192)
!194 = !DILocation(line: 68, column: 6, scope: !112)
!195 = !DILocation(line: 68, column: 19, scope: !192)
!196 = !DILocation(line: 70, column: 2, scope: !112)
!197 = !DILocation(line: 70, column: 9, scope: !112)
!198 = !DILocation(line: 70, column: 14, scope: !112)
!199 = !DILocation(line: 70, column: 21, scope: !112)
!200 = !DILocalVariable(name: "rl", scope: !201, file: !3, line: 71, type: !202)
!201 = distinct !DILexicalBlock(scope: !112, file: !3, line: 70, column: 28)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!203 = !DILocation(line: 71, column: 16, scope: !201)
!204 = !DILocation(line: 71, column: 21, scope: !201)
!205 = !DILocation(line: 71, column: 26, scope: !201)
!206 = !DILocation(line: 71, column: 33, scope: !201)
!207 = !DILocation(line: 73, column: 7, scope: !208)
!208 = distinct !DILexicalBlock(scope: !201, file: !3, line: 73, column: 7)
!209 = !DILocation(line: 73, column: 11, scope: !208)
!210 = !DILocation(line: 73, column: 7, scope: !201)
!211 = !DILocation(line: 73, column: 18, scope: !208)
!212 = !DILocation(line: 73, column: 28, scope: !208)
!213 = !DILocation(line: 73, column: 32, scope: !208)
!214 = !DILocation(line: 75, column: 7, scope: !215)
!215 = distinct !DILexicalBlock(scope: !201, file: !3, line: 75, column: 7)
!216 = !DILocation(line: 75, column: 11, scope: !215)
!217 = !DILocation(line: 75, column: 7, scope: !201)
!218 = !DILocation(line: 75, column: 21, scope: !215)
!219 = !DILocation(line: 75, column: 31, scope: !215)
!220 = !DILocation(line: 75, column: 35, scope: !215)
!221 = !DILocation(line: 76, column: 7, scope: !222)
!222 = distinct !DILexicalBlock(scope: !201, file: !3, line: 76, column: 7)
!223 = !DILocation(line: 76, column: 11, scope: !222)
!224 = !DILocation(line: 76, column: 7, scope: !201)
!225 = !DILocation(line: 76, column: 21, scope: !222)
!226 = !DILocation(line: 76, column: 31, scope: !222)
!227 = !DILocation(line: 76, column: 35, scope: !222)
!228 = !DILocation(line: 77, column: 7, scope: !229)
!229 = distinct !DILexicalBlock(scope: !201, file: !3, line: 77, column: 7)
!230 = !DILocation(line: 77, column: 11, scope: !229)
!231 = !DILocation(line: 77, column: 7, scope: !201)
!232 = !DILocation(line: 77, column: 27, scope: !229)
!233 = !DILocation(line: 77, column: 37, scope: !229)
!234 = !DILocation(line: 77, column: 41, scope: !229)
!235 = !DILocation(line: 79, column: 3, scope: !201)
!236 = !DILocation(line: 79, column: 10, scope: !201)
!237 = !DILocation(line: 79, column: 14, scope: !201)
!238 = !DILocation(line: 79, column: 21, scope: !201)
!239 = !DILocalVariable(name: "rpass", scope: !240, file: !3, line: 80, type: !8)
!240 = distinct !DILexicalBlock(scope: !201, file: !3, line: 79, column: 28)
!241 = !DILocation(line: 80, column: 16, scope: !240)
!242 = !DILocation(line: 80, column: 24, scope: !240)
!243 = !DILocation(line: 80, column: 28, scope: !240)
!244 = !DILocation(line: 80, column: 35, scope: !240)
!245 = !DILocation(line: 81, column: 8, scope: !246)
!246 = distinct !DILexicalBlock(scope: !240, file: !3, line: 81, column: 8)
!247 = !DILocation(line: 81, column: 15, scope: !246)
!248 = !DILocation(line: 81, column: 8, scope: !240)
!249 = !DILocation(line: 81, column: 21, scope: !246)
!250 = !DILocation(line: 81, column: 31, scope: !246)
!251 = !DILocation(line: 81, column: 38, scope: !246)
!252 = !DILocation(line: 82, column: 17, scope: !240)
!253 = !DILocation(line: 82, column: 21, scope: !240)
!254 = !DILocation(line: 82, column: 29, scope: !240)
!255 = !DILocation(line: 82, column: 4, scope: !240)
!256 = !DILocation(line: 83, column: 4, scope: !240)
!257 = !DILocation(line: 83, column: 14, scope: !240)
!258 = distinct !{!258, !235, !259}
!259 = !DILocation(line: 84, column: 3, scope: !201)
!260 = !DILocation(line: 85, column: 16, scope: !201)
!261 = !DILocation(line: 85, column: 21, scope: !201)
!262 = !DILocation(line: 85, column: 29, scope: !201)
!263 = !DILocation(line: 85, column: 3, scope: !201)
!264 = !DILocation(line: 86, column: 3, scope: !201)
!265 = !DILocation(line: 86, column: 13, scope: !201)
!266 = distinct !{!266, !196, !267}
!267 = !DILocation(line: 87, column: 2, scope: !112)
!268 = !DILocation(line: 89, column: 6, scope: !269)
!269 = distinct !DILexicalBlock(scope: !112, file: !3, line: 89, column: 6)
!270 = !DILocation(line: 89, column: 11, scope: !269)
!271 = !DILocation(line: 89, column: 6, scope: !112)
!272 = !DILocation(line: 90, column: 3, scope: !269)
!273 = !DILocation(line: 90, column: 13, scope: !269)
!274 = !DILocation(line: 90, column: 18, scope: !269)
!275 = !DILocation(line: 91, column: 6, scope: !276)
!276 = distinct !DILexicalBlock(scope: !112, file: !3, line: 91, column: 6)
!277 = !DILocation(line: 91, column: 11, scope: !276)
!278 = !DILocation(line: 91, column: 6, scope: !112)
!279 = !DILocation(line: 92, column: 3, scope: !276)
!280 = !DILocation(line: 92, column: 13, scope: !276)
!281 = !DILocation(line: 92, column: 18, scope: !276)
!282 = !DILocation(line: 93, column: 6, scope: !283)
!283 = distinct !DILexicalBlock(scope: !112, file: !3, line: 93, column: 6)
!284 = !DILocation(line: 93, column: 11, scope: !283)
!285 = !DILocation(line: 93, column: 6, scope: !112)
!286 = !DILocation(line: 94, column: 3, scope: !283)
!287 = !DILocation(line: 94, column: 13, scope: !283)
!288 = !DILocation(line: 94, column: 18, scope: !283)
!289 = !DILocation(line: 95, column: 6, scope: !290)
!290 = distinct !DILexicalBlock(scope: !112, file: !3, line: 95, column: 6)
!291 = !DILocation(line: 95, column: 11, scope: !290)
!292 = !DILocation(line: 95, column: 6, scope: !112)
!293 = !DILocation(line: 96, column: 3, scope: !290)
!294 = !DILocation(line: 96, column: 13, scope: !290)
!295 = !DILocation(line: 96, column: 18, scope: !290)
!296 = !DILocation(line: 98, column: 2, scope: !112)
!297 = !DILocation(line: 98, column: 12, scope: !112)
!298 = !DILocation(line: 99, column: 1, scope: !112)
!299 = distinct !DISubprogram(name: "render_result_free_list", scope: !3, file: !3, line: 102, type: !300, scopeLine: 103, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !33, retainedNodes: !104)
!300 = !DISubroutineType(types: !301)
!301 = !{null, !302, !115}
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!303 = !DILocalVariable(name: "lb", arg: 1, scope: !299, file: !3, line: 102, type: !302)
!304 = !DILocation(line: 102, column: 40, scope: !299)
!305 = !DILocalVariable(name: "rr", arg: 2, scope: !299, file: !3, line: 102, type: !115)
!306 = !DILocation(line: 102, column: 58, scope: !299)
!307 = !DILocalVariable(name: "rrnext", scope: !299, file: !3, line: 104, type: !115)
!308 = !DILocation(line: 104, column: 16, scope: !299)
!309 = !DILocation(line: 106, column: 2, scope: !299)
!310 = !DILocation(line: 106, column: 9, scope: !311)
!311 = distinct !DILexicalBlock(scope: !312, file: !3, line: 106, column: 2)
!312 = distinct !DILexicalBlock(scope: !299, file: !3, line: 106, column: 2)
!313 = !DILocation(line: 106, column: 2, scope: !312)
!314 = !DILocation(line: 107, column: 12, scope: !315)
!315 = distinct !DILexicalBlock(scope: !311, file: !3, line: 106, column: 26)
!316 = !DILocation(line: 107, column: 16, scope: !315)
!317 = !DILocation(line: 107, column: 10, scope: !315)
!318 = !DILocation(line: 109, column: 7, scope: !319)
!319 = distinct !DILexicalBlock(scope: !315, file: !3, line: 109, column: 7)
!320 = !DILocation(line: 109, column: 10, scope: !319)
!321 = !DILocation(line: 109, column: 13, scope: !319)
!322 = !DILocation(line: 109, column: 17, scope: !319)
!323 = !DILocation(line: 109, column: 7, scope: !315)
!324 = !DILocation(line: 110, column: 16, scope: !319)
!325 = !DILocation(line: 110, column: 20, scope: !319)
!326 = !DILocation(line: 110, column: 4, scope: !319)
!327 = !DILocation(line: 112, column: 22, scope: !315)
!328 = !DILocation(line: 112, column: 3, scope: !315)
!329 = !DILocation(line: 113, column: 2, scope: !315)
!330 = !DILocation(line: 106, column: 18, scope: !311)
!331 = !DILocation(line: 106, column: 16, scope: !311)
!332 = !DILocation(line: 106, column: 2, scope: !311)
!333 = distinct !{!333, !313, !334}
!334 = !DILocation(line: 113, column: 2, scope: !312)
!335 = !DILocation(line: 114, column: 1, scope: !299)
!336 = distinct !DISubprogram(name: "render_result_new", scope: !3, file: !3, line: 476, type: !337, scopeLine: 477, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !33, retainedNodes: !104)
!337 = !DISubroutineType(types: !338)
!338 = !{!120, !339, !2246, !17, !17, !2209}
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "Render", file: !10, line: 58, baseType: !341)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Render", file: !93, line: 126, size: 49920, elements: !342)
!342 = !{!343, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !365, !366, !367, !368, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !393, !396, !400, !401, !402, !403, !404, !405, !422, !427, !428, !429, !433, !551, !1946, !1948, !1950, !1951, !1952, !1953, !1954, !1957, !1960, !1963, !1966, !1967, !1968, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !2014, !2015, !2016, !2017, !2152, !2153, !2154, !2155, !2156, !2157, !2158, !2159, !2160, !2161, !2162, !2163, !2166, !2170, !2171, !2172, !2173, !2178, !2179, !2183, !2184, !2215, !2216, !2220, !2221, !2225, !2226, !2230, !2231, !2232, !2244, !2245}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !341, file: !93, line: 128, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !341, file: !93, line: 128, baseType: !344, size: 64, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !341, file: !93, line: 129, baseType: !161, size: 592, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !341, file: !93, line: 130, baseType: !17, size: 32, offset: 736)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !341, file: !93, line: 133, baseType: !125, size: 16, offset: 768)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "osa", scope: !341, file: !93, line: 133, baseType: !125, size: 16, offset: 784)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !341, file: !93, line: 133, baseType: !125, size: 16, offset: 800)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "result_ok", scope: !341, file: !93, line: 133, baseType: !125, size: 16, offset: 816)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "scene_color_manage", scope: !341, file: !93, line: 136, baseType: !102, size: 8, offset: 832)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !341, file: !93, line: 139, baseType: !115, size: 64, offset: 896)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "pushedresult", scope: !341, file: !93, line: 141, baseType: !115, size: 64, offset: 960)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "fullresult", scope: !341, file: !93, line: 143, baseType: !143, size: 128, offset: 1024)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "resultmutex", scope: !341, file: !93, line: 147, baseType: !357, size: 32, offset: 1152)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThreadRWMutex", file: !358, line: 148, baseType: !359)
!358 = !DIFile(filename: "blender/source/blender/blenlib/BLI_threads.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "spec_null_rwlock_t", file: !360, line: 10, baseType: !361)
!360 = !DIFile(filename: "include/spec_pthread.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !362, line: 26, baseType: !363)
!362 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !364, line: 42, baseType: !72)
!364 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!365 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !341, file: !93, line: 150, baseType: !17, size: 32, offset: 1184)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !341, file: !93, line: 150, baseType: !17, size: 32, offset: 1216)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "disprect", scope: !341, file: !93, line: 152, baseType: !132, size: 128, offset: 1248)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "viewplane", scope: !341, file: !93, line: 153, baseType: !369, size: 128, offset: 1376)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !133, line: 95, baseType: !370)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !133, line: 92, size: 128, elements: !371)
!371 = !{!372, !373, !374, !375}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !370, file: !133, line: 93, baseType: !29, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !370, file: !133, line: 93, baseType: !29, size: 32, offset: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !370, file: !133, line: 94, baseType: !29, size: 32, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !370, file: !133, line: 94, baseType: !29, size: 32, offset: 96)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "viewdx", scope: !341, file: !93, line: 154, baseType: !29, size: 32, offset: 1504)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "viewdy", scope: !341, file: !93, line: 154, baseType: !29, size: 32, offset: 1536)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "clipcrop", scope: !341, file: !93, line: 155, baseType: !29, size: 32, offset: 1568)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "rectx", scope: !341, file: !93, line: 158, baseType: !17, size: 32, offset: 1600)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "recty", scope: !341, file: !93, line: 158, baseType: !17, size: 32, offset: 1632)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "partx", scope: !341, file: !93, line: 162, baseType: !17, size: 32, offset: 1664)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "party", scope: !341, file: !93, line: 162, baseType: !17, size: 32, offset: 1696)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ycor", scope: !341, file: !93, line: 165, baseType: !29, size: 32, offset: 1728)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "panophi", scope: !341, file: !93, line: 167, baseType: !29, size: 32, offset: 1760)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "panosi", scope: !341, file: !93, line: 167, baseType: !29, size: 32, offset: 1792)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "panoco", scope: !341, file: !93, line: 167, baseType: !29, size: 32, offset: 1824)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "panodxp", scope: !341, file: !93, line: 167, baseType: !29, size: 32, offset: 1856)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "panodxv", scope: !341, file: !93, line: 167, baseType: !29, size: 32, offset: 1888)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "grvec", scope: !341, file: !93, line: 170, baseType: !390, size: 96, offset: 1920)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 96, elements: !391)
!391 = !{!392}
!392 = !DISubrange(count: 3)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !341, file: !93, line: 171, baseType: !394, size: 288, offset: 2016)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 288, elements: !395)
!395 = !{!392, !392}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "viewmat", scope: !341, file: !93, line: 172, baseType: !397, size: 512, offset: 2304)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 512, elements: !398)
!398 = !{!399, !399}
!399 = !DISubrange(count: 4)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "viewinv", scope: !341, file: !93, line: 172, baseType: !397, size: 512, offset: 2816)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "viewmat_orig", scope: !341, file: !93, line: 173, baseType: !397, size: 512, offset: 3328)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "winmat", scope: !341, file: !93, line: 174, baseType: !397, size: 512, offset: 3840)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "clipsta", scope: !341, file: !93, line: 177, baseType: !29, size: 32, offset: 4352)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "clipend", scope: !341, file: !93, line: 178, baseType: !29, size: 32, offset: 4384)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !341, file: !93, line: 181, baseType: !406, size: 64, offset: 4416)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "SampleTables", file: !93, line: 77, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SampleTables", file: !93, line: 72, size: 3776, elements: !409)
!409 = !{!410, !412, !416, !417, !421}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "centLut", scope: !408, file: !93, line: 73, baseType: !411, size: 512)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 512, elements: !106)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "fmask1", scope: !408, file: !93, line: 74, baseType: !413, size: 576, offset: 512)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 576, elements: !414)
!414 = !{!415}
!415 = !DISubrange(count: 9)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "fmask2", scope: !408, file: !93, line: 74, baseType: !413, size: 576, offset: 1088)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "cmask", scope: !408, file: !93, line: 75, baseType: !418, size: 2048, offset: 1664)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 2048, elements: !419)
!419 = !{!420}
!420 = !DISubrange(count: 256)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "centmask", scope: !408, file: !93, line: 75, baseType: !6, size: 64, offset: 3712)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "jit", scope: !341, file: !93, line: 182, baseType: !423, size: 2048, offset: 4480)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 2048, elements: !424)
!424 = !{!425, !426}
!425 = !DISubrange(count: 32)
!426 = !DISubrange(count: 2)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "mblur_jit", scope: !341, file: !93, line: 183, baseType: !423, size: 2048, offset: 6528)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "qmcsamplers", scope: !341, file: !93, line: 184, baseType: !302, size: 64, offset: 8576)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "shadowsamplenr", scope: !341, file: !93, line: 187, baseType: !430, size: 32, offset: 8640)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 32, elements: !431)
!431 = !{!432}
!432 = !DISubrange(count: 1)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !341, file: !93, line: 190, baseType: !434, size: 64, offset: 8704)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Main", file: !436, line: 53, size: 15232, elements: !437)
!436 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_main.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!437 = !{!438, !439, !440, !444, !445, !446, !447, !448, !452, !453, !454, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !548}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !435, file: !436, line: 54, baseType: !434, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !435, file: !436, line: 54, baseType: !434, size: 64, offset: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !435, file: !436, line: 55, baseType: !441, size: 8192, offset: 128)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 8192, elements: !442)
!442 = !{!443}
!443 = !DISubrange(count: 1024)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "versionfile", scope: !435, file: !436, line: 56, baseType: !125, size: 16, offset: 8320)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "subversionfile", scope: !435, file: !436, line: 56, baseType: !125, size: 16, offset: 8336)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "minversionfile", scope: !435, file: !436, line: 57, baseType: !125, size: 16, offset: 8352)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "minsubversionfile", scope: !435, file: !436, line: 57, baseType: !125, size: 16, offset: 8368)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "build_commit_timestamp", scope: !435, file: !436, line: 58, baseType: !449, size: 64, offset: 8384)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !362, line: 27, baseType: !450)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !364, line: 45, baseType: !451)
!451 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "build_hash", scope: !435, file: !436, line: 59, baseType: !105, size: 128, offset: 8448)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", scope: !435, file: !436, line: 60, baseType: !125, size: 16, offset: 8576)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "curlib", scope: !435, file: !436, line: 62, baseType: !455, size: 64, offset: 8640)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !457, line: 136, size: 17600, elements: !458)
!457 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!458 = !{!459, !499, !501, !504, !505, !506, !507}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !456, file: !457, line: 137, baseType: !460, size: 960)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !457, line: 130, baseType: !461)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !457, line: 117, size: 960, elements: !462)
!462 = !{!463, !464, !465, !467, !468, !472, !473, !474, !475, !476}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !461, file: !457, line: 118, baseType: !99, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !461, file: !457, line: 118, baseType: !99, size: 64, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !461, file: !457, line: 119, baseType: !466, size: 64, offset: 128)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !461, file: !457, line: 120, baseType: !455, size: 64, offset: 192)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !461, file: !457, line: 121, baseType: !469, size: 528, offset: 256)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 528, elements: !470)
!470 = !{!471}
!471 = !DISubrange(count: 66)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !461, file: !457, line: 126, baseType: !125, size: 16, offset: 784)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !461, file: !457, line: 127, baseType: !17, size: 32, offset: 800)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !461, file: !457, line: 128, baseType: !17, size: 32, offset: 832)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !461, file: !457, line: 128, baseType: !17, size: 32, offset: 864)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !461, file: !457, line: 129, baseType: !477, size: 64, offset: 896)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !457, line: 75, baseType: !479)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !457, line: 62, size: 1024, elements: !480)
!480 = !{!481, !483, !484, !485, !486, !487, !488, !489, !497, !498}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !479, file: !457, line: 63, baseType: !482, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !479, file: !457, line: 63, baseType: !482, size: 64, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !479, file: !457, line: 64, baseType: !7, size: 8, offset: 128)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !479, file: !457, line: 64, baseType: !7, size: 8, offset: 136)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !479, file: !457, line: 65, baseType: !125, size: 16, offset: 144)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !479, file: !457, line: 66, baseType: !20, size: 512, offset: 160)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !479, file: !457, line: 67, baseType: !17, size: 32, offset: 672)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !479, file: !457, line: 69, baseType: !490, size: 256, offset: 704)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !457, line: 60, baseType: !491)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !457, line: 48, size: 256, elements: !492)
!492 = !{!493, !494, !495, !496}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !491, file: !457, line: 49, baseType: !99, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !491, file: !457, line: 58, baseType: !143, size: 128, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !491, file: !457, line: 59, baseType: !17, size: 32, offset: 192)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !491, file: !457, line: 59, baseType: !17, size: 32, offset: 224)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !479, file: !457, line: 70, baseType: !17, size: 32, offset: 960)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !479, file: !457, line: 74, baseType: !17, size: 32, offset: 992)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !456, file: !457, line: 138, baseType: !500, size: 64, offset: 960)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !456, file: !457, line: 139, baseType: !502, size: 64, offset: 1024)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !457, line: 43, flags: DIFlagFwdDecl)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !456, file: !457, line: 140, baseType: !441, size: 8192, offset: 1088)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !456, file: !457, line: 141, baseType: !441, size: 8192, offset: 9280)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !456, file: !457, line: 148, baseType: !455, size: 64, offset: 17472)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !456, file: !457, line: 150, baseType: !508, size: 64, offset: 17536)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !457, line: 45, flags: DIFlagFwdDecl)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !435, file: !436, line: 63, baseType: !143, size: 128, offset: 8704)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "library", scope: !435, file: !436, line: 64, baseType: !143, size: 128, offset: 8832)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !435, file: !436, line: 65, baseType: !143, size: 128, offset: 8960)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "mesh", scope: !435, file: !436, line: 66, baseType: !143, size: 128, offset: 9088)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !435, file: !436, line: 67, baseType: !143, size: 128, offset: 9216)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "mball", scope: !435, file: !436, line: 68, baseType: !143, size: 128, offset: 9344)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !435, file: !436, line: 69, baseType: !143, size: 128, offset: 9472)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !435, file: !436, line: 70, baseType: !143, size: 128, offset: 9600)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !435, file: !436, line: 71, baseType: !143, size: 128, offset: 9728)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "latt", scope: !435, file: !436, line: 72, baseType: !143, size: 128, offset: 9856)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "lamp", scope: !435, file: !436, line: 73, baseType: !143, size: 128, offset: 9984)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !435, file: !436, line: 74, baseType: !143, size: 128, offset: 10112)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !435, file: !436, line: 75, baseType: !143, size: 128, offset: 10240)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !435, file: !436, line: 76, baseType: !143, size: 128, offset: 10368)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !435, file: !436, line: 77, baseType: !143, size: 128, offset: 10496)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !435, file: !436, line: 78, baseType: !143, size: 128, offset: 10624)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !435, file: !436, line: 79, baseType: !143, size: 128, offset: 10752)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "vfont", scope: !435, file: !436, line: 80, baseType: !143, size: 128, offset: 10880)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !435, file: !436, line: 81, baseType: !143, size: 128, offset: 11008)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "speaker", scope: !435, file: !436, line: 82, baseType: !143, size: 128, offset: 11136)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !435, file: !436, line: 83, baseType: !143, size: 128, offset: 11264)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !435, file: !436, line: 84, baseType: !143, size: 128, offset: 11392)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "armature", scope: !435, file: !436, line: 85, baseType: !143, size: 128, offset: 11520)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !435, file: !436, line: 86, baseType: !143, size: 128, offset: 11648)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !435, file: !436, line: 87, baseType: !143, size: 128, offset: 11776)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !435, file: !436, line: 88, baseType: !143, size: 128, offset: 11904)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !435, file: !436, line: 89, baseType: !143, size: 128, offset: 12032)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "palettes", scope: !435, file: !436, line: 90, baseType: !143, size: 128, offset: 12160)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "paintcurves", scope: !435, file: !436, line: 91, baseType: !143, size: 128, offset: 12288)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "wm", scope: !435, file: !436, line: 92, baseType: !143, size: 128, offset: 12416)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil", scope: !435, file: !436, line: 93, baseType: !143, size: 128, offset: 12544)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "movieclip", scope: !435, file: !436, line: 94, baseType: !143, size: 128, offset: 12672)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !435, file: !436, line: 95, baseType: !143, size: 128, offset: 12800)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "linestyle", scope: !435, file: !436, line: 96, baseType: !143, size: 128, offset: 12928)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "id_tag_update", scope: !435, file: !436, line: 98, baseType: !418, size: 2048, offset: 13056)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "eval_ctx", scope: !435, file: !436, line: 101, baseType: !546, size: 64, offset: 15104)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DICompositeType(tag: DW_TAG_structure_type, name: "EvaluationContext", file: !436, line: 49, flags: DIFlagFwdDecl)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !435, file: !436, line: 103, baseType: !549, size: 64, offset: 15168)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "MainLock", file: !436, line: 51, flags: DIFlagFwdDecl)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !341, file: !93, line: 191, baseType: !552, size: 64, offset: 8768)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "Scene", file: !36, line: 1299, baseType: !554)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !36, line: 1216, size: 39680, elements: !555)
!555 = !{!556, !557, !560, !834, !1335, !1336, !1337, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1364, !1575, !1578, !1820, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1842, !1843, !1844, !1845, !1846, !1854, !1920, !1927, !1928, !1935, !1938, !1939, !1940, !1941, !1942, !1943}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !554, file: !36, line: 1217, baseType: !460, size: 960)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !554, file: !36, line: 1218, baseType: !558, size: 64, offset: 960)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !36, line: 58, flags: DIFlagFwdDecl)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !554, file: !36, line: 1220, baseType: !561, size: 64, offset: 1024)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !563, line: 115, size: 11392, elements: !564)
!563 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!564 = !{!565, !566, !567, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !585, !594, !608, !609, !650, !651, !654, !655, !671, !672, !673, !674, !675, !676, !677, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !756, !757, !758, !759, !760, !761, !762, !763, !764, !767, !770, !771, !772, !773, !774, !775, !778, !781, !784, !785, !786, !787, !788, !789, !790, !791, !792, !795, !798, !801, !822, !823}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !562, file: !563, line: 116, baseType: !460, size: 960)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !562, file: !563, line: 117, baseType: !558, size: 64, offset: 960)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !562, file: !563, line: 119, baseType: !568, size: 64, offset: 1024)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !563, line: 57, flags: DIFlagFwdDecl)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !562, file: !563, line: 121, baseType: !125, size: 16, offset: 1088)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !562, file: !563, line: 121, baseType: !125, size: 16, offset: 1104)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !562, file: !563, line: 122, baseType: !17, size: 32, offset: 1120)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !562, file: !563, line: 122, baseType: !17, size: 32, offset: 1152)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !562, file: !563, line: 122, baseType: !17, size: 32, offset: 1184)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !562, file: !563, line: 123, baseType: !20, size: 512, offset: 1216)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !562, file: !563, line: 124, baseType: !561, size: 64, offset: 1728)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !562, file: !563, line: 124, baseType: !561, size: 64, offset: 1792)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !562, file: !563, line: 127, baseType: !561, size: 64, offset: 1856)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !562, file: !563, line: 127, baseType: !561, size: 64, offset: 1920)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !562, file: !563, line: 127, baseType: !561, size: 64, offset: 1984)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !562, file: !563, line: 128, baseType: !582, size: 64, offset: 2048)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !584, line: 40, flags: DIFlagFwdDecl)
!584 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!585 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !562, file: !563, line: 130, baseType: !586, size: 64, offset: 2112)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !563, line: 97, size: 832, elements: !588)
!588 = !{!589, !592, !593}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !587, file: !563, line: 98, baseType: !590, size: 768)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 768, elements: !591)
!591 = !{!26, !392}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !587, file: !563, line: 99, baseType: !17, size: 32, offset: 768)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !587, file: !563, line: 99, baseType: !17, size: 32, offset: 800)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !562, file: !563, line: 131, baseType: !595, size: 64, offset: 2176)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !597, line: 486, size: 1600, elements: !598)
!597 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!598 = !{!599, !600, !601, !602, !603, !604, !605, !606, !607}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !596, file: !597, line: 487, baseType: !460, size: 960)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !596, file: !597, line: 489, baseType: !143, size: 128, offset: 960)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !596, file: !597, line: 490, baseType: !143, size: 128, offset: 1088)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !596, file: !597, line: 491, baseType: !143, size: 128, offset: 1216)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !596, file: !597, line: 492, baseType: !143, size: 128, offset: 1344)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !596, file: !597, line: 494, baseType: !17, size: 32, offset: 1472)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !596, file: !597, line: 495, baseType: !17, size: 32, offset: 1504)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !596, file: !597, line: 497, baseType: !17, size: 32, offset: 1536)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !596, file: !597, line: 498, baseType: !17, size: 32, offset: 1568)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !562, file: !563, line: 132, baseType: !595, size: 64, offset: 2240)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !562, file: !563, line: 133, baseType: !610, size: 64, offset: 2304)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !597, line: 334, size: 1728, elements: !612)
!612 = !{!613, !614, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !649}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !611, file: !597, line: 335, baseType: !143, size: 128)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !611, file: !597, line: 336, baseType: !615, size: 64, offset: 128)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !597, line: 47, flags: DIFlagFwdDecl)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !611, file: !597, line: 338, baseType: !125, size: 16, offset: 192)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !611, file: !597, line: 338, baseType: !125, size: 16, offset: 208)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !611, file: !597, line: 339, baseType: !72, size: 32, offset: 224)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !611, file: !597, line: 340, baseType: !17, size: 32, offset: 256)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !611, file: !597, line: 342, baseType: !29, size: 32, offset: 288)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !611, file: !597, line: 343, baseType: !390, size: 96, offset: 320)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !611, file: !597, line: 344, baseType: !390, size: 96, offset: 416)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !611, file: !597, line: 347, baseType: !143, size: 128, offset: 512)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !611, file: !597, line: 349, baseType: !17, size: 32, offset: 640)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !611, file: !597, line: 350, baseType: !17, size: 32, offset: 672)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !611, file: !597, line: 351, baseType: !99, size: 64, offset: 704)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !611, file: !597, line: 352, baseType: !99, size: 64, offset: 768)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !611, file: !597, line: 354, baseType: !630, size: 384, offset: 832)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !597, line: 116, baseType: !631)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !597, line: 94, size: 384, elements: !632)
!632 = !{!633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !631, file: !597, line: 96, baseType: !17, size: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !631, file: !597, line: 96, baseType: !17, size: 32, offset: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !631, file: !597, line: 97, baseType: !17, size: 32, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !631, file: !597, line: 97, baseType: !17, size: 32, offset: 96)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !631, file: !597, line: 99, baseType: !125, size: 16, offset: 128)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !631, file: !597, line: 100, baseType: !125, size: 16, offset: 144)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !631, file: !597, line: 102, baseType: !125, size: 16, offset: 160)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !631, file: !597, line: 105, baseType: !125, size: 16, offset: 176)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !631, file: !597, line: 108, baseType: !125, size: 16, offset: 192)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !631, file: !597, line: 109, baseType: !125, size: 16, offset: 208)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !631, file: !597, line: 111, baseType: !125, size: 16, offset: 224)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !631, file: !597, line: 112, baseType: !125, size: 16, offset: 240)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !631, file: !597, line: 114, baseType: !17, size: 32, offset: 256)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !631, file: !597, line: 114, baseType: !17, size: 32, offset: 288)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !631, file: !597, line: 115, baseType: !17, size: 32, offset: 320)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !631, file: !597, line: 115, baseType: !17, size: 32, offset: 352)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !611, file: !597, line: 355, baseType: !20, size: 512, offset: 1216)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !562, file: !563, line: 134, baseType: !99, size: 64, offset: 2368)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !562, file: !563, line: 136, baseType: !652, size: 64, offset: 2432)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !36, line: 61, flags: DIFlagFwdDecl)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !562, file: !563, line: 138, baseType: !630, size: 384, offset: 2496)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !562, file: !563, line: 139, baseType: !656, size: 64, offset: 2880)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !597, line: 80, baseType: !658)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !597, line: 72, size: 192, elements: !659)
!659 = !{!660, !667, !668, !669, !670}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !658, file: !597, line: 73, baseType: !661, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !597, line: 59, baseType: !663)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !597, line: 56, size: 128, elements: !664)
!664 = !{!665, !666}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !663, file: !597, line: 57, baseType: !390, size: 96)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !663, file: !597, line: 58, baseType: !17, size: 32, offset: 96)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !658, file: !597, line: 74, baseType: !17, size: 32, offset: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !658, file: !597, line: 76, baseType: !17, size: 32, offset: 96)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !658, file: !597, line: 77, baseType: !17, size: 32, offset: 128)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !658, file: !597, line: 79, baseType: !17, size: 32, offset: 160)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !562, file: !563, line: 141, baseType: !143, size: 128, offset: 2944)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !562, file: !563, line: 142, baseType: !143, size: 128, offset: 3072)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !562, file: !563, line: 143, baseType: !143, size: 128, offset: 3200)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !562, file: !563, line: 144, baseType: !143, size: 128, offset: 3328)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !562, file: !563, line: 146, baseType: !17, size: 32, offset: 3456)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !562, file: !563, line: 147, baseType: !17, size: 32, offset: 3488)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !562, file: !563, line: 150, baseType: !678, size: 64, offset: 3520)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !562, file: !563, line: 151, baseType: !6, size: 64, offset: 3584)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !562, file: !563, line: 152, baseType: !17, size: 32, offset: 3648)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !562, file: !563, line: 153, baseType: !17, size: 32, offset: 3680)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !562, file: !563, line: 156, baseType: !390, size: 96, offset: 3712)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !562, file: !563, line: 156, baseType: !390, size: 96, offset: 3808)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !562, file: !563, line: 156, baseType: !390, size: 96, offset: 3904)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !562, file: !563, line: 157, baseType: !390, size: 96, offset: 4000)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !562, file: !563, line: 158, baseType: !390, size: 96, offset: 4096)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !562, file: !563, line: 159, baseType: !390, size: 96, offset: 4192)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !562, file: !563, line: 160, baseType: !390, size: 96, offset: 4288)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !562, file: !563, line: 160, baseType: !390, size: 96, offset: 4384)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !562, file: !563, line: 161, baseType: !691, size: 128, offset: 4480)
!691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 128, elements: !692)
!692 = !{!399}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !562, file: !563, line: 161, baseType: !691, size: 128, offset: 4608)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !562, file: !563, line: 162, baseType: !390, size: 96, offset: 4736)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !562, file: !563, line: 162, baseType: !390, size: 96, offset: 4832)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !562, file: !563, line: 163, baseType: !29, size: 32, offset: 4928)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !562, file: !563, line: 163, baseType: !29, size: 32, offset: 4960)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !562, file: !563, line: 164, baseType: !397, size: 512, offset: 4992)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !562, file: !563, line: 165, baseType: !397, size: 512, offset: 5504)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !562, file: !563, line: 166, baseType: !397, size: 512, offset: 6016)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !562, file: !563, line: 167, baseType: !397, size: 512, offset: 6528)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !562, file: !563, line: 176, baseType: !397, size: 512, offset: 7040)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !562, file: !563, line: 178, baseType: !72, size: 32, offset: 7552)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !562, file: !563, line: 180, baseType: !125, size: 16, offset: 7584)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !562, file: !563, line: 181, baseType: !125, size: 16, offset: 7600)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !562, file: !563, line: 183, baseType: !125, size: 16, offset: 7616)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !562, file: !563, line: 183, baseType: !125, size: 16, offset: 7632)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !562, file: !563, line: 184, baseType: !125, size: 16, offset: 7648)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !562, file: !563, line: 184, baseType: !125, size: 16, offset: 7664)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !562, file: !563, line: 185, baseType: !125, size: 16, offset: 7680)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !562, file: !563, line: 186, baseType: !125, size: 16, offset: 7696)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !562, file: !563, line: 187, baseType: !125, size: 16, offset: 7712)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !562, file: !563, line: 188, baseType: !7, size: 8, offset: 7728)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !562, file: !563, line: 189, baseType: !7, size: 8, offset: 7736)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !562, file: !563, line: 192, baseType: !17, size: 32, offset: 7744)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !562, file: !563, line: 192, baseType: !17, size: 32, offset: 7776)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !562, file: !563, line: 192, baseType: !17, size: 32, offset: 7808)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !562, file: !563, line: 192, baseType: !17, size: 32, offset: 7840)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !562, file: !563, line: 194, baseType: !17, size: 32, offset: 7872)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !562, file: !563, line: 202, baseType: !29, size: 32, offset: 7904)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !562, file: !563, line: 202, baseType: !29, size: 32, offset: 7936)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !562, file: !563, line: 202, baseType: !29, size: 32, offset: 7968)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !562, file: !563, line: 211, baseType: !29, size: 32, offset: 8000)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !562, file: !563, line: 212, baseType: !29, size: 32, offset: 8032)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !562, file: !563, line: 213, baseType: !29, size: 32, offset: 8064)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !562, file: !563, line: 214, baseType: !29, size: 32, offset: 8096)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !562, file: !563, line: 215, baseType: !29, size: 32, offset: 8128)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !562, file: !563, line: 216, baseType: !29, size: 32, offset: 8160)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !562, file: !563, line: 219, baseType: !29, size: 32, offset: 8192)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !562, file: !563, line: 220, baseType: !29, size: 32, offset: 8224)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !562, file: !563, line: 221, baseType: !29, size: 32, offset: 8256)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !562, file: !563, line: 224, baseType: !733, size: 16, offset: 8288)
!733 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !562, file: !563, line: 224, baseType: !733, size: 16, offset: 8304)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !562, file: !563, line: 226, baseType: !125, size: 16, offset: 8320)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !562, file: !563, line: 228, baseType: !7, size: 8, offset: 8336)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !562, file: !563, line: 229, baseType: !7, size: 8, offset: 8344)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !562, file: !563, line: 231, baseType: !125, size: 16, offset: 8352)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !562, file: !563, line: 232, baseType: !7, size: 8, offset: 8368)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !562, file: !563, line: 233, baseType: !7, size: 8, offset: 8376)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !562, file: !563, line: 234, baseType: !29, size: 32, offset: 8384)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !562, file: !563, line: 235, baseType: !29, size: 32, offset: 8416)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !562, file: !563, line: 237, baseType: !143, size: 128, offset: 8448)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !562, file: !563, line: 238, baseType: !143, size: 128, offset: 8576)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !562, file: !563, line: 239, baseType: !143, size: 128, offset: 8704)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !562, file: !563, line: 240, baseType: !143, size: 128, offset: 8832)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !562, file: !563, line: 242, baseType: !29, size: 32, offset: 8960)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !562, file: !563, line: 244, baseType: !125, size: 16, offset: 8992)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !562, file: !563, line: 245, baseType: !733, size: 16, offset: 9008)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !562, file: !563, line: 246, baseType: !691, size: 128, offset: 9024)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !562, file: !563, line: 248, baseType: !17, size: 32, offset: 9152)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !562, file: !563, line: 249, baseType: !17, size: 32, offset: 9184)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !562, file: !563, line: 251, baseType: !754, size: 64, offset: 9216)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !563, line: 251, flags: DIFlagFwdDecl)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !562, file: !563, line: 253, baseType: !7, size: 8, offset: 9280)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !562, file: !563, line: 254, baseType: !7, size: 8, offset: 9288)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !562, file: !563, line: 255, baseType: !125, size: 16, offset: 9296)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !562, file: !563, line: 256, baseType: !390, size: 96, offset: 9312)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !562, file: !563, line: 258, baseType: !143, size: 128, offset: 9408)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !562, file: !563, line: 259, baseType: !143, size: 128, offset: 9536)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !562, file: !563, line: 260, baseType: !143, size: 128, offset: 9664)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !562, file: !563, line: 261, baseType: !143, size: 128, offset: 9792)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !562, file: !563, line: 263, baseType: !765, size: 64, offset: 9920)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !563, line: 52, flags: DIFlagFwdDecl)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !562, file: !563, line: 264, baseType: !768, size: 64, offset: 9984)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !563, line: 53, flags: DIFlagFwdDecl)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !562, file: !563, line: 265, baseType: !174, size: 64, offset: 10048)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !562, file: !563, line: 267, baseType: !7, size: 8, offset: 10112)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !562, file: !563, line: 268, baseType: !7, size: 8, offset: 10120)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !562, file: !563, line: 269, baseType: !125, size: 16, offset: 10128)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !562, file: !563, line: 270, baseType: !29, size: 32, offset: 10144)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !562, file: !563, line: 272, baseType: !776, size: 64, offset: 10176)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !563, line: 54, flags: DIFlagFwdDecl)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !562, file: !563, line: 275, baseType: !779, size: 64, offset: 10240)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !563, line: 275, flags: DIFlagFwdDecl)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !562, file: !563, line: 277, baseType: !782, size: 64, offset: 10304)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !563, line: 56, flags: DIFlagFwdDecl)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !562, file: !563, line: 277, baseType: !782, size: 64, offset: 10368)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !562, file: !563, line: 278, baseType: !449, size: 64, offset: 10432)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !562, file: !563, line: 279, baseType: !449, size: 64, offset: 10496)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !562, file: !563, line: 280, baseType: !72, size: 32, offset: 10560)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !562, file: !563, line: 281, baseType: !72, size: 32, offset: 10592)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !562, file: !563, line: 283, baseType: !143, size: 128, offset: 10624)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !562, file: !563, line: 284, baseType: !143, size: 128, offset: 10752)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !562, file: !563, line: 285, baseType: !302, size: 64, offset: 10880)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !562, file: !563, line: 287, baseType: !793, size: 64, offset: 10944)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !563, line: 59, flags: DIFlagFwdDecl)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !562, file: !563, line: 288, baseType: !796, size: 64, offset: 11008)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !563, line: 288, flags: DIFlagFwdDecl)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !562, file: !563, line: 290, baseType: !799, size: 64, offset: 11072)
!799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 64, elements: !800)
!800 = !{!426}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !562, file: !563, line: 291, baseType: !802, size: 64, offset: 11136)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !804, line: 65, baseType: !805)
!804 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !804, line: 50, size: 320, elements: !806)
!806 = !{!807, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !805, file: !804, line: 51, baseType: !808, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !805, file: !804, line: 53, baseType: !17, size: 32, offset: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !805, file: !804, line: 54, baseType: !17, size: 32, offset: 96)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !805, file: !804, line: 55, baseType: !17, size: 32, offset: 128)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !805, file: !804, line: 55, baseType: !17, size: 32, offset: 160)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !805, file: !804, line: 56, baseType: !7, size: 8, offset: 192)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !805, file: !804, line: 56, baseType: !7, size: 8, offset: 200)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !805, file: !804, line: 57, baseType: !7, size: 8, offset: 208)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !805, file: !804, line: 57, baseType: !7, size: 8, offset: 216)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !805, file: !804, line: 59, baseType: !125, size: 16, offset: 224)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !805, file: !804, line: 59, baseType: !125, size: 16, offset: 240)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !805, file: !804, line: 59, baseType: !125, size: 16, offset: 256)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !805, file: !804, line: 61, baseType: !125, size: 16, offset: 272)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !805, file: !804, line: 63, baseType: !17, size: 32, offset: 288)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !562, file: !563, line: 293, baseType: !143, size: 128, offset: 11200)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !562, file: !563, line: 294, baseType: !824, size: 64, offset: 11328)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !563, line: 113, baseType: !826)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !563, line: 108, size: 256, elements: !827)
!827 = !{!828, !830, !831, !832, !833}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !826, file: !563, line: 109, baseType: !829, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !826, file: !563, line: 109, baseType: !829, size: 64, offset: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !826, file: !563, line: 110, baseType: !561, size: 64, offset: 128)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !826, file: !563, line: 111, baseType: !17, size: 32, offset: 192)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !826, file: !563, line: 112, baseType: !29, size: 32, offset: 224)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !554, file: !36, line: 1221, baseType: !835, size: 64, offset: 1088)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !584, line: 52, size: 4224, elements: !837)
!837 = !{!838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !1330, !1331, !1332, !1333, !1334}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !836, file: !584, line: 53, baseType: !460, size: 960)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !836, file: !584, line: 54, baseType: !558, size: 64, offset: 960)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !836, file: !584, line: 56, baseType: !125, size: 16, offset: 1024)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !836, file: !584, line: 56, baseType: !125, size: 16, offset: 1040)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !836, file: !584, line: 57, baseType: !125, size: 16, offset: 1056)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !836, file: !584, line: 57, baseType: !125, size: 16, offset: 1072)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !836, file: !584, line: 59, baseType: !29, size: 32, offset: 1088)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !836, file: !584, line: 59, baseType: !29, size: 32, offset: 1120)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !836, file: !584, line: 59, baseType: !29, size: 32, offset: 1152)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !836, file: !584, line: 60, baseType: !29, size: 32, offset: 1184)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !836, file: !584, line: 60, baseType: !29, size: 32, offset: 1216)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !836, file: !584, line: 60, baseType: !29, size: 32, offset: 1248)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !836, file: !584, line: 61, baseType: !29, size: 32, offset: 1280)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !836, file: !584, line: 61, baseType: !29, size: 32, offset: 1312)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !836, file: !584, line: 61, baseType: !29, size: 32, offset: 1344)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !836, file: !584, line: 68, baseType: !29, size: 32, offset: 1376)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !836, file: !584, line: 68, baseType: !29, size: 32, offset: 1408)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !836, file: !584, line: 68, baseType: !29, size: 32, offset: 1440)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !836, file: !584, line: 69, baseType: !29, size: 32, offset: 1472)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !836, file: !584, line: 69, baseType: !29, size: 32, offset: 1504)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !836, file: !584, line: 74, baseType: !29, size: 32, offset: 1536)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !836, file: !584, line: 79, baseType: !29, size: 32, offset: 1568)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !836, file: !584, line: 81, baseType: !125, size: 16, offset: 1600)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !836, file: !584, line: 91, baseType: !125, size: 16, offset: 1616)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !836, file: !584, line: 92, baseType: !125, size: 16, offset: 1632)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !836, file: !584, line: 93, baseType: !125, size: 16, offset: 1648)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !836, file: !584, line: 94, baseType: !125, size: 16, offset: 1664)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !836, file: !584, line: 94, baseType: !125, size: 16, offset: 1680)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !836, file: !584, line: 94, baseType: !125, size: 16, offset: 1696)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !836, file: !584, line: 94, baseType: !125, size: 16, offset: 1712)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !836, file: !584, line: 96, baseType: !29, size: 32, offset: 1728)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !836, file: !584, line: 96, baseType: !29, size: 32, offset: 1760)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !836, file: !584, line: 96, baseType: !29, size: 32, offset: 1792)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !836, file: !584, line: 96, baseType: !29, size: 32, offset: 1824)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !836, file: !584, line: 98, baseType: !29, size: 32, offset: 1856)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !836, file: !584, line: 98, baseType: !29, size: 32, offset: 1888)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !836, file: !584, line: 98, baseType: !29, size: 32, offset: 1920)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !836, file: !584, line: 98, baseType: !29, size: 32, offset: 1952)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !836, file: !584, line: 99, baseType: !29, size: 32, offset: 1984)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !836, file: !584, line: 99, baseType: !29, size: 32, offset: 2016)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !836, file: !584, line: 100, baseType: !29, size: 32, offset: 2048)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !836, file: !584, line: 100, baseType: !29, size: 32, offset: 2080)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !836, file: !584, line: 103, baseType: !125, size: 16, offset: 2112)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !836, file: !584, line: 103, baseType: !125, size: 16, offset: 2128)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !836, file: !584, line: 103, baseType: !125, size: 16, offset: 2144)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !836, file: !584, line: 103, baseType: !125, size: 16, offset: 2160)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !836, file: !584, line: 106, baseType: !29, size: 32, offset: 2176)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !836, file: !584, line: 106, baseType: !29, size: 32, offset: 2208)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !836, file: !584, line: 106, baseType: !29, size: 32, offset: 2240)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !836, file: !584, line: 106, baseType: !29, size: 32, offset: 2272)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !836, file: !584, line: 107, baseType: !125, size: 16, offset: 2304)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !836, file: !584, line: 107, baseType: !125, size: 16, offset: 2320)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !836, file: !584, line: 107, baseType: !125, size: 16, offset: 2336)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !836, file: !584, line: 107, baseType: !125, size: 16, offset: 2352)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !836, file: !584, line: 108, baseType: !29, size: 32, offset: 2368)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !836, file: !584, line: 108, baseType: !29, size: 32, offset: 2400)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !836, file: !584, line: 109, baseType: !29, size: 32, offset: 2432)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !836, file: !584, line: 109, baseType: !29, size: 32, offset: 2464)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !836, file: !584, line: 110, baseType: !29, size: 32, offset: 2496)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !836, file: !584, line: 110, baseType: !29, size: 32, offset: 2528)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !836, file: !584, line: 110, baseType: !29, size: 32, offset: 2560)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !836, file: !584, line: 111, baseType: !125, size: 16, offset: 2592)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !836, file: !584, line: 111, baseType: !125, size: 16, offset: 2608)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !836, file: !584, line: 112, baseType: !125, size: 16, offset: 2624)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !836, file: !584, line: 112, baseType: !125, size: 16, offset: 2640)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !836, file: !584, line: 112, baseType: !125, size: 16, offset: 2656)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !836, file: !584, line: 115, baseType: !125, size: 16, offset: 2672)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !836, file: !584, line: 118, baseType: !28, size: 64, offset: 2688)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !836, file: !584, line: 118, baseType: !28, size: 64, offset: 2752)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !836, file: !584, line: 121, baseType: !582, size: 64, offset: 2816)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !836, file: !584, line: 122, baseType: !909, size: 1152, offset: 2880)
!909 = !DICompositeType(tag: DW_TAG_array_type, baseType: !910, size: 1152, elements: !1328)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !912, line: 57, size: 2496, elements: !913)
