; ModuleID = 'blender_bin/source/blender/makesrna/intern/rna_cloth_gen.c'
source_filename = "blender_bin/source/blender/makesrna/intern/rna_cloth_gen.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.CollectionPropertyRNA = type { %struct.PropertyRNA, void (%struct.CollectionPropertyIterator*, %struct.PointerRNA*)*, void (%struct.CollectionPropertyIterator*)*, void (%struct.CollectionPropertyIterator*)*, void (%struct.PointerRNA*, %struct.CollectionPropertyIterator*)*, i32 (%struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32, %struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i8*, %struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32, %struct.PointerRNA*)*, %struct.StructRNA* }
%struct.PropertyRNA = type { %struct.PropertyRNA*, %struct.PropertyRNA*, i32, i8*, i32, i8*, i8*, i32, i8*, i32, i32, i32 (%struct.PointerRNA*, i32*)*, i32, [3 x i32], i32, void (%struct.Main*, %struct.Scene*, %struct.PointerRNA*)*, i32, i32 (%struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32)*, i32, i32, %struct.StructRNA*, i8* }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }

!57 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!58 = !{!59, !60, !61, !62}
!59 = !DIEnumerator(name: "OB_RECALC_OB", value: 1, isUnsigned: true)
!60 = !DIEnumerator(name: "OB_RECALC_DATA", value: 2, isUnsigned: true)
!61 = !DIEnumerator(name: "OB_RECALC_TIME", value: 4, isUnsigned: true)
!62 = !DIEnumerator(name: "OB_RECALC_ALL", value: 7, isUnsigned: true)
!63 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ModifierType", file: !64, line: 35, baseType: !7, size: 32, elements: !65)
!64 = !DIFile(filename: "blender/source/blender/makesdna/DNA_modifier_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!65 = !{!66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115}
!66 = !DIEnumerator(name: "eModifierType_None", value: 0, isUnsigned: true)
!67 = !DIEnumerator(name: "eModifierType_Subsurf", value: 1, isUnsigned: true)
!68 = !DIEnumerator(name: "eModifierType_Lattice", value: 2, isUnsigned: true)
!69 = !DIEnumerator(name: "eModifierType_Curve", value: 3, isUnsigned: true)
!70 = !DIEnumerator(name: "eModifierType_Build", value: 4, isUnsigned: true)
!71 = !DIEnumerator(name: "eModifierType_Mirror", value: 5, isUnsigned: true)
!72 = !DIEnumerator(name: "eModifierType_Decimate", value: 6, isUnsigned: true)
!73 = !DIEnumerator(name: "eModifierType_Wave", value: 7, isUnsigned: true)
!74 = !DIEnumerator(name: "eModifierType_Armature", value: 8, isUnsigned: true)
!75 = !DIEnumerator(name: "eModifierType_Hook", value: 9, isUnsigned: true)
!76 = !DIEnumerator(name: "eModifierType_Softbody", value: 10, isUnsigned: true)
!77 = !DIEnumerator(name: "eModifierType_Boolean", value: 11, isUnsigned: true)
!78 = !DIEnumerator(name: "eModifierType_Array", value: 12, isUnsigned: true)
!79 = !DIEnumerator(name: "eModifierType_EdgeSplit", value: 13, isUnsigned: true)
!80 = !DIEnumerator(name: "eModifierType_Displace", value: 14, isUnsigned: true)
!81 = !DIEnumerator(name: "eModifierType_UVProject", value: 15, isUnsigned: true)
!82 = !DIEnumerator(name: "eModifierType_Smooth", value: 16, isUnsigned: true)
!83 = !DIEnumerator(name: "eModifierType_Cast", value: 17, isUnsigned: true)
!84 = !DIEnumerator(name: "eModifierType_MeshDeform", value: 18, isUnsigned: true)
!85 = !DIEnumerator(name: "eModifierType_ParticleSystem", value: 19, isUnsigned: true)
!86 = !DIEnumerator(name: "eModifierType_ParticleInstance", value: 20, isUnsigned: true)
!87 = !DIEnumerator(name: "eModifierType_Explode", value: 21, isUnsigned: true)
!88 = !DIEnumerator(name: "eModifierType_Cloth", value: 22, isUnsigned: true)
!89 = !DIEnumerator(name: "eModifierType_Collision", value: 23, isUnsigned: true)
!90 = !DIEnumerator(name: "eModifierType_Bevel", value: 24, isUnsigned: true)
!91 = !DIEnumerator(name: "eModifierType_Shrinkwrap", value: 25, isUnsigned: true)
!92 = !DIEnumerator(name: "eModifierType_Fluidsim", value: 26, isUnsigned: true)
!93 = !DIEnumerator(name: "eModifierType_Mask", value: 27, isUnsigned: true)
!94 = !DIEnumerator(name: "eModifierType_SimpleDeform", value: 28, isUnsigned: true)
!95 = !DIEnumerator(name: "eModifierType_Multires", value: 29, isUnsigned: true)
!96 = !DIEnumerator(name: "eModifierType_Surface", value: 30, isUnsigned: true)
!97 = !DIEnumerator(name: "eModifierType_Smoke", value: 31, isUnsigned: true)
!98 = !DIEnumerator(name: "eModifierType_ShapeKey", value: 32, isUnsigned: true)
!99 = !DIEnumerator(name: "eModifierType_Solidify", value: 33, isUnsigned: true)
!100 = !DIEnumerator(name: "eModifierType_Screw", value: 34, isUnsigned: true)
!101 = !DIEnumerator(name: "eModifierType_Warp", value: 35, isUnsigned: true)
!102 = !DIEnumerator(name: "eModifierType_WeightVGEdit", value: 36, isUnsigned: true)
!103 = !DIEnumerator(name: "eModifierType_WeightVGMix", value: 37, isUnsigned: true)
!104 = !DIEnumerator(name: "eModifierType_WeightVGProximity", value: 38, isUnsigned: true)
!105 = !DIEnumerator(name: "eModifierType_Ocean", value: 39, isUnsigned: true)
!106 = !DIEnumerator(name: "eModifierType_DynamicPaint", value: 40, isUnsigned: true)
!107 = !DIEnumerator(name: "eModifierType_Remesh", value: 41, isUnsigned: true)
!108 = !DIEnumerator(name: "eModifierType_Skin", value: 42, isUnsigned: true)
!109 = !DIEnumerator(name: "eModifierType_LaplacianSmooth", value: 43, isUnsigned: true)
!110 = !DIEnumerator(name: "eModifierType_Triangulate", value: 44, isUnsigned: true)
!111 = !DIEnumerator(name: "eModifierType_UVWarp", value: 45, isUnsigned: true)
!112 = !DIEnumerator(name: "eModifierType_MeshCache", value: 46, isUnsigned: true)
!113 = !DIEnumerator(name: "eModifierType_LaplacianDeform", value: 47, isUnsigned: true)
!114 = !DIEnumerator(name: "eModifierType_Wireframe", value: 48, isUnsigned: true)
!115 = !DIEnumerator(name: "NUM_MODIFIER_TYPES", value: 49, isUnsigned: true)
!116 = !{!117, !1589, !417, !48, !1642, !275, !1660, !1662}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyRNA", file: !6, line: 333, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PropertyRNA", file: !120, line: 157, size: 1344, elements: !121)
!120 = !DIFile(filename: "blender/source/blender/makesrna/intern/rna_internal_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!121 = !{!122, !124, !125, !126, !130, !131, !132, !133, !134, !135, !137, !139, !516, !517, !521, !522, !1573, !1574, !1579, !1584, !1585, !1587, !1588}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !119, file: !120, line: 158, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !119, file: !120, line: 158, baseType: !123, size: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !119, file: !120, line: 161, baseType: !48, size: 32, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !119, file: !120, line: 164, baseType: !127, size: 64, offset: 192)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !129)
!129 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !119, file: !120, line: 166, baseType: !48, size: 32, offset: 256)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !119, file: !120, line: 169, baseType: !127, size: 64, offset: 320)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !119, file: !120, line: 171, baseType: !127, size: 64, offset: 384)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !119, file: !120, line: 173, baseType: !48, size: 32, offset: 448)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !119, file: !120, line: 175, baseType: !127, size: 64, offset: 512)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !119, file: !120, line: 178, baseType: !136, size: 32, offset: 576)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyType", file: !6, line: 79, baseType: !5)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !119, file: !120, line: 180, baseType: !138, size: 32, offset: 608)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertySubType", file: !6, line: 147, baseType: !16)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "getlength", scope: !119, file: !120, line: 182, baseType: !140, size: 64, offset: 640)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropArrayLengthGetFunc", file: !120, line: 73, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!48, !144, !462}
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !6, line: 55, size: 192, elements: !146)
!146 = !{!147, !152, !515}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !145, file: !6, line: 58, baseType: !148, size: 64)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !145, file: !6, line: 56, size: 64, elements: !149)
!149 = !{!150}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !148, file: !6, line: 57, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !145, file: !6, line: 60, baseType: !153, size: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !120, line: 339, size: 1600, elements: !155)
!155 = !{!156, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !189, !195, !497, !502, !508, !514}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !154, file: !120, line: 341, baseType: !157, size: 320)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "ContainerRNA", file: !120, line: 135, baseType: !158)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ContainerRNA", file: !120, line: 130, size: 320, elements: !159)
!159 = !{!160, !161, !162, !165}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !158, file: !120, line: 131, baseType: !151, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !158, file: !120, line: 131, baseType: !151, size: 64, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "prophash", scope: !158, file: !120, line: 133, baseType: !163, size: 64, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !120, line: 46, flags: DIFlagFwdDecl)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !158, file: !120, line: 134, baseType: !166, size: 128, offset: 192)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !167, line: 71, baseType: !168)
!167 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !167, line: 69, size: 128, elements: !169)
!169 = !{!170, !171}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !168, file: !167, line: 70, baseType: !151, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !168, file: !167, line: 70, baseType: !151, size: 64, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !154, file: !120, line: 344, baseType: !127, size: 64, offset: 320)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "py_type", scope: !154, file: !120, line: 348, baseType: !151, size: 64, offset: 384)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "blender_type", scope: !154, file: !120, line: 349, baseType: !151, size: 64, offset: 448)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !154, file: !120, line: 352, baseType: !48, size: 32, offset: 512)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !154, file: !120, line: 355, baseType: !127, size: 64, offset: 576)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !154, file: !120, line: 357, baseType: !127, size: 64, offset: 640)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !154, file: !120, line: 359, baseType: !127, size: 64, offset: 704)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !154, file: !120, line: 361, baseType: !48, size: 32, offset: 768)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nameproperty", scope: !154, file: !120, line: 364, baseType: !117, size: 64, offset: 832)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "iteratorproperty", scope: !154, file: !120, line: 367, baseType: !117, size: 64, offset: 896)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !154, file: !120, line: 370, baseType: !153, size: 64, offset: 960)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "nested", scope: !154, file: !120, line: 376, baseType: !153, size: 64, offset: 1024)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "refine", scope: !154, file: !120, line: 379, baseType: !185, size: 64, offset: 1088)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRefineFunc", file: !120, line: 70, baseType: !186)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{!153, !144}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !154, file: !120, line: 382, baseType: !190, size: 64, offset: 1152)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructPathFunc", file: !120, line: 71, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!194, !144}
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !154, file: !120, line: 385, baseType: !196, size: 64, offset: 1216)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRegisterFunc", file: !6, line: 410, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!153, !200, !332, !151, !127, !458, !463, !493}
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Main", file: !202, line: 53, size: 15232, elements: !203)
!202 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_main.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!203 = !{!204, !205, !206, !210, !212, !213, !214, !215, !221, !225, !226, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !323, !329}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !201, file: !202, line: 54, baseType: !200, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !201, file: !202, line: 54, baseType: !200, size: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !201, file: !202, line: 55, baseType: !207, size: 8192, offset: 128)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 8192, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 1024)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "versionfile", scope: !201, file: !202, line: 56, baseType: !211, size: 16, offset: 8320)
!211 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "subversionfile", scope: !201, file: !202, line: 56, baseType: !211, size: 16, offset: 8336)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "minversionfile", scope: !201, file: !202, line: 57, baseType: !211, size: 16, offset: 8352)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "minsubversionfile", scope: !201, file: !202, line: 57, baseType: !211, size: 16, offset: 8368)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "build_commit_timestamp", scope: !201, file: !202, line: 58, baseType: !216, size: 64, offset: 8384)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !217, line: 27, baseType: !218)
!217 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !219, line: 45, baseType: !220)
!219 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!220 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "build_hash", scope: !201, file: !202, line: 59, baseType: !222, size: 128, offset: 8448)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 128, elements: !223)
!223 = !{!224}
!224 = !DISubrange(count: 16)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", scope: !201, file: !202, line: 60, baseType: !211, size: 16, offset: 8576)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "curlib", scope: !201, file: !202, line: 62, baseType: !227, size: 64, offset: 8640)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !229, line: 136, size: 17600, elements: !230)
!229 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!230 = !{!231, !274, !276, !279, !280, !281, !282}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !228, file: !229, line: 137, baseType: !232, size: 960)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !229, line: 130, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !229, line: 117, size: 960, elements: !234)
!234 = !{!235, !236, !237, !239, !240, !244, !245, !246, !247, !248}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !233, file: !229, line: 118, baseType: !151, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !233, file: !229, line: 118, baseType: !151, size: 64, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !233, file: !229, line: 119, baseType: !238, size: 64, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !233, file: !229, line: 120, baseType: !227, size: 64, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !233, file: !229, line: 121, baseType: !241, size: 528, offset: 256)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 528, elements: !242)
!242 = !{!243}
!243 = !DISubrange(count: 66)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !233, file: !229, line: 126, baseType: !211, size: 16, offset: 784)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !233, file: !229, line: 127, baseType: !48, size: 32, offset: 800)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !233, file: !229, line: 128, baseType: !48, size: 32, offset: 832)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !233, file: !229, line: 128, baseType: !48, size: 32, offset: 864)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !233, file: !229, line: 129, baseType: !249, size: 64, offset: 896)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !229, line: 75, baseType: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !229, line: 62, size: 1024, elements: !252)
!252 = !{!253, !255, !256, !257, !258, !259, !263, !264, !272, !273}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !251, file: !229, line: 63, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !251, file: !229, line: 63, baseType: !254, size: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !251, file: !229, line: 64, baseType: !129, size: 8, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !251, file: !229, line: 64, baseType: !129, size: 8, offset: 136)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !251, file: !229, line: 65, baseType: !211, size: 16, offset: 144)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !251, file: !229, line: 66, baseType: !260, size: 512, offset: 160)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 512, elements: !261)
!261 = !{!262}
!262 = !DISubrange(count: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !251, file: !229, line: 67, baseType: !48, size: 32, offset: 672)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !251, file: !229, line: 69, baseType: !265, size: 256, offset: 704)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !229, line: 60, baseType: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !229, line: 48, size: 256, elements: !267)
!267 = !{!268, !269, !270, !271}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !266, file: !229, line: 49, baseType: !151, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !266, file: !229, line: 58, baseType: !166, size: 128, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !266, file: !229, line: 59, baseType: !48, size: 32, offset: 192)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !266, file: !229, line: 59, baseType: !48, size: 32, offset: 224)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !251, file: !229, line: 70, baseType: !48, size: 32, offset: 960)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !251, file: !229, line: 74, baseType: !48, size: 32, offset: 992)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !228, file: !229, line: 138, baseType: !275, size: 64, offset: 960)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !228, file: !229, line: 139, baseType: !277, size: 64, offset: 1024)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !229, line: 43, flags: DIFlagFwdDecl)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !228, file: !229, line: 140, baseType: !207, size: 8192, offset: 1088)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !228, file: !229, line: 141, baseType: !207, size: 8192, offset: 9280)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !228, file: !229, line: 148, baseType: !227, size: 64, offset: 17472)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !228, file: !229, line: 150, baseType: !283, size: 64, offset: 17536)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !229, line: 45, flags: DIFlagFwdDecl)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !201, file: !202, line: 63, baseType: !166, size: 128, offset: 8704)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "library", scope: !201, file: !202, line: 64, baseType: !166, size: 128, offset: 8832)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !201, file: !202, line: 65, baseType: !166, size: 128, offset: 8960)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "mesh", scope: !201, file: !202, line: 66, baseType: !166, size: 128, offset: 9088)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !201, file: !202, line: 67, baseType: !166, size: 128, offset: 9216)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "mball", scope: !201, file: !202, line: 68, baseType: !166, size: 128, offset: 9344)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !201, file: !202, line: 69, baseType: !166, size: 128, offset: 9472)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !201, file: !202, line: 70, baseType: !166, size: 128, offset: 9600)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !201, file: !202, line: 71, baseType: !166, size: 128, offset: 9728)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "latt", scope: !201, file: !202, line: 72, baseType: !166, size: 128, offset: 9856)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "lamp", scope: !201, file: !202, line: 73, baseType: !166, size: 128, offset: 9984)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !201, file: !202, line: 74, baseType: !166, size: 128, offset: 10112)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !201, file: !202, line: 75, baseType: !166, size: 128, offset: 10240)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !201, file: !202, line: 76, baseType: !166, size: 128, offset: 10368)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !201, file: !202, line: 77, baseType: !166, size: 128, offset: 10496)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !201, file: !202, line: 78, baseType: !166, size: 128, offset: 10624)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !201, file: !202, line: 79, baseType: !166, size: 128, offset: 10752)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "vfont", scope: !201, file: !202, line: 80, baseType: !166, size: 128, offset: 10880)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !201, file: !202, line: 81, baseType: !166, size: 128, offset: 11008)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "speaker", scope: !201, file: !202, line: 82, baseType: !166, size: 128, offset: 11136)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !201, file: !202, line: 83, baseType: !166, size: 128, offset: 11264)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !201, file: !202, line: 84, baseType: !166, size: 128, offset: 11392)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "armature", scope: !201, file: !202, line: 85, baseType: !166, size: 128, offset: 11520)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !201, file: !202, line: 86, baseType: !166, size: 128, offset: 11648)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !201, file: !202, line: 87, baseType: !166, size: 128, offset: 11776)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !201, file: !202, line: 88, baseType: !166, size: 128, offset: 11904)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !201, file: !202, line: 89, baseType: !166, size: 128, offset: 12032)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "palettes", scope: !201, file: !202, line: 90, baseType: !166, size: 128, offset: 12160)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "paintcurves", scope: !201, file: !202, line: 91, baseType: !166, size: 128, offset: 12288)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "wm", scope: !201, file: !202, line: 92, baseType: !166, size: 128, offset: 12416)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil", scope: !201, file: !202, line: 93, baseType: !166, size: 128, offset: 12544)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "movieclip", scope: !201, file: !202, line: 94, baseType: !166, size: 128, offset: 12672)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !201, file: !202, line: 95, baseType: !166, size: 128, offset: 12800)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "linestyle", scope: !201, file: !202, line: 96, baseType: !166, size: 128, offset: 12928)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "id_tag_update", scope: !201, file: !202, line: 98, baseType: !320, size: 2048, offset: 13056)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 2048, elements: !321)
!321 = !{!322}
!322 = !DISubrange(count: 256)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "eval_ctx", scope: !201, file: !202, line: 101, baseType: !324, size: 64, offset: 15104)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EvaluationContext", file: !326, line: 58, size: 32, elements: !327)
!326 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_depsgraph.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!327 = !{!328}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !325, file: !326, line: 59, baseType: !48, size: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !201, file: !202, line: 103, baseType: !330, size: 64, offset: 15168)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: "MainLock", file: !202, line: 51, flags: DIFlagFwdDecl)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !334, line: 106, size: 320, elements: !335)
!334 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!335 = !{!336, !337, !338, !339, !340, !341}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !333, file: !334, line: 107, baseType: !166, size: 128)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !333, file: !334, line: 108, baseType: !48, size: 32, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !333, file: !334, line: 109, baseType: !48, size: 32, offset: 160)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !333, file: !334, line: 110, baseType: !48, size: 32, offset: 192)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !333, file: !334, line: 110, baseType: !48, size: 32, offset: 224)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !333, file: !334, line: 111, baseType: !342, size: 64, offset: 256)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !344, line: 490, size: 768, elements: !345)
!344 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!345 = !{!346, !347, !348, !449, !450, !451, !452, !453, !454, !455, !456, !457}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !343, file: !344, line: 491, baseType: !342, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !343, file: !344, line: 491, baseType: !342, size: 64, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !343, file: !344, line: 493, baseType: !349, size: 64, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !334, line: 169, size: 2048, elements: !351)
!351 = !{!352, !353, !354, !355, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !424, !427, !441, !442, !443, !444, !445, !446, !447, !448}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !350, file: !334, line: 170, baseType: !349, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !350, file: !334, line: 170, baseType: !349, size: 64, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !350, file: !334, line: 172, baseType: !151, size: 64, offset: 128)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !350, file: !334, line: 174, baseType: !356, size: 64, offset: 192)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !358, line: 41, flags: DIFlagFwdDecl)
!358 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!359 = !DIDerivedType(tag: DW_TAG_member, name: "newscreen", scope: !350, file: !334, line: 175, baseType: !356, size: 64, offset: 256)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "screenname", scope: !350, file: !334, line: 176, baseType: !260, size: 512, offset: 320)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "posx", scope: !350, file: !334, line: 178, baseType: !211, size: 16, offset: 832)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "posy", scope: !350, file: !334, line: 178, baseType: !211, size: 16, offset: 848)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !350, file: !334, line: 178, baseType: !211, size: 16, offset: 864)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !350, file: !334, line: 178, baseType: !211, size: 16, offset: 880)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "windowstate", scope: !350, file: !334, line: 179, baseType: !211, size: 16, offset: 896)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !350, file: !334, line: 180, baseType: !211, size: 16, offset: 912)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !350, file: !334, line: 181, baseType: !211, size: 16, offset: 928)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !350, file: !334, line: 182, baseType: !211, size: 16, offset: 944)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "lastcursor", scope: !350, file: !334, line: 183, baseType: !211, size: 16, offset: 960)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "modalcursor", scope: !350, file: !334, line: 184, baseType: !211, size: 16, offset: 976)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "grabcursor", scope: !350, file: !334, line: 185, baseType: !211, size: 16, offset: 992)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "addmousemove", scope: !350, file: !334, line: 186, baseType: !211, size: 16, offset: 1008)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "winid", scope: !350, file: !334, line: 188, baseType: !48, size: 32, offset: 1024)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "lock_pie_event", scope: !350, file: !334, line: 190, baseType: !211, size: 16, offset: 1056)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "last_pie_event", scope: !350, file: !334, line: 191, baseType: !211, size: 16, offset: 1072)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "eventstate", scope: !350, file: !334, line: 194, baseType: !377, size: 64, offset: 1088)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmEvent", file: !344, line: 421, size: 960, elements: !379)
!379 = !{!380, !381, !382, !383, !384, !385, !386, !390, !394, !395, !396, !397, !398, !399, !400, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !420, !421, !422, !423}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !378, file: !344, line: 422, baseType: !377, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !378, file: !344, line: 422, baseType: !377, size: 64, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !378, file: !344, line: 424, baseType: !211, size: 16, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !378, file: !344, line: 425, baseType: !211, size: 16, offset: 144)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !378, file: !344, line: 426, baseType: !48, size: 32, offset: 160)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !378, file: !344, line: 426, baseType: !48, size: 32, offset: 192)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "mval", scope: !378, file: !344, line: 427, baseType: !387, size: 64, offset: 224)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 64, elements: !388)
!388 = !{!389}
!389 = !DISubrange(count: 2)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_buf", scope: !378, file: !344, line: 428, baseType: !391, size: 48, offset: 288)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 48, elements: !392)
!392 = !{!393}
!393 = !DISubrange(count: 6)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !378, file: !344, line: 431, baseType: !129, size: 8, offset: 336)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !378, file: !344, line: 432, baseType: !129, size: 8, offset: 344)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "prevtype", scope: !378, file: !344, line: 435, baseType: !211, size: 16, offset: 352)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "prevval", scope: !378, file: !344, line: 436, baseType: !211, size: 16, offset: 368)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "prevx", scope: !378, file: !344, line: 437, baseType: !48, size: 32, offset: 384)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "prevy", scope: !378, file: !344, line: 437, baseType: !48, size: 32, offset: 416)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicktime", scope: !378, file: !344, line: 438, baseType: !401, size: 64, offset: 448)
!401 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "prevclickx", scope: !378, file: !344, line: 439, baseType: !48, size: 32, offset: 512)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicky", scope: !378, file: !344, line: 439, baseType: !48, size: 32, offset: 544)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !378, file: !344, line: 442, baseType: !211, size: 16, offset: 576)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !378, file: !344, line: 442, baseType: !211, size: 16, offset: 592)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !378, file: !344, line: 442, baseType: !211, size: 16, offset: 608)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "oskey", scope: !378, file: !344, line: 442, baseType: !211, size: 16, offset: 624)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "keymodifier", scope: !378, file: !344, line: 443, baseType: !211, size: 16, offset: 640)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "check_click", scope: !378, file: !344, line: 446, baseType: !211, size: 16, offset: 656)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "keymap_idname", scope: !378, file: !344, line: 449, baseType: !127, size: 64, offset: 704)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "tablet_data", scope: !378, file: !344, line: 452, baseType: !412, size: 64, offset: 768)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTabletData", file: !344, line: 463, size: 128, elements: !414)
!414 = !{!415, !416, !418, !419}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "Active", scope: !413, file: !344, line: 464, baseType: !48, size: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "Pressure", scope: !413, file: !344, line: 465, baseType: !417, size: 32, offset: 32)
!417 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "Xtilt", scope: !413, file: !344, line: 466, baseType: !417, size: 32, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "Ytilt", scope: !413, file: !344, line: 467, baseType: !417, size: 32, offset: 96)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "custom", scope: !378, file: !344, line: 455, baseType: !211, size: 16, offset: 832)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "customdatafree", scope: !378, file: !344, line: 456, baseType: !211, size: 16, offset: 848)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !378, file: !344, line: 457, baseType: !48, size: 32, offset: 864)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !378, file: !344, line: 458, baseType: !151, size: 64, offset: 896)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "curswin", scope: !350, file: !334, line: 196, baseType: !425, size: 64, offset: 1152)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmSubWindow", file: !334, line: 55, flags: DIFlagFwdDecl)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "tweak", scope: !350, file: !334, line: 198, baseType: !428, size: 64, offset: 1216)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmGesture", file: !344, line: 398, size: 448, elements: !430)
!430 = !{!431, !432, !433, !434, !435, !436, !437, !438, !439, !440}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !429, file: !344, line: 399, baseType: !428, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !429, file: !344, line: 399, baseType: !428, size: 64, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !429, file: !344, line: 400, baseType: !48, size: 32, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !429, file: !344, line: 401, baseType: !48, size: 32, offset: 160)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !429, file: !344, line: 402, baseType: !48, size: 32, offset: 192)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "swinid", scope: !429, file: !344, line: 403, baseType: !48, size: 32, offset: 224)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !429, file: !344, line: 404, baseType: !48, size: 32, offset: 256)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !429, file: !344, line: 405, baseType: !48, size: 32, offset: 288)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !429, file: !344, line: 407, baseType: !151, size: 64, offset: 320)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !429, file: !344, line: 414, baseType: !151, size: 64, offset: 384)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "drawmethod", scope: !350, file: !334, line: 200, baseType: !48, size: 32, offset: 1280)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "drawfail", scope: !350, file: !334, line: 200, baseType: !48, size: 32, offset: 1312)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "drawdata", scope: !350, file: !334, line: 201, baseType: !151, size: 64, offset: 1344)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !350, file: !334, line: 203, baseType: !166, size: 128, offset: 1408)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !350, file: !334, line: 204, baseType: !166, size: 128, offset: 1536)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "modalhandlers", scope: !350, file: !334, line: 205, baseType: !166, size: 128, offset: 1664)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "subwindows", scope: !350, file: !334, line: 207, baseType: !166, size: 128, offset: 1792)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "gesture", scope: !350, file: !334, line: 208, baseType: !166, size: 128, offset: 1920)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "timestep", scope: !343, file: !344, line: 495, baseType: !401, size: 64, offset: 192)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !343, file: !344, line: 496, baseType: !48, size: 32, offset: 256)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !343, file: !344, line: 497, baseType: !151, size: 64, offset: 320)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !343, file: !344, line: 499, baseType: !401, size: 64, offset: 384)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !343, file: !344, line: 500, baseType: !401, size: 64, offset: 448)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "ltime", scope: !343, file: !344, line: 502, baseType: !401, size: 64, offset: 512)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "ntime", scope: !343, file: !344, line: 503, baseType: !401, size: 64, offset: 576)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !343, file: !344, line: 504, baseType: !401, size: 64, offset: 640)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "sleep", scope: !343, file: !344, line: 505, baseType: !48, size: 32, offset: 704)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructValidateFunc", file: !6, line: 407, baseType: !459)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DISubroutineType(types: !461)
!461 = !{!48, !144, !151, !462}
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !6, line: 408, baseType: !464)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DISubroutineType(types: !466)
!466 = !{!48, !467, !144, !469, !483}
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !6, line: 44, flags: DIFlagFwdDecl)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !120, line: 137, size: 640, elements: !471)
!471 = !{!472, !473, !474, !475, !476, !492}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !470, file: !120, line: 139, baseType: !157, size: 320)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !470, file: !120, line: 142, baseType: !127, size: 64, offset: 320)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !470, file: !120, line: 144, baseType: !48, size: 32, offset: 384)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !470, file: !120, line: 147, baseType: !127, size: 64, offset: 448)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !470, file: !120, line: 150, baseType: !477, size: 64, offset: 512)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "CallFunc", file: !6, line: 388, baseType: !478)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{null, !467, !332, !481, !483}
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "PointerRNA", file: !6, line: 62, baseType: !145)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !6, line: 348, baseType: !485)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !6, line: 337, size: 256, elements: !486)
!486 = !{!487, !488, !489, !490, !491}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !485, file: !6, line: 339, baseType: !151, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !485, file: !6, line: 342, baseType: !469, size: 64, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !485, file: !6, line: 345, baseType: !48, size: 32, offset: 128)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !485, file: !6, line: 347, baseType: !48, size: 32, offset: 160)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !485, file: !6, line: 347, baseType: !48, size: 32, offset: 192)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "c_ret", scope: !470, file: !120, line: 154, baseType: !117, size: 64, offset: 576)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !6, line: 409, baseType: !494)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DISubroutineType(types: !496)
!496 = !{null, !151}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "unreg", scope: !154, file: !120, line: 386, baseType: !498, size: 64, offset: 1280)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructUnregisterFunc", file: !6, line: 414, baseType: !499)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DISubroutineType(types: !501)
!501 = !{null, !200, !153}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !154, file: !120, line: 387, baseType: !503, size: 64, offset: 1344)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructInstanceFunc", file: !6, line: 415, baseType: !504)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DISubroutineType(types: !506)
!506 = !{!507, !481}
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "idproperties", scope: !154, file: !120, line: 390, baseType: !509, size: 64, offset: 1408)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertiesFunc", file: !120, line: 69, baseType: !510)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DISubroutineType(types: !512)
!512 = !{!254, !144, !513}
!513 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "functions", scope: !154, file: !120, line: 393, baseType: !166, size: 128, offset: 1472)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !145, file: !6, line: 61, baseType: !151, size: 64, offset: 128)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "arraydimension", scope: !119, file: !120, line: 184, baseType: !7, size: 32, offset: 704)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !119, file: !120, line: 186, baseType: !518, size: 96, offset: 736)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 96, elements: !519)
!519 = !{!520}
!520 = !DISubrange(count: 3)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "totarraylength", scope: !119, file: !120, line: 187, baseType: !7, size: 32, offset: 832)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !119, file: !120, line: 190, baseType: !523, size: 64, offset: 896)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "UpdateFunc", file: !120, line: 64, baseType: !524)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{null, !200, !527, !144}
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !529, line: 1216, size: 39680, elements: !530)
!529 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!530 = !{!531, !532, !535, !815, !818, !819, !820, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !846, !849, !852, !1147, !1150, !1446, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1468, !1469, !1470, !1471, !1472, !1480, !1547, !1554, !1555, !1562, !1565, !1566, !1567, !1568, !1569, !1570}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !528, file: !529, line: 1217, baseType: !232, size: 960)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !528, file: !529, line: 1218, baseType: !533, size: 64, offset: 960)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !529, line: 58, flags: DIFlagFwdDecl)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !528, file: !529, line: 1220, baseType: !536, size: 64, offset: 1024)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !57, line: 115, size: 11392, elements: !538)
!538 = !{!539, !540, !541, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !559, !569, !583, !584, !624, !625, !628, !629, !645, !646, !647, !648, !649, !650, !651, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !670, !671, !672, !673, !674, !675, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !735, !736, !737, !738, !739, !740, !741, !742, !743, !746, !749, !753, !754, !755, !756, !757, !760, !763, !766, !767, !768, !769, !770, !771, !772, !773, !775, !778, !781, !783, !803, !804}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !537, file: !57, line: 116, baseType: !232, size: 960)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !537, file: !57, line: 117, baseType: !533, size: 64, offset: 960)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !537, file: !57, line: 119, baseType: !542, size: 64, offset: 1024)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !57, line: 57, flags: DIFlagFwdDecl)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !537, file: !57, line: 121, baseType: !211, size: 16, offset: 1088)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !537, file: !57, line: 121, baseType: !211, size: 16, offset: 1104)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !537, file: !57, line: 122, baseType: !48, size: 32, offset: 1120)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !537, file: !57, line: 122, baseType: !48, size: 32, offset: 1152)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !537, file: !57, line: 122, baseType: !48, size: 32, offset: 1184)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !537, file: !57, line: 123, baseType: !260, size: 512, offset: 1216)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !537, file: !57, line: 124, baseType: !536, size: 64, offset: 1728)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !537, file: !57, line: 124, baseType: !536, size: 64, offset: 1792)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !537, file: !57, line: 127, baseType: !536, size: 64, offset: 1856)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !537, file: !57, line: 127, baseType: !536, size: 64, offset: 1920)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !537, file: !57, line: 127, baseType: !536, size: 64, offset: 1984)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !537, file: !57, line: 128, baseType: !556, size: 64, offset: 2048)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !558, line: 46, flags: DIFlagFwdDecl)
!558 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!559 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !537, file: !57, line: 130, baseType: !560, size: 64, offset: 2112)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !57, line: 97, size: 832, elements: !562)
!562 = !{!563, !567, !568}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !561, file: !57, line: 98, baseType: !564, size: 768)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, size: 768, elements: !565)
!565 = !{!566, !520}
!566 = !DISubrange(count: 8)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !561, file: !57, line: 99, baseType: !48, size: 32, offset: 768)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !561, file: !57, line: 99, baseType: !48, size: 32, offset: 800)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !537, file: !57, line: 131, baseType: !570, size: 64, offset: 2176)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !572, line: 486, size: 1600, elements: !573)
!572 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!573 = !{!574, !575, !576, !577, !578, !579, !580, !581, !582}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !571, file: !572, line: 487, baseType: !232, size: 960)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !571, file: !572, line: 489, baseType: !166, size: 128, offset: 960)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !571, file: !572, line: 490, baseType: !166, size: 128, offset: 1088)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !571, file: !572, line: 491, baseType: !166, size: 128, offset: 1216)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !571, file: !572, line: 492, baseType: !166, size: 128, offset: 1344)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !571, file: !572, line: 494, baseType: !48, size: 32, offset: 1472)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !571, file: !572, line: 495, baseType: !48, size: 32, offset: 1504)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !571, file: !572, line: 497, baseType: !48, size: 32, offset: 1536)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !571, file: !572, line: 498, baseType: !48, size: 32, offset: 1568)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !537, file: !57, line: 132, baseType: !570, size: 64, offset: 2240)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !537, file: !57, line: 133, baseType: !585, size: 64, offset: 2304)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !572, line: 334, size: 1728, elements: !587)
!587 = !{!588, !589, !590, !591, !592, !593, !594, !595, !597, !598, !599, !600, !601, !602, !603, !623}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !586, file: !572, line: 335, baseType: !166, size: 128)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !586, file: !572, line: 336, baseType: !163, size: 64, offset: 128)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !586, file: !572, line: 338, baseType: !211, size: 16, offset: 192)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !586, file: !572, line: 338, baseType: !211, size: 16, offset: 208)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !586, file: !572, line: 339, baseType: !7, size: 32, offset: 224)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !586, file: !572, line: 340, baseType: !48, size: 32, offset: 256)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !586, file: !572, line: 342, baseType: !417, size: 32, offset: 288)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !586, file: !572, line: 343, baseType: !596, size: 96, offset: 320)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, size: 96, elements: !519)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !586, file: !572, line: 344, baseType: !596, size: 96, offset: 416)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !586, file: !572, line: 347, baseType: !166, size: 128, offset: 512)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !586, file: !572, line: 349, baseType: !48, size: 32, offset: 640)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !586, file: !572, line: 350, baseType: !48, size: 32, offset: 672)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !586, file: !572, line: 351, baseType: !151, size: 64, offset: 704)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !586, file: !572, line: 352, baseType: !151, size: 64, offset: 768)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !586, file: !572, line: 354, baseType: !604, size: 384, offset: 832)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !572, line: 116, baseType: !605)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !572, line: 94, size: 384, elements: !606)
!606 = !{!607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !605, file: !572, line: 96, baseType: !48, size: 32)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !605, file: !572, line: 96, baseType: !48, size: 32, offset: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !605, file: !572, line: 97, baseType: !48, size: 32, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !605, file: !572, line: 97, baseType: !48, size: 32, offset: 96)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !605, file: !572, line: 99, baseType: !211, size: 16, offset: 128)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !605, file: !572, line: 100, baseType: !211, size: 16, offset: 144)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !605, file: !572, line: 102, baseType: !211, size: 16, offset: 160)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !605, file: !572, line: 105, baseType: !211, size: 16, offset: 176)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !605, file: !572, line: 108, baseType: !211, size: 16, offset: 192)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !605, file: !572, line: 109, baseType: !211, size: 16, offset: 208)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !605, file: !572, line: 111, baseType: !211, size: 16, offset: 224)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !605, file: !572, line: 112, baseType: !211, size: 16, offset: 240)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !605, file: !572, line: 114, baseType: !48, size: 32, offset: 256)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !605, file: !572, line: 114, baseType: !48, size: 32, offset: 288)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !605, file: !572, line: 115, baseType: !48, size: 32, offset: 320)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !605, file: !572, line: 115, baseType: !48, size: 32, offset: 352)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !586, file: !572, line: 355, baseType: !260, size: 512, offset: 1216)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !537, file: !57, line: 134, baseType: !151, size: 64, offset: 2368)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !537, file: !57, line: 136, baseType: !626, size: 64, offset: 2432)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !529, line: 61, flags: DIFlagFwdDecl)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !537, file: !57, line: 138, baseType: !604, size: 384, offset: 2496)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !537, file: !57, line: 139, baseType: !630, size: 64, offset: 2880)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !572, line: 80, baseType: !632)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !572, line: 72, size: 192, elements: !633)
!633 = !{!634, !641, !642, !643, !644}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !632, file: !572, line: 73, baseType: !635, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !572, line: 59, baseType: !637)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !572, line: 56, size: 128, elements: !638)
!638 = !{!639, !640}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !637, file: !572, line: 57, baseType: !596, size: 96)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !637, file: !572, line: 58, baseType: !48, size: 32, offset: 96)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !632, file: !572, line: 74, baseType: !48, size: 32, offset: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !632, file: !572, line: 76, baseType: !48, size: 32, offset: 96)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !632, file: !572, line: 77, baseType: !48, size: 32, offset: 128)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !632, file: !572, line: 79, baseType: !48, size: 32, offset: 160)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !537, file: !57, line: 141, baseType: !166, size: 128, offset: 2944)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !537, file: !57, line: 142, baseType: !166, size: 128, offset: 3072)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !537, file: !57, line: 143, baseType: !166, size: 128, offset: 3200)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !537, file: !57, line: 144, baseType: !166, size: 128, offset: 3328)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !537, file: !57, line: 146, baseType: !48, size: 32, offset: 3456)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !537, file: !57, line: 147, baseType: !48, size: 32, offset: 3488)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !537, file: !57, line: 150, baseType: !652, size: 64, offset: 3520)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !529, line: 179, flags: DIFlagFwdDecl)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !537, file: !57, line: 151, baseType: !194, size: 64, offset: 3584)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !537, file: !57, line: 152, baseType: !48, size: 32, offset: 3648)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !537, file: !57, line: 153, baseType: !48, size: 32, offset: 3680)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !537, file: !57, line: 156, baseType: !596, size: 96, offset: 3712)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !537, file: !57, line: 156, baseType: !596, size: 96, offset: 3808)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !537, file: !57, line: 156, baseType: !596, size: 96, offset: 3904)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !537, file: !57, line: 157, baseType: !596, size: 96, offset: 4000)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !537, file: !57, line: 158, baseType: !596, size: 96, offset: 4096)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !537, file: !57, line: 159, baseType: !596, size: 96, offset: 4192)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !537, file: !57, line: 160, baseType: !596, size: 96, offset: 4288)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !537, file: !57, line: 160, baseType: !596, size: 96, offset: 4384)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !537, file: !57, line: 161, baseType: !667, size: 128, offset: 4480)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, size: 128, elements: !668)
!668 = !{!669}
!669 = !DISubrange(count: 4)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !537, file: !57, line: 161, baseType: !667, size: 128, offset: 4608)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !537, file: !57, line: 162, baseType: !596, size: 96, offset: 4736)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !537, file: !57, line: 162, baseType: !596, size: 96, offset: 4832)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !537, file: !57, line: 163, baseType: !417, size: 32, offset: 4928)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !537, file: !57, line: 163, baseType: !417, size: 32, offset: 4960)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !537, file: !57, line: 164, baseType: !676, size: 512, offset: 4992)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, size: 512, elements: !677)
!677 = !{!669, !669}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !537, file: !57, line: 165, baseType: !676, size: 512, offset: 5504)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !537, file: !57, line: 166, baseType: !676, size: 512, offset: 6016)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !537, file: !57, line: 167, baseType: !676, size: 512, offset: 6528)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !537, file: !57, line: 176, baseType: !676, size: 512, offset: 7040)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !537, file: !57, line: 178, baseType: !7, size: 32, offset: 7552)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !537, file: !57, line: 180, baseType: !211, size: 16, offset: 7584)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !537, file: !57, line: 181, baseType: !211, size: 16, offset: 7600)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !537, file: !57, line: 183, baseType: !211, size: 16, offset: 7616)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !537, file: !57, line: 183, baseType: !211, size: 16, offset: 7632)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !537, file: !57, line: 184, baseType: !211, size: 16, offset: 7648)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !537, file: !57, line: 184, baseType: !211, size: 16, offset: 7664)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !537, file: !57, line: 185, baseType: !211, size: 16, offset: 7680)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !537, file: !57, line: 186, baseType: !211, size: 16, offset: 7696)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !537, file: !57, line: 187, baseType: !211, size: 16, offset: 7712)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !537, file: !57, line: 188, baseType: !129, size: 8, offset: 7728)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !537, file: !57, line: 189, baseType: !129, size: 8, offset: 7736)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !537, file: !57, line: 192, baseType: !48, size: 32, offset: 7744)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !537, file: !57, line: 192, baseType: !48, size: 32, offset: 7776)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !537, file: !57, line: 192, baseType: !48, size: 32, offset: 7808)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !537, file: !57, line: 192, baseType: !48, size: 32, offset: 7840)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !537, file: !57, line: 194, baseType: !48, size: 32, offset: 7872)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !537, file: !57, line: 202, baseType: !417, size: 32, offset: 7904)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !537, file: !57, line: 202, baseType: !417, size: 32, offset: 7936)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !537, file: !57, line: 202, baseType: !417, size: 32, offset: 7968)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !537, file: !57, line: 211, baseType: !417, size: 32, offset: 8000)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !537, file: !57, line: 212, baseType: !417, size: 32, offset: 8032)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !537, file: !57, line: 213, baseType: !417, size: 32, offset: 8064)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !537, file: !57, line: 214, baseType: !417, size: 32, offset: 8096)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !537, file: !57, line: 215, baseType: !417, size: 32, offset: 8128)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !537, file: !57, line: 216, baseType: !417, size: 32, offset: 8160)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !537, file: !57, line: 219, baseType: !417, size: 32, offset: 8192)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !537, file: !57, line: 220, baseType: !417, size: 32, offset: 8224)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !537, file: !57, line: 221, baseType: !417, size: 32, offset: 8256)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !537, file: !57, line: 224, baseType: !712, size: 16, offset: 8288)
!712 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !537, file: !57, line: 224, baseType: !712, size: 16, offset: 8304)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !537, file: !57, line: 226, baseType: !211, size: 16, offset: 8320)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !537, file: !57, line: 228, baseType: !129, size: 8, offset: 8336)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !537, file: !57, line: 229, baseType: !129, size: 8, offset: 8344)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !537, file: !57, line: 231, baseType: !211, size: 16, offset: 8352)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !537, file: !57, line: 232, baseType: !129, size: 8, offset: 8368)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !537, file: !57, line: 233, baseType: !129, size: 8, offset: 8376)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !537, file: !57, line: 234, baseType: !417, size: 32, offset: 8384)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !537, file: !57, line: 235, baseType: !417, size: 32, offset: 8416)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !537, file: !57, line: 237, baseType: !166, size: 128, offset: 8448)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !537, file: !57, line: 238, baseType: !166, size: 128, offset: 8576)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !537, file: !57, line: 239, baseType: !166, size: 128, offset: 8704)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !537, file: !57, line: 240, baseType: !166, size: 128, offset: 8832)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !537, file: !57, line: 242, baseType: !417, size: 32, offset: 8960)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !537, file: !57, line: 244, baseType: !211, size: 16, offset: 8992)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !537, file: !57, line: 245, baseType: !712, size: 16, offset: 9008)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !537, file: !57, line: 246, baseType: !667, size: 128, offset: 9024)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !537, file: !57, line: 248, baseType: !48, size: 32, offset: 9152)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !537, file: !57, line: 249, baseType: !48, size: 32, offset: 9184)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !537, file: !57, line: 251, baseType: !733, size: 64, offset: 9216)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !57, line: 251, flags: DIFlagFwdDecl)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !537, file: !57, line: 253, baseType: !129, size: 8, offset: 9280)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !537, file: !57, line: 254, baseType: !129, size: 8, offset: 9288)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !537, file: !57, line: 255, baseType: !211, size: 16, offset: 9296)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !537, file: !57, line: 256, baseType: !596, size: 96, offset: 9312)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !537, file: !57, line: 258, baseType: !166, size: 128, offset: 9408)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !537, file: !57, line: 259, baseType: !166, size: 128, offset: 9536)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !537, file: !57, line: 260, baseType: !166, size: 128, offset: 9664)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !537, file: !57, line: 261, baseType: !166, size: 128, offset: 9792)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !537, file: !57, line: 263, baseType: !744, size: 64, offset: 9920)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !57, line: 52, flags: DIFlagFwdDecl)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !537, file: !57, line: 264, baseType: !747, size: 64, offset: 9984)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !57, line: 53, flags: DIFlagFwdDecl)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !537, file: !57, line: 265, baseType: !750, size: 64, offset: 10048)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !752, line: 43, flags: DIFlagFwdDecl)
!752 = !DIFile(filename: "blender/source/blender/makesdna/DNA_freestyle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!753 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !537, file: !57, line: 267, baseType: !129, size: 8, offset: 10112)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !537, file: !57, line: 268, baseType: !129, size: 8, offset: 10120)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !537, file: !57, line: 269, baseType: !211, size: 16, offset: 10128)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !537, file: !57, line: 270, baseType: !417, size: 32, offset: 10144)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !537, file: !57, line: 272, baseType: !758, size: 64, offset: 10176)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !57, line: 54, flags: DIFlagFwdDecl)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !537, file: !57, line: 275, baseType: !761, size: 64, offset: 10240)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !57, line: 275, flags: DIFlagFwdDecl)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !537, file: !57, line: 277, baseType: !764, size: 64, offset: 10304)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !57, line: 56, flags: DIFlagFwdDecl)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !537, file: !57, line: 277, baseType: !764, size: 64, offset: 10368)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !537, file: !57, line: 278, baseType: !216, size: 64, offset: 10432)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !537, file: !57, line: 279, baseType: !216, size: 64, offset: 10496)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !537, file: !57, line: 280, baseType: !7, size: 32, offset: 10560)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !537, file: !57, line: 281, baseType: !7, size: 32, offset: 10592)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !537, file: !57, line: 283, baseType: !166, size: 128, offset: 10624)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !537, file: !57, line: 284, baseType: !166, size: 128, offset: 10752)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !537, file: !57, line: 285, baseType: !774, size: 64, offset: 10880)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !537, file: !57, line: 287, baseType: !776, size: 64, offset: 10944)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !57, line: 59, flags: DIFlagFwdDecl)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !537, file: !57, line: 288, baseType: !779, size: 64, offset: 11008)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !57, line: 288, flags: DIFlagFwdDecl)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !537, file: !57, line: 290, baseType: !782, size: 64, offset: 11072)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, size: 64, elements: !388)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !537, file: !57, line: 291, baseType: !784, size: 64, offset: 11136)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !786, line: 65, baseType: !787)
!786 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !786, line: 50, size: 320, elements: !788)
!788 = !{!789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !787, file: !786, line: 51, baseType: !527, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !787, file: !786, line: 53, baseType: !48, size: 32, offset: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !787, file: !786, line: 54, baseType: !48, size: 32, offset: 96)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !787, file: !786, line: 55, baseType: !48, size: 32, offset: 128)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !787, file: !786, line: 55, baseType: !48, size: 32, offset: 160)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !787, file: !786, line: 56, baseType: !129, size: 8, offset: 192)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !787, file: !786, line: 56, baseType: !129, size: 8, offset: 200)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !787, file: !786, line: 57, baseType: !129, size: 8, offset: 208)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !787, file: !786, line: 57, baseType: !129, size: 8, offset: 216)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !787, file: !786, line: 59, baseType: !211, size: 16, offset: 224)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !787, file: !786, line: 59, baseType: !211, size: 16, offset: 240)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !787, file: !786, line: 59, baseType: !211, size: 16, offset: 256)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !787, file: !786, line: 61, baseType: !211, size: 16, offset: 272)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !787, file: !786, line: 63, baseType: !48, size: 32, offset: 288)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !537, file: !57, line: 293, baseType: !166, size: 128, offset: 11200)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !537, file: !57, line: 294, baseType: !805, size: 64, offset: 11328)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !57, line: 113, baseType: !807)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !57, line: 108, size: 256, elements: !808)
!808 = !{!809, !811, !812, !813, !814}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !807, file: !57, line: 109, baseType: !810, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !807, file: !57, line: 109, baseType: !810, size: 64, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !807, file: !57, line: 110, baseType: !536, size: 64, offset: 128)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !807, file: !57, line: 111, baseType: !48, size: 32, offset: 192)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !807, file: !57, line: 112, baseType: !417, size: 32, offset: 224)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !528, file: !529, line: 1221, baseType: !816, size: 64, offset: 1088)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !529, line: 52, flags: DIFlagFwdDecl)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !528, file: !529, line: 1223, baseType: !527, size: 64, offset: 1152)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !528, file: !529, line: 1225, baseType: !166, size: 128, offset: 1216)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !528, file: !529, line: 1226, baseType: !821, size: 64, offset: 1344)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !529, line: 69, size: 320, elements: !823)
!823 = !{!824, !825, !826, !827, !828, !829, !830, !831}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !822, file: !529, line: 70, baseType: !821, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !822, file: !529, line: 70, baseType: !821, size: 64, offset: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !822, file: !529, line: 71, baseType: !7, size: 32, offset: 128)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !822, file: !529, line: 71, baseType: !7, size: 32, offset: 160)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !822, file: !529, line: 72, baseType: !48, size: 32, offset: 192)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !822, file: !529, line: 73, baseType: !211, size: 16, offset: 224)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !822, file: !529, line: 73, baseType: !211, size: 16, offset: 240)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !822, file: !529, line: 74, baseType: !536, size: 64, offset: 256)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !528, file: !529, line: 1227, baseType: !536, size: 64, offset: 1408)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !528, file: !529, line: 1229, baseType: !596, size: 96, offset: 1472)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !528, file: !529, line: 1230, baseType: !596, size: 96, offset: 1568)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !528, file: !529, line: 1231, baseType: !596, size: 96, offset: 1664)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !528, file: !529, line: 1231, baseType: !596, size: 96, offset: 1760)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !528, file: !529, line: 1233, baseType: !7, size: 32, offset: 1856)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !528, file: !529, line: 1234, baseType: !48, size: 32, offset: 1888)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !528, file: !529, line: 1235, baseType: !7, size: 32, offset: 1920)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !528, file: !529, line: 1237, baseType: !211, size: 16, offset: 1952)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !528, file: !529, line: 1239, baseType: !129, size: 8, offset: 1968)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !528, file: !529, line: 1240, baseType: !843, size: 8, offset: 1976)
!843 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 8, elements: !844)
!844 = !{!845}
!845 = !DISubrange(count: 1)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !528, file: !529, line: 1242, baseType: !847, size: 64, offset: 1984)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !529, line: 57, flags: DIFlagFwdDecl)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !528, file: !529, line: 1244, baseType: !850, size: 64, offset: 2048)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !529, line: 59, flags: DIFlagFwdDecl)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !528, file: !529, line: 1246, baseType: !853, size: 64, offset: 2112)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !529, line: 1067, size: 5184, elements: !855)
!855 = !{!856, !886, !887, !902, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !924, !1019, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1130}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !854, file: !529, line: 1068, baseType: !857, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !529, line: 934, baseType: !859)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !529, line: 925, size: 576, elements: !860)
!860 = !{!861, !877, !878, !879, !880, !882, !885}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !859, file: !529, line: 926, baseType: !862, size: 320)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !529, line: 830, baseType: !863)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !529, line: 813, size: 320, elements: !864)
!864 = !{!865, !868, !871, !872, !874, !875, !876}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !863, file: !529, line: 814, baseType: !866, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !529, line: 51, flags: DIFlagFwdDecl)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !863, file: !529, line: 815, baseType: !869, size: 64, offset: 64)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !529, line: 815, flags: DIFlagFwdDecl)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !863, file: !529, line: 818, baseType: !151, size: 64, offset: 128)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !863, file: !529, line: 819, baseType: !873, size: 32, offset: 192)
!873 = !DICompositeType(tag: DW_TAG_array_type, baseType: !513, size: 32, elements: !668)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !863, file: !529, line: 822, baseType: !48, size: 32, offset: 224)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !863, file: !529, line: 826, baseType: !48, size: 32, offset: 256)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !863, file: !529, line: 829, baseType: !48, size: 32, offset: 288)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !859, file: !529, line: 928, baseType: !211, size: 16, offset: 320)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !859, file: !529, line: 928, baseType: !211, size: 16, offset: 336)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !859, file: !529, line: 929, baseType: !48, size: 32, offset: 352)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !859, file: !529, line: 930, baseType: !881, size: 64, offset: 384)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !859, file: !529, line: 931, baseType: !883, size: 64, offset: 448)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !529, line: 931, flags: DIFlagFwdDecl)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !859, file: !529, line: 933, baseType: !151, size: 64, offset: 512)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !854, file: !529, line: 1069, baseType: !857, size: 64, offset: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !854, file: !529, line: 1070, baseType: !888, size: 64, offset: 128)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !529, line: 916, baseType: !890)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !529, line: 891, size: 704, elements: !891)
!891 = !{!892, !893, !894, !896, !897, !898, !899, !900, !901}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !890, file: !529, line: 892, baseType: !862, size: 320)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !890, file: !529, line: 896, baseType: !48, size: 32, offset: 320)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !890, file: !529, line: 900, baseType: !895, size: 96, offset: 352)
!895 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 96, elements: !519)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !890, file: !529, line: 903, baseType: !417, size: 32, offset: 448)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !890, file: !529, line: 906, baseType: !48, size: 32, offset: 480)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !890, file: !529, line: 909, baseType: !417, size: 32, offset: 512)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !890, file: !529, line: 912, baseType: !417, size: 32, offset: 544)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !890, file: !529, line: 914, baseType: !536, size: 64, offset: 576)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !890, file: !529, line: 915, baseType: !151, size: 64, offset: 640)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !854, file: !529, line: 1071, baseType: !903, size: 64, offset: 192)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !529, line: 920, baseType: !905)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !529, line: 918, size: 320, elements: !906)
!906 = !{!907}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !905, file: !529, line: 919, baseType: !862, size: 320)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !854, file: !529, line: 1075, baseType: !417, size: 32, offset: 256)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !854, file: !529, line: 1077, baseType: !417, size: 32, offset: 288)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !854, file: !529, line: 1078, baseType: !417, size: 32, offset: 320)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !854, file: !529, line: 1079, baseType: !211, size: 16, offset: 352)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !854, file: !529, line: 1082, baseType: !211, size: 16, offset: 368)
