; ModuleID = 'blender/source/blender/editors/armature/editarmature_generate.c'
source_filename = "blender/source/blender/editors/armature/editarmature_generate.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EditBone = type { %struct.EditBone*, %struct.EditBone*, %struct.IDProperty*, %struct.EditBone*, i8*, [64 x i8], float, [3 x float], [3 x float], i32, i32, float, float, float, float, float, float, float, float, float, float, i16 }
%struct.IDProperty = type { %struct.IDProperty*, %struct.IDProperty*, i8, i8, i16, [64 x i8], i32, %struct.IDPropertyData, i32, i32 }
%struct.IDPropertyData = type { i8*, %struct.ListBase, i32, i32 }
%struct.ListBase = type { i8*, i8* }
%struct.BArcIterator = type { i8* (i8*)*, i8* (i8*)*, i8* (i8*, i32)*, i8* (i8*)*, i8* (i8*, i32)*, i8* (i8*)*, i32 (i8*)*, float*, float*, float, i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "stroke_length", scope: !2, file: !3, line: 97, type: !61, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "nextFixedSubdivision", scope: !3, file: !3, line: 95, type: !4, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !839, retainedNodes: !873)
!3 = !DIFile(filename: "blender/source/blender/editors/armature/editarmature_generate.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !7, !805, !6, !6, !834, !834}
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "ToolSettings", file: !9, line: 1180, baseType: !10)
!9 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!10 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !9, line: 1067, size: 5184, elements: !11)
!11 = !{!12, !48, !49, !69, !75, !76, !77, !78, !79, !80, !82, !83, !84, !85, !86, !87, !88, !92, !114, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !788}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !10, file: !9, line: 1068, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !9, line: 934, baseType: !15)
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !9, line: 925, size: 576, elements: !16)
!16 = !{!17, !37, !39, !40, !41, !44, !47}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !15, file: !9, line: 926, baseType: !18, size: 320)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !9, line: 830, baseType: !19)
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !9, line: 813, size: 320, elements: !20)
!20 = !{!21, !24, !27, !29, !34, !35, !36}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !19, file: !9, line: 814, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !9, line: 51, flags: DIFlagFwdDecl)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !19, file: !9, line: 815, baseType: !25, size: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !9, line: 815, flags: DIFlagFwdDecl)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !19, file: !9, line: 818, baseType: !28, size: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !19, file: !9, line: 819, baseType: !30, size: 32, offset: 192)
!30 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 32, elements: !32)
!31 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!32 = !{!33}
!33 = !DISubrange(count: 4)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !19, file: !9, line: 822, baseType: !6, size: 32, offset: 224)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !19, file: !9, line: 826, baseType: !6, size: 32, offset: 256)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !19, file: !9, line: 829, baseType: !6, size: 32, offset: 288)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !15, file: !9, line: 928, baseType: !38, size: 16, offset: 320)
!38 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !15, file: !9, line: 928, baseType: !38, size: 16, offset: 336)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !15, file: !9, line: 929, baseType: !6, size: 32, offset: 352)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !15, file: !9, line: 930, baseType: !42, size: 64, offset: 384)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !15, file: !9, line: 931, baseType: !45, size: 64, offset: 448)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !9, line: 931, flags: DIFlagFwdDecl)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !15, file: !9, line: 933, baseType: !28, size: 64, offset: 512)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !10, file: !9, line: 1069, baseType: !13, size: 64, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !10, file: !9, line: 1070, baseType: !50, size: 64, offset: 128)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !9, line: 916, baseType: !52)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !9, line: 891, size: 704, elements: !53)
!53 = !{!54, !55, !56, !60, !62, !63, !64, !65, !68}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !52, file: !9, line: 892, baseType: !18, size: 320)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !52, file: !9, line: 896, baseType: !6, size: 32, offset: 320)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !52, file: !9, line: 900, baseType: !57, size: 96, offset: 352)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 96, elements: !58)
!58 = !{!59}
!59 = !DISubrange(count: 3)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !52, file: !9, line: 903, baseType: !61, size: 32, offset: 448)
!61 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !52, file: !9, line: 906, baseType: !6, size: 32, offset: 480)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !52, file: !9, line: 909, baseType: !61, size: 32, offset: 512)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !52, file: !9, line: 912, baseType: !61, size: 32, offset: 544)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !52, file: !9, line: 914, baseType: !66, size: 64, offset: 576)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !9, line: 50, flags: DIFlagFwdDecl)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !52, file: !9, line: 915, baseType: !28, size: 64, offset: 640)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !10, file: !9, line: 1071, baseType: !70, size: 64, offset: 192)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !9, line: 920, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !9, line: 918, size: 320, elements: !73)
!73 = !{!74}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !72, file: !9, line: 919, baseType: !18, size: 320)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !10, file: !9, line: 1075, baseType: !61, size: 32, offset: 256)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !10, file: !9, line: 1077, baseType: !61, size: 32, offset: 288)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !10, file: !9, line: 1078, baseType: !61, size: 32, offset: 320)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !10, file: !9, line: 1079, baseType: !38, size: 16, offset: 352)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !10, file: !9, line: 1082, baseType: !38, size: 16, offset: 368)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !10, file: !9, line: 1085, baseType: !81, size: 8, offset: 384)
!81 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !10, file: !9, line: 1086, baseType: !81, size: 8, offset: 392)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !10, file: !9, line: 1087, baseType: !81, size: 8, offset: 400)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !10, file: !9, line: 1088, baseType: !81, size: 8, offset: 408)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !10, file: !9, line: 1090, baseType: !61, size: 32, offset: 416)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !10, file: !9, line: 1093, baseType: !38, size: 16, offset: 448)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !10, file: !9, line: 1096, baseType: !81, size: 8, offset: 464)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !10, file: !9, line: 1098, baseType: !89, size: 40, offset: 472)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 40, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 5)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !10, file: !9, line: 1101, baseType: !93, size: 832, offset: 512)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !9, line: 836, size: 832, elements: !94)
!94 = !{!95, !96, !97, !98, !99, !100, !104, !105, !106, !109, !110, !111, !113}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !93, file: !9, line: 837, baseType: !18, size: 320)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !93, file: !9, line: 839, baseType: !38, size: 16, offset: 320)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !93, file: !9, line: 839, baseType: !38, size: 16, offset: 336)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !93, file: !9, line: 842, baseType: !38, size: 16, offset: 352)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !93, file: !9, line: 842, baseType: !38, size: 16, offset: 368)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !93, file: !9, line: 843, baseType: !101, size: 32, offset: 384)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 32, elements: !102)
!102 = !{!103}
!103 = !DISubrange(count: 2)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !93, file: !9, line: 845, baseType: !6, size: 32, offset: 416)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !93, file: !9, line: 847, baseType: !28, size: 64, offset: 448)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !93, file: !9, line: 848, baseType: !107, size: 64, offset: 512)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !9, line: 54, flags: DIFlagFwdDecl)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !93, file: !9, line: 849, baseType: !107, size: 64, offset: 576)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "canvas", scope: !93, file: !9, line: 850, baseType: !107, size: 64, offset: 640)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "stencil_col", scope: !93, file: !9, line: 851, baseType: !112, size: 96, offset: 704)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 96, elements: !58)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !93, file: !9, line: 852, baseType: !61, size: 32, offset: 800)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !10, file: !9, line: 1104, baseType: !115, size: 1344, offset: 1344)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleEditSettings", file: !9, line: 867, size: 1344, elements: !116)
!116 = !{!117, !118, !119, !120, !121, !134, !135, !136, !137, !138, !139, !140, !141, !701}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !115, file: !9, line: 868, baseType: !38, size: 16)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "totrekey", scope: !115, file: !9, line: 869, baseType: !38, size: 16, offset: 16)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "totaddkey", scope: !115, file: !9, line: 870, baseType: !38, size: 16, offset: 32)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "brushtype", scope: !115, file: !9, line: 871, baseType: !38, size: 16, offset: 48)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !115, file: !9, line: 873, baseType: !122, size: 896, offset: 64)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 896, elements: !132)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParticleBrushData", file: !9, line: 864, baseType: !124)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleBrushData", file: !9, line: 859, size: 128, elements: !125)
!125 = !{!126, !127, !128, !129, !130, !131}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !124, file: !9, line: 860, baseType: !38, size: 16)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !124, file: !9, line: 861, baseType: !38, size: 16, offset: 16)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !124, file: !9, line: 861, baseType: !38, size: 16, offset: 32)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !124, file: !9, line: 861, baseType: !38, size: 16, offset: 48)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !124, file: !9, line: 862, baseType: !6, size: 32, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !124, file: !9, line: 863, baseType: !61, size: 32, offset: 96)
!132 = !{!133}
!133 = !DISubrange(count: 7)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !115, file: !9, line: 874, baseType: !28, size: 64, offset: 960)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "emitterdist", scope: !115, file: !9, line: 876, baseType: !61, size: 32, offset: 1024)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !115, file: !9, line: 876, baseType: !61, size: 32, offset: 1056)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !115, file: !9, line: 878, baseType: !6, size: 32, offset: 1088)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "edittype", scope: !115, file: !9, line: 879, baseType: !6, size: 32, offset: 1120)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "draw_step", scope: !115, file: !9, line: 881, baseType: !6, size: 32, offset: 1152)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "fade_frames", scope: !115, file: !9, line: 881, baseType: !6, size: 32, offset: 1184)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !115, file: !9, line: 883, baseType: !142, size: 64, offset: 1216)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !9, line: 1216, size: 39680, elements: !144)
!144 = !{!145, !213, !216, !217, !220, !221, !222, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !248, !251, !254, !256, !259, !563, !575, !576, !577, !578, !579, !580, !581, !582, !585, !586, !587, !588, !589, !597, !664, !671, !674, !681, !684, !690, !691, !692, !693, !698}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !143, file: !9, line: 1217, baseType: !146, size: 960)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !147, line: 130, baseType: !148)
!147 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !147, line: 117, size: 960, elements: !149)
!149 = !{!150, !151, !152, !154, !173, !177, !178, !179, !180, !181}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !148, file: !147, line: 118, baseType: !28, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !148, file: !147, line: 118, baseType: !28, size: 64, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !148, file: !147, line: 119, baseType: !153, size: 64, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !148, file: !147, line: 120, baseType: !155, size: 64, offset: 192)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !147, line: 136, size: 17600, elements: !157)
!157 = !{!158, !159, !161, !164, !168, !169, !170}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !156, file: !147, line: 137, baseType: !146, size: 960)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !156, file: !147, line: 138, baseType: !160, size: 64, offset: 960)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !156, file: !147, line: 139, baseType: !162, size: 64, offset: 1024)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !147, line: 43, flags: DIFlagFwdDecl)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !156, file: !147, line: 140, baseType: !165, size: 8192, offset: 1088)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 8192, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 1024)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !156, file: !147, line: 141, baseType: !165, size: 8192, offset: 9280)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !156, file: !147, line: 148, baseType: !155, size: 64, offset: 17472)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !156, file: !147, line: 150, baseType: !171, size: 64, offset: 17536)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !147, line: 45, flags: DIFlagFwdDecl)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !148, file: !147, line: 121, baseType: !174, size: 528, offset: 256)
!174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 528, elements: !175)
!175 = !{!176}
!176 = !DISubrange(count: 66)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !148, file: !147, line: 126, baseType: !38, size: 16, offset: 784)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !148, file: !147, line: 127, baseType: !6, size: 32, offset: 800)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !148, file: !147, line: 128, baseType: !6, size: 32, offset: 832)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !148, file: !147, line: 128, baseType: !6, size: 32, offset: 864)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !148, file: !147, line: 129, baseType: !182, size: 64, offset: 896)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !147, line: 75, baseType: !184)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !147, line: 62, size: 1024, elements: !185)
!185 = !{!186, !188, !189, !190, !191, !192, !196, !197, !211, !212}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !184, file: !147, line: 63, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !184, file: !147, line: 63, baseType: !187, size: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !184, file: !147, line: 64, baseType: !81, size: 8, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !184, file: !147, line: 64, baseType: !81, size: 8, offset: 136)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !184, file: !147, line: 65, baseType: !38, size: 16, offset: 144)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !184, file: !147, line: 66, baseType: !193, size: 512, offset: 160)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 512, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !184, file: !147, line: 67, baseType: !6, size: 32, offset: 672)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !184, file: !147, line: 69, baseType: !198, size: 256, offset: 704)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !147, line: 60, baseType: !199)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !147, line: 48, size: 256, elements: !200)
!200 = !{!201, !202, !209, !210}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !199, file: !147, line: 49, baseType: !28, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !199, file: !147, line: 58, baseType: !203, size: 128, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !204, line: 71, baseType: !205)
!204 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !204, line: 69, size: 128, elements: !206)
!206 = !{!207, !208}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !205, file: !204, line: 70, baseType: !28, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !205, file: !204, line: 70, baseType: !28, size: 64, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !199, file: !147, line: 59, baseType: !6, size: 32, offset: 192)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !199, file: !147, line: 59, baseType: !6, size: 32, offset: 224)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !184, file: !147, line: 70, baseType: !6, size: 32, offset: 960)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !184, file: !147, line: 74, baseType: !6, size: 32, offset: 992)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !143, file: !9, line: 1218, baseType: !214, size: 64, offset: 960)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !9, line: 58, flags: DIFlagFwdDecl)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !143, file: !9, line: 1220, baseType: !66, size: 64, offset: 1024)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !143, file: !9, line: 1221, baseType: !218, size: 64, offset: 1088)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !9, line: 52, flags: DIFlagFwdDecl)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !143, file: !9, line: 1223, baseType: !142, size: 64, offset: 1152)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !143, file: !9, line: 1225, baseType: !203, size: 128, offset: 1216)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !143, file: !9, line: 1226, baseType: !223, size: 64, offset: 1344)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !9, line: 69, size: 320, elements: !225)
!225 = !{!226, !227, !228, !229, !230, !231, !232, !233}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !224, file: !9, line: 70, baseType: !223, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !224, file: !9, line: 70, baseType: !223, size: 64, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !224, file: !9, line: 71, baseType: !43, size: 32, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !224, file: !9, line: 71, baseType: !43, size: 32, offset: 160)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !224, file: !9, line: 72, baseType: !6, size: 32, offset: 192)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !224, file: !9, line: 73, baseType: !38, size: 16, offset: 224)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !224, file: !9, line: 73, baseType: !38, size: 16, offset: 240)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !224, file: !9, line: 74, baseType: !66, size: 64, offset: 256)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !143, file: !9, line: 1227, baseType: !66, size: 64, offset: 1408)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !143, file: !9, line: 1229, baseType: !112, size: 96, offset: 1472)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !143, file: !9, line: 1230, baseType: !112, size: 96, offset: 1568)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !143, file: !9, line: 1231, baseType: !112, size: 96, offset: 1664)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !143, file: !9, line: 1231, baseType: !112, size: 96, offset: 1760)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !143, file: !9, line: 1233, baseType: !43, size: 32, offset: 1856)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !143, file: !9, line: 1234, baseType: !6, size: 32, offset: 1888)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !143, file: !9, line: 1235, baseType: !43, size: 32, offset: 1920)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !143, file: !9, line: 1237, baseType: !38, size: 16, offset: 1952)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !143, file: !9, line: 1239, baseType: !81, size: 8, offset: 1968)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !143, file: !9, line: 1240, baseType: !245, size: 8, offset: 1976)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 8, elements: !246)
!246 = !{!247}
!247 = !DISubrange(count: 1)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !143, file: !9, line: 1242, baseType: !249, size: 64, offset: 1984)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !9, line: 57, flags: DIFlagFwdDecl)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !143, file: !9, line: 1244, baseType: !252, size: 64, offset: 2048)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !9, line: 59, flags: DIFlagFwdDecl)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !143, file: !9, line: 1246, baseType: !255, size: 64, offset: 2112)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !143, file: !9, line: 1247, baseType: !257, size: 64, offset: 2176)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "SceneStats", file: !9, line: 60, flags: DIFlagFwdDecl)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !143, file: !9, line: 1251, baseType: !260, size: 31872, offset: 2240)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderData", file: !9, line: 403, size: 31872, elements: !261)
!261 = !{!262, !347, !367, !376, !396, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !510, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !538, !539, !540, !544, !561, !562}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "im_format", scope: !260, file: !9, line: 404, baseType: !263, size: 1984)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageFormatData", file: !9, line: 259, size: 1984, elements: !264)
!264 = !{!265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !282, !342}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "imtype", scope: !263, file: !9, line: 260, baseType: !81, size: 8)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !263, file: !9, line: 263, baseType: !81, size: 8, offset: 8)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !263, file: !9, line: 266, baseType: !81, size: 8, offset: 16)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !263, file: !9, line: 267, baseType: !81, size: 8, offset: 24)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !263, file: !9, line: 269, baseType: !81, size: 8, offset: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "compress", scope: !263, file: !9, line: 270, baseType: !81, size: 8, offset: 40)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "exr_codec", scope: !263, file: !9, line: 276, baseType: !81, size: 8, offset: 48)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_flag", scope: !263, file: !9, line: 279, baseType: !81, size: 8, offset: 56)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_white", scope: !263, file: !9, line: 280, baseType: !38, size: 16, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_black", scope: !263, file: !9, line: 280, baseType: !38, size: 16, offset: 80)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_gamma", scope: !263, file: !9, line: 281, baseType: !61, size: 32, offset: 96)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "jp2_flag", scope: !263, file: !9, line: 284, baseType: !81, size: 8, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "jp2_codec", scope: !263, file: !9, line: 285, baseType: !81, size: 8, offset: 136)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !263, file: !9, line: 287, baseType: !279, size: 48, offset: 144)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 48, elements: !280)
!280 = !{!281}
!281 = !DISubrange(count: 6)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "view_settings", scope: !263, file: !9, line: 290, baseType: !283, size: 1280, offset: 192)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedViewSettings", file: !284, line: 174, baseType: !285)
!284 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedViewSettings", file: !284, line: 166, size: 1280, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293, !341}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !285, file: !284, line: 167, baseType: !6, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !285, file: !284, line: 167, baseType: !6, size: 32, offset: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "look", scope: !285, file: !284, line: 168, baseType: !193, size: 512, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "view_transform", scope: !285, file: !284, line: 169, baseType: !193, size: 512, offset: 576)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !285, file: !284, line: 170, baseType: !61, size: 32, offset: 1088)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !285, file: !284, line: 171, baseType: !61, size: 32, offset: 1120)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "curve_mapping", scope: !285, file: !284, line: 172, baseType: !294, size: 64, offset: 1152)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapping", file: !284, line: 72, size: 3072, elements: !296)
!296 = !{!297, !298, !299, !300, !301, !310, !311, !337, !338, !339, !340}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !295, file: !284, line: 73, baseType: !6, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !295, file: !284, line: 73, baseType: !6, size: 32, offset: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "preset", scope: !295, file: !284, line: 74, baseType: !6, size: 32, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !295, file: !284, line: 75, baseType: !6, size: 32, offset: 96)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !295, file: !284, line: 77, baseType: !302, size: 128, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !303, line: 95, baseType: !304)
!303 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !303, line: 92, size: 128, elements: !305)
!305 = !{!306, !307, !308, !309}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !304, file: !303, line: 93, baseType: !61, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !304, file: !303, line: 93, baseType: !61, size: 32, offset: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !304, file: !303, line: 94, baseType: !61, size: 32, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !304, file: !303, line: 94, baseType: !61, size: 32, offset: 96)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "clipr", scope: !295, file: !284, line: 77, baseType: !302, size: 128, offset: 256)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "cm", scope: !295, file: !284, line: 79, baseType: !312, size: 2304, offset: 384)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !313, size: 2304, elements: !32)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMap", file: !284, line: 67, baseType: !314)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMap", file: !284, line: 55, size: 576, elements: !315)
!315 = !{!316, !317, !318, !319, !320, !321, !323, !324, !333, !334, !335, !336}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "totpoint", scope: !314, file: !284, line: 56, baseType: !38, size: 16)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !314, file: !284, line: 56, baseType: !38, size: 16, offset: 16)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !314, file: !284, line: 58, baseType: !61, size: 32, offset: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "mintable", scope: !314, file: !284, line: 59, baseType: !61, size: 32, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "maxtable", scope: !314, file: !284, line: 59, baseType: !61, size: 32, offset: 96)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "ext_in", scope: !314, file: !284, line: 60, baseType: !322, size: 64, offset: 128)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 64, elements: !102)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "ext_out", scope: !314, file: !284, line: 60, baseType: !322, size: 64, offset: 192)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !314, file: !284, line: 61, baseType: !325, size: 64, offset: 256)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMapPoint", file: !284, line: 47, baseType: !327)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapPoint", file: !284, line: 44, size: 96, elements: !328)
!328 = !{!329, !330, !331, !332}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !327, file: !284, line: 45, baseType: !61, size: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !327, file: !284, line: 45, baseType: !61, size: 32, offset: 32)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !327, file: !284, line: 46, baseType: !38, size: 16, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "shorty", scope: !327, file: !284, line: 46, baseType: !38, size: 16, offset: 80)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !314, file: !284, line: 62, baseType: !325, size: 64, offset: 320)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "premultable", scope: !314, file: !284, line: 64, baseType: !325, size: 64, offset: 384)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_in", scope: !314, file: !284, line: 65, baseType: !322, size: 64, offset: 448)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_out", scope: !314, file: !284, line: 66, baseType: !322, size: 64, offset: 512)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "black", scope: !295, file: !284, line: 80, baseType: !112, size: 96, offset: 2688)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "white", scope: !295, file: !284, line: 80, baseType: !112, size: 96, offset: 2784)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "bwmul", scope: !295, file: !284, line: 81, baseType: !112, size: 96, offset: 2880)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "sample", scope: !295, file: !284, line: 83, baseType: !112, size: 96, offset: 2976)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !285, file: !284, line: 173, baseType: !28, size: 64, offset: 1216)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "display_settings", scope: !263, file: !9, line: 291, baseType: !343, size: 512, offset: 1472)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedDisplaySettings", file: !284, line: 178, baseType: !344)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedDisplaySettings", file: !284, line: 176, size: 512, elements: !345)
!345 = !{!346}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "display_device", scope: !344, file: !284, line: 177, baseType: !193, size: 512)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "avicodecdata", scope: !260, file: !9, line: 406, baseType: !348, size: 64, offset: 1984)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AviCodecData", file: !9, line: 80, size: 1472, elements: !350)
!350 = !{!351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "lpFormat", scope: !349, file: !9, line: 81, baseType: !28, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "lpParms", scope: !349, file: !9, line: 82, baseType: !28, size: 64, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "cbFormat", scope: !349, file: !9, line: 83, baseType: !43, size: 32, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "cbParms", scope: !349, file: !9, line: 84, baseType: !43, size: 32, offset: 160)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "fccType", scope: !349, file: !9, line: 86, baseType: !43, size: 32, offset: 192)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "fccHandler", scope: !349, file: !9, line: 87, baseType: !43, size: 32, offset: 224)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "dwKeyFrameEvery", scope: !349, file: !9, line: 88, baseType: !43, size: 32, offset: 256)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "dwQuality", scope: !349, file: !9, line: 89, baseType: !43, size: 32, offset: 288)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "dwBytesPerSecond", scope: !349, file: !9, line: 90, baseType: !43, size: 32, offset: 320)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "dwFlags", scope: !349, file: !9, line: 91, baseType: !43, size: 32, offset: 352)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "dwInterleaveEvery", scope: !349, file: !9, line: 92, baseType: !43, size: 32, offset: 384)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !349, file: !9, line: 93, baseType: !43, size: 32, offset: 416)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "avicodecname", scope: !349, file: !9, line: 95, baseType: !364, size: 1024, offset: 448)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 1024, elements: !365)
!365 = !{!366}
!366 = !DISubrange(count: 128)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "qtcodecdata", scope: !260, file: !9, line: 407, baseType: !368, size: 64, offset: 2048)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "QuicktimeCodecData", file: !9, line: 98, size: 1216, elements: !370)
!370 = !{!371, !372, !373, !374, !375}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "cdParms", scope: !369, file: !9, line: 100, baseType: !28, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !369, file: !9, line: 101, baseType: !28, size: 64, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "cdSize", scope: !369, file: !9, line: 103, baseType: !43, size: 32, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !369, file: !9, line: 104, baseType: !43, size: 32, offset: 160)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "qtcodecname", scope: !369, file: !9, line: 106, baseType: !364, size: 1024, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "qtcodecsettings", scope: !260, file: !9, line: 408, baseType: !377, size: 512, offset: 2112)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "QuicktimeCodecSettings", file: !9, line: 109, size: 512, elements: !378)
!378 = !{!379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "codecType", scope: !377, file: !9, line: 111, baseType: !6, size: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "codecSpatialQuality", scope: !377, file: !9, line: 112, baseType: !6, size: 32, offset: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !377, file: !9, line: 115, baseType: !6, size: 32, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "codecFlags", scope: !377, file: !9, line: 116, baseType: !6, size: 32, offset: 96)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "colorDepth", scope: !377, file: !9, line: 117, baseType: !6, size: 32, offset: 128)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "codecTemporalQuality", scope: !377, file: !9, line: 118, baseType: !6, size: 32, offset: 160)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "minSpatialQuality", scope: !377, file: !9, line: 119, baseType: !6, size: 32, offset: 192)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "minTemporalQuality", scope: !377, file: !9, line: 120, baseType: !6, size: 32, offset: 224)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "keyFrameRate", scope: !377, file: !9, line: 121, baseType: !6, size: 32, offset: 256)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "bitRate", scope: !377, file: !9, line: 122, baseType: !6, size: 32, offset: 288)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "audiocodecType", scope: !377, file: !9, line: 125, baseType: !6, size: 32, offset: 320)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "audioSampleRate", scope: !377, file: !9, line: 126, baseType: !6, size: 32, offset: 352)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "audioBitDepth", scope: !377, file: !9, line: 127, baseType: !38, size: 16, offset: 384)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "audioChannels", scope: !377, file: !9, line: 128, baseType: !38, size: 16, offset: 400)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "audioCodecFlags", scope: !377, file: !9, line: 129, baseType: !6, size: 32, offset: 416)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "audioBitRate", scope: !377, file: !9, line: 130, baseType: !6, size: 32, offset: 448)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !377, file: !9, line: 131, baseType: !6, size: 32, offset: 480)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "ffcodecdata", scope: !260, file: !9, line: 409, baseType: !397, size: 576, offset: 2624)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFMpegCodecData", file: !9, line: 134, size: 576, elements: !398)
!398 = !{!399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !397, file: !9, line: 135, baseType: !6, size: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !397, file: !9, line: 136, baseType: !6, size: 32, offset: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !397, file: !9, line: 137, baseType: !6, size: 32, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "video_bitrate", scope: !397, file: !9, line: 138, baseType: !6, size: 32, offset: 96)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "audio_bitrate", scope: !397, file: !9, line: 139, baseType: !6, size: 32, offset: 128)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "audio_mixrate", scope: !397, file: !9, line: 140, baseType: !6, size: 32, offset: 160)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "audio_channels", scope: !397, file: !9, line: 141, baseType: !6, size: 32, offset: 192)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "audio_pad", scope: !397, file: !9, line: 142, baseType: !6, size: 32, offset: 224)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "audio_volume", scope: !397, file: !9, line: 143, baseType: !61, size: 32, offset: 256)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !397, file: !9, line: 144, baseType: !6, size: 32, offset: 288)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !397, file: !9, line: 145, baseType: !6, size: 32, offset: 320)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !397, file: !9, line: 147, baseType: !6, size: 32, offset: 352)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !397, file: !9, line: 148, baseType: !6, size: 32, offset: 384)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !397, file: !9, line: 149, baseType: !6, size: 32, offset: 416)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "mux_packet_size", scope: !397, file: !9, line: 150, baseType: !6, size: 32, offset: 448)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "mux_rate", scope: !397, file: !9, line: 151, baseType: !6, size: 32, offset: 480)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !397, file: !9, line: 152, baseType: !182, size: 64, offset: 512)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "cfra", scope: !260, file: !9, line: 411, baseType: !6, size: 32, offset: 3200)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !260, file: !9, line: 411, baseType: !6, size: 32, offset: 3232)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "efra", scope: !260, file: !9, line: 411, baseType: !6, size: 32, offset: 3264)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "subframe", scope: !260, file: !9, line: 412, baseType: !61, size: 32, offset: 3296)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "psfra", scope: !260, file: !9, line: 413, baseType: !6, size: 32, offset: 3328)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "pefra", scope: !260, file: !9, line: 413, baseType: !6, size: 32, offset: 3360)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "images", scope: !260, file: !9, line: 415, baseType: !6, size: 32, offset: 3392)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "framapto", scope: !260, file: !9, line: 415, baseType: !6, size: 32, offset: 3424)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !260, file: !9, line: 416, baseType: !38, size: 16, offset: 3456)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "threads", scope: !260, file: !9, line: 416, baseType: !38, size: 16, offset: 3472)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "framelen", scope: !260, file: !9, line: 418, baseType: !61, size: 32, offset: 3488)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "blurfac", scope: !260, file: !9, line: 418, baseType: !61, size: 32, offset: 3520)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "edgeR", scope: !260, file: !9, line: 421, baseType: !61, size: 32, offset: 3552)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "edgeG", scope: !260, file: !9, line: 421, baseType: !61, size: 32, offset: 3584)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "edgeB", scope: !260, file: !9, line: 421, baseType: !61, size: 32, offset: 3616)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "fullscreen", scope: !260, file: !9, line: 425, baseType: !38, size: 16, offset: 3648)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "xplay", scope: !260, file: !9, line: 425, baseType: !38, size: 16, offset: 3664)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "yplay", scope: !260, file: !9, line: 425, baseType: !38, size: 16, offset: 3680)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "freqplay", scope: !260, file: !9, line: 426, baseType: !38, size: 16, offset: 3696)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !260, file: !9, line: 428, baseType: !38, size: 16, offset: 3712)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "attrib", scope: !260, file: !9, line: 428, baseType: !38, size: 16, offset: 3728)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "frame_step", scope: !260, file: !9, line: 431, baseType: !6, size: 32, offset: 3744)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "stereomode", scope: !260, file: !9, line: 433, baseType: !38, size: 16, offset: 3776)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "dimensionspreset", scope: !260, file: !9, line: 435, baseType: !38, size: 16, offset: 3792)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "filtertype", scope: !260, file: !9, line: 437, baseType: !38, size: 16, offset: 3808)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !260, file: !9, line: 439, baseType: !38, size: 16, offset: 3824)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "maximsize", scope: !260, file: !9, line: 441, baseType: !38, size: 16, offset: 3840)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "pad6", scope: !260, file: !9, line: 443, baseType: !38, size: 16, offset: 3856)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "xsch", scope: !260, file: !9, line: 449, baseType: !6, size: 32, offset: 3872)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "ysch", scope: !260, file: !9, line: 453, baseType: !6, size: 32, offset: 3904)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "xparts", scope: !260, file: !9, line: 458, baseType: !38, size: 16, offset: 3936)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "yparts", scope: !260, file: !9, line: 462, baseType: !38, size: 16, offset: 3952)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "tilex", scope: !260, file: !9, line: 467, baseType: !6, size: 32, offset: 3968)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "tiley", scope: !260, file: !9, line: 467, baseType: !6, size: 32, offset: 4000)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !260, file: !9, line: 469, baseType: !38, size: 16, offset: 4032)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "imtype", scope: !260, file: !9, line: 469, baseType: !38, size: 16, offset: 4048)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "subimtype", scope: !260, file: !9, line: 469, baseType: !38, size: 16, offset: 4064)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !260, file: !9, line: 469, baseType: !38, size: 16, offset: 4080)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "displaymode", scope: !260, file: !9, line: 474, baseType: !38, size: 16, offset: 4096)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "use_lock_interface", scope: !260, file: !9, line: 475, baseType: !81, size: 8, offset: 4112)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "pad7", scope: !260, file: !9, line: 476, baseType: !81, size: 8, offset: 4120)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "scemode", scope: !260, file: !9, line: 481, baseType: !6, size: 32, offset: 4128)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !260, file: !9, line: 486, baseType: !6, size: 32, offset: 4160)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "raytrace_options", scope: !260, file: !9, line: 491, baseType: !6, size: 32, offset: 4192)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "raytrace_structure", scope: !260, file: !9, line: 496, baseType: !38, size: 16, offset: 4224)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !260, file: !9, line: 498, baseType: !38, size: 16, offset: 4240)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "ocres", scope: !260, file: !9, line: 501, baseType: !38, size: 16, offset: 4256)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "pad4", scope: !260, file: !9, line: 502, baseType: !38, size: 16, offset: 4272)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "alphamode", scope: !260, file: !9, line: 508, baseType: !38, size: 16, offset: 4288)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "osa", scope: !260, file: !9, line: 513, baseType: !38, size: 16, offset: 4304)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "frs_sec", scope: !260, file: !9, line: 515, baseType: !38, size: 16, offset: 4320)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "edgeint", scope: !260, file: !9, line: 515, baseType: !38, size: 16, offset: 4336)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "safety", scope: !260, file: !9, line: 519, baseType: !302, size: 128, offset: 4352)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "border", scope: !260, file: !9, line: 519, baseType: !302, size: 128, offset: 4480)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "disprect", scope: !260, file: !9, line: 520, baseType: !471, size: 128, offset: 4608)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !303, line: 89, baseType: !472)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !303, line: 86, size: 128, elements: !473)
!473 = !{!474, !475, !476, !477}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !472, file: !303, line: 87, baseType: !6, size: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !472, file: !303, line: 87, baseType: !6, size: 32, offset: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !472, file: !303, line: 88, baseType: !6, size: 32, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !472, file: !303, line: 88, baseType: !6, size: 32, offset: 96)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !260, file: !9, line: 523, baseType: !203, size: 128, offset: 4736)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "actlay", scope: !260, file: !9, line: 524, baseType: !38, size: 16, offset: 4864)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "mblur_samples", scope: !260, file: !9, line: 527, baseType: !38, size: 16, offset: 4880)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "xasp", scope: !260, file: !9, line: 532, baseType: !61, size: 32, offset: 4896)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "yasp", scope: !260, file: !9, line: 532, baseType: !61, size: 32, offset: 4928)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "frs_sec_base", scope: !260, file: !9, line: 534, baseType: !61, size: 32, offset: 4960)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "gauss", scope: !260, file: !9, line: 538, baseType: !61, size: 32, offset: 4992)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "color_mgt_flag", scope: !260, file: !9, line: 542, baseType: !6, size: 32, offset: 5024)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "postgamma", scope: !260, file: !9, line: 545, baseType: !61, size: 32, offset: 5056)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "posthue", scope: !260, file: !9, line: 545, baseType: !61, size: 32, offset: 5088)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "postsat", scope: !260, file: !9, line: 545, baseType: !61, size: 32, offset: 5120)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "dither_intensity", scope: !260, file: !9, line: 548, baseType: !61, size: 32, offset: 5152)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "bake_osa", scope: !260, file: !9, line: 551, baseType: !38, size: 16, offset: 5184)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "bake_filter", scope: !260, file: !9, line: 551, baseType: !38, size: 16, offset: 5200)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "bake_mode", scope: !260, file: !9, line: 551, baseType: !38, size: 16, offset: 5216)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "bake_flag", scope: !260, file: !9, line: 551, baseType: !38, size: 16, offset: 5232)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "bake_normal_space", scope: !260, file: !9, line: 552, baseType: !38, size: 16, offset: 5248)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "bake_quad_split", scope: !260, file: !9, line: 552, baseType: !38, size: 16, offset: 5264)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "bake_maxdist", scope: !260, file: !9, line: 553, baseType: !61, size: 32, offset: 5280)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "bake_biasdist", scope: !260, file: !9, line: 553, baseType: !61, size: 32, offset: 5312)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "bake_samples", scope: !260, file: !9, line: 554, baseType: !38, size: 16, offset: 5344)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "bake_pad", scope: !260, file: !9, line: 554, baseType: !38, size: 16, offset: 5360)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "bake_user_scale", scope: !260, file: !9, line: 555, baseType: !61, size: 32, offset: 5376)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "bake_pad1", scope: !260, file: !9, line: 555, baseType: !61, size: 32, offset: 5408)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "pic", scope: !260, file: !9, line: 558, baseType: !165, size: 8192, offset: 5440)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "stamp", scope: !260, file: !9, line: 561, baseType: !6, size: 32, offset: 13632)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "stamp_font_id", scope: !260, file: !9, line: 562, baseType: !38, size: 16, offset: 13664)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !260, file: !9, line: 562, baseType: !38, size: 16, offset: 13680)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "stamp_udata", scope: !260, file: !9, line: 565, baseType: !507, size: 6144, offset: 13696)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 6144, elements: !508)
!508 = !{!509}
!509 = !DISubrange(count: 768)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "fg_stamp", scope: !260, file: !9, line: 568, baseType: !511, size: 128, offset: 19840)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 128, elements: !32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "bg_stamp", scope: !260, file: !9, line: 569, baseType: !511, size: 128, offset: 19968)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "seq_prev_type", scope: !260, file: !9, line: 572, baseType: !81, size: 8, offset: 20096)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "seq_rend_type", scope: !260, file: !9, line: 573, baseType: !81, size: 8, offset: 20104)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "seq_flag", scope: !260, file: !9, line: 574, baseType: !81, size: 8, offset: 20112)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "pad5", scope: !260, file: !9, line: 575, baseType: !89, size: 40, offset: 20120)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "simplify_flag", scope: !260, file: !9, line: 578, baseType: !6, size: 32, offset: 20160)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "simplify_subsurf", scope: !260, file: !9, line: 579, baseType: !38, size: 16, offset: 20192)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "simplify_shadowsamples", scope: !260, file: !9, line: 580, baseType: !38, size: 16, offset: 20208)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "simplify_particles", scope: !260, file: !9, line: 581, baseType: !61, size: 32, offset: 20224)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "simplify_aosss", scope: !260, file: !9, line: 582, baseType: !61, size: 32, offset: 20256)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "cineonwhite", scope: !260, file: !9, line: 585, baseType: !38, size: 16, offset: 20288)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "cineonblack", scope: !260, file: !9, line: 585, baseType: !38, size: 16, offset: 20304)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "cineongamma", scope: !260, file: !9, line: 586, baseType: !61, size: 32, offset: 20320)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "jp2_preset", scope: !260, file: !9, line: 589, baseType: !38, size: 16, offset: 20352)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "jp2_depth", scope: !260, file: !9, line: 589, baseType: !38, size: 16, offset: 20368)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "rpad3", scope: !260, file: !9, line: 590, baseType: !6, size: 32, offset: 20384)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "domeres", scope: !260, file: !9, line: 593, baseType: !38, size: 16, offset: 20416)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "domemode", scope: !260, file: !9, line: 593, baseType: !38, size: 16, offset: 20432)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "domeangle", scope: !260, file: !9, line: 594, baseType: !38, size: 16, offset: 20448)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "dometilt", scope: !260, file: !9, line: 594, baseType: !38, size: 16, offset: 20464)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "domeresbuf", scope: !260, file: !9, line: 595, baseType: !61, size: 32, offset: 20480)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !260, file: !9, line: 596, baseType: !61, size: 32, offset: 20512)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "dometext", scope: !260, file: !9, line: 597, baseType: !535, size: 64, offset: 20544)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DICompositeType(tag: DW_TAG_structure_type, name: "Text", file: !537, line: 44, flags: DIFlagFwdDecl)
!537 = !DIFile(filename: "blender/source/blender/makesdna/DNA_freestyle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!538 = !DIDerivedType(tag: DW_TAG_member, name: "line_thickness_mode", scope: !260, file: !9, line: 600, baseType: !6, size: 32, offset: 20608)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "unit_line_thickness", scope: !260, file: !9, line: 601, baseType: !61, size: 32, offset: 20640)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "engine", scope: !260, file: !9, line: 604, baseType: !541, size: 256, offset: 20672)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 256, elements: !542)
!542 = !{!543}
!543 = !DISubrange(count: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "bake", scope: !260, file: !9, line: 607, baseType: !545, size: 10880, offset: 20928)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BakeData", file: !9, line: 364, size: 10880, elements: !546)
!546 = !{!547, !548, !549, !550, !551, !552, !553, !554, !555, !557, !558, !559, !560}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "im_format", scope: !545, file: !9, line: 365, baseType: !263, size: 1984)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !545, file: !9, line: 367, baseType: !165, size: 8192, offset: 1984)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !545, file: !9, line: 369, baseType: !38, size: 16, offset: 10176)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !545, file: !9, line: 369, baseType: !38, size: 16, offset: 10192)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !545, file: !9, line: 370, baseType: !38, size: 16, offset: 10208)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !545, file: !9, line: 370, baseType: !38, size: 16, offset: 10224)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "cage_extrusion", scope: !545, file: !9, line: 372, baseType: !61, size: 32, offset: 10240)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !545, file: !9, line: 373, baseType: !61, size: 32, offset: 10272)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "normal_swizzle", scope: !545, file: !9, line: 375, baseType: !556, size: 24, offset: 10304)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 24, elements: !58)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "normal_space", scope: !545, file: !9, line: 376, baseType: !81, size: 8, offset: 10328)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "save_mode", scope: !545, file: !9, line: 378, baseType: !81, size: 8, offset: 10336)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !545, file: !9, line: 379, baseType: !556, size: 24, offset: 10344)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "cage", scope: !545, file: !9, line: 381, baseType: !193, size: 512, offset: 10368)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "preview_start_resolution", scope: !260, file: !9, line: 609, baseType: !6, size: 32, offset: 31808)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !260, file: !9, line: 610, baseType: !6, size: 32, offset: 31840)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "audio", scope: !143, file: !9, line: 1252, baseType: !564, size: 256, offset: 34112)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AudioData", file: !9, line: 158, size: 256, elements: !565)
!565 = !{!566, !567, !568, !569, !570, !571, !572, !573, !574}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "mixrate", scope: !564, file: !9, line: 159, baseType: !6, size: 32)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !564, file: !9, line: 160, baseType: !61, size: 32, offset: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "speed_of_sound", scope: !564, file: !9, line: 161, baseType: !61, size: 32, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "doppler_factor", scope: !564, file: !9, line: 162, baseType: !61, size: 32, offset: 96)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "distance_model", scope: !564, file: !9, line: 163, baseType: !6, size: 32, offset: 128)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !564, file: !9, line: 164, baseType: !38, size: 16, offset: 160)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !564, file: !9, line: 165, baseType: !38, size: 16, offset: 176)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !564, file: !9, line: 166, baseType: !61, size: 32, offset: 192)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !564, file: !9, line: 167, baseType: !61, size: 32, offset: 224)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !143, file: !9, line: 1254, baseType: !203, size: 128, offset: 34368)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "transform_spaces", scope: !143, file: !9, line: 1255, baseType: !203, size: 128, offset: 34496)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "sound_scene", scope: !143, file: !9, line: 1257, baseType: !28, size: 64, offset: 34624)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "sound_scene_handle", scope: !143, file: !9, line: 1258, baseType: !28, size: 64, offset: 34688)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "sound_scrub_handle", scope: !143, file: !9, line: 1259, baseType: !28, size: 64, offset: 34752)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handles", scope: !143, file: !9, line: 1260, baseType: !28, size: 64, offset: 34816)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "fps_info", scope: !143, file: !9, line: 1262, baseType: !28, size: 64, offset: 34880)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "theDag", scope: !143, file: !9, line: 1265, baseType: !583, size: 64, offset: 34944)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DICompositeType(tag: DW_TAG_structure_type, name: "DagForest", file: !9, line: 1265, flags: DIFlagFwdDecl)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "dagflags", scope: !143, file: !9, line: 1266, baseType: !38, size: 16, offset: 35008)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !143, file: !9, line: 1267, baseType: !38, size: 16, offset: 35024)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "active_keyingset", scope: !143, file: !9, line: 1270, baseType: !6, size: 32, offset: 35040)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "keyingsets", scope: !143, file: !9, line: 1271, baseType: !203, size: 128, offset: 35072)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "framing", scope: !143, file: !9, line: 1274, baseType: !590, size: 128, offset: 35200)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameFraming", file: !9, line: 650, size: 128, elements: !591)
!591 = !{!592, !593, !594, !595, !596}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !590, file: !9, line: 651, baseType: !112, size: 96)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !590, file: !9, line: 652, baseType: !81, size: 8, offset: 96)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !590, file: !9, line: 652, baseType: !81, size: 8, offset: 104)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !590, file: !9, line: 652, baseType: !81, size: 8, offset: 112)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !590, file: !9, line: 652, baseType: !81, size: 8, offset: 120)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "gm", scope: !143, file: !9, line: 1275, baseType: !598, size: 1472, offset: 35328)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameData", file: !9, line: 676, size: 1472, elements: !599)
!599 = !{!600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !612, !622, !623, !624, !625, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "framing", scope: !598, file: !9, line: 679, baseType: !590, size: 128)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "playerflag", scope: !598, file: !9, line: 680, baseType: !38, size: 16, offset: 128)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "xplay", scope: !598, file: !9, line: 680, baseType: !38, size: 16, offset: 144)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "yplay", scope: !598, file: !9, line: 680, baseType: !38, size: 16, offset: 160)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "freqplay", scope: !598, file: !9, line: 680, baseType: !38, size: 16, offset: 176)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !598, file: !9, line: 681, baseType: !38, size: 16, offset: 192)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "attrib", scope: !598, file: !9, line: 681, baseType: !38, size: 16, offset: 208)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "rt1", scope: !598, file: !9, line: 681, baseType: !38, size: 16, offset: 224)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "rt2", scope: !598, file: !9, line: 681, baseType: !38, size: 16, offset: 240)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "aasamples", scope: !598, file: !9, line: 682, baseType: !38, size: 16, offset: 256)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "pad4", scope: !598, file: !9, line: 682, baseType: !611, size: 48, offset: 272)
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 48, elements: !58)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "dome", scope: !598, file: !9, line: 685, baseType: !613, size: 192, offset: 320)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameDome", file: !9, line: 633, size: 192, elements: !614)
!614 = !{!615, !616, !617, !618, !619, !620, !621}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "res", scope: !613, file: !9, line: 634, baseType: !38, size: 16)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !613, file: !9, line: 634, baseType: !38, size: 16, offset: 16)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "angle", scope: !613, file: !9, line: 635, baseType: !38, size: 16, offset: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "tilt", scope: !613, file: !9, line: 635, baseType: !38, size: 16, offset: 48)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "resbuf", scope: !613, file: !9, line: 636, baseType: !61, size: 32, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !613, file: !9, line: 636, baseType: !61, size: 32, offset: 96)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "warptext", scope: !613, file: !9, line: 637, baseType: !535, size: 64, offset: 128)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "stereoflag", scope: !598, file: !9, line: 686, baseType: !38, size: 16, offset: 512)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "stereomode", scope: !598, file: !9, line: 686, baseType: !38, size: 16, offset: 528)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "eyeseparation", scope: !598, file: !9, line: 687, baseType: !61, size: 32, offset: 544)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "recastData", scope: !598, file: !9, line: 688, baseType: !626, size: 448, offset: 576)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "RecastData", file: !9, line: 674, baseType: !627)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RecastData", file: !9, line: 659, size: 448, elements: !628)
!628 = !{!629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "cellsize", scope: !627, file: !9, line: 660, baseType: !61, size: 32)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "cellheight", scope: !627, file: !9, line: 661, baseType: !61, size: 32, offset: 32)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "agentmaxslope", scope: !627, file: !9, line: 662, baseType: !61, size: 32, offset: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "agentmaxclimb", scope: !627, file: !9, line: 663, baseType: !61, size: 32, offset: 96)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "agentheight", scope: !627, file: !9, line: 664, baseType: !61, size: 32, offset: 128)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "agentradius", scope: !627, file: !9, line: 665, baseType: !61, size: 32, offset: 160)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "edgemaxlen", scope: !627, file: !9, line: 666, baseType: !61, size: 32, offset: 192)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "edgemaxerror", scope: !627, file: !9, line: 667, baseType: !61, size: 32, offset: 224)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "regionminsize", scope: !627, file: !9, line: 668, baseType: !61, size: 32, offset: 256)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "regionmergesize", scope: !627, file: !9, line: 669, baseType: !61, size: 32, offset: 288)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "vertsperpoly", scope: !627, file: !9, line: 670, baseType: !6, size: 32, offset: 320)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "detailsampledist", scope: !627, file: !9, line: 671, baseType: !61, size: 32, offset: 352)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "detailsamplemaxerror", scope: !627, file: !9, line: 672, baseType: !61, size: 32, offset: 384)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !627, file: !9, line: 673, baseType: !38, size: 16, offset: 416)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !627, file: !9, line: 673, baseType: !38, size: 16, offset: 432)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !598, file: !9, line: 692, baseType: !61, size: 32, offset: 1024)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !598, file: !9, line: 697, baseType: !61, size: 32, offset: 1056)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !598, file: !9, line: 703, baseType: !6, size: 32, offset: 1088)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !598, file: !9, line: 704, baseType: !38, size: 16, offset: 1120)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "matmode", scope: !598, file: !9, line: 704, baseType: !38, size: 16, offset: 1136)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !598, file: !9, line: 705, baseType: !38, size: 16, offset: 1152)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !598, file: !9, line: 706, baseType: !38, size: 16, offset: 1168)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "exitkey", scope: !598, file: !9, line: 707, baseType: !38, size: 16, offset: 1184)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "vsync", scope: !598, file: !9, line: 708, baseType: !38, size: 16, offset: 1200)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !598, file: !9, line: 709, baseType: !38, size: 16, offset: 1216)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !598, file: !9, line: 709, baseType: !38, size: 16, offset: 1232)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !598, file: !9, line: 709, baseType: !38, size: 16, offset: 1248)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !598, file: !9, line: 709, baseType: !38, size: 16, offset: 1264)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleSimulation", scope: !598, file: !9, line: 710, baseType: !38, size: 16, offset: 1280)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "raster_storage", scope: !598, file: !9, line: 711, baseType: !38, size: 16, offset: 1296)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "levelHeight", scope: !598, file: !9, line: 712, baseType: !61, size: 32, offset: 1312)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "deactivationtime", scope: !598, file: !9, line: 713, baseType: !61, size: 32, offset: 1344)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "lineardeactthreshold", scope: !598, file: !9, line: 713, baseType: !61, size: 32, offset: 1376)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "angulardeactthreshold", scope: !598, file: !9, line: 713, baseType: !61, size: 32, offset: 1408)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !598, file: !9, line: 713, baseType: !61, size: 32, offset: 1440)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !143, file: !9, line: 1278, baseType: !665, size: 64, offset: 36800)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UnitSettings", file: !9, line: 1197, size: 64, elements: !666)
!666 = !{!667, !668, !669, !670}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "scale_length", scope: !665, file: !9, line: 1199, baseType: !61, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "system", scope: !665, file: !9, line: 1200, baseType: !81, size: 8, offset: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "system_rotation", scope: !665, file: !9, line: 1201, baseType: !81, size: 8, offset: 40)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !665, file: !9, line: 1202, baseType: !38, size: 16, offset: 48)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !143, file: !9, line: 1281, baseType: !672, size: 64, offset: 36864)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !9, line: 61, flags: DIFlagFwdDecl)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "physics_settings", scope: !143, file: !9, line: 1284, baseType: !675, size: 192, offset: 36928)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PhysicsSettings", file: !9, line: 1208, size: 192, elements: !676)
!676 = !{!677, !678, !679, !680}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !675, file: !9, line: 1209, baseType: !112, size: 96)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !675, file: !9, line: 1210, baseType: !6, size: 32, offset: 96)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "quick_cache_step", scope: !675, file: !9, line: 1210, baseType: !6, size: 32, offset: 128)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !675, file: !9, line: 1210, baseType: !6, size: 32, offset: 160)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !143, file: !9, line: 1287, baseType: !682, size: 64, offset: 37120)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !9, line: 62, flags: DIFlagFwdDecl)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !143, file: !9, line: 1289, baseType: !685, size: 64, offset: 37184)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !686, line: 27, baseType: !687)
!686 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !688, line: 45, baseType: !689)
!688 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!689 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask_modal", scope: !143, file: !9, line: 1290, baseType: !685, size: 64, offset: 37248)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "view_settings", scope: !143, file: !9, line: 1293, baseType: !283, size: 1280, offset: 37312)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "display_settings", scope: !143, file: !9, line: 1294, baseType: !343, size: 512, offset: 38592)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "sequencer_colorspace_settings", scope: !143, file: !9, line: 1295, baseType: !694, size: 512, offset: 39104)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !284, line: 182, baseType: !695)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !284, line: 180, size: 512, elements: !696)
!696 = !{!697}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !695, file: !284, line: 181, baseType: !193, size: 512)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_world", scope: !143, file: !9, line: 1298, baseType: !699, size: 64, offset: 39616)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyWorld", file: !9, line: 1298, flags: DIFlagFwdDecl)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !115, file: !9, line: 884, baseType: !66, size: 64, offset: 1280)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_size", scope: !10, file: !9, line: 1107, baseType: !61, size: 32, offset: 2688)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "select_thresh", scope: !10, file: !9, line: 1110, baseType: !61, size: 32, offset: 2720)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_mode", scope: !10, file: !9, line: 1113, baseType: !38, size: 16, offset: 2752)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_flag", scope: !10, file: !9, line: 1113, baseType: !38, size: 16, offset: 2768)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "multires_subdiv_type", scope: !10, file: !9, line: 1116, baseType: !81, size: 8, offset: 2784)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !10, file: !9, line: 1117, baseType: !245, size: 8, offset: 2792)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_resolution", scope: !10, file: !9, line: 1120, baseType: !38, size: 16, offset: 2800)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_internal", scope: !10, file: !9, line: 1121, baseType: !61, size: 32, offset: 2816)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_external", scope: !10, file: !9, line: 1122, baseType: !61, size: 32, offset: 2848)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_ratio", scope: !10, file: !9, line: 1123, baseType: !61, size: 32, offset: 2880)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_limit", scope: !10, file: !9, line: 1124, baseType: !61, size: 32, offset: 2912)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_angle_limit", scope: !10, file: !9, line: 1125, baseType: !61, size: 32, offset: 2944)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_correlation_limit", scope: !10, file: !9, line: 1126, baseType: !61, size: 32, offset: 2976)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_symmetry_limit", scope: !10, file: !9, line: 1127, baseType: !61, size: 32, offset: 3008)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_angle_weight", scope: !10, file: !9, line: 1128, baseType: !61, size: 32, offset: 3040)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_length_weight", scope: !10, file: !9, line: 1129, baseType: !61, size: 32, offset: 3072)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_distance_weight", scope: !10, file: !9, line: 1130, baseType: !61, size: 32, offset: 3104)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_options", scope: !10, file: !9, line: 1131, baseType: !38, size: 16, offset: 3136)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro", scope: !10, file: !9, line: 1132, baseType: !81, size: 8, offset: 3152)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro_passes", scope: !10, file: !9, line: 1133, baseType: !81, size: 8, offset: 3160)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivisions", scope: !10, file: !9, line: 1134, baseType: !556, size: 24, offset: 3168)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_multi_level", scope: !10, file: !9, line: 1135, baseType: !81, size: 8, offset: 3192)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_template", scope: !10, file: !9, line: 1138, baseType: !66, size: 64, offset: 3200)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching", scope: !10, file: !9, line: 1139, baseType: !81, size: 8, offset: 3264)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching_convert", scope: !10, file: !9, line: 1140, baseType: !81, size: 8, offset: 3272)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivision_number", scope: !10, file: !9, line: 1141, baseType: !81, size: 8, offset: 3280)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_options", scope: !10, file: !9, line: 1142, baseType: !81, size: 8, offset: 3288)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_roll", scope: !10, file: !9, line: 1143, baseType: !81, size: 8, offset: 3296)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_side_string", scope: !10, file: !9, line: 1144, baseType: !731, size: 64, offset: 3304)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 64, elements: !732)
!732 = !{!733}
!733 = !DISubrange(count: 8)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_num_string", scope: !10, file: !9, line: 1145, baseType: !731, size: 64, offset: 3368)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode", scope: !10, file: !9, line: 1148, baseType: !81, size: 8, offset: 3432)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode_live_unwrap", scope: !10, file: !9, line: 1149, baseType: !81, size: 8, offset: 3440)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "snap_mode", scope: !10, file: !9, line: 1152, baseType: !81, size: 8, offset: 3448)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "snap_node_mode", scope: !10, file: !9, line: 1152, baseType: !81, size: 8, offset: 3456)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "snap_uv_mode", scope: !10, file: !9, line: 1153, baseType: !81, size: 8, offset: 3464)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "snap_flag", scope: !10, file: !9, line: 1154, baseType: !38, size: 16, offset: 3472)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "snap_target", scope: !10, file: !9, line: 1154, baseType: !38, size: 16, offset: 3488)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "proportional", scope: !10, file: !9, line: 1155, baseType: !38, size: 16, offset: 3504)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "prop_mode", scope: !10, file: !9, line: 1155, baseType: !38, size: 16, offset: 3520)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_objects", scope: !10, file: !9, line: 1156, baseType: !81, size: 8, offset: 3536)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_mask", scope: !10, file: !9, line: 1157, baseType: !81, size: 8, offset: 3544)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "auto_normalize", scope: !10, file: !9, line: 1159, baseType: !81, size: 8, offset: 3552)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "multipaint", scope: !10, file: !9, line: 1160, baseType: !81, size: 8, offset: 3560)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "weightuser", scope: !10, file: !9, line: 1161, baseType: !81, size: 8, offset: 3568)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "vgroupsubset", scope: !10, file: !9, line: 1162, baseType: !81, size: 8, offset: 3576)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "use_uv_sculpt", scope: !10, file: !9, line: 1165, baseType: !6, size: 32, offset: 3584)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "uv_sculpt_settings", scope: !10, file: !9, line: 1166, baseType: !6, size: 32, offset: 3616)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "uv_sculpt_tool", scope: !10, file: !9, line: 1167, baseType: !6, size: 32, offset: 3648)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "uv_relax_method", scope: !10, file: !9, line: 1168, baseType: !6, size: 32, offset: 3680)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_settings", scope: !10, file: !9, line: 1171, baseType: !38, size: 16, offset: 3712)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "pad5", scope: !10, file: !9, line: 1171, baseType: !38, size: 16, offset: 3728)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_size", scope: !10, file: !9, line: 1172, baseType: !6, size: 32, offset: 3744)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_unprojected_radius", scope: !10, file: !9, line: 1173, baseType: !61, size: 32, offset: 3776)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_alpha", scope: !10, file: !9, line: 1174, baseType: !61, size: 32, offset: 3808)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "unified_paint_settings", scope: !10, file: !9, line: 1177, baseType: !760, size: 1024, offset: 3840)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UnifiedPaintSettings", file: !9, line: 963, size: 1024, elements: !761)
!761 = !{!762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !776, !777, !778, !779, !780, !781, !782, !783, !786, !787}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !760, file: !9, line: 965, baseType: !6, size: 32)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "unprojected_radius", scope: !760, file: !9, line: 968, baseType: !61, size: 32, offset: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !760, file: !9, line: 971, baseType: !61, size: 32, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !760, file: !9, line: 974, baseType: !61, size: 32, offset: 96)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "rgb", scope: !760, file: !9, line: 977, baseType: !112, size: 96, offset: 128)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "secondary_rgb", scope: !760, file: !9, line: 979, baseType: !112, size: 96, offset: 224)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !760, file: !9, line: 982, baseType: !6, size: 32, offset: 320)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "last_rake", scope: !760, file: !9, line: 987, baseType: !322, size: 64, offset: 352)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "brush_rotation", scope: !760, file: !9, line: 989, baseType: !61, size: 32, offset: 416)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "draw_anchored", scope: !760, file: !9, line: 994, baseType: !6, size: 32, offset: 448)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "anchored_size", scope: !760, file: !9, line: 995, baseType: !6, size: 32, offset: 480)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "draw_inverted", scope: !760, file: !9, line: 997, baseType: !81, size: 8, offset: 512)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !760, file: !9, line: 998, baseType: !775, size: 56, offset: 520)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 56, elements: !132)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "overlap_factor", scope: !760, file: !9, line: 1000, baseType: !61, size: 32, offset: 576)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "anchored_initial_mouse", scope: !760, file: !9, line: 1003, baseType: !322, size: 64, offset: 608)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "stroke_active", scope: !760, file: !9, line: 1006, baseType: !6, size: 32, offset: 672)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "size_pressure_value", scope: !760, file: !9, line: 1009, baseType: !61, size: 32, offset: 704)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "tex_mouse", scope: !760, file: !9, line: 1012, baseType: !322, size: 64, offset: 736)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "mask_tex_mouse", scope: !760, file: !9, line: 1015, baseType: !322, size: 64, offset: 800)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "do_linear_conversion", scope: !760, file: !9, line: 1018, baseType: !6, size: 32, offset: 864)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !760, file: !9, line: 1019, baseType: !784, size: 64, offset: 896)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !9, line: 63, flags: DIFlagFwdDecl)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_radius", scope: !760, file: !9, line: 1023, baseType: !61, size: 32, offset: 960)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "pad4", scope: !760, file: !9, line: 1024, baseType: !6, size: 32, offset: 992)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "statvis", scope: !10, file: !9, line: 1179, baseType: !789, size: 320, offset: 4864)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MeshStatVis", file: !9, line: 1043, size: 320, elements: !790)
!790 = !{!791, !792, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !789, file: !9, line: 1044, baseType: !81, size: 8)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_pad1", scope: !789, file: !9, line: 1045, baseType: !793, size: 16, offset: 8)
!793 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 16, elements: !102)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_axis", scope: !789, file: !9, line: 1048, baseType: !81, size: 8, offset: 24)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_min", scope: !789, file: !9, line: 1049, baseType: !61, size: 32, offset: 32)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_max", scope: !789, file: !9, line: 1049, baseType: !61, size: 32, offset: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_min", scope: !789, file: !9, line: 1052, baseType: !61, size: 32, offset: 96)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_max", scope: !789, file: !9, line: 1052, baseType: !61, size: 32, offset: 128)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_samples", scope: !789, file: !9, line: 1053, baseType: !81, size: 8, offset: 160)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_pad2", scope: !789, file: !9, line: 1054, baseType: !556, size: 24, offset: 168)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "distort_min", scope: !789, file: !9, line: 1057, baseType: !61, size: 32, offset: 192)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "distort_max", scope: !789, file: !9, line: 1057, baseType: !61, size: 32, offset: 224)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "sharp_min", scope: !789, file: !9, line: 1060, baseType: !61, size: 32, offset: 256)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "sharp_max", scope: !789, file: !9, line: 1060, baseType: !61, size: 32, offset: 288)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "BArcIterator", file: !807, line: 123, baseType: !808)
!807 = !DIFile(filename: "blender/source/blender/blenlib/BLI_graph.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BArcIterator", file: !807, line: 109, size: 704, elements: !809)
!809 = !{!810, !815, !817, !822, !824, !826, !828, !833, !835, !836, !837, !838}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !808, file: !807, line: 110, baseType: !811, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "HeadFct", file: !807, line: 101, baseType: !812)
