; ModuleID = 'blender/source/blender/blenkernel/intern/library_query.c'
source_filename = "blender/source/blender/blenkernel/intern/library_query.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.FileData = type opaque
%struct.PackedFile = type opaque
%struct.IDProperty = type { %struct.IDProperty*, %struct.IDProperty*, i8, i8, i16, [64 x i8], i32, %struct.IDPropertyData, i32, i32 }
%struct.IDPropertyData = type { i8*, %struct.ListBase, i32, i32 }
%struct.ListBase = type { i8*, i8* }
%struct.AnimData = type { %struct.bAction*, %struct.bAction*, %struct.AnimMapper*, %struct.ListBase, %struct.NlaStrip*, %struct.ListBase, %struct.ListBase, i32, i32, i16, i16, float }
%struct.bAction = type { %struct.ID, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, i32, i32, i32, i32 }
%struct.AnimMapper = type { %struct.AnimMapper*, %struct.AnimMapper*, %struct.bAction*, %struct.ListBase }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !13, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/blenkernel/intern/library_query.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !10}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 37, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_library_query.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9}
!7 = !DIEnumerator(name: "IDWALK_NOP", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "IDWALK_NEVER_NULL", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "IDWALK_NEVER_SELF", value: 2, isUnsigned: true)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 50, baseType: !5, size: 32, elements: !11)
!11 = !{!12}
!12 = !DIEnumerator(name: "IDWALK_READONLY", value: 1, isUnsigned: true)
!13 = !{!14, !16, !18, !2461, !2462, !2464, !2629, !2739, !2788, !2790, !2792, !2840, !2920, !2945, !2947, !2978, !2980, !3000, !3002, !3004, !3006, !3191, !3193, !3195, !3245, !3257, !3266, !3277, !3290}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "Scene", file: !20, line: 1299, baseType: !21)
!20 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !20, line: 1216, size: 39680, elements: !22)
!22 = !{!23, !93, !164, !1254, !1335, !1336, !1337, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1738, !2060, !2063, !2337, !2349, !2350, !2351, !2352, !2353, !2354, !2355, !2356, !2359, !2360, !2361, !2362, !2363, !2371, !2437, !2444, !2445, !2452, !2453, !2454, !2455, !2456, !2457, !2458}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !21, file: !20, line: 1217, baseType: !24, size: 960)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !25, line: 130, baseType: !26)
!25 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !25, line: 117, size: 960, elements: !27)
!27 = !{!28, !30, !31, !33, !52, !56, !57, !59, !60, !61}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !26, file: !25, line: 118, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !26, file: !25, line: 118, baseType: !29, size: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !26, file: !25, line: 119, baseType: !32, size: 64, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !26, file: !25, line: 120, baseType: !34, size: 64, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !25, line: 136, size: 17600, elements: !36)
!36 = !{!37, !38, !40, !43, !47, !48, !49}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !35, file: !25, line: 137, baseType: !24, size: 960)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !35, file: !25, line: 138, baseType: !39, size: 64, offset: 960)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !35, file: !25, line: 139, baseType: !41, size: 64, offset: 1024)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !25, line: 43, flags: DIFlagFwdDecl)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !35, file: !25, line: 140, baseType: !44, size: 8192, offset: 1088)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 8192, elements: !45)
!45 = !{!46}
!46 = !DISubrange(count: 1024)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !35, file: !25, line: 141, baseType: !44, size: 8192, offset: 9280)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !35, file: !25, line: 148, baseType: !34, size: 64, offset: 17472)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !35, file: !25, line: 150, baseType: !50, size: 64, offset: 17536)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !25, line: 45, flags: DIFlagFwdDecl)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !26, file: !25, line: 121, baseType: !53, size: 528, offset: 256)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 528, elements: !54)
!54 = !{!55}
!55 = !DISubrange(count: 66)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !26, file: !25, line: 126, baseType: !17, size: 16, offset: 784)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !26, file: !25, line: 127, baseType: !58, size: 32, offset: 800)
!58 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !26, file: !25, line: 128, baseType: !58, size: 32, offset: 832)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !26, file: !25, line: 128, baseType: !58, size: 32, offset: 864)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !26, file: !25, line: 129, baseType: !62, size: 64, offset: 896)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !25, line: 75, baseType: !64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !25, line: 62, size: 1024, elements: !65)
!65 = !{!66, !68, !69, !70, !71, !72, !76, !77, !91, !92}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !64, file: !25, line: 63, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !64, file: !25, line: 63, baseType: !67, size: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !64, file: !25, line: 64, baseType: !15, size: 8, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !64, file: !25, line: 64, baseType: !15, size: 8, offset: 136)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !64, file: !25, line: 65, baseType: !17, size: 16, offset: 144)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !64, file: !25, line: 66, baseType: !73, size: 512, offset: 160)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 512, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !64, file: !25, line: 67, baseType: !58, size: 32, offset: 672)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !64, file: !25, line: 69, baseType: !78, size: 256, offset: 704)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !25, line: 60, baseType: !79)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !25, line: 48, size: 256, elements: !80)
!80 = !{!81, !82, !89, !90}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !79, file: !25, line: 49, baseType: !29, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !79, file: !25, line: 58, baseType: !83, size: 128, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !84, line: 71, baseType: !85)
!84 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !84, line: 69, size: 128, elements: !86)
!86 = !{!87, !88}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !85, file: !84, line: 70, baseType: !29, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !85, file: !84, line: 70, baseType: !29, size: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !79, file: !25, line: 59, baseType: !58, size: 32, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !79, file: !25, line: 59, baseType: !58, size: 32, offset: 224)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !64, file: !25, line: 70, baseType: !58, size: 32, offset: 960)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !64, file: !25, line: 74, baseType: !58, size: 32, offset: 992)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !21, file: !20, line: 1218, baseType: !94, size: 64, offset: 960)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !96, line: 838, size: 768, elements: !97)
!96 = !DIFile(filename: "blender/source/blender/makesdna/DNA_anim_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!97 = !{!98, !113, !114, !124, !125, !157, !158, !159, !160, !161, !162, !163}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !95, file: !96, line: 840, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !101, line: 499, baseType: !102)
!101 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !101, line: 486, size: 1600, elements: !103)
!103 = !{!104, !105, !106, !107, !108, !109, !110, !111, !112}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !102, file: !101, line: 487, baseType: !24, size: 960)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !102, file: !101, line: 489, baseType: !83, size: 128, offset: 960)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !102, file: !101, line: 490, baseType: !83, size: 128, offset: 1088)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !102, file: !101, line: 491, baseType: !83, size: 128, offset: 1216)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !102, file: !101, line: 492, baseType: !83, size: 128, offset: 1344)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !102, file: !101, line: 494, baseType: !58, size: 32, offset: 1472)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !102, file: !101, line: 495, baseType: !58, size: 32, offset: 1504)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !102, file: !101, line: 497, baseType: !58, size: 32, offset: 1536)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !102, file: !101, line: 498, baseType: !58, size: 32, offset: 1568)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !95, file: !96, line: 844, baseType: !99, size: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !95, file: !96, line: 848, baseType: !115, size: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !96, line: 549, baseType: !117)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !96, line: 544, size: 320, elements: !118)
!118 = !{!119, !121, !122, !123}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !117, file: !96, line: 545, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !117, file: !96, line: 545, baseType: !120, size: 64, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !117, file: !96, line: 547, baseType: !99, size: 64, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !117, file: !96, line: 548, baseType: !83, size: 128, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !95, file: !96, line: 851, baseType: !83, size: 128, offset: 192)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !95, file: !96, line: 853, baseType: !126, size: 64, offset: 320)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !96, line: 594, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !96, line: 561, size: 1664, elements: !129)
!129 = !{!130, !132, !133, !134, !135, !136, !137, !138, !139, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !128, file: !96, line: 562, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !128, file: !96, line: 562, baseType: !131, size: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !128, file: !96, line: 564, baseType: !83, size: 128, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !128, file: !96, line: 565, baseType: !99, size: 64, offset: 256)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !128, file: !96, line: 566, baseType: !115, size: 64, offset: 320)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !128, file: !96, line: 568, baseType: !83, size: 128, offset: 384)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !128, file: !96, line: 569, baseType: !83, size: 128, offset: 512)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !128, file: !96, line: 571, baseType: !73, size: 512, offset: 640)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !128, file: !96, line: 573, baseType: !140, size: 32, offset: 1152)
!140 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "strip_time", scope: !128, file: !96, line: 574, baseType: !140, size: 32, offset: 1184)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !128, file: !96, line: 576, baseType: !140, size: 32, offset: 1216)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !128, file: !96, line: 576, baseType: !140, size: 32, offset: 1248)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "actstart", scope: !128, file: !96, line: 577, baseType: !140, size: 32, offset: 1280)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "actend", scope: !128, file: !96, line: 577, baseType: !140, size: 32, offset: 1312)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !128, file: !96, line: 579, baseType: !140, size: 32, offset: 1344)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !128, file: !96, line: 580, baseType: !140, size: 32, offset: 1376)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !128, file: !96, line: 582, baseType: !140, size: 32, offset: 1408)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !128, file: !96, line: 582, baseType: !140, size: 32, offset: 1440)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "blendmode", scope: !128, file: !96, line: 583, baseType: !17, size: 16, offset: 1472)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "extendmode", scope: !128, file: !96, line: 585, baseType: !17, size: 16, offset: 1488)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !128, file: !96, line: 586, baseType: !17, size: 16, offset: 1504)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !128, file: !96, line: 588, baseType: !17, size: 16, offset: 1520)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handle", scope: !128, file: !96, line: 590, baseType: !29, size: 64, offset: 1536)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !128, file: !96, line: 592, baseType: !58, size: 32, offset: 1600)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !128, file: !96, line: 593, baseType: !58, size: 32, offset: 1632)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "drivers", scope: !95, file: !96, line: 858, baseType: !83, size: 128, offset: 384)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "overrides", scope: !95, file: !96, line: 859, baseType: !83, size: 128, offset: 512)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !95, file: !96, line: 862, baseType: !58, size: 32, offset: 640)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !95, file: !96, line: 863, baseType: !58, size: 32, offset: 672)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "act_blendmode", scope: !95, file: !96, line: 866, baseType: !17, size: 16, offset: 704)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "act_extendmode", scope: !95, file: !96, line: 867, baseType: !17, size: 16, offset: 720)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "act_influence", scope: !95, file: !96, line: 868, baseType: !140, size: 32, offset: 736)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !21, file: !20, line: 1220, baseType: !165, size: 64, offset: 1024)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !167, line: 115, size: 11392, elements: !168)
!167 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!168 = !{!169, !170, !171, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !189, !200, !202, !203, !246, !247, !258, !259, !275, !276, !277, !278, !279, !280, !281, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1089, !1202, !1203, !1204, !1205, !1206, !1207, !1211, !1214, !1218, !1219, !1225, !1226, !1227, !1228, !1229, !1230, !1232, !1235, !1238, !1239, !1242, !1243}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !166, file: !167, line: 116, baseType: !24, size: 960)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !166, file: !167, line: 117, baseType: !94, size: 64, offset: 960)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !166, file: !167, line: 119, baseType: !172, size: 64, offset: 1024)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !167, line: 57, flags: DIFlagFwdDecl)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !166, file: !167, line: 121, baseType: !17, size: 16, offset: 1088)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !166, file: !167, line: 121, baseType: !17, size: 16, offset: 1104)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !166, file: !167, line: 122, baseType: !58, size: 32, offset: 1120)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !166, file: !167, line: 122, baseType: !58, size: 32, offset: 1152)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !166, file: !167, line: 122, baseType: !58, size: 32, offset: 1184)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !166, file: !167, line: 123, baseType: !73, size: 512, offset: 1216)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !166, file: !167, line: 124, baseType: !165, size: 64, offset: 1728)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !166, file: !167, line: 124, baseType: !165, size: 64, offset: 1792)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !166, file: !167, line: 127, baseType: !165, size: 64, offset: 1856)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !166, file: !167, line: 127, baseType: !165, size: 64, offset: 1920)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !166, file: !167, line: 127, baseType: !165, size: 64, offset: 1984)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !166, file: !167, line: 128, baseType: !186, size: 64, offset: 2048)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !188, line: 46, flags: DIFlagFwdDecl)
!188 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!189 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !166, file: !167, line: 130, baseType: !190, size: 64, offset: 2112)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !167, line: 97, size: 832, elements: !192)
!192 = !{!193, !198, !199}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !191, file: !167, line: 98, baseType: !194, size: 768)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 768, elements: !195)
!195 = !{!196, !197}
!196 = !DISubrange(count: 8)
!197 = !DISubrange(count: 3)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !191, file: !167, line: 99, baseType: !58, size: 32, offset: 768)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !191, file: !167, line: 99, baseType: !58, size: 32, offset: 800)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !166, file: !167, line: 131, baseType: !201, size: 64, offset: 2176)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !166, file: !167, line: 132, baseType: !201, size: 64, offset: 2240)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !166, file: !167, line: 133, baseType: !204, size: 64, offset: 2304)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !101, line: 334, size: 1728, elements: !206)
!206 = !{!207, !208, !211, !212, !213, !214, !215, !216, !219, !220, !221, !222, !223, !224, !225, !245}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !205, file: !101, line: 335, baseType: !83, size: 128)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !205, file: !101, line: 336, baseType: !209, size: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !101, line: 47, flags: DIFlagFwdDecl)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !205, file: !101, line: 338, baseType: !17, size: 16, offset: 192)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !205, file: !101, line: 338, baseType: !17, size: 16, offset: 208)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !205, file: !101, line: 339, baseType: !5, size: 32, offset: 224)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !205, file: !101, line: 340, baseType: !58, size: 32, offset: 256)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !205, file: !101, line: 342, baseType: !140, size: 32, offset: 288)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !205, file: !101, line: 343, baseType: !217, size: 96, offset: 320)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 96, elements: !218)
!218 = !{!197}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !205, file: !101, line: 344, baseType: !217, size: 96, offset: 416)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !205, file: !101, line: 347, baseType: !83, size: 128, offset: 512)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !205, file: !101, line: 349, baseType: !58, size: 32, offset: 640)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !205, file: !101, line: 350, baseType: !58, size: 32, offset: 672)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !205, file: !101, line: 351, baseType: !29, size: 64, offset: 704)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !205, file: !101, line: 352, baseType: !29, size: 64, offset: 768)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !205, file: !101, line: 354, baseType: !226, size: 384, offset: 832)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !101, line: 116, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !101, line: 94, size: 384, elements: !228)
!228 = !{!229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !227, file: !101, line: 96, baseType: !58, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !227, file: !101, line: 96, baseType: !58, size: 32, offset: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !227, file: !101, line: 97, baseType: !58, size: 32, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !227, file: !101, line: 97, baseType: !58, size: 32, offset: 96)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !227, file: !101, line: 99, baseType: !17, size: 16, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !227, file: !101, line: 100, baseType: !17, size: 16, offset: 144)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !227, file: !101, line: 102, baseType: !17, size: 16, offset: 160)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !227, file: !101, line: 105, baseType: !17, size: 16, offset: 176)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !227, file: !101, line: 108, baseType: !17, size: 16, offset: 192)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !227, file: !101, line: 109, baseType: !17, size: 16, offset: 208)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !227, file: !101, line: 111, baseType: !17, size: 16, offset: 224)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !227, file: !101, line: 112, baseType: !17, size: 16, offset: 240)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !227, file: !101, line: 114, baseType: !58, size: 32, offset: 256)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !227, file: !101, line: 114, baseType: !58, size: 32, offset: 288)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !227, file: !101, line: 115, baseType: !58, size: 32, offset: 320)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !227, file: !101, line: 115, baseType: !58, size: 32, offset: 352)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !205, file: !101, line: 355, baseType: !73, size: 512, offset: 1216)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !166, file: !167, line: 134, baseType: !29, size: 64, offset: 2368)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !166, file: !167, line: 136, baseType: !248, size: 64, offset: 2432)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !250, line: 130, size: 1216, elements: !251)
!250 = !DIFile(filename: "blender/source/blender/makesdna/DNA_gpencil_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!251 = !{!252, !253, !254, !255, !256, !257}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !249, file: !250, line: 131, baseType: !24, size: 960)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !249, file: !250, line: 134, baseType: !83, size: 128, offset: 960)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !249, file: !250, line: 135, baseType: !58, size: 32, offset: 1088)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "sbuffer_size", scope: !249, file: !250, line: 141, baseType: !17, size: 16, offset: 1120)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "sbuffer_sflag", scope: !249, file: !250, line: 142, baseType: !17, size: 16, offset: 1136)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "sbuffer", scope: !249, file: !250, line: 143, baseType: !29, size: 64, offset: 1152)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !166, file: !167, line: 138, baseType: !226, size: 384, offset: 2496)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !166, file: !167, line: 139, baseType: !260, size: 64, offset: 2880)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !101, line: 80, baseType: !262)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !101, line: 72, size: 192, elements: !263)
!263 = !{!264, !271, !272, !273, !274}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !262, file: !101, line: 73, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !101, line: 59, baseType: !267)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !101, line: 56, size: 128, elements: !268)
!268 = !{!269, !270}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !267, file: !101, line: 57, baseType: !217, size: 96)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !267, file: !101, line: 58, baseType: !58, size: 32, offset: 96)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !262, file: !101, line: 74, baseType: !58, size: 32, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !262, file: !101, line: 76, baseType: !58, size: 32, offset: 96)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !262, file: !101, line: 77, baseType: !58, size: 32, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !262, file: !101, line: 79, baseType: !58, size: 32, offset: 160)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !166, file: !167, line: 141, baseType: !83, size: 128, offset: 2944)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !166, file: !167, line: 142, baseType: !83, size: 128, offset: 3072)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !166, file: !167, line: 143, baseType: !83, size: 128, offset: 3200)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !166, file: !167, line: 144, baseType: !83, size: 128, offset: 3328)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !166, file: !167, line: 146, baseType: !58, size: 32, offset: 3456)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !166, file: !167, line: 147, baseType: !58, size: 32, offset: 3488)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !166, file: !167, line: 150, baseType: !282, size: 64, offset: 3520)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !285, line: 93, size: 7552, elements: !286)
!285 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!286 = !{!287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !335, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !404, !405, !406, !407, !408, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !878, !879, !880, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !926}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !284, file: !285, line: 94, baseType: !24, size: 960)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !284, file: !285, line: 95, baseType: !94, size: 64, offset: 960)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !284, file: !285, line: 97, baseType: !17, size: 16, offset: 1024)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !284, file: !285, line: 97, baseType: !17, size: 16, offset: 1040)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !284, file: !285, line: 99, baseType: !140, size: 32, offset: 1056)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !284, file: !285, line: 99, baseType: !140, size: 32, offset: 1088)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !284, file: !285, line: 99, baseType: !140, size: 32, offset: 1120)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !284, file: !285, line: 100, baseType: !140, size: 32, offset: 1152)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !284, file: !285, line: 100, baseType: !140, size: 32, offset: 1184)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !284, file: !285, line: 100, baseType: !140, size: 32, offset: 1216)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !284, file: !285, line: 101, baseType: !140, size: 32, offset: 1248)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !284, file: !285, line: 101, baseType: !140, size: 32, offset: 1280)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !284, file: !285, line: 101, baseType: !140, size: 32, offset: 1312)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !284, file: !285, line: 102, baseType: !140, size: 32, offset: 1344)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !284, file: !285, line: 102, baseType: !140, size: 32, offset: 1376)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !284, file: !285, line: 102, baseType: !140, size: 32, offset: 1408)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !284, file: !285, line: 103, baseType: !140, size: 32, offset: 1440)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !284, file: !285, line: 103, baseType: !140, size: 32, offset: 1472)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !284, file: !285, line: 103, baseType: !140, size: 32, offset: 1504)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !284, file: !285, line: 103, baseType: !140, size: 32, offset: 1536)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !284, file: !285, line: 103, baseType: !140, size: 32, offset: 1568)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !284, file: !285, line: 104, baseType: !140, size: 32, offset: 1600)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !284, file: !285, line: 104, baseType: !140, size: 32, offset: 1632)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !284, file: !285, line: 104, baseType: !140, size: 32, offset: 1664)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !284, file: !285, line: 104, baseType: !140, size: 32, offset: 1696)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !284, file: !285, line: 104, baseType: !140, size: 32, offset: 1728)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !284, file: !285, line: 105, baseType: !140, size: 32, offset: 1760)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !284, file: !285, line: 108, baseType: !315, size: 704, offset: 1792)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !285, line: 53, size: 704, elements: !316)
!316 = !{!317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !315, file: !285, line: 54, baseType: !140, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !315, file: !285, line: 55, baseType: !140, size: 32, offset: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !315, file: !285, line: 56, baseType: !140, size: 32, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !315, file: !285, line: 57, baseType: !140, size: 32, offset: 96)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !315, file: !285, line: 59, baseType: !217, size: 96, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !315, file: !285, line: 60, baseType: !217, size: 96, offset: 224)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !315, file: !285, line: 61, baseType: !217, size: 96, offset: 320)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !315, file: !285, line: 63, baseType: !140, size: 32, offset: 416)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !315, file: !285, line: 64, baseType: !140, size: 32, offset: 448)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !315, file: !285, line: 65, baseType: !140, size: 32, offset: 480)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !315, file: !285, line: 67, baseType: !17, size: 16, offset: 512)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !315, file: !285, line: 68, baseType: !17, size: 16, offset: 528)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !315, file: !285, line: 69, baseType: !17, size: 16, offset: 544)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !315, file: !285, line: 70, baseType: !17, size: 16, offset: 560)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !315, file: !285, line: 72, baseType: !140, size: 32, offset: 576)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !315, file: !285, line: 73, baseType: !140, size: 32, offset: 608)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !315, file: !285, line: 74, baseType: !140, size: 32, offset: 640)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !315, file: !285, line: 75, baseType: !140, size: 32, offset: 672)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !284, file: !285, line: 109, baseType: !336, size: 128, offset: 2496)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !285, line: 79, size: 128, elements: !337)
!337 = !{!338, !339, !340, !341}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !336, file: !285, line: 80, baseType: !58, size: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !336, file: !285, line: 81, baseType: !58, size: 32, offset: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !336, file: !285, line: 82, baseType: !58, size: 32, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !336, file: !285, line: 83, baseType: !58, size: 32, offset: 96)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !284, file: !285, line: 111, baseType: !140, size: 32, offset: 2624)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !284, file: !285, line: 111, baseType: !140, size: 32, offset: 2656)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !284, file: !285, line: 112, baseType: !140, size: 32, offset: 2688)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !284, file: !285, line: 112, baseType: !140, size: 32, offset: 2720)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !284, file: !285, line: 113, baseType: !140, size: 32, offset: 2752)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !284, file: !285, line: 114, baseType: !140, size: 32, offset: 2784)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !284, file: !285, line: 114, baseType: !140, size: 32, offset: 2816)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !284, file: !285, line: 115, baseType: !17, size: 16, offset: 2848)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !284, file: !285, line: 115, baseType: !17, size: 16, offset: 2864)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !284, file: !285, line: 116, baseType: !17, size: 16, offset: 2880)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !284, file: !285, line: 117, baseType: !15, size: 8, offset: 2896)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !284, file: !285, line: 117, baseType: !15, size: 8, offset: 2904)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !284, file: !285, line: 119, baseType: !140, size: 32, offset: 2912)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !284, file: !285, line: 119, baseType: !140, size: 32, offset: 2944)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !284, file: !285, line: 120, baseType: !17, size: 16, offset: 2976)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !284, file: !285, line: 120, baseType: !17, size: 16, offset: 2992)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !284, file: !285, line: 121, baseType: !140, size: 32, offset: 3008)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !284, file: !285, line: 121, baseType: !140, size: 32, offset: 3040)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !284, file: !285, line: 122, baseType: !140, size: 32, offset: 3072)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !284, file: !285, line: 123, baseType: !140, size: 32, offset: 3104)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !284, file: !285, line: 124, baseType: !17, size: 16, offset: 3136)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !284, file: !285, line: 125, baseType: !17, size: 16, offset: 3152)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !284, file: !285, line: 127, baseType: !58, size: 32, offset: 3168)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !284, file: !285, line: 127, baseType: !58, size: 32, offset: 3200)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !284, file: !285, line: 128, baseType: !58, size: 32, offset: 3232)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !284, file: !285, line: 128, baseType: !58, size: 32, offset: 3264)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !284, file: !285, line: 129, baseType: !17, size: 16, offset: 3296)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !284, file: !285, line: 129, baseType: !17, size: 16, offset: 3312)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !284, file: !285, line: 129, baseType: !17, size: 16, offset: 3328)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !284, file: !285, line: 129, baseType: !17, size: 16, offset: 3344)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !284, file: !285, line: 130, baseType: !140, size: 32, offset: 3360)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !284, file: !285, line: 130, baseType: !140, size: 32, offset: 3392)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !284, file: !285, line: 130, baseType: !140, size: 32, offset: 3424)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !284, file: !285, line: 130, baseType: !140, size: 32, offset: 3456)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !284, file: !285, line: 131, baseType: !140, size: 32, offset: 3488)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !284, file: !285, line: 131, baseType: !140, size: 32, offset: 3520)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !284, file: !285, line: 131, baseType: !140, size: 32, offset: 3552)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !284, file: !285, line: 131, baseType: !140, size: 32, offset: 3584)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !284, file: !285, line: 132, baseType: !140, size: 32, offset: 3616)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !284, file: !285, line: 132, baseType: !140, size: 32, offset: 3648)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !284, file: !285, line: 133, baseType: !73, size: 512, offset: 3680)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !284, file: !285, line: 135, baseType: !140, size: 32, offset: 4192)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !284, file: !285, line: 136, baseType: !140, size: 32, offset: 4224)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !284, file: !285, line: 137, baseType: !140, size: 32, offset: 4256)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !284, file: !285, line: 138, baseType: !58, size: 32, offset: 4288)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !284, file: !285, line: 141, baseType: !15, size: 8, offset: 4320)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !284, file: !285, line: 141, baseType: !15, size: 8, offset: 4328)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !284, file: !285, line: 141, baseType: !15, size: 8, offset: 4336)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !284, file: !285, line: 141, baseType: !15, size: 8, offset: 4344)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !284, file: !285, line: 142, baseType: !17, size: 16, offset: 4352)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !284, file: !285, line: 142, baseType: !17, size: 16, offset: 4368)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !284, file: !285, line: 142, baseType: !17, size: 16, offset: 4384)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !284, file: !285, line: 145, baseType: !15, size: 8, offset: 4400)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !284, file: !285, line: 145, baseType: !15, size: 8, offset: 4408)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !284, file: !285, line: 148, baseType: !17, size: 16, offset: 4416)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !284, file: !285, line: 148, baseType: !17, size: 16, offset: 4432)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !284, file: !285, line: 149, baseType: !140, size: 32, offset: 4448)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !284, file: !285, line: 149, baseType: !140, size: 32, offset: 4480)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !284, file: !285, line: 152, baseType: !401, size: 128, offset: 4512)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 128, elements: !402)
!402 = !{!403}
!403 = !DISubrange(count: 4)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !284, file: !285, line: 153, baseType: !140, size: 32, offset: 4640)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !284, file: !285, line: 154, baseType: !140, size: 32, offset: 4672)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !284, file: !285, line: 157, baseType: !17, size: 16, offset: 4704)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !284, file: !285, line: 157, baseType: !17, size: 16, offset: 4720)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !284, file: !285, line: 160, baseType: !409, size: 64, offset: 4736)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !188, line: 113, size: 6208, elements: !411)
!411 = !{!412, !413, !414, !415, !416, !417, !421}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !410, file: !188, line: 114, baseType: !17, size: 16)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !410, file: !188, line: 114, baseType: !17, size: 16, offset: 16)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !410, file: !188, line: 115, baseType: !15, size: 8, offset: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !410, file: !188, line: 115, baseType: !15, size: 8, offset: 40)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !410, file: !188, line: 116, baseType: !15, size: 8, offset: 48)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !410, file: !188, line: 117, baseType: !418, size: 8, offset: 56)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 8, elements: !419)
!419 = !{!420}
!420 = !DISubrange(count: 1)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !410, file: !188, line: 119, baseType: !422, size: 6144, offset: 64)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !423, size: 6144, elements: !432)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !188, line: 109, baseType: !424)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !188, line: 106, size: 192, elements: !425)
!425 = !{!426, !427, !428, !429, !430, !431}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !424, file: !188, line: 107, baseType: !140, size: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !424, file: !188, line: 107, baseType: !140, size: 32, offset: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !424, file: !188, line: 107, baseType: !140, size: 32, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !424, file: !188, line: 107, baseType: !140, size: 32, offset: 96)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !424, file: !188, line: 107, baseType: !140, size: 32, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !424, file: !188, line: 108, baseType: !58, size: 32, offset: 160)
!432 = !{!433}
!433 = !DISubrange(count: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !284, file: !285, line: 161, baseType: !409, size: 64, offset: 4800)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !284, file: !285, line: 162, baseType: !15, size: 8, offset: 4864)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !284, file: !285, line: 162, baseType: !15, size: 8, offset: 4872)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !284, file: !285, line: 163, baseType: !15, size: 8, offset: 4880)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !284, file: !285, line: 163, baseType: !15, size: 8, offset: 4888)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !284, file: !285, line: 164, baseType: !17, size: 16, offset: 4896)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !284, file: !285, line: 164, baseType: !17, size: 16, offset: 4912)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !284, file: !285, line: 165, baseType: !140, size: 32, offset: 4928)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !284, file: !285, line: 165, baseType: !140, size: 32, offset: 4960)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !284, file: !285, line: 167, baseType: !444, size: 1152, offset: 4992)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !445, size: 1152, elements: !876)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !188, line: 57, size: 2496, elements: !447)
!447 = !{!448, !449, !450, !451, !452, !453, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !446, file: !188, line: 59, baseType: !17, size: 16)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !446, file: !188, line: 59, baseType: !17, size: 16, offset: 16)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !446, file: !188, line: 59, baseType: !17, size: 16, offset: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !446, file: !188, line: 59, baseType: !17, size: 16, offset: 48)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !446, file: !188, line: 60, baseType: !165, size: 64, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !446, file: !188, line: 61, baseType: !454, size: 64, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !188, line: 202, size: 3328, elements: !456)
!456 = !{!457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !527, !603, !604, !685, !686, !716, !717, !786, !807, !815, !816}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !455, file: !188, line: 203, baseType: !24, size: 960)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !455, file: !188, line: 204, baseType: !94, size: 64, offset: 960)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !455, file: !188, line: 206, baseType: !140, size: 32, offset: 1024)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !455, file: !188, line: 206, baseType: !140, size: 32, offset: 1056)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !455, file: !188, line: 207, baseType: !140, size: 32, offset: 1088)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !455, file: !188, line: 207, baseType: !140, size: 32, offset: 1120)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !455, file: !188, line: 207, baseType: !140, size: 32, offset: 1152)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !455, file: !188, line: 207, baseType: !140, size: 32, offset: 1184)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !455, file: !188, line: 207, baseType: !140, size: 32, offset: 1216)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !455, file: !188, line: 207, baseType: !140, size: 32, offset: 1248)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !455, file: !188, line: 208, baseType: !140, size: 32, offset: 1280)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !455, file: !188, line: 208, baseType: !140, size: 32, offset: 1312)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !455, file: !188, line: 211, baseType: !140, size: 32, offset: 1344)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !455, file: !188, line: 211, baseType: !140, size: 32, offset: 1376)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !455, file: !188, line: 211, baseType: !140, size: 32, offset: 1408)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !455, file: !188, line: 211, baseType: !140, size: 32, offset: 1440)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !455, file: !188, line: 211, baseType: !140, size: 32, offset: 1472)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !455, file: !188, line: 214, baseType: !140, size: 32, offset: 1504)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !455, file: !188, line: 214, baseType: !140, size: 32, offset: 1536)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !455, file: !188, line: 217, baseType: !140, size: 32, offset: 1568)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !455, file: !188, line: 218, baseType: !140, size: 32, offset: 1600)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !455, file: !188, line: 219, baseType: !140, size: 32, offset: 1632)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !455, file: !188, line: 220, baseType: !140, size: 32, offset: 1664)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !455, file: !188, line: 221, baseType: !140, size: 32, offset: 1696)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !455, file: !188, line: 222, baseType: !17, size: 16, offset: 1728)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !455, file: !188, line: 222, baseType: !17, size: 16, offset: 1744)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !455, file: !188, line: 224, baseType: !17, size: 16, offset: 1760)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !455, file: !188, line: 224, baseType: !17, size: 16, offset: 1776)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !455, file: !188, line: 227, baseType: !17, size: 16, offset: 1792)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !455, file: !188, line: 227, baseType: !17, size: 16, offset: 1808)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !455, file: !188, line: 229, baseType: !17, size: 16, offset: 1824)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !455, file: !188, line: 229, baseType: !17, size: 16, offset: 1840)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !455, file: !188, line: 230, baseType: !17, size: 16, offset: 1856)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !455, file: !188, line: 230, baseType: !17, size: 16, offset: 1872)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !455, file: !188, line: 232, baseType: !140, size: 32, offset: 1888)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !455, file: !188, line: 232, baseType: !140, size: 32, offset: 1920)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !455, file: !188, line: 232, baseType: !140, size: 32, offset: 1952)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !455, file: !188, line: 232, baseType: !140, size: 32, offset: 1984)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !455, file: !188, line: 233, baseType: !58, size: 32, offset: 2016)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !455, file: !188, line: 234, baseType: !58, size: 32, offset: 2048)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !455, file: !188, line: 235, baseType: !17, size: 16, offset: 2080)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !455, file: !188, line: 235, baseType: !17, size: 16, offset: 2096)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !455, file: !188, line: 236, baseType: !17, size: 16, offset: 2112)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !455, file: !188, line: 239, baseType: !17, size: 16, offset: 2128)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !455, file: !188, line: 240, baseType: !58, size: 32, offset: 2144)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !455, file: !188, line: 241, baseType: !58, size: 32, offset: 2176)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !455, file: !188, line: 241, baseType: !58, size: 32, offset: 2208)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !455, file: !188, line: 241, baseType: !58, size: 32, offset: 2240)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !455, file: !188, line: 243, baseType: !140, size: 32, offset: 2272)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !455, file: !188, line: 243, baseType: !140, size: 32, offset: 2304)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !455, file: !188, line: 244, baseType: !140, size: 32, offset: 2336)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !455, file: !188, line: 246, baseType: !509, size: 320, offset: 2368)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !510, line: 50, size: 320, elements: !511)
!510 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!511 = !{!512, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !509, file: !510, line: 51, baseType: !513, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !509, file: !510, line: 53, baseType: !58, size: 32, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !509, file: !510, line: 54, baseType: !58, size: 32, offset: 96)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !509, file: !510, line: 55, baseType: !58, size: 32, offset: 128)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !509, file: !510, line: 55, baseType: !58, size: 32, offset: 160)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !509, file: !510, line: 56, baseType: !15, size: 8, offset: 192)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !509, file: !510, line: 56, baseType: !15, size: 8, offset: 200)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !509, file: !510, line: 57, baseType: !15, size: 8, offset: 208)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !509, file: !510, line: 57, baseType: !15, size: 8, offset: 216)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !509, file: !510, line: 59, baseType: !17, size: 16, offset: 224)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !509, file: !510, line: 59, baseType: !17, size: 16, offset: 240)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !509, file: !510, line: 59, baseType: !17, size: 16, offset: 256)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !509, file: !510, line: 61, baseType: !17, size: 16, offset: 272)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !509, file: !510, line: 63, baseType: !58, size: 32, offset: 288)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !455, file: !188, line: 248, baseType: !528, size: 64, offset: 2688)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !530, line: 328, size: 3456, elements: !531)
!530 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!531 = !{!532, !533, !534, !537, !538, !541, !542, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !569, !570, !571, !574, !579, !580, !583, !587, !591, !595, !599, !600, !601, !602}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !529, file: !530, line: 329, baseType: !24, size: 960)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !529, file: !530, line: 330, baseType: !94, size: 64, offset: 960)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !529, file: !530, line: 332, baseType: !535, size: 64, offset: 1024)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !530, line: 332, flags: DIFlagFwdDecl)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !529, file: !530, line: 333, baseType: !73, size: 512, offset: 1088)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !529, file: !530, line: 335, baseType: !539, size: 64, offset: 1600)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !530, line: 335, flags: DIFlagFwdDecl)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !529, file: !530, line: 337, baseType: !248, size: 64, offset: 1664)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !529, file: !530, line: 338, baseType: !543, size: 64, offset: 1728)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 64, elements: !544)
!544 = !{!545}
!545 = !DISubrange(count: 2)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !529, file: !530, line: 340, baseType: !83, size: 128, offset: 1792)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !529, file: !530, line: 340, baseType: !83, size: 128, offset: 1920)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !529, file: !530, line: 342, baseType: !58, size: 32, offset: 2048)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !529, file: !530, line: 342, baseType: !58, size: 32, offset: 2080)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !529, file: !530, line: 343, baseType: !58, size: 32, offset: 2112)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !529, file: !530, line: 345, baseType: !58, size: 32, offset: 2144)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !529, file: !530, line: 346, baseType: !58, size: 32, offset: 2176)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !529, file: !530, line: 347, baseType: !17, size: 16, offset: 2208)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !529, file: !530, line: 348, baseType: !17, size: 16, offset: 2224)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !529, file: !530, line: 349, baseType: !58, size: 32, offset: 2240)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !529, file: !530, line: 351, baseType: !58, size: 32, offset: 2272)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !529, file: !530, line: 353, baseType: !17, size: 16, offset: 2304)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !529, file: !530, line: 354, baseType: !17, size: 16, offset: 2320)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !529, file: !530, line: 355, baseType: !58, size: 32, offset: 2336)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !529, file: !530, line: 357, baseType: !561, size: 128, offset: 2368)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !562, line: 95, baseType: !563)
!562 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !562, line: 92, size: 128, elements: !564)
!564 = !{!565, !566, !567, !568}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !563, file: !562, line: 93, baseType: !140, size: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !563, file: !562, line: 93, baseType: !140, size: 32, offset: 32)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !563, file: !562, line: 94, baseType: !140, size: 32, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !563, file: !562, line: 94, baseType: !140, size: 32, offset: 96)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !529, file: !530, line: 363, baseType: !83, size: 128, offset: 2496)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !529, file: !530, line: 363, baseType: !83, size: 128, offset: 2624)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !529, file: !530, line: 368, baseType: !572, size: 64, offset: 2752)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !530, line: 48, flags: DIFlagFwdDecl)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !529, file: !530, line: 372, baseType: !575, size: 32, offset: 2816)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !530, line: 274, baseType: !576)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !530, line: 271, size: 32, elements: !577)
!577 = !{!578}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !576, file: !530, line: 273, baseType: !5, size: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !529, file: !530, line: 373, baseType: !58, size: 32, offset: 2848)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !529, file: !530, line: 382, baseType: !581, size: 64, offset: 2880)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !530, line: 46, flags: DIFlagFwdDecl)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !529, file: !530, line: 385, baseType: !584, size: 64, offset: 2944)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DISubroutineType(types: !586)
!586 = !{null, !29, !140}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !529, file: !530, line: 386, baseType: !588, size: 64, offset: 3008)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DISubroutineType(types: !590)
!590 = !{null, !29, !14}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !529, file: !530, line: 387, baseType: !592, size: 64, offset: 3072)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DISubroutineType(types: !594)
!594 = !{!58, !29}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !529, file: !530, line: 388, baseType: !596, size: 64, offset: 3136)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DISubroutineType(types: !598)
!598 = !{null, !29}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !529, file: !530, line: 389, baseType: !29, size: 64, offset: 3200)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !529, file: !530, line: 389, baseType: !29, size: 64, offset: 3264)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !529, file: !530, line: 389, baseType: !29, size: 64, offset: 3328)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !529, file: !530, line: 389, baseType: !29, size: 64, offset: 3392)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !455, file: !188, line: 249, baseType: !186, size: 64, offset: 2752)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !455, file: !188, line: 250, baseType: !605, size: 64, offset: 2816)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !510, line: 77, size: 15424, elements: !607)
!607 = !{!608, !609, !610, !613, !616, !619, !622, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !641, !642, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !674, !675, !679}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !606, file: !510, line: 78, baseType: !24, size: 960)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !606, file: !510, line: 80, baseType: !44, size: 8192, offset: 960)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !606, file: !510, line: 82, baseType: !611, size: 64, offset: 9152)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !510, line: 43, flags: DIFlagFwdDecl)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !606, file: !510, line: 83, baseType: !614, size: 64, offset: 9216)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !25, line: 46, flags: DIFlagFwdDecl)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !606, file: !510, line: 86, baseType: !617, size: 64, offset: 9280)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !510, line: 41, flags: DIFlagFwdDecl)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !606, file: !510, line: 87, baseType: !620, size: 64, offset: 9344)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !510, line: 44, flags: DIFlagFwdDecl)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !606, file: !510, line: 89, baseType: !623, size: 512, offset: 9408)
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !620, size: 512, elements: !624)
!624 = !{!196}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !606, file: !510, line: 90, baseType: !17, size: 16, offset: 9920)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !606, file: !510, line: 90, baseType: !17, size: 16, offset: 9936)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !606, file: !510, line: 92, baseType: !17, size: 16, offset: 9952)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !606, file: !510, line: 92, baseType: !17, size: 16, offset: 9968)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !606, file: !510, line: 93, baseType: !17, size: 16, offset: 9984)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !606, file: !510, line: 93, baseType: !17, size: 16, offset: 10000)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !606, file: !510, line: 94, baseType: !58, size: 32, offset: 10016)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !606, file: !510, line: 97, baseType: !17, size: 16, offset: 10048)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !606, file: !510, line: 97, baseType: !17, size: 16, offset: 10064)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !606, file: !510, line: 98, baseType: !17, size: 16, offset: 10080)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !606, file: !510, line: 98, baseType: !17, size: 16, offset: 10096)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !606, file: !510, line: 99, baseType: !17, size: 16, offset: 10112)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !606, file: !510, line: 99, baseType: !17, size: 16, offset: 10128)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !606, file: !510, line: 100, baseType: !5, size: 32, offset: 10144)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !606, file: !510, line: 101, baseType: !640, size: 64, offset: 10176)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !606, file: !510, line: 103, baseType: !50, size: 64, offset: 10240)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !606, file: !510, line: 104, baseType: !643, size: 64, offset: 10304)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !25, line: 159, size: 448, elements: !645)
!645 = !{!646, !648, !649, !651, !652, !654}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !644, file: !25, line: 161, baseType: !647, size: 64)
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !544)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !644, file: !25, line: 162, baseType: !647, size: 64, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !644, file: !25, line: 163, baseType: !650, size: 32, offset: 128)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 32, elements: !544)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !644, file: !25, line: 164, baseType: !650, size: 32, offset: 160)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !644, file: !25, line: 165, baseType: !653, size: 128, offset: 192)
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !640, size: 128, elements: !544)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !644, file: !25, line: 166, baseType: !655, size: 128, offset: 320)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !614, size: 128, elements: !544)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !606, file: !510, line: 107, baseType: !140, size: 32, offset: 10368)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !606, file: !510, line: 108, baseType: !58, size: 32, offset: 10400)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !606, file: !510, line: 109, baseType: !17, size: 16, offset: 10432)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !606, file: !510, line: 110, baseType: !17, size: 16, offset: 10448)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !606, file: !510, line: 113, baseType: !58, size: 32, offset: 10464)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !606, file: !510, line: 113, baseType: !58, size: 32, offset: 10496)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !606, file: !510, line: 114, baseType: !15, size: 8, offset: 10528)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !606, file: !510, line: 114, baseType: !15, size: 8, offset: 10536)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !606, file: !510, line: 115, baseType: !17, size: 16, offset: 10544)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !606, file: !510, line: 116, baseType: !401, size: 128, offset: 10560)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !606, file: !510, line: 119, baseType: !140, size: 32, offset: 10688)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !606, file: !510, line: 119, baseType: !140, size: 32, offset: 10720)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !606, file: !510, line: 122, baseType: !669, size: 512, offset: 10752)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !670, line: 182, baseType: !671)
!670 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !670, line: 180, size: 512, elements: !672)
!672 = !{!673}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !671, file: !670, line: 181, baseType: !73, size: 512)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !606, file: !510, line: 123, baseType: !15, size: 8, offset: 11264)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !606, file: !510, line: 125, baseType: !676, size: 56, offset: 11272)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 56, elements: !677)
!677 = !{!678}
!678 = !DISubrange(count: 7)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !606, file: !510, line: 126, baseType: !680, size: 4096, offset: 11328)
!680 = !DICompositeType(tag: DW_TAG_array_type, baseType: !681, size: 4096, elements: !624)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !510, line: 69, baseType: !682)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !510, line: 67, size: 512, elements: !683)
!683 = !{!684}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !682, file: !510, line: 68, baseType: !73, size: 512)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "coba", scope: !455, file: !188, line: 251, baseType: !409, size: 64, offset: 2880)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !455, file: !188, line: 252, baseType: !687, size: 64, offset: 2944)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EnvMap", file: !188, line: 122, size: 1600, elements: !689)
!689 = !{!690, !691, !692, !698, !701, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !688, file: !188, line: 123, baseType: !165, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !688, file: !188, line: 124, baseType: !605, size: 64, offset: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "cube", scope: !688, file: !188, line: 125, baseType: !693, size: 384, offset: 128)
!693 = !DICompositeType(tag: DW_TAG_array_type, baseType: !694, size: 384, elements: !696)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !670, line: 136, flags: DIFlagFwdDecl)
!696 = !{!697}
!697 = !DISubrange(count: 6)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !688, file: !188, line: 126, baseType: !699, size: 512, offset: 512)
!699 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 512, elements: !700)
!700 = !{!403, !403}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "obimat", scope: !688, file: !188, line: 127, baseType: !702, size: 288, offset: 1024)
!702 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 288, elements: !703)
!703 = !{!197, !197}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !688, file: !188, line: 128, baseType: !17, size: 16, offset: 1312)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !688, file: !188, line: 128, baseType: !17, size: 16, offset: 1328)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "clipsta", scope: !688, file: !188, line: 129, baseType: !140, size: 32, offset: 1344)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "clipend", scope: !688, file: !188, line: 129, baseType: !140, size: 32, offset: 1376)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "viewscale", scope: !688, file: !188, line: 130, baseType: !140, size: 32, offset: 1408)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "notlay", scope: !688, file: !188, line: 131, baseType: !5, size: 32, offset: 1440)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "cuberes", scope: !688, file: !188, line: 132, baseType: !17, size: 16, offset: 1472)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !688, file: !188, line: 132, baseType: !17, size: 16, offset: 1488)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !688, file: !188, line: 133, baseType: !58, size: 32, offset: 1504)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !688, file: !188, line: 133, baseType: !58, size: 32, offset: 1536)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !688, file: !188, line: 134, baseType: !17, size: 16, offset: 1568)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !688, file: !188, line: 134, baseType: !17, size: 16, offset: 1584)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !455, file: !188, line: 253, baseType: !643, size: 64, offset: 3008)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !455, file: !188, line: 254, baseType: !718, size: 64, offset: 3072)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointDensity", file: !188, line: 137, size: 832, elements: !720)
!720 = !{!721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !736, !737, !738, !739, !740, !742, !743, !744, !745, !746, !747}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !719, file: !188, line: 138, baseType: !17, size: 16)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_type", scope: !719, file: !188, line: 140, baseType: !17, size: 16, offset: 16)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_softness", scope: !719, file: !188, line: 141, baseType: !140, size: 32, offset: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !719, file: !188, line: 142, baseType: !140, size: 32, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !719, file: !188, line: 143, baseType: !17, size: 16, offset: 96)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "color_source", scope: !719, file: !188, line: 144, baseType: !17, size: 16, offset: 112)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "totpoints", scope: !719, file: !188, line: 145, baseType: !58, size: 32, offset: 128)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "pdpad", scope: !719, file: !188, line: 147, baseType: !58, size: 32, offset: 160)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !719, file: !188, line: 149, baseType: !165, size: 64, offset: 192)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "psys", scope: !719, file: !188, line: 150, baseType: !58, size: 32, offset: 256)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "psys_cache_space", scope: !719, file: !188, line: 151, baseType: !17, size: 16, offset: 288)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "ob_cache_space", scope: !719, file: !188, line: 152, baseType: !17, size: 16, offset: 304)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "point_tree", scope: !719, file: !188, line: 154, baseType: !29, size: 64, offset: 320)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "point_data", scope: !719, file: !188, line: 155, baseType: !735, size: 64, offset: 384)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "noise_size", scope: !719, file: !188, line: 157, baseType: !140, size: 32, offset: 448)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "noise_depth", scope: !719, file: !188, line: 158, baseType: !17, size: 16, offset: 480)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "noise_influence", scope: !719, file: !188, line: 159, baseType: !17, size: 16, offset: 496)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "noise_basis", scope: !719, file: !188, line: 160, baseType: !17, size: 16, offset: 512)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "pdpad3", scope: !719, file: !188, line: 161, baseType: !741, size: 48, offset: 528)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 48, elements: !218)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "noise_fac", scope: !719, file: !188, line: 162, baseType: !140, size: 32, offset: 576)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "speed_scale", scope: !719, file: !188, line: 164, baseType: !140, size: 32, offset: 608)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_speed_scale", scope: !719, file: !188, line: 164, baseType: !140, size: 32, offset: 640)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "pdpad2", scope: !719, file: !188, line: 164, baseType: !140, size: 32, offset: 672)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "coba", scope: !719, file: !188, line: 165, baseType: !409, size: 64, offset: 704)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_curve", scope: !719, file: !188, line: 167, baseType: !748, size: 64, offset: 768)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapping", file: !670, line: 72, size: 3072, elements: !750)
!750 = !{!751, !752, !753, !754, !755, !756, !757, !782, !783, !784, !785}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !749, file: !670, line: 73, baseType: !58, size: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !749, file: !670, line: 73, baseType: !58, size: 32, offset: 32)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "preset", scope: !749, file: !670, line: 74, baseType: !58, size: 32, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !749, file: !670, line: 75, baseType: !58, size: 32, offset: 96)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !749, file: !670, line: 77, baseType: !561, size: 128, offset: 128)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "clipr", scope: !749, file: !670, line: 77, baseType: !561, size: 128, offset: 256)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "cm", scope: !749, file: !670, line: 79, baseType: !758, size: 2304, offset: 384)
!758 = !DICompositeType(tag: DW_TAG_array_type, baseType: !759, size: 2304, elements: !402)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMap", file: !670, line: 67, baseType: !760)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMap", file: !670, line: 55, size: 576, elements: !761)
!761 = !{!762, !763, !764, !765, !766, !767, !768, !769, !778, !779, !780, !781}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "totpoint", scope: !760, file: !670, line: 56, baseType: !17, size: 16)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !760, file: !670, line: 56, baseType: !17, size: 16, offset: 16)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !760, file: !670, line: 58, baseType: !140, size: 32, offset: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "mintable", scope: !760, file: !670, line: 59, baseType: !140, size: 32, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "maxtable", scope: !760, file: !670, line: 59, baseType: !140, size: 32, offset: 96)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "ext_in", scope: !760, file: !670, line: 60, baseType: !543, size: 64, offset: 128)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "ext_out", scope: !760, file: !670, line: 60, baseType: !543, size: 64, offset: 192)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !760, file: !670, line: 61, baseType: !770, size: 64, offset: 256)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMapPoint", file: !670, line: 47, baseType: !772)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapPoint", file: !670, line: 44, size: 96, elements: !773)
!773 = !{!774, !775, !776, !777}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !772, file: !670, line: 45, baseType: !140, size: 32)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !772, file: !670, line: 45, baseType: !140, size: 32, offset: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !772, file: !670, line: 46, baseType: !17, size: 16, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "shorty", scope: !772, file: !670, line: 46, baseType: !17, size: 16, offset: 80)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !760, file: !670, line: 62, baseType: !770, size: 64, offset: 320)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "premultable", scope: !760, file: !670, line: 64, baseType: !770, size: 64, offset: 384)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_in", scope: !760, file: !670, line: 65, baseType: !543, size: 64, offset: 448)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_out", scope: !760, file: !670, line: 66, baseType: !543, size: 64, offset: 512)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "black", scope: !749, file: !670, line: 80, baseType: !217, size: 96, offset: 2688)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "white", scope: !749, file: !670, line: 80, baseType: !217, size: 96, offset: 2784)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "bwmul", scope: !749, file: !670, line: 81, baseType: !217, size: 96, offset: 2880)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "sample", scope: !749, file: !670, line: 83, baseType: !217, size: 96, offset: 2976)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "vd", scope: !455, file: !188, line: 255, baseType: !787, size: 64, offset: 3136)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VoxelData", file: !188, line: 170, size: 8704, elements: !789)
!789 = !{!790, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "resol", scope: !788, file: !188, line: 171, baseType: !791, size: 96)
!791 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 96, elements: !218)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "interp_type", scope: !788, file: !188, line: 172, baseType: !58, size: 32, offset: 96)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "file_format", scope: !788, file: !188, line: 173, baseType: !17, size: 16, offset: 128)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !788, file: !188, line: 174, baseType: !17, size: 16, offset: 144)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !788, file: !188, line: 175, baseType: !17, size: 16, offset: 160)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "smoked_type", scope: !788, file: !188, line: 176, baseType: !17, size: 16, offset: 176)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !788, file: !188, line: 177, baseType: !17, size: 16, offset: 192)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !788, file: !188, line: 178, baseType: !17, size: 16, offset: 208)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !788, file: !188, line: 179, baseType: !58, size: 32, offset: 224)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !788, file: !188, line: 181, baseType: !165, size: 64, offset: 256)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "int_multiplier", scope: !788, file: !188, line: 182, baseType: !140, size: 32, offset: 320)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "still_frame", scope: !788, file: !188, line: 183, baseType: !58, size: 32, offset: 352)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "source_path", scope: !788, file: !188, line: 184, baseType: !44, size: 8192, offset: 384)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "dataset", scope: !788, file: !188, line: 187, baseType: !735, size: 64, offset: 8576)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "cachedframe", scope: !788, file: !188, line: 188, baseType: !58, size: 32, offset: 8640)
