; ModuleID = 'blender/source/blender/editors/object/object_warp.c'
source_filename = "blender/source/blender/editors/object/object_warp.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.wmOperatorType = type { i8*, i8*, i8*, i8*, i32 (%struct.bContext*, %struct.wmOperator*)*, i8 (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, void (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, i32 (%struct.bContext*)*, void (%struct.bContext*, %struct.wmOperator*)*, %struct.StructRNA*, %struct.IDProperty*, %struct.PropertyRNA*, %struct.ListBase, %struct.wmKeyMap*, i8*, i32 (%struct.bContext*, %struct.wmOperatorType*)*, %struct.ExtensionRNA, i16 }
%struct.bContext = type opaque
%struct.wmOperator = type { %struct.wmOperator*, %struct.wmOperator*, [64 x i8], %struct.IDProperty*, %struct.wmOperatorType*, i8*, i8*, %struct.PointerRNA*, %struct.ReportList*, %struct.ListBase, %struct.wmOperator*, %struct.uiLayout*, i16, [3 x i16] }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }
%struct.ReportList = type { %struct.ListBase, i32, i32, i32, i32, %struct.wmTimer* }
%struct.wmTimer = type { %struct.wmTimer*, %struct.wmTimer*, %struct.wmWindow*, double, i32, i8*, double, double, double, double, double, i32 }

!32 = !DIEnumerator(name: "PROP_COLOR_GAMMA", value: 30, isUnsigned: true)
!33 = !DIEnumerator(name: "PROP_COORDS", value: 31, isUnsigned: true)
!34 = !DIEnumerator(name: "PROP_LAYER", value: 40, isUnsigned: true)
!35 = !DIEnumerator(name: "PROP_LAYER_MEMBER", value: 41, isUnsigned: true)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertyFlag", file: !4, line: 151, baseType: !5, size: 32, elements: !37)
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68}
!38 = !DIEnumerator(name: "PROP_EDITABLE", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "PROP_LIB_EXCEPTION", value: 65536, isUnsigned: true)
!40 = !DIEnumerator(name: "PROP_ANIMATABLE", value: 2, isUnsigned: true)
!41 = !DIEnumerator(name: "PROP_ICONS_CONSECUTIVE", value: 4096, isUnsigned: true)
!42 = !DIEnumerator(name: "PROP_HIDDEN", value: 524288, isUnsigned: true)
!43 = !DIEnumerator(name: "PROP_SKIP_SAVE", value: 268435456, isUnsigned: true)
!44 = !DIEnumerator(name: "PROP_REQUIRED", value: 4, isUnsigned: true)
!45 = !DIEnumerator(name: "PROP_OUTPUT", value: 8, isUnsigned: true)
!46 = !DIEnumerator(name: "PROP_RNAPTR", value: 2048, isUnsigned: true)
!47 = !DIEnumerator(name: "PROP_PYFUNC_OPTIONAL", value: 1073741824, isUnsigned: true)
!48 = !DIEnumerator(name: "PROP_REGISTER", value: 16, isUnsigned: true)
!49 = !DIEnumerator(name: "PROP_REGISTER_OPTIONAL", value: 48, isUnsigned: true)
!50 = !DIEnumerator(name: "PROP_PROPORTIONAL", value: 67108864, isUnsigned: true)
!51 = !DIEnumerator(name: "PROP_ID_REFCOUNT", value: 64, isUnsigned: true)
!52 = !DIEnumerator(name: "PROP_ID_SELF_CHECK", value: 1048576, isUnsigned: true)
!53 = !DIEnumerator(name: "PROP_NEVER_NULL", value: 262144, isUnsigned: true)
!54 = !DIEnumerator(name: "PROP_NEVER_UNLINK", value: 33554432, isUnsigned: true)
!55 = !DIEnumerator(name: "PROP_ENUM_FLAG", value: 2097152, isUnsigned: true)
!56 = !DIEnumerator(name: "PROP_CONTEXT_UPDATE", value: 4194304, isUnsigned: true)
!57 = !DIEnumerator(name: "PROP_CONTEXT_PROPERTY_UPDATE", value: 138412032, isUnsigned: true)
!58 = !DIEnumerator(name: "PROP_THICK_WRAP", value: 8388608, isUnsigned: true)
!59 = !DIEnumerator(name: "PROP_BUILTIN", value: 128, isUnsigned: true)
!60 = !DIEnumerator(name: "PROP_EXPORT", value: 256, isUnsigned: true)
!61 = !DIEnumerator(name: "PROP_RUNTIME", value: 512, isUnsigned: true)
!62 = !DIEnumerator(name: "PROP_IDPROPERTY", value: 1024, isUnsigned: true)
!63 = !DIEnumerator(name: "PROP_RAW_ACCESS", value: 8192, isUnsigned: true)
!64 = !DIEnumerator(name: "PROP_RAW_ARRAY", value: 16384, isUnsigned: true)
!65 = !DIEnumerator(name: "PROP_FREE_POINTERS", value: 32768, isUnsigned: true)
!66 = !DIEnumerator(name: "PROP_DYNAMIC", value: 131072, isUnsigned: true)
!67 = !DIEnumerator(name: "PROP_ENUM_NO_CONTEXT", value: 16777216, isUnsigned: true)
!68 = !DIEnumerator(name: "PROP_ENUM_NO_TRANSLATE", value: 536870912, isUnsigned: true)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !70, line: 63, baseType: !5, size: 32, elements: !71)
!70 = !DIFile(filename: "blender/source/blender/editors/include/ED_transverts.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!71 = !{!72, !73, !74}
!72 = !DIEnumerator(name: "TM_ALL_JOINTS", value: 1, isUnsigned: true)
!73 = !DIEnumerator(name: "TM_SKIP_HANDLES", value: 2, isUnsigned: true)
!74 = !DIEnumerator(name: "TM_CALC_NORMALS", value: 4, isUnsigned: true)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !76, line: 351, baseType: !5, size: 32, elements: !77)
!76 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!77 = !{!78, !79, !80, !81, !82, !83}
!78 = !DIEnumerator(name: "OPERATOR_RUNNING_MODAL", value: 1, isUnsigned: true)
!79 = !DIEnumerator(name: "OPERATOR_CANCELLED", value: 2, isUnsigned: true)
!80 = !DIEnumerator(name: "OPERATOR_FINISHED", value: 4, isUnsigned: true)
!81 = !DIEnumerator(name: "OPERATOR_PASS_THROUGH", value: 8, isUnsigned: true)
!82 = !DIEnumerator(name: "OPERATOR_HANDLED", value: 16, isUnsigned: true)
!83 = !DIEnumerator(name: "OPERATOR_INTERFACE", value: 32, isUnsigned: true)
!84 = !{!85, !86, !87}
!85 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!88 = !{i32 7, !"Dwarf Version", i32 4}
!89 = !{i32 2, !"Debug Info Version", i32 3}
!90 = !{i32 1, !"wchar_size", i32 4}
!91 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!92 = distinct !DISubprogram(name: "OBJECT_OT_vertex_warp", scope: !1, file: !1, line: 279, type: !93, scopeLine: 280, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !380)
!93 = !DISubroutineType(types: !94)
!94 = !{null, !95}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !97, line: 508, size: 1536, elements: !98)
!97 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!98 = !{!99, !103, !104, !105, !106, !302, !307, !313, !317, !318, !322, !323, !324, !325, !329, !330, !345, !346, !350, !379}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !96, file: !97, line: 509, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!102 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !96, file: !97, line: 510, baseType: !100, size: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !96, file: !97, line: 511, baseType: !100, size: 64, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !96, file: !97, line: 512, baseType: !100, size: 64, offset: 192)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !96, file: !97, line: 518, baseType: !107, size: 64, offset: 256)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{!110, !111, !113}
!110 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !4, line: 44, flags: DIFlagFwdDecl)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !76, line: 328, size: 1344, elements: !115)
!115 = !{!116, !117, !118, !122, !153, !154, !155, !156, !168, !292, !293, !294, !297, !298}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !114, file: !76, line: 329, baseType: !113, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !114, file: !76, line: 329, baseType: !113, size: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !114, file: !76, line: 332, baseType: !119, size: 512, offset: 128)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 512, elements: !120)
!120 = !{!121}
!121 = !DISubrange(count: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !114, file: !76, line: 333, baseType: !123, size: 64, offset: 640)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !125, line: 75, baseType: !126)
!125 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !125, line: 62, size: 1024, elements: !127)
!127 = !{!128, !130, !131, !132, !133, !135, !136, !137, !151, !152}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !126, file: !125, line: 63, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !126, file: !125, line: 63, baseType: !129, size: 64, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !126, file: !125, line: 64, baseType: !102, size: 8, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !126, file: !125, line: 64, baseType: !102, size: 8, offset: 136)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !126, file: !125, line: 65, baseType: !134, size: 16, offset: 144)
!134 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !126, file: !125, line: 66, baseType: !119, size: 512, offset: 160)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !126, file: !125, line: 67, baseType: !110, size: 32, offset: 672)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !126, file: !125, line: 69, baseType: !138, size: 256, offset: 704)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !125, line: 60, baseType: !139)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !125, line: 48, size: 256, elements: !140)
!140 = !{!141, !142, !149, !150}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !139, file: !125, line: 49, baseType: !86, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !139, file: !125, line: 58, baseType: !143, size: 128, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !144, line: 71, baseType: !145)
!144 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !144, line: 69, size: 128, elements: !146)
!146 = !{!147, !148}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !145, file: !144, line: 70, baseType: !86, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !145, file: !144, line: 70, baseType: !86, size: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !139, file: !125, line: 59, baseType: !110, size: 32, offset: 192)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !139, file: !125, line: 59, baseType: !110, size: 32, offset: 224)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !126, file: !125, line: 70, baseType: !110, size: 32, offset: 960)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !126, file: !125, line: 74, baseType: !110, size: 32, offset: 992)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !114, file: !76, line: 336, baseType: !95, size: 64, offset: 704)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !114, file: !76, line: 337, baseType: !86, size: 64, offset: 768)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !114, file: !76, line: 338, baseType: !86, size: 64, offset: 832)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !114, file: !76, line: 340, baseType: !157, size: 64, offset: 896)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !4, line: 55, size: 192, elements: !159)
!159 = !{!160, !164, !167}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !158, file: !4, line: 58, baseType: !161, size: 64)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !158, file: !4, line: 56, size: 64, elements: !162)
!162 = !{!163}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !161, file: !4, line: 57, baseType: !86, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !158, file: !4, line: 60, baseType: !165, size: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !4, line: 41, flags: DIFlagFwdDecl)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !158, file: !4, line: 61, baseType: !86, size: 64, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !114, file: !76, line: 341, baseType: !169, size: 64, offset: 960)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !76, line: 106, size: 320, elements: !171)
!171 = !{!172, !173, !174, !175, !176, !177}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !170, file: !76, line: 107, baseType: !143, size: 128)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !170, file: !76, line: 108, baseType: !110, size: 32, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !170, file: !76, line: 109, baseType: !110, size: 32, offset: 160)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !170, file: !76, line: 110, baseType: !110, size: 32, offset: 192)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !170, file: !76, line: 110, baseType: !110, size: 32, offset: 224)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !170, file: !76, line: 111, baseType: !178, size: 64, offset: 256)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !97, line: 490, size: 768, elements: !180)
!180 = !{!181, !182, !183, !283, !284, !285, !286, !287, !288, !289, !290, !291}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !179, file: !97, line: 491, baseType: !178, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !179, file: !97, line: 491, baseType: !178, size: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !179, file: !97, line: 493, baseType: !184, size: 64, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !76, line: 169, size: 2048, elements: !186)
!186 = !{!187, !188, !189, !190, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !258, !261, !275, !276, !277, !278, !279, !280, !281, !282}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !185, file: !76, line: 170, baseType: !184, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !185, file: !76, line: 170, baseType: !184, size: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !185, file: !76, line: 172, baseType: !86, size: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !185, file: !76, line: 174, baseType: !191, size: 64, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !193, line: 41, flags: DIFlagFwdDecl)
!193 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!194 = !DIDerivedType(tag: DW_TAG_member, name: "newscreen", scope: !185, file: !76, line: 175, baseType: !191, size: 64, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "screenname", scope: !185, file: !76, line: 176, baseType: !119, size: 512, offset: 320)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "posx", scope: !185, file: !76, line: 178, baseType: !134, size: 16, offset: 832)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "posy", scope: !185, file: !76, line: 178, baseType: !134, size: 16, offset: 848)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !185, file: !76, line: 178, baseType: !134, size: 16, offset: 864)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !185, file: !76, line: 178, baseType: !134, size: 16, offset: 880)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "windowstate", scope: !185, file: !76, line: 179, baseType: !134, size: 16, offset: 896)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !185, file: !76, line: 180, baseType: !134, size: 16, offset: 912)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !185, file: !76, line: 181, baseType: !134, size: 16, offset: 928)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !185, file: !76, line: 182, baseType: !134, size: 16, offset: 944)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "lastcursor", scope: !185, file: !76, line: 183, baseType: !134, size: 16, offset: 960)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "modalcursor", scope: !185, file: !76, line: 184, baseType: !134, size: 16, offset: 976)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "grabcursor", scope: !185, file: !76, line: 185, baseType: !134, size: 16, offset: 992)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "addmousemove", scope: !185, file: !76, line: 186, baseType: !134, size: 16, offset: 1008)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "winid", scope: !185, file: !76, line: 188, baseType: !110, size: 32, offset: 1024)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "lock_pie_event", scope: !185, file: !76, line: 190, baseType: !134, size: 16, offset: 1056)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "last_pie_event", scope: !185, file: !76, line: 191, baseType: !134, size: 16, offset: 1072)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "eventstate", scope: !185, file: !76, line: 194, baseType: !212, size: 64, offset: 1088)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmEvent", file: !97, line: 421, size: 960, elements: !214)
!214 = !{!215, !216, !217, !218, !219, !220, !221, !225, !229, !230, !231, !232, !233, !234, !235, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !254, !255, !256, !257}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !213, file: !97, line: 422, baseType: !212, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !213, file: !97, line: 422, baseType: !212, size: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !213, file: !97, line: 424, baseType: !134, size: 16, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !213, file: !97, line: 425, baseType: !134, size: 16, offset: 144)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !213, file: !97, line: 426, baseType: !110, size: 32, offset: 160)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !213, file: !97, line: 426, baseType: !110, size: 32, offset: 192)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "mval", scope: !213, file: !97, line: 427, baseType: !222, size: 64, offset: 224)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 64, elements: !223)
!223 = !{!224}
!224 = !DISubrange(count: 2)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_buf", scope: !213, file: !97, line: 428, baseType: !226, size: 48, offset: 288)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 48, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 6)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !213, file: !97, line: 431, baseType: !102, size: 8, offset: 336)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !213, file: !97, line: 432, baseType: !102, size: 8, offset: 344)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "prevtype", scope: !213, file: !97, line: 435, baseType: !134, size: 16, offset: 352)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "prevval", scope: !213, file: !97, line: 436, baseType: !134, size: 16, offset: 368)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "prevx", scope: !213, file: !97, line: 437, baseType: !110, size: 32, offset: 384)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "prevy", scope: !213, file: !97, line: 437, baseType: !110, size: 32, offset: 416)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicktime", scope: !213, file: !97, line: 438, baseType: !236, size: 64, offset: 448)
!236 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "prevclickx", scope: !213, file: !97, line: 439, baseType: !110, size: 32, offset: 512)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicky", scope: !213, file: !97, line: 439, baseType: !110, size: 32, offset: 544)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !213, file: !97, line: 442, baseType: !134, size: 16, offset: 576)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !213, file: !97, line: 442, baseType: !134, size: 16, offset: 592)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !213, file: !97, line: 442, baseType: !134, size: 16, offset: 608)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "oskey", scope: !213, file: !97, line: 442, baseType: !134, size: 16, offset: 624)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "keymodifier", scope: !213, file: !97, line: 443, baseType: !134, size: 16, offset: 640)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "check_click", scope: !213, file: !97, line: 446, baseType: !134, size: 16, offset: 656)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "keymap_idname", scope: !213, file: !97, line: 449, baseType: !100, size: 64, offset: 704)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "tablet_data", scope: !213, file: !97, line: 452, baseType: !247, size: 64, offset: 768)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTabletData", file: !97, line: 463, size: 128, elements: !249)
!249 = !{!250, !251, !252, !253}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "Active", scope: !248, file: !97, line: 464, baseType: !110, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "Pressure", scope: !248, file: !97, line: 465, baseType: !85, size: 32, offset: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "Xtilt", scope: !248, file: !97, line: 466, baseType: !85, size: 32, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "Ytilt", scope: !248, file: !97, line: 467, baseType: !85, size: 32, offset: 96)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "custom", scope: !213, file: !97, line: 455, baseType: !134, size: 16, offset: 832)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "customdatafree", scope: !213, file: !97, line: 456, baseType: !134, size: 16, offset: 848)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !213, file: !97, line: 457, baseType: !110, size: 32, offset: 864)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !213, file: !97, line: 458, baseType: !86, size: 64, offset: 896)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "curswin", scope: !185, file: !76, line: 196, baseType: !259, size: 64, offset: 1152)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmSubWindow", file: !76, line: 55, flags: DIFlagFwdDecl)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "tweak", scope: !185, file: !76, line: 198, baseType: !262, size: 64, offset: 1216)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmGesture", file: !97, line: 398, size: 448, elements: !264)
!264 = !{!265, !266, !267, !268, !269, !270, !271, !272, !273, !274}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !263, file: !97, line: 399, baseType: !262, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !263, file: !97, line: 399, baseType: !262, size: 64, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !263, file: !97, line: 400, baseType: !110, size: 32, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !263, file: !97, line: 401, baseType: !110, size: 32, offset: 160)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !263, file: !97, line: 402, baseType: !110, size: 32, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "swinid", scope: !263, file: !97, line: 403, baseType: !110, size: 32, offset: 224)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !263, file: !97, line: 404, baseType: !110, size: 32, offset: 256)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !263, file: !97, line: 405, baseType: !110, size: 32, offset: 288)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !263, file: !97, line: 407, baseType: !86, size: 64, offset: 320)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !263, file: !97, line: 414, baseType: !86, size: 64, offset: 384)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "drawmethod", scope: !185, file: !76, line: 200, baseType: !110, size: 32, offset: 1280)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "drawfail", scope: !185, file: !76, line: 200, baseType: !110, size: 32, offset: 1312)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "drawdata", scope: !185, file: !76, line: 201, baseType: !86, size: 64, offset: 1344)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !185, file: !76, line: 203, baseType: !143, size: 128, offset: 1408)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !185, file: !76, line: 204, baseType: !143, size: 128, offset: 1536)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "modalhandlers", scope: !185, file: !76, line: 205, baseType: !143, size: 128, offset: 1664)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "subwindows", scope: !185, file: !76, line: 207, baseType: !143, size: 128, offset: 1792)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "gesture", scope: !185, file: !76, line: 208, baseType: !143, size: 128, offset: 1920)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "timestep", scope: !179, file: !97, line: 495, baseType: !236, size: 64, offset: 192)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !179, file: !97, line: 496, baseType: !110, size: 32, offset: 256)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !179, file: !97, line: 497, baseType: !86, size: 64, offset: 320)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !179, file: !97, line: 499, baseType: !236, size: 64, offset: 384)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !179, file: !97, line: 500, baseType: !236, size: 64, offset: 448)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "ltime", scope: !179, file: !97, line: 502, baseType: !236, size: 64, offset: 512)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "ntime", scope: !179, file: !97, line: 503, baseType: !236, size: 64, offset: 576)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !179, file: !97, line: 504, baseType: !236, size: 64, offset: 640)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "sleep", scope: !179, file: !97, line: 505, baseType: !110, size: 32, offset: 704)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !114, file: !76, line: 343, baseType: !143, size: 128, offset: 1024)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "opm", scope: !114, file: !76, line: 344, baseType: !113, size: 64, offset: 1152)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "layout", scope: !114, file: !76, line: 345, baseType: !295, size: 64, offset: 1216)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !76, line: 61, flags: DIFlagFwdDecl)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !114, file: !76, line: 346, baseType: !134, size: 16, offset: 1280)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !114, file: !76, line: 346, baseType: !299, size: 48, offset: 1296)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 48, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 3)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !96, file: !97, line: 524, baseType: !303, size: 64, offset: 320)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DISubroutineType(types: !305)
!305 = !{!306, !111, !113}
!306 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "invoke", scope: !96, file: !97, line: 530, baseType: !308, size: 64, offset: 384)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DISubroutineType(types: !310)
!310 = !{!110, !111, !113, !311}
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !213)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "cancel", scope: !96, file: !97, line: 531, baseType: !314, size: 64, offset: 448)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{null, !111, !113}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "modal", scope: !96, file: !97, line: 532, baseType: !308, size: 64, offset: 512)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !96, file: !97, line: 536, baseType: !319, size: 64, offset: 576)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!110, !111}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "ui", scope: !96, file: !97, line: 539, baseType: !314, size: 64, offset: 640)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !96, file: !97, line: 542, baseType: !165, size: 64, offset: 704)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "last_properties", scope: !96, file: !97, line: 545, baseType: !129, size: 64, offset: 768)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !96, file: !97, line: 549, baseType: !326, size: 64, offset: 832)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyRNA", file: !4, line: 333, baseType: !328)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "PropertyRNA", file: !4, line: 39, flags: DIFlagFwdDecl)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !96, file: !97, line: 552, baseType: !143, size: 128, offset: 896)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "modalkeymap", scope: !96, file: !97, line: 555, baseType: !331, size: 64, offset: 1024)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmKeyMap", file: !76, line: 281, size: 1088, elements: !333)
!333 = !{!334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !332, file: !76, line: 282, baseType: !331, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !332, file: !76, line: 282, baseType: !331, size: 64, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !332, file: !76, line: 284, baseType: !143, size: 128, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "diff_items", scope: !332, file: !76, line: 285, baseType: !143, size: 128, offset: 256)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !332, file: !76, line: 287, baseType: !119, size: 512, offset: 384)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "spaceid", scope: !332, file: !76, line: 288, baseType: !134, size: 16, offset: 896)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "regionid", scope: !332, file: !76, line: 289, baseType: !134, size: 16, offset: 912)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !332, file: !76, line: 291, baseType: !134, size: 16, offset: 928)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "kmi_id", scope: !332, file: !76, line: 292, baseType: !134, size: 16, offset: 944)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !332, file: !76, line: 295, baseType: !319, size: 64, offset: 960)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "modal_items", scope: !332, file: !76, line: 296, baseType: !86, size: 64, offset: 1024)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "pyop_data", scope: !96, file: !97, line: 559, baseType: !86, size: 64, offset: 1088)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "pyop_poll", scope: !96, file: !97, line: 560, baseType: !347, size: 64, offset: 1152)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{!110, !111, !95}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !96, file: !97, line: 563, baseType: !351, size: 256, offset: 1216)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !4, line: 436, baseType: !352)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !4, line: 430, size: 256, elements: !353)
!353 = !{!354, !355, !358, !374}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !352, file: !4, line: 431, baseType: !86, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !352, file: !4, line: 432, baseType: !356, size: 64, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !4, line: 417, baseType: !166)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !352, file: !4, line: 433, baseType: !359, size: 64, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !4, line: 408, baseType: !360)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{!110, !111, !157, !363, !365}
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !4, line: 38, flags: DIFlagFwdDecl)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !4, line: 348, baseType: !367)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !4, line: 337, size: 256, elements: !368)
!368 = !{!369, !370, !371, !372, !373}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !367, file: !4, line: 339, baseType: !86, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !367, file: !4, line: 342, baseType: !363, size: 64, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !367, file: !4, line: 345, baseType: !110, size: 32, offset: 128)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !367, file: !4, line: 347, baseType: !110, size: 32, offset: 160)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !367, file: !4, line: 347, baseType: !110, size: 32, offset: 192)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !352, file: !4, line: 434, baseType: !375, size: 64, offset: 192)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !4, line: 409, baseType: !376)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{null, !86}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !96, file: !97, line: 566, baseType: !134, size: 16, offset: 1472)
!380 = !{}
!381 = !DILocalVariable(name: "ot", arg: 1, scope: !92, file: !1, line: 279, type: !95)
!382 = !DILocation(line: 279, column: 51, scope: !92)
!383 = !DILocalVariable(name: "prop", scope: !92, file: !1, line: 281, type: !326)
!384 = !DILocation(line: 281, column: 15, scope: !92)
!385 = !DILocation(line: 284, column: 2, scope: !92)
!386 = !DILocation(line: 284, column: 6, scope: !92)
!387 = !DILocation(line: 284, column: 11, scope: !92)
!388 = !DILocation(line: 285, column: 2, scope: !92)
!389 = !DILocation(line: 285, column: 6, scope: !92)
!390 = !DILocation(line: 285, column: 18, scope: !92)
!391 = !DILocation(line: 286, column: 2, scope: !92)
!392 = !DILocation(line: 286, column: 6, scope: !92)
!393 = !DILocation(line: 286, column: 13, scope: !92)
!394 = !DILocation(line: 289, column: 2, scope: !92)
!395 = !DILocation(line: 289, column: 6, scope: !92)
!396 = !DILocation(line: 289, column: 11, scope: !92)
!397 = !DILocation(line: 290, column: 2, scope: !92)
!398 = !DILocation(line: 290, column: 6, scope: !92)
!399 = !DILocation(line: 290, column: 11, scope: !92)
!400 = !DILocation(line: 293, column: 2, scope: !92)
!401 = !DILocation(line: 293, column: 6, scope: !92)
!402 = !DILocation(line: 293, column: 11, scope: !92)
!403 = !DILocation(line: 296, column: 23, scope: !92)
!404 = !DILocation(line: 296, column: 27, scope: !92)
!405 = !DILocation(line: 296, column: 9, scope: !92)
!406 = !DILocation(line: 296, column: 7, scope: !92)
!407 = !DILocation(line: 298, column: 27, scope: !92)
!408 = !DILocation(line: 298, column: 2, scope: !92)
!409 = !DILocation(line: 300, column: 23, scope: !92)
!410 = !DILocation(line: 300, column: 27, scope: !92)
!411 = !DILocation(line: 300, column: 9, scope: !92)
!412 = !DILocation(line: 300, column: 7, scope: !92)
!413 = !DILocation(line: 302, column: 27, scope: !92)
!414 = !DILocation(line: 302, column: 2, scope: !92)
!415 = !DILocation(line: 304, column: 23, scope: !92)
!416 = !DILocation(line: 304, column: 27, scope: !92)
!417 = !DILocation(line: 304, column: 9, scope: !92)
!418 = !DILocation(line: 304, column: 7, scope: !92)
!419 = !DILocation(line: 305, column: 23, scope: !92)
!420 = !DILocation(line: 305, column: 27, scope: !92)
!421 = !DILocation(line: 305, column: 9, scope: !92)
!422 = !DILocation(line: 305, column: 7, scope: !92)
!423 = !DILocation(line: 308, column: 30, scope: !92)
!424 = !DILocation(line: 308, column: 34, scope: !92)
!425 = !DILocation(line: 308, column: 9, scope: !92)
!426 = !DILocation(line: 308, column: 7, scope: !92)
!427 = !DILocation(line: 309, column: 24, scope: !92)
!428 = !DILocation(line: 309, column: 2, scope: !92)
!429 = !DILocation(line: 311, column: 34, scope: !92)
!430 = !DILocation(line: 311, column: 38, scope: !92)
!431 = !DILocation(line: 311, column: 9, scope: !92)
!432 = !DILocation(line: 311, column: 7, scope: !92)
!433 = !DILocation(line: 312, column: 24, scope: !92)
!434 = !DILocation(line: 312, column: 2, scope: !92)
!435 = !DILocation(line: 313, column: 1, scope: !92)
!436 = distinct !DISubprogram(name: "object_warp_verts_exec", scope: !1, file: !1, line: 175, type: !437, scopeLine: 176, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !380)
!437 = !DISubroutineType(types: !438)
!438 = !{!110, !439, !441}
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "bContext", file: !193, line: 69, baseType: !112)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperator", file: !76, line: 348, baseType: !114)
!443 = !DILocalVariable(name: "C", arg: 1, scope: !436, file: !1, line: 175, type: !439)
!444 = !DILocation(line: 175, column: 45, scope: !436)
!445 = !DILocalVariable(name: "op", arg: 2, scope: !436, file: !1, line: 175, type: !441)
!446 = !DILocation(line: 175, column: 60, scope: !436)
!447 = !DILocalVariable(name: "warp_angle", scope: !436, file: !1, line: 177, type: !448)
!448 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!449 = !DILocation(line: 177, column: 14, scope: !436)
!450 = !DILocation(line: 177, column: 41, scope: !436)
!451 = !DILocation(line: 177, column: 45, scope: !436)
!452 = !DILocation(line: 177, column: 27, scope: !436)
!453 = !DILocalVariable(name: "offset_angle", scope: !436, file: !1, line: 178, type: !448)
!454 = !DILocation(line: 178, column: 14, scope: !436)
!455 = !DILocation(line: 178, column: 43, scope: !436)
!456 = !DILocation(line: 178, column: 47, scope: !436)
!457 = !DILocation(line: 178, column: 29, scope: !436)
!458 = !DILocalVariable(name: "tvs", scope: !436, file: !1, line: 180, type: !459)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "TransVertStore", file: !70, line: 47, baseType: !460)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TransVertStore", file: !70, line: 43, size: 128, elements: !461)
!461 = !{!462, !472, !473}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "transverts", scope: !460, file: !70, line: 44, baseType: !463, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TransVert", file: !70, line: 36, size: 384, elements: !465)
!465 = !{!466, !467, !469, !470, !471}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !464, file: !70, line: 37, baseType: !87, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "oldloc", scope: !464, file: !70, line: 38, baseType: !468, size: 96, offset: 64)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 96, elements: !300)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "maploc", scope: !464, file: !70, line: 38, baseType: !468, size: 96, offset: 160)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !464, file: !70, line: 39, baseType: !468, size: 96, offset: 256)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !464, file: !70, line: 40, baseType: !110, size: 32, offset: 352)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "transverts_tot", scope: !460, file: !70, line: 45, baseType: !110, size: 32, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !460, file: !70, line: 46, baseType: !110, size: 32, offset: 96)
!474 = !DILocation(line: 180, column: 17, scope: !436)
!475 = !DILocalVariable(name: "obedit", scope: !436, file: !1, line: 181, type: !476)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "Object", file: !478, line: 295, baseType: !479)
!478 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !478, line: 115, size: 11392, elements: !480)
!480 = !{!481, !517, !521, !524, !525, !526, !527, !528, !529, !530, !532, !533, !534, !535, !536, !539, !549, !563, !564, !605, !606, !609, !610, !626, !627, !628, !629, !630, !631, !632, !636, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !652, !653, !654, !655, !656, !657, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !717, !718, !719, !720, !721, !722, !723, !724, !725, !728, !731, !734, !735, !736, !737, !738, !741, !744, !747, !748, !754, !755, !756, !757, !758, !759, !761, !764, !767, !769, !1758, !1759}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !479, file: !478, line: 116, baseType: !482, size: 960)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !125, line: 130, baseType: !483)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !125, line: 117, size: 960, elements: !484)
!484 = !{!485, !486, !487, !489, !508, !512, !513, !514, !515, !516}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !483, file: !125, line: 118, baseType: !86, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !483, file: !125, line: 118, baseType: !86, size: 64, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !483, file: !125, line: 119, baseType: !488, size: 64, offset: 128)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !483, file: !125, line: 120, baseType: !490, size: 64, offset: 192)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !125, line: 136, size: 17600, elements: !492)
!492 = !{!493, !494, !496, !499, !503, !504, !505}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !491, file: !125, line: 137, baseType: !482, size: 960)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !491, file: !125, line: 138, baseType: !495, size: 64, offset: 960)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !491, file: !125, line: 139, baseType: !497, size: 64, offset: 1024)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !125, line: 43, flags: DIFlagFwdDecl)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !491, file: !125, line: 140, baseType: !500, size: 8192, offset: 1088)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 8192, elements: !501)
!501 = !{!502}
!502 = !DISubrange(count: 1024)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !491, file: !125, line: 141, baseType: !500, size: 8192, offset: 9280)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !491, file: !125, line: 148, baseType: !490, size: 64, offset: 17472)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !491, file: !125, line: 150, baseType: !506, size: 64, offset: 17536)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !125, line: 45, flags: DIFlagFwdDecl)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !483, file: !125, line: 121, baseType: !509, size: 528, offset: 256)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 528, elements: !510)
!510 = !{!511}
!511 = !DISubrange(count: 66)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !483, file: !125, line: 126, baseType: !134, size: 16, offset: 784)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !483, file: !125, line: 127, baseType: !110, size: 32, offset: 800)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !483, file: !125, line: 128, baseType: !110, size: 32, offset: 832)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !483, file: !125, line: 128, baseType: !110, size: 32, offset: 864)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !483, file: !125, line: 129, baseType: !123, size: 64, offset: 896)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !479, file: !478, line: 117, baseType: !518, size: 64, offset: 960)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !520, line: 45, flags: DIFlagFwdDecl)
!520 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!521 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !479, file: !478, line: 119, baseType: !522, size: 64, offset: 1024)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !478, line: 57, flags: DIFlagFwdDecl)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !479, file: !478, line: 121, baseType: !134, size: 16, offset: 1088)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !479, file: !478, line: 121, baseType: !134, size: 16, offset: 1104)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !479, file: !478, line: 122, baseType: !110, size: 32, offset: 1120)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !479, file: !478, line: 122, baseType: !110, size: 32, offset: 1152)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !479, file: !478, line: 122, baseType: !110, size: 32, offset: 1184)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !479, file: !478, line: 123, baseType: !119, size: 512, offset: 1216)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !479, file: !478, line: 124, baseType: !531, size: 64, offset: 1728)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !479, file: !478, line: 124, baseType: !531, size: 64, offset: 1792)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !479, file: !478, line: 127, baseType: !531, size: 64, offset: 1856)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !479, file: !478, line: 127, baseType: !531, size: 64, offset: 1920)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !479, file: !478, line: 127, baseType: !531, size: 64, offset: 1984)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !479, file: !478, line: 128, baseType: !537, size: 64, offset: 2048)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !520, line: 46, flags: DIFlagFwdDecl)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !479, file: !478, line: 130, baseType: !540, size: 64, offset: 2112)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !478, line: 97, size: 832, elements: !542)
!542 = !{!543, !547, !548}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !541, file: !478, line: 98, baseType: !544, size: 768)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 768, elements: !545)
!545 = !{!546, !301}
!546 = !DISubrange(count: 8)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !541, file: !478, line: 99, baseType: !110, size: 32, offset: 768)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !541, file: !478, line: 99, baseType: !110, size: 32, offset: 800)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !479, file: !478, line: 131, baseType: !550, size: 64, offset: 2176)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !552, line: 486, size: 1600, elements: !553)
!552 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!553 = !{!554, !555, !556, !557, !558, !559, !560, !561, !562}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !551, file: !552, line: 487, baseType: !482, size: 960)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !551, file: !552, line: 489, baseType: !143, size: 128, offset: 960)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !551, file: !552, line: 490, baseType: !143, size: 128, offset: 1088)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !551, file: !552, line: 491, baseType: !143, size: 128, offset: 1216)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !551, file: !552, line: 492, baseType: !143, size: 128, offset: 1344)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !551, file: !552, line: 494, baseType: !110, size: 32, offset: 1472)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !551, file: !552, line: 495, baseType: !110, size: 32, offset: 1504)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !551, file: !552, line: 497, baseType: !110, size: 32, offset: 1536)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !551, file: !552, line: 498, baseType: !110, size: 32, offset: 1568)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !479, file: !478, line: 132, baseType: !550, size: 64, offset: 2240)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !479, file: !478, line: 133, baseType: !565, size: 64, offset: 2304)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !552, line: 334, size: 1728, elements: !567)
!567 = !{!568, !569, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !604}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !566, file: !552, line: 335, baseType: !143, size: 128)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !566, file: !552, line: 336, baseType: !570, size: 64, offset: 128)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !552, line: 47, flags: DIFlagFwdDecl)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !566, file: !552, line: 338, baseType: !134, size: 16, offset: 192)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !566, file: !552, line: 338, baseType: !134, size: 16, offset: 208)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !566, file: !552, line: 339, baseType: !5, size: 32, offset: 224)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !566, file: !552, line: 340, baseType: !110, size: 32, offset: 256)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !566, file: !552, line: 342, baseType: !85, size: 32, offset: 288)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !566, file: !552, line: 343, baseType: !468, size: 96, offset: 320)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !566, file: !552, line: 344, baseType: !468, size: 96, offset: 416)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !566, file: !552, line: 347, baseType: !143, size: 128, offset: 512)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !566, file: !552, line: 349, baseType: !110, size: 32, offset: 640)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !566, file: !552, line: 350, baseType: !110, size: 32, offset: 672)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !566, file: !552, line: 351, baseType: !86, size: 64, offset: 704)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !566, file: !552, line: 352, baseType: !86, size: 64, offset: 768)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !566, file: !552, line: 354, baseType: !585, size: 384, offset: 832)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !552, line: 116, baseType: !586)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !552, line: 94, size: 384, elements: !587)
!587 = !{!588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !586, file: !552, line: 96, baseType: !110, size: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !586, file: !552, line: 96, baseType: !110, size: 32, offset: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !586, file: !552, line: 97, baseType: !110, size: 32, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !586, file: !552, line: 97, baseType: !110, size: 32, offset: 96)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !586, file: !552, line: 99, baseType: !134, size: 16, offset: 128)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !586, file: !552, line: 100, baseType: !134, size: 16, offset: 144)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !586, file: !552, line: 102, baseType: !134, size: 16, offset: 160)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !586, file: !552, line: 105, baseType: !134, size: 16, offset: 176)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !586, file: !552, line: 108, baseType: !134, size: 16, offset: 192)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !586, file: !552, line: 109, baseType: !134, size: 16, offset: 208)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !586, file: !552, line: 111, baseType: !134, size: 16, offset: 224)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !586, file: !552, line: 112, baseType: !134, size: 16, offset: 240)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !586, file: !552, line: 114, baseType: !110, size: 32, offset: 256)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !586, file: !552, line: 114, baseType: !110, size: 32, offset: 288)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !586, file: !552, line: 115, baseType: !110, size: 32, offset: 320)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !586, file: !552, line: 115, baseType: !110, size: 32, offset: 352)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !566, file: !552, line: 355, baseType: !119, size: 512, offset: 1216)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !479, file: !478, line: 134, baseType: !86, size: 64, offset: 2368)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !479, file: !478, line: 136, baseType: !607, size: 64, offset: 2432)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !478, line: 58, flags: DIFlagFwdDecl)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !479, file: !478, line: 138, baseType: !585, size: 384, offset: 2496)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !479, file: !478, line: 139, baseType: !611, size: 64, offset: 2880)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !552, line: 80, baseType: !613)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !552, line: 72, size: 192, elements: !614)
!614 = !{!615, !622, !623, !624, !625}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !613, file: !552, line: 73, baseType: !616, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !552, line: 59, baseType: !618)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !552, line: 56, size: 128, elements: !619)
!619 = !{!620, !621}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !618, file: !552, line: 57, baseType: !468, size: 96)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !618, file: !552, line: 58, baseType: !110, size: 32, offset: 96)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !613, file: !552, line: 74, baseType: !110, size: 32, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !613, file: !552, line: 76, baseType: !110, size: 32, offset: 96)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !613, file: !552, line: 77, baseType: !110, size: 32, offset: 128)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !613, file: !552, line: 79, baseType: !110, size: 32, offset: 160)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !479, file: !478, line: 141, baseType: !143, size: 128, offset: 2944)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !479, file: !478, line: 142, baseType: !143, size: 128, offset: 3072)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !479, file: !478, line: 143, baseType: !143, size: 128, offset: 3200)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !479, file: !478, line: 144, baseType: !143, size: 128, offset: 3328)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !479, file: !478, line: 146, baseType: !110, size: 32, offset: 3456)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !479, file: !478, line: 147, baseType: !110, size: 32, offset: 3488)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !479, file: !478, line: 150, baseType: !633, size: 64, offset: 3520)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !478, line: 50, flags: DIFlagFwdDecl)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !479, file: !478, line: 151, baseType: !637, size: 64, offset: 3584)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !479, file: !478, line: 152, baseType: !110, size: 32, offset: 3648)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !479, file: !478, line: 153, baseType: !110, size: 32, offset: 3680)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !479, file: !478, line: 156, baseType: !468, size: 96, offset: 3712)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !479, file: !478, line: 156, baseType: !468, size: 96, offset: 3808)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !479, file: !478, line: 156, baseType: !468, size: 96, offset: 3904)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !479, file: !478, line: 157, baseType: !468, size: 96, offset: 4000)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !479, file: !478, line: 158, baseType: !468, size: 96, offset: 4096)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !479, file: !478, line: 159, baseType: !468, size: 96, offset: 4192)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !479, file: !478, line: 160, baseType: !468, size: 96, offset: 4288)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !479, file: !478, line: 160, baseType: !468, size: 96, offset: 4384)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !479, file: !478, line: 161, baseType: !649, size: 128, offset: 4480)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 128, elements: !650)
!650 = !{!651}
!651 = !DISubrange(count: 4)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !479, file: !478, line: 161, baseType: !649, size: 128, offset: 4608)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !479, file: !478, line: 162, baseType: !468, size: 96, offset: 4736)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !479, file: !478, line: 162, baseType: !468, size: 96, offset: 4832)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !479, file: !478, line: 163, baseType: !85, size: 32, offset: 4928)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !479, file: !478, line: 163, baseType: !85, size: 32, offset: 4960)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !479, file: !478, line: 164, baseType: !658, size: 512, offset: 4992)
!658 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 512, elements: !659)
!659 = !{!651, !651}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !479, file: !478, line: 165, baseType: !658, size: 512, offset: 5504)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !479, file: !478, line: 166, baseType: !658, size: 512, offset: 6016)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !479, file: !478, line: 167, baseType: !658, size: 512, offset: 6528)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !479, file: !478, line: 176, baseType: !658, size: 512, offset: 7040)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !479, file: !478, line: 178, baseType: !5, size: 32, offset: 7552)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !479, file: !478, line: 180, baseType: !134, size: 16, offset: 7584)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !479, file: !478, line: 181, baseType: !134, size: 16, offset: 7600)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !479, file: !478, line: 183, baseType: !134, size: 16, offset: 7616)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !479, file: !478, line: 183, baseType: !134, size: 16, offset: 7632)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !479, file: !478, line: 184, baseType: !134, size: 16, offset: 7648)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !479, file: !478, line: 184, baseType: !134, size: 16, offset: 7664)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !479, file: !478, line: 185, baseType: !134, size: 16, offset: 7680)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !479, file: !478, line: 186, baseType: !134, size: 16, offset: 7696)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !479, file: !478, line: 187, baseType: !134, size: 16, offset: 7712)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !479, file: !478, line: 188, baseType: !102, size: 8, offset: 7728)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !479, file: !478, line: 189, baseType: !102, size: 8, offset: 7736)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !479, file: !478, line: 192, baseType: !110, size: 32, offset: 7744)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !479, file: !478, line: 192, baseType: !110, size: 32, offset: 7776)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !479, file: !478, line: 192, baseType: !110, size: 32, offset: 7808)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !479, file: !478, line: 192, baseType: !110, size: 32, offset: 7840)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !479, file: !478, line: 194, baseType: !110, size: 32, offset: 7872)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !479, file: !478, line: 202, baseType: !85, size: 32, offset: 7904)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !479, file: !478, line: 202, baseType: !85, size: 32, offset: 7936)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !479, file: !478, line: 202, baseType: !85, size: 32, offset: 7968)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !479, file: !478, line: 211, baseType: !85, size: 32, offset: 8000)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !479, file: !478, line: 212, baseType: !85, size: 32, offset: 8032)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !479, file: !478, line: 213, baseType: !85, size: 32, offset: 8064)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !479, file: !478, line: 214, baseType: !85, size: 32, offset: 8096)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !479, file: !478, line: 215, baseType: !85, size: 32, offset: 8128)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !479, file: !478, line: 216, baseType: !85, size: 32, offset: 8160)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !479, file: !478, line: 219, baseType: !85, size: 32, offset: 8192)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !479, file: !478, line: 220, baseType: !85, size: 32, offset: 8224)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !479, file: !478, line: 221, baseType: !85, size: 32, offset: 8256)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !479, file: !478, line: 224, baseType: !694, size: 16, offset: 8288)
!694 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !479, file: !478, line: 224, baseType: !694, size: 16, offset: 8304)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !479, file: !478, line: 226, baseType: !134, size: 16, offset: 8320)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !479, file: !478, line: 228, baseType: !102, size: 8, offset: 8336)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !479, file: !478, line: 229, baseType: !102, size: 8, offset: 8344)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !479, file: !478, line: 231, baseType: !134, size: 16, offset: 8352)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !479, file: !478, line: 232, baseType: !102, size: 8, offset: 8368)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !479, file: !478, line: 233, baseType: !102, size: 8, offset: 8376)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !479, file: !478, line: 234, baseType: !85, size: 32, offset: 8384)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !479, file: !478, line: 235, baseType: !85, size: 32, offset: 8416)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !479, file: !478, line: 237, baseType: !143, size: 128, offset: 8448)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !479, file: !478, line: 238, baseType: !143, size: 128, offset: 8576)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !479, file: !478, line: 239, baseType: !143, size: 128, offset: 8704)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !479, file: !478, line: 240, baseType: !143, size: 128, offset: 8832)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !479, file: !478, line: 242, baseType: !85, size: 32, offset: 8960)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !479, file: !478, line: 244, baseType: !134, size: 16, offset: 8992)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !479, file: !478, line: 245, baseType: !694, size: 16, offset: 9008)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !479, file: !478, line: 246, baseType: !649, size: 128, offset: 9024)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !479, file: !478, line: 248, baseType: !110, size: 32, offset: 9152)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !479, file: !478, line: 249, baseType: !110, size: 32, offset: 9184)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !479, file: !478, line: 251, baseType: !715, size: 64, offset: 9216)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !478, line: 251, flags: DIFlagFwdDecl)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !479, file: !478, line: 253, baseType: !102, size: 8, offset: 9280)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !479, file: !478, line: 254, baseType: !102, size: 8, offset: 9288)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !479, file: !478, line: 255, baseType: !134, size: 16, offset: 9296)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !479, file: !478, line: 256, baseType: !468, size: 96, offset: 9312)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !479, file: !478, line: 258, baseType: !143, size: 128, offset: 9408)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !479, file: !478, line: 259, baseType: !143, size: 128, offset: 9536)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !479, file: !478, line: 260, baseType: !143, size: 128, offset: 9664)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !479, file: !478, line: 261, baseType: !143, size: 128, offset: 9792)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !479, file: !478, line: 263, baseType: !726, size: 64, offset: 9920)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !478, line: 52, flags: DIFlagFwdDecl)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !479, file: !478, line: 264, baseType: !729, size: 64, offset: 9984)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !478, line: 53, flags: DIFlagFwdDecl)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !479, file: !478, line: 265, baseType: !732, size: 64, offset: 10048)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !552, line: 46, flags: DIFlagFwdDecl)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !479, file: !478, line: 267, baseType: !102, size: 8, offset: 10112)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !479, file: !478, line: 268, baseType: !102, size: 8, offset: 10120)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !479, file: !478, line: 269, baseType: !134, size: 16, offset: 10128)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !479, file: !478, line: 270, baseType: !85, size: 32, offset: 10144)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !479, file: !478, line: 272, baseType: !739, size: 64, offset: 10176)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !478, line: 54, flags: DIFlagFwdDecl)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !479, file: !478, line: 275, baseType: !742, size: 64, offset: 10240)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !478, line: 275, flags: DIFlagFwdDecl)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !479, file: !478, line: 277, baseType: !745, size: 64, offset: 10304)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !478, line: 56, flags: DIFlagFwdDecl)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !479, file: !478, line: 277, baseType: !745, size: 64, offset: 10368)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !479, file: !478, line: 278, baseType: !749, size: 64, offset: 10432)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !750, line: 27, baseType: !751)
!750 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !752, line: 45, baseType: !753)
!752 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!753 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !479, file: !478, line: 279, baseType: !749, size: 64, offset: 10496)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !479, file: !478, line: 280, baseType: !5, size: 32, offset: 10560)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !479, file: !478, line: 281, baseType: !5, size: 32, offset: 10592)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !479, file: !478, line: 283, baseType: !143, size: 128, offset: 10624)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !479, file: !478, line: 284, baseType: !143, size: 128, offset: 10752)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !479, file: !478, line: 285, baseType: !760, size: 64, offset: 10880)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !479, file: !478, line: 287, baseType: !762, size: 64, offset: 10944)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !478, line: 59, flags: DIFlagFwdDecl)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !479, file: !478, line: 288, baseType: !765, size: 64, offset: 11008)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !478, line: 288, flags: DIFlagFwdDecl)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !479, file: !478, line: 290, baseType: !768, size: 64, offset: 11072)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 64, elements: !223)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !479, file: !478, line: 291, baseType: !770, size: 64, offset: 11136)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !772, line: 65, baseType: !773)
!772 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !772, line: 50, size: 320, elements: !774)
!774 = !{!775, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !773, file: !772, line: 51, baseType: !776, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !778, line: 1216, size: 39680, elements: !779)
!778 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!779 = !{!780, !781, !782, !783, !786, !787, !788, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !814, !817, !820, !1115, !1118, !1415, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1437, !1438, !1439, !1440, !1441, !1449, !1515, !1522, !1523, !1530, !1737, !1738, !1739, !1740, !1741, !1742}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !777, file: !778, line: 1217, baseType: !482, size: 960)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !777, file: !778, line: 1218, baseType: !518, size: 64, offset: 960)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !777, file: !778, line: 1220, baseType: !531, size: 64, offset: 1024)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !777, file: !778, line: 1221, baseType: !784, size: 64, offset: 1088)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !778, line: 52, flags: DIFlagFwdDecl)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !777, file: !778, line: 1223, baseType: !776, size: 64, offset: 1152)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !777, file: !778, line: 1225, baseType: !143, size: 128, offset: 1216)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !777, file: !778, line: 1226, baseType: !789, size: 64, offset: 1344)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !778, line: 69, size: 320, elements: !791)
!791 = !{!792, !793, !794, !795, !796, !797, !798, !799}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !790, file: !778, line: 70, baseType: !789, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !790, file: !778, line: 70, baseType: !789, size: 64, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !790, file: !778, line: 71, baseType: !5, size: 32, offset: 128)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !790, file: !778, line: 71, baseType: !5, size: 32, offset: 160)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !790, file: !778, line: 72, baseType: !110, size: 32, offset: 192)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !790, file: !778, line: 73, baseType: !134, size: 16, offset: 224)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !790, file: !778, line: 73, baseType: !134, size: 16, offset: 240)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !790, file: !778, line: 74, baseType: !531, size: 64, offset: 256)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !777, file: !778, line: 1227, baseType: !531, size: 64, offset: 1408)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !777, file: !778, line: 1229, baseType: !468, size: 96, offset: 1472)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !777, file: !778, line: 1230, baseType: !468, size: 96, offset: 1568)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !777, file: !778, line: 1231, baseType: !468, size: 96, offset: 1664)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !777, file: !778, line: 1231, baseType: !468, size: 96, offset: 1760)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !777, file: !778, line: 1233, baseType: !5, size: 32, offset: 1856)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !777, file: !778, line: 1234, baseType: !110, size: 32, offset: 1888)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !777, file: !778, line: 1235, baseType: !5, size: 32, offset: 1920)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !777, file: !778, line: 1237, baseType: !134, size: 16, offset: 1952)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !777, file: !778, line: 1239, baseType: !102, size: 8, offset: 1968)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !777, file: !778, line: 1240, baseType: !811, size: 8, offset: 1976)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 8, elements: !812)
!812 = !{!813}
!813 = !DISubrange(count: 1)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !777, file: !778, line: 1242, baseType: !815, size: 64, offset: 1984)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !520, line: 248, flags: DIFlagFwdDecl)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !777, file: !778, line: 1244, baseType: !818, size: 64, offset: 2048)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !778, line: 59, flags: DIFlagFwdDecl)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !777, file: !778, line: 1246, baseType: !821, size: 64, offset: 2112)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !778, line: 1067, size: 5184, elements: !823)
!823 = !{!824, !854, !855, !870, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !892, !987, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1098}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !822, file: !778, line: 1068, baseType: !825, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !778, line: 934, baseType: !827)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !778, line: 925, size: 576, elements: !828)
!828 = !{!829, !845, !846, !847, !848, !850, !853}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !827, file: !778, line: 926, baseType: !830, size: 320)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !778, line: 830, baseType: !831)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !778, line: 813, size: 320, elements: !832)
!832 = !{!833, !836, !839, !840, !842, !843, !844}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !831, file: !778, line: 814, baseType: !834, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !778, line: 51, flags: DIFlagFwdDecl)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !831, file: !778, line: 815, baseType: !837, size: 64, offset: 64)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !778, line: 815, flags: DIFlagFwdDecl)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !831, file: !778, line: 818, baseType: !86, size: 64, offset: 128)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !831, file: !778, line: 819, baseType: !841, size: 32, offset: 192)
!841 = !DICompositeType(tag: DW_TAG_array_type, baseType: !306, size: 32, elements: !650)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !831, file: !778, line: 822, baseType: !110, size: 32, offset: 224)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !831, file: !778, line: 826, baseType: !110, size: 32, offset: 256)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !831, file: !778, line: 829, baseType: !110, size: 32, offset: 288)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !827, file: !778, line: 928, baseType: !134, size: 16, offset: 320)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !827, file: !778, line: 928, baseType: !134, size: 16, offset: 336)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !827, file: !778, line: 929, baseType: !110, size: 32, offset: 352)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !827, file: !778, line: 930, baseType: !849, size: 64, offset: 384)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !827, file: !778, line: 931, baseType: !851, size: 64, offset: 448)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !778, line: 931, flags: DIFlagFwdDecl)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !827, file: !778, line: 933, baseType: !86, size: 64, offset: 512)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !822, file: !778, line: 1069, baseType: !825, size: 64, offset: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !822, file: !778, line: 1070, baseType: !856, size: 64, offset: 128)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !778, line: 916, baseType: !858)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !778, line: 891, size: 704, elements: !859)
!859 = !{!860, !861, !862, !864, !865, !866, !867, !868, !869}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !858, file: !778, line: 892, baseType: !830, size: 320)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !858, file: !778, line: 896, baseType: !110, size: 32, offset: 320)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !858, file: !778, line: 900, baseType: !863, size: 96, offset: 352)
!863 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 96, elements: !300)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !858, file: !778, line: 903, baseType: !85, size: 32, offset: 448)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !858, file: !778, line: 906, baseType: !110, size: 32, offset: 480)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !858, file: !778, line: 909, baseType: !85, size: 32, offset: 512)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !858, file: !778, line: 912, baseType: !85, size: 32, offset: 544)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !858, file: !778, line: 914, baseType: !531, size: 64, offset: 576)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !858, file: !778, line: 915, baseType: !86, size: 64, offset: 640)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !822, file: !778, line: 1071, baseType: !871, size: 64, offset: 192)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !778, line: 920, baseType: !873)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !778, line: 918, size: 320, elements: !874)
!874 = !{!875}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !873, file: !778, line: 919, baseType: !830, size: 320)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !822, file: !778, line: 1075, baseType: !85, size: 32, offset: 256)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !822, file: !778, line: 1077, baseType: !85, size: 32, offset: 288)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !822, file: !778, line: 1078, baseType: !85, size: 32, offset: 320)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !822, file: !778, line: 1079, baseType: !134, size: 16, offset: 352)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !822, file: !778, line: 1082, baseType: !134, size: 16, offset: 368)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !822, file: !778, line: 1085, baseType: !102, size: 8, offset: 384)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !822, file: !778, line: 1086, baseType: !102, size: 8, offset: 392)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !822, file: !778, line: 1087, baseType: !102, size: 8, offset: 400)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !822, file: !778, line: 1088, baseType: !102, size: 8, offset: 408)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !822, file: !778, line: 1090, baseType: !85, size: 32, offset: 416)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !822, file: !778, line: 1093, baseType: !134, size: 16, offset: 448)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !822, file: !778, line: 1096, baseType: !102, size: 8, offset: 464)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !822, file: !778, line: 1098, baseType: !889, size: 40, offset: 472)
!889 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 40, elements: !890)
!890 = !{!891}
!891 = !DISubrange(count: 5)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !822, file: !778, line: 1101, baseType: !893, size: 832, offset: 512)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !778, line: 836, size: 832, elements: !894)
!894 = !{!895, !896, !897, !898, !899, !900, !902, !903, !904, !983, !984, !985, !986}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !893, file: !778, line: 837, baseType: !830, size: 320)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !893, file: !778, line: 839, baseType: !134, size: 16, offset: 320)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !893, file: !778, line: 839, baseType: !134, size: 16, offset: 336)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !893, file: !778, line: 842, baseType: !134, size: 16, offset: 352)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !893, file: !778, line: 842, baseType: !134, size: 16, offset: 368)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !893, file: !778, line: 843, baseType: !901, size: 32, offset: 384)
!901 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 32, elements: !223)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !893, file: !778, line: 845, baseType: !110, size: 32, offset: 416)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !893, file: !778, line: 847, baseType: !86, size: 64, offset: 448)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !893, file: !778, line: 848, baseType: !905, size: 64, offset: 512)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !772, line: 77, size: 15424, elements: !907)
!907 = !{!908, !909, !910, !913, !916, !919, !922, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !972, !973, !977}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !906, file: !772, line: 78, baseType: !482, size: 960)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !906, file: !772, line: 80, baseType: !500, size: 8192, offset: 960)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !906, file: !772, line: 82, baseType: !911, size: 64, offset: 9152)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !772, line: 43, flags: DIFlagFwdDecl)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !906, file: !772, line: 83, baseType: !914, size: 64, offset: 9216)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !125, line: 46, flags: DIFlagFwdDecl)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !906, file: !772, line: 86, baseType: !917, size: 64, offset: 9280)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !772, line: 41, flags: DIFlagFwdDecl)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !906, file: !772, line: 87, baseType: !920, size: 64, offset: 9344)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !772, line: 44, flags: DIFlagFwdDecl)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !906, file: !772, line: 89, baseType: !923, size: 512, offset: 9408)
!923 = !DICompositeType(tag: DW_TAG_array_type, baseType: !920, size: 512, elements: !924)
!924 = !{!546}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !906, file: !772, line: 90, baseType: !134, size: 16, offset: 9920)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !906, file: !772, line: 90, baseType: !134, size: 16, offset: 9936)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !906, file: !772, line: 92, baseType: !134, size: 16, offset: 9952)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !906, file: !772, line: 92, baseType: !134, size: 16, offset: 9968)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !906, file: !772, line: 93, baseType: !134, size: 16, offset: 9984)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !906, file: !772, line: 93, baseType: !134, size: 16, offset: 10000)
