; ModuleID = 'zlib/trees.c'
source_filename = "zlib/trees.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.static_tree_desc_s = type { %struct.ct_data_s*, i32*, i32, i32, i32 }
%struct.ct_data_s = type { %union.anon, %union.anon.0 }
%union.anon = type { i16 }
%union.anon.0 = type { i16 }
%struct.internal_state = type { %struct.z_stream_s*, i32, i8*, i64, i8*, i32, i32, %struct.gz_header_s*, i32, i8, i32, i32, i32, i32, i8*, i64, i16*, i16*, i32, i32, i32, i32, i32, i64, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [573 x %struct.ct_data_s], [61 x %struct.ct_data_s], [39 x %struct.ct_data_s], %struct.tree_desc_s, %struct.tree_desc_s, %struct.tree_desc_s, [16 x i16], [573 x i32], i32, i32, [573 x i8], i8*, i32, i32, i16*, i64, i64, i32, i32, i16, i32, i64 }
%struct.z_stream_s = type { i8*, i32, i64, i8*, i32, i64, i8*, %struct.internal_state*, i8* (i8*, i32, i32)*, void (i8*, i8*)*, i8*, i32, i64, i64 }
%struct.gz_header_s = type { i32, i64, i32, i32, i8*, i32, i32, i8*, i32, i8*, i32, i32, i32 }
%struct.tree_desc_s = type { %struct.ct_data_s*, i32, %struct.static_tree_desc_s* }


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_dist_code", scope: !2, file: !59, line: 73, type: !101, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !56, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "zlib/trees.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{}
!5 = !{!6, !7, !10, !12, !13, !50, !19, !52, !54, !55}
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "ush", file: !8, line: 43, baseType: !9)
!8 = !DIFile(filename: "zlib/zutil.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!9 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "uch", file: !8, line: 41, baseType: !11)
!11 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!12 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree_desc", file: !15, line: 87, baseType: !16)
!15 = !DIFile(filename: "zlib/deflate.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_desc_s", file: !15, line: 83, size: 192, elements: !17)
!17 = !{!18, !33, !34}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "dyn_tree", scope: !16, file: !15, line: 84, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "ct_data", file: !15, line: 74, baseType: !21)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ct_data_s", file: !15, line: 65, size: 32, elements: !22)
!22 = !{!23, !28}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "fc", scope: !21, file: !15, line: 69, baseType: !24, size: 16)
!24 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !21, file: !15, line: 66, size: 16, elements: !25)
!25 = !{!26, !27}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "freq", scope: !24, file: !15, line: 67, baseType: !7, size: 16)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !24, file: !15, line: 68, baseType: !7, size: 16)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !21, file: !15, line: 73, baseType: !29, size: 16, offset: 16)
!29 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !21, file: !15, line: 70, size: 16, elements: !30)
!30 = !{!31, !32}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "dad", scope: !29, file: !15, line: 71, baseType: !7, size: 16)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !29, file: !15, line: 72, baseType: !7, size: 16)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "max_code", scope: !16, file: !15, line: 85, baseType: !6, size: 32, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "stat_desc", scope: !16, file: !15, line: 86, baseType: !35, size: 64, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "static_tree_desc", file: !15, line: 81, baseType: !37)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "static_tree_desc_s", file: !3, line: 117, size: 256, elements: !38)
!38 = !{!39, !42, !47, !48, !49}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "static_tree", scope: !37, file: !3, line: 118, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "extra_bits", scope: !37, file: !3, line: 119, baseType: !43, size: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "intf", file: !46, line: 377, baseType: !6)
!46 = !DIFile(filename: "zlib/zconf.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!47 = !DIDerivedType(tag: DW_TAG_member, name: "extra_base", scope: !37, file: !3, line: 120, baseType: !6, size: 32, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "elems", scope: !37, file: !3, line: 121, baseType: !6, size: 32, offset: 160)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "max_length", scope: !37, file: !3, line: 122, baseType: !6, size: 32, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "ulg", file: !8, line: 45, baseType: !53)
!53 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!54 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "Byte", file: !46, line: 365, baseType: !11)
!56 = !{!0, !57, !64, !66, !72, !74, !79, !81, !86, !91, !94, !97, !99}
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(name: "_length_code", scope: !2, file: !59, line: 102, type: !60, isLocal: false, isDefinition: true)
!59 = !DIFile(filename: "zlib/trees.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 2048, elements: !62)
!61 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!62 = !{!63}
!63 = !DISubrange(count: 256)
!64 = !DIGlobalVariableExpression(var: !65, expr: !DIExpression())
!65 = distinct !DIGlobalVariable(name: "static_l_desc", scope: !2, file: !3, line: 125, type: !36, isLocal: true, isDefinition: true)
!66 = !DIGlobalVariableExpression(var: !67, expr: !DIExpression())
!67 = distinct !DIGlobalVariable(name: "extra_lbits", scope: !2, file: !3, line: 62, type: !68, isLocal: true, isDefinition: true)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 928, elements: !70)
!69 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!70 = !{!71}
!71 = !DISubrange(count: 29)
!72 = !DIGlobalVariableExpression(var: !73, expr: !DIExpression())
!73 = distinct !DIGlobalVariable(name: "static_d_desc", scope: !2, file: !3, line: 128, type: !36, isLocal: true, isDefinition: true)
!74 = !DIGlobalVariableExpression(var: !75, expr: !DIExpression())
!75 = distinct !DIGlobalVariable(name: "extra_dbits", scope: !2, file: !3, line: 65, type: !76, isLocal: true, isDefinition: true)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 960, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: 30)
!79 = !DIGlobalVariableExpression(var: !80, expr: !DIExpression())
!80 = distinct !DIGlobalVariable(name: "static_bl_desc", scope: !2, file: !3, line: 131, type: !36, isLocal: true, isDefinition: true)
!81 = !DIGlobalVariableExpression(var: !82, expr: !DIExpression())
!82 = distinct !DIGlobalVariable(name: "extra_blbits", scope: !2, file: !3, line: 68, type: !83, isLocal: true, isDefinition: true)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 608, elements: !84)
!84 = !{!85}
!85 = !DISubrange(count: 19)
!86 = !DIGlobalVariableExpression(var: !87, expr: !DIExpression())
!87 = distinct !DIGlobalVariable(name: "static_ltree", scope: !2, file: !59, line: 3, type: !88, isLocal: true, isDefinition: true)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 9216, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 288)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "bl_order", scope: !2, file: !3, line: 71, type: !93, isLocal: true, isDefinition: true)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 152, elements: !84)
!94 = !DIGlobalVariableExpression(var: !95, expr: !DIExpression())
!95 = distinct !DIGlobalVariable(name: "static_dtree", scope: !2, file: !59, line: 64, type: !96, isLocal: true, isDefinition: true)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 960, elements: !77)
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(name: "base_length", scope: !2, file: !59, line: 118, type: !68, isLocal: true, isDefinition: true)
!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(name: "base_dist", scope: !2, file: !59, line: 123, type: !76, isLocal: true, isDefinition: true)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 4096, elements: !102)
!102 = !{!103}
!103 = !DISubrange(count: 512)
!104 = !{i32 7, !"Dwarf Version", i32 4}
!105 = !{i32 2, !"Debug Info Version", i32 3}
!106 = !{i32 1, !"wchar_size", i32 4}
!107 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!108 = distinct !DISubprogram(name: "_tr_init", scope: !3, file: !3, line: 381, type: !109, scopeLine: 383, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!109 = !DISubroutineType(types: !110)
!110 = !{null, !111}
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "deflate_state", file: !15, line: 273, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "internal_state", file: !15, line: 97, size: 47488, elements: !114)
!114 = !{!115, !151, !152, !153, !154, !155, !156, !157, !176, !177, !178, !179, !180, !181, !182, !183, !184, !188, !189, !190, !191, !192, !193, !194, !195, !196, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !213, !217, !221, !222, !223, !224, !228, !230, !231, !232, !234, !237, !238, !239, !242, !243, !244, !245, !246, !247, !248}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "strm", scope: !113, file: !15, line: 98, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_streamp", file: !117, line: 106, baseType: !118)
!117 = !DIFile(filename: "zlib/zlib.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_stream", file: !117, line: 104, baseType: !120)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_stream_s", file: !117, line: 85, size: 896, elements: !121)
!121 = !{!122, !125, !127, !129, !130, !131, !132, !133, !135, !142, !147, !148, !149, !150}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !120, file: !117, line: 86, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bytef", file: !46, line: 374, baseType: !55)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !120, file: !117, line: 87, baseType: !126, size: 32, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "uInt", file: !46, line: 367, baseType: !12)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !120, file: !117, line: 88, baseType: !128, size: 64, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "uLong", file: !46, line: 368, baseType: !53)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !120, file: !117, line: 90, baseType: !123, size: 64, offset: 192)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !120, file: !117, line: 91, baseType: !126, size: 32, offset: 256)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !120, file: !117, line: 92, baseType: !128, size: 64, offset: 320)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !120, file: !117, line: 94, baseType: !50, size: 64, offset: 384)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !120, file: !117, line: 95, baseType: !134, size: 64, offset: 448)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "zalloc", scope: !120, file: !117, line: 97, baseType: !136, size: 64, offset: 512)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_func", file: !117, line: 80, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!140, !140, !126, !126}
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "voidpf", file: !46, line: 383, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "zfree", scope: !120, file: !117, line: 98, baseType: !143, size: 64, offset: 576)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "free_func", file: !117, line: 81, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{null, !140, !140}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !120, file: !117, line: 99, baseType: !140, size: 64, offset: 640)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !120, file: !117, line: 101, baseType: !6, size: 32, offset: 704)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "adler", scope: !120, file: !117, line: 102, baseType: !128, size: 64, offset: 768)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !120, file: !117, line: 103, baseType: !128, size: 64, offset: 832)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !113, file: !15, line: 99, baseType: !6, size: 32, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "pending_buf", scope: !113, file: !15, line: 100, baseType: !123, size: 64, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "pending_buf_size", scope: !113, file: !15, line: 101, baseType: !52, size: 64, offset: 192)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "pending_out", scope: !113, file: !15, line: 102, baseType: !123, size: 64, offset: 256)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !113, file: !15, line: 103, baseType: !126, size: 32, offset: 320)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "wrap", scope: !113, file: !15, line: 104, baseType: !6, size: 32, offset: 352)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "gzhead", scope: !113, file: !15, line: 105, baseType: !158, size: 64, offset: 384)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "gz_headerp", file: !117, line: 129, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "gz_header", file: !117, line: 127, baseType: !161)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gz_header_s", file: !117, line: 112, size: 640, elements: !162)
!162 = !{!163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !161, file: !117, line: 113, baseType: !6, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !161, file: !117, line: 114, baseType: !128, size: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "xflags", scope: !161, file: !117, line: 115, baseType: !6, size: 32, offset: 128)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "os", scope: !161, file: !117, line: 116, baseType: !6, size: 32, offset: 160)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !161, file: !117, line: 117, baseType: !123, size: 64, offset: 192)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "extra_len", scope: !161, file: !117, line: 118, baseType: !126, size: 32, offset: 256)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "extra_max", scope: !161, file: !117, line: 119, baseType: !126, size: 32, offset: 288)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !161, file: !117, line: 120, baseType: !123, size: 64, offset: 320)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "name_max", scope: !161, file: !117, line: 121, baseType: !126, size: 32, offset: 384)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !161, file: !117, line: 122, baseType: !123, size: 64, offset: 448)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "comm_max", scope: !161, file: !117, line: 123, baseType: !126, size: 32, offset: 512)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "hcrc", scope: !161, file: !117, line: 124, baseType: !6, size: 32, offset: 544)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !161, file: !117, line: 125, baseType: !6, size: 32, offset: 576)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "gzindex", scope: !113, file: !15, line: 106, baseType: !126, size: 32, offset: 448)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !113, file: !15, line: 107, baseType: !55, size: 8, offset: 480)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "last_flush", scope: !113, file: !15, line: 108, baseType: !6, size: 32, offset: 512)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "w_size", scope: !113, file: !15, line: 112, baseType: !126, size: 32, offset: 544)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "w_bits", scope: !113, file: !15, line: 113, baseType: !126, size: 32, offset: 576)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "w_mask", scope: !113, file: !15, line: 114, baseType: !126, size: 32, offset: 608)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !113, file: !15, line: 116, baseType: !123, size: 64, offset: 640)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "window_size", scope: !113, file: !15, line: 126, baseType: !52, size: 64, offset: 704)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !113, file: !15, line: 131, baseType: !185, size: 64, offset: 768)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "Posf", file: !15, line: 90, baseType: !187)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pos", file: !15, line: 89, baseType: !7)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !113, file: !15, line: 137, baseType: !185, size: 64, offset: 832)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "ins_h", scope: !113, file: !15, line: 139, baseType: !126, size: 32, offset: 896)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "hash_size", scope: !113, file: !15, line: 140, baseType: !126, size: 32, offset: 928)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "hash_bits", scope: !113, file: !15, line: 141, baseType: !126, size: 32, offset: 960)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "hash_mask", scope: !113, file: !15, line: 142, baseType: !126, size: 32, offset: 992)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "hash_shift", scope: !113, file: !15, line: 144, baseType: !126, size: 32, offset: 1024)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "block_start", scope: !113, file: !15, line: 151, baseType: !54, size: 64, offset: 1088)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "match_length", scope: !113, file: !15, line: 156, baseType: !126, size: 32, offset: 1152)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "prev_match", scope: !113, file: !15, line: 157, baseType: !197, size: 32, offset: 1184)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "IPos", file: !15, line: 91, baseType: !12)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "match_available", scope: !113, file: !15, line: 158, baseType: !6, size: 32, offset: 1216)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "strstart", scope: !113, file: !15, line: 159, baseType: !126, size: 32, offset: 1248)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "match_start", scope: !113, file: !15, line: 160, baseType: !126, size: 32, offset: 1280)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "lookahead", scope: !113, file: !15, line: 161, baseType: !126, size: 32, offset: 1312)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "prev_length", scope: !113, file: !15, line: 163, baseType: !126, size: 32, offset: 1344)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "max_chain_length", scope: !113, file: !15, line: 168, baseType: !126, size: 32, offset: 1376)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "max_lazy_match", scope: !113, file: !15, line: 174, baseType: !126, size: 32, offset: 1408)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !113, file: !15, line: 185, baseType: !6, size: 32, offset: 1440)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "strategy", scope: !113, file: !15, line: 186, baseType: !6, size: 32, offset: 1472)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "good_match", scope: !113, file: !15, line: 188, baseType: !126, size: 32, offset: 1504)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "nice_match", scope: !113, file: !15, line: 191, baseType: !6, size: 32, offset: 1536)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "dyn_ltree", scope: !113, file: !15, line: 195, baseType: !210, size: 18336, offset: 1568)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 18336, elements: !211)
!211 = !{!212}
!212 = !DISubrange(count: 573)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "dyn_dtree", scope: !113, file: !15, line: 196, baseType: !214, size: 1952, offset: 19904)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 1952, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 61)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "bl_tree", scope: !113, file: !15, line: 197, baseType: !218, size: 1248, offset: 21856)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 1248, elements: !219)
!219 = !{!220}
!220 = !DISubrange(count: 39)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "l_desc", scope: !113, file: !15, line: 199, baseType: !16, size: 192, offset: 23104)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "d_desc", scope: !113, file: !15, line: 200, baseType: !16, size: 192, offset: 23296)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "bl_desc", scope: !113, file: !15, line: 201, baseType: !16, size: 192, offset: 23488)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "bl_count", scope: !113, file: !15, line: 203, baseType: !225, size: 256, offset: 23680)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !226)
!226 = !{!227}
!227 = !DISubrange(count: 16)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !113, file: !15, line: 206, baseType: !229, size: 18336, offset: 23936)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 18336, elements: !211)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "heap_len", scope: !113, file: !15, line: 207, baseType: !6, size: 32, offset: 42272)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "heap_max", scope: !113, file: !15, line: 208, baseType: !6, size: 32, offset: 42304)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !113, file: !15, line: 213, baseType: !233, size: 4584, offset: 42336)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 4584, elements: !211)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "l_buf", scope: !113, file: !15, line: 217, baseType: !235, size: 64, offset: 46976)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchf", file: !8, line: 42, baseType: !10)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "lit_bufsize", scope: !113, file: !15, line: 219, baseType: !126, size: 32, offset: 47040)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "last_lit", scope: !113, file: !15, line: 239, baseType: !126, size: 32, offset: 47072)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "d_buf", scope: !113, file: !15, line: 241, baseType: !240, size: 64, offset: 47104)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "ushf", file: !8, line: 44, baseType: !7)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "opt_len", scope: !113, file: !15, line: 247, baseType: !52, size: 64, offset: 47168)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "static_len", scope: !113, file: !15, line: 248, baseType: !52, size: 64, offset: 47232)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "matches", scope: !113, file: !15, line: 249, baseType: !126, size: 32, offset: 47296)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "insert", scope: !113, file: !15, line: 250, baseType: !126, size: 32, offset: 47328)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "bi_buf", scope: !113, file: !15, line: 257, baseType: !7, size: 16, offset: 47360)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "bi_valid", scope: !113, file: !15, line: 261, baseType: !6, size: 32, offset: 47392)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "high_water", scope: !113, file: !15, line: 266, baseType: !52, size: 64, offset: 47424)
!249 = !DILocalVariable(name: "s", arg: 1, scope: !108, file: !3, line: 382, type: !111)
!250 = !DILocation(line: 382, column: 20, scope: !108)
!251 = !DILocation(line: 384, column: 5, scope: !108)
!252 = !DILocation(line: 386, column: 26, scope: !108)
!253 = !DILocation(line: 386, column: 29, scope: !108)
!254 = !DILocation(line: 386, column: 5, scope: !108)
!255 = !DILocation(line: 386, column: 8, scope: !108)
!256 = !DILocation(line: 386, column: 15, scope: !108)
!257 = !DILocation(line: 386, column: 24, scope: !108)
!258 = !DILocation(line: 387, column: 5, scope: !108)
!259 = !DILocation(line: 387, column: 8, scope: !108)
!260 = !DILocation(line: 387, column: 15, scope: !108)
!261 = !DILocation(line: 387, column: 25, scope: !108)
!262 = !DILocation(line: 389, column: 26, scope: !108)
!263 = !DILocation(line: 389, column: 29, scope: !108)
!264 = !DILocation(line: 389, column: 5, scope: !108)
!265 = !DILocation(line: 389, column: 8, scope: !108)
!266 = !DILocation(line: 389, column: 15, scope: !108)
!267 = !DILocation(line: 389, column: 24, scope: !108)
!268 = !DILocation(line: 390, column: 5, scope: !108)
!269 = !DILocation(line: 390, column: 8, scope: !108)
!270 = !DILocation(line: 390, column: 15, scope: !108)
!271 = !DILocation(line: 390, column: 25, scope: !108)
!272 = !DILocation(line: 392, column: 27, scope: !108)
!273 = !DILocation(line: 392, column: 30, scope: !108)
!274 = !DILocation(line: 392, column: 5, scope: !108)
!275 = !DILocation(line: 392, column: 8, scope: !108)
!276 = !DILocation(line: 392, column: 16, scope: !108)
!277 = !DILocation(line: 392, column: 25, scope: !108)
!278 = !DILocation(line: 393, column: 5, scope: !108)
!279 = !DILocation(line: 393, column: 8, scope: !108)
!280 = !DILocation(line: 393, column: 16, scope: !108)
!281 = !DILocation(line: 393, column: 26, scope: !108)
!282 = !DILocation(line: 395, column: 5, scope: !108)
!283 = !DILocation(line: 395, column: 8, scope: !108)
!284 = !DILocation(line: 395, column: 15, scope: !108)
!285 = !DILocation(line: 396, column: 5, scope: !108)
!286 = !DILocation(line: 396, column: 8, scope: !108)
!287 = !DILocation(line: 396, column: 17, scope: !108)
!288 = !DILocation(line: 403, column: 16, scope: !108)
!289 = !DILocation(line: 403, column: 5, scope: !108)
!290 = !DILocation(line: 404, column: 1, scope: !108)
!291 = distinct !DISubprogram(name: "tr_static_init", scope: !3, file: !3, line: 234, type: !292, scopeLine: 235, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!292 = !DISubroutineType(types: !293)
!293 = !{null}
!294 = !DILocation(line: 314, column: 1, scope: !291)
!295 = distinct !DISubprogram(name: "init_block", scope: !3, file: !3, line: 409, type: !109, scopeLine: 411, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!296 = !DILocalVariable(name: "s", arg: 1, scope: !295, file: !3, line: 410, type: !111)
!297 = !DILocation(line: 410, column: 20, scope: !295)
!298 = !DILocalVariable(name: "n", scope: !295, file: !3, line: 412, type: !6)
!299 = !DILocation(line: 412, column: 9, scope: !295)
!300 = !DILocation(line: 415, column: 12, scope: !301)
!301 = distinct !DILexicalBlock(scope: !295, file: !3, line: 415, column: 5)
!302 = !DILocation(line: 415, column: 10, scope: !301)
!303 = !DILocation(line: 415, column: 17, scope: !304)
!304 = distinct !DILexicalBlock(scope: !301, file: !3, line: 415, column: 5)
!305 = !DILocation(line: 415, column: 19, scope: !304)
!306 = !DILocation(line: 415, column: 5, scope: !301)
!307 = !DILocation(line: 415, column: 36, scope: !304)
!308 = !DILocation(line: 415, column: 39, scope: !304)
!309 = !DILocation(line: 415, column: 49, scope: !304)
!310 = !DILocation(line: 415, column: 52, scope: !304)
!311 = !DILocation(line: 415, column: 57, scope: !304)
!312 = !DILocation(line: 415, column: 32, scope: !304)
