; ModuleID = 'blender/source/blender/bmesh/operators/bmo_poke.c'
source_filename = "blender/source/blender/bmesh/operators/bmo_poke.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BMesh = type { i32, i32, i32, i32, i32, i32, i32, i8, i8, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BMVert**, %struct.BMEdge**, %struct.BMFace**, i32, i32, i32, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, i32, %struct.BMOperator*, %struct.CustomData, %struct.CustomData, %struct.CustomData, %struct.CustomData, i16, i32, i32, i32, %struct.ListBase, %struct.BMFace*, %struct.ListBase, i8* }
%struct.BMVert = type { %struct.BMHeader, %struct.BMFlagLayer*, [3 x float], [3 x float], %struct.BMEdge* }
%struct.BMHeader = type { i8*, i32, i8, i8, i8 }
%struct.BMFlagLayer = type { i16 }
%struct.BMEdge = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMVert*, %struct.BMVert*, %struct.BMLoop*, %struct.BMDiskLink, %struct.BMDiskLink }
%struct.BMLoop = type { %struct.BMHeader, %struct.BMVert*, %struct.BMEdge*, %struct.BMFace*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop* }
%struct.BMDiskLink = type { %struct.BMEdge*, %struct.BMEdge* }
%struct.BLI_mempool = type opaque
%struct.CustomData = type { %struct.CustomDataLayer*, [41 x i32], i32, i32, i32, %struct.BLI_mempool*, %struct.CustomDataExternal* }

!1 = !DIFile(filename: "blender/source/blender/bmesh/operators/bmo_poke.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !15, !21, !27, !35, !42, !49}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotType", file: !4, line: 94, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_operator_api.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14}
!7 = !DIEnumerator(name: "BMO_OP_SLOT_BOOL", value: 1, isUnsigned: true)
!8 = !DIEnumerator(name: "BMO_OP_SLOT_INT", value: 2, isUnsigned: true)
!9 = !DIEnumerator(name: "BMO_OP_SLOT_FLT", value: 3, isUnsigned: true)
!10 = !DIEnumerator(name: "BMO_OP_SLOT_PTR", value: 4, isUnsigned: true)
!11 = !DIEnumerator(name: "BMO_OP_SLOT_MAT", value: 5, isUnsigned: true)
!12 = !DIEnumerator(name: "BMO_OP_SLOT_VEC", value: 8, isUnsigned: true)
!13 = !DIEnumerator(name: "BMO_OP_SLOT_ELEMENT_BUF", value: 9, isUnsigned: true)
!14 = !DIEnumerator(name: "BMO_OP_SLOT_MAPPING", value: 10, isUnsigned: true)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Elem", file: !4, line: 116, baseType: !5, size: 32, elements: !16)
!16 = !{!17, !18, !19, !20}
!17 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_VERT", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_EDGE", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_FACE", value: 8, isUnsigned: true)
!20 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_IS_SINGLE", value: 16, isUnsigned: true)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Ptr", file: !4, line: 131, baseType: !5, size: 32, elements: !22)
!22 = !{!23, !24, !25, !26}
!23 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_BMESH", value: 100, isUnsigned: true)
!24 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_SCENE", value: 101, isUnsigned: true)
!25 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_OBJECT", value: 102, isUnsigned: true)
!26 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_MESH", value: 103, isUnsigned: true)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Map", file: !4, line: 123, baseType: !5, size: 32, elements: !28)
!28 = !{!29, !30, !31, !32, !33, !34}
!29 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_EMPTY", value: 64, isUnsigned: true)
!30 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_ELEM", value: 65, isUnsigned: true)
!31 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_FLT", value: 66, isUnsigned: true)
!32 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INT", value: 67, isUnsigned: true)
!33 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_BOOL", value: 68, isUnsigned: true)
!34 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INTERNAL", value: 69, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 182, baseType: !5, size: 32, elements: !36)
!36 = !{!37, !38, !39, !40, !41}
!37 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NOP", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_UNTAN_MULTIRES", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NORMALS_CALC", value: 2, isUnsigned: true)
!40 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_FLUSH", value: 4, isUnsigned: true)
!41 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 249, baseType: !5, size: 32, elements: !44)
!43 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!44 = !{!45, !46, !47, !48}
!45 = !DIEnumerator(name: "BM_VERT", value: 1, isUnsigned: true)
!46 = !DIEnumerator(name: "BM_EDGE", value: 2, isUnsigned: true)
!47 = !DIEnumerator(name: "BM_LOOP", value: 4, isUnsigned: true)
!48 = !DIEnumerator(name: "BM_FACE", value: 8, isUnsigned: true)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMCreateFlag", file: !50, line: 33, baseType: !5, size: 32, elements: !51)
!50 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_core.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!51 = !{!52, !53, !54}
!52 = !DIEnumerator(name: "BM_CREATE_NOP", value: 0, isUnsigned: true)
!53 = !DIEnumerator(name: "BM_CREATE_NO_DOUBLE", value: 2, isUnsigned: true)
!54 = !DIEnumerator(name: "BM_CREATE_SKIP_CD", value: 4, isUnsigned: true)
!55 = !{!56}
!56 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!57 = !{i32 7, !"Dwarf Version", i32 4}
!58 = !{i32 2, !"Debug Info Version", i32 3}
!59 = !{i32 1, !"wchar_size", i32 4}
!60 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!61 = distinct !DISubprogram(name: "bmo_poke_exec", scope: !1, file: !1, line: 46, type: !62, scopeLine: 47, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !277)
!62 = !DISubroutineType(types: !63)
!63 = !{null, !64, !275}
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !43, line: 246, baseType: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !43, line: 186, size: 8064, elements: !67)
!67 = !{!68, !70, !71, !72, !73, !74, !75, !76, !78, !79, !83, !84, !85, !86, !152, !156, !160, !161, !162, !163, !164, !165, !166, !167, !219, !258, !259, !260, !261, !262, !263, !264, !265, !272, !273, !274}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !66, file: !43, line: 187, baseType: !69, size: 32)
!69 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !66, file: !43, line: 187, baseType: !69, size: 32, offset: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !66, file: !43, line: 187, baseType: !69, size: 32, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !66, file: !43, line: 187, baseType: !69, size: 32, offset: 96)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !66, file: !43, line: 188, baseType: !69, size: 32, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !66, file: !43, line: 188, baseType: !69, size: 32, offset: 160)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !66, file: !43, line: 188, baseType: !69, size: 32, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !66, file: !43, line: 193, baseType: !77, size: 8, offset: 224)
!77 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !66, file: !43, line: 197, baseType: !77, size: 8, offset: 232)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !66, file: !43, line: 201, baseType: !80, size: 64, offset: 256)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !82, line: 71, flags: DIFlagFwdDecl)
!82 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!83 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !66, file: !43, line: 201, baseType: !80, size: 64, offset: 320)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !66, file: !43, line: 201, baseType: !80, size: 64, offset: 384)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !66, file: !43, line: 201, baseType: !80, size: 64, offset: 448)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !66, file: !43, line: 208, baseType: !87, size: 64, offset: 512)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !43, line: 103, baseType: !90)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !43, line: 90, size: 448, elements: !91)
!91 = !{!92, !102, !108, !112, !113}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !90, file: !43, line: 91, baseType: !93, size: 128)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !43, line: 82, baseType: !94)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !43, line: 64, size: 128, elements: !95)
!95 = !{!96, !98, !99, !100, !101}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !94, file: !43, line: 65, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !94, file: !43, line: 66, baseType: !69, size: 32, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !94, file: !43, line: 73, baseType: !77, size: 8, offset: 96)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !94, file: !43, line: 74, baseType: !77, size: 8, offset: 104)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !94, file: !43, line: 80, baseType: !77, size: 8, offset: 112)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !90, file: !43, line: 92, baseType: !103, size: 64, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !43, line: 180, size: 16, elements: !105)
!105 = !{!106}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !104, file: !43, line: 181, baseType: !107, size: 16)
!107 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !90, file: !43, line: 94, baseType: !109, size: 96, offset: 192)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 96, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 3)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !90, file: !43, line: 95, baseType: !109, size: 96, offset: 288)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !90, file: !43, line: 102, baseType: !114, size: 64, offset: 384)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !43, line: 110, size: 640, elements: !116)
!116 = !{!117, !118, !119, !121, !122, !145, !151}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !115, file: !43, line: 111, baseType: !93, size: 128)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !115, file: !43, line: 112, baseType: !103, size: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !115, file: !43, line: 114, baseType: !120, size: 64, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !115, file: !43, line: 114, baseType: !120, size: 64, offset: 256)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !115, file: !43, line: 118, baseType: !123, size: 64, offset: 320)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !43, line: 125, size: 576, elements: !125)
!125 = !{!126, !127, !128, !129, !141, !142, !143, !144}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !124, file: !43, line: 126, baseType: !93, size: 128)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !124, file: !43, line: 129, baseType: !120, size: 64, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !124, file: !43, line: 130, baseType: !114, size: 64, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !124, file: !43, line: 131, baseType: !130, size: 64, offset: 256)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !43, line: 164, size: 448, elements: !132)
!132 = !{!133, !134, !135, !138, !139, !140}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !131, file: !43, line: 165, baseType: !93, size: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !131, file: !43, line: 166, baseType: !103, size: 64, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !131, file: !43, line: 172, baseType: !136, size: 64, offset: 192)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !43, line: 140, baseType: !124)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !131, file: !43, line: 174, baseType: !69, size: 32, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !131, file: !43, line: 175, baseType: !109, size: 96, offset: 288)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !131, file: !43, line: 176, baseType: !107, size: 16, offset: 384)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !124, file: !43, line: 135, baseType: !123, size: 64, offset: 320)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !124, file: !43, line: 135, baseType: !123, size: 64, offset: 384)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !124, file: !43, line: 139, baseType: !123, size: 64, offset: 448)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !124, file: !43, line: 139, baseType: !123, size: 64, offset: 512)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !115, file: !43, line: 122, baseType: !146, size: 128, offset: 384)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !43, line: 108, baseType: !147)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !43, line: 106, size: 128, elements: !148)
!148 = !{!149, !150}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !147, file: !43, line: 107, baseType: !114, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !147, file: !43, line: 107, baseType: !114, size: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !115, file: !43, line: 122, baseType: !146, size: 128, offset: 512)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !66, file: !43, line: 209, baseType: !153, size: 64, offset: 576)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !43, line: 123, baseType: !115)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !66, file: !43, line: 210, baseType: !157, size: 64, offset: 640)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !43, line: 178, baseType: !131)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !66, file: !43, line: 213, baseType: !69, size: 32, offset: 704)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !66, file: !43, line: 214, baseType: !69, size: 32, offset: 736)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !66, file: !43, line: 215, baseType: !69, size: 32, offset: 768)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !66, file: !43, line: 218, baseType: !80, size: 64, offset: 832)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !66, file: !43, line: 218, baseType: !80, size: 64, offset: 896)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !66, file: !43, line: 218, baseType: !80, size: 64, offset: 960)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !66, file: !43, line: 220, baseType: !69, size: 32, offset: 1024)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !66, file: !43, line: 221, baseType: !168, size: 64, offset: 1088)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !4, line: 190, size: 10496, elements: !170)
!170 = !{!171, !207, !208, !212, !215, !216, !218}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !169, file: !4, line: 191, baseType: !172, size: 5120)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 5120, elements: !205)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !4, line: 147, size: 320, elements: !174)
!174 = !{!175, !178, !180, !190, !191}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !173, file: !4, line: 148, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !77)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !173, file: !4, line: 149, baseType: !179, size: 32, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !4, line: 112, baseType: !3)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !173, file: !4, line: 150, baseType: !181, size: 32, offset: 96)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !4, line: 142, baseType: !182)
!182 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !4, line: 138, size: 32, elements: !183)
!183 = !{!184, !186, !188}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !182, file: !4, line: 139, baseType: !185, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !4, line: 122, baseType: !15)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !182, file: !4, line: 140, baseType: !187, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !4, line: 136, baseType: !21)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !182, file: !4, line: 141, baseType: !189, size: 32)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !4, line: 130, baseType: !27)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !173, file: !4, line: 152, baseType: !69, size: 32, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !173, file: !4, line: 162, baseType: !192, size: 128, offset: 192)
!192 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !173, file: !4, line: 155, size: 128, elements: !193)
!193 = !{!194, !195, !196, !197, !198, !200}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !192, file: !4, line: 156, baseType: !69, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !192, file: !4, line: 157, baseType: !56, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !192, file: !4, line: 158, baseType: !97, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !192, file: !4, line: 159, baseType: !109, size: 96)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !192, file: !4, line: 160, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !192, file: !4, line: 161, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !203, line: 48, baseType: !204)
!203 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !203, line: 48, flags: DIFlagFwdDecl)
!205 = !{!206}
!206 = !DISubrange(count: 16)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !169, file: !4, line: 192, baseType: !172, size: 5120, offset: 5120)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !169, file: !4, line: 193, baseType: !209, size: 64, offset: 10240)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{null, !64, !168}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !169, file: !4, line: 194, baseType: !213, size: 64, offset: 10304)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !4, line: 194, flags: DIFlagFwdDecl)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !169, file: !4, line: 195, baseType: !69, size: 32, offset: 10368)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !169, file: !4, line: 196, baseType: !217, size: 32, offset: 10400)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !4, line: 188, baseType: !35)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !169, file: !4, line: 197, baseType: !69, size: 32, offset: 10432)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !66, file: !43, line: 223, baseType: !220, size: 1600, offset: 1152)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !82, line: 73, baseType: !221)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !82, line: 64, size: 1600, elements: !222)
!222 = !{!223, !241, !245, !246, !247, !248, !249}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !221, file: !82, line: 65, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !82, line: 53, baseType: !226)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !82, line: 42, size: 832, elements: !227)
!227 = !{!228, !229, !230, !231, !232, !233, !234, !235, !236, !240}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !226, file: !82, line: 43, baseType: !69, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !226, file: !82, line: 44, baseType: !69, size: 32, offset: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !226, file: !82, line: 45, baseType: !69, size: 32, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !226, file: !82, line: 46, baseType: !69, size: 32, offset: 96)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !226, file: !82, line: 47, baseType: !69, size: 32, offset: 128)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !226, file: !82, line: 48, baseType: !69, size: 32, offset: 160)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !226, file: !82, line: 49, baseType: !69, size: 32, offset: 192)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !226, file: !82, line: 50, baseType: !69, size: 32, offset: 224)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !226, file: !82, line: 51, baseType: !237, size: 512, offset: 256)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 512, elements: !238)
!238 = !{!239}
!239 = !DISubrange(count: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !226, file: !82, line: 52, baseType: !97, size: 64, offset: 768)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !221, file: !82, line: 66, baseType: !242, size: 1312, offset: 64)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 1312, elements: !243)
!243 = !{!244}
!244 = !DISubrange(count: 41)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !221, file: !82, line: 69, baseType: !69, size: 32, offset: 1376)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !221, file: !82, line: 69, baseType: !69, size: 32, offset: 1408)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !221, file: !82, line: 70, baseType: !69, size: 32, offset: 1440)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !221, file: !82, line: 71, baseType: !80, size: 64, offset: 1472)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !221, file: !82, line: 72, baseType: !250, size: 64, offset: 1536)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !82, line: 59, baseType: !252)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !82, line: 57, size: 8192, elements: !253)
!253 = !{!254}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !252, file: !82, line: 58, baseType: !255, size: 8192)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 8192, elements: !256)
!256 = !{!257}
!257 = !DISubrange(count: 1024)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !66, file: !43, line: 223, baseType: !220, size: 1600, offset: 2752)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !66, file: !43, line: 223, baseType: !220, size: 1600, offset: 4352)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !66, file: !43, line: 223, baseType: !220, size: 1600, offset: 5952)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !66, file: !43, line: 233, baseType: !107, size: 16, offset: 7552)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !66, file: !43, line: 236, baseType: !69, size: 32, offset: 7584)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !66, file: !43, line: 238, baseType: !69, size: 32, offset: 7616)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !66, file: !43, line: 238, baseType: !69, size: 32, offset: 7648)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !66, file: !43, line: 239, baseType: !266, size: 128, offset: 7680)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !267, line: 71, baseType: !268)
!267 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !267, line: 69, size: 128, elements: !269)
!269 = !{!270, !271}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !268, file: !267, line: 70, baseType: !97, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !268, file: !267, line: 70, baseType: !97, size: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !66, file: !43, line: 241, baseType: !158, size: 64, offset: 7808)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !66, file: !43, line: 243, baseType: !266, size: 128, offset: 7872)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !66, file: !43, line: 245, baseType: !97, size: 64, offset: 8000)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOperator", file: !4, line: 198, baseType: !169)
!277 = !{}
!278 = !DILocalVariable(name: "bm", arg: 1, scope: !61, file: !1, line: 46, type: !64)
!279 = !DILocation(line: 46, column: 27, scope: !61)
!280 = !DILocalVariable(name: "op", arg: 2, scope: !61, file: !1, line: 46, type: !275)
!281 = !DILocation(line: 46, column: 43, scope: !61)
!282 = !DILocalVariable(name: "oiter", scope: !61, file: !1, line: 48, type: !283)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOIter", file: !4, line: 463, baseType: !284)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOIter", file: !4, line: 457, size: 448, elements: !285)
!285 = !{!286, !289, !290, !299, !300}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !284, file: !4, line: 458, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpSlot", file: !4, line: 163, baseType: !173)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !284, file: !4, line: 459, baseType: !69, size: 32, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "giter", scope: !284, file: !4, line: 460, baseType: !291, size: 192, offset: 128)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashIterator", file: !203, line: 54, baseType: !292)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GHashIterator", file: !203, line: 50, size: 192, elements: !293)
!293 = !{!294, !295, !298}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "gh", scope: !292, file: !203, line: 51, baseType: !201, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "curEntry", scope: !292, file: !203, line: 52, baseType: !296, size: 64, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry", file: !203, line: 52, flags: DIFlagFwdDecl)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "curBucket", scope: !292, file: !203, line: 53, baseType: !5, size: 32, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !284, file: !4, line: 461, baseType: !199, size: 64, offset: 320)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "restrictmask", scope: !284, file: !4, line: 462, baseType: !77, size: 8, offset: 384)
!301 = !DILocation(line: 48, column: 10, scope: !61)
!302 = !DILocalVariable(name: "f", scope: !61, file: !1, line: 49, type: !158)
!303 = !DILocation(line: 49, column: 10, scope: !61)
!304 = !DILocalVariable(name: "offset", scope: !61, file: !1, line: 51, type: !305)
!305 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!306 = !DILocation(line: 51, column: 14, scope: !61)
!307 = !DILocation(line: 51, column: 42, scope: !61)
!308 = !DILocation(line: 51, column: 46, scope: !61)
!309 = !DILocation(line: 51, column: 23, scope: !61)
!310 = !DILocalVariable(name: "use_relative_offset", scope: !61, file: !1, line: 52, type: !311)
!311 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !312)
!312 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!313 = !DILocation(line: 52, column: 13, scope: !61)
!314 = !DILocation(line: 52, column: 53, scope: !61)
!315 = !DILocation(line: 52, column: 57, scope: !61)
!316 = !DILocation(line: 52, column: 35, scope: !61)
!317 = !DILocalVariable(name: "center_mode", scope: !61, file: !1, line: 53, type: !318)
!318 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!319 = !DILocation(line: 53, column: 12, scope: !61)
!320 = !DILocation(line: 53, column: 43, scope: !61)
!321 = !DILocation(line: 53, column: 47, scope: !61)
!322 = !DILocation(line: 53, column: 26, scope: !61)
!323 = !DILocalVariable(name: "bm_face_calc_center_fn", scope: !61, file: !1, line: 54, type: !324)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DISubroutineType(types: !326)
!326 = !{null, !158, !327}
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!328 = !DILocation(line: 54, column: 9, scope: !61)
!329 = !DILocation(line: 56, column: 10, scope: !61)
!330 = !DILocation(line: 56, column: 2, scope: !61)
!331 = !DILocation(line: 58, column: 27, scope: !332)
!332 = distinct !DILexicalBlock(scope: !61, file: !1, line: 56, column: 23)
!333 = !DILocation(line: 59, column: 4, scope: !332)
!334 = !DILocation(line: 61, column: 27, scope: !332)
!335 = !DILocation(line: 62, column: 4, scope: !332)
!336 = !DILocation(line: 64, column: 27, scope: !332)
!337 = !DILocation(line: 65, column: 4, scope: !332)
!338 = !DILocation(line: 68, column: 4, scope: !332)
!339 = !DILocation(line: 71, column: 2, scope: !340)
!340 = distinct !DILexicalBlock(scope: !61, file: !1, line: 71, column: 2)
!341 = !DILocation(line: 71, column: 2, scope: !342)
!342 = distinct !DILexicalBlock(scope: !340, file: !1, line: 71, column: 2)
!343 = !DILocalVariable(name: "f_new", scope: !344, file: !1, line: 72, type: !158)
!344 = distinct !DILexicalBlock(scope: !342, file: !1, line: 71, column: 55)
!345 = !DILocation(line: 72, column: 11, scope: !344)
!346 = !DILocalVariable(name: "f_center", scope: !344, file: !1, line: 73, type: !109)
!347 = !DILocation(line: 73, column: 9, scope: !344)
!348 = !DILocalVariable(name: "v_center", scope: !344, file: !1, line: 74, type: !88)
!349 = !DILocation(line: 74, column: 11, scope: !344)
!350 = !DILocalVariable(name: "l_iter", scope: !344, file: !1, line: 75, type: !136)
!351 = !DILocation(line: 75, column: 11, scope: !344)
!352 = !DILocalVariable(name: "l_first", scope: !344, file: !1, line: 75, type: !136)
!353 = !DILocation(line: 75, column: 20, scope: !344)
!354 = !DILocalVariable(name: "l_center_example", scope: !344, file: !1, line: 78, type: !136)
!355 = !DILocation(line: 78, column: 11, scope: !344)
!356 = !DILocalVariable(name: "offset_fac", scope: !344, file: !1, line: 81, type: !56)
!357 = !DILocation(line: 81, column: 9, scope: !344)
!358 = !DILocalVariable(name: "i", scope: !344, file: !1, line: 83, type: !69)
!359 = !DILocation(line: 83, column: 7, scope: !344)
!360 = !DILocation(line: 85, column: 3, scope: !344)
!361 = !DILocation(line: 85, column: 26, scope: !344)
!362 = !DILocation(line: 85, column: 29, scope: !344)
