; ModuleID = 'blender_bin/source/blender/makesrna/intern/rna_linestyle_gen.c'
source_filename = "blender_bin/source/blender/makesrna/intern/rna_linestyle_gen.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.CollectionPropertyRNA = type { %struct.PropertyRNA, void (%struct.CollectionPropertyIterator*, %struct.PointerRNA*)*, void (%struct.CollectionPropertyIterator*)*, void (%struct.CollectionPropertyIterator*)*, void (%struct.PointerRNA*, %struct.CollectionPropertyIterator*)*, i32 (%struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32, %struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i8*, %struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32, %struct.PointerRNA*)*, %struct.StructRNA* }
%struct.PropertyRNA = type { %struct.PropertyRNA*, %struct.PropertyRNA*, i32, i8*, i32, i8*, i8*, i32, i8*, i32, i32, i32 (%struct.PointerRNA*, i32*)*, i32, [3 x i32], i32, void (%struct.Main*, %struct.Scene*, %struct.PointerRNA*)*, i32, i32 (%struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32)*, i32, i32, %struct.StructRNA*, i8* }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }

!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertyType", file: !6, line: 71, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15}
!9 = !DIEnumerator(name: "PROP_BOOLEAN", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "PROP_INT", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "PROP_FLOAT", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "PROP_STRING", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "PROP_ENUM", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "PROP_POINTER", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "PROP_COLLECTION", value: 6, isUnsigned: true)
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertySubType", file: !6, line: 107, baseType: !7, size: 32, elements: !17)
!17 = !{!18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46}
!18 = !DIEnumerator(name: "PROP_NONE", value: 0, isUnsigned: true)
!19 = !DIEnumerator(name: "PROP_FILEPATH", value: 1, isUnsigned: true)
!20 = !DIEnumerator(name: "PROP_DIRPATH", value: 2, isUnsigned: true)
!21 = !DIEnumerator(name: "PROP_FILENAME", value: 3, isUnsigned: true)
!22 = !DIEnumerator(name: "PROP_BYTESTRING", value: 4, isUnsigned: true)
!23 = !DIEnumerator(name: "PROP_PASSWORD", value: 6, isUnsigned: true)
!24 = !DIEnumerator(name: "PROP_PIXEL", value: 12, isUnsigned: true)
!25 = !DIEnumerator(name: "PROP_UNSIGNED", value: 13, isUnsigned: true)
!26 = !DIEnumerator(name: "PROP_PERCENTAGE", value: 14, isUnsigned: true)
!27 = !DIEnumerator(name: "PROP_FACTOR", value: 15, isUnsigned: true)
!28 = !DIEnumerator(name: "PROP_ANGLE", value: 327696, isUnsigned: true)
!29 = !DIEnumerator(name: "PROP_TIME", value: 393233, isUnsigned: true)
!30 = !DIEnumerator(name: "PROP_DISTANCE", value: 65554, isUnsigned: true)
!31 = !DIEnumerator(name: "PROP_DISTANCE_CAMERA", value: 589843, isUnsigned: true)
!32 = !DIEnumerator(name: "PROP_COLOR", value: 20, isUnsigned: true)
!33 = !DIEnumerator(name: "PROP_TRANSLATION", value: 65557, isUnsigned: true)
!34 = !DIEnumerator(name: "PROP_DIRECTION", value: 22, isUnsigned: true)
!35 = !DIEnumerator(name: "PROP_VELOCITY", value: 458775, isUnsigned: true)
!36 = !DIEnumerator(name: "PROP_ACCELERATION", value: 524312, isUnsigned: true)
!37 = !DIEnumerator(name: "PROP_MATRIX", value: 25, isUnsigned: true)
!38 = !DIEnumerator(name: "PROP_EULER", value: 327706, isUnsigned: true)
!39 = !DIEnumerator(name: "PROP_QUATERNION", value: 27, isUnsigned: true)
!40 = !DIEnumerator(name: "PROP_AXISANGLE", value: 28, isUnsigned: true)
!41 = !DIEnumerator(name: "PROP_XYZ", value: 29, isUnsigned: true)
!42 = !DIEnumerator(name: "PROP_XYZ_LENGTH", value: 65565, isUnsigned: true)
!43 = !DIEnumerator(name: "PROP_COLOR_GAMMA", value: 30, isUnsigned: true)
!44 = !DIEnumerator(name: "PROP_COORDS", value: 31, isUnsigned: true)
!45 = !DIEnumerator(name: "PROP_LAYER", value: 40, isUnsigned: true)
!46 = !DIEnumerator(name: "PROP_LAYER_MEMBER", value: 41, isUnsigned: true)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RawPropertyType", file: !6, line: 286, baseType: !48, size: 32, elements: !49)
!48 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!49 = !{!50, !51, !52, !53, !54, !55}
!50 = !DIEnumerator(name: "PROP_RAW_UNSET", value: -1)
!51 = !DIEnumerator(name: "PROP_RAW_INT", value: 0)
!52 = !DIEnumerator(name: "PROP_RAW_SHORT", value: 1)
!53 = !DIEnumerator(name: "PROP_RAW_CHAR", value: 2)
!54 = !DIEnumerator(name: "PROP_RAW_DOUBLE", value: 3)
!55 = !DIEnumerator(name: "PROP_RAW_FLOAT", value: 4)
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ReportType", file: !57, line: 67, baseType: !7, size: 32, elements: !58)
!57 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!58 = !{!59, !60, !61, !62, !63, !64, !65, !66, !67}
!59 = !DIEnumerator(name: "RPT_DEBUG", value: 1, isUnsigned: true)
!60 = !DIEnumerator(name: "RPT_INFO", value: 2, isUnsigned: true)
!61 = !DIEnumerator(name: "RPT_OPERATOR", value: 4, isUnsigned: true)
!62 = !DIEnumerator(name: "RPT_PROPERTY", value: 8, isUnsigned: true)
!63 = !DIEnumerator(name: "RPT_WARNING", value: 16, isUnsigned: true)
!64 = !DIEnumerator(name: "RPT_ERROR", value: 32, isUnsigned: true)
!65 = !DIEnumerator(name: "RPT_ERROR_INVALID_INPUT", value: 64, isUnsigned: true)
!66 = !DIEnumerator(name: "RPT_ERROR_INVALID_CONTEXT", value: 128, isUnsigned: true)
!67 = !DIEnumerator(name: "RPT_ERROR_OUT_OF_MEMORY", value: 256, isUnsigned: true)
!68 = !{!69, !1273, !48, !368, !1311, !1319, !227, !1328, !1336, !1344, !1354, !1365, !1373, !1383, !1395, !1408, !1418, !1427, !1434, !1441, !1450, !1459, !1470, !1481, !1488, !1495, !1502, !1509, !1520, !1529, !1542, !1830, !190, !146, !1832, !413, !1833, !1834, !1835, !1836, !1837, !103}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyRNA", file: !6, line: 333, baseType: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PropertyRNA", file: !72, line: 157, size: 1344, elements: !73)
!72 = !DIFile(filename: "blender/source/blender/makesrna/intern/rna_internal_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!73 = !{!74, !76, !77, !78, !82, !83, !84, !85, !86, !87, !89, !91, !467, !468, !472, !473, !1257, !1258, !1263, !1268, !1269, !1271, !1272}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !71, file: !72, line: 158, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !71, file: !72, line: 158, baseType: !75, size: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !71, file: !72, line: 161, baseType: !48, size: 32, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !71, file: !72, line: 164, baseType: !79, size: 64, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !81)
!81 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !71, file: !72, line: 166, baseType: !48, size: 32, offset: 256)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !71, file: !72, line: 169, baseType: !79, size: 64, offset: 320)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !71, file: !72, line: 171, baseType: !79, size: 64, offset: 384)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !71, file: !72, line: 173, baseType: !48, size: 32, offset: 448)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !71, file: !72, line: 175, baseType: !79, size: 64, offset: 512)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !71, file: !72, line: 178, baseType: !88, size: 32, offset: 576)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyType", file: !6, line: 79, baseType: !5)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !71, file: !72, line: 180, baseType: !90, size: 32, offset: 608)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertySubType", file: !6, line: 147, baseType: !16)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "getlength", scope: !71, file: !72, line: 182, baseType: !92, size: 64, offset: 640)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropArrayLengthGetFunc", file: !72, line: 73, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{!48, !96, !413}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !6, line: 55, size: 192, elements: !98)
!98 = !{!99, !104, !466}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !97, file: !6, line: 58, baseType: !100, size: 64)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !97, file: !6, line: 56, size: 64, elements: !101)
!101 = !{!102}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !100, file: !6, line: 57, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !97, file: !6, line: 60, baseType: !105, size: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !72, line: 339, size: 1600, elements: !107)
!107 = !{!108, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !141, !147, !448, !453, !459, !465}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !106, file: !72, line: 341, baseType: !109, size: 320)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "ContainerRNA", file: !72, line: 135, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ContainerRNA", file: !72, line: 130, size: 320, elements: !111)
!111 = !{!112, !113, !114, !117}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !110, file: !72, line: 131, baseType: !103, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !110, file: !72, line: 131, baseType: !103, size: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "prophash", scope: !110, file: !72, line: 133, baseType: !115, size: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !72, line: 46, flags: DIFlagFwdDecl)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !110, file: !72, line: 134, baseType: !118, size: 128, offset: 192)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !119, line: 71, baseType: !120)
!119 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !119, line: 69, size: 128, elements: !121)
!121 = !{!122, !123}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !120, file: !119, line: 70, baseType: !103, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !120, file: !119, line: 70, baseType: !103, size: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !106, file: !72, line: 344, baseType: !79, size: 64, offset: 320)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "py_type", scope: !106, file: !72, line: 348, baseType: !103, size: 64, offset: 384)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "blender_type", scope: !106, file: !72, line: 349, baseType: !103, size: 64, offset: 448)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !106, file: !72, line: 352, baseType: !48, size: 32, offset: 512)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !106, file: !72, line: 355, baseType: !79, size: 64, offset: 576)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !106, file: !72, line: 357, baseType: !79, size: 64, offset: 640)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !106, file: !72, line: 359, baseType: !79, size: 64, offset: 704)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !106, file: !72, line: 361, baseType: !48, size: 32, offset: 768)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nameproperty", scope: !106, file: !72, line: 364, baseType: !69, size: 64, offset: 832)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "iteratorproperty", scope: !106, file: !72, line: 367, baseType: !69, size: 64, offset: 896)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !106, file: !72, line: 370, baseType: !105, size: 64, offset: 960)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nested", scope: !106, file: !72, line: 376, baseType: !105, size: 64, offset: 1024)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "refine", scope: !106, file: !72, line: 379, baseType: !137, size: 64, offset: 1088)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRefineFunc", file: !72, line: 70, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!105, !96}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !106, file: !72, line: 382, baseType: !142, size: 64, offset: 1152)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructPathFunc", file: !72, line: 71, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!146, !96}
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !106, file: !72, line: 385, baseType: !148, size: 64, offset: 1216)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRegisterFunc", file: !6, line: 410, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!105, !152, !284, !103, !79, !409, !414, !444}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Main", file: !154, line: 53, size: 15232, elements: !155)
!154 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_main.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!155 = !{!156, !157, !158, !162, !164, !165, !166, !167, !173, !177, !178, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !275, !281}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !153, file: !154, line: 54, baseType: !152, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !153, file: !154, line: 54, baseType: !152, size: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !153, file: !154, line: 55, baseType: !159, size: 8192, offset: 128)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 8192, elements: !160)
!160 = !{!161}
!161 = !DISubrange(count: 1024)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "versionfile", scope: !153, file: !154, line: 56, baseType: !163, size: 16, offset: 8320)
!163 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "subversionfile", scope: !153, file: !154, line: 56, baseType: !163, size: 16, offset: 8336)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "minversionfile", scope: !153, file: !154, line: 57, baseType: !163, size: 16, offset: 8352)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "minsubversionfile", scope: !153, file: !154, line: 57, baseType: !163, size: 16, offset: 8368)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "build_commit_timestamp", scope: !153, file: !154, line: 58, baseType: !168, size: 64, offset: 8384)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !169, line: 27, baseType: !170)
!169 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !171, line: 45, baseType: !172)
!171 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!172 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "build_hash", scope: !153, file: !154, line: 59, baseType: !174, size: 128, offset: 8448)
!174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 128, elements: !175)
!175 = !{!176}
!176 = !DISubrange(count: 16)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", scope: !153, file: !154, line: 60, baseType: !163, size: 16, offset: 8576)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "curlib", scope: !153, file: !154, line: 62, baseType: !179, size: 64, offset: 8640)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !181, line: 136, size: 17600, elements: !182)
!181 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!182 = !{!183, !226, !228, !231, !232, !233, !234}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !180, file: !181, line: 137, baseType: !184, size: 960)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !181, line: 130, baseType: !185)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !181, line: 117, size: 960, elements: !186)
!186 = !{!187, !188, !189, !191, !192, !196, !197, !198, !199, !200}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !185, file: !181, line: 118, baseType: !103, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !185, file: !181, line: 118, baseType: !103, size: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !185, file: !181, line: 119, baseType: !190, size: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !185, file: !181, line: 120, baseType: !179, size: 64, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !185, file: !181, line: 121, baseType: !193, size: 528, offset: 256)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 528, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 66)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !185, file: !181, line: 126, baseType: !163, size: 16, offset: 784)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !185, file: !181, line: 127, baseType: !48, size: 32, offset: 800)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !185, file: !181, line: 128, baseType: !48, size: 32, offset: 832)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !185, file: !181, line: 128, baseType: !48, size: 32, offset: 864)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !185, file: !181, line: 129, baseType: !201, size: 64, offset: 896)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !181, line: 75, baseType: !203)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !181, line: 62, size: 1024, elements: !204)
!204 = !{!205, !207, !208, !209, !210, !211, !215, !216, !224, !225}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !203, file: !181, line: 63, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !203, file: !181, line: 63, baseType: !206, size: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !203, file: !181, line: 64, baseType: !81, size: 8, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !203, file: !181, line: 64, baseType: !81, size: 8, offset: 136)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !203, file: !181, line: 65, baseType: !163, size: 16, offset: 144)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !203, file: !181, line: 66, baseType: !212, size: 512, offset: 160)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 512, elements: !213)
!213 = !{!214}
!214 = !DISubrange(count: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !203, file: !181, line: 67, baseType: !48, size: 32, offset: 672)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !203, file: !181, line: 69, baseType: !217, size: 256, offset: 704)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !181, line: 60, baseType: !218)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !181, line: 48, size: 256, elements: !219)
!219 = !{!220, !221, !222, !223}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !218, file: !181, line: 49, baseType: !103, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !218, file: !181, line: 58, baseType: !118, size: 128, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !218, file: !181, line: 59, baseType: !48, size: 32, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !218, file: !181, line: 59, baseType: !48, size: 32, offset: 224)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !203, file: !181, line: 70, baseType: !48, size: 32, offset: 960)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !203, file: !181, line: 74, baseType: !48, size: 32, offset: 992)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !180, file: !181, line: 138, baseType: !227, size: 64, offset: 960)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !180, file: !181, line: 139, baseType: !229, size: 64, offset: 1024)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !181, line: 43, flags: DIFlagFwdDecl)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !180, file: !181, line: 140, baseType: !159, size: 8192, offset: 1088)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !180, file: !181, line: 141, baseType: !159, size: 8192, offset: 9280)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !180, file: !181, line: 148, baseType: !179, size: 64, offset: 17472)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !180, file: !181, line: 150, baseType: !235, size: 64, offset: 17536)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !181, line: 45, flags: DIFlagFwdDecl)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !153, file: !154, line: 63, baseType: !118, size: 128, offset: 8704)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "library", scope: !153, file: !154, line: 64, baseType: !118, size: 128, offset: 8832)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !153, file: !154, line: 65, baseType: !118, size: 128, offset: 8960)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "mesh", scope: !153, file: !154, line: 66, baseType: !118, size: 128, offset: 9088)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !153, file: !154, line: 67, baseType: !118, size: 128, offset: 9216)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "mball", scope: !153, file: !154, line: 68, baseType: !118, size: 128, offset: 9344)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !153, file: !154, line: 69, baseType: !118, size: 128, offset: 9472)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !153, file: !154, line: 70, baseType: !118, size: 128, offset: 9600)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !153, file: !154, line: 71, baseType: !118, size: 128, offset: 9728)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "latt", scope: !153, file: !154, line: 72, baseType: !118, size: 128, offset: 9856)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "lamp", scope: !153, file: !154, line: 73, baseType: !118, size: 128, offset: 9984)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !153, file: !154, line: 74, baseType: !118, size: 128, offset: 10112)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !153, file: !154, line: 75, baseType: !118, size: 128, offset: 10240)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !153, file: !154, line: 76, baseType: !118, size: 128, offset: 10368)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !153, file: !154, line: 77, baseType: !118, size: 128, offset: 10496)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !153, file: !154, line: 78, baseType: !118, size: 128, offset: 10624)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !153, file: !154, line: 79, baseType: !118, size: 128, offset: 10752)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "vfont", scope: !153, file: !154, line: 80, baseType: !118, size: 128, offset: 10880)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !153, file: !154, line: 81, baseType: !118, size: 128, offset: 11008)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "speaker", scope: !153, file: !154, line: 82, baseType: !118, size: 128, offset: 11136)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !153, file: !154, line: 83, baseType: !118, size: 128, offset: 11264)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !153, file: !154, line: 84, baseType: !118, size: 128, offset: 11392)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "armature", scope: !153, file: !154, line: 85, baseType: !118, size: 128, offset: 11520)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !153, file: !154, line: 86, baseType: !118, size: 128, offset: 11648)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !153, file: !154, line: 87, baseType: !118, size: 128, offset: 11776)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !153, file: !154, line: 88, baseType: !118, size: 128, offset: 11904)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !153, file: !154, line: 89, baseType: !118, size: 128, offset: 12032)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "palettes", scope: !153, file: !154, line: 90, baseType: !118, size: 128, offset: 12160)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "paintcurves", scope: !153, file: !154, line: 91, baseType: !118, size: 128, offset: 12288)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "wm", scope: !153, file: !154, line: 92, baseType: !118, size: 128, offset: 12416)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil", scope: !153, file: !154, line: 93, baseType: !118, size: 128, offset: 12544)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "movieclip", scope: !153, file: !154, line: 94, baseType: !118, size: 128, offset: 12672)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !153, file: !154, line: 95, baseType: !118, size: 128, offset: 12800)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "linestyle", scope: !153, file: !154, line: 96, baseType: !118, size: 128, offset: 12928)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "id_tag_update", scope: !153, file: !154, line: 98, baseType: !272, size: 2048, offset: 13056)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 2048, elements: !273)
!273 = !{!274}
!274 = !DISubrange(count: 256)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "eval_ctx", scope: !153, file: !154, line: 101, baseType: !276, size: 64, offset: 15104)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EvaluationContext", file: !278, line: 58, size: 32, elements: !279)
!278 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_depsgraph.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!279 = !{!280}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !277, file: !278, line: 59, baseType: !48, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !153, file: !154, line: 103, baseType: !282, size: 64, offset: 15168)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "MainLock", file: !154, line: 51, flags: DIFlagFwdDecl)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !57, line: 106, size: 320, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !285, file: !57, line: 107, baseType: !118, size: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !285, file: !57, line: 108, baseType: !48, size: 32, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !285, file: !57, line: 109, baseType: !48, size: 32, offset: 160)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !285, file: !57, line: 110, baseType: !48, size: 32, offset: 192)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !285, file: !57, line: 110, baseType: !48, size: 32, offset: 224)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !285, file: !57, line: 111, baseType: !293, size: 64, offset: 256)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !295, line: 490, size: 768, elements: !296)
!295 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!296 = !{!297, !298, !299, !400, !401, !402, !403, !404, !405, !406, !407, !408}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !294, file: !295, line: 491, baseType: !293, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !294, file: !295, line: 491, baseType: !293, size: 64, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !294, file: !295, line: 493, baseType: !300, size: 64, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !57, line: 169, size: 2048, elements: !302)
!302 = !{!303, !304, !305, !306, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !375, !378, !392, !393, !394, !395, !396, !397, !398, !399}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !301, file: !57, line: 170, baseType: !300, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !301, file: !57, line: 170, baseType: !300, size: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !301, file: !57, line: 172, baseType: !103, size: 64, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !301, file: !57, line: 174, baseType: !307, size: 64, offset: 192)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !309, line: 41, flags: DIFlagFwdDecl)
!309 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!310 = !DIDerivedType(tag: DW_TAG_member, name: "newscreen", scope: !301, file: !57, line: 175, baseType: !307, size: 64, offset: 256)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "screenname", scope: !301, file: !57, line: 176, baseType: !212, size: 512, offset: 320)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "posx", scope: !301, file: !57, line: 178, baseType: !163, size: 16, offset: 832)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "posy", scope: !301, file: !57, line: 178, baseType: !163, size: 16, offset: 848)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !301, file: !57, line: 178, baseType: !163, size: 16, offset: 864)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !301, file: !57, line: 178, baseType: !163, size: 16, offset: 880)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "windowstate", scope: !301, file: !57, line: 179, baseType: !163, size: 16, offset: 896)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !301, file: !57, line: 180, baseType: !163, size: 16, offset: 912)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !301, file: !57, line: 181, baseType: !163, size: 16, offset: 928)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !301, file: !57, line: 182, baseType: !163, size: 16, offset: 944)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "lastcursor", scope: !301, file: !57, line: 183, baseType: !163, size: 16, offset: 960)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "modalcursor", scope: !301, file: !57, line: 184, baseType: !163, size: 16, offset: 976)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "grabcursor", scope: !301, file: !57, line: 185, baseType: !163, size: 16, offset: 992)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "addmousemove", scope: !301, file: !57, line: 186, baseType: !163, size: 16, offset: 1008)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "winid", scope: !301, file: !57, line: 188, baseType: !48, size: 32, offset: 1024)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "lock_pie_event", scope: !301, file: !57, line: 190, baseType: !163, size: 16, offset: 1056)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "last_pie_event", scope: !301, file: !57, line: 191, baseType: !163, size: 16, offset: 1072)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "eventstate", scope: !301, file: !57, line: 194, baseType: !328, size: 64, offset: 1088)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmEvent", file: !295, line: 421, size: 960, elements: !330)
!330 = !{!331, !332, !333, !334, !335, !336, !337, !341, !345, !346, !347, !348, !349, !350, !351, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !371, !372, !373, !374}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !329, file: !295, line: 422, baseType: !328, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !329, file: !295, line: 422, baseType: !328, size: 64, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !329, file: !295, line: 424, baseType: !163, size: 16, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !329, file: !295, line: 425, baseType: !163, size: 16, offset: 144)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !329, file: !295, line: 426, baseType: !48, size: 32, offset: 160)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !329, file: !295, line: 426, baseType: !48, size: 32, offset: 192)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "mval", scope: !329, file: !295, line: 427, baseType: !338, size: 64, offset: 224)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 64, elements: !339)
!339 = !{!340}
!340 = !DISubrange(count: 2)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_buf", scope: !329, file: !295, line: 428, baseType: !342, size: 48, offset: 288)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 48, elements: !343)
!343 = !{!344}
!344 = !DISubrange(count: 6)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !329, file: !295, line: 431, baseType: !81, size: 8, offset: 336)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !329, file: !295, line: 432, baseType: !81, size: 8, offset: 344)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "prevtype", scope: !329, file: !295, line: 435, baseType: !163, size: 16, offset: 352)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "prevval", scope: !329, file: !295, line: 436, baseType: !163, size: 16, offset: 368)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "prevx", scope: !329, file: !295, line: 437, baseType: !48, size: 32, offset: 384)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "prevy", scope: !329, file: !295, line: 437, baseType: !48, size: 32, offset: 416)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicktime", scope: !329, file: !295, line: 438, baseType: !352, size: 64, offset: 448)
!352 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "prevclickx", scope: !329, file: !295, line: 439, baseType: !48, size: 32, offset: 512)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicky", scope: !329, file: !295, line: 439, baseType: !48, size: 32, offset: 544)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !329, file: !295, line: 442, baseType: !163, size: 16, offset: 576)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !329, file: !295, line: 442, baseType: !163, size: 16, offset: 592)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !329, file: !295, line: 442, baseType: !163, size: 16, offset: 608)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "oskey", scope: !329, file: !295, line: 442, baseType: !163, size: 16, offset: 624)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "keymodifier", scope: !329, file: !295, line: 443, baseType: !163, size: 16, offset: 640)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "check_click", scope: !329, file: !295, line: 446, baseType: !163, size: 16, offset: 656)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "keymap_idname", scope: !329, file: !295, line: 449, baseType: !79, size: 64, offset: 704)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "tablet_data", scope: !329, file: !295, line: 452, baseType: !363, size: 64, offset: 768)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTabletData", file: !295, line: 463, size: 128, elements: !365)
!365 = !{!366, !367, !369, !370}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "Active", scope: !364, file: !295, line: 464, baseType: !48, size: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "Pressure", scope: !364, file: !295, line: 465, baseType: !368, size: 32, offset: 32)
!368 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "Xtilt", scope: !364, file: !295, line: 466, baseType: !368, size: 32, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "Ytilt", scope: !364, file: !295, line: 467, baseType: !368, size: 32, offset: 96)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "custom", scope: !329, file: !295, line: 455, baseType: !163, size: 16, offset: 832)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "customdatafree", scope: !329, file: !295, line: 456, baseType: !163, size: 16, offset: 848)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !329, file: !295, line: 457, baseType: !48, size: 32, offset: 864)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !329, file: !295, line: 458, baseType: !103, size: 64, offset: 896)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "curswin", scope: !301, file: !57, line: 196, baseType: !376, size: 64, offset: 1152)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmSubWindow", file: !57, line: 55, flags: DIFlagFwdDecl)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "tweak", scope: !301, file: !57, line: 198, baseType: !379, size: 64, offset: 1216)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmGesture", file: !295, line: 398, size: 448, elements: !381)
!381 = !{!382, !383, !384, !385, !386, !387, !388, !389, !390, !391}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !380, file: !295, line: 399, baseType: !379, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !380, file: !295, line: 399, baseType: !379, size: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !380, file: !295, line: 400, baseType: !48, size: 32, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !380, file: !295, line: 401, baseType: !48, size: 32, offset: 160)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !380, file: !295, line: 402, baseType: !48, size: 32, offset: 192)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "swinid", scope: !380, file: !295, line: 403, baseType: !48, size: 32, offset: 224)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !380, file: !295, line: 404, baseType: !48, size: 32, offset: 256)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !380, file: !295, line: 405, baseType: !48, size: 32, offset: 288)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !380, file: !295, line: 407, baseType: !103, size: 64, offset: 320)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !380, file: !295, line: 414, baseType: !103, size: 64, offset: 384)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "drawmethod", scope: !301, file: !57, line: 200, baseType: !48, size: 32, offset: 1280)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "drawfail", scope: !301, file: !57, line: 200, baseType: !48, size: 32, offset: 1312)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "drawdata", scope: !301, file: !57, line: 201, baseType: !103, size: 64, offset: 1344)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !301, file: !57, line: 203, baseType: !118, size: 128, offset: 1408)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !301, file: !57, line: 204, baseType: !118, size: 128, offset: 1536)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "modalhandlers", scope: !301, file: !57, line: 205, baseType: !118, size: 128, offset: 1664)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "subwindows", scope: !301, file: !57, line: 207, baseType: !118, size: 128, offset: 1792)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "gesture", scope: !301, file: !57, line: 208, baseType: !118, size: 128, offset: 1920)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "timestep", scope: !294, file: !295, line: 495, baseType: !352, size: 64, offset: 192)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !294, file: !295, line: 496, baseType: !48, size: 32, offset: 256)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !294, file: !295, line: 497, baseType: !103, size: 64, offset: 320)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !294, file: !295, line: 499, baseType: !352, size: 64, offset: 384)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !294, file: !295, line: 500, baseType: !352, size: 64, offset: 448)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "ltime", scope: !294, file: !295, line: 502, baseType: !352, size: 64, offset: 512)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "ntime", scope: !294, file: !295, line: 503, baseType: !352, size: 64, offset: 576)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !294, file: !295, line: 504, baseType: !352, size: 64, offset: 640)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "sleep", scope: !294, file: !295, line: 505, baseType: !48, size: 32, offset: 704)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructValidateFunc", file: !6, line: 407, baseType: !410)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DISubroutineType(types: !412)
!412 = !{!48, !96, !103, !413}
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !6, line: 408, baseType: !415)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{!48, !418, !96, !420, !434}
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !6, line: 44, flags: DIFlagFwdDecl)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !72, line: 137, size: 640, elements: !422)
!422 = !{!423, !424, !425, !426, !427, !443}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !421, file: !72, line: 139, baseType: !109, size: 320)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !421, file: !72, line: 142, baseType: !79, size: 64, offset: 320)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !421, file: !72, line: 144, baseType: !48, size: 32, offset: 384)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !421, file: !72, line: 147, baseType: !79, size: 64, offset: 448)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !421, file: !72, line: 150, baseType: !428, size: 64, offset: 512)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "CallFunc", file: !6, line: 388, baseType: !429)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{null, !418, !284, !432, !434}
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "PointerRNA", file: !6, line: 62, baseType: !97)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !6, line: 348, baseType: !436)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !6, line: 337, size: 256, elements: !437)
!437 = !{!438, !439, !440, !441, !442}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !436, file: !6, line: 339, baseType: !103, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !436, file: !6, line: 342, baseType: !420, size: 64, offset: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !436, file: !6, line: 345, baseType: !48, size: 32, offset: 128)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !436, file: !6, line: 347, baseType: !48, size: 32, offset: 160)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !436, file: !6, line: 347, baseType: !48, size: 32, offset: 192)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "c_ret", scope: !421, file: !72, line: 154, baseType: !69, size: 64, offset: 576)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !6, line: 409, baseType: !445)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DISubroutineType(types: !447)
!447 = !{null, !103}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "unreg", scope: !106, file: !72, line: 386, baseType: !449, size: 64, offset: 1280)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructUnregisterFunc", file: !6, line: 414, baseType: !450)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DISubroutineType(types: !452)
!452 = !{null, !152, !105}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !106, file: !72, line: 387, baseType: !454, size: 64, offset: 1344)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructInstanceFunc", file: !6, line: 415, baseType: !455)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DISubroutineType(types: !457)
!457 = !{!458, !432}
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "idproperties", scope: !106, file: !72, line: 390, baseType: !460, size: 64, offset: 1408)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertiesFunc", file: !72, line: 69, baseType: !461)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{!206, !96, !464}
!464 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "functions", scope: !106, file: !72, line: 393, baseType: !118, size: 128, offset: 1472)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !97, file: !6, line: 61, baseType: !103, size: 64, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "arraydimension", scope: !71, file: !72, line: 184, baseType: !7, size: 32, offset: 704)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !71, file: !72, line: 186, baseType: !469, size: 96, offset: 736)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 96, elements: !470)
!470 = !{!471}
!471 = !DISubrange(count: 3)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "totarraylength", scope: !71, file: !72, line: 187, baseType: !7, size: 32, offset: 832)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !71, file: !72, line: 190, baseType: !474, size: 64, offset: 896)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "UpdateFunc", file: !72, line: 64, baseType: !475)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{null, !152, !478, !96}
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !480, line: 1216, size: 39680, elements: !481)
!480 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!481 = !{!482, !483, !486, !489, !492, !493, !494, !506, !507, !509, !510, !511, !512, !513, !514, !515, !516, !517, !521, !524, !527, !828, !831, !1128, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1150, !1151, !1152, !1153, !1154, !1162, !1229, !1236, !1239, !1246, !1249, !1250, !1251, !1252, !1253, !1254}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !479, file: !480, line: 1217, baseType: !184, size: 960)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !479, file: !480, line: 1218, baseType: !484, size: 64, offset: 960)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !480, line: 58, flags: DIFlagFwdDecl)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !479, file: !480, line: 1220, baseType: !487, size: 64, offset: 1024)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !480, line: 50, flags: DIFlagFwdDecl)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !479, file: !480, line: 1221, baseType: !490, size: 64, offset: 1088)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !480, line: 52, flags: DIFlagFwdDecl)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !479, file: !480, line: 1223, baseType: !478, size: 64, offset: 1152)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !479, file: !480, line: 1225, baseType: !118, size: 128, offset: 1216)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !479, file: !480, line: 1226, baseType: !495, size: 64, offset: 1344)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !480, line: 69, size: 320, elements: !497)
!497 = !{!498, !499, !500, !501, !502, !503, !504, !505}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !496, file: !480, line: 70, baseType: !495, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !496, file: !480, line: 70, baseType: !495, size: 64, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !496, file: !480, line: 71, baseType: !7, size: 32, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !496, file: !480, line: 71, baseType: !7, size: 32, offset: 160)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !496, file: !480, line: 72, baseType: !48, size: 32, offset: 192)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !496, file: !480, line: 73, baseType: !163, size: 16, offset: 224)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !496, file: !480, line: 73, baseType: !163, size: 16, offset: 240)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !496, file: !480, line: 74, baseType: !487, size: 64, offset: 256)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !479, file: !480, line: 1227, baseType: !487, size: 64, offset: 1408)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !479, file: !480, line: 1229, baseType: !508, size: 96, offset: 1472)
!508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 96, elements: !470)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !479, file: !480, line: 1230, baseType: !508, size: 96, offset: 1568)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !479, file: !480, line: 1231, baseType: !508, size: 96, offset: 1664)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !479, file: !480, line: 1231, baseType: !508, size: 96, offset: 1760)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !479, file: !480, line: 1233, baseType: !7, size: 32, offset: 1856)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !479, file: !480, line: 1234, baseType: !48, size: 32, offset: 1888)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !479, file: !480, line: 1235, baseType: !7, size: 32, offset: 1920)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !479, file: !480, line: 1237, baseType: !163, size: 16, offset: 1952)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !479, file: !480, line: 1239, baseType: !81, size: 8, offset: 1968)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !479, file: !480, line: 1240, baseType: !518, size: 8, offset: 1976)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 8, elements: !519)
!519 = !{!520}
!520 = !DISubrange(count: 1)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !479, file: !480, line: 1242, baseType: !522, size: 64, offset: 1984)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !480, line: 57, flags: DIFlagFwdDecl)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !479, file: !480, line: 1244, baseType: !525, size: 64, offset: 2048)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !480, line: 59, flags: DIFlagFwdDecl)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !479, file: !480, line: 1246, baseType: !528, size: 64, offset: 2112)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !480, line: 1067, size: 5184, elements: !530)
!530 = !{!531, !563, !564, !579, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !601, !699, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !748, !749, !750, !751, !752, !753, !754, !755, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !811}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !529, file: !480, line: 1068, baseType: !532, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !480, line: 934, baseType: !534)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !480, line: 925, size: 576, elements: !535)
!535 = !{!536, !554, !555, !556, !557, !559, !562}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !534, file: !480, line: 926, baseType: !537, size: 320)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !480, line: 830, baseType: !538)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !480, line: 813, size: 320, elements: !539)
!539 = !{!540, !543, !546, !547, !551, !552, !553}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !538, file: !480, line: 814, baseType: !541, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !480, line: 51, flags: DIFlagFwdDecl)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !538, file: !480, line: 815, baseType: !544, size: 64, offset: 64)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !480, line: 815, flags: DIFlagFwdDecl)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !538, file: !480, line: 818, baseType: !103, size: 64, offset: 128)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !538, file: !480, line: 819, baseType: !548, size: 32, offset: 192)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !464, size: 32, elements: !549)
!549 = !{!550}
!550 = !DISubrange(count: 4)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !538, file: !480, line: 822, baseType: !48, size: 32, offset: 224)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !538, file: !480, line: 826, baseType: !48, size: 32, offset: 256)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !538, file: !480, line: 829, baseType: !48, size: 32, offset: 288)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !534, file: !480, line: 928, baseType: !163, size: 16, offset: 320)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !534, file: !480, line: 928, baseType: !163, size: 16, offset: 336)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !534, file: !480, line: 929, baseType: !48, size: 32, offset: 352)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !534, file: !480, line: 930, baseType: !558, size: 64, offset: 384)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !534, file: !480, line: 931, baseType: !560, size: 64, offset: 448)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !480, line: 931, flags: DIFlagFwdDecl)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !534, file: !480, line: 933, baseType: !103, size: 64, offset: 512)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !529, file: !480, line: 1069, baseType: !532, size: 64, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !529, file: !480, line: 1070, baseType: !565, size: 64, offset: 128)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !480, line: 916, baseType: !567)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !480, line: 891, size: 704, elements: !568)
!568 = !{!569, !570, !571, !573, !574, !575, !576, !577, !578}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !567, file: !480, line: 892, baseType: !537, size: 320)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !567, file: !480, line: 896, baseType: !48, size: 32, offset: 320)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !567, file: !480, line: 900, baseType: !572, size: 96, offset: 352)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 96, elements: !470)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !567, file: !480, line: 903, baseType: !368, size: 32, offset: 448)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !567, file: !480, line: 906, baseType: !48, size: 32, offset: 480)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !567, file: !480, line: 909, baseType: !368, size: 32, offset: 512)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !567, file: !480, line: 912, baseType: !368, size: 32, offset: 544)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !567, file: !480, line: 914, baseType: !487, size: 64, offset: 576)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !567, file: !480, line: 915, baseType: !103, size: 64, offset: 640)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !529, file: !480, line: 1071, baseType: !580, size: 64, offset: 192)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !480, line: 920, baseType: !582)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !480, line: 918, size: 320, elements: !583)
!583 = !{!584}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !582, file: !480, line: 919, baseType: !537, size: 320)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !529, file: !480, line: 1075, baseType: !368, size: 32, offset: 256)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !529, file: !480, line: 1077, baseType: !368, size: 32, offset: 288)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !529, file: !480, line: 1078, baseType: !368, size: 32, offset: 320)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !529, file: !480, line: 1079, baseType: !163, size: 16, offset: 352)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !529, file: !480, line: 1082, baseType: !163, size: 16, offset: 368)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !529, file: !480, line: 1085, baseType: !81, size: 8, offset: 384)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !529, file: !480, line: 1086, baseType: !81, size: 8, offset: 392)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !529, file: !480, line: 1087, baseType: !81, size: 8, offset: 400)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !529, file: !480, line: 1088, baseType: !81, size: 8, offset: 408)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !529, file: !480, line: 1090, baseType: !368, size: 32, offset: 416)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !529, file: !480, line: 1093, baseType: !163, size: 16, offset: 448)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !529, file: !480, line: 1096, baseType: !81, size: 8, offset: 464)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !529, file: !480, line: 1098, baseType: !598, size: 40, offset: 472)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 40, elements: !599)
!599 = !{!600}
!600 = !DISubrange(count: 5)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !529, file: !480, line: 1101, baseType: !602, size: 832, offset: 512)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !480, line: 836, size: 832, elements: !603)
!603 = !{!604, !605, !606, !607, !608, !609, !611, !612, !613, !695, !696, !697, !698}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !602, file: !480, line: 837, baseType: !537, size: 320)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !602, file: !480, line: 839, baseType: !163, size: 16, offset: 320)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !602, file: !480, line: 839, baseType: !163, size: 16, offset: 336)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !602, file: !480, line: 842, baseType: !163, size: 16, offset: 352)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !602, file: !480, line: 842, baseType: !163, size: 16, offset: 368)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !602, file: !480, line: 843, baseType: !610, size: 32, offset: 384)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 32, elements: !339)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !602, file: !480, line: 845, baseType: !48, size: 32, offset: 416)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !602, file: !480, line: 847, baseType: !103, size: 64, offset: 448)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !602, file: !480, line: 848, baseType: !614, size: 64, offset: 512)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !616, line: 77, size: 15424, elements: !617)
!616 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!617 = !{!618, !619, !620, !623, !626, !629, !632, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !676, !677, !678, !684, !685, !689}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !615, file: !616, line: 78, baseType: !184, size: 960)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !615, file: !616, line: 80, baseType: !159, size: 8192, offset: 960)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !615, file: !616, line: 82, baseType: !621, size: 64, offset: 9152)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !616, line: 43, flags: DIFlagFwdDecl)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !615, file: !616, line: 83, baseType: !624, size: 64, offset: 9216)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !181, line: 46, flags: DIFlagFwdDecl)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !615, file: !616, line: 86, baseType: !627, size: 64, offset: 9280)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !616, line: 41, flags: DIFlagFwdDecl)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !615, file: !616, line: 87, baseType: !630, size: 64, offset: 9344)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !616, line: 44, flags: DIFlagFwdDecl)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !615, file: !616, line: 89, baseType: !633, size: 512, offset: 9408)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !630, size: 512, elements: !634)
!634 = !{!635}
!635 = !DISubrange(count: 8)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !615, file: !616, line: 90, baseType: !163, size: 16, offset: 9920)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !615, file: !616, line: 90, baseType: !163, size: 16, offset: 9936)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !615, file: !616, line: 92, baseType: !163, size: 16, offset: 9952)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !615, file: !616, line: 92, baseType: !163, size: 16, offset: 9968)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !615, file: !616, line: 93, baseType: !163, size: 16, offset: 9984)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !615, file: !616, line: 93, baseType: !163, size: 16, offset: 10000)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !615, file: !616, line: 94, baseType: !48, size: 32, offset: 10016)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !615, file: !616, line: 97, baseType: !163, size: 16, offset: 10048)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !615, file: !616, line: 97, baseType: !163, size: 16, offset: 10064)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !615, file: !616, line: 98, baseType: !163, size: 16, offset: 10080)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !615, file: !616, line: 98, baseType: !163, size: 16, offset: 10096)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !615, file: !616, line: 99, baseType: !163, size: 16, offset: 10112)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !615, file: !616, line: 99, baseType: !163, size: 16, offset: 10128)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !615, file: !616, line: 100, baseType: !7, size: 32, offset: 10144)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !615, file: !616, line: 101, baseType: !558, size: 64, offset: 10176)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !615, file: !616, line: 103, baseType: !235, size: 64, offset: 10240)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !615, file: !616, line: 104, baseType: !653, size: 64, offset: 10304)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !181, line: 159, size: 448, elements: !655)
!655 = !{!656, !658, !659, !660, !661, !663}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !654, file: !181, line: 161, baseType: !657, size: 64)
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !339)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !654, file: !181, line: 162, baseType: !657, size: 64, offset: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !654, file: !181, line: 163, baseType: !610, size: 32, offset: 128)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !654, file: !181, line: 164, baseType: !610, size: 32, offset: 160)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !654, file: !181, line: 165, baseType: !662, size: 128, offset: 192)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !558, size: 128, elements: !339)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !654, file: !181, line: 166, baseType: !664, size: 128, offset: 320)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !624, size: 128, elements: !339)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !615, file: !616, line: 107, baseType: !368, size: 32, offset: 10368)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !615, file: !616, line: 108, baseType: !48, size: 32, offset: 10400)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !615, file: !616, line: 109, baseType: !163, size: 16, offset: 10432)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !615, file: !616, line: 110, baseType: !163, size: 16, offset: 10448)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !615, file: !616, line: 113, baseType: !48, size: 32, offset: 10464)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !615, file: !616, line: 113, baseType: !48, size: 32, offset: 10496)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !615, file: !616, line: 114, baseType: !81, size: 8, offset: 10528)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !615, file: !616, line: 114, baseType: !81, size: 8, offset: 10536)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !615, file: !616, line: 115, baseType: !163, size: 16, offset: 10544)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !615, file: !616, line: 116, baseType: !675, size: 128, offset: 10560)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 128, elements: !549)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !615, file: !616, line: 119, baseType: !368, size: 32, offset: 10688)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !615, file: !616, line: 119, baseType: !368, size: 32, offset: 10720)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !615, file: !616, line: 122, baseType: !679, size: 512, offset: 10752)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !680, line: 182, baseType: !681)
!680 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !680, line: 180, size: 512, elements: !682)
!682 = !{!683}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !681, file: !680, line: 181, baseType: !212, size: 512)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !615, file: !616, line: 123, baseType: !81, size: 8, offset: 11264)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !615, file: !616, line: 125, baseType: !686, size: 56, offset: 11272)
!686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 56, elements: !687)
!687 = !{!688}
!688 = !DISubrange(count: 7)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !615, file: !616, line: 126, baseType: !690, size: 4096, offset: 11328)
!690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !691, size: 4096, elements: !634)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !616, line: 69, baseType: !692)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !616, line: 67, size: 512, elements: !693)
!693 = !{!694}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !692, file: !616, line: 68, baseType: !212, size: 512)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !602, file: !480, line: 849, baseType: !614, size: 64, offset: 576)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "canvas", scope: !602, file: !480, line: 850, baseType: !614, size: 64, offset: 640)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "stencil_col", scope: !602, file: !480, line: 851, baseType: !508, size: 96, offset: 704)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !602, file: !480, line: 852, baseType: !368, size: 32, offset: 800)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !529, file: !480, line: 1104, baseType: !700, size: 1344, offset: 1344)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleEditSettings", file: !480, line: 867, size: 1344, elements: !701)
!701 = !{!702, !703, !704, !705, !706, !717, !718, !719, !720, !721, !722, !723, !724, !725}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !700, file: !480, line: 868, baseType: !163, size: 16)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "totrekey", scope: !700, file: !480, line: 869, baseType: !163, size: 16, offset: 16)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "totaddkey", scope: !700, file: !480, line: 870, baseType: !163, size: 16, offset: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "brushtype", scope: !700, file: !480, line: 871, baseType: !163, size: 16, offset: 48)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !700, file: !480, line: 873, baseType: !707, size: 896, offset: 64)
!707 = !DICompositeType(tag: DW_TAG_array_type, baseType: !708, size: 896, elements: !687)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParticleBrushData", file: !480, line: 864, baseType: !709)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParticleBrushData", file: !480, line: 859, size: 128, elements: !710)
!710 = !{!711, !712, !713, !714, !715, !716}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !709, file: !480, line: 860, baseType: !163, size: 16)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !709, file: !480, line: 861, baseType: !163, size: 16, offset: 16)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !709, file: !480, line: 861, baseType: !163, size: 16, offset: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !709, file: !480, line: 861, baseType: !163, size: 16, offset: 48)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !709, file: !480, line: 862, baseType: !48, size: 32, offset: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !709, file: !480, line: 863, baseType: !368, size: 32, offset: 96)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !700, file: !480, line: 874, baseType: !103, size: 64, offset: 960)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "emitterdist", scope: !700, file: !480, line: 876, baseType: !368, size: 32, offset: 1024)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !700, file: !480, line: 876, baseType: !368, size: 32, offset: 1056)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !700, file: !480, line: 878, baseType: !48, size: 32, offset: 1088)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "edittype", scope: !700, file: !480, line: 879, baseType: !48, size: 32, offset: 1120)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "draw_step", scope: !700, file: !480, line: 881, baseType: !48, size: 32, offset: 1152)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "fade_frames", scope: !700, file: !480, line: 881, baseType: !48, size: 32, offset: 1184)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !700, file: !480, line: 883, baseType: !478, size: 64, offset: 1216)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !700, file: !480, line: 884, baseType: !487, size: 64, offset: 1280)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_size", scope: !529, file: !480, line: 1107, baseType: !368, size: 32, offset: 2688)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "select_thresh", scope: !529, file: !480, line: 1110, baseType: !368, size: 32, offset: 2720)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_mode", scope: !529, file: !480, line: 1113, baseType: !163, size: 16, offset: 2752)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "autokey_flag", scope: !529, file: !480, line: 1113, baseType: !163, size: 16, offset: 2768)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "multires_subdiv_type", scope: !529, file: !480, line: 1116, baseType: !81, size: 8, offset: 2784)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !529, file: !480, line: 1117, baseType: !518, size: 8, offset: 2792)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_resolution", scope: !529, file: !480, line: 1120, baseType: !163, size: 16, offset: 2800)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_internal", scope: !529, file: !480, line: 1121, baseType: !368, size: 32, offset: 2816)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_threshold_external", scope: !529, file: !480, line: 1122, baseType: !368, size: 32, offset: 2848)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_ratio", scope: !529, file: !480, line: 1123, baseType: !368, size: 32, offset: 2880)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_length_limit", scope: !529, file: !480, line: 1124, baseType: !368, size: 32, offset: 2912)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_angle_limit", scope: !529, file: !480, line: 1125, baseType: !368, size: 32, offset: 2944)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_correlation_limit", scope: !529, file: !480, line: 1126, baseType: !368, size: 32, offset: 2976)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_symmetry_limit", scope: !529, file: !480, line: 1127, baseType: !368, size: 32, offset: 3008)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_angle_weight", scope: !529, file: !480, line: 1128, baseType: !368, size: 32, offset: 3040)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_length_weight", scope: !529, file: !480, line: 1129, baseType: !368, size: 32, offset: 3072)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_distance_weight", scope: !529, file: !480, line: 1130, baseType: !368, size: 32, offset: 3104)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_options", scope: !529, file: !480, line: 1131, baseType: !163, size: 16, offset: 3136)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro", scope: !529, file: !480, line: 1132, baseType: !81, size: 8, offset: 3152)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_postpro_passes", scope: !529, file: !480, line: 1133, baseType: !81, size: 8, offset: 3160)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivisions", scope: !529, file: !480, line: 1134, baseType: !747, size: 24, offset: 3168)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 24, elements: !470)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_multi_level", scope: !529, file: !480, line: 1135, baseType: !81, size: 8, offset: 3192)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_template", scope: !529, file: !480, line: 1138, baseType: !487, size: 64, offset: 3200)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching", scope: !529, file: !480, line: 1139, baseType: !81, size: 8, offset: 3264)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "bone_sketching_convert", scope: !529, file: !480, line: 1140, baseType: !81, size: 8, offset: 3272)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_subdivision_number", scope: !529, file: !480, line: 1141, baseType: !81, size: 8, offset: 3280)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_options", scope: !529, file: !480, line: 1142, baseType: !81, size: 8, offset: 3288)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_retarget_roll", scope: !529, file: !480, line: 1143, baseType: !81, size: 8, offset: 3296)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_side_string", scope: !529, file: !480, line: 1144, baseType: !756, size: 64, offset: 3304)
!756 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 64, elements: !634)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "skgen_num_string", scope: !529, file: !480, line: 1145, baseType: !756, size: 64, offset: 3368)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode", scope: !529, file: !480, line: 1148, baseType: !81, size: 8, offset: 3432)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode_live_unwrap", scope: !529, file: !480, line: 1149, baseType: !81, size: 8, offset: 3440)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "snap_mode", scope: !529, file: !480, line: 1152, baseType: !81, size: 8, offset: 3448)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "snap_node_mode", scope: !529, file: !480, line: 1152, baseType: !81, size: 8, offset: 3456)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "snap_uv_mode", scope: !529, file: !480, line: 1153, baseType: !81, size: 8, offset: 3464)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "snap_flag", scope: !529, file: !480, line: 1154, baseType: !163, size: 16, offset: 3472)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "snap_target", scope: !529, file: !480, line: 1154, baseType: !163, size: 16, offset: 3488)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "proportional", scope: !529, file: !480, line: 1155, baseType: !163, size: 16, offset: 3504)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "prop_mode", scope: !529, file: !480, line: 1155, baseType: !163, size: 16, offset: 3520)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_objects", scope: !529, file: !480, line: 1156, baseType: !81, size: 8, offset: 3536)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "proportional_mask", scope: !529, file: !480, line: 1157, baseType: !81, size: 8, offset: 3544)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "auto_normalize", scope: !529, file: !480, line: 1159, baseType: !81, size: 8, offset: 3552)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "multipaint", scope: !529, file: !480, line: 1160, baseType: !81, size: 8, offset: 3560)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "weightuser", scope: !529, file: !480, line: 1161, baseType: !81, size: 8, offset: 3568)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "vgroupsubset", scope: !529, file: !480, line: 1162, baseType: !81, size: 8, offset: 3576)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "use_uv_sculpt", scope: !529, file: !480, line: 1165, baseType: !48, size: 32, offset: 3584)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "uv_sculpt_settings", scope: !529, file: !480, line: 1166, baseType: !48, size: 32, offset: 3616)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "uv_sculpt_tool", scope: !529, file: !480, line: 1167, baseType: !48, size: 32, offset: 3648)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "uv_relax_method", scope: !529, file: !480, line: 1168, baseType: !48, size: 32, offset: 3680)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_settings", scope: !529, file: !480, line: 1171, baseType: !163, size: 16, offset: 3712)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "pad5", scope: !529, file: !480, line: 1171, baseType: !163, size: 16, offset: 3728)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_size", scope: !529, file: !480, line: 1172, baseType: !48, size: 32, offset: 3744)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_unprojected_radius", scope: !529, file: !480, line: 1173, baseType: !368, size: 32, offset: 3776)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt_paint_unified_alpha", scope: !529, file: !480, line: 1174, baseType: !368, size: 32, offset: 3808)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "unified_paint_settings", scope: !529, file: !480, line: 1177, baseType: !783, size: 1024, offset: 3840)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UnifiedPaintSettings", file: !480, line: 963, size: 1024, elements: !784)
!784 = !{!785, !786, !787, !788, !789, !790, !791, !792, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !809, !810}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !783, file: !480, line: 965, baseType: !48, size: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "unprojected_radius", scope: !783, file: !480, line: 968, baseType: !368, size: 32, offset: 32)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !783, file: !480, line: 971, baseType: !368, size: 32, offset: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !783, file: !480, line: 974, baseType: !368, size: 32, offset: 96)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "rgb", scope: !783, file: !480, line: 977, baseType: !508, size: 96, offset: 128)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "secondary_rgb", scope: !783, file: !480, line: 979, baseType: !508, size: 96, offset: 224)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !783, file: !480, line: 982, baseType: !48, size: 32, offset: 320)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "last_rake", scope: !783, file: !480, line: 987, baseType: !793, size: 64, offset: 352)
!793 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 64, elements: !339)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "brush_rotation", scope: !783, file: !480, line: 989, baseType: !368, size: 32, offset: 416)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "draw_anchored", scope: !783, file: !480, line: 994, baseType: !48, size: 32, offset: 448)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "anchored_size", scope: !783, file: !480, line: 995, baseType: !48, size: 32, offset: 480)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "draw_inverted", scope: !783, file: !480, line: 997, baseType: !81, size: 8, offset: 512)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !783, file: !480, line: 998, baseType: !686, size: 56, offset: 520)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "overlap_factor", scope: !783, file: !480, line: 1000, baseType: !368, size: 32, offset: 576)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "anchored_initial_mouse", scope: !783, file: !480, line: 1003, baseType: !793, size: 64, offset: 608)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "stroke_active", scope: !783, file: !480, line: 1006, baseType: !48, size: 32, offset: 672)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "size_pressure_value", scope: !783, file: !480, line: 1009, baseType: !368, size: 32, offset: 704)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "tex_mouse", scope: !783, file: !480, line: 1012, baseType: !793, size: 64, offset: 736)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "mask_tex_mouse", scope: !783, file: !480, line: 1015, baseType: !793, size: 64, offset: 800)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "do_linear_conversion", scope: !783, file: !480, line: 1018, baseType: !48, size: 32, offset: 864)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !783, file: !480, line: 1019, baseType: !807, size: 64, offset: 896)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !480, line: 63, flags: DIFlagFwdDecl)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_radius", scope: !783, file: !480, line: 1023, baseType: !368, size: 32, offset: 960)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "pad4", scope: !783, file: !480, line: 1024, baseType: !48, size: 32, offset: 992)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "statvis", scope: !529, file: !480, line: 1179, baseType: !812, size: 320, offset: 4864)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MeshStatVis", file: !480, line: 1043, size: 320, elements: !813)
!813 = !{!814, !815, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !812, file: !480, line: 1044, baseType: !81, size: 8)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "_pad1", scope: !812, file: !480, line: 1045, baseType: !816, size: 16, offset: 8)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 16, elements: !339)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_axis", scope: !812, file: !480, line: 1048, baseType: !81, size: 8, offset: 24)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_min", scope: !812, file: !480, line: 1049, baseType: !368, size: 32, offset: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "overhang_max", scope: !812, file: !480, line: 1049, baseType: !368, size: 32, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_min", scope: !812, file: !480, line: 1052, baseType: !368, size: 32, offset: 96)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_max", scope: !812, file: !480, line: 1052, baseType: !368, size: 32, offset: 128)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "thickness_samples", scope: !812, file: !480, line: 1053, baseType: !81, size: 8, offset: 160)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_pad2", scope: !812, file: !480, line: 1054, baseType: !747, size: 24, offset: 168)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "distort_min", scope: !812, file: !480, line: 1057, baseType: !368, size: 32, offset: 192)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "distort_max", scope: !812, file: !480, line: 1057, baseType: !368, size: 32, offset: 224)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "sharp_min", scope: !812, file: !480, line: 1060, baseType: !368, size: 32, offset: 256)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "sharp_max", scope: !812, file: !480, line: 1060, baseType: !368, size: 32, offset: 288)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !479, file: !480, line: 1247, baseType: !829, size: 64, offset: 2176)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DICompositeType(tag: DW_TAG_structure_type, name: "SceneStats", file: !480, line: 60, flags: DIFlagFwdDecl)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !479, file: !480, line: 1251, baseType: !832, size: 31872, offset: 2240)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderData", file: !480, line: 403, size: 31872, elements: !833)
!833 = !{!834, !914, !934, !943, !963, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1104, !1105, !1106, !1110, !1126, !1127}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "im_format", scope: !832, file: !480, line: 404, baseType: !835, size: 1984)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageFormatData", file: !480, line: 259, size: 1984, elements: !836)
!836 = !{!837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !909}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "imtype", scope: !835, file: !480, line: 260, baseType: !81, size: 8)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !835, file: !480, line: 263, baseType: !81, size: 8, offset: 8)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !835, file: !480, line: 266, baseType: !81, size: 8, offset: 16)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !835, file: !480, line: 267, baseType: !81, size: 8, offset: 24)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !835, file: !480, line: 269, baseType: !81, size: 8, offset: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "compress", scope: !835, file: !480, line: 270, baseType: !81, size: 8, offset: 40)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "exr_codec", scope: !835, file: !480, line: 276, baseType: !81, size: 8, offset: 48)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_flag", scope: !835, file: !480, line: 279, baseType: !81, size: 8, offset: 56)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_white", scope: !835, file: !480, line: 280, baseType: !163, size: 16, offset: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_black", scope: !835, file: !480, line: 280, baseType: !163, size: 16, offset: 80)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "cineon_gamma", scope: !835, file: !480, line: 281, baseType: !368, size: 32, offset: 96)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "jp2_flag", scope: !835, file: !480, line: 284, baseType: !81, size: 8, offset: 128)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "jp2_codec", scope: !835, file: !480, line: 285, baseType: !81, size: 8, offset: 136)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !835, file: !480, line: 287, baseType: !342, size: 48, offset: 144)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "view_settings", scope: !835, file: !480, line: 290, baseType: !852, size: 1280, offset: 192)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedViewSettings", file: !680, line: 174, baseType: !853)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedViewSettings", file: !680, line: 166, size: 1280, elements: !854)
!854 = !{!855, !856, !857, !858, !859, !860, !861, !908}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !853, file: !680, line: 167, baseType: !48, size: 32)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !853, file: !680, line: 167, baseType: !48, size: 32, offset: 32)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "look", scope: !853, file: !680, line: 168, baseType: !212, size: 512, offset: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "view_transform", scope: !853, file: !680, line: 169, baseType: !212, size: 512, offset: 576)
