; ModuleID = 'blender/source/blender/modifiers/intern/MOD_explode.c'
source_filename = "blender/source/blender/modifiers/intern/MOD_explode.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!114 = !DIEnumerator(name: "eModifierType_WeightVGProximity", value: 38, isUnsigned: true)
!115 = !DIEnumerator(name: "eModifierType_Ocean", value: 39, isUnsigned: true)
!116 = !DIEnumerator(name: "eModifierType_DynamicPaint", value: 40, isUnsigned: true)
!117 = !DIEnumerator(name: "eModifierType_Remesh", value: 41, isUnsigned: true)
!118 = !DIEnumerator(name: "eModifierType_Skin", value: 42, isUnsigned: true)
!119 = !DIEnumerator(name: "eModifierType_LaplacianSmooth", value: 43, isUnsigned: true)
!120 = !DIEnumerator(name: "eModifierType_Triangulate", value: 44, isUnsigned: true)
!121 = !DIEnumerator(name: "eModifierType_UVWarp", value: 45, isUnsigned: true)
!122 = !DIEnumerator(name: "eModifierType_MeshCache", value: 46, isUnsigned: true)
!123 = !DIEnumerator(name: "eModifierType_LaplacianDeform", value: 47, isUnsigned: true)
!124 = !DIEnumerator(name: "eModifierType_Wireframe", value: 48, isUnsigned: true)
!125 = !DIEnumerator(name: "NUM_MODIFIER_TYPES", value: 49, isUnsigned: true)
!126 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !127, line: 76, baseType: !7, size: 32, elements: !128)
!127 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!128 = !{!129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169}
!129 = !DIEnumerator(name: "CD_MVERT", value: 0, isUnsigned: true)
!130 = !DIEnumerator(name: "CD_MSTICKY", value: 1, isUnsigned: true)
!131 = !DIEnumerator(name: "CD_MDEFORMVERT", value: 2, isUnsigned: true)
!132 = !DIEnumerator(name: "CD_MEDGE", value: 3, isUnsigned: true)
!133 = !DIEnumerator(name: "CD_MFACE", value: 4, isUnsigned: true)
!134 = !DIEnumerator(name: "CD_MTFACE", value: 5, isUnsigned: true)
!135 = !DIEnumerator(name: "CD_MCOL", value: 6, isUnsigned: true)
!136 = !DIEnumerator(name: "CD_ORIGINDEX", value: 7, isUnsigned: true)
!137 = !DIEnumerator(name: "CD_NORMAL", value: 8, isUnsigned: true)
!138 = !DIEnumerator(name: "CD_PROP_FLT", value: 10, isUnsigned: true)
!139 = !DIEnumerator(name: "CD_PROP_INT", value: 11, isUnsigned: true)
!140 = !DIEnumerator(name: "CD_PROP_STR", value: 12, isUnsigned: true)
!141 = !DIEnumerator(name: "CD_ORIGSPACE", value: 13, isUnsigned: true)
!142 = !DIEnumerator(name: "CD_ORCO", value: 14, isUnsigned: true)
!143 = !DIEnumerator(name: "CD_MTEXPOLY", value: 15, isUnsigned: true)
!144 = !DIEnumerator(name: "CD_MLOOPUV", value: 16, isUnsigned: true)
!145 = !DIEnumerator(name: "CD_MLOOPCOL", value: 17, isUnsigned: true)
!146 = !DIEnumerator(name: "CD_TANGENT", value: 18, isUnsigned: true)
!147 = !DIEnumerator(name: "CD_MDISPS", value: 19, isUnsigned: true)
!148 = !DIEnumerator(name: "CD_PREVIEW_MCOL", value: 20, isUnsigned: true)
!149 = !DIEnumerator(name: "CD_ID_MCOL", value: 21, isUnsigned: true)
!150 = !DIEnumerator(name: "CD_TEXTURE_MCOL", value: 22, isUnsigned: true)
!151 = !DIEnumerator(name: "CD_CLOTH_ORCO", value: 23, isUnsigned: true)
!152 = !DIEnumerator(name: "CD_RECAST", value: 24, isUnsigned: true)
!153 = !DIEnumerator(name: "CD_MPOLY", value: 25, isUnsigned: true)
!154 = !DIEnumerator(name: "CD_MLOOP", value: 26, isUnsigned: true)
!155 = !DIEnumerator(name: "CD_SHAPE_KEYINDEX", value: 27, isUnsigned: true)
!156 = !DIEnumerator(name: "CD_SHAPEKEY", value: 28, isUnsigned: true)
!157 = !DIEnumerator(name: "CD_BWEIGHT", value: 29, isUnsigned: true)
!158 = !DIEnumerator(name: "CD_CREASE", value: 30, isUnsigned: true)
!159 = !DIEnumerator(name: "CD_ORIGSPACE_MLOOP", value: 31, isUnsigned: true)
!160 = !DIEnumerator(name: "CD_PREVIEW_MLOOPCOL", value: 32, isUnsigned: true)
!161 = !DIEnumerator(name: "CD_BM_ELEM_PYPTR", value: 33, isUnsigned: true)
!162 = !DIEnumerator(name: "CD_PAINT_MASK", value: 34, isUnsigned: true)
!163 = !DIEnumerator(name: "CD_GRID_PAINT_MASK", value: 35, isUnsigned: true)
!164 = !DIEnumerator(name: "CD_MVERT_SKIN", value: 36, isUnsigned: true)
!165 = !DIEnumerator(name: "CD_FREESTYLE_EDGE", value: 37, isUnsigned: true)
!166 = !DIEnumerator(name: "CD_FREESTYLE_FACE", value: 38, isUnsigned: true)
!167 = !DIEnumerator(name: "CD_MLOOPTANGENT", value: 39, isUnsigned: true)
!168 = !DIEnumerator(name: "CD_TESSLOOPNORMAL", value: 40, isUnsigned: true)
!169 = !DIEnumerator(name: "CD_NUMTYPES", value: 41, isUnsigned: true)
!170 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !171, line: 341, baseType: !7, size: 32, elements: !172)
!171 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!172 = !{!173, !174}
!173 = !DIEnumerator(name: "ME_SMOOTH", value: 1, isUnsigned: true)
!174 = !DIEnumerator(name: "ME_FACE_SEL", value: 2, isUnsigned: true)
!175 = !{!176, !208, !1741, !2369, !188, !2372}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExplodeModifierData", file: !61, line: 715, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExplodeModifierData", file: !61, line: 708, size: 1536, elements: !179)
!179 = !{!180, !1736, !1737, !1738, !1739, !1740}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !178, file: !61, line: 709, baseType: !181, size: 896)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierData", file: !61, line: 110, baseType: !182)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierData", file: !61, line: 99, size: 896, elements: !183)
!183 = !{!184, !186, !187, !189, !190, !191, !192, !197, !1735}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !182, file: !61, line: 100, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !182, file: !61, line: 100, baseType: !185, size: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !182, file: !61, line: 102, baseType: !188, size: 32, offset: 128)
!188 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !182, file: !61, line: 102, baseType: !188, size: 32, offset: 160)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "stackindex", scope: !182, file: !61, line: 103, baseType: !188, size: 32, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !182, file: !61, line: 103, baseType: !188, size: 32, offset: 224)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !182, file: !61, line: 104, baseType: !193, size: 512, offset: 256)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 512, elements: !195)
!194 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!195 = !{!196}
!196 = !DISubrange(count: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !182, file: !61, line: 107, baseType: !198, size: 64, offset: 768)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !200, line: 1216, size: 39680, elements: !201)
!200 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!201 = !{!202, !269, !272, !1046, !1049, !1050, !1051, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1077, !1080, !1083, !1307, !1310, !1609, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1631, !1632, !1633, !1634, !1635, !1643, !1709, !1716, !1717, !1724, !1727, !1728, !1729, !1730, !1731, !1732}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !199, file: !200, line: 1217, baseType: !203, size: 960)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !204, line: 130, baseType: !205)
!204 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !204, line: 117, size: 960, elements: !206)
!206 = !{!207, !209, !210, !212, !231, !235, !237, !238, !239, !240}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !205, file: !204, line: 118, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !205, file: !204, line: 118, baseType: !208, size: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !205, file: !204, line: 119, baseType: !211, size: 64, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !205, file: !204, line: 120, baseType: !213, size: 64, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !204, line: 136, size: 17600, elements: !215)
!215 = !{!216, !217, !219, !222, !226, !227, !228}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !214, file: !204, line: 137, baseType: !203, size: 960)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !214, file: !204, line: 138, baseType: !218, size: 64, offset: 960)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !214, file: !204, line: 139, baseType: !220, size: 64, offset: 1024)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !204, line: 43, flags: DIFlagFwdDecl)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !214, file: !204, line: 140, baseType: !223, size: 8192, offset: 1088)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 8192, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 1024)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !214, file: !204, line: 141, baseType: !223, size: 8192, offset: 9280)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !214, file: !204, line: 148, baseType: !213, size: 64, offset: 17472)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !214, file: !204, line: 150, baseType: !229, size: 64, offset: 17536)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !204, line: 45, flags: DIFlagFwdDecl)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !205, file: !204, line: 121, baseType: !232, size: 528, offset: 256)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 528, elements: !233)
!233 = !{!234}
!234 = !DISubrange(count: 66)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !205, file: !204, line: 126, baseType: !236, size: 16, offset: 784)
!236 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !205, file: !204, line: 127, baseType: !188, size: 32, offset: 800)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !205, file: !204, line: 128, baseType: !188, size: 32, offset: 832)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !205, file: !204, line: 128, baseType: !188, size: 32, offset: 864)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !205, file: !204, line: 129, baseType: !241, size: 64, offset: 896)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !204, line: 75, baseType: !243)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !204, line: 62, size: 1024, elements: !244)
!244 = !{!245, !247, !248, !249, !250, !251, !252, !253, !267, !268}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !243, file: !204, line: 63, baseType: !246, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !243, file: !204, line: 63, baseType: !246, size: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !243, file: !204, line: 64, baseType: !194, size: 8, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !243, file: !204, line: 64, baseType: !194, size: 8, offset: 136)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !243, file: !204, line: 65, baseType: !236, size: 16, offset: 144)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !243, file: !204, line: 66, baseType: !193, size: 512, offset: 160)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !243, file: !204, line: 67, baseType: !188, size: 32, offset: 672)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !243, file: !204, line: 69, baseType: !254, size: 256, offset: 704)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !204, line: 60, baseType: !255)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !204, line: 48, size: 256, elements: !256)
!256 = !{!257, !258, !265, !266}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !255, file: !204, line: 49, baseType: !208, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !255, file: !204, line: 58, baseType: !259, size: 128, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !260, line: 71, baseType: !261)
!260 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !260, line: 69, size: 128, elements: !262)
!262 = !{!263, !264}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !261, file: !260, line: 70, baseType: !208, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !261, file: !260, line: 70, baseType: !208, size: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !255, file: !204, line: 59, baseType: !188, size: 32, offset: 192)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !255, file: !204, line: 59, baseType: !188, size: 32, offset: 224)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !243, file: !204, line: 70, baseType: !188, size: 32, offset: 960)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !243, file: !204, line: 74, baseType: !188, size: 32, offset: 992)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !199, file: !200, line: 1218, baseType: !270, size: 64, offset: 960)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !200, line: 58, flags: DIFlagFwdDecl)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !199, file: !200, line: 1220, baseType: !273, size: 64, offset: 1024)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !275, line: 115, size: 11392, elements: !276)
!275 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!276 = !{!277, !278, !279, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !297, !309, !323, !324, !367, !368, !371, !372, !388, !389, !390, !391, !392, !393, !394, !398, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !414, !415, !416, !417, !418, !419, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !479, !480, !481, !482, !483, !484, !485, !486, !487, !490, !493, !497, !498, !499, !500, !501, !504, !507, !993, !994, !1000, !1001, !1002, !1003, !1004, !1005, !1007, !1010, !1013, !1015, !1034, !1035}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !274, file: !275, line: 116, baseType: !203, size: 960)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !274, file: !275, line: 117, baseType: !270, size: 64, offset: 960)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !274, file: !275, line: 119, baseType: !280, size: 64, offset: 1024)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !275, line: 57, flags: DIFlagFwdDecl)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !274, file: !275, line: 121, baseType: !236, size: 16, offset: 1088)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !274, file: !275, line: 121, baseType: !236, size: 16, offset: 1104)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !274, file: !275, line: 122, baseType: !188, size: 32, offset: 1120)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !274, file: !275, line: 122, baseType: !188, size: 32, offset: 1152)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !274, file: !275, line: 122, baseType: !188, size: 32, offset: 1184)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !274, file: !275, line: 123, baseType: !193, size: 512, offset: 1216)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !274, file: !275, line: 124, baseType: !273, size: 64, offset: 1728)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !274, file: !275, line: 124, baseType: !273, size: 64, offset: 1792)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !274, file: !275, line: 127, baseType: !273, size: 64, offset: 1856)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !274, file: !275, line: 127, baseType: !273, size: 64, offset: 1920)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !274, file: !275, line: 127, baseType: !273, size: 64, offset: 1984)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !274, file: !275, line: 128, baseType: !294, size: 64, offset: 2048)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !296, line: 46, flags: DIFlagFwdDecl)
!296 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!297 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !274, file: !275, line: 130, baseType: !298, size: 64, offset: 2112)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !275, line: 97, size: 832, elements: !300)
!300 = !{!301, !307, !308}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !299, file: !275, line: 98, baseType: !302, size: 768)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !303, size: 768, elements: !304)
!303 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!304 = !{!305, !306}
!305 = !DISubrange(count: 8)
!306 = !DISubrange(count: 3)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !299, file: !275, line: 99, baseType: !188, size: 32, offset: 768)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !299, file: !275, line: 99, baseType: !188, size: 32, offset: 800)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !274, file: !275, line: 131, baseType: !310, size: 64, offset: 2176)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !312, line: 486, size: 1600, elements: !313)
!312 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!313 = !{!314, !315, !316, !317, !318, !319, !320, !321, !322}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !311, file: !312, line: 487, baseType: !203, size: 960)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !311, file: !312, line: 489, baseType: !259, size: 128, offset: 960)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !311, file: !312, line: 490, baseType: !259, size: 128, offset: 1088)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !311, file: !312, line: 491, baseType: !259, size: 128, offset: 1216)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !311, file: !312, line: 492, baseType: !259, size: 128, offset: 1344)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !311, file: !312, line: 494, baseType: !188, size: 32, offset: 1472)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !311, file: !312, line: 495, baseType: !188, size: 32, offset: 1504)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !311, file: !312, line: 497, baseType: !188, size: 32, offset: 1536)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !311, file: !312, line: 498, baseType: !188, size: 32, offset: 1568)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !274, file: !275, line: 132, baseType: !310, size: 64, offset: 2240)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !274, file: !275, line: 133, baseType: !325, size: 64, offset: 2304)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !312, line: 334, size: 1728, elements: !327)
!327 = !{!328, !329, !332, !333, !334, !335, !336, !337, !340, !341, !342, !343, !344, !345, !346, !366}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !326, file: !312, line: 335, baseType: !259, size: 128)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !326, file: !312, line: 336, baseType: !330, size: 64, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !312, line: 47, flags: DIFlagFwdDecl)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !326, file: !312, line: 338, baseType: !236, size: 16, offset: 192)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !326, file: !312, line: 338, baseType: !236, size: 16, offset: 208)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !326, file: !312, line: 339, baseType: !7, size: 32, offset: 224)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !326, file: !312, line: 340, baseType: !188, size: 32, offset: 256)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !326, file: !312, line: 342, baseType: !303, size: 32, offset: 288)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !326, file: !312, line: 343, baseType: !338, size: 96, offset: 320)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !303, size: 96, elements: !339)
!339 = !{!306}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !326, file: !312, line: 344, baseType: !338, size: 96, offset: 416)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !326, file: !312, line: 347, baseType: !259, size: 128, offset: 512)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !326, file: !312, line: 349, baseType: !188, size: 32, offset: 640)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !326, file: !312, line: 350, baseType: !188, size: 32, offset: 672)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !326, file: !312, line: 351, baseType: !208, size: 64, offset: 704)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !326, file: !312, line: 352, baseType: !208, size: 64, offset: 768)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !326, file: !312, line: 354, baseType: !347, size: 384, offset: 832)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !312, line: 116, baseType: !348)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !312, line: 94, size: 384, elements: !349)
!349 = !{!350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !348, file: !312, line: 96, baseType: !188, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !348, file: !312, line: 96, baseType: !188, size: 32, offset: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !348, file: !312, line: 97, baseType: !188, size: 32, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !348, file: !312, line: 97, baseType: !188, size: 32, offset: 96)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !348, file: !312, line: 99, baseType: !236, size: 16, offset: 128)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !348, file: !312, line: 100, baseType: !236, size: 16, offset: 144)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !348, file: !312, line: 102, baseType: !236, size: 16, offset: 160)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !348, file: !312, line: 105, baseType: !236, size: 16, offset: 176)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !348, file: !312, line: 108, baseType: !236, size: 16, offset: 192)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !348, file: !312, line: 109, baseType: !236, size: 16, offset: 208)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !348, file: !312, line: 111, baseType: !236, size: 16, offset: 224)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !348, file: !312, line: 112, baseType: !236, size: 16, offset: 240)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !348, file: !312, line: 114, baseType: !188, size: 32, offset: 256)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !348, file: !312, line: 114, baseType: !188, size: 32, offset: 288)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !348, file: !312, line: 115, baseType: !188, size: 32, offset: 320)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !348, file: !312, line: 115, baseType: !188, size: 32, offset: 352)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !326, file: !312, line: 355, baseType: !193, size: 512, offset: 1216)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !274, file: !275, line: 134, baseType: !208, size: 64, offset: 2368)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !274, file: !275, line: 136, baseType: !369, size: 64, offset: 2432)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !200, line: 61, flags: DIFlagFwdDecl)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !274, file: !275, line: 138, baseType: !347, size: 384, offset: 2496)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !274, file: !275, line: 139, baseType: !373, size: 64, offset: 2880)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !312, line: 80, baseType: !375)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !312, line: 72, size: 192, elements: !376)
!376 = !{!377, !384, !385, !386, !387}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !375, file: !312, line: 73, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !312, line: 59, baseType: !380)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !312, line: 56, size: 128, elements: !381)
!381 = !{!382, !383}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !380, file: !312, line: 57, baseType: !338, size: 96)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !380, file: !312, line: 58, baseType: !188, size: 32, offset: 96)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !375, file: !312, line: 74, baseType: !188, size: 32, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !375, file: !312, line: 76, baseType: !188, size: 32, offset: 96)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !375, file: !312, line: 77, baseType: !188, size: 32, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !375, file: !312, line: 79, baseType: !188, size: 32, offset: 160)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !274, file: !275, line: 141, baseType: !259, size: 128, offset: 2944)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !274, file: !275, line: 142, baseType: !259, size: 128, offset: 3072)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !274, file: !275, line: 143, baseType: !259, size: 128, offset: 3200)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !274, file: !275, line: 144, baseType: !259, size: 128, offset: 3328)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !274, file: !275, line: 146, baseType: !188, size: 32, offset: 3456)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !274, file: !275, line: 147, baseType: !188, size: 32, offset: 3488)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !274, file: !275, line: 150, baseType: !395, size: 64, offset: 3520)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !200, line: 179, flags: DIFlagFwdDecl)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !274, file: !275, line: 151, baseType: !399, size: 64, offset: 3584)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !274, file: !275, line: 152, baseType: !188, size: 32, offset: 3648)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !274, file: !275, line: 153, baseType: !188, size: 32, offset: 3680)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !274, file: !275, line: 156, baseType: !338, size: 96, offset: 3712)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !274, file: !275, line: 156, baseType: !338, size: 96, offset: 3808)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !274, file: !275, line: 156, baseType: !338, size: 96, offset: 3904)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !274, file: !275, line: 157, baseType: !338, size: 96, offset: 4000)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !274, file: !275, line: 158, baseType: !338, size: 96, offset: 4096)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !274, file: !275, line: 159, baseType: !338, size: 96, offset: 4192)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !274, file: !275, line: 160, baseType: !338, size: 96, offset: 4288)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !274, file: !275, line: 160, baseType: !338, size: 96, offset: 4384)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !274, file: !275, line: 161, baseType: !411, size: 128, offset: 4480)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !303, size: 128, elements: !412)
!412 = !{!413}
!413 = !DISubrange(count: 4)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !274, file: !275, line: 161, baseType: !411, size: 128, offset: 4608)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !274, file: !275, line: 162, baseType: !338, size: 96, offset: 4736)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !274, file: !275, line: 162, baseType: !338, size: 96, offset: 4832)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !274, file: !275, line: 163, baseType: !303, size: 32, offset: 4928)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !274, file: !275, line: 163, baseType: !303, size: 32, offset: 4960)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !274, file: !275, line: 164, baseType: !420, size: 512, offset: 4992)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !303, size: 512, elements: !421)
!421 = !{!413, !413}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !274, file: !275, line: 165, baseType: !420, size: 512, offset: 5504)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !274, file: !275, line: 166, baseType: !420, size: 512, offset: 6016)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !274, file: !275, line: 167, baseType: !420, size: 512, offset: 6528)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !274, file: !275, line: 176, baseType: !420, size: 512, offset: 7040)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !274, file: !275, line: 178, baseType: !7, size: 32, offset: 7552)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !274, file: !275, line: 180, baseType: !236, size: 16, offset: 7584)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !274, file: !275, line: 181, baseType: !236, size: 16, offset: 7600)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !274, file: !275, line: 183, baseType: !236, size: 16, offset: 7616)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !274, file: !275, line: 183, baseType: !236, size: 16, offset: 7632)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !274, file: !275, line: 184, baseType: !236, size: 16, offset: 7648)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !274, file: !275, line: 184, baseType: !236, size: 16, offset: 7664)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !274, file: !275, line: 185, baseType: !236, size: 16, offset: 7680)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !274, file: !275, line: 186, baseType: !236, size: 16, offset: 7696)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !274, file: !275, line: 187, baseType: !236, size: 16, offset: 7712)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !274, file: !275, line: 188, baseType: !194, size: 8, offset: 7728)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !274, file: !275, line: 189, baseType: !194, size: 8, offset: 7736)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !274, file: !275, line: 192, baseType: !188, size: 32, offset: 7744)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !274, file: !275, line: 192, baseType: !188, size: 32, offset: 7776)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !274, file: !275, line: 192, baseType: !188, size: 32, offset: 7808)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !274, file: !275, line: 192, baseType: !188, size: 32, offset: 7840)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !274, file: !275, line: 194, baseType: !188, size: 32, offset: 7872)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !274, file: !275, line: 202, baseType: !303, size: 32, offset: 7904)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !274, file: !275, line: 202, baseType: !303, size: 32, offset: 7936)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !274, file: !275, line: 202, baseType: !303, size: 32, offset: 7968)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !274, file: !275, line: 211, baseType: !303, size: 32, offset: 8000)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !274, file: !275, line: 212, baseType: !303, size: 32, offset: 8032)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !274, file: !275, line: 213, baseType: !303, size: 32, offset: 8064)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !274, file: !275, line: 214, baseType: !303, size: 32, offset: 8096)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !274, file: !275, line: 215, baseType: !303, size: 32, offset: 8128)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !274, file: !275, line: 216, baseType: !303, size: 32, offset: 8160)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !274, file: !275, line: 219, baseType: !303, size: 32, offset: 8192)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !274, file: !275, line: 220, baseType: !303, size: 32, offset: 8224)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !274, file: !275, line: 221, baseType: !303, size: 32, offset: 8256)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !274, file: !275, line: 224, baseType: !456, size: 16, offset: 8288)
!456 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !274, file: !275, line: 224, baseType: !456, size: 16, offset: 8304)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !274, file: !275, line: 226, baseType: !236, size: 16, offset: 8320)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !274, file: !275, line: 228, baseType: !194, size: 8, offset: 8336)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !274, file: !275, line: 229, baseType: !194, size: 8, offset: 8344)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !274, file: !275, line: 231, baseType: !236, size: 16, offset: 8352)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !274, file: !275, line: 232, baseType: !194, size: 8, offset: 8368)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !274, file: !275, line: 233, baseType: !194, size: 8, offset: 8376)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !274, file: !275, line: 234, baseType: !303, size: 32, offset: 8384)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !274, file: !275, line: 235, baseType: !303, size: 32, offset: 8416)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !274, file: !275, line: 237, baseType: !259, size: 128, offset: 8448)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !274, file: !275, line: 238, baseType: !259, size: 128, offset: 8576)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !274, file: !275, line: 239, baseType: !259, size: 128, offset: 8704)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !274, file: !275, line: 240, baseType: !259, size: 128, offset: 8832)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !274, file: !275, line: 242, baseType: !303, size: 32, offset: 8960)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !274, file: !275, line: 244, baseType: !236, size: 16, offset: 8992)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !274, file: !275, line: 245, baseType: !456, size: 16, offset: 9008)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !274, file: !275, line: 246, baseType: !411, size: 128, offset: 9024)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !274, file: !275, line: 248, baseType: !188, size: 32, offset: 9152)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !274, file: !275, line: 249, baseType: !188, size: 32, offset: 9184)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !274, file: !275, line: 251, baseType: !477, size: 64, offset: 9216)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !275, line: 251, flags: DIFlagFwdDecl)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !274, file: !275, line: 253, baseType: !194, size: 8, offset: 9280)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !274, file: !275, line: 254, baseType: !194, size: 8, offset: 9288)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !274, file: !275, line: 255, baseType: !236, size: 16, offset: 9296)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !274, file: !275, line: 256, baseType: !338, size: 96, offset: 9312)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !274, file: !275, line: 258, baseType: !259, size: 128, offset: 9408)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !274, file: !275, line: 259, baseType: !259, size: 128, offset: 9536)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !274, file: !275, line: 260, baseType: !259, size: 128, offset: 9664)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !274, file: !275, line: 261, baseType: !259, size: 128, offset: 9792)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !274, file: !275, line: 263, baseType: !488, size: 64, offset: 9920)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !275, line: 52, flags: DIFlagFwdDecl)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !274, file: !275, line: 264, baseType: !491, size: 64, offset: 9984)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !275, line: 53, flags: DIFlagFwdDecl)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !274, file: !275, line: 265, baseType: !494, size: 64, offset: 10048)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !496, line: 43, flags: DIFlagFwdDecl)
!496 = !DIFile(filename: "blender/source/blender/makesdna/DNA_freestyle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!497 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !274, file: !275, line: 267, baseType: !194, size: 8, offset: 10112)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !274, file: !275, line: 268, baseType: !194, size: 8, offset: 10120)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !274, file: !275, line: 269, baseType: !236, size: 16, offset: 10128)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !274, file: !275, line: 270, baseType: !303, size: 32, offset: 10144)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !274, file: !275, line: 272, baseType: !502, size: 64, offset: 10176)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !275, line: 54, flags: DIFlagFwdDecl)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !274, file: !275, line: 275, baseType: !505, size: 64, offset: 10240)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !275, line: 275, flags: DIFlagFwdDecl)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !274, file: !275, line: 277, baseType: !508, size: 64, offset: 10304)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !28, line: 178, size: 13504, elements: !510)
!510 = !{!511, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !562, !565, !567, !568, !570, !571, !572, !573, !579, !584, !585, !589, !590, !591, !592, !593, !605, !617, !631, !635, !639, !643, !652, !664, !668, !672, !676, !680, !684, !685, !686, !687, !688, !689, !693, !694, !695, !696, !700, !701, !702, !703, !704, !709, !710, !711, !712, !713, !717, !718, !719, !720, !721, !728, !739, !744, !750, !760, !766, !777, !784, !791, !795, !800, !804, !809, !810, !811, !818, !824, !825, !826, !831, !832, !841, !950, !954, !962, !966, !970, !974, !982, !992}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !509, file: !28, line: 180, baseType: !512, size: 1600)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !127, line: 73, baseType: !513)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !127, line: 64, size: 1600, elements: !514)
!514 = !{!515, !530, !534, !535, !536, !537, !540}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !513, file: !127, line: 65, baseType: !516, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !127, line: 53, baseType: !518)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !127, line: 42, size: 832, elements: !519)
!519 = !{!520, !521, !522, !523, !524, !525, !526, !527, !528, !529}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !518, file: !127, line: 43, baseType: !188, size: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !518, file: !127, line: 44, baseType: !188, size: 32, offset: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !518, file: !127, line: 45, baseType: !188, size: 32, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !518, file: !127, line: 46, baseType: !188, size: 32, offset: 96)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !518, file: !127, line: 47, baseType: !188, size: 32, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !518, file: !127, line: 48, baseType: !188, size: 32, offset: 160)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !518, file: !127, line: 49, baseType: !188, size: 32, offset: 192)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !518, file: !127, line: 50, baseType: !188, size: 32, offset: 224)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !518, file: !127, line: 51, baseType: !193, size: 512, offset: 256)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !518, file: !127, line: 52, baseType: !208, size: 64, offset: 768)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !513, file: !127, line: 66, baseType: !531, size: 1312, offset: 64)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 1312, elements: !532)
!532 = !{!533}
!533 = !DISubrange(count: 41)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !513, file: !127, line: 69, baseType: !188, size: 32, offset: 1376)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !513, file: !127, line: 69, baseType: !188, size: 32, offset: 1408)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !513, file: !127, line: 70, baseType: !188, size: 32, offset: 1440)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !513, file: !127, line: 71, baseType: !538, size: 64, offset: 1472)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !127, line: 71, flags: DIFlagFwdDecl)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !513, file: !127, line: 72, baseType: !541, size: 64, offset: 1536)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !127, line: 59, baseType: !543)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !127, line: 57, size: 8192, elements: !544)
!544 = !{!545}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !543, file: !127, line: 58, baseType: !223, size: 8192)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !509, file: !28, line: 180, baseType: !512, size: 1600, offset: 1600)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !509, file: !28, line: 180, baseType: !512, size: 1600, offset: 3200)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !509, file: !28, line: 180, baseType: !512, size: 1600, offset: 4800)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !509, file: !28, line: 180, baseType: !512, size: 1600, offset: 6400)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !509, file: !28, line: 181, baseType: !188, size: 32, offset: 8000)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !509, file: !28, line: 181, baseType: !188, size: 32, offset: 8032)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !509, file: !28, line: 181, baseType: !188, size: 32, offset: 8064)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !509, file: !28, line: 181, baseType: !188, size: 32, offset: 8096)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !509, file: !28, line: 181, baseType: !188, size: 32, offset: 8128)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !509, file: !28, line: 182, baseType: !188, size: 32, offset: 8160)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !509, file: !28, line: 183, baseType: !188, size: 32, offset: 8192)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !509, file: !28, line: 184, baseType: !558, size: 64, offset: 8256)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !559, line: 124, baseType: !560)
!559 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !559, line: 124, flags: DIFlagFwdDecl)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !509, file: !28, line: 185, baseType: !563, size: 64, offset: 8320)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !28, line: 97, flags: DIFlagFwdDecl)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !509, file: !28, line: 186, baseType: !566, size: 32, offset: 8384)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !28, line: 132, baseType: !27)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !509, file: !28, line: 187, baseType: !303, size: 32, offset: 8416)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !509, file: !28, line: 188, baseType: !569, size: 32, offset: 8448)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !28, line: 175, baseType: !33)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !509, file: !28, line: 189, baseType: !188, size: 32, offset: 8480)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !509, file: !28, line: 190, baseType: !395, size: 64, offset: 8512)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !509, file: !28, line: 193, baseType: !194, size: 8, offset: 8576)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !509, file: !28, line: 196, baseType: !574, size: 64, offset: 8640)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DISubroutineType(types: !576)
!576 = !{null, !577}
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !28, line: 177, baseType: !509)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !509, file: !28, line: 199, baseType: !580, size: 64, offset: 8704)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DISubroutineType(types: !582)
!582 = !{null, !577, !583}
!583 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !303)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !509, file: !28, line: 202, baseType: !574, size: 64, offset: 8768)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !509, file: !28, line: 207, baseType: !586, size: 64, offset: 8832)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DISubroutineType(types: !588)
!588 = !{!188, !577}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !509, file: !28, line: 208, baseType: !586, size: 64, offset: 8896)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !509, file: !28, line: 209, baseType: !586, size: 64, offset: 8960)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !509, file: !28, line: 210, baseType: !586, size: 64, offset: 9024)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !509, file: !28, line: 211, baseType: !586, size: 64, offset: 9088)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !509, file: !28, line: 218, baseType: !594, size: 64, offset: 9152)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DISubroutineType(types: !596)
!596 = !{null, !577, !188, !597}
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !171, line: 65, size: 160, elements: !599)
!599 = !{!600, !601, !603, !604}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !598, file: !171, line: 66, baseType: !338, size: 96)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !598, file: !171, line: 67, baseType: !602, size: 48, offset: 96)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 48, elements: !339)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !598, file: !171, line: 68, baseType: !194, size: 8, offset: 144)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !598, file: !171, line: 68, baseType: !194, size: 8, offset: 152)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !509, file: !28, line: 219, baseType: !606, size: 64, offset: 9216)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DISubroutineType(types: !608)
!608 = !{null, !577, !188, !609}
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !171, line: 48, size: 96, elements: !611)
!611 = !{!612, !613, !614, !615, !616}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !610, file: !171, line: 49, baseType: !7, size: 32)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !610, file: !171, line: 49, baseType: !7, size: 32, offset: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !610, file: !171, line: 50, baseType: !194, size: 8, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !610, file: !171, line: 50, baseType: !194, size: 8, offset: 72)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !610, file: !171, line: 51, baseType: !236, size: 16, offset: 80)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !509, file: !28, line: 220, baseType: !618, size: 64, offset: 9280)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DISubroutineType(types: !620)
!620 = !{null, !577, !188, !621}
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !171, line: 42, size: 160, elements: !623)
!623 = !{!624, !625, !626, !627, !628, !629, !630}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !622, file: !171, line: 43, baseType: !7, size: 32)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !622, file: !171, line: 43, baseType: !7, size: 32, offset: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !622, file: !171, line: 43, baseType: !7, size: 32, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !622, file: !171, line: 43, baseType: !7, size: 32, offset: 96)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !622, file: !171, line: 44, baseType: !236, size: 16, offset: 128)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !622, file: !171, line: 45, baseType: !194, size: 8, offset: 144)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !622, file: !171, line: 45, baseType: !194, size: 8, offset: 152)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !509, file: !28, line: 227, baseType: !632, size: 64, offset: 9344)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DISubroutineType(types: !634)
!634 = !{!597, !577}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !509, file: !28, line: 228, baseType: !636, size: 64, offset: 9408)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DISubroutineType(types: !638)
!638 = !{!609, !577}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !509, file: !28, line: 229, baseType: !640, size: 64, offset: 9472)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DISubroutineType(types: !642)
!642 = !{!621, !577}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !509, file: !28, line: 230, baseType: !644, size: 64, offset: 9536)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DISubroutineType(types: !646)
!646 = !{!647, !577}
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !171, line: 88, size: 64, elements: !649)
!649 = !{!650, !651}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !648, file: !171, line: 89, baseType: !7, size: 32)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !648, file: !171, line: 90, baseType: !7, size: 32, offset: 32)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !509, file: !28, line: 231, baseType: !653, size: 64, offset: 9600)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DISubroutineType(types: !655)
!655 = !{!656, !577}
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !171, line: 79, size: 96, elements: !658)
!658 = !{!659, !660, !661, !662, !663}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !657, file: !171, line: 81, baseType: !188, size: 32)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !657, file: !171, line: 82, baseType: !188, size: 32, offset: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !657, file: !171, line: 83, baseType: !236, size: 16, offset: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !657, file: !171, line: 84, baseType: !194, size: 8, offset: 80)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !657, file: !171, line: 84, baseType: !194, size: 8, offset: 88)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !509, file: !28, line: 236, baseType: !665, size: 64, offset: 9664)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{null, !577, !597}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !509, file: !28, line: 237, baseType: !669, size: 64, offset: 9728)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DISubroutineType(types: !671)
!671 = !{null, !577, !609}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !509, file: !28, line: 238, baseType: !673, size: 64, offset: 9792)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DISubroutineType(types: !675)
!675 = !{null, !577, !621}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !509, file: !28, line: 239, baseType: !677, size: 64, offset: 9856)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DISubroutineType(types: !679)
!679 = !{null, !577, !647}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !509, file: !28, line: 240, baseType: !681, size: 64, offset: 9920)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DISubroutineType(types: !683)
!683 = !{null, !577, !656}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !509, file: !28, line: 245, baseType: !632, size: 64, offset: 9984)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !509, file: !28, line: 246, baseType: !636, size: 64, offset: 10048)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !509, file: !28, line: 247, baseType: !640, size: 64, offset: 10112)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !509, file: !28, line: 248, baseType: !644, size: 64, offset: 10176)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !509, file: !28, line: 249, baseType: !653, size: 64, offset: 10240)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !509, file: !28, line: 255, baseType: !690, size: 64, offset: 10304)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DISubroutineType(types: !692)
!692 = !{!208, !577, !188, !188}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !509, file: !28, line: 256, baseType: !690, size: 64, offset: 10368)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !509, file: !28, line: 257, baseType: !690, size: 64, offset: 10432)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !509, file: !28, line: 258, baseType: !690, size: 64, offset: 10496)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !509, file: !28, line: 264, baseType: !697, size: 64, offset: 10560)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DISubroutineType(types: !699)
!699 = !{!208, !577, !188}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !509, file: !28, line: 265, baseType: !697, size: 64, offset: 10624)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !509, file: !28, line: 266, baseType: !697, size: 64, offset: 10688)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !509, file: !28, line: 267, baseType: !697, size: 64, offset: 10752)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !509, file: !28, line: 268, baseType: !697, size: 64, offset: 10816)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataLayout", scope: !509, file: !28, line: 272, baseType: !705, size: 64, offset: 10880)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{!708, !577}
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataLayout", scope: !509, file: !28, line: 273, baseType: !705, size: 64, offset: 10944)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataLayout", scope: !509, file: !28, line: 274, baseType: !705, size: 64, offset: 11008)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataLayout", scope: !509, file: !28, line: 275, baseType: !705, size: 64, offset: 11072)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataLayout", scope: !509, file: !28, line: 276, baseType: !705, size: 64, offset: 11136)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromVertCData", scope: !509, file: !28, line: 279, baseType: !714, size: 64, offset: 11200)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DISubroutineType(types: !716)
!716 = !{null, !577, !188, !708, !188}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromEdgeCData", scope: !509, file: !28, line: 280, baseType: !714, size: 64, offset: 11264)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromFaceCData", scope: !509, file: !28, line: 281, baseType: !714, size: 64, offset: 11328)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "getNumGrids", scope: !509, file: !28, line: 284, baseType: !586, size: 64, offset: 11392)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "getGridSize", scope: !509, file: !28, line: 285, baseType: !586, size: 64, offset: 11456)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "getGridData", scope: !509, file: !28, line: 286, baseType: !722, size: 64, offset: 11520)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DISubroutineType(types: !724)
!724 = !{!725, !577}
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !28, line: 82, flags: DIFlagFwdDecl)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "getGridAdjacency", scope: !509, file: !28, line: 287, baseType: !729, size: 64, offset: 11584)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DISubroutineType(types: !731)
!731 = !{!732, !577}
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGridAdjacency", file: !28, line: 120, baseType: !734)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMGridAdjacency", file: !28, line: 117, size: 256, elements: !735)
!735 = !{!736, !738}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !734, file: !28, line: 118, baseType: !737, size: 128)
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 128, elements: !412)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !734, file: !28, line: 119, baseType: !737, size: 128, offset: 128)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "getGridOffset", scope: !509, file: !28, line: 288, baseType: !740, size: 64, offset: 11648)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DISubroutineType(types: !742)
!742 = !{!743, !577}
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "getGridKey", scope: !509, file: !28, line: 289, baseType: !745, size: 64, offset: 11712)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DISubroutineType(types: !747)
!747 = !{null, !577, !748}
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGKey", file: !28, line: 83, flags: DIFlagFwdDecl)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "getGridFlagMats", scope: !509, file: !28, line: 290, baseType: !751, size: 64, offset: 11776)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{!754, !577}
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFlagMat", file: !28, line: 126, baseType: !756)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMFlagMat", file: !28, line: 123, size: 32, elements: !757)
!757 = !{!758, !759}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !756, file: !28, line: 124, baseType: !236, size: 16)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !756, file: !28, line: 125, baseType: !194, size: 8, offset: 16)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "getGridHidden", scope: !509, file: !28, line: 291, baseType: !761, size: 64, offset: 11840)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DISubroutineType(types: !763)
!763 = !{!764, !577}
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedVert", scope: !509, file: !28, line: 299, baseType: !767, size: 64, offset: 11904)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DISubroutineType(types: !769)
!769 = !{null, !577, !770, !208, !776}
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DISubroutineType(types: !772)
!772 = !{null, !208, !188, !773, !773, !774}
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !236)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMForeachFlag", file: !28, line: 162, baseType: !38)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedEdge", scope: !509, file: !28, line: 309, baseType: !778, size: 64, offset: 11968)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DISubroutineType(types: !780)
!780 = !{null, !577, !781, !208}
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DISubroutineType(types: !783)
!783 = !{null, !208, !188, !773, !773}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedLoop", scope: !509, file: !28, line: 317, baseType: !785, size: 64, offset: 12032)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DISubroutineType(types: !787)
!787 = !{null, !577, !788, !208, !776}
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DISubroutineType(types: !790)
!790 = !{null, !208, !188, !188, !773, !773}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedFaceCenter", scope: !509, file: !28, line: 327, baseType: !792, size: 64, offset: 12096)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DISubroutineType(types: !794)
!794 = !{null, !577, !781, !208, !776}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "getMinMax", scope: !509, file: !28, line: 337, baseType: !796, size: 64, offset: 12160)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DISubroutineType(types: !798)
!798 = !{null, !577, !799, !799}
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCo", scope: !509, file: !28, line: 344, baseType: !801, size: 64, offset: 12224)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DISubroutineType(types: !803)
!803 = !{null, !577, !188, !799}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCos", scope: !509, file: !28, line: 347, baseType: !805, size: 64, offset: 12288)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DISubroutineType(types: !807)
!807 = !{null, !577, !808}
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "getVertNo", scope: !509, file: !28, line: 350, baseType: !801, size: 64, offset: 12352)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyNo", scope: !509, file: !28, line: 351, baseType: !801, size: 64, offset: 12416)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyMap", scope: !509, file: !28, line: 355, baseType: !812, size: 64, offset: 12480)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DISubroutineType(types: !814)
!814 = !{!815, !273, !577}
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !817)
!817 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !28, line: 355, flags: DIFlagFwdDecl)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "getPBVH", scope: !509, file: !28, line: 359, baseType: !819, size: 64, offset: 12544)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DISubroutineType(types: !821)
!821 = !{!822, !273, !577}
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !28, line: 100, flags: DIFlagFwdDecl)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "drawVerts", scope: !509, file: !28, line: 364, baseType: !574, size: 64, offset: 12608)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "drawUVEdges", scope: !509, file: !28, line: 367, baseType: !574, size: 64, offset: 12672)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "drawEdges", scope: !509, file: !28, line: 373, baseType: !827, size: 64, offset: 12736)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DISubroutineType(types: !829)
!829 = !{null, !577, !830, !830}
!830 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "drawLooseEdges", scope: !509, file: !28, line: 376, baseType: !574, size: 64, offset: 12800)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesSolid", scope: !509, file: !28, line: 385, baseType: !833, size: 64, offset: 12864)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DISubroutineType(types: !835)
!835 = !{null, !577, !836, !830, !837}
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetMaterial", file: !28, line: 146, baseType: !838)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DISubroutineType(types: !840)
!840 = !{!188, !188, !208}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesTex", scope: !509, file: !28, line: 391, baseType: !842, size: 64, offset: 12928)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{null, !577, !845, !945, !208, !949}
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptionsTex", file: !28, line: 150, baseType: !846)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{!849, !850, !944, !188}
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawOption", file: !28, line: 143, baseType: !42)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !171, line: 160, size: 384, elements: !852)
!852 = !{!853, !857, !939, !940, !941, !942, !943}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !851, file: !171, line: 161, baseType: !854, size: 256)
!854 = !DICompositeType(tag: DW_TAG_array_type, baseType: !303, size: 256, elements: !855)
!855 = !{!413, !856}
!856 = !DISubrange(count: 2)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !851, file: !171, line: 162, baseType: !858, size: 64, offset: 256)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !860, line: 77, size: 15424, elements: !861)
!860 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!861 = !{!862, !863, !864, !867, !870, !873, !876, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !928, !929, !933}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !859, file: !860, line: 78, baseType: !203, size: 960)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !859, file: !860, line: 80, baseType: !223, size: 8192, offset: 960)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !859, file: !860, line: 82, baseType: !865, size: 64, offset: 9152)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !860, line: 43, flags: DIFlagFwdDecl)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !859, file: !860, line: 83, baseType: !868, size: 64, offset: 9216)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !204, line: 46, flags: DIFlagFwdDecl)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !859, file: !860, line: 86, baseType: !871, size: 64, offset: 9280)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !860, line: 41, flags: DIFlagFwdDecl)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !859, file: !860, line: 87, baseType: !874, size: 64, offset: 9344)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !860, line: 44, flags: DIFlagFwdDecl)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !859, file: !860, line: 89, baseType: !877, size: 512, offset: 9408)
!877 = !DICompositeType(tag: DW_TAG_array_type, baseType: !874, size: 512, elements: !878)
!878 = !{!305}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !859, file: !860, line: 90, baseType: !236, size: 16, offset: 9920)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !859, file: !860, line: 90, baseType: !236, size: 16, offset: 9936)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !859, file: !860, line: 92, baseType: !236, size: 16, offset: 9952)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !859, file: !860, line: 92, baseType: !236, size: 16, offset: 9968)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !859, file: !860, line: 93, baseType: !236, size: 16, offset: 9984)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !859, file: !860, line: 93, baseType: !236, size: 16, offset: 10000)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !859, file: !860, line: 94, baseType: !188, size: 32, offset: 10016)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !859, file: !860, line: 97, baseType: !236, size: 16, offset: 10048)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !859, file: !860, line: 97, baseType: !236, size: 16, offset: 10064)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !859, file: !860, line: 98, baseType: !236, size: 16, offset: 10080)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !859, file: !860, line: 98, baseType: !236, size: 16, offset: 10096)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !859, file: !860, line: 99, baseType: !236, size: 16, offset: 10112)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !859, file: !860, line: 99, baseType: !236, size: 16, offset: 10128)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !859, file: !860, line: 100, baseType: !7, size: 32, offset: 10144)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !859, file: !860, line: 101, baseType: !765, size: 64, offset: 10176)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !859, file: !860, line: 103, baseType: !229, size: 64, offset: 10240)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !859, file: !860, line: 104, baseType: !896, size: 64, offset: 10304)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !204, line: 159, size: 448, elements: !898)
!898 = !{!899, !902, !903, !905, !906, !908}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !897, file: !204, line: 161, baseType: !900, size: 64)
!900 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !901)
!901 = !{!856}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !897, file: !204, line: 162, baseType: !900, size: 64, offset: 64)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !897, file: !204, line: 163, baseType: !904, size: 32, offset: 128)
!904 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 32, elements: !901)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !897, file: !204, line: 164, baseType: !904, size: 32, offset: 160)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !897, file: !204, line: 165, baseType: !907, size: 128, offset: 192)
!907 = !DICompositeType(tag: DW_TAG_array_type, baseType: !765, size: 128, elements: !901)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !897, file: !204, line: 166, baseType: !909, size: 128, offset: 320)
!909 = !DICompositeType(tag: DW_TAG_array_type, baseType: !868, size: 128, elements: !901)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !859, file: !860, line: 107, baseType: !303, size: 32, offset: 10368)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !859, file: !860, line: 108, baseType: !188, size: 32, offset: 10400)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !859, file: !860, line: 109, baseType: !236, size: 16, offset: 10432)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !859, file: !860, line: 110, baseType: !236, size: 16, offset: 10448)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !859, file: !860, line: 113, baseType: !188, size: 32, offset: 10464)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !859, file: !860, line: 113, baseType: !188, size: 32, offset: 10496)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !859, file: !860, line: 114, baseType: !194, size: 8, offset: 10528)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !859, file: !860, line: 114, baseType: !194, size: 8, offset: 10536)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !859, file: !860, line: 115, baseType: !236, size: 16, offset: 10544)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !859, file: !860, line: 116, baseType: !411, size: 128, offset: 10560)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !859, file: !860, line: 119, baseType: !303, size: 32, offset: 10688)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !859, file: !860, line: 119, baseType: !303, size: 32, offset: 10720)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !859, file: !860, line: 122, baseType: !923, size: 512, offset: 10752)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !924, line: 182, baseType: !925)
!924 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !924, line: 180, size: 512, elements: !926)
!926 = !{!927}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !925, file: !924, line: 181, baseType: !193, size: 512)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !859, file: !860, line: 123, baseType: !194, size: 8, offset: 11264)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !859, file: !860, line: 125, baseType: !930, size: 56, offset: 11272)
!930 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 56, elements: !931)
!931 = !{!932}
!932 = !DISubrange(count: 7)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !859, file: !860, line: 126, baseType: !934, size: 4096, offset: 11328)
!934 = !DICompositeType(tag: DW_TAG_array_type, baseType: !935, size: 4096, elements: !878)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !860, line: 69, baseType: !936)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !860, line: 67, size: 512, elements: !937)
!937 = !{!938}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !936, file: !860, line: 68, baseType: !193, size: 512)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !851, file: !171, line: 163, baseType: !194, size: 8, offset: 320)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !851, file: !171, line: 163, baseType: !194, size: 8, offset: 328)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !851, file: !171, line: 164, baseType: !236, size: 16, offset: 336)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !851, file: !171, line: 164, baseType: !236, size: 16, offset: 352)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !851, file: !171, line: 164, baseType: !236, size: 16, offset: 368)
!944 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !830)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCompareDrawOptions", file: !28, line: 147, baseType: !946)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DISubroutineType(types: !948)
!948 = !{!188, !208, !188, !188}
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawFlag", file: !28, line: 157, baseType: !48)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesGLSL", scope: !509, file: !28, line: 400, baseType: !951, size: 64, offset: 12992)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DISubroutineType(types: !953)
!953 = !{null, !577, !837}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFaces", scope: !509, file: !28, line: 415, baseType: !955, size: 64, offset: 13056)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DISubroutineType(types: !957)
!957 = !{null, !577, !958, !837, !945, !208, !949}
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptions", file: !28, line: 149, baseType: !959)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DISubroutineType(types: !961)
!961 = !{!849, !208, !188}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesTex", scope: !509, file: !28, line: 425, baseType: !963, size: 64, offset: 13120)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DISubroutineType(types: !965)
!965 = !{null, !577, !958, !945, !208, !949}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesGLSL", scope: !509, file: !28, line: 435, baseType: !967, size: 64, offset: 13184)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DISubroutineType(types: !969)
!969 = !{null, !577, !837, !958, !208}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdges", scope: !509, file: !28, line: 444, baseType: !971, size: 64, offset: 13248)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DISubroutineType(types: !973)
!973 = !{null, !577, !958, !208}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdgesInterp", scope: !509, file: !28, line: 455, baseType: !975, size: 64, offset: 13312)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DISubroutineType(types: !977)
!977 = !{null, !577, !958, !978, !208}
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawInterpOptions", file: !28, line: 148, baseType: !979)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{null, !208, !188, !303}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesMat", scope: !509, file: !28, line: 464, baseType: !983, size: 64, offset: 13376)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{null, !577, !986, !989, !208}
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{null, !208, !188, !208}
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = !DISubroutineType(types: !991)
!991 = !{!830, !208, !188}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !509, file: !28, line: 470, baseType: !574, size: 64, offset: 13440)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !274, file: !275, line: 277, baseType: !508, size: 64, offset: 10368)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !274, file: !275, line: 278, baseType: !995, size: 64, offset: 10432)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !996, line: 27, baseType: !997)
!996 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !998, line: 45, baseType: !999)
!998 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!999 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !274, file: !275, line: 279, baseType: !995, size: 64, offset: 10496)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !274, file: !275, line: 280, baseType: !7, size: 32, offset: 10560)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !274, file: !275, line: 281, baseType: !7, size: 32, offset: 10592)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !274, file: !275, line: 283, baseType: !259, size: 128, offset: 10624)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !274, file: !275, line: 284, baseType: !259, size: 128, offset: 10752)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !274, file: !275, line: 285, baseType: !1006, size: 64, offset: 10880)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !274, file: !275, line: 287, baseType: !1008, size: 64, offset: 10944)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !275, line: 59, flags: DIFlagFwdDecl)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !274, file: !275, line: 288, baseType: !1011, size: 64, offset: 11008)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !275, line: 288, flags: DIFlagFwdDecl)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !274, file: !275, line: 290, baseType: !1014, size: 64, offset: 11072)
!1014 = !DICompositeType(tag: DW_TAG_array_type, baseType: !303, size: 64, elements: !901)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !274, file: !275, line: 291, baseType: !1016, size: 64, offset: 11136)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !860, line: 65, baseType: !1018)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !860, line: 50, size: 320, elements: !1019)
!1019 = !{!1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1018, file: !860, line: 51, baseType: !198, size: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1018, file: !860, line: 53, baseType: !188, size: 32, offset: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !1018, file: !860, line: 54, baseType: !188, size: 32, offset: 96)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1018, file: !860, line: 55, baseType: !188, size: 32, offset: 128)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !1018, file: !860, line: 55, baseType: !188, size: 32, offset: 160)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !1018, file: !860, line: 56, baseType: !194, size: 8, offset: 192)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !1018, file: !860, line: 56, baseType: !194, size: 8, offset: 200)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1018, file: !860, line: 57, baseType: !194, size: 8, offset: 208)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1018, file: !860, line: 57, baseType: !194, size: 8, offset: 216)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !1018, file: !860, line: 59, baseType: !236, size: 16, offset: 224)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !1018, file: !860, line: 59, baseType: !236, size: 16, offset: 240)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !1018, file: !860, line: 59, baseType: !236, size: 16, offset: 256)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1018, file: !860, line: 61, baseType: !236, size: 16, offset: 272)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1018, file: !860, line: 63, baseType: !188, size: 32, offset: 288)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !274, file: !275, line: 293, baseType: !259, size: 128, offset: 11200)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !274, file: !275, line: 294, baseType: !1036, size: 64, offset: 11328)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !275, line: 113, baseType: !1038)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !275, line: 108, size: 256, elements: !1039)
!1039 = !{!1040, !1042, !1043, !1044, !1045}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1038, file: !275, line: 109, baseType: !1041, size: 64)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1038, file: !275, line: 109, baseType: !1041, size: 64, offset: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1038, file: !275, line: 110, baseType: !273, size: 64, offset: 128)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1038, file: !275, line: 111, baseType: !188, size: 32, offset: 192)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !1038, file: !275, line: 112, baseType: !303, size: 32, offset: 224)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !199, file: !200, line: 1221, baseType: !1047, size: 64, offset: 1088)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !200, line: 52, flags: DIFlagFwdDecl)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !199, file: !200, line: 1223, baseType: !198, size: 64, offset: 1152)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !199, file: !200, line: 1225, baseType: !259, size: 128, offset: 1216)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !199, file: !200, line: 1226, baseType: !1052, size: 64, offset: 1344)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !200, line: 69, size: 320, elements: !1054)
!1054 = !{!1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1053, file: !200, line: 70, baseType: !1052, size: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1053, file: !200, line: 70, baseType: !1052, size: 64, offset: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1053, file: !200, line: 71, baseType: !7, size: 32, offset: 128)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !1053, file: !200, line: 71, baseType: !7, size: 32, offset: 160)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1053, file: !200, line: 72, baseType: !188, size: 32, offset: 192)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !1053, file: !200, line: 73, baseType: !236, size: 16, offset: 224)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !1053, file: !200, line: 73, baseType: !236, size: 16, offset: 240)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1053, file: !200, line: 74, baseType: !273, size: 64, offset: 256)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !199, file: !200, line: 1227, baseType: !273, size: 64, offset: 1408)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !199, file: !200, line: 1229, baseType: !338, size: 96, offset: 1472)
