; ModuleID = 'blender/source/blender/blenkernel/intern/pointcache.c'
source_filename = "blender/source/blender/blenkernel/intern/pointcache.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }

!70 = !DIEnumerator(name: "MOD_SMOKE_TYPE_DOMAIN", value: 1, isUnsigned: true)
!71 = !DIEnumerator(name: "MOD_SMOKE_TYPE_FLOW", value: 2, isUnsigned: true)
!72 = !DIEnumerator(name: "MOD_SMOKE_TYPE_COLL", value: 4, isUnsigned: true)
!73 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 394, baseType: !7, size: 32, elements: !74)
!74 = !{!75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87}
!75 = !DIEnumerator(name: "OB_NEG_SCALE", value: 4, isUnsigned: true)
!76 = !DIEnumerator(name: "OB_DUPLIFRAMES", value: 8, isUnsigned: true)
!77 = !DIEnumerator(name: "OB_DUPLIVERTS", value: 16, isUnsigned: true)
!78 = !DIEnumerator(name: "OB_DUPLIROT", value: 32, isUnsigned: true)
!79 = !DIEnumerator(name: "OB_DUPLINOSPEED", value: 64, isUnsigned: true)
!80 = !DIEnumerator(name: "OB_DUPLIGROUP", value: 256, isUnsigned: true)
!81 = !DIEnumerator(name: "OB_DUPLIFACES", value: 512, isUnsigned: true)
!82 = !DIEnumerator(name: "OB_DUPLIFACES_SCALE", value: 1024, isUnsigned: true)
!83 = !DIEnumerator(name: "OB_DUPLIPARTS", value: 2048, isUnsigned: true)
!84 = !DIEnumerator(name: "OB_RENDER_DUPLI", value: 4096, isUnsigned: true)
!85 = !DIEnumerator(name: "OB_NO_CONSTRAINTS", value: 8192, isUnsigned: true)
!86 = !DIEnumerator(name: "OB_NO_PSYS_UPDATE", value: 16384, isUnsigned: true)
!87 = !DIEnumerator(name: "OB_DUPLI", value: 2840, isUnsigned: true)
!88 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eRigidBodyOb_Flag", file: !89, line: 138, baseType: !7, size: 32, elements: !90)
!89 = !DIFile(filename: "blender/source/blender/makesdna/DNA_rigidbody_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!90 = !{!91, !92, !93, !94, !95, !96, !97, !98}
!91 = !DIEnumerator(name: "RBO_FLAG_KINEMATIC", value: 1, isUnsigned: true)
!92 = !DIEnumerator(name: "RBO_FLAG_NEEDS_VALIDATE", value: 2, isUnsigned: true)
!93 = !DIEnumerator(name: "RBO_FLAG_NEEDS_RESHAPE", value: 4, isUnsigned: true)
!94 = !DIEnumerator(name: "RBO_FLAG_USE_DEACTIVATION", value: 8, isUnsigned: true)
!95 = !DIEnumerator(name: "RBO_FLAG_START_DEACTIVATED", value: 16, isUnsigned: true)
!96 = !DIEnumerator(name: "RBO_FLAG_DISABLED", value: 32, isUnsigned: true)
!97 = !DIEnumerator(name: "RBO_FLAG_USE_MARGIN", value: 64, isUnsigned: true)
!98 = !DIEnumerator(name: "RBO_FLAG_USE_DEFORM", value: 128, isUnsigned: true)
!99 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 339, baseType: !7, size: 32, elements: !100)
!100 = !{!101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111}
!101 = !DIEnumerator(name: "OB_EMPTY", value: 0, isUnsigned: true)
!102 = !DIEnumerator(name: "OB_MESH", value: 1, isUnsigned: true)
!103 = !DIEnumerator(name: "OB_CURVE", value: 2, isUnsigned: true)
!104 = !DIEnumerator(name: "OB_SURF", value: 3, isUnsigned: true)
!105 = !DIEnumerator(name: "OB_FONT", value: 4, isUnsigned: true)
!106 = !DIEnumerator(name: "OB_MBALL", value: 5, isUnsigned: true)
!107 = !DIEnumerator(name: "OB_LAMP", value: 10, isUnsigned: true)
!108 = !DIEnumerator(name: "OB_CAMERA", value: 11, isUnsigned: true)
!109 = !DIEnumerator(name: "OB_SPEAKER", value: 12, isUnsigned: true)
!110 = !DIEnumerator(name: "OB_LATTICE", value: 22, isUnsigned: true)
!111 = !DIEnumerator(name: "OB_ARMATURE", value: 25, isUnsigned: true)
!112 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !113, line: 123, baseType: !7, size: 32, elements: !114)
!113 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_global.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!114 = !{!115, !116, !117, !118, !119, !120, !121, !122, !123}
!115 = !DIEnumerator(name: "G_DEBUG", value: 1, isUnsigned: true)
!116 = !DIEnumerator(name: "G_DEBUG_FFMPEG", value: 2, isUnsigned: true)
!117 = !DIEnumerator(name: "G_DEBUG_PYTHON", value: 4, isUnsigned: true)
!118 = !DIEnumerator(name: "G_DEBUG_EVENTS", value: 8, isUnsigned: true)
!119 = !DIEnumerator(name: "G_DEBUG_HANDLERS", value: 16, isUnsigned: true)
!120 = !DIEnumerator(name: "G_DEBUG_WM", value: 32, isUnsigned: true)
!121 = !DIEnumerator(name: "G_DEBUG_JOBS", value: 64, isUnsigned: true)
!122 = !DIEnumerator(name: "G_DEBUG_FREESTYLE", value: 128, isUnsigned: true)
!123 = !DIEnumerator(name: "G_DEBUG_DEPSGRAPH", value: 256, isUnsigned: true)
!124 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eRigidBodyOb_Type", file: !89, line: 130, baseType: !7, size: 32, elements: !125)
!125 = !{!126, !127}
!126 = !DIEnumerator(name: "RBO_TYPE_ACTIVE", value: 0, isUnsigned: true)
!127 = !DIEnumerator(name: "RBO_TYPE_PASSIVE", value: 1, isUnsigned: true)
!128 = !{!129, !131, !132, !2419, !2540, !144, !256, !2587, !2655, !2657, !1139, !7, !2658}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClothModifierData", file: !16, line: 566, baseType: !134)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ClothModifierData", file: !16, line: 557, size: 1344, elements: !135)
!135 = !{!136, !2358, !2359, !2411, !2414, !2417, !2418}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !134, file: !16, line: 558, baseType: !137, size: 896)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierData", file: !16, line: 110, baseType: !138)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierData", file: !16, line: 99, size: 896, elements: !139)
!139 = !{!140, !142, !143, !145, !146, !147, !148, !152, !2357}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !138, file: !16, line: 100, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !138, file: !16, line: 100, baseType: !141, size: 64, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !138, file: !16, line: 102, baseType: !144, size: 32, offset: 128)
!144 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !138, file: !16, line: 102, baseType: !144, size: 32, offset: 160)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "stackindex", scope: !138, file: !16, line: 103, baseType: !144, size: 32, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !138, file: !16, line: 103, baseType: !144, size: 32, offset: 224)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !138, file: !16, line: 104, baseType: !149, size: 512, offset: 256)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 512, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !138, file: !16, line: 107, baseType: !153, size: 64, offset: 768)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !155, line: 1216, size: 39680, elements: !156)
!155 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!156 = !{!157, !223, !227, !1716, !1719, !1720, !1721, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1748, !1962, !1965, !2215, !2227, !2228, !2229, !2230, !2231, !2232, !2233, !2234, !2237, !2238, !2239, !2240, !2241, !2249, !2315, !2322, !2323, !2330, !2333, !2334, !2335, !2336, !2337, !2338}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !154, file: !155, line: 1217, baseType: !158, size: 960)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !159, line: 130, baseType: !160)
!159 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !159, line: 117, size: 960, elements: !161)
!161 = !{!162, !163, !164, !166, !185, !189, !191, !192, !193, !194}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !160, file: !159, line: 118, baseType: !131, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !160, file: !159, line: 118, baseType: !131, size: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !160, file: !159, line: 119, baseType: !165, size: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !160, file: !159, line: 120, baseType: !167, size: 64, offset: 192)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !159, line: 136, size: 17600, elements: !169)
!169 = !{!170, !171, !173, !176, !180, !181, !182}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !168, file: !159, line: 137, baseType: !158, size: 960)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !168, file: !159, line: 138, baseType: !172, size: 64, offset: 960)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !168, file: !159, line: 139, baseType: !174, size: 64, offset: 1024)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !159, line: 43, flags: DIFlagFwdDecl)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !168, file: !159, line: 140, baseType: !177, size: 8192, offset: 1088)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 8192, elements: !178)
!178 = !{!179}
!179 = !DISubrange(count: 1024)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !168, file: !159, line: 141, baseType: !177, size: 8192, offset: 9280)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !168, file: !159, line: 148, baseType: !167, size: 64, offset: 17472)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !168, file: !159, line: 150, baseType: !183, size: 64, offset: 17536)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !159, line: 45, flags: DIFlagFwdDecl)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !160, file: !159, line: 121, baseType: !186, size: 528, offset: 256)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 528, elements: !187)
!187 = !{!188}
!188 = !DISubrange(count: 66)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !160, file: !159, line: 126, baseType: !190, size: 16, offset: 784)
!190 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !160, file: !159, line: 127, baseType: !144, size: 32, offset: 800)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !160, file: !159, line: 128, baseType: !144, size: 32, offset: 832)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !160, file: !159, line: 128, baseType: !144, size: 32, offset: 864)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !160, file: !159, line: 129, baseType: !195, size: 64, offset: 896)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !159, line: 75, baseType: !197)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !159, line: 62, size: 1024, elements: !198)
!198 = !{!199, !201, !202, !203, !204, !205, !206, !207, !221, !222}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !197, file: !159, line: 63, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !197, file: !159, line: 63, baseType: !200, size: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !197, file: !159, line: 64, baseType: !130, size: 8, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !197, file: !159, line: 64, baseType: !130, size: 8, offset: 136)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !197, file: !159, line: 65, baseType: !190, size: 16, offset: 144)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !197, file: !159, line: 66, baseType: !149, size: 512, offset: 160)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !197, file: !159, line: 67, baseType: !144, size: 32, offset: 672)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !197, file: !159, line: 69, baseType: !208, size: 256, offset: 704)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !159, line: 60, baseType: !209)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !159, line: 48, size: 256, elements: !210)
!210 = !{!211, !212, !219, !220}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !209, file: !159, line: 49, baseType: !131, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !209, file: !159, line: 58, baseType: !213, size: 128, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !214, line: 71, baseType: !215)
!214 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !214, line: 69, size: 128, elements: !216)
!216 = !{!217, !218}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !215, file: !214, line: 70, baseType: !131, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !215, file: !214, line: 70, baseType: !131, size: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !209, file: !159, line: 59, baseType: !144, size: 32, offset: 192)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !209, file: !159, line: 59, baseType: !144, size: 32, offset: 224)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !197, file: !159, line: 70, baseType: !144, size: 32, offset: 960)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !197, file: !159, line: 74, baseType: !144, size: 32, offset: 992)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !154, file: !155, line: 1218, baseType: !224, size: 64, offset: 960)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !226, line: 45, flags: DIFlagFwdDecl)
!226 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!227 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !154, file: !155, line: 1220, baseType: !228, size: 64, offset: 1024)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !6, line: 115, size: 11392, elements: !230)
!230 = !{!231, !232, !233, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !250, !262, !276, !277, !320, !321, !324, !325, !341, !342, !343, !344, !345, !346, !347, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !367, !368, !369, !370, !371, !372, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !464, !465, !466, !467, !468, !469, !470, !471, !472, !842, !1619, !1620, !1621, !1622, !1623, !1624, !1627, !1630, !1631, !1632, !1636, !1637, !1638, !1639, !1640, !1641, !1643, !1666, !1700, !1701, !1704, !1705}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !229, file: !6, line: 116, baseType: !158, size: 960)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !229, file: !6, line: 117, baseType: !224, size: 64, offset: 960)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !229, file: !6, line: 119, baseType: !234, size: 64, offset: 1024)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !6, line: 57, flags: DIFlagFwdDecl)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !229, file: !6, line: 121, baseType: !190, size: 16, offset: 1088)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !229, file: !6, line: 121, baseType: !190, size: 16, offset: 1104)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !229, file: !6, line: 122, baseType: !144, size: 32, offset: 1120)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !229, file: !6, line: 122, baseType: !144, size: 32, offset: 1152)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !229, file: !6, line: 122, baseType: !144, size: 32, offset: 1184)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !229, file: !6, line: 123, baseType: !149, size: 512, offset: 1216)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !229, file: !6, line: 124, baseType: !228, size: 64, offset: 1728)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !229, file: !6, line: 124, baseType: !228, size: 64, offset: 1792)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !229, file: !6, line: 127, baseType: !228, size: 64, offset: 1856)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !229, file: !6, line: 127, baseType: !228, size: 64, offset: 1920)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !229, file: !6, line: 127, baseType: !228, size: 64, offset: 1984)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !229, file: !6, line: 128, baseType: !248, size: 64, offset: 2048)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !226, line: 46, flags: DIFlagFwdDecl)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !229, file: !6, line: 130, baseType: !251, size: 64, offset: 2112)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !6, line: 97, size: 832, elements: !253)
!253 = !{!254, !260, !261}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !252, file: !6, line: 98, baseType: !255, size: 768)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 768, elements: !257)
!256 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!257 = !{!258, !259}
!258 = !DISubrange(count: 8)
!259 = !DISubrange(count: 3)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !252, file: !6, line: 99, baseType: !144, size: 32, offset: 768)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !252, file: !6, line: 99, baseType: !144, size: 32, offset: 800)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !229, file: !6, line: 131, baseType: !263, size: 64, offset: 2176)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !265, line: 486, size: 1600, elements: !266)
!265 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!266 = !{!267, !268, !269, !270, !271, !272, !273, !274, !275}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !264, file: !265, line: 487, baseType: !158, size: 960)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !264, file: !265, line: 489, baseType: !213, size: 128, offset: 960)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !264, file: !265, line: 490, baseType: !213, size: 128, offset: 1088)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !264, file: !265, line: 491, baseType: !213, size: 128, offset: 1216)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !264, file: !265, line: 492, baseType: !213, size: 128, offset: 1344)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !264, file: !265, line: 494, baseType: !144, size: 32, offset: 1472)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !264, file: !265, line: 495, baseType: !144, size: 32, offset: 1504)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !264, file: !265, line: 497, baseType: !144, size: 32, offset: 1536)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !264, file: !265, line: 498, baseType: !144, size: 32, offset: 1568)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !229, file: !6, line: 132, baseType: !263, size: 64, offset: 2240)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !229, file: !6, line: 133, baseType: !278, size: 64, offset: 2304)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !265, line: 334, size: 1728, elements: !280)
!280 = !{!281, !282, !285, !286, !287, !288, !289, !290, !293, !294, !295, !296, !297, !298, !299, !319}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !279, file: !265, line: 335, baseType: !213, size: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !279, file: !265, line: 336, baseType: !283, size: 64, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !265, line: 47, flags: DIFlagFwdDecl)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !279, file: !265, line: 338, baseType: !190, size: 16, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !279, file: !265, line: 338, baseType: !190, size: 16, offset: 208)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !279, file: !265, line: 339, baseType: !7, size: 32, offset: 224)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !279, file: !265, line: 340, baseType: !144, size: 32, offset: 256)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !279, file: !265, line: 342, baseType: !256, size: 32, offset: 288)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !279, file: !265, line: 343, baseType: !291, size: 96, offset: 320)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 96, elements: !292)
!292 = !{!259}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !279, file: !265, line: 344, baseType: !291, size: 96, offset: 416)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !279, file: !265, line: 347, baseType: !213, size: 128, offset: 512)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !279, file: !265, line: 349, baseType: !144, size: 32, offset: 640)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !279, file: !265, line: 350, baseType: !144, size: 32, offset: 672)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !279, file: !265, line: 351, baseType: !131, size: 64, offset: 704)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !279, file: !265, line: 352, baseType: !131, size: 64, offset: 768)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !279, file: !265, line: 354, baseType: !300, size: 384, offset: 832)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !265, line: 116, baseType: !301)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !265, line: 94, size: 384, elements: !302)
!302 = !{!303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !301, file: !265, line: 96, baseType: !144, size: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !301, file: !265, line: 96, baseType: !144, size: 32, offset: 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !301, file: !265, line: 97, baseType: !144, size: 32, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !301, file: !265, line: 97, baseType: !144, size: 32, offset: 96)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !301, file: !265, line: 99, baseType: !190, size: 16, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !301, file: !265, line: 100, baseType: !190, size: 16, offset: 144)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !301, file: !265, line: 102, baseType: !190, size: 16, offset: 160)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !301, file: !265, line: 105, baseType: !190, size: 16, offset: 176)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !301, file: !265, line: 108, baseType: !190, size: 16, offset: 192)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !301, file: !265, line: 109, baseType: !190, size: 16, offset: 208)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !301, file: !265, line: 111, baseType: !190, size: 16, offset: 224)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !301, file: !265, line: 112, baseType: !190, size: 16, offset: 240)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !301, file: !265, line: 114, baseType: !144, size: 32, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !301, file: !265, line: 114, baseType: !144, size: 32, offset: 288)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !301, file: !265, line: 115, baseType: !144, size: 32, offset: 320)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !301, file: !265, line: 115, baseType: !144, size: 32, offset: 352)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !279, file: !265, line: 355, baseType: !149, size: 512, offset: 1216)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !229, file: !6, line: 134, baseType: !131, size: 64, offset: 2368)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !229, file: !6, line: 136, baseType: !322, size: 64, offset: 2432)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !6, line: 58, flags: DIFlagFwdDecl)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !229, file: !6, line: 138, baseType: !300, size: 384, offset: 2496)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !229, file: !6, line: 139, baseType: !326, size: 64, offset: 2880)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !265, line: 80, baseType: !328)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !265, line: 72, size: 192, elements: !329)
!329 = !{!330, !337, !338, !339, !340}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !328, file: !265, line: 73, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !265, line: 59, baseType: !333)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !265, line: 56, size: 128, elements: !334)
!334 = !{!335, !336}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !333, file: !265, line: 57, baseType: !291, size: 96)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !333, file: !265, line: 58, baseType: !144, size: 32, offset: 96)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !328, file: !265, line: 74, baseType: !144, size: 32, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !328, file: !265, line: 76, baseType: !144, size: 32, offset: 96)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !328, file: !265, line: 77, baseType: !144, size: 32, offset: 128)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !328, file: !265, line: 79, baseType: !144, size: 32, offset: 160)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !229, file: !6, line: 141, baseType: !213, size: 128, offset: 2944)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !229, file: !6, line: 142, baseType: !213, size: 128, offset: 3072)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !229, file: !6, line: 143, baseType: !213, size: 128, offset: 3200)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !229, file: !6, line: 144, baseType: !213, size: 128, offset: 3328)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !229, file: !6, line: 146, baseType: !144, size: 32, offset: 3456)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !229, file: !6, line: 147, baseType: !144, size: 32, offset: 3488)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !229, file: !6, line: 150, baseType: !348, size: 64, offset: 3520)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !351, line: 207, flags: DIFlagFwdDecl)
!351 = !DIFile(filename: "blender/source/blender/makesdna/DNA_dynamicpaint_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!352 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !229, file: !6, line: 151, baseType: !129, size: 64, offset: 3584)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !229, file: !6, line: 152, baseType: !144, size: 32, offset: 3648)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !229, file: !6, line: 153, baseType: !144, size: 32, offset: 3680)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !229, file: !6, line: 156, baseType: !291, size: 96, offset: 3712)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !229, file: !6, line: 156, baseType: !291, size: 96, offset: 3808)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !229, file: !6, line: 156, baseType: !291, size: 96, offset: 3904)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !229, file: !6, line: 157, baseType: !291, size: 96, offset: 4000)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !229, file: !6, line: 158, baseType: !291, size: 96, offset: 4096)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !229, file: !6, line: 159, baseType: !291, size: 96, offset: 4192)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !229, file: !6, line: 160, baseType: !291, size: 96, offset: 4288)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !229, file: !6, line: 160, baseType: !291, size: 96, offset: 4384)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !229, file: !6, line: 161, baseType: !364, size: 128, offset: 4480)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 128, elements: !365)
!365 = !{!366}
!366 = !DISubrange(count: 4)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !229, file: !6, line: 161, baseType: !364, size: 128, offset: 4608)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !229, file: !6, line: 162, baseType: !291, size: 96, offset: 4736)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !229, file: !6, line: 162, baseType: !291, size: 96, offset: 4832)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !229, file: !6, line: 163, baseType: !256, size: 32, offset: 4928)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !229, file: !6, line: 163, baseType: !256, size: 32, offset: 4960)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !229, file: !6, line: 164, baseType: !373, size: 512, offset: 4992)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 512, elements: !374)
!374 = !{!366, !366}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !229, file: !6, line: 165, baseType: !373, size: 512, offset: 5504)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !229, file: !6, line: 166, baseType: !373, size: 512, offset: 6016)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !229, file: !6, line: 167, baseType: !373, size: 512, offset: 6528)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !229, file: !6, line: 176, baseType: !373, size: 512, offset: 7040)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !229, file: !6, line: 178, baseType: !7, size: 32, offset: 7552)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !229, file: !6, line: 180, baseType: !190, size: 16, offset: 7584)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !229, file: !6, line: 181, baseType: !190, size: 16, offset: 7600)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !229, file: !6, line: 183, baseType: !190, size: 16, offset: 7616)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !229, file: !6, line: 183, baseType: !190, size: 16, offset: 7632)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !229, file: !6, line: 184, baseType: !190, size: 16, offset: 7648)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !229, file: !6, line: 184, baseType: !190, size: 16, offset: 7664)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !229, file: !6, line: 185, baseType: !190, size: 16, offset: 7680)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !229, file: !6, line: 186, baseType: !190, size: 16, offset: 7696)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !229, file: !6, line: 187, baseType: !190, size: 16, offset: 7712)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !229, file: !6, line: 188, baseType: !130, size: 8, offset: 7728)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !229, file: !6, line: 189, baseType: !130, size: 8, offset: 7736)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !229, file: !6, line: 192, baseType: !144, size: 32, offset: 7744)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !229, file: !6, line: 192, baseType: !144, size: 32, offset: 7776)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !229, file: !6, line: 192, baseType: !144, size: 32, offset: 7808)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !229, file: !6, line: 192, baseType: !144, size: 32, offset: 7840)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !229, file: !6, line: 194, baseType: !144, size: 32, offset: 7872)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !229, file: !6, line: 202, baseType: !256, size: 32, offset: 7904)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !229, file: !6, line: 202, baseType: !256, size: 32, offset: 7936)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !229, file: !6, line: 202, baseType: !256, size: 32, offset: 7968)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !229, file: !6, line: 211, baseType: !256, size: 32, offset: 8000)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !229, file: !6, line: 212, baseType: !256, size: 32, offset: 8032)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !229, file: !6, line: 213, baseType: !256, size: 32, offset: 8064)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !229, file: !6, line: 214, baseType: !256, size: 32, offset: 8096)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !229, file: !6, line: 215, baseType: !256, size: 32, offset: 8128)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !229, file: !6, line: 216, baseType: !256, size: 32, offset: 8160)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !229, file: !6, line: 219, baseType: !256, size: 32, offset: 8192)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !229, file: !6, line: 220, baseType: !256, size: 32, offset: 8224)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !229, file: !6, line: 221, baseType: !256, size: 32, offset: 8256)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !229, file: !6, line: 224, baseType: !409, size: 16, offset: 8288)
!409 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !229, file: !6, line: 224, baseType: !409, size: 16, offset: 8304)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !229, file: !6, line: 226, baseType: !190, size: 16, offset: 8320)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !229, file: !6, line: 228, baseType: !130, size: 8, offset: 8336)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !229, file: !6, line: 229, baseType: !130, size: 8, offset: 8344)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !229, file: !6, line: 231, baseType: !190, size: 16, offset: 8352)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !229, file: !6, line: 232, baseType: !130, size: 8, offset: 8368)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !229, file: !6, line: 233, baseType: !130, size: 8, offset: 8376)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !229, file: !6, line: 234, baseType: !256, size: 32, offset: 8384)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !229, file: !6, line: 235, baseType: !256, size: 32, offset: 8416)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !229, file: !6, line: 237, baseType: !213, size: 128, offset: 8448)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !229, file: !6, line: 238, baseType: !213, size: 128, offset: 8576)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !229, file: !6, line: 239, baseType: !213, size: 128, offset: 8704)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !229, file: !6, line: 240, baseType: !213, size: 128, offset: 8832)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !229, file: !6, line: 242, baseType: !256, size: 32, offset: 8960)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !229, file: !6, line: 244, baseType: !190, size: 16, offset: 8992)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !229, file: !6, line: 245, baseType: !409, size: 16, offset: 9008)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !229, file: !6, line: 246, baseType: !364, size: 128, offset: 9024)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !229, file: !6, line: 248, baseType: !144, size: 32, offset: 9152)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !229, file: !6, line: 249, baseType: !144, size: 32, offset: 9184)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !229, file: !6, line: 251, baseType: !430, size: 64, offset: 9216)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !432, line: 215, size: 960, elements: !433)
!432 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_force.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!433 = !{!434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !431, file: !432, line: 216, baseType: !144, size: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "linStiff", scope: !431, file: !432, line: 217, baseType: !256, size: 32, offset: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "angStiff", scope: !431, file: !432, line: 218, baseType: !256, size: 32, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !431, file: !432, line: 219, baseType: !256, size: 32, offset: 96)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "viterations", scope: !431, file: !432, line: 221, baseType: !144, size: 32, offset: 128)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "piterations", scope: !431, file: !432, line: 222, baseType: !144, size: 32, offset: 160)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "diterations", scope: !431, file: !432, line: 223, baseType: !144, size: 32, offset: 192)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "citerations", scope: !431, file: !432, line: 224, baseType: !144, size: 32, offset: 224)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "kSRHR_CL", scope: !431, file: !432, line: 226, baseType: !256, size: 32, offset: 256)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "kSKHR_CL", scope: !431, file: !432, line: 227, baseType: !256, size: 32, offset: 288)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "kSSHR_CL", scope: !431, file: !432, line: 228, baseType: !256, size: 32, offset: 320)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "kSR_SPLT_CL", scope: !431, file: !432, line: 229, baseType: !256, size: 32, offset: 352)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "kSK_SPLT_CL", scope: !431, file: !432, line: 231, baseType: !256, size: 32, offset: 384)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "kSS_SPLT_CL", scope: !431, file: !432, line: 232, baseType: !256, size: 32, offset: 416)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "kVCF", scope: !431, file: !432, line: 233, baseType: !256, size: 32, offset: 448)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "kDP", scope: !431, file: !432, line: 234, baseType: !256, size: 32, offset: 480)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "kDG", scope: !431, file: !432, line: 236, baseType: !256, size: 32, offset: 512)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "kLF", scope: !431, file: !432, line: 237, baseType: !256, size: 32, offset: 544)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "kPR", scope: !431, file: !432, line: 238, baseType: !256, size: 32, offset: 576)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "kVC", scope: !431, file: !432, line: 239, baseType: !256, size: 32, offset: 608)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "kDF", scope: !431, file: !432, line: 241, baseType: !256, size: 32, offset: 640)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "kMT", scope: !431, file: !432, line: 242, baseType: !256, size: 32, offset: 672)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "kCHR", scope: !431, file: !432, line: 243, baseType: !256, size: 32, offset: 704)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "kKHR", scope: !431, file: !432, line: 244, baseType: !256, size: 32, offset: 736)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "kSHR", scope: !431, file: !432, line: 246, baseType: !256, size: 32, offset: 768)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "kAHR", scope: !431, file: !432, line: 247, baseType: !256, size: 32, offset: 800)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "collisionflags", scope: !431, file: !432, line: 248, baseType: !144, size: 32, offset: 832)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "numclusteriterations", scope: !431, file: !432, line: 249, baseType: !144, size: 32, offset: 864)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "welding", scope: !431, file: !432, line: 250, baseType: !256, size: 32, offset: 896)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !431, file: !432, line: 251, baseType: !256, size: 32, offset: 928)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !229, file: !6, line: 253, baseType: !130, size: 8, offset: 9280)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !229, file: !6, line: 254, baseType: !130, size: 8, offset: 9288)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !229, file: !6, line: 255, baseType: !190, size: 16, offset: 9296)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !229, file: !6, line: 256, baseType: !291, size: 96, offset: 9312)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !229, file: !6, line: 258, baseType: !213, size: 128, offset: 9408)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !229, file: !6, line: 259, baseType: !213, size: 128, offset: 9536)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !229, file: !6, line: 260, baseType: !213, size: 128, offset: 9664)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !229, file: !6, line: 261, baseType: !213, size: 128, offset: 9792)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !229, file: !6, line: 263, baseType: !473, size: 64, offset: 9920)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !432, line: 61, size: 1280, elements: !475)
!475 = !{!476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !836, !839, !840, !841}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !474, file: !432, line: 62, baseType: !144, size: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "deflect", scope: !474, file: !432, line: 63, baseType: !190, size: 16, offset: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "forcefield", scope: !474, file: !432, line: 64, baseType: !190, size: 16, offset: 48)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "falloff", scope: !474, file: !432, line: 65, baseType: !190, size: 16, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !474, file: !432, line: 66, baseType: !190, size: 16, offset: 80)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "tex_mode", scope: !474, file: !432, line: 67, baseType: !190, size: 16, offset: 96)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "kink", scope: !474, file: !432, line: 68, baseType: !190, size: 16, offset: 112)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "kink_axis", scope: !474, file: !432, line: 68, baseType: !190, size: 16, offset: 128)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "zdir", scope: !474, file: !432, line: 69, baseType: !190, size: 16, offset: 144)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "f_strength", scope: !474, file: !432, line: 72, baseType: !256, size: 32, offset: 160)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "f_damp", scope: !474, file: !432, line: 73, baseType: !256, size: 32, offset: 192)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "f_flow", scope: !474, file: !432, line: 74, baseType: !256, size: 32, offset: 224)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "f_size", scope: !474, file: !432, line: 77, baseType: !256, size: 32, offset: 256)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "f_power", scope: !474, file: !432, line: 80, baseType: !256, size: 32, offset: 288)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "maxdist", scope: !474, file: !432, line: 81, baseType: !256, size: 32, offset: 320)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "mindist", scope: !474, file: !432, line: 82, baseType: !256, size: 32, offset: 352)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "f_power_r", scope: !474, file: !432, line: 83, baseType: !256, size: 32, offset: 384)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "maxrad", scope: !474, file: !432, line: 84, baseType: !256, size: 32, offset: 416)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "minrad", scope: !474, file: !432, line: 85, baseType: !256, size: 32, offset: 448)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_damp", scope: !474, file: !432, line: 88, baseType: !256, size: 32, offset: 480)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_rdamp", scope: !474, file: !432, line: 89, baseType: !256, size: 32, offset: 512)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_perm", scope: !474, file: !432, line: 90, baseType: !256, size: 32, offset: 544)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_frict", scope: !474, file: !432, line: 91, baseType: !256, size: 32, offset: 576)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_rfrict", scope: !474, file: !432, line: 92, baseType: !256, size: 32, offset: 608)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_stickness", scope: !474, file: !432, line: 93, baseType: !256, size: 32, offset: 640)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "absorption", scope: !474, file: !432, line: 95, baseType: !256, size: 32, offset: 672)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_sbdamp", scope: !474, file: !432, line: 98, baseType: !256, size: 32, offset: 704)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_sbift", scope: !474, file: !432, line: 99, baseType: !256, size: 32, offset: 736)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_sboft", scope: !474, file: !432, line: 100, baseType: !256, size: 32, offset: 768)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "clump_fac", scope: !474, file: !432, line: 103, baseType: !256, size: 32, offset: 800)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "clump_pow", scope: !474, file: !432, line: 103, baseType: !256, size: 32, offset: 832)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "kink_freq", scope: !474, file: !432, line: 104, baseType: !256, size: 32, offset: 864)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "kink_shape", scope: !474, file: !432, line: 104, baseType: !256, size: 32, offset: 896)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "kink_amp", scope: !474, file: !432, line: 104, baseType: !256, size: 32, offset: 928)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "free_end", scope: !474, file: !432, line: 104, baseType: !256, size: 32, offset: 960)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "tex_nabla", scope: !474, file: !432, line: 107, baseType: !256, size: 32, offset: 992)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !474, file: !432, line: 108, baseType: !513, size: 64, offset: 1024)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !226, line: 202, size: 3328, elements: !515)
!515 = !{!516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !585, !588, !589, !672, !698, !726, !727, !805, !826, !834, !835}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !514, file: !226, line: 203, baseType: !158, size: 960)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !514, file: !226, line: 204, baseType: !224, size: 64, offset: 960)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !514, file: !226, line: 206, baseType: !256, size: 32, offset: 1024)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !514, file: !226, line: 206, baseType: !256, size: 32, offset: 1056)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !514, file: !226, line: 207, baseType: !256, size: 32, offset: 1088)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !514, file: !226, line: 207, baseType: !256, size: 32, offset: 1120)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !514, file: !226, line: 207, baseType: !256, size: 32, offset: 1152)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !514, file: !226, line: 207, baseType: !256, size: 32, offset: 1184)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !514, file: !226, line: 207, baseType: !256, size: 32, offset: 1216)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !514, file: !226, line: 207, baseType: !256, size: 32, offset: 1248)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !514, file: !226, line: 208, baseType: !256, size: 32, offset: 1280)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !514, file: !226, line: 208, baseType: !256, size: 32, offset: 1312)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !514, file: !226, line: 211, baseType: !256, size: 32, offset: 1344)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !514, file: !226, line: 211, baseType: !256, size: 32, offset: 1376)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !514, file: !226, line: 211, baseType: !256, size: 32, offset: 1408)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !514, file: !226, line: 211, baseType: !256, size: 32, offset: 1440)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !514, file: !226, line: 211, baseType: !256, size: 32, offset: 1472)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !514, file: !226, line: 214, baseType: !256, size: 32, offset: 1504)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !514, file: !226, line: 214, baseType: !256, size: 32, offset: 1536)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !514, file: !226, line: 217, baseType: !256, size: 32, offset: 1568)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !514, file: !226, line: 218, baseType: !256, size: 32, offset: 1600)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !514, file: !226, line: 219, baseType: !256, size: 32, offset: 1632)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !514, file: !226, line: 220, baseType: !256, size: 32, offset: 1664)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !514, file: !226, line: 221, baseType: !256, size: 32, offset: 1696)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !514, file: !226, line: 222, baseType: !190, size: 16, offset: 1728)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !514, file: !226, line: 222, baseType: !190, size: 16, offset: 1744)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !514, file: !226, line: 224, baseType: !190, size: 16, offset: 1760)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !514, file: !226, line: 224, baseType: !190, size: 16, offset: 1776)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !514, file: !226, line: 227, baseType: !190, size: 16, offset: 1792)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !514, file: !226, line: 227, baseType: !190, size: 16, offset: 1808)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !514, file: !226, line: 229, baseType: !190, size: 16, offset: 1824)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !514, file: !226, line: 229, baseType: !190, size: 16, offset: 1840)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !514, file: !226, line: 230, baseType: !190, size: 16, offset: 1856)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !514, file: !226, line: 230, baseType: !190, size: 16, offset: 1872)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !514, file: !226, line: 232, baseType: !256, size: 32, offset: 1888)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !514, file: !226, line: 232, baseType: !256, size: 32, offset: 1920)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !514, file: !226, line: 232, baseType: !256, size: 32, offset: 1952)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !514, file: !226, line: 232, baseType: !256, size: 32, offset: 1984)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !514, file: !226, line: 233, baseType: !144, size: 32, offset: 2016)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !514, file: !226, line: 234, baseType: !144, size: 32, offset: 2048)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !514, file: !226, line: 235, baseType: !190, size: 16, offset: 2080)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !514, file: !226, line: 235, baseType: !190, size: 16, offset: 2096)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !514, file: !226, line: 236, baseType: !190, size: 16, offset: 2112)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !514, file: !226, line: 239, baseType: !190, size: 16, offset: 2128)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !514, file: !226, line: 240, baseType: !144, size: 32, offset: 2144)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !514, file: !226, line: 241, baseType: !144, size: 32, offset: 2176)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !514, file: !226, line: 241, baseType: !144, size: 32, offset: 2208)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !514, file: !226, line: 241, baseType: !144, size: 32, offset: 2240)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !514, file: !226, line: 243, baseType: !256, size: 32, offset: 2272)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !514, file: !226, line: 243, baseType: !256, size: 32, offset: 2304)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !514, file: !226, line: 244, baseType: !256, size: 32, offset: 2336)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !514, file: !226, line: 246, baseType: !568, size: 320, offset: 2368)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !569, line: 50, size: 320, elements: !570)
!569 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!570 = !{!571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !568, file: !569, line: 51, baseType: !153, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !568, file: !569, line: 53, baseType: !144, size: 32, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !568, file: !569, line: 54, baseType: !144, size: 32, offset: 96)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !568, file: !569, line: 55, baseType: !144, size: 32, offset: 128)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !568, file: !569, line: 55, baseType: !144, size: 32, offset: 160)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !568, file: !569, line: 56, baseType: !130, size: 8, offset: 192)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !568, file: !569, line: 56, baseType: !130, size: 8, offset: 200)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !568, file: !569, line: 57, baseType: !130, size: 8, offset: 208)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !568, file: !569, line: 57, baseType: !130, size: 8, offset: 216)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !568, file: !569, line: 59, baseType: !190, size: 16, offset: 224)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !568, file: !569, line: 59, baseType: !190, size: 16, offset: 240)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !568, file: !569, line: 59, baseType: !190, size: 16, offset: 256)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !568, file: !569, line: 61, baseType: !190, size: 16, offset: 272)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !568, file: !569, line: 63, baseType: !144, size: 32, offset: 288)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !514, file: !226, line: 248, baseType: !586, size: 64, offset: 2688)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !226, line: 248, flags: DIFlagFwdDecl)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !514, file: !226, line: 249, baseType: !248, size: 64, offset: 2752)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !514, file: !226, line: 250, baseType: !590, size: 64, offset: 2816)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !569, line: 77, size: 15424, elements: !592)
!592 = !{!593, !594, !595, !598, !601, !604, !607, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !626, !627, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !661, !662, !666}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !591, file: !569, line: 78, baseType: !158, size: 960)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !591, file: !569, line: 80, baseType: !177, size: 8192, offset: 960)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !591, file: !569, line: 82, baseType: !596, size: 64, offset: 9152)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !569, line: 43, flags: DIFlagFwdDecl)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !591, file: !569, line: 83, baseType: !599, size: 64, offset: 9216)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !159, line: 46, flags: DIFlagFwdDecl)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !591, file: !569, line: 86, baseType: !602, size: 64, offset: 9280)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !569, line: 41, flags: DIFlagFwdDecl)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !591, file: !569, line: 87, baseType: !605, size: 64, offset: 9344)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !569, line: 44, flags: DIFlagFwdDecl)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !591, file: !569, line: 89, baseType: !608, size: 512, offset: 9408)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !605, size: 512, elements: !609)
!609 = !{!258}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !591, file: !569, line: 90, baseType: !190, size: 16, offset: 9920)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !591, file: !569, line: 90, baseType: !190, size: 16, offset: 9936)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !591, file: !569, line: 92, baseType: !190, size: 16, offset: 9952)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !591, file: !569, line: 92, baseType: !190, size: 16, offset: 9968)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !591, file: !569, line: 93, baseType: !190, size: 16, offset: 9984)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !591, file: !569, line: 93, baseType: !190, size: 16, offset: 10000)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !591, file: !569, line: 94, baseType: !144, size: 32, offset: 10016)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !591, file: !569, line: 97, baseType: !190, size: 16, offset: 10048)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !591, file: !569, line: 97, baseType: !190, size: 16, offset: 10064)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !591, file: !569, line: 98, baseType: !190, size: 16, offset: 10080)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !591, file: !569, line: 98, baseType: !190, size: 16, offset: 10096)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !591, file: !569, line: 99, baseType: !190, size: 16, offset: 10112)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !591, file: !569, line: 99, baseType: !190, size: 16, offset: 10128)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !591, file: !569, line: 100, baseType: !7, size: 32, offset: 10144)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !591, file: !569, line: 101, baseType: !625, size: 64, offset: 10176)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !591, file: !569, line: 103, baseType: !183, size: 64, offset: 10240)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !591, file: !569, line: 104, baseType: !628, size: 64, offset: 10304)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !159, line: 159, size: 448, elements: !630)
!630 = !{!631, !635, !636, !638, !639, !641}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !629, file: !159, line: 161, baseType: !632, size: 64)
!632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !633)
!633 = !{!634}
!634 = !DISubrange(count: 2)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !629, file: !159, line: 162, baseType: !632, size: 64, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !629, file: !159, line: 163, baseType: !637, size: 32, offset: 128)
!637 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 32, elements: !633)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !629, file: !159, line: 164, baseType: !637, size: 32, offset: 160)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !629, file: !159, line: 165, baseType: !640, size: 128, offset: 192)
!640 = !DICompositeType(tag: DW_TAG_array_type, baseType: !625, size: 128, elements: !633)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !629, file: !159, line: 166, baseType: !642, size: 128, offset: 320)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !599, size: 128, elements: !633)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !591, file: !569, line: 107, baseType: !256, size: 32, offset: 10368)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !591, file: !569, line: 108, baseType: !144, size: 32, offset: 10400)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !591, file: !569, line: 109, baseType: !190, size: 16, offset: 10432)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !591, file: !569, line: 110, baseType: !190, size: 16, offset: 10448)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !591, file: !569, line: 113, baseType: !144, size: 32, offset: 10464)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !591, file: !569, line: 113, baseType: !144, size: 32, offset: 10496)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !591, file: !569, line: 114, baseType: !130, size: 8, offset: 10528)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !591, file: !569, line: 114, baseType: !130, size: 8, offset: 10536)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !591, file: !569, line: 115, baseType: !190, size: 16, offset: 10544)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !591, file: !569, line: 116, baseType: !364, size: 128, offset: 10560)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !591, file: !569, line: 119, baseType: !256, size: 32, offset: 10688)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !591, file: !569, line: 119, baseType: !256, size: 32, offset: 10720)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !591, file: !569, line: 122, baseType: !656, size: 512, offset: 10752)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !657, line: 182, baseType: !658)
!657 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !657, line: 180, size: 512, elements: !659)
!659 = !{!660}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !658, file: !657, line: 181, baseType: !149, size: 512)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !591, file: !569, line: 123, baseType: !130, size: 8, offset: 11264)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !591, file: !569, line: 125, baseType: !663, size: 56, offset: 11272)
!663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 56, elements: !664)
!664 = !{!665}
!665 = !DISubrange(count: 7)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !591, file: !569, line: 126, baseType: !667, size: 4096, offset: 11328)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !668, size: 4096, elements: !609)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !569, line: 69, baseType: !669)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !569, line: 67, size: 512, elements: !670)
!670 = !{!671}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !669, file: !569, line: 68, baseType: !149, size: 512)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "coba", scope: !514, file: !226, line: 251, baseType: !673, size: 64, offset: 2880)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !226, line: 113, size: 6208, elements: !675)
!675 = !{!676, !677, !678, !679, !680, !681, !685}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !674, file: !226, line: 114, baseType: !190, size: 16)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !674, file: !226, line: 114, baseType: !190, size: 16, offset: 16)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !674, file: !226, line: 115, baseType: !130, size: 8, offset: 32)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !674, file: !226, line: 115, baseType: !130, size: 8, offset: 40)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !674, file: !226, line: 116, baseType: !130, size: 8, offset: 48)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !674, file: !226, line: 117, baseType: !682, size: 8, offset: 56)
!682 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 8, elements: !683)
!683 = !{!684}
!684 = !DISubrange(count: 1)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !674, file: !226, line: 119, baseType: !686, size: 6144, offset: 64)
!686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !687, size: 6144, elements: !696)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !226, line: 109, baseType: !688)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !226, line: 106, size: 192, elements: !689)
!689 = !{!690, !691, !692, !693, !694, !695}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !688, file: !226, line: 107, baseType: !256, size: 32)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !688, file: !226, line: 107, baseType: !256, size: 32, offset: 32)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !688, file: !226, line: 107, baseType: !256, size: 32, offset: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !688, file: !226, line: 107, baseType: !256, size: 32, offset: 96)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !688, file: !226, line: 107, baseType: !256, size: 32, offset: 128)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !688, file: !226, line: 108, baseType: !144, size: 32, offset: 160)
!696 = !{!697}
!697 = !DISubrange(count: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !514, file: !226, line: 252, baseType: !699, size: 64, offset: 2944)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EnvMap", file: !226, line: 122, size: 1600, elements: !701)
!701 = !{!702, !703, !704, !710, !711, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !700, file: !226, line: 123, baseType: !228, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !700, file: !226, line: 124, baseType: !590, size: 64, offset: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "cube", scope: !700, file: !226, line: 125, baseType: !705, size: 384, offset: 128)
!705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !706, size: 384, elements: !708)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !657, line: 136, flags: DIFlagFwdDecl)
!708 = !{!709}
!709 = !DISubrange(count: 6)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !700, file: !226, line: 126, baseType: !373, size: 512, offset: 512)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "obimat", scope: !700, file: !226, line: 127, baseType: !712, size: 288, offset: 1024)
!712 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 288, elements: !713)
!713 = !{!259, !259}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !700, file: !226, line: 128, baseType: !190, size: 16, offset: 1312)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !700, file: !226, line: 128, baseType: !190, size: 16, offset: 1328)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "clipsta", scope: !700, file: !226, line: 129, baseType: !256, size: 32, offset: 1344)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "clipend", scope: !700, file: !226, line: 129, baseType: !256, size: 32, offset: 1376)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "viewscale", scope: !700, file: !226, line: 130, baseType: !256, size: 32, offset: 1408)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "notlay", scope: !700, file: !226, line: 131, baseType: !7, size: 32, offset: 1440)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "cuberes", scope: !700, file: !226, line: 132, baseType: !190, size: 16, offset: 1472)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !700, file: !226, line: 132, baseType: !190, size: 16, offset: 1488)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !700, file: !226, line: 133, baseType: !144, size: 32, offset: 1504)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !700, file: !226, line: 133, baseType: !144, size: 32, offset: 1536)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !700, file: !226, line: 134, baseType: !190, size: 16, offset: 1568)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !700, file: !226, line: 134, baseType: !190, size: 16, offset: 1584)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !514, file: !226, line: 253, baseType: !628, size: 64, offset: 3008)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !514, file: !226, line: 254, baseType: !728, size: 64, offset: 3072)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointDensity", file: !226, line: 137, size: 832, elements: !730)
!730 = !{!731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !746, !747, !748, !749, !750, !752, !753, !754, !755, !756, !757}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !729, file: !226, line: 138, baseType: !190, size: 16)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_type", scope: !729, file: !226, line: 140, baseType: !190, size: 16, offset: 16)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_softness", scope: !729, file: !226, line: 141, baseType: !256, size: 32, offset: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !729, file: !226, line: 142, baseType: !256, size: 32, offset: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !729, file: !226, line: 143, baseType: !190, size: 16, offset: 96)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "color_source", scope: !729, file: !226, line: 144, baseType: !190, size: 16, offset: 112)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "totpoints", scope: !729, file: !226, line: 145, baseType: !144, size: 32, offset: 128)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "pdpad", scope: !729, file: !226, line: 147, baseType: !144, size: 32, offset: 160)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !729, file: !226, line: 149, baseType: !228, size: 64, offset: 192)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "psys", scope: !729, file: !226, line: 150, baseType: !144, size: 32, offset: 256)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "psys_cache_space", scope: !729, file: !226, line: 151, baseType: !190, size: 16, offset: 288)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "ob_cache_space", scope: !729, file: !226, line: 152, baseType: !190, size: 16, offset: 304)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "point_tree", scope: !729, file: !226, line: 154, baseType: !131, size: 64, offset: 320)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "point_data", scope: !729, file: !226, line: 155, baseType: !745, size: 64, offset: 384)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "noise_size", scope: !729, file: !226, line: 157, baseType: !256, size: 32, offset: 448)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "noise_depth", scope: !729, file: !226, line: 158, baseType: !190, size: 16, offset: 480)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "noise_influence", scope: !729, file: !226, line: 159, baseType: !190, size: 16, offset: 496)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "noise_basis", scope: !729, file: !226, line: 160, baseType: !190, size: 16, offset: 512)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "pdpad3", scope: !729, file: !226, line: 161, baseType: !751, size: 48, offset: 528)
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 48, elements: !292)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "noise_fac", scope: !729, file: !226, line: 162, baseType: !256, size: 32, offset: 576)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "speed_scale", scope: !729, file: !226, line: 164, baseType: !256, size: 32, offset: 608)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_speed_scale", scope: !729, file: !226, line: 164, baseType: !256, size: 32, offset: 640)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "pdpad2", scope: !729, file: !226, line: 164, baseType: !256, size: 32, offset: 672)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "coba", scope: !729, file: !226, line: 165, baseType: !673, size: 64, offset: 704)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "falloff_curve", scope: !729, file: !226, line: 167, baseType: !758, size: 64, offset: 768)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapping", file: !657, line: 72, size: 3072, elements: !760)
!760 = !{!761, !762, !763, !764, !765, !774, !775, !801, !802, !803, !804}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !759, file: !657, line: 73, baseType: !144, size: 32)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !759, file: !657, line: 73, baseType: !144, size: 32, offset: 32)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "preset", scope: !759, file: !657, line: 74, baseType: !144, size: 32, offset: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !759, file: !657, line: 75, baseType: !144, size: 32, offset: 96)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !759, file: !657, line: 77, baseType: !766, size: 128, offset: 128)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !767, line: 95, baseType: !768)
!767 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !767, line: 92, size: 128, elements: !769)
!769 = !{!770, !771, !772, !773}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !768, file: !767, line: 93, baseType: !256, size: 32)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !768, file: !767, line: 93, baseType: !256, size: 32, offset: 32)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !768, file: !767, line: 94, baseType: !256, size: 32, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !768, file: !767, line: 94, baseType: !256, size: 32, offset: 96)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "clipr", scope: !759, file: !657, line: 77, baseType: !766, size: 128, offset: 256)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "cm", scope: !759, file: !657, line: 79, baseType: !776, size: 2304, offset: 384)
!776 = !DICompositeType(tag: DW_TAG_array_type, baseType: !777, size: 2304, elements: !365)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMap", file: !657, line: 67, baseType: !778)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMap", file: !657, line: 55, size: 576, elements: !779)
!779 = !{!780, !781, !782, !783, !784, !785, !787, !788, !797, !798, !799, !800}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "totpoint", scope: !778, file: !657, line: 56, baseType: !190, size: 16)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !778, file: !657, line: 56, baseType: !190, size: 16, offset: 16)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !778, file: !657, line: 58, baseType: !256, size: 32, offset: 32)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "mintable", scope: !778, file: !657, line: 59, baseType: !256, size: 32, offset: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "maxtable", scope: !778, file: !657, line: 59, baseType: !256, size: 32, offset: 96)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "ext_in", scope: !778, file: !657, line: 60, baseType: !786, size: 64, offset: 128)
!786 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 64, elements: !633)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "ext_out", scope: !778, file: !657, line: 60, baseType: !786, size: 64, offset: 192)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !778, file: !657, line: 61, baseType: !789, size: 64, offset: 256)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "CurveMapPoint", file: !657, line: 47, baseType: !791)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveMapPoint", file: !657, line: 44, size: 96, elements: !792)
!792 = !{!793, !794, !795, !796}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !791, file: !657, line: 45, baseType: !256, size: 32)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !791, file: !657, line: 45, baseType: !256, size: 32, offset: 32)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !791, file: !657, line: 46, baseType: !190, size: 16, offset: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "shorty", scope: !791, file: !657, line: 46, baseType: !190, size: 16, offset: 80)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !778, file: !657, line: 62, baseType: !789, size: 64, offset: 320)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "premultable", scope: !778, file: !657, line: 64, baseType: !789, size: 64, offset: 384)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_in", scope: !778, file: !657, line: 65, baseType: !786, size: 64, offset: 448)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "premul_ext_out", scope: !778, file: !657, line: 66, baseType: !786, size: 64, offset: 512)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "black", scope: !759, file: !657, line: 80, baseType: !291, size: 96, offset: 2688)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "white", scope: !759, file: !657, line: 80, baseType: !291, size: 96, offset: 2784)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "bwmul", scope: !759, file: !657, line: 81, baseType: !291, size: 96, offset: 2880)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "sample", scope: !759, file: !657, line: 83, baseType: !291, size: 96, offset: 2976)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "vd", scope: !514, file: !226, line: 255, baseType: !806, size: 64, offset: 3136)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VoxelData", file: !226, line: 170, size: 8704, elements: !808)
!808 = !{!809, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "resol", scope: !807, file: !226, line: 171, baseType: !810, size: 96)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 96, elements: !292)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "interp_type", scope: !807, file: !226, line: 172, baseType: !144, size: 32, offset: 96)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "file_format", scope: !807, file: !226, line: 173, baseType: !190, size: 16, offset: 128)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !807, file: !226, line: 174, baseType: !190, size: 16, offset: 144)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !807, file: !226, line: 175, baseType: !190, size: 16, offset: 160)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "smoked_type", scope: !807, file: !226, line: 176, baseType: !190, size: 16, offset: 176)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !807, file: !226, line: 177, baseType: !190, size: 16, offset: 192)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !807, file: !226, line: 178, baseType: !190, size: 16, offset: 208)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !807, file: !226, line: 179, baseType: !144, size: 32, offset: 224)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !807, file: !226, line: 181, baseType: !228, size: 64, offset: 256)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "int_multiplier", scope: !807, file: !226, line: 182, baseType: !256, size: 32, offset: 320)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "still_frame", scope: !807, file: !226, line: 183, baseType: !144, size: 32, offset: 352)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "source_path", scope: !807, file: !226, line: 184, baseType: !177, size: 8192, offset: 384)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "dataset", scope: !807, file: !226, line: 187, baseType: !745, size: 64, offset: 8576)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "cachedframe", scope: !807, file: !226, line: 188, baseType: !144, size: 32, offset: 8640)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !807, file: !226, line: 189, baseType: !144, size: 32, offset: 8672)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "ot", scope: !514, file: !226, line: 256, baseType: !827, size: 64, offset: 3200)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "OceanTex", file: !226, line: 193, size: 640, elements: !829)
!829 = !{!830, !831, !832, !833}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !828, file: !226, line: 194, baseType: !228, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "oceanmod", scope: !828, file: !226, line: 195, baseType: !149, size: 512, offset: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !828, file: !226, line: 197, baseType: !144, size: 32, offset: 576)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !828, file: !226, line: 198, baseType: !144, size: 32, offset: 608)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !514, file: !226, line: 258, baseType: !130, size: 8, offset: 3264)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !514, file: !226, line: 259, baseType: !663, size: 56, offset: 3272)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "rng", scope: !474, file: !432, line: 111, baseType: !837, size: 64, offset: 1088)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DICompositeType(tag: DW_TAG_structure_type, name: "RNG", file: !432, line: 111, flags: DIFlagFwdDecl)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "f_noise", scope: !474, file: !432, line: 112, baseType: !256, size: 32, offset: 1152)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "seed", scope: !474, file: !432, line: 113, baseType: !144, size: 32, offset: 1184)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "f_source", scope: !474, file: !432, line: 115, baseType: !228, size: 64, offset: 1216)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !229, file: !6, line: 264, baseType: !843, size: 64, offset: 9984)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !432, line: 268, size: 3776, elements: !845)
!845 = !{!846, !847, !848, !876, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !928, !929, !930, !1613, !1614, !1615, !1616, !1617, !1618}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "totpoint", scope: !844, file: !432, line: 270, baseType: !144, size: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "totspring", scope: !844, file: !432, line: 270, baseType: !144, size: 32, offset: 32)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "bpoint", scope: !844, file: !432, line: 271, baseType: !849, size: 64, offset: 64)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BodyPoint", file: !851, line: 38, size: 1536, elements: !852)
!851 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_softbody.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!852 = !{!853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !869, !870, !871, !872, !873, !874, !875}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "origS", scope: !850, file: !851, line: 39, baseType: !291, size: 96)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "origE", scope: !850, file: !851, line: 39, baseType: !291, size: 96, offset: 96)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "origT", scope: !850, file: !851, line: 39, baseType: !291, size: 96, offset: 192)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !850, file: !851, line: 39, baseType: !291, size: 96, offset: 288)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !850, file: !851, line: 39, baseType: !291, size: 96, offset: 384)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "force", scope: !850, file: !851, line: 39, baseType: !291, size: 96, offset: 480)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "goal", scope: !850, file: !851, line: 40, baseType: !256, size: 32, offset: 576)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "prevpos", scope: !850, file: !851, line: 41, baseType: !291, size: 96, offset: 608)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "prevvec", scope: !850, file: !851, line: 41, baseType: !291, size: 96, offset: 704)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "prevdx", scope: !850, file: !851, line: 41, baseType: !291, size: 96, offset: 800)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "prevdv", scope: !850, file: !851, line: 41, baseType: !291, size: 96, offset: 896)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "impdv", scope: !850, file: !851, line: 42, baseType: !291, size: 96, offset: 992)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "impdx", scope: !850, file: !851, line: 42, baseType: !291, size: 96, offset: 1088)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "nofsprings", scope: !850, file: !851, line: 43, baseType: !144, size: 32, offset: 1184)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "springs", scope: !850, file: !851, line: 43, baseType: !868, size: 64, offset: 1216)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "choke", scope: !850, file: !851, line: 44, baseType: !256, size: 32, offset: 1280)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "choke2", scope: !850, file: !851, line: 44, baseType: !256, size: 32, offset: 1312)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "frozen", scope: !850, file: !851, line: 44, baseType: !256, size: 32, offset: 1344)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "colball", scope: !850, file: !851, line: 45, baseType: !256, size: 32, offset: 1376)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "loc_flag", scope: !850, file: !851, line: 46, baseType: !190, size: 16, offset: 1408)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !850, file: !851, line: 48, baseType: !256, size: 32, offset: 1440)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "springweight", scope: !850, file: !851, line: 49, baseType: !256, size: 32, offset: 1472)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "bspring", scope: !844, file: !432, line: 272, baseType: !877, size: 64, offset: 128)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DICompositeType(tag: DW_TAG_structure_type, name: "BodySpring", file: !432, line: 272, flags: DIFlagFwdDecl)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !844, file: !432, line: 273, baseType: !130, size: 8, offset: 192)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "msg_lock", scope: !844, file: !432, line: 274, baseType: !130, size: 8, offset: 200)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "msg_value", scope: !844, file: !432, line: 275, baseType: !190, size: 16, offset: 208)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "nodemass", scope: !844, file: !432, line: 280, baseType: !256, size: 32, offset: 224)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "namedVG_Mass", scope: !844, file: !432, line: 281, baseType: !149, size: 512, offset: 256)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "grav", scope: !844, file: !432, line: 285, baseType: !256, size: 32, offset: 768)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "mediafrict", scope: !844, file: !432, line: 286, baseType: !256, size: 32, offset: 800)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "rklimit", scope: !844, file: !432, line: 287, baseType: !256, size: 32, offset: 832)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "physics_speed", scope: !844, file: !432, line: 288, baseType: !256, size: 32, offset: 864)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "goalspring", scope: !844, file: !432, line: 291, baseType: !256, size: 32, offset: 896)
