; ModuleID = 'blender/source/blender/blenkernel/intern/bvhutils.c'
source_filename = "blender/source/blender/blenkernel/intern/bvhutils.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BVHTreeRay = type { [3 x float], [3 x float], float }
%struct.BVHTree = type opaque
%struct.BVHTreeFromMesh = type { %struct.BVHTree*, void (i8*, i32, float*, %struct.BVHTreeNearest*)*, void (i8*, i32, %struct.BVHTreeRay*, %struct.BVHTreeRayHit*)*, %struct.MVert*, %struct.MEdge*, %struct.MFace*, i8, i8, i8, float, i8*, i8 }
%struct.BVHTreeNearest = type { i32, [3 x float], [3 x float], float, i32 }
%struct.BVHTreeRayHit = type { i32, [3 x float], [3 x float], float, i32 }
%struct.MVert = type { [3 x float], [3 x i16], i8, i8 }
%struct.MEdge = type { i32, i32, i8, i8, i16 }
%struct.MFace = type { i32, i32, i32, i32, i16, i8, i8 }

!30 = !DIEnumerator(name: "DM_DRAW_ALWAYS_SMOOTH", value: 2, isUnsigned: true)
!31 = !DIEnumerator(name: "DM_DRAW_USE_ACTIVE_UV", value: 4, isUnsigned: true)
!32 = !DIEnumerator(name: "DM_DRAW_USE_TEXPAINT_UV", value: 8, isUnsigned: true)
!33 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotType", file: !34, line: 94, baseType: !7, size: 32, elements: !35)
!34 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_operator_api.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!35 = !{!36, !37, !38, !39, !40, !41, !42, !43}
!36 = !DIEnumerator(name: "BMO_OP_SLOT_BOOL", value: 1, isUnsigned: true)
!37 = !DIEnumerator(name: "BMO_OP_SLOT_INT", value: 2, isUnsigned: true)
!38 = !DIEnumerator(name: "BMO_OP_SLOT_FLT", value: 3, isUnsigned: true)
!39 = !DIEnumerator(name: "BMO_OP_SLOT_PTR", value: 4, isUnsigned: true)
!40 = !DIEnumerator(name: "BMO_OP_SLOT_MAT", value: 5, isUnsigned: true)
!41 = !DIEnumerator(name: "BMO_OP_SLOT_VEC", value: 8, isUnsigned: true)
!42 = !DIEnumerator(name: "BMO_OP_SLOT_ELEMENT_BUF", value: 9, isUnsigned: true)
!43 = !DIEnumerator(name: "BMO_OP_SLOT_MAPPING", value: 10, isUnsigned: true)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Elem", file: !34, line: 116, baseType: !7, size: 32, elements: !45)
!45 = !{!46, !47, !48, !49}
!46 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_VERT", value: 1, isUnsigned: true)
!47 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_EDGE", value: 2, isUnsigned: true)
!48 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_FACE", value: 8, isUnsigned: true)
!49 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_IS_SINGLE", value: 16, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Ptr", file: !34, line: 131, baseType: !7, size: 32, elements: !51)
!51 = !{!52, !53, !54, !55}
!52 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_BMESH", value: 100, isUnsigned: true)
!53 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_SCENE", value: 101, isUnsigned: true)
!54 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_OBJECT", value: 102, isUnsigned: true)
!55 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_MESH", value: 103, isUnsigned: true)
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Map", file: !34, line: 123, baseType: !7, size: 32, elements: !57)
!57 = !{!58, !59, !60, !61, !62, !63}
!58 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_EMPTY", value: 64, isUnsigned: true)
!59 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_ELEM", value: 65, isUnsigned: true)
!60 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_FLT", value: 66, isUnsigned: true)
!61 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INT", value: 67, isUnsigned: true)
!62 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_BOOL", value: 68, isUnsigned: true)
!63 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INTERNAL", value: 69, isUnsigned: true)
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !34, line: 182, baseType: !7, size: 32, elements: !65)
!65 = !{!66, !67, !68, !69, !70}
!66 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NOP", value: 0, isUnsigned: true)
!67 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_UNTAN_MULTIRES", value: 1, isUnsigned: true)
!68 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NORMALS_CALC", value: 2, isUnsigned: true)
!69 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_FLUSH", value: 4, isUnsigned: true)
!70 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!71 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !72, line: 260, baseType: !7, size: 32, elements: !73)
!72 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!73 = !{!74, !75, !76, !77, !78, !79, !80}
!74 = !DIEnumerator(name: "BM_ELEM_SELECT", value: 1, isUnsigned: true)
!75 = !DIEnumerator(name: "BM_ELEM_HIDDEN", value: 2, isUnsigned: true)
!76 = !DIEnumerator(name: "BM_ELEM_SEAM", value: 4, isUnsigned: true)
!77 = !DIEnumerator(name: "BM_ELEM_SMOOTH", value: 8, isUnsigned: true)
!78 = !DIEnumerator(name: "BM_ELEM_TAG", value: 16, isUnsigned: true)
!79 = !DIEnumerator(name: "BM_ELEM_DRAW", value: 32, isUnsigned: true)
!80 = !DIEnumerator(name: "BM_ELEM_INTERNAL_TAG", value: 128, isUnsigned: true)
!81 = !{!82, !83, !88, !179, !239}
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "LinkNodeFreeFP", file: !84, line: 41, baseType: !85)
!84 = !DIFile(filename: "blender/source/blender/blenlib/BLI_linklist.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DISubroutineType(types: !87)
!87 = !{null, !82}
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHTreeFromMesh", file: !90, line: 69, baseType: !91)
!90 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BVHTreeFromMesh", file: !90, line: 47, size: 576, elements: !92)
!92 = !{!93, !97, !118, !140, !152, !161, !172, !174, !175, !176, !177, !178}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "tree", scope: !91, file: !90, line: 48, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "BVHTree", file: !96, line: 42, flags: DIFlagFwdDecl)
!96 = !DIFile(filename: "blender/source/blender/blenlib/BLI_kdopbvh.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!97 = !DIDerivedType(tag: DW_TAG_member, name: "nearest_callback", scope: !91, file: !90, line: 51, baseType: !98, size: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHTree_NearestPointCallback", file: !96, line: 76, baseType: !99)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{null, !82, !102, !103, !106}
!102 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!105 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHTreeNearest", file: !96, line: 59, baseType: !108)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BVHTreeNearest", file: !96, line: 53, size: 288, elements: !109)
!109 = !{!110, !111, !115, !116, !117}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !108, file: !96, line: 54, baseType: !102, size: 32)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !108, file: !96, line: 55, baseType: !112, size: 96, offset: 32)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 96, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 3)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !108, file: !96, line: 56, baseType: !112, size: 96, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "dist_sq", scope: !108, file: !96, line: 57, baseType: !105, size: 32, offset: 224)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !108, file: !96, line: 58, baseType: !102, size: 32, offset: 256)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "raycast_callback", scope: !91, file: !90, line: 52, baseType: !119, size: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHTree_RayCastCallback", file: !96, line: 79, baseType: !120)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{null, !82, !102, !123, !131}
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHTreeRay", file: !96, line: 65, baseType: !126)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BVHTreeRay", file: !96, line: 61, size: 224, elements: !127)
!127 = !{!128, !129, !130}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !126, file: !96, line: 62, baseType: !112, size: 96)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !126, file: !96, line: 63, baseType: !112, size: 96, offset: 96)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !126, file: !96, line: 64, baseType: !105, size: 32, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHTreeRayHit", file: !96, line: 73, baseType: !133)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BVHTreeRayHit", file: !96, line: 67, size: 288, elements: !134)
!134 = !{!135, !136, !137, !138, !139}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !133, file: !96, line: 68, baseType: !102, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !133, file: !96, line: 69, baseType: !112, size: 96, offset: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !133, file: !96, line: 70, baseType: !112, size: 96, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !133, file: !96, line: 71, baseType: !105, size: 32, offset: 224)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !133, file: !96, line: 72, baseType: !102, size: 32, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "vert", scope: !91, file: !90, line: 55, baseType: !141, size: 64, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !143, line: 65, size: 160, elements: !144)
!143 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!144 = !{!145, !146, !149, !151}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !142, file: !143, line: 66, baseType: !112, size: 96)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !142, file: !143, line: 67, baseType: !147, size: 48, offset: 96)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 48, elements: !113)
!148 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !142, file: !143, line: 68, baseType: !150, size: 8, offset: 144)
!150 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !142, file: !143, line: 68, baseType: !150, size: 8, offset: 152)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "edge", scope: !91, file: !90, line: 56, baseType: !153, size: 64, offset: 256)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !143, line: 48, size: 96, elements: !155)
!155 = !{!156, !157, !158, !159, !160}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !154, file: !143, line: 49, baseType: !7, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !154, file: !143, line: 49, baseType: !7, size: 32, offset: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !154, file: !143, line: 50, baseType: !150, size: 8, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !154, file: !143, line: 50, baseType: !150, size: 8, offset: 72)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !154, file: !143, line: 51, baseType: !148, size: 16, offset: 80)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "face", scope: !91, file: !90, line: 57, baseType: !162, size: 64, offset: 320)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !143, line: 42, size: 160, elements: !164)
!164 = !{!165, !166, !167, !168, !169, !170, !171}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !163, file: !143, line: 43, baseType: !7, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !163, file: !143, line: 43, baseType: !7, size: 32, offset: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !163, file: !143, line: 43, baseType: !7, size: 32, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !163, file: !143, line: 43, baseType: !7, size: 32, offset: 96)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !163, file: !143, line: 44, baseType: !148, size: 16, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !163, file: !143, line: 45, baseType: !150, size: 8, offset: 144)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !163, file: !143, line: 45, baseType: !150, size: 8, offset: 152)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "vert_allocated", scope: !91, file: !90, line: 58, baseType: !173, size: 8, offset: 384)
!173 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "face_allocated", scope: !91, file: !90, line: 59, baseType: !173, size: 8, offset: 392)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "edge_allocated", scope: !91, file: !90, line: 60, baseType: !173, size: 8, offset: 400)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "sphere_radius", scope: !91, file: !90, line: 63, baseType: !105, size: 32, offset: 416)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "em_evil", scope: !91, file: !90, line: 66, baseType: !82, size: 64, offset: 448)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "cached", scope: !91, file: !90, line: 67, baseType: !173, size: 8, offset: 512)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !72, line: 140, baseType: !183)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !72, line: 125, size: 576, elements: !184)
!184 = !{!185, !194, !223, !224, !235, !236, !237, !238}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !183, file: !72, line: 126, baseType: !186, size: 128)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !72, line: 82, baseType: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !72, line: 64, size: 128, elements: !188)
!188 = !{!189, !190, !191, !192, !193}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !187, file: !72, line: 65, baseType: !82, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !187, file: !72, line: 66, baseType: !102, size: 32, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !187, file: !72, line: 73, baseType: !150, size: 8, offset: 96)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !187, file: !72, line: 74, baseType: !150, size: 8, offset: 104)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !187, file: !72, line: 80, baseType: !150, size: 8, offset: 112)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !183, file: !72, line: 129, baseType: !195, size: 64, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !72, line: 90, size: 448, elements: !197)
!197 = !{!198, !199, !204, !205, !206}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !196, file: !72, line: 91, baseType: !186, size: 128)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !196, file: !72, line: 92, baseType: !200, size: 64, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !72, line: 180, size: 16, elements: !202)
!202 = !{!203}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !201, file: !72, line: 181, baseType: !148, size: 16)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !196, file: !72, line: 94, baseType: !112, size: 96, offset: 192)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !196, file: !72, line: 95, baseType: !112, size: 96, offset: 288)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !196, file: !72, line: 102, baseType: !207, size: 64, offset: 384)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !72, line: 110, size: 640, elements: !209)
!209 = !{!210, !211, !212, !213, !214, !216, !222}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !208, file: !72, line: 111, baseType: !186, size: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !208, file: !72, line: 112, baseType: !200, size: 64, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !208, file: !72, line: 114, baseType: !195, size: 64, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !208, file: !72, line: 114, baseType: !195, size: 64, offset: 256)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !208, file: !72, line: 118, baseType: !215, size: 64, offset: 320)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !208, file: !72, line: 122, baseType: !217, size: 128, offset: 384)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !72, line: 108, baseType: !218)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !72, line: 106, size: 128, elements: !219)
!219 = !{!220, !221}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !218, file: !72, line: 107, baseType: !207, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !218, file: !72, line: 107, baseType: !207, size: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !208, file: !72, line: 122, baseType: !217, size: 128, offset: 512)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !183, file: !72, line: 130, baseType: !207, size: 64, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !183, file: !72, line: 131, baseType: !225, size: 64, offset: 256)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !72, line: 164, size: 448, elements: !227)
!227 = !{!228, !229, !230, !232, !233, !234}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !226, file: !72, line: 165, baseType: !186, size: 128)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !226, file: !72, line: 166, baseType: !200, size: 64, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !226, file: !72, line: 172, baseType: !231, size: 64, offset: 192)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !226, file: !72, line: 174, baseType: !102, size: 32, offset: 256)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !226, file: !72, line: 175, baseType: !112, size: 96, offset: 288)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !226, file: !72, line: 176, baseType: !148, size: 16, offset: 384)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !183, file: !72, line: 135, baseType: !215, size: 64, offset: 320)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !183, file: !72, line: 135, baseType: !215, size: 64, offset: 384)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !183, file: !72, line: 139, baseType: !215, size: 64, offset: 448)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !183, file: !72, line: 139, baseType: !215, size: 64, offset: 512)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCacheItem", file: !3, line: 594, baseType: !241)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BVHCacheItem", file: !3, line: 590, size: 128, elements: !242)
!242 = !{!243, !244}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !241, file: !3, line: 591, baseType: !102, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "tree", scope: !241, file: !3, line: 592, baseType: !245, size: 64, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHTree", file: !96, line: 43, baseType: !95)
!247 = !{!0}
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThreadRWMutex", file: !249, line: 148, baseType: !250)
!249 = !DIFile(filename: "blender/source/blender/blenlib/BLI_threads.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "spec_null_rwlock_t", file: !251, line: 10, baseType: !252)
!251 = !DIFile(filename: "include/spec_pthread.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !253, line: 26, baseType: !254)
!253 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !255, line: 42, baseType: !7)
!255 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!256 = !{i32 7, !"Dwarf Version", i32 4}
!257 = !{i32 2, !"Debug Info Version", i32 3}
!258 = !{i32 1, !"wchar_size", i32 4}
!259 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!260 = distinct !DISubprogram(name: "bvhtree_ray_tri_intersection", scope: !3, file: !3, line: 53, type: !261, scopeLine: 54, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !263)
!261 = !DISubroutineType(types: !262)
!262 = !{!105, !123, !104, !103, !103, !103}
!263 = !{}
!264 = !DILocalVariable(name: "ray", arg: 1, scope: !260, file: !3, line: 53, type: !123)
!265 = !DILocation(line: 53, column: 54, scope: !260)
!266 = !DILocalVariable(name: "UNUSED_m_dist", arg: 2, scope: !260, file: !3, line: 53, type: !104)
!267 = !DILocation(line: 53, column: 71, scope: !260)
!268 = !DILocalVariable(name: "v0", arg: 3, scope: !260, file: !3, line: 53, type: !103)
!269 = !DILocation(line: 53, column: 99, scope: !260)
!270 = !DILocalVariable(name: "v1", arg: 4, scope: !260, file: !3, line: 53, type: !103)
!271 = !DILocation(line: 53, column: 118, scope: !260)
!272 = !DILocalVariable(name: "v2", arg: 5, scope: !260, file: !3, line: 53, type: !103)
!273 = !DILocation(line: 53, column: 137, scope: !260)
!274 = !DILocalVariable(name: "dist", scope: !260, file: !3, line: 55, type: !105)
!275 = !DILocation(line: 55, column: 8, scope: !260)
!276 = !DILocation(line: 57, column: 31, scope: !277)
!277 = distinct !DILexicalBlock(scope: !260, file: !3, line: 57, column: 6)
!278 = !DILocation(line: 57, column: 36, scope: !277)
!279 = !DILocation(line: 57, column: 44, scope: !277)
!280 = !DILocation(line: 57, column: 49, scope: !277)
!281 = !DILocation(line: 57, column: 60, scope: !277)
!282 = !DILocation(line: 57, column: 64, scope: !277)
!283 = !DILocation(line: 57, column: 68, scope: !277)
!284 = !DILocation(line: 57, column: 6, scope: !277)
!285 = !DILocation(line: 57, column: 6, scope: !260)
!286 = !DILocation(line: 58, column: 10, scope: !277)
!287 = !DILocation(line: 58, column: 3, scope: !277)
!288 = !DILocation(line: 60, column: 2, scope: !260)
!289 = !DILocation(line: 61, column: 1, scope: !260)
!290 = distinct !DISubprogram(name: "bvhtree_from_mesh_verts", scope: !3, file: !3, line: 246, type: !291, scopeLine: 247, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !263)
!291 = !DISubroutineType(types: !292)
!292 = !{!245, !88, !293, !105, !102, !102}
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !6, line: 177, baseType: !295)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !6, line: 178, size: 13504, elements: !296)
!296 = !{!297, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !357, !360, !362, !363, !365, !366, !370, !371, !375, !379, !380, !384, !385, !386, !387, !388, !392, !396, !400, !404, !408, !412, !421, !433, !437, !441, !445, !449, !453, !454, !455, !456, !457, !458, !462, !463, !464, !465, !469, !470, !471, !472, !473, !478, !479, !480, !481, !482, !486, !487, !488, !489, !490, !497, !510, !515, !521, !531, !537, !547, !554, !561, !565, !570, !574, !579, !580, !581, !590, !596, !597, !598, !602, !603, !613, !643, !647, !655, !659, !663, !667, !675, !685}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !295, file: !6, line: 180, baseType: !298, size: 1600)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !299, line: 73, baseType: !300)
!299 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !299, line: 64, size: 1600, elements: !301)
!301 = !{!302, !320, !324, !325, !326, !327, !330}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !300, file: !299, line: 65, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !299, line: 53, baseType: !305)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !299, line: 42, size: 832, elements: !306)
!306 = !{!307, !308, !309, !310, !311, !312, !313, !314, !315, !319}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !305, file: !299, line: 43, baseType: !102, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !305, file: !299, line: 44, baseType: !102, size: 32, offset: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !305, file: !299, line: 45, baseType: !102, size: 32, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !305, file: !299, line: 46, baseType: !102, size: 32, offset: 96)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !305, file: !299, line: 47, baseType: !102, size: 32, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !305, file: !299, line: 48, baseType: !102, size: 32, offset: 160)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !305, file: !299, line: 49, baseType: !102, size: 32, offset: 192)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !305, file: !299, line: 50, baseType: !102, size: 32, offset: 224)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !305, file: !299, line: 51, baseType: !316, size: 512, offset: 256)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 512, elements: !317)
!317 = !{!318}
!318 = !DISubrange(count: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !305, file: !299, line: 52, baseType: !82, size: 64, offset: 768)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !300, file: !299, line: 66, baseType: !321, size: 1312, offset: 64)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 1312, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: 41)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !300, file: !299, line: 69, baseType: !102, size: 32, offset: 1376)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !300, file: !299, line: 69, baseType: !102, size: 32, offset: 1408)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !300, file: !299, line: 70, baseType: !102, size: 32, offset: 1440)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !300, file: !299, line: 71, baseType: !328, size: 64, offset: 1472)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !299, line: 71, flags: DIFlagFwdDecl)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !300, file: !299, line: 72, baseType: !331, size: 64, offset: 1536)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !299, line: 59, baseType: !333)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !299, line: 57, size: 8192, elements: !334)
!334 = !{!335}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !333, file: !299, line: 58, baseType: !336, size: 8192)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 8192, elements: !337)
!337 = !{!338}
!338 = !DISubrange(count: 1024)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !295, file: !6, line: 180, baseType: !298, size: 1600, offset: 1600)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !295, file: !6, line: 180, baseType: !298, size: 1600, offset: 3200)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !295, file: !6, line: 180, baseType: !298, size: 1600, offset: 4800)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !295, file: !6, line: 180, baseType: !298, size: 1600, offset: 6400)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !295, file: !6, line: 181, baseType: !102, size: 32, offset: 8000)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !295, file: !6, line: 181, baseType: !102, size: 32, offset: 8032)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !295, file: !6, line: 181, baseType: !102, size: 32, offset: 8064)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !295, file: !6, line: 181, baseType: !102, size: 32, offset: 8096)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !295, file: !6, line: 181, baseType: !102, size: 32, offset: 8128)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !295, file: !6, line: 182, baseType: !102, size: 32, offset: 8160)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !295, file: !6, line: 183, baseType: !102, size: 32, offset: 8192)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !295, file: !6, line: 184, baseType: !351, size: 64, offset: 8256)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !90, line: 124, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !84, line: 45, size: 128, elements: !354)
!354 = !{!355, !356}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !353, file: !84, line: 46, baseType: !352, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !353, file: !84, line: 47, baseType: !82, size: 64, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !295, file: !6, line: 185, baseType: !358, size: 64, offset: 8320)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !6, line: 97, flags: DIFlagFwdDecl)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !295, file: !6, line: 186, baseType: !361, size: 32, offset: 8384)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !6, line: 132, baseType: !5)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !295, file: !6, line: 187, baseType: !105, size: 32, offset: 8416)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !295, file: !6, line: 188, baseType: !364, size: 32, offset: 8448)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !6, line: 175, baseType: !12)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !295, file: !6, line: 189, baseType: !102, size: 32, offset: 8480)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !295, file: !6, line: 190, baseType: !367, size: 64, offset: 8512)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !6, line: 190, flags: DIFlagFwdDecl)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !295, file: !6, line: 193, baseType: !150, size: 8, offset: 8576)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !295, file: !6, line: 196, baseType: !372, size: 64, offset: 8640)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{null, !293}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !295, file: !6, line: 199, baseType: !376, size: 64, offset: 8704)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{null, !293, !104}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !295, file: !6, line: 202, baseType: !372, size: 64, offset: 8768)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !295, file: !6, line: 207, baseType: !381, size: 64, offset: 8832)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{!102, !293}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !295, file: !6, line: 208, baseType: !381, size: 64, offset: 8896)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !295, file: !6, line: 209, baseType: !381, size: 64, offset: 8960)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !295, file: !6, line: 210, baseType: !381, size: 64, offset: 9024)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !295, file: !6, line: 211, baseType: !381, size: 64, offset: 9088)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !295, file: !6, line: 218, baseType: !389, size: 64, offset: 9152)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{null, !293, !102, !141}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !295, file: !6, line: 219, baseType: !393, size: 64, offset: 9216)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{null, !293, !102, !153}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !295, file: !6, line: 220, baseType: !397, size: 64, offset: 9280)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{null, !293, !102, !162}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !295, file: !6, line: 227, baseType: !401, size: 64, offset: 9344)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!141, !293}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !295, file: !6, line: 228, baseType: !405, size: 64, offset: 9408)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{!153, !293}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !295, file: !6, line: 229, baseType: !409, size: 64, offset: 9472)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!162, !293}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !295, file: !6, line: 230, baseType: !413, size: 64, offset: 9536)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!416, !293}
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !143, line: 88, size: 64, elements: !418)
!418 = !{!419, !420}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !417, file: !143, line: 89, baseType: !7, size: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !417, file: !143, line: 90, baseType: !7, size: 32, offset: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !295, file: !6, line: 231, baseType: !422, size: 64, offset: 9600)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{!425, !293}
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !143, line: 79, size: 96, elements: !427)
!427 = !{!428, !429, !430, !431, !432}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !426, file: !143, line: 81, baseType: !102, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !426, file: !143, line: 82, baseType: !102, size: 32, offset: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !426, file: !143, line: 83, baseType: !148, size: 16, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !426, file: !143, line: 84, baseType: !150, size: 8, offset: 80)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !426, file: !143, line: 84, baseType: !150, size: 8, offset: 88)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !295, file: !6, line: 236, baseType: !434, size: 64, offset: 9664)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DISubroutineType(types: !436)
!436 = !{null, !293, !141}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !295, file: !6, line: 237, baseType: !438, size: 64, offset: 9728)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{null, !293, !153}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !295, file: !6, line: 238, baseType: !442, size: 64, offset: 9792)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{null, !293, !162}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !295, file: !6, line: 239, baseType: !446, size: 64, offset: 9856)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{null, !293, !416}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !295, file: !6, line: 240, baseType: !450, size: 64, offset: 9920)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DISubroutineType(types: !452)
!452 = !{null, !293, !425}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !295, file: !6, line: 245, baseType: !401, size: 64, offset: 9984)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !295, file: !6, line: 246, baseType: !405, size: 64, offset: 10048)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !295, file: !6, line: 247, baseType: !409, size: 64, offset: 10112)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !295, file: !6, line: 248, baseType: !413, size: 64, offset: 10176)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !295, file: !6, line: 249, baseType: !422, size: 64, offset: 10240)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !295, file: !6, line: 255, baseType: !459, size: 64, offset: 10304)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DISubroutineType(types: !461)
!461 = !{!82, !293, !102, !102}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !295, file: !6, line: 256, baseType: !459, size: 64, offset: 10368)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !295, file: !6, line: 257, baseType: !459, size: 64, offset: 10432)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !295, file: !6, line: 258, baseType: !459, size: 64, offset: 10496)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !295, file: !6, line: 264, baseType: !466, size: 64, offset: 10560)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{!82, !293, !102}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !295, file: !6, line: 265, baseType: !466, size: 64, offset: 10624)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !295, file: !6, line: 266, baseType: !466, size: 64, offset: 10688)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !295, file: !6, line: 267, baseType: !466, size: 64, offset: 10752)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !295, file: !6, line: 268, baseType: !466, size: 64, offset: 10816)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataLayout", scope: !295, file: !6, line: 272, baseType: !474, size: 64, offset: 10880)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DISubroutineType(types: !476)
!476 = !{!477, !293}
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataLayout", scope: !295, file: !6, line: 273, baseType: !474, size: 64, offset: 10944)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataLayout", scope: !295, file: !6, line: 274, baseType: !474, size: 64, offset: 11008)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataLayout", scope: !295, file: !6, line: 275, baseType: !474, size: 64, offset: 11072)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataLayout", scope: !295, file: !6, line: 276, baseType: !474, size: 64, offset: 11136)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromVertCData", scope: !295, file: !6, line: 279, baseType: !483, size: 64, offset: 11200)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DISubroutineType(types: !485)
!485 = !{null, !293, !102, !477, !102}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromEdgeCData", scope: !295, file: !6, line: 280, baseType: !483, size: 64, offset: 11264)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromFaceCData", scope: !295, file: !6, line: 281, baseType: !483, size: 64, offset: 11328)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "getNumGrids", scope: !295, file: !6, line: 284, baseType: !381, size: 64, offset: 11392)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "getGridSize", scope: !295, file: !6, line: 285, baseType: !381, size: 64, offset: 11456)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "getGridData", scope: !295, file: !6, line: 286, baseType: !491, size: 64, offset: 11520)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{!494, !293}
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !6, line: 82, flags: DIFlagFwdDecl)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "getGridAdjacency", scope: !295, file: !6, line: 287, baseType: !498, size: 64, offset: 11584)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DISubroutineType(types: !500)
!500 = !{!501, !293}
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGridAdjacency", file: !6, line: 120, baseType: !503)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMGridAdjacency", file: !6, line: 117, size: 256, elements: !504)
!504 = !{!505, !509}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !503, file: !6, line: 118, baseType: !506, size: 128)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 128, elements: !507)
!507 = !{!508}
!508 = !DISubrange(count: 4)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !503, file: !6, line: 119, baseType: !506, size: 128, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "getGridOffset", scope: !295, file: !6, line: 288, baseType: !511, size: 64, offset: 11648)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DISubroutineType(types: !513)
!513 = !{!514, !293}
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "getGridKey", scope: !295, file: !6, line: 289, baseType: !516, size: 64, offset: 11712)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DISubroutineType(types: !518)
!518 = !{null, !293, !519}
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGKey", file: !6, line: 83, flags: DIFlagFwdDecl)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "getGridFlagMats", scope: !295, file: !6, line: 290, baseType: !522, size: 64, offset: 11776)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DISubroutineType(types: !524)
!524 = !{!525, !293}
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFlagMat", file: !6, line: 126, baseType: !527)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMFlagMat", file: !6, line: 123, size: 32, elements: !528)
!528 = !{!529, !530}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !527, file: !6, line: 124, baseType: !148, size: 16)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !527, file: !6, line: 125, baseType: !150, size: 8, offset: 16)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "getGridHidden", scope: !295, file: !6, line: 291, baseType: !532, size: 64, offset: 11840)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DISubroutineType(types: !534)
!534 = !{!535, !293}
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedVert", scope: !295, file: !6, line: 299, baseType: !538, size: 64, offset: 11904)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DISubroutineType(types: !540)
!540 = !{null, !293, !541, !82, !546}
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DISubroutineType(types: !543)
!543 = !{null, !82, !102, !103, !103, !544}
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMForeachFlag", file: !6, line: 162, baseType: !17)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedEdge", scope: !295, file: !6, line: 309, baseType: !548, size: 64, offset: 11968)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DISubroutineType(types: !550)
!550 = !{null, !293, !551, !82}
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DISubroutineType(types: !553)
!553 = !{null, !82, !102, !103, !103}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedLoop", scope: !295, file: !6, line: 317, baseType: !555, size: 64, offset: 12032)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DISubroutineType(types: !557)
!557 = !{null, !293, !558, !82, !546}
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DISubroutineType(types: !560)
!560 = !{null, !82, !102, !102, !103, !103}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedFaceCenter", scope: !295, file: !6, line: 327, baseType: !562, size: 64, offset: 12096)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{null, !293, !551, !82, !546}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "getMinMax", scope: !295, file: !6, line: 337, baseType: !566, size: 64, offset: 12160)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{null, !293, !569, !569}
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCo", scope: !295, file: !6, line: 344, baseType: !571, size: 64, offset: 12224)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DISubroutineType(types: !573)
!573 = !{null, !293, !102, !569}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCos", scope: !295, file: !6, line: 347, baseType: !575, size: 64, offset: 12288)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DISubroutineType(types: !577)
!577 = !{null, !293, !578}
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "getVertNo", scope: !295, file: !6, line: 350, baseType: !571, size: 64, offset: 12352)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyNo", scope: !295, file: !6, line: 351, baseType: !571, size: 64, offset: 12416)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyMap", scope: !295, file: !6, line: 355, baseType: !582, size: 64, offset: 12480)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DISubroutineType(types: !584)
!584 = !{!585, !588, !293}
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !587)
!587 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !6, line: 355, flags: DIFlagFwdDecl)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !6, line: 88, flags: DIFlagFwdDecl)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "getPBVH", scope: !295, file: !6, line: 359, baseType: !591, size: 64, offset: 12544)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DISubroutineType(types: !593)
!593 = !{!594, !588, !293}
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !6, line: 100, flags: DIFlagFwdDecl)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "drawVerts", scope: !295, file: !6, line: 364, baseType: !372, size: 64, offset: 12608)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "drawUVEdges", scope: !295, file: !6, line: 367, baseType: !372, size: 64, offset: 12672)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "drawEdges", scope: !295, file: !6, line: 373, baseType: !599, size: 64, offset: 12736)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DISubroutineType(types: !601)
!601 = !{null, !293, !173, !173}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "drawLooseEdges", scope: !295, file: !6, line: 376, baseType: !372, size: 64, offset: 12800)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesSolid", scope: !295, file: !6, line: 385, baseType: !604, size: 64, offset: 12864)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{null, !293, !607, !173, !609}
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 128, elements: !507)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetMaterial", file: !6, line: 146, baseType: !610)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DISubroutineType(types: !612)
!612 = !{!102, !102, !82}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesTex", scope: !295, file: !6, line: 391, baseType: !614, size: 64, offset: 12928)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DISubroutineType(types: !616)
!616 = !{null, !293, !617, !638, !82, !642}
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptionsTex", file: !6, line: 150, baseType: !618)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DISubroutineType(types: !620)
!620 = !{!621, !622, !637, !102}
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawOption", file: !6, line: 143, baseType: !21)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !143, line: 160, size: 384, elements: !624)
!624 = !{!625, !629, !632, !633, !634, !635, !636}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !623, file: !143, line: 161, baseType: !626, size: 256)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 256, elements: !627)
!627 = !{!508, !628}
!628 = !DISubrange(count: 2)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !623, file: !143, line: 162, baseType: !630, size: 64, offset: 256)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !143, line: 39, flags: DIFlagFwdDecl)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !623, file: !143, line: 163, baseType: !150, size: 8, offset: 320)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !623, file: !143, line: 163, baseType: !150, size: 8, offset: 328)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !623, file: !143, line: 164, baseType: !148, size: 16, offset: 336)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !623, file: !143, line: 164, baseType: !148, size: 16, offset: 352)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !623, file: !143, line: 164, baseType: !148, size: 16, offset: 368)
!637 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !173)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCompareDrawOptions", file: !6, line: 147, baseType: !639)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{!102, !82, !102, !102}
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawFlag", file: !6, line: 157, baseType: !27)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesGLSL", scope: !295, file: !6, line: 400, baseType: !644, size: 64, offset: 12992)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DISubroutineType(types: !646)
!646 = !{null, !293, !609}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFaces", scope: !295, file: !6, line: 415, baseType: !648, size: 64, offset: 13056)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DISubroutineType(types: !650)
!650 = !{null, !293, !651, !609, !638, !82, !642}
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptions", file: !6, line: 149, baseType: !652)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DISubroutineType(types: !654)
!654 = !{!621, !82, !102}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesTex", scope: !295, file: !6, line: 425, baseType: !656, size: 64, offset: 13120)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{null, !293, !651, !638, !82, !642}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesGLSL", scope: !295, file: !6, line: 435, baseType: !660, size: 64, offset: 13184)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DISubroutineType(types: !662)
!662 = !{null, !293, !609, !651, !82}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdges", scope: !295, file: !6, line: 444, baseType: !664, size: 64, offset: 13248)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DISubroutineType(types: !666)
!666 = !{null, !293, !651, !82}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdgesInterp", scope: !295, file: !6, line: 455, baseType: !668, size: 64, offset: 13312)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DISubroutineType(types: !670)
!670 = !{null, !293, !651, !671, !82}
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawInterpOptions", file: !6, line: 148, baseType: !672)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DISubroutineType(types: !674)
!674 = !{null, !82, !102, !105}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesMat", scope: !295, file: !6, line: 464, baseType: !676, size: 64, offset: 13376)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DISubroutineType(types: !678)
!678 = !{null, !293, !679, !682, !82}
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{null, !82, !102, !82}
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DISubroutineType(types: !684)
!684 = !{!173, !82, !102}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !295, file: !6, line: 470, baseType: !372, size: 64, offset: 13440)
!686 = !DILocalVariable(name: "data", arg: 1, scope: !290, file: !3, line: 246, type: !88)
!687 = !DILocation(line: 246, column: 51, scope: !290)
!688 = !DILocalVariable(name: "dm", arg: 2, scope: !290, file: !3, line: 246, type: !293)
!689 = !DILocation(line: 246, column: 70, scope: !290)
!690 = !DILocalVariable(name: "epsilon", arg: 3, scope: !290, file: !3, line: 246, type: !105)
!691 = !DILocation(line: 246, column: 80, scope: !290)
!692 = !DILocalVariable(name: "tree_type", arg: 4, scope: !290, file: !3, line: 246, type: !102)
!693 = !DILocation(line: 246, column: 93, scope: !290)
!694 = !DILocalVariable(name: "axis", arg: 5, scope: !290, file: !3, line: 246, type: !102)
!695 = !DILocation(line: 246, column: 108, scope: !290)
!696 = !DILocalVariable(name: "tree", scope: !290, file: !3, line: 248, type: !245)
!697 = !DILocation(line: 248, column: 11, scope: !290)
!698 = !DILocalVariable(name: "vert", scope: !290, file: !3, line: 249, type: !699)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "MVert", file: !143, line: 69, baseType: !142)
!701 = !DILocation(line: 249, column: 9, scope: !290)
!702 = !DILocalVariable(name: "vert_allocated", scope: !290, file: !3, line: 250, type: !173)
!703 = !DILocation(line: 250, column: 7, scope: !290)
!704 = !DILocation(line: 252, column: 2, scope: !290)
!705 = !DILocation(line: 253, column: 24, scope: !290)
!706 = !DILocation(line: 253, column: 28, scope: !290)
!707 = !DILocation(line: 253, column: 9, scope: !290)
!708 = !DILocation(line: 253, column: 7, scope: !290)
!709 = !DILocation(line: 254, column: 2, scope: !290)
!710 = !DILocation(line: 256, column: 27, scope: !290)
!711 = !DILocation(line: 256, column: 9, scope: !290)
!712 = !DILocation(line: 256, column: 7, scope: !290)
!713 = !DILocation(line: 259, column: 6, scope: !714)
!714 = distinct !DILexicalBlock(scope: !290, file: !3, line: 259, column: 6)
!715 = !DILocation(line: 259, column: 11, scope: !714)
!716 = !DILocation(line: 259, column: 6, scope: !290)
!717 = !DILocation(line: 260, column: 3, scope: !718)
!718 = distinct !DILexicalBlock(scope: !714, file: !3, line: 259, column: 20)
!719 = !DILocation(line: 261, column: 25, scope: !718)
!720 = !DILocation(line: 261, column: 29, scope: !718)
!721 = !DILocation(line: 261, column: 10, scope: !718)
!722 = !DILocation(line: 261, column: 8, scope: !718)
!723 = !DILocation(line: 262, column: 7, scope: !724)
!724 = distinct !DILexicalBlock(scope: !718, file: !3, line: 262, column: 7)
!725 = !DILocation(line: 262, column: 12, scope: !724)
!726 = !DILocation(line: 262, column: 7, scope: !718)
!727 = !DILocalVariable(name: "i", scope: !728, file: !3, line: 263, type: !102)
!728 = distinct !DILexicalBlock(scope: !724, file: !3, line: 262, column: 21)
!729 = !DILocation(line: 263, column: 8, scope: !728)
!730 = !DILocalVariable(name: "numVerts", scope: !728, file: !3, line: 264, type: !102)
!731 = !DILocation(line: 264, column: 8, scope: !728)
!732 = !DILocation(line: 264, column: 19, scope: !728)
!733 = !DILocation(line: 264, column: 23, scope: !728)
!734 = !DILocation(line: 264, column: 35, scope: !728)
!735 = !DILocation(line: 266, column: 8, scope: !736)
!736 = distinct !DILexicalBlock(scope: !728, file: !3, line: 266, column: 8)
!737 = !DILocation(line: 266, column: 13, scope: !736)
!738 = !DILocation(line: 266, column: 8, scope: !728)
!739 = !DILocation(line: 267, column: 28, scope: !740)
!740 = distinct !DILexicalBlock(scope: !736, file: !3, line: 266, column: 22)
!741 = !DILocation(line: 267, column: 38, scope: !740)
!742 = !DILocation(line: 267, column: 47, scope: !740)
!743 = !DILocation(line: 267, column: 58, scope: !740)
!744 = !DILocation(line: 267, column: 12, scope: !740)
!745 = !DILocation(line: 267, column: 10, scope: !740)
!746 = !DILocation(line: 269, column: 9, scope: !747)
!747 = distinct !DILexicalBlock(scope: !740, file: !3, line: 269, column: 9)
!748 = !DILocation(line: 269, column: 14, scope: !747)
!749 = !DILocation(line: 269, column: 9, scope: !740)
!750 = !DILocation(line: 270, column: 13, scope: !751)
!751 = distinct !DILexicalBlock(scope: !752, file: !3, line: 270, column: 6)
!752 = distinct !DILexicalBlock(scope: !747, file: !3, line: 269, column: 23)
!753 = !DILocation(line: 270, column: 11, scope: !751)
!754 = !DILocation(line: 270, column: 18, scope: !755)
!755 = distinct !DILexicalBlock(scope: !751, file: !3, line: 270, column: 6)
!756 = !DILocation(line: 270, column: 22, scope: !755)
!757 = !DILocation(line: 270, column: 20, scope: !755)
!758 = !DILocation(line: 270, column: 6, scope: !751)
!759 = !DILocation(line: 271, column: 26, scope: !760)
!760 = distinct !DILexicalBlock(scope: !755, file: !3, line: 270, column: 37)
!761 = !DILocation(line: 271, column: 32, scope: !760)
!762 = !DILocation(line: 271, column: 35, scope: !760)
!763 = !DILocation(line: 271, column: 40, scope: !760)
!764 = !DILocation(line: 271, column: 43, scope: !760)
!765 = !DILocation(line: 271, column: 7, scope: !760)
!766 = !DILocation(line: 272, column: 6, scope: !760)
!767 = !DILocation(line: 270, column: 33, scope: !755)
!768 = !DILocation(line: 270, column: 6, scope: !755)
!769 = distinct !{!769, !758, !770}
!770 = !DILocation(line: 272, column: 6, scope: !751)
!771 = !DILocation(line: 274, column: 26, scope: !752)
!772 = !DILocation(line: 274, column: 6, scope: !752)
!773 = !DILocation(line: 278, column: 23, scope: !752)
!774 = !DILocation(line: 278, column: 27, scope: !752)
!775 = !DILocation(line: 278, column: 37, scope: !752)
!776 = !DILocation(line: 278, column: 6, scope: !752)
!777 = !DILocation(line: 279, column: 5, scope: !752)
!778 = !DILocation(line: 280, column: 4, scope: !740)
!779 = !DILocation(line: 281, column: 3, scope: !728)
!780 = !DILocation(line: 282, column: 3, scope: !718)
!781 = !DILocation(line: 283, column: 2, scope: !718)
!782 = !DILocation(line: 290, column: 9, scope: !290)
!783 = !DILocation(line: 290, column: 2, scope: !290)
!784 = !DILocation(line: 291, column: 15, scope: !290)
!785 = !DILocation(line: 291, column: 2, scope: !290)
!786 = !DILocation(line: 291, column: 8, scope: !290)
!787 = !DILocation(line: 291, column: 13, scope: !290)
!788 = !DILocation(line: 293, column: 6, scope: !789)
!789 = distinct !DILexicalBlock(scope: !290, file: !3, line: 293, column: 6)
!790 = !DILocation(line: 293, column: 12, scope: !789)
!791 = !DILocation(line: 293, column: 6, scope: !290)
!792 = !DILocation(line: 294, column: 3, scope: !793)
!793 = distinct !DILexicalBlock(scope: !789, file: !3, line: 293, column: 18)
!794 = !DILocation(line: 294, column: 9, scope: !793)
!795 = !DILocation(line: 294, column: 16, scope: !793)
!796 = !DILocation(line: 298, column: 3, scope: !793)
!797 = !DILocation(line: 298, column: 9, scope: !793)
!798 = !DILocation(line: 298, column: 26, scope: !793)
!799 = !DILocation(line: 299, column: 3, scope: !793)
!800 = !DILocation(line: 299, column: 9, scope: !793)
!801 = !DILocation(line: 299, column: 26, scope: !793)
!802 = !DILocation(line: 301, column: 16, scope: !793)
!803 = !DILocation(line: 301, column: 3, scope: !793)
!804 = !DILocation(line: 301, column: 9, scope: !793)
!805 = !DILocation(line: 301, column: 14, scope: !793)
!806 = !DILocation(line: 302, column: 26, scope: !793)
!807 = !DILocation(line: 302, column: 3, scope: !793)
!808 = !DILocation(line: 302, column: 9, scope: !793)
!809 = !DILocation(line: 302, column: 24, scope: !793)
!810 = !DILocation(line: 303, column: 38, scope: !793)
!811 = !DILocation(line: 303, column: 43, scope: !793)
!812 = !DILocation(line: 303, column: 49, scope: !793)
!813 = !DILocation(line: 303, column: 16, scope: !793)
!814 = !DILocation(line: 303, column: 3, scope: !793)
!815 = !DILocation(line: 303, column: 9, scope: !793)
!816 = !DILocation(line: 303, column: 14, scope: !793)
!817 = !DILocation(line: 305, column: 25, scope: !793)
!818 = !DILocation(line: 305, column: 3, scope: !793)
!819 = !DILocation(line: 305, column: 9, scope: !793)
!820 = !DILocation(line: 305, column: 23, scope: !793)
!821 = !DILocation(line: 306, column: 2, scope: !793)
!822 = !DILocation(line: 308, column: 7, scope: !823)
!823 = distinct !DILexicalBlock(scope: !824, file: !3, line: 308, column: 7)
!824 = distinct !DILexicalBlock(scope: !789, file: !3, line: 307, column: 7)
!825 = !DILocation(line: 308, column: 7, scope: !824)
!826 = !DILocation(line: 309, column: 4, scope: !827)
!827 = distinct !DILexicalBlock(scope: !823, file: !3, line: 308, column: 23)
!828 = !DILocation(line: 309, column: 14, scope: !827)
!829 = !DILocation(line: 310, column: 3, scope: !827)
!830 = !DILocation(line: 313, column: 9, scope: !290)
!831 = !DILocation(line: 313, column: 15, scope: !290)
!832 = !DILocation(line: 313, column: 2, scope: !290)
!833 = distinct !DISubprogram(name: "bvhcache_find", scope: !3, file: !3, line: 606, type: !834, scopeLine: 607, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !263)
!834 = !DISubroutineType(types: !835)
!835 = !{!245, !836, !102}
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!837 = !DILocalVariable(name: "cache", arg: 1, scope: !833, file: !3, line: 606, type: !836)
!838 = !DILocation(line: 606, column: 34, scope: !833)
!839 = !DILocalVariable(name: "type", arg: 2, scope: !833, file: !3, line: 606, type: !102)
!840 = !DILocation(line: 606, column: 45, scope: !833)
!841 = !DILocalVariable(name: "item", scope: !833, file: !3, line: 608, type: !240)
!842 = !DILocation(line: 608, column: 15, scope: !833)
!843 = !DILocation(line: 609, column: 14, scope: !833)
!844 = !DILocation(line: 609, column: 7, scope: !833)
!845 = !DILocation(line: 609, column: 12, scope: !833)
!846 = !DILocation(line: 610, column: 7, scope: !833)
!847 = !DILocation(line: 610, column: 12, scope: !833)
!848 = !DILocation(line: 612, column: 22, scope: !833)
!849 = !DILocation(line: 612, column: 21, scope: !833)
!850 = !DILocation(line: 612, column: 56, scope: !833)
!851 = !DILocation(line: 612, column: 2, scope: !833)
!852 = !DILocation(line: 613, column: 14, scope: !833)
!853 = !DILocation(line: 613, column: 2, scope: !833)
!854 = distinct !DISubprogram(name: "bvhcache_insert", scope: !3, file: !3, line: 616, type: !855, scopeLine: 617, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !263)
!855 = !DISubroutineType(types: !856)
!856 = !{null, !836, !245, !102}
!857 = !DILocalVariable(name: "cache", arg: 1, scope: !854, file: !3, line: 616, type: !836)
!858 = !DILocation(line: 616, column: 32, scope: !854)
!859 = !DILocalVariable(name: "tree", arg: 2, scope: !854, file: !3, line: 616, type: !245)
!860 = !DILocation(line: 616, column: 48, scope: !854)
!861 = !DILocalVariable(name: "type", arg: 3, scope: !854, file: !3, line: 616, type: !102)
!862 = !DILocation(line: 616, column: 58, scope: !854)
!863 = !DILocalVariable(name: "item", scope: !854, file: !3, line: 618, type: !239)
!864 = !DILocation(line: 618, column: 16, scope: !854)
!865 = !DILocation(line: 623, column: 9, scope: !854)
!866 = !DILocation(line: 623, column: 7, scope: !854)
!867 = !DILocation(line: 626, column: 15, scope: !854)
!868 = !DILocation(line: 626, column: 2, scope: !854)
!869 = !DILocation(line: 626, column: 8, scope: !854)
!870 = !DILocation(line: 626, column: 13, scope: !854)
!871 = !DILocation(line: 627, column: 15, scope: !854)
!872 = !DILocation(line: 627, column: 2, scope: !854)
!873 = !DILocation(line: 627, column: 8, scope: !854)
!874 = !DILocation(line: 627, column: 13, scope: !854)
!875 = !DILocation(line: 629, column: 23, scope: !854)
!876 = !DILocation(line: 629, column: 30, scope: !854)
!877 = !DILocation(line: 629, column: 2, scope: !854)
!878 = !DILocation(line: 630, column: 1, scope: !854)
!879 = distinct !DISubprogram(name: "bvhtree_from_mesh_faces", scope: !3, file: !3, line: 317, type: !291, scopeLine: 318, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !263)
!880 = !DILocalVariable(name: "data", arg: 1, scope: !879, file: !3, line: 317, type: !88)
!881 = !DILocation(line: 317, column: 51, scope: !879)
!882 = !DILocalVariable(name: "dm", arg: 2, scope: !879, file: !3, line: 317, type: !293)
!883 = !DILocation(line: 317, column: 70, scope: !879)
!884 = !DILocalVariable(name: "epsilon", arg: 3, scope: !879, file: !3, line: 317, type: !105)
!885 = !DILocation(line: 317, column: 80, scope: !879)
!886 = !DILocalVariable(name: "tree_type", arg: 4, scope: !879, file: !3, line: 317, type: !102)
!887 = !DILocation(line: 317, column: 93, scope: !879)
!888 = !DILocalVariable(name: "axis", arg: 5, scope: !879, file: !3, line: 317, type: !102)
!889 = !DILocation(line: 317, column: 108, scope: !879)
!890 = !DILocalVariable(name: "em", scope: !879, file: !3, line: 319, type: !891)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEditMesh", file: !893, line: 83, baseType: !894)
!893 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_editmesh.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEditMesh", file: !893, line: 54, size: 896, elements: !895)
!895 = !{!896, !1004, !1006, !1007, !1010, !1011, !1013, !1014, !1020, !1023, !1024, !1025, !1026, !1027, !1028, !1029}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "bm", scope: !894, file: !893, line: 55, baseType: !897, size: 64)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !72, line: 186, size: 8064, elements: !899)
!899 = !{!900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !917, !921, !925, !926, !927, !928, !929, !930, !931, !932, !986, !987, !988, !989, !990, !991, !992, !993, !994, !1001, !1002, !1003}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !898, file: !72, line: 187, baseType: !102, size: 32)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !898, file: !72, line: 187, baseType: !102, size: 32, offset: 32)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !898, file: !72, line: 187, baseType: !102, size: 32, offset: 64)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !898, file: !72, line: 187, baseType: !102, size: 32, offset: 96)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !898, file: !72, line: 188, baseType: !102, size: 32, offset: 128)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !898, file: !72, line: 188, baseType: !102, size: 32, offset: 160)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !898, file: !72, line: 188, baseType: !102, size: 32, offset: 192)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !898, file: !72, line: 193, baseType: !150, size: 8, offset: 224)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !898, file: !72, line: 197, baseType: !150, size: 8, offset: 232)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !898, file: !72, line: 201, baseType: !328, size: 64, offset: 256)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !898, file: !72, line: 201, baseType: !328, size: 64, offset: 320)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !898, file: !72, line: 201, baseType: !328, size: 64, offset: 384)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !898, file: !72, line: 201, baseType: !328, size: 64, offset: 448)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !898, file: !72, line: 208, baseType: !914, size: 64, offset: 512)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !72, line: 103, baseType: !196)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !898, file: !72, line: 209, baseType: !918, size: 64, offset: 576)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !72, line: 123, baseType: !208)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !898, file: !72, line: 210, baseType: !922, size: 64, offset: 640)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !72, line: 178, baseType: !226)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !898, file: !72, line: 213, baseType: !102, size: 32, offset: 704)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !898, file: !72, line: 214, baseType: !102, size: 32, offset: 736)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !898, file: !72, line: 215, baseType: !102, size: 32, offset: 768)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !898, file: !72, line: 218, baseType: !328, size: 64, offset: 832)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !898, file: !72, line: 218, baseType: !328, size: 64, offset: 896)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !898, file: !72, line: 218, baseType: !328, size: 64, offset: 960)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !898, file: !72, line: 220, baseType: !102, size: 32, offset: 1024)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !898, file: !72, line: 221, baseType: !933, size: 64, offset: 1088)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !34, line: 190, size: 10496, elements: !935)
!935 = !{!936, !972, !973, !979, !982, !983, !985}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !934, file: !34, line: 191, baseType: !937, size: 5120)
!937 = !DICompositeType(tag: DW_TAG_array_type, baseType: !938, size: 5120, elements: !970)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !34, line: 147, size: 320, elements: !939)
!939 = !{!940, !943, !945, !955, !956}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !938, file: !34, line: 148, baseType: !941, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !938, file: !34, line: 149, baseType: !944, size: 32, offset: 64)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !34, line: 112, baseType: !33)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !938, file: !34, line: 150, baseType: !946, size: 32, offset: 96)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !34, line: 142, baseType: !947)
!947 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !34, line: 138, size: 32, elements: !948)
!948 = !{!949, !951, !953}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !947, file: !34, line: 139, baseType: !950, size: 32)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !34, line: 122, baseType: !44)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !947, file: !34, line: 140, baseType: !952, size: 32)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !34, line: 136, baseType: !50)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !947, file: !34, line: 141, baseType: !954, size: 32)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !34, line: 130, baseType: !56)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !938, file: !34, line: 152, baseType: !102, size: 32, offset: 128)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !938, file: !34, line: 162, baseType: !957, size: 128, offset: 192)
!957 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !938, file: !34, line: 155, size: 128, elements: !958)
!958 = !{!959, !960, !961, !962, !963, !965}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !957, file: !34, line: 156, baseType: !102, size: 32)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !957, file: !34, line: 157, baseType: !105, size: 32)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !957, file: !34, line: 158, baseType: !82, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !957, file: !34, line: 159, baseType: !112, size: 96)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !957, file: !34, line: 160, baseType: !964, size: 64)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !957, file: !34, line: 161, baseType: !966, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !968, line: 48, baseType: !969)
!968 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!969 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !968, line: 48, flags: DIFlagFwdDecl)
!970 = !{!971}
!971 = !DISubrange(count: 16)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !934, file: !34, line: 192, baseType: !937, size: 5120, offset: 5120)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !934, file: !34, line: 193, baseType: !974, size: 64, offset: 10240)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DISubroutineType(types: !976)
!976 = !{null, !977, !933}
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !72, line: 246, baseType: !898)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !934, file: !34, line: 194, baseType: !980, size: 64, offset: 10304)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !84, line: 38, flags: DIFlagFwdDecl)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !934, file: !34, line: 195, baseType: !102, size: 32, offset: 10368)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !934, file: !34, line: 196, baseType: !984, size: 32, offset: 10400)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !34, line: 188, baseType: !64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !934, file: !34, line: 197, baseType: !102, size: 32, offset: 10432)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !898, file: !72, line: 223, baseType: !298, size: 1600, offset: 1152)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !898, file: !72, line: 223, baseType: !298, size: 1600, offset: 2752)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !898, file: !72, line: 223, baseType: !298, size: 1600, offset: 4352)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !898, file: !72, line: 223, baseType: !298, size: 1600, offset: 5952)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !898, file: !72, line: 233, baseType: !148, size: 16, offset: 7552)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !898, file: !72, line: 236, baseType: !102, size: 32, offset: 7584)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !898, file: !72, line: 238, baseType: !102, size: 32, offset: 7616)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !898, file: !72, line: 238, baseType: !102, size: 32, offset: 7648)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !898, file: !72, line: 239, baseType: !995, size: 128, offset: 7680)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !996, line: 71, baseType: !997)
!996 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !996, line: 69, size: 128, elements: !998)
!998 = !{!999, !1000}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !997, file: !996, line: 70, baseType: !82, size: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !997, file: !996, line: 70, baseType: !82, size: 64, offset: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !898, file: !72, line: 241, baseType: !923, size: 64, offset: 7808)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !898, file: !72, line: 243, baseType: !995, size: 128, offset: 7872)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !898, file: !72, line: 245, baseType: !82, size: 64, offset: 8000)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "emcopy", scope: !894, file: !893, line: 58, baseType: !1005, size: 64, offset: 64)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "emcopyusers", scope: !894, file: !893, line: 59, baseType: !102, size: 32, offset: 128)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "looptris", scope: !894, file: !893, line: 63, baseType: !1008, size: 64, offset: 192)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 192, elements: !113)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "tottri", scope: !894, file: !893, line: 64, baseType: !102, size: 32, offset: 256)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !894, file: !893, line: 67, baseType: !1012, size: 64, offset: 320)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "derivedCage", scope: !894, file: !893, line: 67, baseType: !1012, size: 64, offset: 384)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !894, file: !893, line: 68, baseType: !1015, size: 64, offset: 448)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataMask", file: !1016, line: 48, baseType: !1017)
!1016 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_customdata.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !253, line: 27, baseType: !1018)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !255, line: 45, baseType: !1019)
!1019 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "derivedVertColor", scope: !894, file: !893, line: 69, baseType: !1021, size: 64, offset: 512)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 32, elements: !507)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "derivedVertColorLen", scope: !894, file: !893, line: 70, baseType: !102, size: 32, offset: 576)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFaceColor", scope: !894, file: !893, line: 71, baseType: !1021, size: 64, offset: 640)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFaceColorLen", scope: !894, file: !893, line: 72, baseType: !102, size: 32, offset: 704)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !894, file: !893, line: 75, baseType: !148, size: 16, offset: 736)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !894, file: !893, line: 76, baseType: !148, size: 16, offset: 752)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "ob", scope: !894, file: !893, line: 79, baseType: !588, size: 64, offset: 768)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "mirror_cdlayer", scope: !894, file: !893, line: 82, baseType: !102, size: 32, offset: 832)
!1030 = !DILocation(line: 319, column: 14, scope: !879)
!1031 = !DILocation(line: 319, column: 19, scope: !879)
!1032 = !DILocation(line: 319, column: 25, scope: !879)
!1033 = !DILocalVariable(name: "bvhcache_type", scope: !879, file: !3, line: 320, type: !1034)
!1034 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!1035 = !DILocation(line: 320, column: 12, scope: !879)
!1036 = !DILocation(line: 320, column: 28, scope: !879)
!1037 = !DILocalVariable(name: "tree", scope: !879, file: !3, line: 321, type: !245)
!1038 = !DILocation(line: 321, column: 11, scope: !879)
!1039 = !DILocalVariable(name: "vert", scope: !879, file: !3, line: 322, type: !699)
!1040 = !DILocation(line: 322, column: 9, scope: !879)
!1041 = !DILocalVariable(name: "face", scope: !879, file: !3, line: 323, type: !1042)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "MFace", file: !143, line: 46, baseType: !163)
!1044 = !DILocation(line: 323, column: 9, scope: !879)
!1045 = !DILocalVariable(name: "vert_allocated", scope: !879, file: !3, line: 324, type: !173)
!1046 = !DILocation(line: 324, column: 7, scope: !879)
!1047 = !DILocalVariable(name: "face_allocated", scope: !879, file: !3, line: 324, type: !173)
!1048 = !DILocation(line: 324, column: 31, scope: !879)
!1049 = !DILocation(line: 326, column: 2, scope: !879)
!1050 = !DILocation(line: 327, column: 24, scope: !879)
!1051 = !DILocation(line: 327, column: 28, scope: !879)
!1052 = !DILocation(line: 327, column: 38, scope: !879)
!1053 = !DILocation(line: 327, column: 9, scope: !879)
!1054 = !DILocation(line: 327, column: 7, scope: !879)
!1055 = !DILocation(line: 328, column: 2, scope: !879)
!1056 = !DILocation(line: 330, column: 6, scope: !1057)
!1057 = distinct !DILexicalBlock(scope: !879, file: !3, line: 330, column: 6)
!1058 = !DILocation(line: 330, column: 9, scope: !1057)
!1059 = !DILocation(line: 330, column: 6, scope: !879)
!1060 = !DILocation(line: 331, column: 28, scope: !1061)
!1061 = distinct !DILexicalBlock(scope: !1057, file: !3, line: 330, column: 18)
!1062 = !DILocation(line: 331, column: 10, scope: !1061)
!1063 = !DILocation(line: 331, column: 8, scope: !1061)
!1064 = !DILocation(line: 332, column: 32, scope: !1061)
!1065 = !DILocation(line: 332, column: 10, scope: !1061)
!1066 = !DILocation(line: 332, column: 8, scope: !1061)
!1067 = !DILocation(line: 333, column: 2, scope: !1061)
!1068 = !DILocation(line: 336, column: 6, scope: !1069)
!1069 = distinct !DILexicalBlock(scope: !879, file: !3, line: 336, column: 6)
!1070 = !DILocation(line: 336, column: 11, scope: !1069)
!1071 = !DILocation(line: 336, column: 6, scope: !879)
!1072 = !DILocation(line: 337, column: 3, scope: !1073)
!1073 = distinct !DILexicalBlock(scope: !1069, file: !3, line: 336, column: 20)
!1074 = !DILocation(line: 338, column: 25, scope: !1073)
!1075 = !DILocation(line: 338, column: 29, scope: !1073)
!1076 = !DILocation(line: 338, column: 39, scope: !1073)
!1077 = !DILocation(line: 338, column: 10, scope: !1073)
!1078 = !DILocation(line: 338, column: 8, scope: !1073)
!1079 = !DILocation(line: 339, column: 7, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !1073, file: !3, line: 339, column: 7)
!1081 = !DILocation(line: 339, column: 12, scope: !1080)
!1082 = !DILocation(line: 339, column: 7, scope: !1073)
!1083 = !DILocalVariable(name: "i", scope: !1084, file: !3, line: 340, type: !102)
!1084 = distinct !DILexicalBlock(scope: !1080, file: !3, line: 339, column: 21)
!1085 = !DILocation(line: 340, column: 8, scope: !1084)
!1086 = !DILocalVariable(name: "numFaces", scope: !1084, file: !3, line: 341, type: !102)
!1087 = !DILocation(line: 341, column: 8, scope: !1084)
!1088 = !DILocation(line: 348, column: 8, scope: !1089)
!1089 = distinct !DILexicalBlock(scope: !1084, file: !3, line: 348, column: 8)
