; ModuleID = 'blender/source/blender/editors/space_info/info_draw.c'
source_filename = "blender/source/blender/editors/space_info/info_draw.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }
%struct.WalkNavigation = type { float, float, float, float, float, float, i16, [3 x i16] }

!152 = !DIEnumerator(name: "TH_DIS_MARKER", value: 145, isUnsigned: true)
!153 = !DIEnumerator(name: "TH_PATH_BEFORE", value: 146, isUnsigned: true)
!154 = !DIEnumerator(name: "TH_PATH_AFTER", value: 147, isUnsigned: true)
!155 = !DIEnumerator(name: "TH_CAMERA_PATH", value: 148, isUnsigned: true)
!156 = !DIEnumerator(name: "TH_LOCK_MARKER", value: 149, isUnsigned: true)
!157 = !DIEnumerator(name: "TH_STITCH_PREVIEW_FACE", value: 150, isUnsigned: true)
!158 = !DIEnumerator(name: "TH_STITCH_PREVIEW_EDGE", value: 151, isUnsigned: true)
!159 = !DIEnumerator(name: "TH_STITCH_PREVIEW_VERT", value: 152, isUnsigned: true)
!160 = !DIEnumerator(name: "TH_STITCH_PREVIEW_STITCHABLE", value: 153, isUnsigned: true)
!161 = !DIEnumerator(name: "TH_STITCH_PREVIEW_UNSTITCHABLE", value: 154, isUnsigned: true)
!162 = !DIEnumerator(name: "TH_STITCH_PREVIEW_ACTIVE", value: 155, isUnsigned: true)
!163 = !DIEnumerator(name: "TH_PAINT_CURVE_HANDLE", value: 156, isUnsigned: true)
!164 = !DIEnumerator(name: "TH_PAINT_CURVE_PIVOT", value: 157, isUnsigned: true)
!165 = !DIEnumerator(name: "TH_UV_SHADOW", value: 158, isUnsigned: true)
!166 = !DIEnumerator(name: "TH_UV_OTHERS", value: 159, isUnsigned: true)
!167 = !DIEnumerator(name: "TH_FREESTYLE_EDGE_MARK", value: 160, isUnsigned: true)
!168 = !DIEnumerator(name: "TH_FREESTYLE_FACE_MARK", value: 161, isUnsigned: true)
!169 = !DIEnumerator(name: "TH_MATCH", value: 162, isUnsigned: true)
!170 = !DIEnumerator(name: "TH_SELECT_HIGHLIGHT", value: 163, isUnsigned: true)
!171 = !DIEnumerator(name: "TH_SKIN_ROOT", value: 164, isUnsigned: true)
!172 = !DIEnumerator(name: "TH_ANIM_ACTIVE", value: 165, isUnsigned: true)
!173 = !DIEnumerator(name: "TH_ANIM_INACTIVE", value: 166, isUnsigned: true)
!174 = !DIEnumerator(name: "TH_NLA_TWEAK", value: 167, isUnsigned: true)
!175 = !DIEnumerator(name: "TH_NLA_TWEAK_DUPLI", value: 168, isUnsigned: true)
!176 = !DIEnumerator(name: "TH_NLA_TRANSITION", value: 169, isUnsigned: true)
!177 = !DIEnumerator(name: "TH_NLA_TRANSITION_SEL", value: 170, isUnsigned: true)
!178 = !DIEnumerator(name: "TH_NLA_META", value: 171, isUnsigned: true)
!179 = !DIEnumerator(name: "TH_NLA_META_SEL", value: 172, isUnsigned: true)
!180 = !DIEnumerator(name: "TH_NLA_SOUND", value: 173, isUnsigned: true)
!181 = !DIEnumerator(name: "TH_NLA_SOUND_SEL", value: 174, isUnsigned: true)
!182 = !DIEnumerator(name: "TH_EMBOSS", value: 175, isUnsigned: true)
!183 = !DIEnumerator(name: "TH_AXIS_X", value: 176, isUnsigned: true)
!184 = !DIEnumerator(name: "TH_AXIS_Y", value: 177, isUnsigned: true)
!185 = !DIEnumerator(name: "TH_AXIS_Z", value: 178, isUnsigned: true)
!186 = !DIEnumerator(name: "TH_LOW_GRAD", value: 179, isUnsigned: true)
!187 = !DIEnumerator(name: "TH_HIGH_GRAD", value: 180, isUnsigned: true)
!188 = !DIEnumerator(name: "TH_SHOW_BACK_GRAD", value: 181, isUnsigned: true)
!189 = !DIEnumerator(name: "TH_INFO_SELECTED", value: 182, isUnsigned: true)
!190 = !DIEnumerator(name: "TH_INFO_SELECTED_TEXT", value: 183, isUnsigned: true)
!191 = !DIEnumerator(name: "TH_INFO_ERROR", value: 184, isUnsigned: true)
!192 = !DIEnumerator(name: "TH_INFO_ERROR_TEXT", value: 185, isUnsigned: true)
!193 = !DIEnumerator(name: "TH_INFO_WARNING", value: 186, isUnsigned: true)
!194 = !DIEnumerator(name: "TH_INFO_WARNING_TEXT", value: 187, isUnsigned: true)
!195 = !DIEnumerator(name: "TH_INFO_INFO", value: 188, isUnsigned: true)
!196 = !DIEnumerator(name: "TH_INFO_INFO_TEXT", value: 189, isUnsigned: true)
!197 = !DIEnumerator(name: "TH_INFO_DEBUG", value: 190, isUnsigned: true)
!198 = !DIEnumerator(name: "TH_INFO_DEBUG_TEXT", value: 191, isUnsigned: true)
!199 = !DIEnumerator(name: "TH_VIEW_OVERLAY", value: 192, isUnsigned: true)
!200 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ReportType", file: !201, line: 67, baseType: !5, size: 32, elements: !202)
!201 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!202 = !{!203, !204, !205, !206, !207, !208, !209, !210, !211}
!203 = !DIEnumerator(name: "RPT_DEBUG", value: 1, isUnsigned: true)
!204 = !DIEnumerator(name: "RPT_INFO", value: 2, isUnsigned: true)
!205 = !DIEnumerator(name: "RPT_OPERATOR", value: 4, isUnsigned: true)
!206 = !DIEnumerator(name: "RPT_PROPERTY", value: 8, isUnsigned: true)
!207 = !DIEnumerator(name: "RPT_WARNING", value: 16, isUnsigned: true)
!208 = !DIEnumerator(name: "RPT_ERROR", value: 32, isUnsigned: true)
!209 = !DIEnumerator(name: "RPT_ERROR_INVALID_INPUT", value: 64, isUnsigned: true)
!210 = !DIEnumerator(name: "RPT_ERROR_INVALID_CONTEXT", value: 128, isUnsigned: true)
!211 = !DIEnumerator(name: "RPT_ERROR_OUT_OF_MEMORY", value: 256, isUnsigned: true)
!212 = !{!213, !214, !215, !235, !267, !281, !227}
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!214 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "ReportList", file: !201, line: 112, baseType: !217)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !201, line: 106, size: 320, elements: !218)
!218 = !{!219, !226, !228, !229, !230, !231}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !217, file: !201, line: 107, baseType: !220, size: 128)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !221, line: 71, baseType: !222)
!221 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !221, line: 69, size: 128, elements: !223)
!223 = !{!224, !225}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !222, file: !221, line: 70, baseType: !213, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !222, file: !221, line: 70, baseType: !213, size: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !217, file: !201, line: 108, baseType: !227, size: 32, offset: 128)
!227 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !217, file: !201, line: 109, baseType: !227, size: 32, offset: 160)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !217, file: !201, line: 110, baseType: !227, size: 32, offset: 192)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !217, file: !201, line: 110, baseType: !227, size: 32, offset: 224)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !217, file: !201, line: 111, baseType: !232, size: 64, offset: 256)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !234, line: 69, flags: DIFlagFwdDecl)
!234 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view2d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceInfo", file: !237, line: 106, baseType: !238)
!237 = !DIFile(filename: "blender/source/blender/makesdna/DNA_space_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceInfo", file: !237, line: 97, size: 512, elements: !239)
!239 = !{!240, !256, !257, !258, !259, !260, !261, !263}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !238, file: !237, line: 98, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceLink", file: !237, line: 91, baseType: !243)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !237, line: 85, size: 448, elements: !244)
!244 = !{!245, !247, !248, !249, !250, !251}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !243, file: !237, line: 86, baseType: !246, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !243, file: !237, line: 86, baseType: !246, size: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !243, file: !237, line: 87, baseType: !220, size: 128, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !243, file: !237, line: 88, baseType: !227, size: 32, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !243, file: !237, line: 89, baseType: !214, size: 32, offset: 288)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !243, file: !237, line: 90, baseType: !252, size: 128, offset: 320)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 128, elements: !254)
!253 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!254 = !{!255}
!255 = !DISubrange(count: 8)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !238, file: !237, line: 98, baseType: !241, size: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !238, file: !237, line: 99, baseType: !220, size: 128, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !238, file: !237, line: 100, baseType: !227, size: 32, offset: 256)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !238, file: !237, line: 101, baseType: !214, size: 32, offset: 288)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !238, file: !237, line: 102, baseType: !252, size: 128, offset: 320)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "rpt_mask", scope: !238, file: !237, line: 104, baseType: !262, size: 8, offset: 448)
!262 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !238, file: !237, line: 105, baseType: !264, size: 56, offset: 456)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 56, elements: !265)
!265 = !{!266}
!266 = !DISubrange(count: 7)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "Report", file: !201, line: 103, baseType: !269)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Report", file: !201, line: 96, size: 320, elements: !270)
!270 = !{!271, !273, !274, !275, !276, !277, !280}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !269, file: !201, line: 97, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !269, file: !201, line: 97, baseType: !272, size: 64, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !269, file: !201, line: 98, baseType: !253, size: 16, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !269, file: !201, line: 99, baseType: !253, size: 16, offset: 144)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !269, file: !201, line: 100, baseType: !227, size: 32, offset: 160)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "typestr", scope: !269, file: !201, line: 101, baseType: !278, size: 64, offset: 192)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !262)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !269, file: !201, line: 102, baseType: !278, size: 64, offset: 256)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "Link", file: !221, line: 59, baseType: !283)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Link", file: !221, line: 57, size: 128, elements: !284)
!284 = !{!285, !287}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !283, file: !221, line: 58, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !283, file: !221, line: 58, baseType: !286, size: 64, offset: 64)
!288 = !{i32 7, !"Dwarf Version", i32 4}
!289 = !{i32 2, !"Debug Info Version", i32 3}
!290 = !{i32 1, !"wchar_size", i32 4}
!291 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!292 = distinct !DISubprogram(name: "info_text_pick", scope: !1, file: !1, line: 270, type: !293, scopeLine: 271, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !386)
!293 = !DISubroutineType(types: !294)
!294 = !{!213, !295, !296, !215, !227}
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "ARegion", file: !298, line: 267, baseType: !299)
!298 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !298, line: 230, size: 3072, elements: !300)
!300 = !{!301, !303, !304, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !375, !376, !377, !378, !379, !380, !381, !382, !383, !385}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !299, file: !298, line: 231, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !299, file: !298, line: 231, baseType: !302, size: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !299, file: !298, line: 233, baseType: !305, size: 1280, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "View2D", file: !234, line: 71, baseType: !306)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View2D", file: !234, line: 40, size: 1280, elements: !307)
!307 = !{!308, !317, !318, !326, !327, !328, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !349, !350, !351, !354}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !306, file: !234, line: 41, baseType: !309, size: 128)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !310, line: 95, baseType: !311)
!310 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !310, line: 92, size: 128, elements: !312)
!312 = !{!313, !314, !315, !316}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !311, file: !310, line: 93, baseType: !214, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !311, file: !310, line: 93, baseType: !214, size: 32, offset: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !311, file: !310, line: 94, baseType: !214, size: 32, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !311, file: !310, line: 94, baseType: !214, size: 32, offset: 96)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !306, file: !234, line: 41, baseType: !309, size: 128, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "vert", scope: !306, file: !234, line: 42, baseType: !319, size: 128, offset: 256)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !310, line: 89, baseType: !320)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !310, line: 86, size: 128, elements: !321)
!321 = !{!322, !323, !324, !325}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !320, file: !310, line: 87, baseType: !227, size: 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !320, file: !310, line: 87, baseType: !227, size: 32, offset: 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !320, file: !310, line: 88, baseType: !227, size: 32, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !320, file: !310, line: 88, baseType: !227, size: 32, offset: 96)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "hor", scope: !306, file: !234, line: 42, baseType: !319, size: 128, offset: 384)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !306, file: !234, line: 43, baseType: !319, size: 128, offset: 512)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !306, file: !234, line: 45, baseType: !329, size: 64, offset: 640)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 64, elements: !330)
!330 = !{!331}
!331 = !DISubrange(count: 2)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !306, file: !234, line: 45, baseType: !329, size: 64, offset: 704)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "minzoom", scope: !306, file: !234, line: 46, baseType: !214, size: 32, offset: 768)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "maxzoom", scope: !306, file: !234, line: 46, baseType: !214, size: 32, offset: 800)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !306, file: !234, line: 48, baseType: !253, size: 16, offset: 832)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_ui", scope: !306, file: !234, line: 49, baseType: !253, size: 16, offset: 848)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "keeptot", scope: !306, file: !234, line: 51, baseType: !253, size: 16, offset: 864)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "keepzoom", scope: !306, file: !234, line: 52, baseType: !253, size: 16, offset: 880)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "keepofs", scope: !306, file: !234, line: 53, baseType: !253, size: 16, offset: 896)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !306, file: !234, line: 55, baseType: !253, size: 16, offset: 912)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !306, file: !234, line: 56, baseType: !253, size: 16, offset: 928)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !306, file: !234, line: 58, baseType: !253, size: 16, offset: 944)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !306, file: !234, line: 58, baseType: !253, size: 16, offset: 960)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "oldwinx", scope: !306, file: !234, line: 59, baseType: !253, size: 16, offset: 976)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "oldwiny", scope: !306, file: !234, line: 59, baseType: !253, size: 16, offset: 992)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !306, file: !234, line: 61, baseType: !253, size: 16, offset: 1008)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tab_offset", scope: !306, file: !234, line: 63, baseType: !348, size: 64, offset: 1024)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tab_num", scope: !306, file: !234, line: 64, baseType: !227, size: 32, offset: 1088)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tab_cur", scope: !306, file: !234, line: 65, baseType: !227, size: 32, offset: 1120)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "sms", scope: !306, file: !234, line: 68, baseType: !352, size: 64, offset: 1152)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmoothView2DStore", file: !234, line: 68, flags: DIFlagFwdDecl)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_timer", scope: !306, file: !234, line: 69, baseType: !232, size: 64, offset: 1216)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "winrct", scope: !299, file: !298, line: 234, baseType: !319, size: 128, offset: 1408)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "drawrct", scope: !299, file: !298, line: 235, baseType: !319, size: 128, offset: 1536)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !299, file: !298, line: 236, baseType: !253, size: 16, offset: 1664)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !299, file: !298, line: 236, baseType: !253, size: 16, offset: 1680)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "swinid", scope: !299, file: !298, line: 238, baseType: !253, size: 16, offset: 1696)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "regiontype", scope: !299, file: !298, line: 239, baseType: !253, size: 16, offset: 1712)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !299, file: !298, line: 240, baseType: !253, size: 16, offset: 1728)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !299, file: !298, line: 241, baseType: !253, size: 16, offset: 1744)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "fsize", scope: !299, file: !298, line: 243, baseType: !214, size: 32, offset: 1760)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !299, file: !298, line: 244, baseType: !253, size: 16, offset: 1792)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !299, file: !298, line: 244, baseType: !253, size: 16, offset: 1808)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw", scope: !299, file: !298, line: 246, baseType: !253, size: 16, offset: 1824)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw_overlay", scope: !299, file: !298, line: 247, baseType: !253, size: 16, offset: 1840)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !299, file: !298, line: 248, baseType: !253, size: 16, offset: 1856)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "overlap", scope: !299, file: !298, line: 249, baseType: !253, size: 16, offset: 1872)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "flagfullscreen", scope: !299, file: !298, line: 250, baseType: !253, size: 16, offset: 1888)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !299, file: !298, line: 251, baseType: !253, size: 16, offset: 1904)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !299, file: !298, line: 253, baseType: !373, size: 64, offset: 1920)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DICompositeType(tag: DW_TAG_structure_type, name: "ARegionType", file: !298, line: 42, flags: DIFlagFwdDecl)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "uiblocks", scope: !299, file: !298, line: 255, baseType: !220, size: 128, offset: 1984)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "panels", scope: !299, file: !298, line: 256, baseType: !220, size: 128, offset: 2112)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "panels_category_active", scope: !299, file: !298, line: 257, baseType: !220, size: 128, offset: 2240)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ui_lists", scope: !299, file: !298, line: 258, baseType: !220, size: 128, offset: 2368)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ui_previews", scope: !299, file: !298, line: 259, baseType: !220, size: 128, offset: 2496)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !299, file: !298, line: 260, baseType: !220, size: 128, offset: 2624)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "panels_category", scope: !299, file: !298, line: 261, baseType: !220, size: 128, offset: 2752)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "regiontimer", scope: !299, file: !298, line: 263, baseType: !232, size: 64, offset: 2880)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "headerstr", scope: !299, file: !298, line: 265, baseType: !384, size: 64, offset: 2944)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "regiondata", scope: !299, file: !298, line: 266, baseType: !213, size: 64, offset: 3008)
!386 = !{}
!387 = !DILocalVariable(name: "sinfo", arg: 1, scope: !292, file: !1, line: 270, type: !295)
!388 = !DILocation(line: 270, column: 40, scope: !292)
!389 = !DILocalVariable(name: "ar", arg: 2, scope: !292, file: !1, line: 270, type: !296)
!390 = !DILocation(line: 270, column: 56, scope: !292)
!391 = !DILocalVariable(name: "reports", arg: 3, scope: !292, file: !1, line: 270, type: !215)
!392 = !DILocation(line: 270, column: 72, scope: !292)
!393 = !DILocalVariable(name: "mouse_y", arg: 4, scope: !292, file: !1, line: 270, type: !227)
!394 = !DILocation(line: 270, column: 85, scope: !292)
!395 = !DILocalVariable(name: "mouse_pick", scope: !292, file: !1, line: 272, type: !213)
!396 = !DILocation(line: 272, column: 8, scope: !292)
!397 = !DILocalVariable(name: "mval", scope: !292, file: !1, line: 273, type: !398)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !227, size: 64, elements: !330)
!399 = !DILocation(line: 273, column: 6, scope: !292)
!400 = !DILocation(line: 275, column: 2, scope: !292)
!401 = !DILocation(line: 275, column: 10, scope: !292)
!402 = !DILocation(line: 276, column: 12, scope: !292)
!403 = !DILocation(line: 276, column: 2, scope: !292)
!404 = !DILocation(line: 276, column: 10, scope: !292)
!405 = !DILocation(line: 278, column: 31, scope: !292)
!406 = !DILocation(line: 278, column: 38, scope: !292)
!407 = !DILocation(line: 278, column: 42, scope: !292)
!408 = !DILocation(line: 278, column: 54, scope: !292)
!409 = !DILocation(line: 278, column: 2, scope: !292)
!410 = !DILocation(line: 279, column: 17, scope: !292)
!411 = !DILocation(line: 279, column: 2, scope: !292)
!412 = distinct !DISubprogram(name: "info_textview_main__internal", scope: !1, file: !1, line: 238, type: !413, scopeLine: 240, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !386)
!413 = !DISubroutineType(types: !414)
!414 = !{!227, !295, !296, !215, !227, !415, !416, !415}
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!417 = !DILocalVariable(name: "sinfo", arg: 1, scope: !412, file: !1, line: 238, type: !295)
!418 = !DILocation(line: 238, column: 59, scope: !412)
!419 = !DILocalVariable(name: "ar", arg: 2, scope: !412, file: !1, line: 238, type: !296)
!420 = !DILocation(line: 238, column: 75, scope: !412)
!421 = !DILocalVariable(name: "reports", arg: 3, scope: !412, file: !1, line: 238, type: !215)
!422 = !DILocation(line: 238, column: 91, scope: !412)
!423 = !DILocalVariable(name: "draw", arg: 4, scope: !412, file: !1, line: 239, type: !227)
!424 = !DILocation(line: 239, column: 45, scope: !412)
!425 = !DILocalVariable(name: "mval", arg: 5, scope: !412, file: !1, line: 239, type: !415)
!426 = !DILocation(line: 239, column: 55, scope: !412)
!427 = !DILocalVariable(name: "mouse_pick", arg: 6, scope: !412, file: !1, line: 239, type: !416)
!428 = !DILocation(line: 239, column: 71, scope: !412)
!429 = !DILocalVariable(name: "pos_pick", arg: 7, scope: !412, file: !1, line: 239, type: !415)
!430 = !DILocation(line: 239, column: 88, scope: !412)
!431 = !DILocalVariable(name: "ret", scope: !412, file: !1, line: 241, type: !227)
!432 = !DILocation(line: 241, column: 6, scope: !412)
!433 = !DILocalVariable(name: "v2d", scope: !412, file: !1, line: 243, type: !434)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!435 = !DILocation(line: 243, column: 10, scope: !412)
!436 = !DILocation(line: 243, column: 17, scope: !412)
!437 = !DILocation(line: 243, column: 21, scope: !412)
!438 = !DILocalVariable(name: "tvc", scope: !412, file: !1, line: 245, type: !439)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "TextViewContext", file: !440, line: 58, baseType: !441)
!440 = !DIFile(filename: "blender/source/blender/editors/space_info/../space_info/textview.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TextViewContext", file: !440, line: 30, size: 960, elements: !442)
!442 = !{!443, !444, !445, !446, !447, !448, !449, !450, !451, !456, !460, !461, !462, !463, !468, !474, !478, !479, !480, !481, !482}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "lheight", scope: !441, file: !440, line: 31, baseType: !227, size: 32)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "sel_start", scope: !441, file: !440, line: 32, baseType: !227, size: 32, offset: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "sel_end", scope: !441, file: !440, line: 32, baseType: !227, size: 32, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "cwidth", scope: !441, file: !440, line: 35, baseType: !227, size: 32, offset: 96)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "console_width", scope: !441, file: !440, line: 36, baseType: !227, size: 32, offset: 128)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !441, file: !440, line: 38, baseType: !227, size: 32, offset: 160)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !441, file: !440, line: 39, baseType: !227, size: 32, offset: 192)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !441, file: !440, line: 39, baseType: !227, size: 32, offset: 224)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !441, file: !440, line: 42, baseType: !452, size: 64, offset: 256)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DISubroutineType(types: !454)
!454 = !{!227, !455}
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !441, file: !440, line: 43, baseType: !457, size: 64, offset: 320)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{null, !455}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "arg1", scope: !441, file: !440, line: 44, baseType: !213, size: 64, offset: 384)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "arg2", scope: !441, file: !440, line: 45, baseType: !213, size: 64, offset: 448)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !441, file: !440, line: 48, baseType: !452, size: 64, offset: 512)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "line_get", scope: !441, file: !440, line: 49, baseType: !464, size: 64, offset: 576)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DISubroutineType(types: !466)
!466 = !{!227, !455, !467, !415}
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "line_color", scope: !441, file: !440, line: 50, baseType: !469, size: 64, offset: 640)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DISubroutineType(types: !471)
!471 = !{!227, !455, !472, !472}
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "const_colors", scope: !441, file: !440, line: 51, baseType: !475, size: 64, offset: 704)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{null, !455, !472}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !441, file: !440, line: 52, baseType: !213, size: 64, offset: 768)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "iter_index", scope: !441, file: !440, line: 53, baseType: !227, size: 32, offset: 832)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "iter_char", scope: !441, file: !440, line: 54, baseType: !227, size: 32, offset: 864)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "iter_char_next", scope: !441, file: !440, line: 55, baseType: !227, size: 32, offset: 896)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "iter_tmp", scope: !441, file: !440, line: 56, baseType: !227, size: 32, offset: 928)
!483 = !DILocation(line: 245, column: 18, scope: !412)
!484 = !DILocation(line: 246, column: 6, scope: !412)
!485 = !DILocation(line: 246, column: 12, scope: !412)
!486 = !DILocation(line: 247, column: 6, scope: !412)
!487 = !DILocation(line: 247, column: 10, scope: !412)
!488 = !DILocation(line: 249, column: 6, scope: !412)
!489 = !DILocation(line: 249, column: 11, scope: !412)
!490 = !DILocation(line: 250, column: 6, scope: !412)
!491 = !DILocation(line: 250, column: 15, scope: !412)
!492 = !DILocation(line: 251, column: 6, scope: !412)
!493 = !DILocation(line: 251, column: 17, scope: !412)
!494 = !DILocation(line: 252, column: 6, scope: !412)
!495 = !DILocation(line: 252, column: 19, scope: !412)
!496 = !DILocation(line: 254, column: 13, scope: !412)
!497 = !DILocation(line: 254, column: 6, scope: !412)
!498 = !DILocation(line: 254, column: 11, scope: !412)
!499 = !DILocation(line: 255, column: 13, scope: !412)
!500 = !DILocation(line: 255, column: 6, scope: !412)
!501 = !DILocation(line: 255, column: 11, scope: !412)
!502 = !DILocation(line: 258, column: 6, scope: !412)
!503 = !DILocation(line: 258, column: 16, scope: !412)
!504 = !DILocation(line: 259, column: 6, scope: !412)
!505 = !DILocation(line: 259, column: 14, scope: !412)
!506 = !DILocation(line: 260, column: 21, scope: !412)
!507 = !DILocation(line: 260, column: 19, scope: !412)
!508 = !DILocation(line: 260, column: 16, scope: !412)
!509 = !DILocation(line: 260, column: 6, scope: !412)
!510 = !DILocation(line: 260, column: 14, scope: !412)
!511 = !DILocation(line: 261, column: 13, scope: !412)
!512 = !DILocation(line: 261, column: 18, scope: !412)
!513 = !DILocation(line: 261, column: 22, scope: !412)
!514 = !DILocation(line: 261, column: 6, scope: !412)
!515 = !DILocation(line: 261, column: 11, scope: !412)
!516 = !DILocation(line: 262, column: 13, scope: !412)
!517 = !DILocation(line: 262, column: 18, scope: !412)
!518 = !DILocation(line: 262, column: 22, scope: !412)
!519 = !DILocation(line: 262, column: 6, scope: !412)
!520 = !DILocation(line: 262, column: 11, scope: !412)
!521 = !DILocation(line: 263, column: 13, scope: !412)
!522 = !DILocation(line: 263, column: 17, scope: !412)
!523 = !DILocation(line: 263, column: 24, scope: !412)
!524 = !DILocation(line: 263, column: 22, scope: !412)
!525 = !DILocation(line: 263, column: 6, scope: !412)
!526 = !DILocation(line: 263, column: 11, scope: !412)
!527 = !DILocation(line: 265, column: 28, scope: !412)
!528 = !DILocation(line: 265, column: 34, scope: !412)
!529 = !DILocation(line: 265, column: 40, scope: !412)
!530 = !DILocation(line: 265, column: 52, scope: !412)
!531 = !DILocation(line: 265, column: 8, scope: !412)
!532 = !DILocation(line: 265, column: 6, scope: !412)
!533 = !DILocation(line: 267, column: 9, scope: !412)
!534 = !DILocation(line: 267, column: 2, scope: !412)
!535 = distinct !DISubprogram(name: "info_textview_height", scope: !1, file: !1, line: 283, type: !536, scopeLine: 284, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !386)
!536 = !DISubroutineType(types: !537)
!537 = !{!227, !295, !296, !215}
!538 = !DILocalVariable(name: "sinfo", arg: 1, scope: !535, file: !1, line: 283, type: !295)
!539 = !DILocation(line: 283, column: 44, scope: !535)
!540 = !DILocalVariable(name: "ar", arg: 2, scope: !535, file: !1, line: 283, type: !296)
!541 = !DILocation(line: 283, column: 60, scope: !535)
!542 = !DILocalVariable(name: "reports", arg: 3, scope: !535, file: !1, line: 283, type: !215)
!543 = !DILocation(line: 283, column: 76, scope: !535)
!544 = !DILocalVariable(name: "mval", scope: !535, file: !1, line: 285, type: !398)
!545 = !DILocation(line: 285, column: 6, scope: !535)
!546 = !DILocation(line: 286, column: 38, scope: !535)
!547 = !DILocation(line: 286, column: 45, scope: !535)
!548 = !DILocation(line: 286, column: 49, scope: !535)
