; ModuleID = 'blender/source/blender/blenkernel/intern/smoke.c'
source_filename = "blender/source/blender/blenkernel/intern/smoke.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.WTURBULENCE = type opaque
%struct.FLUID_3D = type opaque
%struct.SmokeModifierData = type { %struct.ModifierData, %struct.SmokeDomainSettings*, %struct.SmokeFlowSettings*, %struct.SmokeCollSettings*, float, i32 }
%struct.ModifierData = type { %struct.ModifierData*, %struct.ModifierData*, i32, i32, i32, i32, [64 x i8], %struct.Scene*, i8* }
%struct.SmokeDomainSettings = type { %struct.SmokeModifierData*, %struct.FLUID_3D*, i8*, %struct.Group*, %struct.Group*, %struct.Group*, %struct.WTURBULENCE*, %struct.GPUTexture*, %struct.GPUTexture*, %struct.GPUTexture*, %struct.GPUTexture*, float*, [3 x float], [3 x float], [3 x float], [3 x float], [3 x float], [3 x float], [3 x i32], [3 x float], [3 x float], [4 x [4 x float]], [4 x [4 x float]], [3 x i32], [3 x i32], [3 x i32], [3 x i32], i32, float, float, i32, i32, float, float, float, i32, i32, i32, i32, i16, i16, i32, float, [3 x i32], float, i32, i32, [2 x %struct.PointCache*], [2 x %struct.ListBase], %struct.EffectorWeights*, i32, float, float, i32, [3 x float], i32, float, float, float, float, float, [3 x float] }
%struct.Group = type opaque
%struct.GPUTexture = type opaque

!88 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!89 = !DILocalVariable(name: "UNUSED_fluid", arg: 1, scope: !84, file: !1, line: 157, type: !79)
!90 = !DILocation(line: 157, column: 43, scope: !84)
!91 = !DILocation(line: 157, column: 60, scope: !84)
!92 = distinct !DISubprogram(name: "smoke_turbulence_free", scope: !1, file: !1, line: 158, type: !93, scopeLine: 158, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !62)
!93 = !DISubroutineType(types: !94)
!94 = !{null, !55}
!95 = !DILocalVariable(name: "UNUSED_wt", arg: 1, scope: !92, file: !1, line: 158, type: !55)
!96 = !DILocation(line: 158, column: 48, scope: !92)
!97 = !DILocation(line: 158, column: 61, scope: !92)
!98 = distinct !DISubprogram(name: "smoke_initWaveletBlenderRNA", scope: !1, file: !1, line: 159, type: !99, scopeLine: 159, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !62)
!99 = !DISubroutineType(types: !100)
!100 = !{null, !55, !87}
!101 = !DILocalVariable(name: "UNUSED_wt", arg: 1, scope: !98, file: !1, line: 159, type: !55)
!102 = !DILocation(line: 159, column: 54, scope: !98)
!103 = !DILocalVariable(name: "UNUSED_strength", arg: 2, scope: !98, file: !1, line: 159, type: !87)
!104 = !DILocation(line: 159, column: 73, scope: !98)
!105 = !DILocation(line: 159, column: 92, scope: !98)
!106 = distinct !DISubprogram(name: "smoke_initBlenderRNA", scope: !1, file: !1, line: 160, type: !107, scopeLine: 162, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !62)
!107 = !DISubroutineType(types: !108)
!108 = !{null, !79, !87, !87, !87, !87, !57, !87, !87, !87, !87, !87, !87}
!109 = !DILocalVariable(name: "UNUSED_fluid", arg: 1, scope: !106, file: !1, line: 160, type: !79)
!110 = !DILocation(line: 160, column: 44, scope: !106)
!111 = !DILocalVariable(name: "UNUSED_alpha", arg: 2, scope: !106, file: !1, line: 160, type: !87)
!112 = !DILocation(line: 160, column: 66, scope: !106)
!113 = !DILocalVariable(name: "UNUSED_beta", arg: 3, scope: !106, file: !1, line: 160, type: !87)
!114 = !DILocation(line: 160, column: 88, scope: !106)
!115 = !DILocalVariable(name: "UNUSED_dt_factor", arg: 4, scope: !106, file: !1, line: 160, type: !87)
!116 = !DILocation(line: 160, column: 109, scope: !106)
!117 = !DILocalVariable(name: "UNUSED_vorticity", arg: 5, scope: !106, file: !1, line: 160, type: !87)
!118 = !DILocation(line: 160, column: 135, scope: !106)
!119 = !DILocalVariable(name: "UNUSED_border_colli", arg: 6, scope: !106, file: !1, line: 161, type: !57)
!120 = !DILocation(line: 161, column: 32, scope: !106)
!121 = !DILocalVariable(name: "UNUSED_burning_rate", arg: 7, scope: !106, file: !1, line: 161, type: !87)
!122 = !DILocation(line: 161, column: 61, scope: !106)
!123 = !DILocalVariable(name: "UNUSED_flame_smoke", arg: 8, scope: !106, file: !1, line: 161, type: !87)
!124 = !DILocation(line: 161, column: 90, scope: !106)
!125 = !DILocalVariable(name: "UNUSED_flame_smoke_color", arg: 9, scope: !106, file: !1, line: 161, type: !87)
!126 = !DILocation(line: 161, column: 118, scope: !106)
!127 = !DILocalVariable(name: "UNUSED_flame_vorticity", arg: 10, scope: !106, file: !1, line: 162, type: !87)
!128 = !DILocation(line: 162, column: 34, scope: !106)
!129 = !DILocalVariable(name: "UNUSED_flame_ignition_temp", arg: 11, scope: !106, file: !1, line: 162, type: !87)
!130 = !DILocation(line: 162, column: 66, scope: !106)
!131 = !DILocalVariable(name: "UNUSED_flame_max_temp", arg: 12, scope: !106, file: !1, line: 162, type: !87)
!132 = !DILocation(line: 162, column: 102, scope: !106)
!133 = !DILocation(line: 162, column: 127, scope: !106)
!134 = distinct !DISubprogram(name: "smokeModifier_do", scope: !1, file: !1, line: 163, type: !135, scopeLine: 163, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !62)
!135 = !DISubroutineType(types: !136)
!136 = !{!137, !2803, !2919, !2921, !218, !985}
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !4, line: 178, size: 13504, elements: !139)
!139 = !{!140, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !199, !202, !204, !205, !207, !208, !213, !214, !220, !225, !226, !230, !231, !232, !233, !234, !251, !263, !277, !281, !285, !289, !298, !310, !314, !318, !322, !326, !330, !331, !332, !333, !334, !335, !339, !340, !341, !342, !346, !347, !348, !349, !350, !355, !356, !357, !358, !359, !363, !364, !365, !366, !367, !374, !387, !391, !397, !407, !413, !424, !431, !438, !442, !446, !450, !455, !456, !457, !2711, !2717, !2718, !2719, !2723, !2724, !2733, !2760, !2764, !2772, !2776, !2780, !2784, !2792, !2802}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !138, file: !4, line: 180, baseType: !141, size: 1600)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !142, line: 73, baseType: !143)
!142 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !142, line: 64, size: 1600, elements: !144)
!144 = !{!145, !163, !167, !168, !169, !170, !173}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !143, file: !142, line: 65, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !142, line: 53, baseType: !148)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !142, line: 42, size: 832, elements: !149)
!149 = !{!150, !151, !152, !153, !154, !155, !156, !157, !158, !162}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !148, file: !142, line: 43, baseType: !58, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !148, file: !142, line: 44, baseType: !58, size: 32, offset: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !148, file: !142, line: 45, baseType: !58, size: 32, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !148, file: !142, line: 46, baseType: !58, size: 32, offset: 96)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !148, file: !142, line: 47, baseType: !58, size: 32, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !148, file: !142, line: 48, baseType: !58, size: 32, offset: 160)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !148, file: !142, line: 49, baseType: !58, size: 32, offset: 192)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !148, file: !142, line: 50, baseType: !58, size: 32, offset: 224)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !148, file: !142, line: 51, baseType: !159, size: 512, offset: 256)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 512, elements: !160)
!160 = !{!161}
!161 = !DISubrange(count: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !148, file: !142, line: 52, baseType: !47, size: 64, offset: 768)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !143, file: !142, line: 66, baseType: !164, size: 1312, offset: 64)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 1312, elements: !165)
!165 = !{!166}
!166 = !DISubrange(count: 41)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !143, file: !142, line: 69, baseType: !58, size: 32, offset: 1376)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !143, file: !142, line: 69, baseType: !58, size: 32, offset: 1408)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !143, file: !142, line: 70, baseType: !58, size: 32, offset: 1440)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !143, file: !142, line: 71, baseType: !171, size: 64, offset: 1472)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !142, line: 71, flags: DIFlagFwdDecl)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !143, file: !142, line: 72, baseType: !174, size: 64, offset: 1536)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !142, line: 59, baseType: !176)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !142, line: 57, size: 8192, elements: !177)
!177 = !{!178}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !176, file: !142, line: 58, baseType: !179, size: 8192)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 8192, elements: !180)
!180 = !{!181}
!181 = !DISubrange(count: 1024)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !138, file: !4, line: 180, baseType: !141, size: 1600, offset: 1600)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !138, file: !4, line: 180, baseType: !141, size: 1600, offset: 3200)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !138, file: !4, line: 180, baseType: !141, size: 1600, offset: 4800)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !138, file: !4, line: 180, baseType: !141, size: 1600, offset: 6400)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !138, file: !4, line: 181, baseType: !58, size: 32, offset: 8000)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !138, file: !4, line: 181, baseType: !58, size: 32, offset: 8032)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !138, file: !4, line: 181, baseType: !58, size: 32, offset: 8064)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !138, file: !4, line: 181, baseType: !58, size: 32, offset: 8096)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !138, file: !4, line: 181, baseType: !58, size: 32, offset: 8128)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !138, file: !4, line: 182, baseType: !58, size: 32, offset: 8160)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !138, file: !4, line: 183, baseType: !58, size: 32, offset: 8192)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !138, file: !4, line: 184, baseType: !194, size: 64, offset: 8256)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !195, line: 124, baseType: !196)
!195 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !198, line: 118, flags: DIFlagFwdDecl)
!198 = !DIFile(filename: "blender/source/blender/blenlib/BLI_fileops.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!199 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !138, file: !4, line: 185, baseType: !200, size: 64, offset: 8320)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !4, line: 97, flags: DIFlagFwdDecl)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !138, file: !4, line: 186, baseType: !203, size: 32, offset: 8384)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !4, line: 132, baseType: !3)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !138, file: !4, line: 187, baseType: !88, size: 32, offset: 8416)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !138, file: !4, line: 188, baseType: !206, size: 32, offset: 8448)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !4, line: 175, baseType: !10)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !138, file: !4, line: 189, baseType: !58, size: 32, offset: 8480)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !138, file: !4, line: 190, baseType: !209, size: 64, offset: 8512)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !212, line: 46, flags: DIFlagFwdDecl)
!212 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!213 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !138, file: !4, line: 193, baseType: !61, size: 8, offset: 8576)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !138, file: !4, line: 196, baseType: !215, size: 64, offset: 8640)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{null, !218}
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !4, line: 177, baseType: !138)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !138, file: !4, line: 199, baseType: !221, size: 64, offset: 8704)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{null, !218, !224}
!224 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !88)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !138, file: !4, line: 202, baseType: !215, size: 64, offset: 8768)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !138, file: !4, line: 207, baseType: !227, size: 64, offset: 8832)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!58, !218}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !138, file: !4, line: 208, baseType: !227, size: 64, offset: 8896)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !138, file: !4, line: 209, baseType: !227, size: 64, offset: 8960)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !138, file: !4, line: 210, baseType: !227, size: 64, offset: 9024)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !138, file: !4, line: 211, baseType: !227, size: 64, offset: 9088)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !138, file: !4, line: 218, baseType: !235, size: 64, offset: 9152)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{null, !218, !58, !238}
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !240, line: 65, size: 160, elements: !241)
!240 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!241 = !{!242, !246, !249, !250}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !239, file: !240, line: 66, baseType: !243, size: 96)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 96, elements: !244)
!244 = !{!245}
!245 = !DISubrange(count: 3)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !239, file: !240, line: 67, baseType: !247, size: 48, offset: 96)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 48, elements: !244)
!248 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !239, file: !240, line: 68, baseType: !61, size: 8, offset: 144)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !239, file: !240, line: 68, baseType: !61, size: 8, offset: 152)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !138, file: !4, line: 219, baseType: !252, size: 64, offset: 9216)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DISubroutineType(types: !254)
!254 = !{null, !218, !58, !255}
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !240, line: 48, size: 96, elements: !257)
!257 = !{!258, !259, !260, !261, !262}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !256, file: !240, line: 49, baseType: !5, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !256, file: !240, line: 49, baseType: !5, size: 32, offset: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !256, file: !240, line: 50, baseType: !61, size: 8, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !256, file: !240, line: 50, baseType: !61, size: 8, offset: 72)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !256, file: !240, line: 51, baseType: !248, size: 16, offset: 80)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !138, file: !4, line: 220, baseType: !264, size: 64, offset: 9280)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{null, !218, !58, !267}
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !240, line: 42, size: 160, elements: !269)
!269 = !{!270, !271, !272, !273, !274, !275, !276}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !268, file: !240, line: 43, baseType: !5, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !268, file: !240, line: 43, baseType: !5, size: 32, offset: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !268, file: !240, line: 43, baseType: !5, size: 32, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !268, file: !240, line: 43, baseType: !5, size: 32, offset: 96)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !268, file: !240, line: 44, baseType: !248, size: 16, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !268, file: !240, line: 45, baseType: !61, size: 8, offset: 144)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !268, file: !240, line: 45, baseType: !61, size: 8, offset: 152)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !138, file: !4, line: 227, baseType: !278, size: 64, offset: 9344)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{!238, !218}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !138, file: !4, line: 228, baseType: !282, size: 64, offset: 9408)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!255, !218}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !138, file: !4, line: 229, baseType: !286, size: 64, offset: 9472)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{!267, !218}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !138, file: !4, line: 230, baseType: !290, size: 64, offset: 9536)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DISubroutineType(types: !292)
!292 = !{!293, !218}
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !240, line: 88, size: 64, elements: !295)
!295 = !{!296, !297}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !294, file: !240, line: 89, baseType: !5, size: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !294, file: !240, line: 90, baseType: !5, size: 32, offset: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !138, file: !4, line: 231, baseType: !299, size: 64, offset: 9600)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{!302, !218}
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !240, line: 79, size: 96, elements: !304)
!304 = !{!305, !306, !307, !308, !309}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !303, file: !240, line: 81, baseType: !58, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !303, file: !240, line: 82, baseType: !58, size: 32, offset: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !303, file: !240, line: 83, baseType: !248, size: 16, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !303, file: !240, line: 84, baseType: !61, size: 8, offset: 80)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !303, file: !240, line: 84, baseType: !61, size: 8, offset: 88)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !138, file: !4, line: 236, baseType: !311, size: 64, offset: 9664)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{null, !218, !238}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !138, file: !4, line: 237, baseType: !315, size: 64, offset: 9728)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DISubroutineType(types: !317)
!317 = !{null, !218, !255}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !138, file: !4, line: 238, baseType: !319, size: 64, offset: 9792)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{null, !218, !267}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !138, file: !4, line: 239, baseType: !323, size: 64, offset: 9856)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{null, !218, !293}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !138, file: !4, line: 240, baseType: !327, size: 64, offset: 9920)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{null, !218, !302}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !138, file: !4, line: 245, baseType: !278, size: 64, offset: 9984)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !138, file: !4, line: 246, baseType: !282, size: 64, offset: 10048)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !138, file: !4, line: 247, baseType: !286, size: 64, offset: 10112)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !138, file: !4, line: 248, baseType: !290, size: 64, offset: 10176)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !138, file: !4, line: 249, baseType: !299, size: 64, offset: 10240)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !138, file: !4, line: 255, baseType: !336, size: 64, offset: 10304)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{!47, !218, !58, !58}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !138, file: !4, line: 256, baseType: !336, size: 64, offset: 10368)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !138, file: !4, line: 257, baseType: !336, size: 64, offset: 10432)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !138, file: !4, line: 258, baseType: !336, size: 64, offset: 10496)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !138, file: !4, line: 264, baseType: !343, size: 64, offset: 10560)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{!47, !218, !58}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !138, file: !4, line: 265, baseType: !343, size: 64, offset: 10624)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !138, file: !4, line: 266, baseType: !343, size: 64, offset: 10688)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !138, file: !4, line: 267, baseType: !343, size: 64, offset: 10752)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !138, file: !4, line: 268, baseType: !343, size: 64, offset: 10816)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataLayout", scope: !138, file: !4, line: 272, baseType: !351, size: 64, offset: 10880)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{!354, !218}
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataLayout", scope: !138, file: !4, line: 273, baseType: !351, size: 64, offset: 10944)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataLayout", scope: !138, file: !4, line: 274, baseType: !351, size: 64, offset: 11008)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataLayout", scope: !138, file: !4, line: 275, baseType: !351, size: 64, offset: 11072)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataLayout", scope: !138, file: !4, line: 276, baseType: !351, size: 64, offset: 11136)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromVertCData", scope: !138, file: !4, line: 279, baseType: !360, size: 64, offset: 11200)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{null, !218, !58, !354, !58}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromEdgeCData", scope: !138, file: !4, line: 280, baseType: !360, size: 64, offset: 11264)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromFaceCData", scope: !138, file: !4, line: 281, baseType: !360, size: 64, offset: 11328)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "getNumGrids", scope: !138, file: !4, line: 284, baseType: !227, size: 64, offset: 11392)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "getGridSize", scope: !138, file: !4, line: 285, baseType: !227, size: 64, offset: 11456)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "getGridData", scope: !138, file: !4, line: 286, baseType: !368, size: 64, offset: 11520)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DISubroutineType(types: !370)
!370 = !{!371, !218}
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !4, line: 82, flags: DIFlagFwdDecl)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "getGridAdjacency", scope: !138, file: !4, line: 287, baseType: !375, size: 64, offset: 11584)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{!378, !218}
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGridAdjacency", file: !4, line: 120, baseType: !380)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMGridAdjacency", file: !4, line: 117, size: 256, elements: !381)
!381 = !{!382, !386}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !380, file: !4, line: 118, baseType: !383, size: 128)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 128, elements: !384)
!384 = !{!385}
!385 = !DISubrange(count: 4)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !380, file: !4, line: 119, baseType: !383, size: 128, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "getGridOffset", scope: !138, file: !4, line: 288, baseType: !388, size: 64, offset: 11648)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{!57, !218}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "getGridKey", scope: !138, file: !4, line: 289, baseType: !392, size: 64, offset: 11712)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{null, !218, !395}
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGKey", file: !4, line: 83, flags: DIFlagFwdDecl)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "getGridFlagMats", scope: !138, file: !4, line: 290, baseType: !398, size: 64, offset: 11776)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DISubroutineType(types: !400)
!400 = !{!401, !218}
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFlagMat", file: !4, line: 126, baseType: !403)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMFlagMat", file: !4, line: 123, size: 32, elements: !404)
!404 = !{!405, !406}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !403, file: !4, line: 124, baseType: !248, size: 16)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !403, file: !4, line: 125, baseType: !61, size: 8, offset: 16)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "getGridHidden", scope: !138, file: !4, line: 291, baseType: !408, size: 64, offset: 11840)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{!411, !218}
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedVert", scope: !138, file: !4, line: 299, baseType: !414, size: 64, offset: 11904)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{null, !218, !417, !47, !423}
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{null, !47, !58, !420, !420, !421}
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !248)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMForeachFlag", file: !4, line: 162, baseType: !15)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedEdge", scope: !138, file: !4, line: 309, baseType: !425, size: 64, offset: 11968)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DISubroutineType(types: !427)
!427 = !{null, !218, !428, !47}
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{null, !47, !58, !420, !420}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedLoop", scope: !138, file: !4, line: 317, baseType: !432, size: 64, offset: 12032)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{null, !218, !435, !47, !423}
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{null, !47, !58, !58, !420, !420}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedFaceCenter", scope: !138, file: !4, line: 327, baseType: !439, size: 64, offset: 12096)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{null, !218, !428, !47, !423}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "getMinMax", scope: !138, file: !4, line: 337, baseType: !443, size: 64, offset: 12160)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DISubroutineType(types: !445)
!445 = !{null, !218, !87, !87}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCo", scope: !138, file: !4, line: 344, baseType: !447, size: 64, offset: 12224)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{null, !218, !58, !87}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCos", scope: !138, file: !4, line: 347, baseType: !451, size: 64, offset: 12288)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{null, !218, !454}
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "getVertNo", scope: !138, file: !4, line: 350, baseType: !447, size: 64, offset: 12352)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyNo", scope: !138, file: !4, line: 351, baseType: !447, size: 64, offset: 12416)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyMap", scope: !138, file: !4, line: 355, baseType: !458, size: 64, offset: 12480)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DISubroutineType(types: !460)
!460 = !{!461, !464, !218}
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !463)
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !4, line: 355, flags: DIFlagFwdDecl)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !466, line: 115, size: 11392, elements: !467)
!466 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!467 = !{!468, !530, !600, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !618, !628, !630, !631, !672, !673, !676, !677, !693, !694, !695, !696, !697, !698, !699, !700, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !714, !715, !716, !717, !718, !719, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !811, !812, !813, !814, !815, !816, !817, !818, !819, !1834, !2668, !2669, !2670, !2671, !2672, !2673, !2676, !2679, !2680, !2681, !2682, !2683, !2684, !2685, !2686, !2687, !2689, !2692, !2695, !2696, !2699, !2700}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !465, file: !466, line: 116, baseType: !469, size: 960)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !470, line: 130, baseType: !471)
!470 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !470, line: 117, size: 960, elements: !472)
!472 = !{!473, !474, !475, !477, !493, !497, !498, !499, !500, !501}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !471, file: !470, line: 118, baseType: !47, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !471, file: !470, line: 118, baseType: !47, size: 64, offset: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !471, file: !470, line: 119, baseType: !476, size: 64, offset: 128)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !471, file: !470, line: 120, baseType: !478, size: 64, offset: 192)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !470, line: 136, size: 17600, elements: !480)
!480 = !{!481, !482, !484, !487, !488, !489, !490}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !479, file: !470, line: 137, baseType: !469, size: 960)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !479, file: !470, line: 138, baseType: !483, size: 64, offset: 960)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !479, file: !470, line: 139, baseType: !485, size: 64, offset: 1024)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !470, line: 43, flags: DIFlagFwdDecl)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !479, file: !470, line: 140, baseType: !179, size: 8192, offset: 1088)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !479, file: !470, line: 141, baseType: !179, size: 8192, offset: 9280)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !479, file: !470, line: 148, baseType: !478, size: 64, offset: 17472)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !479, file: !470, line: 150, baseType: !491, size: 64, offset: 17536)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !470, line: 45, flags: DIFlagFwdDecl)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !471, file: !470, line: 121, baseType: !494, size: 528, offset: 256)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 528, elements: !495)
!495 = !{!496}
!496 = !DISubrange(count: 66)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !471, file: !470, line: 126, baseType: !248, size: 16, offset: 784)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !471, file: !470, line: 127, baseType: !58, size: 32, offset: 800)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !471, file: !470, line: 128, baseType: !58, size: 32, offset: 832)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !471, file: !470, line: 128, baseType: !58, size: 32, offset: 864)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !471, file: !470, line: 129, baseType: !502, size: 64, offset: 896)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !470, line: 75, baseType: !504)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !470, line: 62, size: 1024, elements: !505)
!505 = !{!506, !508, !509, !510, !511, !512, !513, !514, !528, !529}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !504, file: !470, line: 63, baseType: !507, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !504, file: !470, line: 63, baseType: !507, size: 64, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !504, file: !470, line: 64, baseType: !61, size: 8, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !504, file: !470, line: 64, baseType: !61, size: 8, offset: 136)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !504, file: !470, line: 65, baseType: !248, size: 16, offset: 144)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !504, file: !470, line: 66, baseType: !159, size: 512, offset: 160)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !504, file: !470, line: 67, baseType: !58, size: 32, offset: 672)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !504, file: !470, line: 69, baseType: !515, size: 256, offset: 704)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !470, line: 60, baseType: !516)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !470, line: 48, size: 256, elements: !517)
!517 = !{!518, !519, !526, !527}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !516, file: !470, line: 49, baseType: !47, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !516, file: !470, line: 58, baseType: !520, size: 128, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !521, line: 71, baseType: !522)
!521 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !521, line: 69, size: 128, elements: !523)
!523 = !{!524, !525}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !522, file: !521, line: 70, baseType: !47, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !522, file: !521, line: 70, baseType: !47, size: 64, offset: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !516, file: !470, line: 59, baseType: !58, size: 32, offset: 192)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !516, file: !470, line: 59, baseType: !58, size: 32, offset: 224)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !504, file: !470, line: 70, baseType: !58, size: 32, offset: 960)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !504, file: !470, line: 74, baseType: !58, size: 32, offset: 992)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !465, file: !466, line: 117, baseType: !531, size: 64, offset: 960)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !533, line: 838, size: 768, elements: !534)
!533 = !DIFile(filename: "blender/source/blender/makesdna/DNA_anim_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!534 = !{!535, !550, !551, !561, !562, !593, !594, !595, !596, !597, !598, !599}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !532, file: !533, line: 840, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !538, line: 499, baseType: !539)
!538 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !538, line: 486, size: 1600, elements: !540)
!540 = !{!541, !542, !543, !544, !545, !546, !547, !548, !549}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !539, file: !538, line: 487, baseType: !469, size: 960)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !539, file: !538, line: 489, baseType: !520, size: 128, offset: 960)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !539, file: !538, line: 490, baseType: !520, size: 128, offset: 1088)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !539, file: !538, line: 491, baseType: !520, size: 128, offset: 1216)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !539, file: !538, line: 492, baseType: !520, size: 128, offset: 1344)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !539, file: !538, line: 494, baseType: !58, size: 32, offset: 1472)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !539, file: !538, line: 495, baseType: !58, size: 32, offset: 1504)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !539, file: !538, line: 497, baseType: !58, size: 32, offset: 1536)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !539, file: !538, line: 498, baseType: !58, size: 32, offset: 1568)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !532, file: !533, line: 844, baseType: !536, size: 64, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !532, file: !533, line: 848, baseType: !552, size: 64, offset: 128)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !533, line: 549, baseType: !554)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !533, line: 544, size: 320, elements: !555)
!555 = !{!556, !558, !559, !560}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !554, file: !533, line: 545, baseType: !557, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !554, file: !533, line: 545, baseType: !557, size: 64, offset: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !554, file: !533, line: 547, baseType: !536, size: 64, offset: 128)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !554, file: !533, line: 548, baseType: !520, size: 128, offset: 192)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !532, file: !533, line: 851, baseType: !520, size: 128, offset: 192)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !532, file: !533, line: 853, baseType: !563, size: 64, offset: 320)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !533, line: 594, baseType: !565)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !533, line: 561, size: 1664, elements: !566)
!566 = !{!567, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !565, file: !533, line: 562, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !565, file: !533, line: 562, baseType: !568, size: 64, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !565, file: !533, line: 564, baseType: !520, size: 128, offset: 128)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !565, file: !533, line: 565, baseType: !536, size: 64, offset: 256)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !565, file: !533, line: 566, baseType: !552, size: 64, offset: 320)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !565, file: !533, line: 568, baseType: !520, size: 128, offset: 384)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !565, file: !533, line: 569, baseType: !520, size: 128, offset: 512)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !565, file: !533, line: 571, baseType: !159, size: 512, offset: 640)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !565, file: !533, line: 573, baseType: !88, size: 32, offset: 1152)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "strip_time", scope: !565, file: !533, line: 574, baseType: !88, size: 32, offset: 1184)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !565, file: !533, line: 576, baseType: !88, size: 32, offset: 1216)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !565, file: !533, line: 576, baseType: !88, size: 32, offset: 1248)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "actstart", scope: !565, file: !533, line: 577, baseType: !88, size: 32, offset: 1280)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "actend", scope: !565, file: !533, line: 577, baseType: !88, size: 32, offset: 1312)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !565, file: !533, line: 579, baseType: !88, size: 32, offset: 1344)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !565, file: !533, line: 580, baseType: !88, size: 32, offset: 1376)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !565, file: !533, line: 582, baseType: !88, size: 32, offset: 1408)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !565, file: !533, line: 582, baseType: !88, size: 32, offset: 1440)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "blendmode", scope: !565, file: !533, line: 583, baseType: !248, size: 16, offset: 1472)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "extendmode", scope: !565, file: !533, line: 585, baseType: !248, size: 16, offset: 1488)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !565, file: !533, line: 586, baseType: !248, size: 16, offset: 1504)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !565, file: !533, line: 588, baseType: !248, size: 16, offset: 1520)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handle", scope: !565, file: !533, line: 590, baseType: !47, size: 64, offset: 1536)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !565, file: !533, line: 592, baseType: !58, size: 32, offset: 1600)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !565, file: !533, line: 593, baseType: !58, size: 32, offset: 1632)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "drivers", scope: !532, file: !533, line: 858, baseType: !520, size: 128, offset: 384)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "overrides", scope: !532, file: !533, line: 859, baseType: !520, size: 128, offset: 512)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !532, file: !533, line: 862, baseType: !58, size: 32, offset: 640)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !532, file: !533, line: 863, baseType: !58, size: 32, offset: 672)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "act_blendmode", scope: !532, file: !533, line: 866, baseType: !248, size: 16, offset: 704)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "act_extendmode", scope: !532, file: !533, line: 867, baseType: !248, size: 16, offset: 720)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "act_influence", scope: !532, file: !533, line: 868, baseType: !88, size: 32, offset: 736)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !465, file: !466, line: 119, baseType: !601, size: 64, offset: 1024)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !466, line: 57, flags: DIFlagFwdDecl)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !465, file: !466, line: 121, baseType: !248, size: 16, offset: 1088)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !465, file: !466, line: 121, baseType: !248, size: 16, offset: 1104)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !465, file: !466, line: 122, baseType: !58, size: 32, offset: 1120)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !465, file: !466, line: 122, baseType: !58, size: 32, offset: 1152)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !465, file: !466, line: 122, baseType: !58, size: 32, offset: 1184)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !465, file: !466, line: 123, baseType: !159, size: 512, offset: 1216)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !465, file: !466, line: 124, baseType: !464, size: 64, offset: 1728)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !465, file: !466, line: 124, baseType: !464, size: 64, offset: 1792)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !465, file: !466, line: 127, baseType: !464, size: 64, offset: 1856)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !465, file: !466, line: 127, baseType: !464, size: 64, offset: 1920)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !465, file: !466, line: 127, baseType: !464, size: 64, offset: 1984)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !465, file: !466, line: 128, baseType: !615, size: 64, offset: 2048)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !617, line: 46, flags: DIFlagFwdDecl)
!617 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!618 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !465, file: !466, line: 130, baseType: !619, size: 64, offset: 2112)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !466, line: 97, size: 832, elements: !621)
!621 = !{!622, !626, !627}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !620, file: !466, line: 98, baseType: !623, size: 768)
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 768, elements: !624)
!624 = !{!625, !245}
!625 = !DISubrange(count: 8)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !620, file: !466, line: 99, baseType: !58, size: 32, offset: 768)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !620, file: !466, line: 99, baseType: !58, size: 32, offset: 800)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !465, file: !466, line: 131, baseType: !629, size: 64, offset: 2176)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !465, file: !466, line: 132, baseType: !629, size: 64, offset: 2240)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !465, file: !466, line: 133, baseType: !632, size: 64, offset: 2304)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !538, line: 334, size: 1728, elements: !634)
!634 = !{!635, !636, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !671}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !633, file: !538, line: 335, baseType: !520, size: 128)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !633, file: !538, line: 336, baseType: !637, size: 64, offset: 128)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !538, line: 47, flags: DIFlagFwdDecl)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !633, file: !538, line: 338, baseType: !248, size: 16, offset: 192)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !633, file: !538, line: 338, baseType: !248, size: 16, offset: 208)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !633, file: !538, line: 339, baseType: !5, size: 32, offset: 224)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !633, file: !538, line: 340, baseType: !58, size: 32, offset: 256)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !633, file: !538, line: 342, baseType: !88, size: 32, offset: 288)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !633, file: !538, line: 343, baseType: !243, size: 96, offset: 320)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !633, file: !538, line: 344, baseType: !243, size: 96, offset: 416)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !633, file: !538, line: 347, baseType: !520, size: 128, offset: 512)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !633, file: !538, line: 349, baseType: !58, size: 32, offset: 640)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !633, file: !538, line: 350, baseType: !58, size: 32, offset: 672)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !633, file: !538, line: 351, baseType: !47, size: 64, offset: 704)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !633, file: !538, line: 352, baseType: !47, size: 64, offset: 768)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !633, file: !538, line: 354, baseType: !652, size: 384, offset: 832)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !538, line: 116, baseType: !653)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !538, line: 94, size: 384, elements: !654)
!654 = !{!655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !653, file: !538, line: 96, baseType: !58, size: 32)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !653, file: !538, line: 96, baseType: !58, size: 32, offset: 32)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !653, file: !538, line: 97, baseType: !58, size: 32, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !653, file: !538, line: 97, baseType: !58, size: 32, offset: 96)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !653, file: !538, line: 99, baseType: !248, size: 16, offset: 128)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !653, file: !538, line: 100, baseType: !248, size: 16, offset: 144)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !653, file: !538, line: 102, baseType: !248, size: 16, offset: 160)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !653, file: !538, line: 105, baseType: !248, size: 16, offset: 176)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !653, file: !538, line: 108, baseType: !248, size: 16, offset: 192)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !653, file: !538, line: 109, baseType: !248, size: 16, offset: 208)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !653, file: !538, line: 111, baseType: !248, size: 16, offset: 224)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !653, file: !538, line: 112, baseType: !248, size: 16, offset: 240)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !653, file: !538, line: 114, baseType: !58, size: 32, offset: 256)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !653, file: !538, line: 114, baseType: !58, size: 32, offset: 288)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !653, file: !538, line: 115, baseType: !58, size: 32, offset: 320)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !653, file: !538, line: 115, baseType: !58, size: 32, offset: 352)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !633, file: !538, line: 355, baseType: !159, size: 512, offset: 1216)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !465, file: !466, line: 134, baseType: !47, size: 64, offset: 2368)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !465, file: !466, line: 136, baseType: !674, size: 64, offset: 2432)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !466, line: 58, flags: DIFlagFwdDecl)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !465, file: !466, line: 138, baseType: !652, size: 384, offset: 2496)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !465, file: !466, line: 139, baseType: !678, size: 64, offset: 2880)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !538, line: 80, baseType: !680)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !538, line: 72, size: 192, elements: !681)
!681 = !{!682, !689, !690, !691, !692}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !680, file: !538, line: 73, baseType: !683, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !538, line: 59, baseType: !685)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !538, line: 56, size: 128, elements: !686)
!686 = !{!687, !688}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !685, file: !538, line: 57, baseType: !243, size: 96)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !685, file: !538, line: 58, baseType: !58, size: 32, offset: 96)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !680, file: !538, line: 74, baseType: !58, size: 32, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !680, file: !538, line: 76, baseType: !58, size: 32, offset: 96)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !680, file: !538, line: 77, baseType: !58, size: 32, offset: 128)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !680, file: !538, line: 79, baseType: !58, size: 32, offset: 160)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !465, file: !466, line: 141, baseType: !520, size: 128, offset: 2944)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !465, file: !466, line: 142, baseType: !520, size: 128, offset: 3072)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !465, file: !466, line: 143, baseType: !520, size: 128, offset: 3200)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !465, file: !466, line: 144, baseType: !520, size: 128, offset: 3328)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !465, file: !466, line: 146, baseType: !58, size: 32, offset: 3456)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !465, file: !466, line: 147, baseType: !58, size: 32, offset: 3488)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !465, file: !466, line: 150, baseType: !209, size: 64, offset: 3520)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !465, file: !466, line: 151, baseType: !701, size: 64, offset: 3584)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !465, file: !466, line: 152, baseType: !58, size: 32, offset: 3648)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !465, file: !466, line: 153, baseType: !58, size: 32, offset: 3680)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !465, file: !466, line: 156, baseType: !243, size: 96, offset: 3712)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !465, file: !466, line: 156, baseType: !243, size: 96, offset: 3808)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !465, file: !466, line: 156, baseType: !243, size: 96, offset: 3904)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !465, file: !466, line: 157, baseType: !243, size: 96, offset: 4000)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !465, file: !466, line: 158, baseType: !243, size: 96, offset: 4096)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !465, file: !466, line: 159, baseType: !243, size: 96, offset: 4192)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !465, file: !466, line: 160, baseType: !243, size: 96, offset: 4288)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !465, file: !466, line: 160, baseType: !243, size: 96, offset: 4384)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !465, file: !466, line: 161, baseType: !713, size: 128, offset: 4480)
!713 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 128, elements: !384)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !465, file: !466, line: 161, baseType: !713, size: 128, offset: 4608)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !465, file: !466, line: 162, baseType: !243, size: 96, offset: 4736)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !465, file: !466, line: 162, baseType: !243, size: 96, offset: 4832)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !465, file: !466, line: 163, baseType: !88, size: 32, offset: 4928)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !465, file: !466, line: 163, baseType: !88, size: 32, offset: 4960)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !465, file: !466, line: 164, baseType: !720, size: 512, offset: 4992)
!720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 512, elements: !721)
!721 = !{!385, !385}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !465, file: !466, line: 165, baseType: !720, size: 512, offset: 5504)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !465, file: !466, line: 166, baseType: !720, size: 512, offset: 6016)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !465, file: !466, line: 167, baseType: !720, size: 512, offset: 6528)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !465, file: !466, line: 176, baseType: !720, size: 512, offset: 7040)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !465, file: !466, line: 178, baseType: !5, size: 32, offset: 7552)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !465, file: !466, line: 180, baseType: !248, size: 16, offset: 7584)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !465, file: !466, line: 181, baseType: !248, size: 16, offset: 7600)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !465, file: !466, line: 183, baseType: !248, size: 16, offset: 7616)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !465, file: !466, line: 183, baseType: !248, size: 16, offset: 7632)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !465, file: !466, line: 184, baseType: !248, size: 16, offset: 7648)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !465, file: !466, line: 184, baseType: !248, size: 16, offset: 7664)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !465, file: !466, line: 185, baseType: !248, size: 16, offset: 7680)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !465, file: !466, line: 186, baseType: !248, size: 16, offset: 7696)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !465, file: !466, line: 187, baseType: !248, size: 16, offset: 7712)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !465, file: !466, line: 188, baseType: !61, size: 8, offset: 7728)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !465, file: !466, line: 189, baseType: !61, size: 8, offset: 7736)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !465, file: !466, line: 192, baseType: !58, size: 32, offset: 7744)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !465, file: !466, line: 192, baseType: !58, size: 32, offset: 7776)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !465, file: !466, line: 192, baseType: !58, size: 32, offset: 7808)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !465, file: !466, line: 192, baseType: !58, size: 32, offset: 7840)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !465, file: !466, line: 194, baseType: !58, size: 32, offset: 7872)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !465, file: !466, line: 202, baseType: !88, size: 32, offset: 7904)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !465, file: !466, line: 202, baseType: !88, size: 32, offset: 7936)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !465, file: !466, line: 202, baseType: !88, size: 32, offset: 7968)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !465, file: !466, line: 211, baseType: !88, size: 32, offset: 8000)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !465, file: !466, line: 212, baseType: !88, size: 32, offset: 8032)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !465, file: !466, line: 213, baseType: !88, size: 32, offset: 8064)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !465, file: !466, line: 214, baseType: !88, size: 32, offset: 8096)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !465, file: !466, line: 215, baseType: !88, size: 32, offset: 8128)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !465, file: !466, line: 216, baseType: !88, size: 32, offset: 8160)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !465, file: !466, line: 219, baseType: !88, size: 32, offset: 8192)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !465, file: !466, line: 220, baseType: !88, size: 32, offset: 8224)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !465, file: !466, line: 221, baseType: !88, size: 32, offset: 8256)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !465, file: !466, line: 224, baseType: !756, size: 16, offset: 8288)
!756 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !465, file: !466, line: 224, baseType: !756, size: 16, offset: 8304)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !465, file: !466, line: 226, baseType: !248, size: 16, offset: 8320)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !465, file: !466, line: 228, baseType: !61, size: 8, offset: 8336)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !465, file: !466, line: 229, baseType: !61, size: 8, offset: 8344)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !465, file: !466, line: 231, baseType: !248, size: 16, offset: 8352)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !465, file: !466, line: 232, baseType: !61, size: 8, offset: 8368)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !465, file: !466, line: 233, baseType: !61, size: 8, offset: 8376)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !465, file: !466, line: 234, baseType: !88, size: 32, offset: 8384)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !465, file: !466, line: 235, baseType: !88, size: 32, offset: 8416)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !465, file: !466, line: 237, baseType: !520, size: 128, offset: 8448)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !465, file: !466, line: 238, baseType: !520, size: 128, offset: 8576)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !465, file: !466, line: 239, baseType: !520, size: 128, offset: 8704)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !465, file: !466, line: 240, baseType: !520, size: 128, offset: 8832)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !465, file: !466, line: 242, baseType: !88, size: 32, offset: 8960)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !465, file: !466, line: 244, baseType: !248, size: 16, offset: 8992)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !465, file: !466, line: 245, baseType: !756, size: 16, offset: 9008)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !465, file: !466, line: 246, baseType: !713, size: 128, offset: 9024)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !465, file: !466, line: 248, baseType: !58, size: 32, offset: 9152)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !465, file: !466, line: 249, baseType: !58, size: 32, offset: 9184)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !465, file: !466, line: 251, baseType: !777, size: 64, offset: 9216)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !779, line: 215, size: 960, elements: !780)
!779 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_force.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!780 = !{!781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !778, file: !779, line: 216, baseType: !58, size: 32)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "linStiff", scope: !778, file: !779, line: 217, baseType: !88, size: 32, offset: 32)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "angStiff", scope: !778, file: !779, line: 218, baseType: !88, size: 32, offset: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !778, file: !779, line: 219, baseType: !88, size: 32, offset: 96)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "viterations", scope: !778, file: !779, line: 221, baseType: !58, size: 32, offset: 128)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "piterations", scope: !778, file: !779, line: 222, baseType: !58, size: 32, offset: 160)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "diterations", scope: !778, file: !779, line: 223, baseType: !58, size: 32, offset: 192)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "citerations", scope: !778, file: !779, line: 224, baseType: !58, size: 32, offset: 224)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "kSRHR_CL", scope: !778, file: !779, line: 226, baseType: !88, size: 32, offset: 256)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "kSKHR_CL", scope: !778, file: !779, line: 227, baseType: !88, size: 32, offset: 288)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "kSSHR_CL", scope: !778, file: !779, line: 228, baseType: !88, size: 32, offset: 320)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "kSR_SPLT_CL", scope: !778, file: !779, line: 229, baseType: !88, size: 32, offset: 352)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "kSK_SPLT_CL", scope: !778, file: !779, line: 231, baseType: !88, size: 32, offset: 384)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "kSS_SPLT_CL", scope: !778, file: !779, line: 232, baseType: !88, size: 32, offset: 416)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "kVCF", scope: !778, file: !779, line: 233, baseType: !88, size: 32, offset: 448)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "kDP", scope: !778, file: !779, line: 234, baseType: !88, size: 32, offset: 480)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "kDG", scope: !778, file: !779, line: 236, baseType: !88, size: 32, offset: 512)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "kLF", scope: !778, file: !779, line: 237, baseType: !88, size: 32, offset: 544)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "kPR", scope: !778, file: !779, line: 238, baseType: !88, size: 32, offset: 576)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "kVC", scope: !778, file: !779, line: 239, baseType: !88, size: 32, offset: 608)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "kDF", scope: !778, file: !779, line: 241, baseType: !88, size: 32, offset: 640)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "kMT", scope: !778, file: !779, line: 242, baseType: !88, size: 32, offset: 672)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "kCHR", scope: !778, file: !779, line: 243, baseType: !88, size: 32, offset: 704)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "kKHR", scope: !778, file: !779, line: 244, baseType: !88, size: 32, offset: 736)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "kSHR", scope: !778, file: !779, line: 246, baseType: !88, size: 32, offset: 768)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "kAHR", scope: !778, file: !779, line: 247, baseType: !88, size: 32, offset: 800)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "collisionflags", scope: !778, file: !779, line: 248, baseType: !58, size: 32, offset: 832)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "numclusteriterations", scope: !778, file: !779, line: 249, baseType: !58, size: 32, offset: 864)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "welding", scope: !778, file: !779, line: 250, baseType: !88, size: 32, offset: 896)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !778, file: !779, line: 251, baseType: !88, size: 32, offset: 928)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !465, file: !466, line: 253, baseType: !61, size: 8, offset: 9280)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !465, file: !466, line: 254, baseType: !61, size: 8, offset: 9288)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !465, file: !466, line: 255, baseType: !248, size: 16, offset: 9296)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !465, file: !466, line: 256, baseType: !243, size: 96, offset: 9312)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !465, file: !466, line: 258, baseType: !520, size: 128, offset: 9408)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !465, file: !466, line: 259, baseType: !520, size: 128, offset: 9536)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !465, file: !466, line: 260, baseType: !520, size: 128, offset: 9664)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !465, file: !466, line: 261, baseType: !520, size: 128, offset: 9792)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !465, file: !466, line: 263, baseType: !820, size: 64, offset: 9920)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !779, line: 61, size: 1280, elements: !822)
!822 = !{!823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !1827, !1831, !1832, !1833}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !821, file: !779, line: 62, baseType: !58, size: 32)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "deflect", scope: !821, file: !779, line: 63, baseType: !248, size: 16, offset: 32)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "forcefield", scope: !821, file: !779, line: 64, baseType: !248, size: 16, offset: 48)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "falloff", scope: !821, file: !779, line: 65, baseType: !248, size: 16, offset: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !821, file: !779, line: 66, baseType: !248, size: 16, offset: 80)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "tex_mode", scope: !821, file: !779, line: 67, baseType: !248, size: 16, offset: 96)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "kink", scope: !821, file: !779, line: 68, baseType: !248, size: 16, offset: 112)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "kink_axis", scope: !821, file: !779, line: 68, baseType: !248, size: 16, offset: 128)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "zdir", scope: !821, file: !779, line: 69, baseType: !248, size: 16, offset: 144)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "f_strength", scope: !821, file: !779, line: 72, baseType: !88, size: 32, offset: 160)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "f_damp", scope: !821, file: !779, line: 73, baseType: !88, size: 32, offset: 192)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "f_flow", scope: !821, file: !779, line: 74, baseType: !88, size: 32, offset: 224)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "f_size", scope: !821, file: !779, line: 77, baseType: !88, size: 32, offset: 256)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "f_power", scope: !821, file: !779, line: 80, baseType: !88, size: 32, offset: 288)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "maxdist", scope: !821, file: !779, line: 81, baseType: !88, size: 32, offset: 320)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "mindist", scope: !821, file: !779, line: 82, baseType: !88, size: 32, offset: 352)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "f_power_r", scope: !821, file: !779, line: 83, baseType: !88, size: 32, offset: 384)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "maxrad", scope: !821, file: !779, line: 84, baseType: !88, size: 32, offset: 416)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "minrad", scope: !821, file: !779, line: 85, baseType: !88, size: 32, offset: 448)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_damp", scope: !821, file: !779, line: 88, baseType: !88, size: 32, offset: 480)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_rdamp", scope: !821, file: !779, line: 89, baseType: !88, size: 32, offset: 512)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_perm", scope: !821, file: !779, line: 90, baseType: !88, size: 32, offset: 544)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_frict", scope: !821, file: !779, line: 91, baseType: !88, size: 32, offset: 576)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_rfrict", scope: !821, file: !779, line: 92, baseType: !88, size: 32, offset: 608)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_stickness", scope: !821, file: !779, line: 93, baseType: !88, size: 32, offset: 640)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "absorption", scope: !821, file: !779, line: 95, baseType: !88, size: 32, offset: 672)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_sbdamp", scope: !821, file: !779, line: 98, baseType: !88, size: 32, offset: 704)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_sbift", scope: !821, file: !779, line: 99, baseType: !88, size: 32, offset: 736)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_sboft", scope: !821, file: !779, line: 100, baseType: !88, size: 32, offset: 768)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "clump_fac", scope: !821, file: !779, line: 103, baseType: !88, size: 32, offset: 800)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "clump_pow", scope: !821, file: !779, line: 103, baseType: !88, size: 32, offset: 832)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "kink_freq", scope: !821, file: !779, line: 104, baseType: !88, size: 32, offset: 864)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "kink_shape", scope: !821, file: !779, line: 104, baseType: !88, size: 32, offset: 896)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "kink_amp", scope: !821, file: !779, line: 104, baseType: !88, size: 32, offset: 928)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "free_end", scope: !821, file: !779, line: 104, baseType: !88, size: 32, offset: 960)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "tex_nabla", scope: !821, file: !779, line: 107, baseType: !88, size: 32, offset: 992)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !821, file: !779, line: 108, baseType: !860, size: 64, offset: 1024)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !617, line: 202, size: 3328, elements: !862)
!862 = !{!863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !1717, !1718, !1719, !1720, !1741, !1767, !1768, !1797, !1817, !1825, !1826}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !861, file: !617, line: 203, baseType: !469, size: 960)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !861, file: !617, line: 204, baseType: !531, size: 64, offset: 960)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !861, file: !617, line: 206, baseType: !88, size: 32, offset: 1024)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !861, file: !617, line: 206, baseType: !88, size: 32, offset: 1056)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !861, file: !617, line: 207, baseType: !88, size: 32, offset: 1088)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !861, file: !617, line: 207, baseType: !88, size: 32, offset: 1120)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !861, file: !617, line: 207, baseType: !88, size: 32, offset: 1152)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !861, file: !617, line: 207, baseType: !88, size: 32, offset: 1184)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !861, file: !617, line: 207, baseType: !88, size: 32, offset: 1216)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !861, file: !617, line: 207, baseType: !88, size: 32, offset: 1248)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !861, file: !617, line: 208, baseType: !88, size: 32, offset: 1280)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !861, file: !617, line: 208, baseType: !88, size: 32, offset: 1312)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !861, file: !617, line: 211, baseType: !88, size: 32, offset: 1344)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !861, file: !617, line: 211, baseType: !88, size: 32, offset: 1376)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !861, file: !617, line: 211, baseType: !88, size: 32, offset: 1408)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !861, file: !617, line: 211, baseType: !88, size: 32, offset: 1440)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !861, file: !617, line: 211, baseType: !88, size: 32, offset: 1472)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !861, file: !617, line: 214, baseType: !88, size: 32, offset: 1504)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !861, file: !617, line: 214, baseType: !88, size: 32, offset: 1536)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !861, file: !617, line: 217, baseType: !88, size: 32, offset: 1568)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !861, file: !617, line: 218, baseType: !88, size: 32, offset: 1600)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !861, file: !617, line: 219, baseType: !88, size: 32, offset: 1632)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !861, file: !617, line: 220, baseType: !88, size: 32, offset: 1664)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !861, file: !617, line: 221, baseType: !88, size: 32, offset: 1696)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !861, file: !617, line: 222, baseType: !248, size: 16, offset: 1728)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !861, file: !617, line: 222, baseType: !248, size: 16, offset: 1744)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !861, file: !617, line: 224, baseType: !248, size: 16, offset: 1760)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !861, file: !617, line: 224, baseType: !248, size: 16, offset: 1776)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !861, file: !617, line: 227, baseType: !248, size: 16, offset: 1792)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !861, file: !617, line: 227, baseType: !248, size: 16, offset: 1808)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !861, file: !617, line: 229, baseType: !248, size: 16, offset: 1824)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !861, file: !617, line: 229, baseType: !248, size: 16, offset: 1840)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !861, file: !617, line: 230, baseType: !248, size: 16, offset: 1856)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !861, file: !617, line: 230, baseType: !248, size: 16, offset: 1872)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !861, file: !617, line: 232, baseType: !88, size: 32, offset: 1888)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !861, file: !617, line: 232, baseType: !88, size: 32, offset: 1920)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !861, file: !617, line: 232, baseType: !88, size: 32, offset: 1952)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !861, file: !617, line: 232, baseType: !88, size: 32, offset: 1984)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !861, file: !617, line: 233, baseType: !58, size: 32, offset: 2016)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !861, file: !617, line: 234, baseType: !58, size: 32, offset: 2048)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !861, file: !617, line: 235, baseType: !248, size: 16, offset: 2080)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !861, file: !617, line: 235, baseType: !248, size: 16, offset: 2096)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !861, file: !617, line: 236, baseType: !248, size: 16, offset: 2112)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !861, file: !617, line: 239, baseType: !248, size: 16, offset: 2128)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !861, file: !617, line: 240, baseType: !58, size: 32, offset: 2144)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !861, file: !617, line: 241, baseType: !58, size: 32, offset: 2176)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !861, file: !617, line: 241, baseType: !58, size: 32, offset: 2208)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !861, file: !617, line: 241, baseType: !58, size: 32, offset: 2240)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !861, file: !617, line: 243, baseType: !88, size: 32, offset: 2272)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !861, file: !617, line: 243, baseType: !88, size: 32, offset: 2304)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !861, file: !617, line: 244, baseType: !88, size: 32, offset: 2336)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !861, file: !617, line: 246, baseType: !915, size: 320, offset: 2368)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !916, line: 50, size: 320, elements: !917)
!916 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!917 = !{!918, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !915, file: !916, line: 51, baseType: !919, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !921, line: 1216, size: 39680, elements: !922)
!921 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!922 = !{!923, !924, !925, !926, !929, !930, !931, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !957, !960, !963, !1270, !1273, !1572, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1594, !1595, !1596, !1597, !1598, !1606, !1672, !1679, !1680, !1687, !1691, !1697, !1698, !1699, !1700, !1701}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !920, file: !921, line: 1217, baseType: !469, size: 960)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !920, file: !921, line: 1218, baseType: !531, size: 64, offset: 960)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !920, file: !921, line: 1220, baseType: !464, size: 64, offset: 1024)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !920, file: !921, line: 1221, baseType: !927, size: 64, offset: 1088)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !921, line: 52, flags: DIFlagFwdDecl)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !920, file: !921, line: 1223, baseType: !919, size: 64, offset: 1152)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !920, file: !921, line: 1225, baseType: !520, size: 128, offset: 1216)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !920, file: !921, line: 1226, baseType: !932, size: 64, offset: 1344)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !921, line: 69, size: 320, elements: !934)
!934 = !{!935, !936, !937, !938, !939, !940, !941, !942}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !933, file: !921, line: 70, baseType: !932, size: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !933, file: !921, line: 70, baseType: !932, size: 64, offset: 64)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !933, file: !921, line: 71, baseType: !5, size: 32, offset: 128)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !933, file: !921, line: 71, baseType: !5, size: 32, offset: 160)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !933, file: !921, line: 72, baseType: !58, size: 32, offset: 192)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !933, file: !921, line: 73, baseType: !248, size: 16, offset: 224)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !933, file: !921, line: 73, baseType: !248, size: 16, offset: 240)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !933, file: !921, line: 74, baseType: !464, size: 64, offset: 256)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !920, file: !921, line: 1227, baseType: !464, size: 64, offset: 1408)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !920, file: !921, line: 1229, baseType: !243, size: 96, offset: 1472)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !920, file: !921, line: 1230, baseType: !243, size: 96, offset: 1568)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !920, file: !921, line: 1231, baseType: !243, size: 96, offset: 1664)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !920, file: !921, line: 1231, baseType: !243, size: 96, offset: 1760)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !920, file: !921, line: 1233, baseType: !5, size: 32, offset: 1856)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !920, file: !921, line: 1234, baseType: !58, size: 32, offset: 1888)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !920, file: !921, line: 1235, baseType: !5, size: 32, offset: 1920)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !920, file: !921, line: 1237, baseType: !248, size: 16, offset: 1952)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !920, file: !921, line: 1239, baseType: !61, size: 8, offset: 1968)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !920, file: !921, line: 1240, baseType: !954, size: 8, offset: 1976)
!954 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 8, elements: !955)
!955 = !{!956}
!956 = !DISubrange(count: 1)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !920, file: !921, line: 1242, baseType: !958, size: 64, offset: 1984)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !617, line: 248, flags: DIFlagFwdDecl)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !920, file: !921, line: 1244, baseType: !961, size: 64, offset: 2048)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !921, line: 59, flags: DIFlagFwdDecl)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !920, file: !921, line: 1246, baseType: !964, size: 64, offset: 2112)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !921, line: 1067, size: 5184, elements: !966)
